{"user_rating": 3.5, "review_count": 42, "name": "Marine House", "reviews": [{"rating": 5.0, "title": "GORGEOUS", "text": "This B&B is the best by far that I stayed in while traveling in Ireland. The hostess pleasantly accepted our late arrival and we were shown to an enormous room fit for a queen. The location is prime--right in the midst of the University area. If you are in Belfast--The Marine House is THE place to stay!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 13, 2003", "id": 1484984}, {"rating": 5.0, "title": "Recommended Bed and Breakfast in Belfast", "text": "I have had the pleasure to stay at Marine House on several occasions, even taking my parents there on our trip to Ireland. The staff is wonderful and the accommodations are great. I look forward to my visits to Northern Ireland even more because I know I can feel comfortable here at Marine House. For those doing Family History research, the location is perfect, halfway between the Public Record Office of Northern Ireland and the downtown area of Belfast with several research centers.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 4, 2002", "id": 693781}, {"rating": 1.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Has the Marine Lodge changed owners since the last review was posted? The landlady was the rudest person I have ever given money to. Clearly she doesnt want unmarried couples in her establishment as she made quite clear on the dirty looks she gave myself and my fiance. We arrived as 3 guys and 1 girl but put the boys in a double room and us in a twin????? Although the room was clean (I'll give her that much) it was archaic and basic and to be honest reminded me of my student days.", "title": "Still pains us to think about it", "helpfulness": 8, "user": "Howser1", "date": "June 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5410490}, {"rating": 4.0, "title": "Lovely and Gorgeous.....", "text": "The shower was a trickle and there was enough toilet paper for one visit. Great!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4539877}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "The beds were not solid and tiny. The cost was £60 per night and it still upsets us to think about it. The Hilton was roughly the same price but as we were part of a booked group we had to stay here.", "title": "Okay as change from overpriced hotels", "helpfulness": 8, "user": "Mahler", "date": "August 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3834808}, {"rating": 5.0, "stay_parameters": "Stayed May 2004, traveled on business", "text": "We asked for an iron but were not allowed to bring it to the room and had to iron in the hallway.", "title": "Marine House is Home Away From Home!", "helpfulness": 10, "user": "DDSB", "date": "April 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3389710}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Breakfast never materialised for us as we were never ready for it. It ended at 9. One of the guys who tried to get breakfast at 9 was pretty much told that there was a shop down the road. The landlady informed the guys that they had better be quiet coming in later on. Lovely for them to be branded as thugs having done nothing to deserve that. The accomodation is described as luxury but I think a dictionary would be a great thing for the landlady to invest her easily gained money in. Read the definition. Luxury it ain't!! Stay elsewhere........", "title": "Not even one minor complaint!!!", "helpfulness": 9, "user": "Paul4As", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3326727}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I had a horrible experience at this b&b. I was booked in for two nights. The room was not up to standard at all and the owner of the b&b was rude from the offset. On the second day I received a phone call that I couldn't stay for another night and to get my stuff out of the room, which I couldnt do because I was in work. I arrived to pick up my stuff and the cleaner had literally stuffed my belongings in my suitcase (bursting my shampoo bottle) and had thrown it by the front door. The horrible old man charged a fortune and when I asked him if he realised the room was indeed booked for two nights he asked me to leave!! I have never met such a rude old man in my life-why on earth is he running a guesthouse? Don't stay here-the All Seasons guesthouse is far better and the owner couldn't be more helpful", "title": "Rude old man", "helpfulness": 2, "user": "ams8", "date": "March 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14001694, "likes": {"liked": "— the rude owner"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The guest house was clean and tidy but really smelt of eggs. I thought this might be because the owner was having tea when we arrived but when we came back at two in the morning the whole house/room still smelt! The room/bathroom that I stayed in could have done with a bit of an update but was very clean and tidy which was the main thing. The owner could do with a few lessons on how to speak to people over the phone as he came over a bit abrupt but was nice in person.", "title": "Average", "user": "Hett", "date": "January 21, 2008", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 12840471, "likes": {"liked": "— Clean & tidy", "disliked": "— smell"}}, {"rating": 1.0, "title": "Horrible Old Man", "text": "I stayed in this GuestHouse for one night even though i was booked in for 8 weeks. I only stayed one night because the Old man that owns the place extremely rudely asked me to leave the room at 11 o'clock at night because and i quote he 'couldn't be bothered with the paper work' for my company to pay him directly for my stay. so i packed my things the next morning and went to the All Seasons B&B which is only 5 minutes from this ridiculous excuse for a B&B and stayed there for another 8 weeks, I would and have since recommended the All Seasons to anyone. the owner is the nicest man, who would do anything for you (he knows what customer service actually is).", "helpfulness": 2, "user": "mr-man2000", "date": "November 13, 2007", "id": 10791958}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "PS the woman making breakfasts in the marine guesthouse even refused to cook me a breakfast because i was up to early!!The only reason i was up then is because i had to get my things to the All Seasons before starting work.", "title": "Very good B&B in Belfast", "helpfulness": 1, "user": "Castelldefels", "date": "October 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10107390, "likes": {"liked": "— well located", "disliked": "— too many stairs"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "a word of advice DONT STAY HERE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "title": "Hardly luxury - but ok", "helpfulness": 1, "user": "Poolaz", "date": "July 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8044207}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Belfast"}, "variance": {"poor": 4, "average": 6, "very good": 17, "terrible": 5, "excellent": 10}, "slim_ranking": 0.571428571429, "description": "This large detached villa situated in the leafy suburbs of Belfast,with gardens to front is convenient to many restaurants and pubs on the Malone Road and Lisburn Road. It is also close to the beautiful Botanic Gardens, museums and Queen’s University. Marine Guest House is within walking distance of the city centre and there is also regular public transport to the city centre."}