{"user_rating": 4.5, "review_count": 225, "name": "Marina Club Lagos Resort", "reviews": [{"rating": 5.0, "title": "Great hotel - great location!", "text": "We spent 4 nights at the Marina Club this February and can thoroughly endorse the other complimentary reviews. We booked with bookinhotels.com which seemed the best deal at the time we looked - £209 for 4 nights B&B. Upon arrival we upgraded to a marina view/pool view suite for an additional 14 euros per night and were given splendid accommodation which would have been perfectly adequate for 4 people. The internal décor is a very attractive marble and stone theme and the corridors have sensor lighting and are never dull and gloomy. There was a very spacious bedroom with an additional spacious lounge with two sofas (which would have been fine for beds for children). Along one wall was a fully fitted and well equipped modern kitchen with larder fridge, microwave, cooker and 4 ring hob as well as the essential kettle! The balcony was big enough to sit on (yes – it was often warm enough even in February).Digital TV with English channels.", "helpfulness": 15, "user": "Candymiller", "date": "February 28, 2007", "id": 6891665}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The staff were friendly and helpful and breakfast, included in the price we paid – (but watch out - some booking agencies don’t include this) was self-service continental and fine for our needs.", "title": "Spacious, clean, convenient, reasonable priced", "helpfulness": 7, "user": "edinburghandglasgow", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6842808, "likes": {"liked": "— Space, comfort, cleanliness, style", "disliked": "— poor breakfast value"}}], "location": {"country": "Portugal", "region": "Algarve", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 15, "very good": 73, "terrible": 3, "excellent": 127}, "aka": "Marina Club Lagos Hotel", "slim_ranking": 0.166666666667}