{"user_rating": 4.0, "review_count": 295, "name": "Mariposa Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent the night in Mariposa after visiting Yosemite. It’s a nice, little, old west type town. We decided to stay at the Mariposa Lodge based on Tripadvisor reviews and it was a good choice. The rates were very good, the staff very friendly, and there are several good restaurants nearby. Give them a try. I think you’ll be pleasantly surprised.", "title": "Nice place to stay near Yosemite", "user": "davecm329", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161592506}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent ages trying to find accommodation close to Yosemite and eventually settled on this place. It was definitely a good decision. Yosemite is approx 50 mins by car - it's a lovely drive. This place has a pool and spacious rooms, quite modern decor, new bathroom. As it is in the centre of a small town there is maybe 8-10 restaurants to choose from, and an excellent bar- prospect brewing co. the hotel is on a main road though so expect some road noise (but not a problem at night)", "title": "Great value, great location", "user": "Catherine W", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161503069}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Would definitely visit again.", "title": "Great find!", "helpfulness": 1, "user": "Daisy1381", "date": "April 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 158452887}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We wound up at the mariposa lodge due to other sites in town being full -- and were we fortunate this was the case!", "title": "Great value in Yosemite area", "helpfulness": 1, "user": "TriRidge", "date": "April 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156624542}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is a sweet little spot - an America's best value inn, but feels more like a family owned joint than chain. The rooms are small but quaint, with comfy beds and beautiful grounds. The water temperature regulation left a bit to be desired but otherwise the room was great. Of note the jacuzzi was no hot while we were there, but otherwise all amenities were available.", "title": "Amazing Bed - No Character Though", "helpfulness": 2, "user": "Jigsinsy", "date": "March 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 155300299}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Chose this motel in Mariposa to stay while visiting Yosemite for two nights. There are closer options, but much more expensive, so for this reason, it suited our needs. If it were not for being within an hour of Yosemite, I would say this place is very overpriced. It is basically an older, although well maintained, motel or motor lodge. Rooms are older, but very clean and spacious. There was a mini fridge and microwave in the room. Coffeemaker in the bathroom with decent coffee (usually this coffee is awful). No breakfast included, but I knew that when booking - eat at Sugar Pine Cafe! (see other reviews). Good choices for eating within walking distance. Right in the center of a very small town. Very small outdoor swimming pool and hot tub. Not heated and very cold, so really couldn't use the pool in June. Did use hot tub once. Was disappointed with the described \"courtyard view\" - aka parking lot! Nice landscaping around parking lot, but that's about it. Also, if you are on the 1st floor, your \"patio\" consists of two plastic chairs outside of your door, in front of your air conditioning unit, looking at the parking lot - not exactly what I envisioned. Did have one small maintenance issue that was handled quickly. Overall, this is still a good value for the area, but would be way overpriced if it were anywhere else.", "title": "Good choice for visiting Yosemite, but average motel", "user": "Tessa C", "date": "June 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 164075720}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We were 2 people in 2 queen beds. The room had a lot of space, the beds were confortable, and everything was very clean. Location very central. The girls of the front desk were very helpful. The only thing I missed was breakfast. There was a coffee maker. Believe it or not: it was at the bathroom, which I found something anti-hygienic. The wi-fi conection didn´t work inside the room. Whenever I wanted to check emails, I had to go to the reception, where the signal was stronger. There were no sound insulation inside the room. We could hear the noise of the air-conditionner of the other room.", "title": "Clean, good space, miss breakfast.", "user": "Appeltaart", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 163925835}, {"rating": 3.0, "title": "Good but not great", "text": "Booked 2 nights here to visit Yosemite. Had 2 queen beds standard room, which was a little tight for family of 4. Room was mostly clean, but needed details attended to. Window in bathroom was dirty, little mold noted in bathroom, and when I dropped an earring back and had to reach under the bed to find it YUCK. Then there were the ants we woke up to the first morning. Luckily, they only seemed to be in the sink area not the whole room but still. When I reported them the desk person response was something like \" well those little suckers just get everywhere\". No apology or concern at all like it happens all the time. The pool was SMALL. No heat at all so it was freezing and the hot tub was not hot either. Kids tried to swim but it was just too cold. The drive to the park is about 45 minutes but we did not realize how winding and curvy the drive would be each way. All in all, I would pay the money to stay in the park next time as our experience there was much better. I feel the savings was not worth the average experience here. The town itself is nice though, places to eat and grocery store, laundry etc. were all staffed by nice, friendly people. Just maybe look ay alternate lodging.", "user": "zimaaaaah", "date": "June 9, 2013", "id": 163468608}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We stayed here based on Tripadvisor reviews and we were not disappointed in any way. The room we had was an end room, two queen beds, very spacious and clean. The fridge came in handy. The lodge is close enough to several restaurants and shops to walk to. We ate breakfast each morning at the Sugar Pine Cafe. It was very good. Yosemite was about a 50-minute drive away. And, we thought the landscaping at the lodge was beautiful. We would definitely stay here again and recommend it highly.", "title": "Three night stay...", "user": "allened", "date": "June 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 162733512}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel is ideally located in Mariposa, in the town, with short walks to restaurants and shops. The drive to Yosemite and Mariposa Grove is about an hour or so, depending on traffic. There was not too traffic much in the week leading up to Memorial Day. It is definitely good value for money. My room was spacious as was the bathroom area. There was a fridge, microwave and coffee maker. The bed was really big and very comfortable. The air conditioning unit was very noisy, but with the patio door open at night there was no need for it in the 3 nights that I stayed. There was some noise from the road, but nothing too bad. There is a coffee/pastry shop right across the street, and a Subway close by. I would highly recommend eating at Savoury's for dinner. We ate there all 3 nights and the food was fabulous. It is a very short walk from the Lodge and the staff were really friendly and knowledgeable. I would definitely stay at the Lodge again on future visits.", "title": "3 night stay in May", "user": "djp1961", "date": "May 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161721565}, {"rating": 4.0, "title": "Cheap accommodation near the National Park", "text": "We stayed in a king room for two nights after the affordable options in the park were all booked out. The accommodation is very good value for money. Clean room, decent bathroom and a comfy bed to come back to after a long days hike.", "helpfulness": 1, "user": "George_simon", "date": "March 10, 2013", "id": 154132646}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "There is a good variety of places to eat, though none of them are mind blowing. But there is plenty of cheap, decent food around the block.", "title": "Great value", "helpfulness": 1, "user": "mevans08", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 153353942}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Be warned though, it is quite a distance to the Park. It takes just over an hour to get to the valley floor. If this doesn't trouble you, then this is a good accommodation option if you can't afford the park.", "title": "Great place to stay!", "helpfulness": 2, "user": "LYNN J", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152493923}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Couldn't find any decent inexpensive accommodation any nearer to Yosemite in September than Mariposa town - which is about 45 minutes drive from the entrance to Yosemite but chanced upon Mariposa Lodge and found it to be very good value, clean, well maintained and welcoming. No bar or eating facility at the hotel so take breakfast directly opposite in the tiny cafe bar, very friendly, good food and sensible prices. Would stay here again and drive into Yosemite is direct and easy.", "title": "great weekend getaway", "helpfulness": 1, "user": "luis r", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148660917}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "On a spur of the moment, I decided to travel from Oregon to the San Francisco Bay Area to visit my best friends. Little did they know that we would be making a two-day overnight trip to Yosemite.", "title": "Best deal outside Yosemite", "helpfulness": 2, "user": "Kparidy", "date": "January 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148476020}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Above average for the area. Clean, comfortable, well-maintained, nicely landscaped and a fair price (about $95/night). Room included a fridge (good for Yosemite picnic goodies) and free wifi access. Mariposa itself is pretty limited (a handful of small restaurants - pizza, diner, etc.) and a 45 minute drive to Yosemite's Arch Rock entrance. Short of staying in the park (a tough reservation to get and up to $400 a night for the Ahwahnee), this is a good alternative to the $200/night lodging just outside the gate.", "title": "Good deal", "helpfulness": 3, "user": "none07", "date": "October 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4015908}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "I had high expectations of this motel, but it was nothing special. Beware - you may think you have paid for this hotel before you book, but they do not take money from third parties, but you should get the rate quoted. The person in reception was very up himself about it too, making out I was stupid. Never a good start.", "title": "Thought it would be better", "helpfulness": 2, "user": "shelly2202", "date": "October 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3986853}, {"rating": 5.0, "title": "Great Place for Yosemite trips", "text": "Rooms are average size, there was a pool and tub - not a heated pool......there is not much to do In Mariposa nor many places to eat, be aware of this before you go, but the drive to Yosemite from there was spectacular.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 29, 2005", "id": 3814575}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "What a rare find these days. Clean comfortable and friendly. Well run and maintained lodging. Close to Yosemite National Park. Exelent gardens in front of my large room. This lodge was the nicest place we slept at on our little vacation. Other places we stayed were nowhere as well taken care of as this little gem. I was verry pleased", "title": "Nothing Special", "helpfulness": 1, "user": "BPBFL", "date": "August 21, 2005", "detail_rating": {"cleanliness": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3794023}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Clean, if very basic motel with hard and not particularly comfortable beds. There are a lot of flowers in the parking lot and landscaping. Ok, if expensive, for staying the night on your way to Yosemite.", "title": "great little place", "helpfulness": 4, "user": "khastings", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3667843}, {"rating": 5.0, "title": "UK Visitors", "text": "We visited the area with our family and found this motel to be excellent.Definitly the place to stop when visiting Yosemite. Savouries is the place to eat.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4136649}, {"rating": 4.0, "title": "Lovely motel", "text": "We give this combination 100% score.", "helpfulness": 5, "user": "Heslomonik", "date": "November 17, 2005", "id": 4123867}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed here for one night after driving from San Francisco and briefly visiting Yosemite National Park. It was a really good location, only about 25-30 minutes drive from the Park. The motel was pretty to look at (the nicest looking hotel we stayed in all holiday). The receptionist was pleasant and efficient and let us check in a few hous early. The parking was ample. The room itself was a good size. It had a fridge and microwave and a large television. The king sized bed was massive. Everything was very clean and it was nicely decorated. The bathroom was nice, although the water didn't go down the drain very quickly in the shower. There were quite a few eating places in walking distance and we enjoyed two wonderful and cheap meals at the local diner - a real American experience with huge portions. We would happily go back here to stay and it was pretty cheap (about £39 per night for the room). No free hi-fi internet access though.", "title": "Great value motel in a great little town", "helpfulness": 4, "user": "*Karen*", "date": "October 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4071816}, {"rating": 4.0, "title": "Nice motel west of Yosemite", "text": "We booked there for two days and booked to stay for a further night as the place was in such a great location, the rates were very reasonable, and it was a very comfortable place to stay. It definintely looked like one of the more pleasant places to stay in Mariposa.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4052275}, {"rating": 4.0, "title": "Pleasant place to stay", "text": "The room was spotlessly clean and had a nice feel to it. The spa and pool were very clean and at just the right temperature, with gorgeous flowery landscaping around it. Although the pool area is by the side of the road, after hiking in Yosemite all day, it was just the thing to soothe the aches, and the noise wasn't so bad as there wasn't that much traffic.", "helpfulness": 4, "user": "blinkersguitar", "date": "October 22, 2005", "id": 4043500}, {"rating": 4.0, "title": "Quaint lodge", "text": "Mariposa Lodge is located in the middle of Mariposa. Perfect for walking to various places after being on the road. We stayed after an all day Yosemite tour. Our room was clean and spacious. The bath has been upgraded with tile. A great place for the price.", "helpfulness": 2, "user": "Suzybee51", "date": "December 8, 2012", "id": 146998388}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Spent two nights and days in this charming little Sierra Foothills town about 45 min out side of Yosemite. The museum is charming and has incredible local history all the way back to John C. Fremont who lived nearby, old buildings restored, Art galleries, good restaurants. The Mariposa lodge has lots of rooms basically all are on one level, very clean and was quiet since we were there just after Thanksgiving. The lodge is in the middle of Mariposa and you can walk from one end of town to the other. Would stay there again.", "title": "Perfectly located in little Mariposa", "helpfulness": 1, "user": "chi-art", "date": "December 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 146844804}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Nice motel located on the main highway in Mariposa, rooms are clean if a little small (particularly the bathrooms), motel was quiet enough. Can't say anything to recommend it over any other hotel or motel I've stayed at.", "title": "Nothing wrong here", "user": "Michaelthekiwi", "date": "November 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 146521118}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The hotel is an America's Best Value Inn property, and the one we stayed in near Groveland was better than this one in Mariposa. The woman at the front desk was not friendly and initially insisted that we had booked a king room, when we had actually booked two beds. She only believed us after we showed her our printed out confirmation email.", "title": "Quirky charming town, average hotel", "user": "MsRCY", "date": "November 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145835767}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The exterior of the hotel is well-maintained with flowerbeds and chairs in front of each room door, but the rooms definitely need updating. Decor is outdated and the room smelled musty, despite the number of windows (one in the bathroom, one in the back hallway, and two in the front). The shower was a small cubicle with a curtain and no light inside, and the only place to put toiletries was very high up. The counter space near the sink was also very limited. The beds are definitely comfortable, though.", "title": "First Rate Stay", "helpfulness": 1, "user": "seldominn", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144700380}, {"rating": 4.0, "title": "Very pleasant little motel.", "text": "Found this on Trip advisor. Traveled May 06. I loved this little town and motel immediately.", "helpfulness": 5, "user": "jetzoom99", "date": "May 30, 2006", "id": 5233451}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The guy who took the reservation over the phone was very polite and helpful in telling me of routes to take, area attractions, etc. Upon arriving, the town felt small mid-western. Dining, coffee and shops were just a few yards away. The room was very spaciaous and spotless, has fridge and wireless internet which is free for a 2 or more day stay. Had A/C plus windows you could open and a nice balcony. It was dated a little but I liked it. We walked to Salvador's Taco's every morning along with the locals who talked of weedwackers and Siberian Huskys. T", "title": "good class motel", "user": "GrahamF", "date": "May 3, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 4.0}, "id": 5030679}, {"rating": 5.0, "title": "Don't bother going anywhere else!!!!!!", "text": "This place has great food! Yosemiite was about a beautiful 40 minute drive, but a rock slide forced a diversion of about 1.5 hours to Yosemite Valley. Very friendly locals.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 11, 2006", "id": 4966131}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "Would use Mariposa Lodge again!", "title": "OK but noisy", "helpfulness": 1, "user": "JohnGalt2", "date": "April 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4829736}, {"rating": 3.0, "title": "Ok, but...", "text": "everything you could want in a motel provided you only want a room. Room 115 is best avoided as there is a noisy timer/ switchgear next door in service room. It is only really noticeable in the quiet of night when the insidiousness seems to permeate the wall through the attached bed headboard. A minor carp that avoiding room 115 will remove (maybe the upstairs room also)", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 21, 2006", "id": 4477327}], "location": {"country": "United States", "city": "Mariposa"}, "variance": {"poor": 18, "average": 56, "very good": 140, "terrible": 9, "excellent": 72}, "aka": "Mariposa Hotel Mariposa", "slim_ranking": 0.166666666667}