{"user_rating": 5.0, "review_count": 461, "name": "Marlins", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Found this little gem through Trip Advisor and it really is as good as everyone says it is. Its in a perfect location, the rooms are of a very high standard, the breakfast was amazing and we were welcomed by the perfect hosts! We will definitely be back asap!", "title": "Perfect break", "user": "TinaMacFox", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161704494}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "This was a 2 night stay, midweek in May.", "title": "A little gem!", "user": "krrgolf", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160989686}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The hotel location is very convenient for the beach and also the main Square in Bournemouth. It has parking which is a bonus. I was met by Neil who checked me in, told me all the local info and make recommendations for local restaurants. The room was on the first floor was very clean, a good size (and would have been very adequate had I been a couple). and the ensuite shower room was a good size but not huge. Perfectly adequate.", "title": "This really is the nicest place - perfect!", "user": "ChrissieG711", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160951550}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Breakfast is served from 8am to 9am during the week and is excellent. A good choice of cereals and a hot food menu. The Full English Breakfast is freshly cooked to order and is excellent. Highly recommended.", "title": "Amazing Hotel - Perfect for Couples", "user": "SimonMansfieldLondon", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160430429}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The hotel has a lounge area for guests and the foyer is packed with information about things to do and see.", "title": "2 night stay", "user": "mercury1964", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159720328}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "For a second year running, my company booked Marlin's hotel for us to stay during a 5 day exhibition we take part in at the BIC.", "title": "5 Star Hospitality!", "user": "jamie_dc", "date": "January 23, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23816034, "likes": {"liked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel is immaculately clean and the rooms are spacious. The rooms have a fancy flat screen TV's, and there was (much to our happiness) a strong wi-fi signal all throughout the hotel. The location of the hotel is perfect. Close to the beach and to the BIC.", "title": "Fantastic!", "user": "fionamOxford", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23070771, "likes": {"liked": "— The welcome we received.", "disliked": "— The bathroom."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "What makes this hotel that extra special is the excellent service they provided us with. There were quite a few of us, and nobody ever complained about anything regarding the hotel. If only we could take transport this hotel to other areas we exhibit at!", "title": "Recommend Recommend Recommend", "user": "themacNorthampton", "date": "December 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22630158, "likes": {"liked": "— The Whole Experience", "disliked": "— Nothing N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I would definitely recommend this hotel to anybody from business travellers to families to couples.", "title": "Excellent value", "user": "GDGSurrey", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21904376, "likes": {"liked": "— cleanlinees, value for money, convenient location", "disliked": "— small room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "A fantastic play to stay - I cannot recommend this hotel highly enough. From the moment I arrived I felt welcome.", "title": "Lovely Hotel", "user": "sharmst", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21668361, "likes": {"liked": "— Location, comfort, cleanliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We spent 2 nights at Marlins in Bournemouth and were very happy with our stay. Neil and Michael were very friendly and welcoming and Neil was very helpful in suggesting places to go, restaurants etc. Michael opened up the bar for us in the evening which was really nice of him and contacted us immediately after departing as we had left some items of clothing in the room! The veggie breakfasts were delicious too and there was a wide choice of options available for breakfast. The hotel itself was very clean and well kept and the room was spotless with a comfortable bed. The location is great too, with the beach a 5 minute walk away. We would definitely stay at Marlins again if we returned to Bournemouth.", "title": "2 nights at Marlins", "user": "Alison O", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164251030}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Just spent another amazing week at Marlins with 19 other family members. Neil and Michael are faultless in their attention to detail in the hotel and there is always a very relaxed atmosphere. With five young children in our party, all making themselves very much at home in the lounge, this facility made it a home from home experience. Breakfast by Michael is pure delight, and will always set you up for a day on the beach.", "title": "Another great week at Marlins", "user": "KarenWorcestershire", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163657223}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The hotel is in a great location for the beach, seafront, shops and local attractions. Both Neil and Michael have a wealth of knowledge and recommendations for the area, which I suggest you use.", "title": "A week away", "helpfulness": 1, "user": "Neil K", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163611006}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Many, many thanks again for a lovely week. I look forward to seeing you both soon! Can’t recommend this hotel enough.", "title": "Best small hotel in Bournemouth", "helpfulness": 1, "user": "PeterSh1945", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163600108}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is the second time i have stayed at the hotel and as before neil and michael never fail to impress. The room was very clean on arival and keeped that way throughout the week as was the hole hotel. A stones throw from the beach makes it the prefect get away place. I look forward to staying again.", "title": "Excellent", "helpfulness": 1, "user": "Anne C", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163441217}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Read the reviews on here and stayed here recently for 1 night. Whilst it's more of a large bed and breakfast than an out and out hotel (no pool or any of the leisure facilities you might associate with a hotel) the place was in a very good location, with parking, and spotless. Very comfy beds and a nicely cooked breakfast in a very nice dining room.", "title": "Look no further for the price...", "user": "Lapchien", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 31894242}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Only minor point was that there was no offer of help made for help up the stairs with 2 very obviously heavy bags - despite walking / struggling right past the guy in reception.", "title": "Excellent, clean hotel with friendly staff", "user": "OC101", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31470626}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "Would stay here again, but next time might look for somewhere with a pool etc if staying for a bit longer.", "title": "Excellent stay.", "user": "ChrisCorn", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31115149}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Great place, really good breakfast! Excellent value for money and very close to the beach. Also don't let stag/hen parties in which is a bonus!", "title": "WHAT A GEM OF A HOTEL", "user": "nooger", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30317365}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "There is really nothing negative that I can say about my stay at Marlins. The hotel is spotless, the room was exactly as described on the website and on the phone when I booked, and the owners were helpful and pleasant without ever being intrusive - quite charming. The price I paid was a excellent for the room, off-road parking and breakfast; I have already suggested to a couple of friends that they would like to stay here. Upon my next residential stay in Bournemouth, I will try to book in here.", "title": "This is a hotel you must try", "user": "JohnOxfordshire", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29763721}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "All the reviews of this place are spot on, its absolutely lovely. The couple who own it are warm and welcoming and take a genuine interest in your plans for your stay. We had a room at the back which was quite small - the others looked bigger when we passed, but being at the back it was so quiet that I think i'd prefer it to being at the front on the main road. Breakfast cracking as well.", "title": "Lovely Hotel", "user": "LondonSarah", "date": "April 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27519788}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We've just spent 2 nights at Marlins and what a great place. If your looking for a modern hotel this is everything you'd want for a break away from home. A warm welcome, very helpful & friendly staff, 10 minutes walk to the town or the beach, Comfortable. What more can i tell you - you won't be disappointed if you choose this hotel. We will definately be back next time we're in town.", "title": "A Gem of a hotel - what at great find", "user": "Crafty74", "date": "March 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27046644}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Booked this after reading other reviews. This is a spotlessly clean B&B. Our room was small but furnished with all basic needs. The bed was extremely comfortable and as we had a back room it was also exceptionally quiet. Tea, coffee biscuits were supplied and the guest lounge was comfortable and relaxing. The breakfast room was superb - bright and modern with some good artwork on display. Breakfasts were more than ample meaning lunch was not always required. Proximity to BIC, Town Centre and beach was perfect and (tight) parking available. Thoroughly recommended.", "title": "Clean, comfortable and welcoming owners", "user": "Jim100Uk", "date": "March 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25705293}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "my girlfriend & i stayed had arrived in bournemouth about 7pm, not having the foresight to book before, so we spent a frantic 45minutes trying to secure a room for the evening. we had driven past this and decided to give it a whirl, the manager said he had one room left the family room, so decided to take it. So glad we did!!! Immaculate, spotless, perfect location for the beach, bars restaurants etc. The owner was very knowledgable and recomended bar called The Print Room, very nice.", "title": "perfect hotel....", "user": "ravifuel", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 24973563}, {"rating": 5.0, "title": "Warm and Cosy", "text": "Breakfast was divine, choice of full English or cerals etc..", "user": "chrisatholly", "date": "January 31, 2009", "id": 24048416}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Fantastic hotel, in a really good location for walking in Bournemouth. 5 mins from the beach, town etc. Room was really comfortable, breakfast was excellent. The staff could not have been more friendly and helpful. Would recommend this hotel to anyone and will definately stay there again.", "title": "Lovely hotel in a great location (a little gem)", "user": "JulesMilll", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29130044}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "Myself, cousin and mum spent one night at Marlins, which we booked mainly as a result of comments on TripAdvisor, and we were not disappointed. We wanted somewhere close to the BIC where we were seeing a show and the location was perfect, albeit down a rather steep hill. We were greeted immediately on our arrival by Neil, who was very attentive and even helped mum up to her room with her bags. We were immediately impressed by the overall cleanliness, and our rooms were lovely, decorated tastefully and catering for all of our needs. The breakfast was great, piping hot and cooked to order, it was so nice to be greeted as we entered the breakfast area and a real treat to be served at our table as opposed to having to queue for a buffet. There was no shortage of tea and freshly brewed coffee. We genuinely felt that the owners wanted us to enjoy our stay and went out of their way to make sure that we did. We would not hesitate to recommend Marlins to friends or family.", "title": "Marlins ticked all the boxes", "helpfulness": 1, "user": "GoldenGirls20", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28926234}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "If you are visiting Bournemouth look no further than the Marlins Hotel for excellent accommodation and service. Cleanliness was our top priority and our room and bathroom were spotless, as was the rest of the building. The bright breakfast room was inviting and a delicious breakfast was served.", "title": "Look no further than the Marlins Hotel", "helpfulness": 1, "user": "VickyOakville", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28231555}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The location is excellent, within walking distance to the town and beach. The bus stop is just metres from the front door and we took the local bus to the town of Swanage for the day. Excellent restaurants within a block of the hotel provided our evening meals.", "title": "Wonderful, clean, cosy and welcoming stay . . .", "user": "Barbara0969", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28201699}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The kindness and friendliness shown to us by Neil and Michael made our stay memorable. Highly recommended. Mike and Merle Gillatt Canada", "title": "lovely place to stay, thoroughly recommend them", "user": "HertfordshireBeast", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27842583}, {"rating": 5.0, "title": "Lovely stay great location", "text": "We stayed for a night to go and see my sons degrees show. The location is great, we walked into town and enjoyed people watching in particular the hen And stag nights which were good natured. Hotel is immaculate everything is spotless. And tasteful. Very peaceful night in a comfortable bed. Lovely breakfast in the morning. Spot on!", "user": "surreysarahjk", "date": "June 28, 2013", "id": 165587293}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Myself, my husband and two young children (3 and 14 months) recently stayed at Marlins and it was a most pleasurable experience. We were greeted warmly by Michael and upon our return were very pleased with our room, which had a nice division separating it handily into two smaller rooms (with a tv on each side!) The breakfast was delicious and served to liking. Neal was a delightful host and very good with children, our 3 year old daughter took an immediate shining to him. We will definitely be returning here. Thank you for making our stay so enjoyable.", "title": "Family trip to Bournemouth", "user": "Natasha D", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165103144}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Really lovely old house converted into hotel. The bed linen was too die for white Egyptian cotton the towels were just right not too soft not too hard ..... the room we stopped in was on top floor room 12 had an en-suite in our room they had an extra bed for a child and the room was massive with small seating area too. We took advantage on the library outside our room which was an added touch and the welcome folder on the bed was another fantastic touch told us everything we needed to know about the hotel for example they refreshed the towels every second day, which is good especially if you didn't realise. We would certainly return to this really nice hotel if we returned to Bournemouth", "title": "Lovely clean hotel", "user": "Shandylincs", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164983899}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Michael and Neil were great hosts making us all (20) feel very welcome. The hosts were very helpful in giving advice and help. The accommodation: rooms / living area / restaurant area were all very clean. Having a family of 5 including 3 little children, we were made to feel at ease by Neil, Michael and the staff. My daughter felt ill on the last day and Michael and Neil were very helpful in letting my daughter stay in the room for longer - thank you so much.", "title": "Excellent Choice of Hotel", "user": "Debbie S", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164644517}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Debbie Shearsmith", "title": "Brilliant Hotel in every respect!", "user": "Tom L", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164265762}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Excellent B&B, very good location, short walk to cliff top path to beach & not far from town centre. Some noise from place over the road on Saturday night but all was quiet from 11.30 onwards, no noise at all in room at back of B&B. Neil & Michael are great hosts, when they found out my parents were celebrating their 63rd wedding anniversary, they opened a bottle of cava for us in the elegant guest lounge, so kind. Rooms were spotlessly clean, our family room was very spacious, modern decor, couldn't fault it. Hot full English breakfast was served promptly with a cheery smile from Neil. Would definitely stay there again and would recommend it.", "title": "Short break", "helpfulness": 1, "user": "Amanda B", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163275165}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We have just returned from a 1 night stay at Marlins. Having stayed in a few hotels in Bournemouth over the last few years (its our closest getaway beach) this hotel is one of just a very few that we would return to.", "title": "Homely, comfortable and clean.", "helpfulness": 1, "user": "ClintW182", "date": "June 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 163246219}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Its clean, its comfortable and has a nice welcoming homely feel to it.", "title": "Excellent small hotel", "user": "Martin C", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163066069}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Everything is a 5 dots all the way. There's 1 reason I marked the room as a 4 and that's because we had room 11 in the atic, which had a seperate private bathroom across the hallway. Don't be put off though as it doesn't really effect your stay and the bathroom is really nice. We knew when we booked that this was the case and was even emailed after booking to be sure we were aware.", "title": "Just Perfect !", "user": "Jenny O", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162615991}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The breakfast was freshly cooked and was of a really good quality with proper sausages and coffee!", "title": "Loved every minute", "helpfulness": 1, "user": "JaK3027", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162150170}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 8, "very good": 49, "terrible": 2, "excellent": 400}, "aka": "Marlins Hotel Bournemouth", "slim_ranking": 0.047619047619, "description": "Marlins is a 4 Star guest house located within a short walk of the Conference centre (BIC), beach and town centre. We offer free off street parking and wireless internet access. We pride ourselves on our cleanliness, each room is inspected daily by the owners to ensure the highest standards are maintained. We will do everything possible to make sure that your stay with us is an enjoyable one."}