{"user_rating": 5.0, "review_count": 541, "name": "Marquesa Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed here last year for four nights. Unfortunately I was really poorly with a flu bug I had picked up on the flight over from the UK ten days before. The hotel is lovely, really quiet and peaceful and the staff (Henry was super) were good. The setting is beautiful and it is a little oasis in busy Key West. It was perfect for me to rest and recover and by the time we left I was feeling better.", "title": "An oasis of charm and tranquility", "helpfulness": 1, "user": "slj60", "date": "September 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140470797}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I haven't given this an excellent rating because there are no tea and coffee making facilities in the rooms (we had a suite by the pool). Key West is the sort of resort you get many international travellers who are often jet lagged and wake up in the early hours of the morning. When you do, you don't want to call room service and wait twenty minutes for a warm drink. I really do find this baffling why some luxury hotel do this. They also do not serve breakfast, which was odd considering they have the restaurant next door but we went to Sarah Beth's which was lovely.", "title": "The Real Key West...", "helpfulness": 3, "user": "j934292", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140362954}, {"rating": 5.0, "title": "Perfectly accommodated", "text": "On our last night we ate at The Marquesa restaurant, it was very good but lacked atmosphere, maybe it was a quiet night. When we returned to the hotel the front door was locked and we had to wait several minutes for the elderly lady who was on duty to come and let us in. She apologised and said she was upstairs and didn't here the bell.", "helpfulness": 1, "user": "garrynyc", "date": "September 14, 2012", "id": 140224436}, {"rating": 5.0, "title": "Personal Touches in a Private Setting", "text": "Apart from this I would recommend this charming hotel.", "helpfulness": 2, "user": "CynReese", "date": "September 13, 2012", "id": 140155205}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "We stayed here over ten years ago with favorable memories.,...but this time it really made an impact.... this is the Key West you really want to see....it's half B and B and half hotel...charm, ambience, location and sophistication....How do you put so many elements of excellence in one place...only at the Marquesa..Gardens, pools, verandas, cleanliness and attention to every detail....and the best place on the Island to eat right on the premises....(also for a change of pace try the Chinese restaurant across the street...It has crispy duck)....This is an absolute home run!", "title": "Traditional and stunning", "helpfulness": 1, "user": "Flatley24", "date": "September 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140020125}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We spent Labor Day this year at the Marquesa in the Jr Suite. Impeccably clean suite with 1st class service. This hotel and its services was the highlight of our weekend. Beds were turned down each night, plenty of supplies and towels, concierge services were superb. Wine and chocolates too. Will return.", "title": "5 Star +", "helpfulness": 1, "user": "Lillian T", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139800480}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "this was exactly what we were looking for - a small, quaint hotel, beautiful courtyard, and within walking distance to the \"good stuff\". it absolutely exceeded my expectations. the restaurant was not open when we went, and when we first arrived, the hotel was still shuttered (as it was just days after hurricane isaac), but other than that, it was exactly as described. loved it.", "title": "perfect", "helpfulness": 1, "user": "patrice108", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139502442}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We had a 5 days stay in July with 2 teens: we had a wonderful suite around the pool, but above it, in the back: it was extraordinary! everything is delicate, the decoration is very nice, furniture, curtains, carpets.... Usuallly you are welcome with a drink (wine), we hadn't, certainly because of the teens, but we had cookies instead, which were very appreciated!", "title": "Excellent!", "helpfulness": 3, "user": "Mipougne", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137900058}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "the location is top, close to everything important. The concierge (I think Sean, not sure of the spelling), is very helpful: we needed bicycles, and they were not delivered, he did I don't know what but 10 mns later we had wonderful and comfortable bikes in front of the door! there are 2 pools, very quiet, tea and coffee free all along the day, each time you arrive somebody warms you very discreetly, everybody is welcoming , trying to do their best to help.Rooms are very clean, soaps and shampoos of a high level, and the garden is soooo nice: flowers and calm, so relaxing....this is with no doubt one of the best hotel in Key west!", "title": "A great hotel excellent service and location", "user": "soxfan00", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137875015}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We stayed 2 nights at the Marquesa in a standard 1 queen bed room. Room was clean and staff was helpful, friendly. Check in process was quick, (thanks Henry) we were early, room was not ready, but a huge plus is they have a full bath with shower just off the reception area. Quiet spot with on site parking, quick walk to Duval, but none of the traffic or noise.", "title": "FABULOUS hotel experience!", "helpfulness": 3, "user": "BamaRedhead", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136502590}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Amazing stay in every way....only breakfast not worth the money but plenty of places locally to get this. Will definately be back.", "title": "fantastic", "helpfulness": 3, "user": "Nick C", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115856659}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "A beautiful and dreamy hotel that has your dreams coming true in interior and exterior design. Slumber land with a fantastic bed. We stayed in room 18 jnr. suite poolside and felt it was the best even if there were bigger rooms. Kids under 14 years a no, however a mistake on booking helps our 3 year slip through the cracks. The attached restaurant also called the Marquesa was an unbelievable tantalizing delicious dance on my tasted buds. Having both hotel and restaurant with such greatness under one room we should all vote for \"Wonders of the World\" category.", "title": "Calm Oases of beauty in Key West center.", "helpfulness": 2, "user": "MitziLinka", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115752324}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed 2 nights and wished we had stayed longer. We had a deluxe queen on the 3rd floor of the main building. The room was large, clean and extremely quiet. Only downside, is because it is a historic building, they cannot have an elevator. So while the walk upstairs was fine for us, it may be a difficult climb for some. We enjoyed the pool during the extremely hot afternoons. As their policy is guest must be 14 years of age or older, there were no splashing screaming children in the pool. Just other couples relaxing like us. The location is great, close to everything without being in the middle of the craziness. The staff was wonderful and check-in prompt. Robert gave us great suggestions for lunch and even though we arrived several hours early, the room was quickly available.", "title": "Peaceful vacation get-away", "helpfulness": 4, "user": "PhillyFeet", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115615642}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I would definitely return here again- but i'd stay a lot loner than 2 nights!", "title": "Great Hotel", "helpfulness": 4, "user": "AUtravelers2", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114812771}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Spacious, elegant rooms in a great location. Staff was friendly and helpful, both before and during the visit. Room was kept well stocked and cleaned frequently. Great place for couples.", "title": "Marquesa - Tranquility in Key West", "helpfulness": 2, "user": "BIODTL", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114679988}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "It is very hard to be critical of this wonderful, small hotel. We are frequent travellers to The Marquesa because, over all, we love it. The hotel has two beautiful, small pools surrounded by a tropical paradise. Guests are informed verbally at check in and then in writing in the room that cell phone usage in the pool area is prohibited and that tranquility is the rule. On a recent visit, it became apparent to us that the hotel staff refused to enforce its own rules, and we were forced to endure loud cell phone convesations and boom box music at a pool when tranquility was our plan. The result: No tranquility. This hotel would deserve five stars if it honored its tranquility pledge. We will return, perhaps with ear plugs.", "title": "False Tranquility", "helpfulness": 3, "user": "LocalCitizen3939", "date": "August 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135980997}, {"rating": 5.0, "title": "Best of the best!", "text": "Everything is five star. The gardens and pool are Key West inspired and fabulous, the staff are welcoming and friendly. Coffee and tea served poolside, large bathrooms and extremely clean. Location is just a short walk from all the action , yet the place is serene. Cafe Marquesa is an exceptional restaurant right next door. I tried to book for the weekend but it was taken so I opted to stay here on my last night in Key West and now I do not want to leave. I will return!", "helpfulness": 1, "user": "bapmiami", "date": "July 29, 2012", "id": 135677152}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is truly a slice of paradise on earth. The service is impeccable...from reservations, bicycle delivery (their suggestion), restaurant recommendations, directions, room service, turn down service and daily cleaning. This was five star all the way. The poolside gardens are an oasis of calm...enhanced by a water fall and the sound of trade winds through the palm trees. Kudos to their gardeners...the outdoor space was immaculate and lush. We stayed in room 21, which was a large junior suite. It had a very private balcony where we enjoyed our morning coffee and afternoon card games. Marquesa is very well located, yet feels like you are in another world. They have a continental breakfast, but if you want a hot breakfast, right across the street is Sarabeths and within a few blocks are many other choices. There own restaurant was wonderful for dinner. We will stay here again and again.", "title": "We could not have asked for more!", "helpfulness": 3, "user": "Jean Marie S", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135291606}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We were referred by a similar hotel that we like to stay in called the Casa Morada in Islamorada. The Marquesa was a perfect rendition of the same kind of feel. The pool area is really great, and peaceful. Location is great, just a couple blocks from Duvall. Price was reasonable too!", "title": "Perfect place to relax in Key West.", "helpfulness": 5, "user": "aschenck80", "date": "July 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134871384}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Charming and beautifully restored historic hotel in the very best location in Old Key West.Guest rooms are spacious and well appointed and open out into luscious landscaped gardens and 2 pools. Very quiet given the in-town location in the heart of the Historic District.The restaurant---Cafe Marquesa---is wonderful and probably the most relaxing,comfortable and pleasant dining room in all of Key West. WONDERFUL stay in a fabulous property with a great restaurant---I will be back !!", "title": "Absolute Best in Key West AND Florida", "helpfulness": 2, "user": "carolinaone", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134867616}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Just back from our sixth or seventh visit to the Marquesa (I've lost track).", "title": "Another Visit to the Marquesa", "helpfulness": 2, "user": "brainbckt", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136495020}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "LOCATION: The property is conveniently located at Fleming and Simonton, in the middle of Old Town and just two blocks from Duval. Half a block away is Fausto's, a market with an extensive beer and wine selection, as well as groceries and specialty foods (sushi, meats, cheeses, etc.). You're close to the action, but also far enough away to retreat for some peace and quiet at the end of the night. Overall, a nice, fairly upscale section of town.", "title": "Very nice hotel, shame pool rules not enforced", "helpfulness": 7, "user": "Unic", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136442705}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "GENERAL DESCRIPTION: I'd characterize the Marquesa as an Inn or small hotel. The rooms encircle a compound including two pools (one heated, one not) and beautiful landscaping. I've read others describe it as an \"oasis,\" which is apt. We've stayed in the Poolside Standard rooms and most recently, for the first time, a Junior Suite (more on this later). There is an on-site restaurant (pricey and a bit stuffy), but no poolside bar (no matter, get your libations at Fausto's and BYOB poolside). No guests under 14 yrs old and no cell phones by the pool. Clientele runs the gamut from twenty-somethings to senior citizens.", "title": "Best place to stay", "helpfulness": 2, "user": "sugar_pepsi", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136394119}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "POSITIVES: Very pleasant check-in process, which includes complimentary wine or beer. Beautiful surroundings. Great location. Rooms are clean, tastefully decorated, and well-appointed. This could be a plus or minus for some, but definitely not a \"party\" atmosphere. Not to say we didn't sip our fair share of drinks by the pool and in Key West at large, but the Marquesa environment is designed for tranquility (most of the time...see comments that follow).", "title": "Great stay in Key West", "helpfulness": 2, "user": "Wendell S", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136165657}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "NEGATIVES: A bit pricey. The Junior Suite wasn't worth the premium (I think these are hit-or-miss...some are larger and better-located than others). We were in 106, which had great privacy, but was in the back of a building, small-ish, and a bit cave-like. We'll stick with the Poolside Standard moving forward. Because the Marquesa is a relatively small property and built for quiet, it only takes one poolside bigmouth to really shatter the environment (acknowledging that this observation isn't actionable).", "title": "the best place I have ever stayed at!", "helpfulness": 1, "user": "Caroline K", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136136982}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This is the BEST Hotel in Key West hands down. Just a block off Duval Street you step into this cozy, charming, quiet retreat that is a true experience of totally relaxation! The staff was wonderful, kind, attentive and very professional. Our past trips to Key West we have stayed at the La Concha and the Pier House, both of those hotels don't even compare to the Marquesa. This will be the only hotel we stay at when we travel to Key West.", "title": "Best Hotel in Key West!", "helpfulness": 1, "user": "StovertrottersJunkie", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97099179}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "A wonderful place to spend a birthday. This is our second time visiting the area. Service was excellent, staff was helpful and location perfect. We tried biking this year and found it a lovely way to see the island. We suggest you choose a room overlooking the pools and gardens so it is quiet and picturesque. We would highly recommend the restaurant attached to this hotel. The location is perfect.", "title": "Piece of Heaven", "helpfulness": 1, "user": "Travelingaddicted", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90851568}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The marquesa was a very nice inn. The room was nice, the property was beautiful and the location was fantastic. Would recommend to anyone planning in going to key west.", "title": "Really enjoyed my stay", "helpfulness": 1, "user": "NYCtraveler076", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90353587}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We were really looking forward to staying here after all the great reviews. The hotel is indeed beautiful and clean and in a great location. I do agree though with the previous reviewer, the breakfast was poor value for $10 but as the management responded there are places nearby. We tried a number but our favourite was Harpoon Harrys which was a classic american diner with fabulous breakfasts, We would generally have the Marquesa's (excellent and free) coffee and then head off for breakfast. The people working there were helpful and charming and the junior suite was spacious and comfortable. My one issue was the lack of tea and coffee making facilities, I missed my hot drinks at night....", "title": "Lovely hotel but where's the tea and coffee....", "helpfulness": 1, "user": "Escape_London", "date": "December 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89860300}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "While the hotel is fine and the staff really nice, don't be surprised at the $10. pp extra charge for a sleazy breakfast. And, it is a fair walk to a breakfast spot from there.", "title": "Don't expect breakfast!!!", "user": "allen_10030", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 88771874}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Elegant hotel, really friendly service and informative advice about what to do and see in", "title": "A gem of a hotel", "helpfulness": 1, "user": "Britsinthetarn", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100297593}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Key West, nicely appointed rooms with great attention to detail, just a gem and a peaceful haven in rather a bustling environment.. We would highly recommend this hotel for couples.", "title": "The Marquesa just keeps getting better", "helpfulness": 1, "user": "CalamitySal", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99682077}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We just returned from our annual winter renewal trip to the Marquesa Hotel and Cafe Marquesa, marveling at how Carol and her wonderful staff keep making things better for us. Usually when you fall in love with a hotel or restaurant, you risk the very real chance of disenchantment when returning. Not only has that not happened to us in our 5 years of coming to this wonderful place, we no longer even fear it happening. As with every other visit, we find something new and delightful (in this case, poolside coffee and tea in the morning) to join the very long list of things we already adore, such as poolside ice tea during the day, wine and cheese on Saturday, beautiful decor, tropical gardens, delicious meals, and immaculate housekeeping. The best part of our visit remains the warm wlecomes and endless help from the staff, including Bob, Mary, Richard and Shaun. If heaven isn't like the Marquesa, we will be severely disappointed!", "title": "Beautiful Small Hotel in Terrific Neighborhood", "helpfulness": 1, "user": "MysticSusan", "date": "March 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 99569585}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This hotel has been beautifully remodeled and a true oasis in the middle of a busy city. It is close to Duvall Street without being in the traffic and noise. An easy walk to restaurants, shops, and attractions. If you book one of the \"standard rooms\" which we did as it was the only room left, be sure to ask the reservation agent about the views from the windows. We were told our room faced the Gardens but were not told that the view out the window was of the roof of the restaurant next to the gardens and of the exhaust fan serving the restaurant. This was a huge disappointment to us. The room itself was fine but small, which we were expecting. My only suggestion to the hotel would be to have at least one staff member at a location that is accessible to the guests. The computers and business functions are in a room off the parlor with a door and glass window. Employees sit with their backs to the door.", "title": "The Marquesa Hotel - ALWAYS a pleasure!", "helpfulness": 1, "user": "dedeepaloshtsil", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98887789}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This is our second time staying at the Marquesa, and what we loved about it last year remains true of this year. The surroundings, the staff, the beautiful and clean junior suite with the private porch we love where breakfast is delivered in minutes.....just loved it all!", "title": "Best in Key West ... fourth time back.", "helpfulness": 2, "user": "javabeach", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98885490}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "MY wife and I are seasoned travellers from Northants in England. This beautiful hotel had all the Key West charm. We had room 9 right on the front. We had read in reviews that it could be noisy, but once we had set foot in our room/suite we didnot want to move. We would give it 5 star rating. It was light and airy from 5 sash windows and extremely well furnished. The pool area was tranquil and peaceful a little gem of an oasis one block away from the hustle and bustle of Duval Street. the staff were attentive and gave excellent service. The resteraunt was very good, but the night we went it was very noisey all the lady customers were trying to outshout each other. The rooms may be a little expensive to other hotels but worth every penny. Very highly recommended.", "title": "Beautiful hotel in the middle of Key West", "helpfulness": 3, "user": "KJACK8", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114614183}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My wife and I have stayed at the Marquesa several times before. The Marquesa never disappoints. Service is very good and the place is beautiful. The associated restaurant is also excellent. Two pools, one heated and one not is an added feature.", "title": "We love this hotel", "helpfulness": 1, "user": "fenwickbob", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113629960}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "In this age of cookie cutter hotels, it's nice to find a place like the Marquesa. Charming, historical, tucked away from the noise but close enough to easily walk to all the action on Duval! We stayed in one of the junior suites (#6, which I would recommend) and enjoyed it immensely, from coffee and tea at poolside to coming back to our room at night and finding the bed turned down and chocolates waiting with the ice bucket filled. Very friendly staff. Our flight didn't leave until the evening, but when we checked out the manager told us to feel free to continue to enjoy the pool area as well as a separate bathroom and shower to clean up and change prior to our departure. Didn't get the opportunity to dine at the Marquesa Cafe but heard from others it is great. The Marquesa consists of the main building (built around 1884, as I recall), and several additional historical Key West homes that were apparently moved to the site. All nicely updated, and the courtyard pool areas and gardens are beautiful. Will definitely stay there again!", "title": "Wonderful experience", "helpfulness": 2, "user": "JFK56", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 109546103}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A little place of peace, quite and serendipity in a wonderful contest of silence and good manner. Room is what sometimes you are looking for on holidays but often doesn't find: new england style. It's wonderful to have your breakfast poolside just outside the room door. It's a place in which you arrive to stay only one night, but when you realize where you are you'd stay for one week.", "title": "Delicious", "helpfulness": 2, "user": "Andry", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 107632901}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Andry e Roby from Rome (Italy)", "title": "Lovely Hotel in Heart of Key West", "helpfulness": 1, "user": "nycgal12", "date": "March 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 100308232}], "location": {"country": "United States"}, "variance": {"poor": 7, "average": 12, "very good": 57, "terrible": 7, "excellent": 458}, "aka": "Marquesa Key West", "slim_ranking": 0.075, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Small luxury hotel with friendly staff, two pools, great Cafe, and premiere location one block from Duval St. Free coffee, water and ice tea poolside. Turndown in the evenings. Complimentary wine at check-in. We welcome children age 14 and older only."}