{"user_rating": 4.5, "review_count": 190, "name": "Marquis Boutique Hotel & Spa", "reviews": [{"rating": 3.0, "title": "Good basic lodging", "text": "My husband and I booked a seven night stay at Hotel Marquis through SkyAuction. According to their website there was a pool, rooms had water views, etc.", "helpfulness": 10, "user": "Grandma Sparkle", "date": "January 6, 2006", "id": 4329073}, {"rating": 5.0, "title": "Paradise", "text": "Upon arrival we found there was no pool, absolutely no water view (we faced the hotel across the street) and no on-site parking. Our upgraded room (deluxe terrace) was very large but definitely in need of a little TLC. I doubt it had been painted in years. My husband hated the fact that it had a bathtub with handheld shower but NO shower curtain - he took a lot of Shamu baths! However, the porch was fabulous - half the size of the entire room with couch, two easy chairs, cocktail table, dining table and four chairs AND a hammock swing. We spent many hours relaxing there. There are two restaurants 'on-site' which is helpful as you are pretty isolated in this location. However, Grand Case is only about 10 minutes away as is Orient Beach.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3677003}, {"rating": 4.0, "title": "Something out of the ordinary", "text": "We have visited the island of St. Martin many times and never thought to stay in the Anse Marcel region. What a great experience. Amaury and his staff made us feel comfortable and the view from our hotel room was spectacular. If you're looking for a relaxing get-a-way this is the place.", "helpfulness": 15, "user": "lujo423", "date": "November 15, 2004", "id": 2825307}, {"rating": 5.0, "title": "A charming French inn on a tropical island", "text": "My wife and I just got back from St Martin and I wanted to give an honest review of this resort. Reading a review on Travel Advisor helped me pick the Marquis and I'm glad I did. It was our 5 year wedding anniversary and I wanted something a little different than the typical carribean resort...that's exactly what we got. If you want amazing service and a small, quiet, modest resort, you will love this place. Really important...this resort is NOT on a beach and the pool is really small. You are literally on top of a mountain and the entire resort has a \"rustic\" quality. The beds are low to the ground and the bathrooms are very nice but not modern. The view from our balcony was breath-taking, the breakfast in the morning (hot chocolate croissants, croissants and french bread, fruit and fresh squeezed OJ) was included and incredible, the staff and the service all get really high marks. Think bed and breakfast rather than mega resort and you won't be disappointed. Forget the spa, it's just not that great and very expensive. However, I admit I was pretty impressed with the gym (for the islands).", "helpfulness": 25, "user": "MEF", "date": "June 14, 2004", "id": 2186811}, {"rating": 4.0, "title": "A Wonderful, tranquil stay", "text": "St. Martin itself is awesome. Great beaches, amazing restaurants and friendly people really make this island one of our favorites.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "April 1, 2004", "id": 1758702}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I went to St. Martin to get engaged to my girlfriend and wanted the hotel to add to the impending happy memories. After trawling the internet and several guide books, I settled on the Marquis. Well, what a choice! This place has to be the best boutique hotel on the Island. The room was fantastic (and massive), the view was stunning, and the staff were friendly and informative! Anse Marcel was a beautiful resort (although watch - one of the big hotels is under construction right beside the beach). This isn't a problem however as Orient bay and the heavenly Isle Pinel are within 3-4 minutes drive.", "title": "Awesome", "helpfulness": 3, "user": "garethlaw", "date": "December 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11261085, "likes": {"liked": "— The view and friendly staff", "disliked": "— Nothing to report - everything was fantastic"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "In summation - if you go to St. Martin - stay here.", "title": "Classy", "helpfulness": 2, "user": "MillValleyKimberly", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10473370, "likes": {"liked": "— Accommodating"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Marquis was delightful. Amazingly helpful and sweet staff, and with such grace. The room was wonderful, and the view extraordinary (including many birds chirping). If you want the most restful and exquisite beach, this is it. The architecture and style were so Caribbean, and elegant.", "title": "Le Marquis - we will be back!", "helpfulness": 1, "user": "FOMBVI", "date": "October 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10385758, "likes": {"liked": "— Intimate hotel, great views, on site massage", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "A small, intimate hotel, set on a hill top with beautiful views of Anse Marcel Cove. This was our 2nd time. The 1rst time we stayed in a deluxe room, the 2nd a Great View room. The rooms are identical, and no matter where the location, the view will be amazing, better from the Great View room though. Rooms are tastefully furnished, and have wonderful tubs, a luxury in the Caribbean, and all rooms have a spacious balcony with teak furniture and a hammock. Rooms come with nice touches, such as an espresso/tea machine, well stocked mini bar, CD player, robes, in room safes, and a beautiful tea light candleabra. Breakfast is served at their pool, or on your balcony and is delightful. A basket of croissants, baguette, and chocolate croissants (warm), fresh squeezed OJ, your choice of capuccino, coffee, or tea, and a lovely fresh seasonal fruit plate, are delivered and set up for you to enjoy. We chose to have breakfast on our balcony, where we watched the dancing butterflies, and enjoyed the serenity. The staff are wonderful and accomodating. Their restaurant recomendations are excellent. Do rent a car, so you can easily come and go as you please. It is not expensive. Treat yourself to a massage from Maria in their \"Zen\" area, or have a Thai massage from Cathy, both excellent therapists. Everyone speaks both english and french. It is nice to be able to stay at this small resort and enjoy all of it's personal touches, and still be able to enjoy the facilities of Domaine de L'onvillers, the large resort directly on the beach at Anse Marcel, where you can enjoy complimentary beach chairs, their pool, and dine in their excellent restaurant. Drinks and dinner can be signed to your hotel bill which is very convenient. Our favorite restaurants are in Grand Case, Le Cottage and Tastevin. Eat on the French side, shop on the Dutch side, and don't stay on the Dutch side if you are looking for a peaceful stay. Le Marquis is unique, and a true find. If you are looking for Caribbean elegance with a personal touch you will be in the right place.", "title": "Paradise in St. Martin", "helpfulness": 1, "user": "Cuttyhunk", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8722992, "likes": {"liked": "— The feeling of privacy", "disliked": "— The difficulty with appliances because of the voltage"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I spent one week at this lovely hotel in late August. The views from the ride up and down the mountain to the hotel were incredible, the ocean almost always visible. The hotel was fairly quiet, giving me the feeling that I was in my own villa., with my own wait staff. Breakfast by the pool every morning was wonderful, and the coffee, freshly squeezed orange juice , plate of freshly cut fruit, basket of croissants were delicious. The staff was extremely friendly and attentive, Graziella ,Samantha and Rosemary were wonderful and very helpful with any questions or services I needed. The room was quite spacious, with a balcony overlooking the cove of Anse Marcel. The beach was small, but quite beautiful, soft sand and warm gentle water. There were very few people there because the two hotels on the beach front were closed, so it felt like my own private beach. I would highly recommend this hotel if you are truly looking for a low key and relaxing vacation. Make sure to visit Ilet Pinel, a tiny island close to the hotel, with a fabulous beach, and take the ferry from Marigot to Anguilla. The beach on Shoal Bay East was incredible- the softest, finest and whitest sand, and most exquisite turquoise waters I have ever seen, my next spot for a vacation.", "title": "Stress Free And Relaxing", "helpfulness": 2, "user": "GeneralLee01", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7772496, "likes": {"liked": "— Spacious with a great view", "disliked": "— Could not find anything"}}, {"rating": 5.0, "title": "great hotel with amazing service!!!", "text": "This is a great small hotel to stay in if you are looking for something different from cheesy resort style hotels you usually find in many beach destinations. The staff is incredible, and very accomadating. The hotel has bed and breakfast quality with very personal attention. The rooms are large and overlook the marina. The rooms are not super fancy, but they have small touches such as a small stereo system, candles, a espresso machine, and the views are amazing, and you can have the continental breakfast in your room while looking down on an amazing view. There is also a nice hammock on the terrace you a can relax on while looking down on the marina. Also, the bathroom does not have a shower, just a tub with a handheld showering attachment and no shower curtain, so you really basiclly end up taking a bath. The hotel is not on the beach, but the hotel staff is always available to take you down to the beach in the car, and it takes literally two minutes to get there. The beach is very nice also, very quiet without the music and crazy people running around. When we went, there was probably about 15 people out there. If you are looking for a place that is close to all the action, and where are all the people are, this is probably not the place. But its a great place to unwind and spend some quiet time. It is kind of far from the airport, and although the actual distance is not much from the airport, it almost takes an hour to get to the hotel due to the roads, other than the drive to the hotel, it is really a great place to stay, with great service!!", "user": "fh1234", "date": "January 21, 2008", "id": 12863905}, {"rating": 5.0, "title": "Wonderful Small Hotel", "text": "We loved this quiet little boutique hotel, with great service. It sits on the top of a mountain looking down over the ocean and across to Anguilla. The views are spectacular! The staff is very friendly and helpful. Delicious breakfasts are provided in your room or by the pool. We had a two room, two bath suite that was very comfortable for the three of us. The hotel provides transportation to a great beach at a large hotel at the bottom of the mountain (5 minutes), but you will want a car so that you can get around the island and go to dinner at the many wonderful restaurants. One not to miss is Sol et Luna, which is close by. (The hotel will provide transport to and from the airport and arrange the car rental on site.) The Marquiss is not for people who want a big resort experience. But if you want a casual, friendly and quiet little gem, this is it.", "user": "KiliTrek", "date": "January 20, 2008", "id": 12830383}, {"rating": 5.0, "title": "The Best Ever!", "text": "As a world traveler I've had the experience of staying in many hotels, but this was without doubt, one of the best ever! The view from my room was incredibly beautiful and I spent many hours just staring out at the scenery, watching boats on the ocean and the clouds roll by. The service was outstanding and the entire staff were very friendly. The room was very spacious and clean and while there was no restaurant on site, one could easily order room service which was always available. The only minor disappointment was the pool which was small, but who could hardly complain when you had your choice of so many gorgeous beaches! It was very peaceful and therapeutic and I liked that it was situated away from the hustle and bustle...also the car rental which was included in the rate was fantastic! Apparently, the Hotel will be undergoing some renovations which I look forward to seeing since I will definitely be returning and would highly recommend staying here as well. Thank you so much to Everyone at the Marquis!", "user": "TLCWallingford,CT", "date": "December 26, 2007", "id": 11960205}, {"rating": 5.0, "title": "Great Hotel", "text": "This is a wonderful hotel. The hotel is situated on top of a hill (Anse Marcel), and all of the rooms overlook the marina area. By the marina area, there is a private beach shared among a couple hotels. The beach was very tranquil, and I didn't seem more than 8 people any time I went out there. The water was warm, clean, and calm.", "user": "occhris", "date": "December 19, 2007", "id": 11694380}, {"rating": 5.0, "title": "Awesome", "text": "The hotel staff is very courteous and friendly. They helped us with some local restaurant recommendations and places to see. The complimentary breakfast was awesome! I loved all of those croissants and fruit.", "user": "thethompsonfamily", "date": "December 10, 2007", "id": 11462846}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 6, "average": 5, "very good": 52, "terrible": 4, "excellent": 123}, "aka": "Marquis Boutique Hotel And Spa", "slim_ranking": 0.135802469136, "description": "The Marquis is an intimate and exclusive 4star boutique hotel located in Anse Marcel Cove on St Martin's French side. The 17 spacious room & suite accommodations have private terraces and a dramatic view of the ocean. Breakfast & restaurant services can be enjoyed in your room or around the pool. A full service at the beach is provided for hotel guests and a shuttle is at their disposal anytime. Also, guests will benefit from the sport center and the \"Zen\" area which offers aesthetic treatments and massages. This secluded paradise's reputed personal service adds to its appeal."}