{"user_rating": 4.5, "review_count": 1130, "name": "Marriott's Grand Chateau", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "My family and I stayed at the Marriott Grand Chateau in February and found the accommodations to be perfect for our group of five! We loved the size of the 2 bedroom unit and all of the features that it offered! The kitchen had all of the tools that we needed for our breakfast and lunches. We did not have any housekeeping services ,other than towel deliveries. They were very accommodating and generous with the towels! I found the location to be absolutely perfect! I initially had a concern about valet parking,but I soon discovered that the parking attendants were very prompt and courteous! We truly enjoyed our stay at The Marriott Grand Chateau and we're looking forward to staying here again in the future! I highly recommend this hotel!", "title": "Fabulous Fun Filled Vacation!", "helpfulness": 1, "user": "Retiredteacher58", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61701718}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Marriott's Grand Chateau is a vacation club - timeshare and so it's not a genuine \"hotel.\" While rooms can be made available for rent, the property does not have all usual Marriott amenities. We were there for a week and had a great time. The rooms are clean and beautiful the beds are so comfortable. We had a high floor room in Tower 1 with a view of the strip and City Center. There is a small store in the lobby but no restaurants. Because we wanted to use the mini kitchen in our studio we took advantage of the free shuttle to the grocery store the morning after we arrived. It runs 2-3 mornings a week starting at 9:00 a.m. and every 1/2 hour until 10:30. After that the shuttle will take you to the Fashion Show Mall - every half hour through about 7 p.m. It's free. We ate all breakfasts in our room and lunches by the pool. The pool and hot tub - bar area is rooftop and rather small. Drink specials weren't available every day which seemed odd. How can you have Bud drafts on special with no Bud? The pool - small as it was did accomodate all of the guests the week we were there. The bartender was not personable and drinks were a bit pricey. We enjoyed our walks south to MGM, over to City Center and then north on the strip to shows at the Mirage and Palazzo. It's about a block to the strip and with the property at the \"50 yard line\" it was an excellent location for us. Our big find was the entrance off Harmon to the Planet Hollywood mall and casino. There are about 10 faded ugly blue doors facing Harmon that open up to the most fabulous shopping and dining experiece. Not only is it a great mall with nice restaurants and bars - but you cut the corner to the strip. Overall - our stay was wonderful - a beautiful room and excellent location. Marriott staff was accomodating and polite - but the receptionist could have elaborated on shuttle information - you need a pass to ride the 14 passenger van, 1st come 1st served.", "title": "Great location, quiet", "helpfulness": 2, "user": "DKCampbell", "date": "March 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59976213}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The room was perfect, the bed was super comfortable, the bathroom was magnificent nice and large. Small kitchen with all of the utensils so that cut down on meals costs. The room had the kitchen, living room, bedroom and seperate bathroom. We were not disappointed at all ! We will stay there again for sure !", "title": "Will stay again, great place to unwind", "helpfulness": 1, "user": "AJHughes", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59295681}, {"rating": 5.0, "title": "Extremeley Pleased!!", "text": "My wife and I stayed at the Grand Chateau to celebrate our 1st wedding anniversary. It was our 1st vacation together and Vegas was a 1st for us both as well. The resort was perfect. As soon as we reached the front door, we knew we had picked the right place. The lobby was beautiful and checking in was a breeze. We tried the famous cucumber water in the lobby and liked it so much, we are going to try to make it for our 1st BBQ of the season. Every detail of this resort was impressive. We got one of the one bedroom suites and it was just what the pictures showed. The bed was very comfortable and the nearby large garden tub was the first thing my wife wanted to try out. The double headed shower was awesome! We had a full kitchen fully stocked with any utensil or cookware you could ever need. Flat screen TV's in the living room and bedroom made it hard to leave. On the 38th floor is where we got the best view of Vegas...on the sky...especially at night. The location of the resort was perfect, right off the strip but close enough to get to everything you needed to by foot. Oh, and make sure you check out the Love Brothers at the nearby Hawaiian Marketplace. They sounded real good and it's a nice place to shop and hang out and have a few drinks that you can even bring yourself. We would stay there again in a heartbeat!", "helpfulness": 3, "user": "Ranshaw31", "date": "March 21, 2010", "id": 59145981}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the Marriott's Grand Chateau for a week to celebrate our wedding anniversary. The place if fabulous! We stayed in a one bedroom suite. It was like being at home, very spacious, a kitchen equipped with everything you would need. The best think is it's on the strip, walking distance to everything. Ther is nothing negative I can say about it, the accomodations are absolutely superb and clean. Excellent place to stay when visiting Las Vegas. The parking is valet complimentary, no hassel, free internet. Absolutely wonderful! Because of the great accomodations, we didn't have to run away from the room, but take our time in the morning, have breakfast, leave and come and go as if we were at home. Also, they have a complimentary shuttle to a grocery store Sun-Tuesday for those who do not have a car, and for those who would rather not use the car. Do stay there, highly recommend! Oh, yes, and the bedding is fabulous, clean white sheets and pillows and a comfortable mattress!", "title": "Fabulous!", "helpfulness": 2, "user": "adamax", "date": "March 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58818612}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "We are Vegas regulars, and you won't find a better option for families than staying at the Grand Chateau. There's no gambling machines, the staff is friendly, and having your own kitchen and family room is a huge bonus for those of us that don't like to eat out 3 times a day. It's right across the street from Planet Hollywood's big shopping mall, so it's perfectly located.This is where we'll be staying every time we go to Vegas with the kids!", "title": "Fantastic Option on the Strip!", "helpfulness": 3, "user": "Military_Traveler11", "date": "January 25, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23889998, "likes": {"liked": "— Great living areas", "disliked": "— Don't care for valet parking - I like to park my own car"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The one bedroom was large and very comfortable and the pool on the roof was terrific and not very crowded. The prperty itself was disappointing int hat it did nto have any restuarants and a very limtied market. It is possible they willa dd services but nothing much was open. For a hotel/timeshare this large there was very little acitvities or options.", "title": "Villa on the strip", "helpfulness": 1, "user": "Stevied888", "date": "January 17, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23622752}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My wife and I traded our week in the Grand Vista in Orlando for a week at the Grand Chateau. We really enjoyed it. While the room is not as big as other Marriott \"Grand\" Timeshares, this was still much nicer than most rooms on the strip. Our 1 bedroom unit had a functional kitchen, a European washer and dryer and very nice furnishings. They have full size washer and dryers in the building if your need them. The property has free Wi-Fi. The property is expanding and there is construction at the Planet Hollywood (across the street) so ask for a quiet room. The roof top pool is a bit small, but the view at night is great. You can use the Planet Hollywood pool, but that pool is only open till Oct 31. Everyone we dealt with at the Marriott was great as always.", "title": "Really Enjoyed Our Stay. Loved the double head shower!", "helpfulness": 3, "user": "wmn9", "date": "January 3, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 23233778, "likes": {"liked": "— Size of the rooms and the kitchen.", "disliked": "— While it is 1/2 a block off the strip, most of the casinos we like were a bit far."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Suggestions…. They have a shuttle bus to take you food shopping. I forget the name of the food store chain, but while the prices were much better than on the strip, they are a bit higher than normal. Nonetheless, we stocked up on food and adult beverages to enjoy in the room. If you plan on gambling at places other than Planet Hollywood (across the street) or MGM (10 min), I suggest you get a small rental car and park at the casinos free lots. Cabs will be $10 at least each way. We found it hard to get a cab at certain times due to a big conference. There is a monorail that appears to be close, but it really is a 10-15 min walk to the station and will cost $5 per ride or $15 for an unlimited day pass. We spent most of this trip at some of the older casinos- Gold Coast, O’sheas, Golden Nugget, Casino Royal (our favorite place to play black jack and craps due to the low limits). We also went to the Red Rock Canyon a nice day trip.", "title": "DISAPPOINTED, RUDE SERVICE!!", "helpfulness": 4, "user": "RobinAustin21", "date": "December 30, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 23114741, "likes": {"liked": "— Nothing", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "I haven't been this disappointed with one of the properties ever, and we stay at Marriott hotels around the world more than 75 nights per year. The hotel wasn't even close to being ready to open, staff wasn't trained properly, incomplete room furnishings/amenties, major construction during peak check-in times, etc. It wasn't what was advertised, and we could have stayed at the Bellagio for much less!! We walked in to find the main fountain in the lobby undergoing major construction, where the dust was flying all over us, not to mention it was very noisy. We had just finished a six hour drive and were looking forward to a glass of wine, but there was NO service available (restaurant or bar), due to rain. At that point, we asked if we could be transfered to another Marriott and the assistant front desk clerk, Sang Han became quite arrogant and said we'd be charged for the night in each hotel, due to their cancellation policy. When we asked to speak to his manager (Tom), he told us we'd have to wait until the Monday following Thanksgiving (5 days). It got worse from there. We had a 7am flight the next morning and never received our wake up call. Basic amenities weren't available: no glasses in room, no full length mirror, can't call ahead to valet for car, and cheap, tacky decor. Doesn't do the other Vegas Marriott's any justice.", "title": "Great Hotel!!!!", "helpfulness": 3, "user": "Chadlerbing25", "date": "December 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22726071, "likes": {"liked": "— Everything was great!", "disliked": "— After a specific time at night you need a room key to use the elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Just spent along weekend with old friends at this lovely hotel. I was concerned about whether it would be close enough to the strip but we walked everywhere. It was about a block off the strip, but right in the center and convenient to everything. After walking around casinos for hours, it was nice to walk in the lobby get right on the elevator and go upstairs. We (5 women) had the two-bedroom suite and it was perfect for a group. We could gather in the living room, make coffee and bagels in the morning. Frig for drinks, etc. The hotel is well decorated, upscale and has a great 24-hour market in the lobby. No sign of any construction despite their website warning. Pool on the roof was small, but adequate.", "title": "Great location and amenities - would highly recommend!", "helpfulness": 5, "user": "mac6641", "date": "March 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25972290}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed in a one bedroom suite for a week in February 2009 and were very pleased! We've always stayed at hotels (MGM, TheHotel, Rio, Luxor, TI, Excalibur, even Stratosphere once to check it out) so were hesitant at what my timeshare could offer us in Vegas. A great big space with everything we needed in a perfect location is what we got!", "title": "Great location and all the amenities you could want in a suite", "helpfulness": 11, "user": "jenna5671", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25648365}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The entire suite is decorated in brand new, clean sunny modern sort of country french design (don't worry, it's not frilly or flowered). The kitchen is fully stocked for all your needs - I made dinner for two and even breakfast for six one morning. Special note - if you are making bacon do it in the microwave. There's no real exhaust for smoke which resulted in us setting off the really loud smoke alarm but hotel staff responded IMMEDIATELY with friendly and very nice assistance.", "title": "Excellent Stay at an excellent place!", "helpfulness": 4, "user": "ParamedicHoneycutt", "date": "March 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25598651}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The dining room seats 6 comfortably. The living room has a comfortable couch, two chairs, and tables and a flat screen TV with a ton of cable channels. We actually stayed in once or twice to relax and watched a movie or two - very nice. The entire hotel has free WiFi - a nice touch that really came in handy. The bedroom is huge, with another big tv, comfortable bed with nice linens and good pillows, well lighted vanity area, and a really big two person jacuzzi. The separate bathroom has a two person, two shower head shower that was awesome. Our view out the bedroom and living room was of City Center on the strip and the side of Planet Hollywood and beyond - including a slice of the Bellagio fountains. My only gripe is that there is no full length mirror - come on, it's a must for getting dressed up for a night out in Vegas! The rooftop has a bar (open 11am to 6pm) with several tables and chairs, and 6-8 person hot tub and a small but fine sized pool (open from something like 7am to 11pm) with lounge chairs. We liked the day and night view from the roof - you can bring up your own wine and chill out while watching most of the Strip lights, from Mandalay Bay up to Caesar's and beyond. There's also a 24-hour fitness center but between Vegas fun and the ultra comfort of our suite, we never quite got there to check it out.", "title": "Very clean, 2 min walk to strip", "helpfulness": 3, "user": "AlaskansNeedtotravel", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25376198}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "As for location - this place is right behind the Harley Davidson Restaurant & parking lot located on the corner of Harmon and the Strip, across from the new City Center. Unless you cannot walk 90 seconds of a block, there is no reason to call this hotel \"off the strip.\" Think of it this way - if you are staying \"on the strip\" at the MGM, you enter on the strip and then have to walk to the back of the hotel to check in or get to elevators so you've just walked 2 blocks indoors. At the Marriott, you are simply not walking through a casino. And if you chose not to walk the short block up to the Strip, but instead to cross Harmon Ave, you can enter Planet Hollywood & the shops through a side door located directly across (i.e., about 50 feet) from the Marriott's entrance. Marriott guests can use Planet Hollywood's pools and gym for free too. Check out Planet Hollywood's players club - when you join you get a ridiculous amount of free drink & $$ off the buffet coupons as well as free food and retail coupons. With the free drink coupons alone, we saved over $100! Also check out Planet Hollywood's buffet (since the Marriott does not have any restaurants). We were pleasantly surprised by how good the PH buffet was - the dessert bar even has cotton candy!", "title": "Great resort just off the strip!", "helpfulness": 1, "user": "Dave_Hooksett_NH", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25333430}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I stayed here both in October and in December of 2009. It is in a great location directly across from Planet Hollywood and City Center just off the Strip (literally a 5 minute walk). The construction that blocked the road leading to the hotel has been opened as of December. It is also important to note that this is a timeshare hotel. While Marriott is not pushy about their timeshare sales, this is also not a full service Marriott. Platinum members do not automatically get upgraded and there are minimal services on the premises that you would normally expect like a hotel restaurant. That being said, the free valet parking is an extreme plus for the hotel. The standard room is quite big and the villas are actually suites complete with a full kitchen, separate bathtub, and two headed showers! Views of the new City Center can be requested. The pool is small but the hot tub is nice. If you are looking for a hotel with a wonderful, expansive room and are willing to overlook the other full-service hotel amenities, this is the hotel for you.", "title": "High-Quality Villas (Suites) at a Good Location", "helpfulness": 3, "user": "dnumgis02", "date": "May 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63358893}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We stayed here with our 3 teenagers-we booked a 2 room villa-had 2 full bathrooms, huge soaking tub, double shower in the master-super clean and fresh-great views of the strip.", "title": "Perfect for families to relax off the strip", "user": "Mudturtle", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62539157}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our only problem-very minor-one cabinet door in the kitchen was loose-my husband called the front desk and within minutes-Carlos was at the door with his tool box and had it fixed with a new screw-he even left us a few chocolate bars for our trouble.", "title": "Clean and Quiet...much recommended", "helpfulness": 3, "user": "Gillt1", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61861583}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The roof top pool was heated comfortably-it was April and the outside temps were in the 60's. The kids enjoyed swimming and the Jacuzzi was clean and clear. The Bar was small but fine for us-", "title": "Beautiful Hotel, Great Location", "helpfulness": 2, "user": "Autum07", "date": "April 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 61762780}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Walking was easy to New York NY and the Bellagio and Paris- I would recommend driving to other locations-the parking was free everywhere and it saved our feet-", "title": "Love the Grand Chateau!", "user": "nwb", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61715369}, {"rating": 5.0, "title": "Great location", "text": "Right off the strip. Across from Planet Hollywood. The one bedrooms are great with the kitchen, washer dryer. Staff is very helpful. Upscale. It is nice not to have a casino on site. Pool is very small.Try Ellis Island . It is walkable and is a great rib and brewery.", "helpfulness": 1, "user": "panzer03", "date": "March 9, 2010", "id": 58162100}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed at the Grand Chateau and the service was impeccable. The attendants and the front desk, concierge and valet service were outstanding. They accommodated my request for early check in and a view of the strip. We do wish they had an indoor lounge or bar to get drinks. There were many nights the upstairs outdoor bar was closed due to weather. The rooms were beautiful and very clean.", "title": "The Grand Chateau was awesome and very accommodating", "helpfulness": 1, "user": "KKW0019", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57511913}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "For a trip to Las Vegas this venue has it all. Located one block off the strip between MGM and The Bellagio, it is central for most things, but far enough away from the strip itself not to be bothered by noise - great combination! Accommodation was clean, roomy and the staff were friendly, attentive and professional. Parking is all via the valet service who were consistently efficient and friendly when returning the car.", "title": "Excellent Venue", "helpfulness": 1, "user": "acdc_10", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57358271}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Took a gamble and decided to spend a full week in Vegas with my husband and in-laws. They have a timeshare through Marriott and invited us to join them in the two-bedroom condo. The room was great! Beautiful views (we were on the 25th floor facing the strip), spacious and all the amenities you need for a long stay. Loved having laundry and a dishwasher and the 2nd bedroom even had its own kitchenette.", "title": "Vegas felt like home at the Grand Chateau!", "helpfulness": 2, "user": "sjmatuska", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56872130}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Service was wonderful, the staff was very helpful and we LOVED our poolbar bartenders! Speaking of - we got VERY lucky with the weather for early February and they opened the rooftop pool and Sky Bar. Sadly after the first day they started some renovations, but kept the loungers open to take in some sun, as well as the bar. We were able to use our room keys at both Planet Holleywood and Polo Tower's pools, however and spent a day doing so. By the end of the week they were done with renovations and we enjoyed one last day of luxery. The bar is great - open til 7 and the bloody mary's are to die for! The view from the roof is incredible as well overlooking the new city center and Aria.", "title": "Quiet, clean hotel", "user": "G-father_06", "date": "February 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56560846}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My spouse and I stayed at this hotel for three nights as part of the timeshare presentation promotion. The studio room we stayed was very clean. Studio rooms are not equipped with washer/dryer, but there are several free washer/dryers inside the hotel. The fitness center is equipped with up-to-date equipment and sauna. The hotel does not automatically provide the wash cloth for the bathroom, but provided upon request. Since you have so many choices of hotels in Las Vegas with good deals, I think the regular price for the studio room is a bit high. It's a well maintained timeshare property that might provide a good value for a family or group of people who want to use kitchen to save money.", "title": "Clean room and good location", "helpfulness": 3, "user": "Fortwood", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 26747446}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Stayed here for a week in the middle of january of 2009. The weather was really great for the time of year. Usually it is not so wonderfull. So many short sleeved people.", "title": "A great location at the Las Vegas Strip", "helpfulness": 2, "user": "DutchyCan", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 26718126}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The Marriott is not on bat at the Strip. With a 1 to 2 minute walk you're on the Strip. It is located behind the Harley Davidson restaurant.", "title": "Excellent location and lodging.", "helpfulness": 3, "user": "Drewsgrammy8", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26630179}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "This Marriott is one of the Vacationclub resorts from Marriott, but with a few different detaild. First of all: the location: it is probably located better then most vacationclub resorts. Often they are away from the city centers or places of interest, so you need a car. (Well, some are on the beach, which can be a good location if you just want to relax). Here the parking is valet parking, which works very well. And it can be handy to use a car to get around (shopping malls or even other hotels on the strip... the strip is long...).", "title": "Very Pleased", "helpfulness": 3, "user": "crbncrsr", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 26529917}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We were with friends and stayed in a two bedroom apartment. The views are nice. The two bedroom appartment a bit smaller then in an average vacationclub (the kitchen and living room area for instance), but you get all you need, as always. The rooms look nice, the kitchen is handy (for some shopping and taking breakfast and a late night snack).", "title": "A dream come true!", "helpfulness": 4, "user": "arlene123", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26034708}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We are Marriot owners and traded out a 2br in Ft. Lauderdale for a 1br at the Grand Chateau and were quite pleased. Well appointed and decorated. Kitchen and bathroom were roomy, and with quality appliances and fixtures. Check in and check out was a breeze, and the staff was very helpful...especially when I pulled the dumb guy move and forgot it was Valentines day...(...we were in Vegas after all...all the days run together). Anyway, Paul...I think that was his name...at the concierge jumped through hoops to help me out...I mean, save my butt! As most reviewers have said the location is ideal. 1 block off the strip, which definately cuts down on the noise. (see my photos) Also, all the other reviews were very helpful regarding groceries, etc...so I won't rehash all that. We were in town for a photogaraphy conference which was being held at the MGM and it was maybe a 10 minute walk to get there. Bally's is about 15 minute walk...the show at the Jubilee Theater is a must...traditional Vegas! During our stay I'd estimate occupancy was only about 30% so it was very quiet. The weather was cold 35 -45 degrees, and windy with occasional showers. Pretty crummy weather, but the bar on the roof was open a few hours during the day...the bartenders weren't happy to be there...can't blame 'em I guess, I hate cold weather too! I just ordered more cocktails and enjoyed the view...the view from the rooftop is incredible! Great for photos! Again, as most reviewers have said the pool is small...there weren't many people in while we were there and I certainly wasn't going to venture in..although it is heated. I'll include a good picture of the rooftop. I really only have one suggestion...don't use the ice in the freezer's automatic ice maker. Dump it out in the sink, wash the bin, and use the public ice machine...on our floor it was right by the elevators. I live in Costa Rica and think I've got an iron stomach...but it wasn't enough to combat the water in Las Vegas. All in all, as I said at the top we were quite pleased, and when we get back to Vegas we'll be staying at the Chateau.", "title": "Comfort, location & privacy", "helpfulness": 4, "user": "John P", "date": "February 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25114344}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "First off, this property is a Marriott Timeshare so dont expect full service amenities such as a restaurant, room service, etc. However this property does offer complimentary valet and bell service and has a small marketplace with goodies and Starbucks coffee and Concierges to help you with your vacation activities.", "title": "Time Share with Great Location and Service", "helpfulness": 7, "user": "alexsndiego", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24791326}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We had a guest unit/studio. This was alright for us for just 2 nights. The unit had a small frig, microwave, sink, plates, glasses, and coffee maker. The guest unit has a king bed. We found the unit to be really clean and comfortable. The guest unit has an ordinary shower. Not the \"his and hers\" shower heads in the Master Villa.", "title": "Would love to go back!", "helpfulness": 2, "user": "Getawaygal43", "date": "February 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 24744782}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "Valet service was quick despite the long line of people checking out after a Presidents Day weekend. They worked their hardest to get our vehicle. The property has a shuttle which can take you to the Fashion Show Mall on the north end of the strip near Treasure Island and Wynn/Encore. Shuttle driver knew all the shortcuts to get around the parking lot that is the Strip.", "title": "Ladies weekend in Las Vegas - GREAT", "helpfulness": 1, "user": "Dawn868", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 24152352, "likes": {"liked": "— Rooms and Concierge Services", "disliked": "— No Resturant - Complete in 2010"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Used the concierge service and never once was asked to attend a timeshare presentation. Thank goodness! We already own at Marriott Canyon Villas in Phoenix and dont need another week.", "title": "Great Location Great Hotel", "helpfulness": 3, "user": "vacationsamany", "date": "January 27, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23944341, "likes": {"liked": "— New Property well equipped room", "disliked": "— No food service small pool"}}, {"rating": 3.0, "title": "Nice Location & Service - Light on Amenities", "text": "We went for a 2 night stay. It was close to the Miracle Mile. We walked to a couple of places on the Strip. We had to attend a time-share presentation which isn't ever what I want to do. Staff was nice but no restaurant. Room was clean but smaller than we expected. Road work was a pain. All valet parking which was quite nice except for the last younger guy with a sense of entitlement but not helpfulness. Based on location I might stay there again, but I'd probably try to find a better deal.", "helpfulness": 1, "user": "huntmkdm", "date": "February 19, 2010", "id": 56531374}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Stayed here for three days. Had expected there to be four of us, so had two bedoom unit, second bedroom of which was a studio. There was heaps of room for just my husband and I, who travelled alone after all. The G.C. is in a great location opposite an entrance to the Planet Hollywood mall with loads of opportunity for eating. Perhaps because the G.C. is so close to all that is in-your-face in Vegas, it is lacking in facilities itself. The only bar is on the roof (great in summer, but not great in rainy January). There is no real lounge area and no restaurant. That said, we enjoyed our stay. It took me 24 hours to realise that the constant hum in the apartment wasn't the air con or the heating but the traffic below! Given that we were on the twenty somethingth floor, that gives you an idea of what the noise at street level is like! The G.C. was a great escape from all that is brash and tacky about Las Vegas and we enjoyed our stay.", "title": "Really comfortable stay in Tacky Las Vegas", "user": "sallymarch", "date": "February 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 56240385}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Loved it. We stayed in the 2 bedroom- the double shower was elegant and the rooms appeared brand new. Great views of the strip and city center.", "title": "Great place and location", "user": "NOsnow-gottago", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55983138}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "This hotel is very nice from the time you walk into the lobby. The staff was friendly and helpful. Our room was a two bedroom villa. The room was very nice and clean. A large flat screen t.v. was mounted on the wall. It had all of the amenities you needed. The only things that kept it from getting a five star from me were the following: The shower in the master bath had dual heads. One of the heads would not put out any hot water. Maintenance was called three times but could not fix the problem. Also the dryer did not work right and it took about 3 hours to dry clothes. We took the clothes to one of the many free full size dryers located on various floors and dried the clothes rather quickly. Lots of noise from the hallway when people stumbled in at daybreak.", "title": "Nice hotel with a great location.", "helpfulness": 2, "user": "apdarmy", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 55955812}, {"rating": 5.0, "title": "Great Vacation away from the Snow", "text": "The location was awesome! The strip was within walking distance and Planet Hollywood Casino and Miracle Mile Shops were across the street. Overall I would definitely stay here again and recommend it to others.", "user": "redgeton2", "date": "February 14, 2010", "id": 55916165}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3.5, "variance": {"poor": 34, "average": 97, "very good": 386, "terrible": 16, "excellent": 597}, "aka": "Marriott`s Grand Chateau Hotel Las Vegas", "slim_ranking": 0.122222222222, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}