{"user_rating": 3.5, "review_count": 2656, "name": "Marriott Frenchman's Reef & Morning Star Beach Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Just came back from our Thanks Giving vacation at St. Thomas and we had split our vacation between Marriott Frenchman's Reef and Bluebeard's Castle. So we actually had the advantage of comparing the two hotels.", "title": "Great Facilities, Food Price Steep", "helpfulness": 19, "user": "Moonrivernyc", "date": "December 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6315325, "likes": {"liked": "— Facility, Pool", "disliked": "— Room Quality, Food Price"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Marriott was more like a hotel to us (whereas Bluebeard's Castle was more like a condo stay with kitchen facility), the room had nice furnitures, small bathroom, great balcony with ocean/harbor view but our room leaked on the 2nd day we were there. The manager immediately offered to switch us to the 2nd floor which had much better ocean view. She apologized for the incident and was very nice and helpful about other needs we had.", "title": "Just average", "helpfulness": 17, "user": "xxxxxxxxxxxxxl", "date": "November 28, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 6231547}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "What I liked about Marriott was their facility. They have a much better(Carribean looking) pool near Morning Star residence (beach level) and another okay ,large pool just a few floors down from lobby. The tennis court was not maintained well nor was the weather condusive for playing tennis 10:00am - 5:00pm when the sun can burn you, so the tennis court was not much use for us, however, we did use the two pools to a great extent.", "title": "Mold, Mildew, lies, and a few other problems.", "helpfulness": 19, "user": "travelblog3", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 6177145, "likes": {"liked": "— The View", "disliked": "— The mold and mildew in the room from the leaky ceiling"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "If you want the ocean view, Marriott cliff side rooms and Morning Star side (beach level) rooms are the best, otherwise, the harbor side view is good as well (Harbor view is not as good as Bluebeard's Castle) but you may get bordered by the construction down there for the Marriott Vacation Club. What I also learned is that the harbor side building was a little older since Marriott had originally purchased the building from Holidays Inn.", "title": "Fabulous place for a honeymoon", "helpfulness": 17, "user": "MissKaren7", "date": "October 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6026029}, {"rating": 2.0, "title": "Marriott Frenchmans Reef was nice but ...", "text": "Marriott has its own ferry to downtown Charlotte Amaile for $6/per person which is the same as a per person taxi ride. Taxi ride from Marriott to Red Hook (To St. John Ferry) is about $10/person.", "helpfulness": 9, "user": "mcavallaro", "date": "October 25, 2006", "id": 6010480}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We just returned from a week visit over Christmas and I have to say that I was very disappointed with the Marriott product. It’s an expectations thing. As a Gold Marriott Rewards member, I expected more from the category 6 rating. I generally like Marriott – read Gold member, but this place let me down. Several other publications rated this property as 4 stars and in my opinion it’s more like 3 or less. My experience is consistent with a number of the less than flattering postings to this site.", "title": "Disappointing 3 star", "helpfulness": 8, "user": "mfeinberg", "date": "December 27, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6503623, "likes": {"liked": "— Beaches", "disliked": "— Disrepair"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "If you are looking for a 2.5-3.0 star property with great beaches and you don’t really care about service or the condition of your hotel/room, then this place is ok. On the other hand, we saw cockroaches in our room each night. Much of the hotel staff was typical for the region – less than pleased that you were there. The food was so, so and overpriced.", "title": "Nice Property", "helpfulness": 9, "user": "buckeyez", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6500989}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The hotel is in need of a face-lift. Many areas have fallen into disrepair. There is a considerable amount of water damage throughout the property. Broken light fixtures, cracks in the buildings, the pool was filled with debris and garbage from drinks and food packing. The carpeting on our floor, #7, had so many stains – it was filthy. In the Black and White Market shop off the lobby, not only had the ceiling gotten wet, but also in areas in the store the ceiling is falling down exposing the ceiling. Being from Florida, I can tell you mold and mildew can cause serious health problems for people and if there is a serious problem there, where else could it be?", "title": "5 Days at MorningStar with kids", "helpfulness": 35, "user": "FullGallop", "date": "December 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6481962}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Here’s another thing. We rented a car for the week since we had five in our group and taxis in St. Thomas are charged by the person. When we pulled up to the hotel, there were no bellmen. I unloaded all of our suitcases and I had to park the car - No valet. The walkway from the parking garage to the hotel reeked of animal waste. Apparently, some of the locals had befriended a few wild cats that live under the parking garage. They feed the cats on the walkway. So, each time we walked to and from the car, we passed dirty cat food bowls, paper plates, empty pizza boxes that have rotting food and ants crawling all over. I really like that and one time my 3-year-old yelled “GROOOOOOSSSSS”. No one seemed to clean up anything. Also in the garage, for almost the entire week no one emptied the trash. It went from a full trashcan to a big mound of trash around the can. Again, nice.", "title": "not as nice as other marriotts", "helpfulness": 7, "user": "socalfamilytravelers", "date": "December 21, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6477490}, {"rating": 5.0, "title": "Trip report & Marriott's Frenchman's Reef", "text": "It’s a shame because the location of the property is fantastic. Marriott should put more effort into maintaining the property and less into selling timeshares which we were asked about daily. The views are among the best you will find. Morningstar beach is much less crowded than other St Thomas beaches and its right there along with food, towels and bathrooms.", "helpfulness": 10, "user": "edsgirl", "date": "December 20, 2006", "id": 6476797}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I reviewed all of the post on this website before traveling to Frechmans reef. There are some very negative post about this hotel, but I chose to go there anyways. I will tell you after experiencies they are true. This hotel is not worth the money or the time it takes to get there. Please dont make my mistake it will cost you time and money. Marriot has much better hotels (Aruba or St. Kitts). The only reason I gave this property two bubbles is because the view is exceptional other than that it is overpriced and average. My wife and I love going to warm beach locations. I will start off by saying that I am a big fan of Marriot hotels, just not this one. My wife and I arrived in STT at around 4pm. We took a taxi that had 11 people cramed into a 10 person van and we were charged 22 dollars per family plus tips. We arrived at the hotel around 20 mintues later to check into are dream vacation. I called the hotel about a week before we arrived to inquire about the all inclusive package that they offered. I was told I could purchase it once I arrived. When I got to the front desk I ask about purchasing the all inclusive plan, they told me I have to purchse it before I arrived( i was a little irritated). I had also requested a king bed near an elevator(my wife can not walk long distances because of medical reasons). We ended up with to double bed away from the elevator and the room was dirty. I was getting mad at this point but I thought I was just irritated because we had traveled so much that day. All I wanted was to drink a glass of wine and sit in a nice warm hot tub. While my wife was unpacking I went to check out the pools, beach, and hot tub. The pools were filled with sand and cold, the hot tub was cold and the jets did not work, and the beach was small and it was a long walk down the stairs. But they do have an elevator that will take you down to the beach (but it was broken). I walked down to the morningstar to check out their pool and it was much of the same as the frenchmans reef pool ( just average at best). To make a long story short we were so dissapointed that I spent $1200 dollars to change my flight and went and stayed at the Marriot in St. Kitts. It was the best decision I ever made.", "title": "Don't waste your time!", "helpfulness": 8, "user": "Vacationclubowner", "date": "January 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 6594569, "likes": {"liked": "— The View from the hotel", "disliked": "— Everything"}}, {"rating": 4.0, "title": "People Need to Relax", "text": "I'm from NY, and after reading many of the reviews on this site, I believe the Marriott in St. Thomas is getting unfairly knocked. I stayed at the Frenchman's Reef portion (as opposed to the Morningstar units which are right on the beach) for 9 days starting shortly after Christmas with my family which includes 2 children. The rooms are what you normally expect from a Marriott (clean and comfortable--nothing fancy), but if you are lucky enough to get an ocean/harbor view (which we had), the sight of cruise ships passing back and forth while sitting on your balcony will make you feel the upgrade was worth it. I travel quite frequently, and the rooms themselves are no better/worse than any other Marriott I've been to (includes Marriott Marquis, Boston Long Wharf etc.)", "helpfulness": 16, "user": "jc551", "date": "January 14, 2007", "id": 6590487}, {"rating": 2.0, "title": "Not up to par", "text": "Food:", "helpfulness": 14, "user": "WashingtonDCRunner", "date": "January 2, 2007", "id": 6539055}, {"rating": 2.0, "title": "Great location, but...", "text": "Food was excellent at Havana Blue (on-site--we ate there 5 nights), and was OK for dinner at Windows on the Harbour. Breakfast buffet at Windows was typical Marriott buffet style--which as usual, was very good. Coco Joe's and Sunset Grill were both OK for lunch, although I would give Sunset Grill the nod. Staff was friendly and attentive at all of the restaurants.", "helpfulness": 15, "user": "StevePOrlando", "date": "January 1, 2007", "id": 6532530}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Beach/Pool:", "title": "Frenchman's Reef Lousy customer service!", "helpfulness": 8, "user": "Wazzi", "date": "December 28, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6508760, "likes": {"liked": "— beach", "disliked": "— service"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "We were in St Thomas for the first time in January and I was really pretty disappointed in this hotel.", "title": "okay, wouldn't go back", "helpfulness": 4, "user": "gee_ess61", "date": "January 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 6705247, "likes": {"liked": "— convenience to downtown shopping", "disliked": "— the room"}}, {"rating": 3.0, "title": "Frenchman's Reef was Fine", "text": "First, our room was on the first floor which is really the basement level. When you get off the elevator the hallway is dark and the ceiling low. Granted, it gets better down the hall, but not much. Our room was terribly musty smelling and we considered changing but thought we could air it out. Not so. In fact, the problem actually worsened as the week progressed. There were small rain showers each day that week and I think that contributed to the dampness of our room. My clothes felt damp and so did the sheets on the bed. Also, the phone receiver smelled so bad I could hardly stand to use it. It definitely was a moldy, \"these towels have been sitting in the washer too long\" type of smell. Awful! We asked them to take care of it and I couldn't see any difference.", "helpfulness": 12, "user": "MGanoush", "date": "January 21, 2007", "id": 6634655}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Third, our airconditioner leaked for the last three days of the trip. Each morning I called and I could always tell they had been in the room, but what they did to fix it was unclear. Finally someone left us a note to keep the chair pulled away from the unit (like three or four feet away) which was a little ridiculous since this put the chair in the middle of the room. In addition, the room was quite worn and the bathrooms very small for this type of hotel.", "title": "A long trail for nothing", "helpfulness": 10, "user": "ScotlandSandy", "date": "January 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 6615894, "likes": {"liked": "— nothing", "disliked": "— having to use taxis all the time"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2004, traveled as a couple", "text": "The staff were nice and it has a nice lobby. We ate at HAvana Blue which was very good. I understand it is now owned independently of Marriott so that may be why it was good. Cocoa Joes was frustrating at best. The service was only fair and so was the food. It is definitely a choice for lunch but that is all I would recommend.", "title": "Nice, but has seen better days", "helpfulness": 6, "user": "poondoggle", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6612309, "likes": {"liked": "— Beautiful beach!", "disliked": "— Seems to be getting a bit run down... or just old"}}, {"rating": 3.0, "title": "Nice place - but better off going to antother island", "text": "Overall, our trip was okay. I think St Thomas is a nice place to visit - great jewelry shopping. And, this hotel is quite convenient when it comes to catching the water taxi to downtown shopping. However, the hotel is in serious need of updating.", "helpfulness": 8, "user": "JupiterFamilyMan", "date": "January 16, 2007", "id": 6606055}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 284, "average": 462, "very good": 930, "terrible": 187, "excellent": 793}, "aka": "Marriott Frenchman`s Reef & Morning Star Beach Hotel", "slim_ranking": 0.285714285714, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Frenchman's Reef Resort has just completed a $48 Million Dollar Renovation, and is now open and all new and refreshed. Now featuring clean crisp new guest rooms, with flat screen TVs. All new resort experience featuring a new resort infinity pool, children's splash zone, adult infinity pool and bar; and private spa pool. Our all new Lazule Sea Spa is now open featuring extensive treatment rooms, salon, state of the art fitness center, and private pool spa with cabanas. Aqua Terra is our new restuarant at Frenchman's Reef which features spectaular views of the harbor. Come visit us at Marriott Frenchman's Reef and Morning Star Beach Resort; and discover the most luxurious stay in the US Vigin Islands."}