{"user_rating": 4.0, "review_count": 591, "name": "Marriott Manchester Victoria & Albert Hotel", "reviews": [{"rating": 2.0, "title": "A Let Down", "text": "We have stayed at a few Marriotts before and enjoyed all our stays and we know Manchester well so we were'nt going to be surprised by the busy but convenient location and we also didnt expect stunning views but what I didnt expect was to be overlooking some storage containers and piles of rubbish on the old Albion Market TV set.", "helpfulness": 1, "user": "Bexat4", "date": "December 13, 2008", "id": 22693629}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The family room was very cramped and isolated at the very far end of the hotel, the heating didnt work and with a loose window we thought we were in ice station zebra.", "title": "An escape in the City", "helpfulness": 2, "user": "5starTilly", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21738172, "likes": {"liked": "— The service", "disliked": "— honestly couldn't fault it!!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The staff though were very friendly to the usual Marriott high standard and the breakfast was very good, the breakfast area could suffer if there was a major rush on though because of its size, again very small due to the building being a warehouse conversion. Yes it looks the part externally and internally but I would shop around for another hotel next time. We only stayed one night but really expected more.", "title": "Comes highly recommended!", "helpfulness": 2, "user": "tooshortda5foot5", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21731087}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Having stayed in Manchester City centre before, I have found there is a great selection of hotels.", "title": "Felt at home", "user": "Luis7804", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20718869}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "On this visit however, I wanted some where that had the immediate accessibility of the city, but had the luxury of a country club type hotel. I found the Victoria and Albert to provide me with all this and more. The hotel has a very modern yet cosy feel, which is hard to find in a city where many of the hotels are the obligatory glass and steel structures.", "title": "Great service and ambience in the heart of Manchester", "user": "farrj", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 20631790, "likes": {"liked": "— Quality of accommodation and service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed 1 night at the Marriot V&A on Valentines Day and it was amazing. You can catch the free bus from Manchester Piccadilly station that will drop you near the hotel.", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "Koko04", "date": "March 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6932864, "likes": {"liked": "— Beds", "disliked": "— Small Restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Checking was fast and the concierge was very helpful. We had a Dinner& Breakfast package and the food was lovely. They had a special Valentines menu with free champagne. The room was nice and the bed was incredibly comfortable. We were happy to have a late checkout as it was hard to leave that bed!", "title": "Fantastic experience", "helpfulness": 2, "user": "Poppy30", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6850815, "likes": {"liked": "— The hotel has some beautiful features from its days as a mill", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "Great choice for Manchester.", "title": "Nice Place To Stay", "helpfulness": 5, "user": "KSergey", "date": "February 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6805655}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I stayed here with my husband and daughter and was absolutely stunned at how brilliant this hotel is. The staff are friendly and courteous and can't do enough for you. The hotel itself is in a beautiful converted mill building which has managed to retain it's character whilst offering travellers all the modern conveniences they expect. The breakfasts are also great.", "title": "Stunning service", "helpfulness": 5, "user": "Owins", "date": "February 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6763154, "likes": {"liked": "— The Bed", "disliked": "— Lighting"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the V&A for two nights (Fri & Sat) when we drove up to Manchester to celebrate a cousin's wedding. The hotel was one of those he recommended to us and we are very glad we chose to stay there. The hotel is gorgeous. We loved the converted warehouse and the fact that they had kept a lot of the old features, such as beams and open brick walls. We didn't mind the \"industrial\" views - we don't usually select a hotel for its view anyway.", "title": "Definitely our first choice next time we're in Manchester", "helpfulness": 3, "user": "EaglesFans", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7292350, "likes": {"liked": "— The overall feel of quality", "disliked": "— The minor irritation caused by the lack of organisation in keeping the breakfast buffet topped up."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "We spend a lot of time in American hotels and this one certainly had something of that kind of feel to it. Very smart and polite staff, check in was smooth and fast. We didn't have any problems during our stay but feel sure the staff would have been perfectly able to deal with them if we had.", "title": "Better than a lot of Five stars", "user": "hamaudit", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7291271, "likes": {"liked": "— Great rooms and the bar & Reception staff were very friendly", "disliked": "— can honestly say their was nothing - perhaps the tiles in the bathroom could have been a bit warmer!!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We used the valet parking which was £12 per day but we were happy to pay that and alternatives would not necessarily have worked out cheaper in the end.", "title": "Great surprise celebration", "helpfulness": 1, "user": "tlrobo", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7286475, "likes": {"liked": "— Levels of service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Our room was on the first floor, lots of space, lovely bathroom. Everything was very clean and well looked after. The air con was set to cool which is just right for us. We had to search a bit to find the tea & coffee tray as it was stored in the bottom section of the desk. Even though softer than we are used to, the bed was comfortable enough, a good size, even though we prefer king and this was listed as a double but more like a queen. There were plenty of good pillows which always ups our evaluation of a room.", "title": "Amazing room", "user": "ocalllo", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7269076}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We ate in the lounge bar the first evening. Waiting staff were excellent and the food was very good. The seating is split-level and the tables by the window have a view over the river. It's not a very pretty view but then the hotel was a warehouse.", "title": "Lovely hotel", "user": "LAR82", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7244827, "likes": {"liked": "— The huge bed"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Had a wonderful stay in the V&A. The whole experience could not be faulted. The location of the hotel is very good - within walking distance of plenty of shops and restaurants.", "title": "Fabulous!", "helpfulness": 1, "user": "jpac", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24026554, "likes": {"liked": "— Outstanding service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The room was really beautiful and quite spacious. We stayed for one night dinner, b&b for GBP125 for two which I thought was great value. I booked this on the hotel's website. The dinner was lovely as was breakfast. Another plus was that the room was ready for us upon arrival at 11am.", "title": "Good warehouse conversion, excellent staff, but lacking value for money.", "helpfulness": 2, "user": "dac60", "date": "January 18, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 23657138, "likes": {"liked": "— Character and a nice bed", "disliked": "— value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Throughout our stay, the service we received was excellent. The staff had good local knowledge and were able to advise on public transport and the best way of getting places.", "title": "A really lovely hotel", "helpfulness": 1, "user": "Maria B", "date": "December 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 23030385, "likes": {"liked": "— Beautiful conversion keeping lots of original building exposed.", "disliked": "— Room alittle smaller than I'd have liked, but not a major problem."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "Trying to find an excuse to return to Manchester and this fabulous hotel!", "title": "Great location,", "helpfulness": 1, "user": "Frampsta", "date": "December 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22934228, "likes": {"liked": "— Location", "disliked": "— No WiFi"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "We only stayed for the one night whereas we would normally do the two night weekend special. The bill came to £246 for two in a luxury room with dinner and breakfast. The room was lovely with a settee, coffee table, easy chair aswell as the usual desk and chair. The King bed was also lovely with good quality linen, many pillows and all was very clean. All the ceilings are wood with large metal pillars, most walls are exposed brick, all of which gives a good warm feel and character. The bathroom was a bit disappointing being very ordinary. This maybe because we have been spoilt at the likes of Quebecs in Leeds, Mayango in Leicester, Park Plaza Cardiff, and the White Hart in Lincoln where the bathrooms are superb.", "title": "A little disappointing", "user": "RedDevil76", "date": "December 19, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 22857036, "likes": {"liked": "— Leaving!", "disliked": "— The attitude of the staff"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "We could not understand why this hotel is rated so highly amoung the hotels in Manchester. Maybe we are too fussy.", "title": "Don't see what others see in it. Boring commercial feel.", "user": "ARGC", "date": "March 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 25755146}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Even though we had stayed at the wonderful Midland Hotel in Manchester the night we would be giving this hotel a poor rating on absolute terms rather than by comparision.", "title": "Excellent facilities and service", "user": "Hallvard7", "date": "March 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25527060}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "We stayed for a function that was being held there and felt it would be OK to stay given it's high rating and convenince. We should not have bothered. What can I say. Boring commercial feel, same as anywhere else, multinational staff most of whom had problems speaking and understanding English, boring food and a lovely view of the canal from the Resturant complete with floating debris and shopping trolleys.", "title": "Over-booking", "user": "LizDLondon", "date": "March 2, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 25427564}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The room was very clean but poaky.", "title": "Great Hotel, Great Service, Great Location", "user": "RTP_7", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25107917}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I stupidly left my mobile phone in the room. My fault, yes but when I phoned them about it they wanted to charge me rather alot (at least double the price of special delivery) to post it back. I said that I would come and pick it up one evening so I was advised that it would be avaialble at the desk when I got there. Unfortunately it was not and the day safe was locked. This do not do alot to impress me although they did post the phone to me for free after that!", "title": "Manchester United", "helpfulness": 7, "user": "Brklynrider", "date": "February 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 24368021}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed in a superior room and were very pleased with it, the decor was really modern and we loved the wooden beams. The bed was massive and really comfortable, we had dinner in the hotel and even though we did'nt get down from our room until 9.55pm (dining ends at 10pm) they said it would'nt be a problem which I thought was very good of them, I would definately recommend this hotel it is without doubt the best Marriott hotel I have stayed in.", "title": "Really enjoyable stay", "user": "hayleyollie", "date": "March 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7230727, "likes": {"liked": "— The lovely rooms", "disliked": "— the lack of free parking"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed here for one night to go to see a match at Old Trafford. Hotel was great, we arrived before normal check in time but this was no problem and we had a large room with 2 double beds. Beds very comfortable with a lovely duvet, I could not fault the room at all. We ate in the bar and although the food was good service was very slow and this was the case again at breakfast, but this is my only complaint. We ate at an Indian restuarant round the corner, Akbars,(about 5 min walk, on Liverpool Street) and I would definitely recommend it, one of the best Indian meals I had ever eaten. The hotel is in a good local and less than 10 min walk to tram station which will take you to Old Trafford in three stops if going for a match, I would definitely stay there again.", "title": "Great Hotel", "helpfulness": 1, "user": "hubble", "date": "March 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7196480, "likes": {"liked": "— Beds!", "disliked": "— Slow service"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Myself and a friend stayed at this hotel for 2 nights in early March (Room 307). Although I cannot fault the hotel décor, helpful staff, excellent breakfast buffet (as the majority of other reviews here have stated), the standard of soundproofing (or should I say total *lack* of soundproofing in the building) totally spoilt our stay. Firstly, the room next door to ours had an interconnecting door (albeit locked) between their bathroom and our room. I have never had experience of this set up before? Fine for people from the same group but not acceptable with 2 separate bookings. Noise from the bathroom (which was obvious, I won’t go into detail, everything could be clearly heard). The couple in the next room talking in the bathroom and sounding as if they were actually in our room (note: they were just talking at normal ‘level’ not shouting but still clearly audible, could make out every word that was said). In addition the noise protection between the floors also seems non-existent. Again, not noisy people but I was woken up at 2.30 pm (morning of 3 March) by the guests coming into the room upstairs (just walking across the floor, i.e. just ‘living’ noise). It was more like being in a normal house and being able to hear all movements/conversation from upstairs. On the 2nd morning (4 March), I was awoken at 3.30 pm due to the guests in the adjoining room coming in and using their bathroom. There also appears to be large gaps under the doors which, I would have thought, is not conducive to good protection against fire spreading?", "title": "Take Ear Plugs !!!!", "helpfulness": 1, "user": "FSWKent", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 7192979}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "On the Saturday, having experienced one disturbed night in this room, my friend had to go out and buy earplugs in order to get any chance of a good night’s sleep. I spoke to the hotel Manager but, although very polite, he appeared unable to help us as the hotel was full so there was no alternative room to move to. He did say that the adjoining bathrooms have caused problems in the past and that a lot of the rooms are set up this way with interconnecting door to the next room’s bathroom. WHY? I have heard of ‘family’ rooms that are set up in that way but not to the degree that a lot of the rooms in a hotel are the same and guests, who are not even related, have to share each other’s ‘bathroom noise’. The Manager also said the problems are caused as it is a Listed building and, when it was converted into a hotel, this limited what type of soundproofing could be installed in the property.", "title": "Easily met our high expectations", "user": "howl", "date": "March 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7155148, "likes": {"liked": "— Location, room size and quality, cleanliness, bar.", "disliked": "— Could do with nicer views, but that's Manchester's fault, not the hotel's!"}}, {"rating": 5.0, "title": "Amazing", "text": "I have written to Marriott Guest Services about my experience and, obviously, I would not stay at this hotel again and cannot recommend. It's a shame, as all the other amenties were excellent, but if you can't even get a good night's sleep it obviously puts you off returning.", "user": "Gracie10", "date": "March 12, 2007", "id": 7148257}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We have just come back from a one night stop at the V & A. The first problem was on check in. My credit card was swiped and i was asked to confirm for £170!! The room should have been £120 per night. So i asked what this extra £50 was for & i was told that it was a security bond & it would be refunded on departure. That was fine but why wasn't this explained before passing me the handheld card reader! I had quite a flush of panic!", "title": "Not as good as other Marriotts we've stayed in", "helpfulness": 2, "user": "SARobinson", "date": "March 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27161182}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The room was ok, smaller than other Marriott rooms we've stayed in, but no cheaper. We had booked a deluxe room, but nothing was deluxe about it, just a standard Marriott room. We asked about this at reception and we were told that all the rooms in the hotel were deluxe! I feel this term is therefore a bit misleading.", "title": "Lovely, luxurious hotel !", "user": "GegsLiverpool", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 26866183}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Everything was clean and tidy, location to central Manchester was great, just a short walk.", "title": "Not worth the money", "helpfulness": 2, "user": "pg1403", "date": "March 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 4.0}, "id": 26503516}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Car parking was £13.", "title": "Overrated", "helpfulness": 2, "user": "senjat", "date": "March 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 26064976}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "No on site pool, although you could use one at a local health centre. Not sure how far away it was.", "title": "Better than I thought it would be.", "user": "Castringblue", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25848806}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We were here for a concert at the MEN. The hotel is well unattractive, too far from the center of town, frumpy furniture, but excellent front staff.", "title": "Is this the best for Manchester?", "helpfulness": 2, "user": "cj15", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 7608873, "likes": {"liked": "— check-in", "disliked": "— everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "At check-in the service was quick and helpful. The room itself was not properly cleaned, used hair wrap in the shower and robes not clean. So, they upgraded us to one of their best junior suites. The furniture was still old looking and the sofa was the kind you just fell into. I was disappointed. The tea/coffee services looked old and burnt on the edges. The turn down service included two chocolates on the bedside and nothing else. I left a note for more coffee, but it was ignored.", "title": "Comfortable and cosy", "helpfulness": 2, "user": "paulieuk", "date": "May 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7588026, "likes": {"liked": "— Clean comfortable rooms", "disliked": "— A little on the fringe of the city centre"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "As soon as we arrived, the parking attendant wanted to know if we will pay the 12gbp.", "title": "Disappointed", "helpfulness": 5, "user": "Rosso", "date": "April 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 7417741, "likes": {"liked": "— not much to be honest", "disliked": "— Noisy and full of cigarette smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Breakfast was very poor. Nice selection but I should have gone elsewhere. The eggs were overcooked and the toast burnt, but shockingly, she still tried to serve them as as is!!", "title": "Goom rooms, friendly service good staff", "user": "FortuneofWar", "date": "April 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 7415000, "likes": {"liked": "— Great beds and linen", "disliked": "— lame hair-dryer"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "This was the worst Marriot experience we ever had. I see nothing to recommend here, except for it is a comfortable bed.", "title": "Great Hotel", "user": "johnlinks", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7379201, "likes": {"liked": "— warm room - deco", "disliked": "— no gym/swimming pool"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 31, "average": 72, "very good": 211, "terrible": 19, "excellent": 258}, "aka": "Marriott Manchester Victoria And Albert Hotel", "slim_ranking": 0.262711864407, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}, "description": "Set in the vibrant city centre on the banks of the River Irwell, the Manchester Marriott Victoria & Albert Hotel exudes a historical charm that appeals to business and leisure travelers. Located across from Granada Television Studios and a pleasant stroll to the Opera House and Palace Theatre, this luxury hotel in Manchester was first built as a warehouse in 1844. The £5.2 million renovation in 2005, displays the old architectural detail with contemporary flair, comfort and services."}