{"user_rating": 4.0, "review_count": 397, "name": "Marriott Minneapolis City Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "My husband and I stayed at the Marriott just one night before going to the Vikings Playoff game. We had a spectacular time.", "title": "Wonderful Romantic Stay at the Marriott", "helpfulness": 1, "user": "benderk", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23296731, "likes": {"liked": "— Location", "disliked": "— Feather Pillows"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Staff: Great! They were very helpful and had good reccomendations on things to do and restaurants to eat at.", "title": "Enjoyed the Marriott", "helpfulness": 1, "user": "KimKDallas", "date": "November 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21732652, "likes": {"liked": "— Connected to the Skyways!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Location: Excellent! Connected by the skyways, we never had to go outside once we were in the hotel", "title": "Never disappointed", "helpfulness": 2, "user": "loonlagoon", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21290516, "likes": {"liked": "— comfortable bed and linens", "disliked": "— None"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Room: Very nice. We stayed in a king room on a high floor. The view was great, the room was modern and the bed was very comfortable. The bathroom was roomy and had nice fluffy towels. They gave ammenities from Bath and Body works. Very nice.", "title": "Comfortable stay", "helpfulness": 2, "user": "NeverUnpacked", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20992808, "likes": {"liked": "— Staff and location", "disliked": "— Self parking arrangement"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I am actually a travel agent and like to check out hotels so I know what to reccomned to my clients. I would reccomend this hotel again and again.", "title": "Reallly nice Marriott.", "user": "Theatrebound", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19352252, "likes": {"liked": "— Comfortable room and bed."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I were welcomed with friendly smiles when we checked in early on Saturday morning, August 1st, thus beginning an incredible hotel experience! We were upgraded to a king executive corner suite, with a 180 degree panoramic view of the city and outlying areas. Yes, we did have a free night certificate earned through Marriott Rewards, but that certificate was for a standard room. We couldn't believe the space and the view when we opened the door!", "title": "Minneapolis Hospitality at its Best!", "user": "MaryWisconsin", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37025474}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "The location was perfect for walking the length of the Nicollet Mall. We only paid $8.00 for the weekend parking rate, but we never took the car out since we were able to easily walk to all the attractions, including the Sculpture Garden. When we came back in the evening, we watched the city lights turn on from our 19th floor vantage point.", "title": "Large Spacious Room", "user": "savvygal", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35392641}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Having read previous reviews, we were prepared for the elevator trek. No need to worry. There are clear directions printed on \"take along\" papers in the elevator waiting area of the parking garage. This waiting area is brightly lit, carpeted, and has security cameras. Once exiting the parking garage elevator, it is a short walk to the Marriott entrance, though it is marked with only a plain double door. Once inside, a security guard at the desk directs you to a waiting elevator to take you to the stunning lobby. Another set of elevators whisk you to your room. (Although we had no problem with the elevator situation, I think it could be difficult for a person with physical disabilities or a family with 3 small children in tow!)", "title": "My favorite in downtown Minneapolis", "user": "go_w0rldtravel", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34224531}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "This is a top-notch hotel in every way. We would definitely come here again, even with a standard room!", "title": "Nice, acceptable hotel", "user": "Travel159549", "date": "June 20, 2009", "detail_rating": {"cleanliness": 4.0, "service": 4.0}, "id": 32767869}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Stayed here for the weekend while taking my daughter and her friend to the \"Twilight Convention\" -- Hotel is conveniently located downtown.", "title": "Hold your nose: This place is bizarre", "helpfulness": 1, "user": "Tripster06", "date": "April 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 28348661}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I was at the Marriot for 4 nights for a conference held at the hotel in a king room on the 9th floor.", "title": "unimpressive", "helpfulness": 1, "user": "tellana1", "date": "April 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 27460735}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "pros: location is great--easy walk from the light rail stop on Nicolette Mall. lots of restaurant choices within walking distance due to the skyways. bedding was comfortable. room was small but layed out well. nice business center with three computers and a copier, plus a seperate computer for boarding pass print-out.", "title": "Loved the conferance, hated the hotel.", "helpfulness": 1, "user": "kfanth", "date": "March 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 27063619}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "cons: even 9 floors up, the street noise was horrible. I'm not a light sleeper but was awakened several times Friday and Saturday nights from people yelling, honking, etc. The people in the next room were talking at what seemed to be a fairly normal level but I could hear it as clear as day in my room. There's no point in all the cushy stuff if you still can't sleep! My shower handle broke on the third day--they were apologetic and did get it fixed but my schedule forced me to go without showering that day (great). I ordered room service and when I asked where the service/tip had been included on the room charge slip, the server's response was \"We have to share everything\" which a) wasn't subtle and b) didn't answer the question. There was also a duplicate breakfast menu that I found just at the edge underneath the bed, implying (to me) that the thoroughness of the vacuuming might be slightly questionable. Some of the towels were also starting to fray.", "title": "the convenience is not worth the ridiculous price", "helpfulness": 1, "user": "dreamingofgreece", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 25087691}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The summary is that this wasn't worth what I paid for it (161/night w/ tax). I am aware that you pay for location but have paid less for nicer hotels in more expensive cities than Minneapolis. I've done quite a bit of travel overseas and have stayed in some less-than-ideal hotel situations without having any issue with them, but I feel like if you are paying this much per night then the details matter and some of the above things shouldn't have been an issue.", "title": "So-so", "user": "arrow628", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25052918}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I looked at earlier reviews and am not sure where people needed the third elevator to get to their rooms, but you do definitely take two. It's a little bit of a pain but does provide increased security.", "title": "Awesome Hotel!", "user": "BradleyandCole", "date": "February 15, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24604478, "likes": {"liked": "— The service!", "disliked": "— Nothing! Everything was great."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Agree with all the previous outstanding reviews regarding location, room quality, etc.", "title": "The Best Marriott Brand Downtown", "user": "PDXBigGuy", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43858990}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Two features that are truly outstanding are the fitness room and concierge lounge. The fitness room is equipped with nearly-new Life Fitness treadmills, striders, bikes, and weight machines; all the aerobic units had indiviual TVs. The room is large, bright, windowed, well-ventilated, and connected to the locker rooms. The Lounge served the best food I've had at any Marriott full-service brand this year (and I've had many) and had free internet access (wired) by the window area with 4 or 5 ethernet cables so you can simply plug into your laptop, in addition to a desktop computer with printer by the door. I found this City Center Marriott one of the best domestically. By the way, the concierge desk in the lobby was extremely helpful about dining and discount cards and is open 7 days a week!", "title": "Great downtown location", "user": "AlishasHubby", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39614115}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This is a great place to stay downtown. Rooms are spacious, bright and comfortable. Many things are within walking distance including shops and restaurants. Room service only runs until 11pm.", "title": "Perfect place to stay downtown", "user": "suomilainen", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39469481}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed three nights at the Marriott City Center and it could not have been a better place to stay! The hotel was immaculate, common areas and the room itself! All of the staff were extremely helpful and friendly! The only downfall are the prices in the hotel bar and restaurant, very expensive! It's in a perfect location to walk to any shopping, restaurants, bars and of course the Metrodome! The Light Rail station which you can take to the airport or the Mall of America is only 2 blocks from the hotel and you're a 1/2 block from Nicollet mall! You won't need your car at all during your stay! I would suggest stopping in front of the hotel to drop off your luggage as once you park the car in the parking garage it is quite a walk even though the parking garage is right next door to the hotel. They do charge for parking, $20.00 per night weekdays, $8.00 weekends so remember to add that to your expected costs. They also charge for internet access, $15.00 per day. In the room it is NOT wireless but in the common areas it is. A lot of people like to stay here for the sporting events, Twins and Vikings games. We came for the State Fair concerts. There was a bus directly to the Fair from Nicollet Mall. I highly recommend this hotel for a fun weekend in the city!!", "title": "Awesome views and rooms", "user": "TravelFriend200", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37761885}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We stayed here while celebrating my birthday downtown. We stayed in an executive King corner room with the romance package (which is barely worth the extra money). The room was fantastic. Large sitting area with comfy furniture, incredible bed with nice, white duvet, big work desk, and floor to ceiling wall to wall views of downtown minneapolis (we were on the 25th floor). Included with the romance package was some nasty champagne that we turned into mimosas, some chocolate dipped strawberries that we less than delicious, free parking (which is a value as parking is around $20a night), and breakfast for two from room service or the lobby restaurant. The staff were all great, the food was great, the location was great...no complaints. It is a bit of a maze to check in and find your room, but if you can read signs, you'll be fine.", "title": "Convenience, location and comfort!", "user": "SweTraveller27", "date": "August 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 37091177}], "location": {"country": "United States", "city": "Minneapolis"}, "stars": 3.5, "variance": {"poor": 24, "average": 63, "very good": 158, "terrible": 10, "excellent": 142}, "aka": "Marriott Minneapolis City Hotel", "slim_ranking": 0.469387755102, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Welcome to the Minneapolis Marriott City Center - in the center of it all! Experience style and service at the Minneapolis Marriott City Center, just 1.5 blocks from Target Center in the heart of downtown Minneapolis. Connected to Macy's via skywalk access, one block from Gavidae Commons, half-block from the Nicollet Mall, and adjacent to City Center Shops, ideal for your next night on the town. Whether you’re looking for a romantic weekend getaway, a place to grab a quick bite to each before the game, or a happening bar offering game day specials, an outdoor terrace and 12 flat screen TVs, we have everything you need to celebrate, no matter the occasion. Make yourself at home in over 500 guest rooms, many with stunning views of the city skyline and enjoy one of our weekend packages complete with breakfast, Internet or late check-out."}