{"user_rating": 3.5, "review_count": 303, "name": "Marriott West Palm Beach", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I travel frequently and this is one of the more shocking hotels I have stayed in.", "title": "Does this hotel realize it is in Palm Beach?", "user": "Nathan J", "date": "March 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 155028109}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This Marriott needs to be renovated in the worst way. The carpet in the rooms, the bathrooms, the curtains, elevators, etc.", "title": "Nice hotel right in West Palm Beach", "user": "Broctoon", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 154993584}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This isn't the 90's anymore. A Marriott less than a mile from Palm Beach should up it's game and be a lot more stylish and modern.", "title": "Wonderful restaurant in Excellent Hotel", "user": "Bruce V", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154975165}, {"rating": 3.0, "title": "An OK business hotel with an odd location", "text": "This is a nice hotel in a great location in West Palm Beach. It's not the Marriott chain's newest, glowing property but it's holding up well considering it's age. It's very close to the shopping/business area of downtown West Palm Beach, which is close to the beach. It's on the river so you can get a room with a nice view on either side. It's not close to the airport but an easy drive to it. Good option for business in West Palm Beach.", "user": "Mitch R", "date": "March 17, 2013", "id": 154847499}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Very nice hotel, excellent friendly stall and within walking distant to City Place for shopping, restaurants etc. Very surprised to find a high quality, priiced right restaurant, !0 Bristo 1 in the hotel.", "title": "A Good Move", "helpfulness": 1, "user": "LakeSHillsboroMO", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154708621}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I recently visited this property when I participated in a ballroom dance event. I wanted to stay overnight, but rooms weren't available; hence, my review does not include an evaluation of guest rooms. Rather, it focuses on the exterior, the conference center, the lobby, and catering.", "title": "Convention center guest", "user": "lanakoala", "date": "May 19, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 161115984}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "From the outside, the hotel looks a bit dated, but on the inside, it is very nice. The conference center includes a ballroom, which is large and beautifully appointed. One can follow a walkway, which passes small conference rooms, that leads one to the lobby where there is a shop, ATM, computer station, check-in, etc. When I passed into the lobby area I had a chance to interact with some of the staff. I wasn't terribly impressed with the reservation agents, who I briefly spoke to on my way to the ATM. The lady in the shop was wonderful.", "title": "Staffalicious!", "helpfulness": 1, "user": "BillTLansing", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161016091}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Food served was delicious. Everyone who had the Bistro Ten Zero One Grilled Chicken Sandwich seemed to enjoy it. Dinner was also delicious. Steak, potato, asparagus, shrimp, salad, and dessert sampler was enjoyable. Servers were generally courteous and did their best to accommodate any and all requests. I was also appreciative of their consistent effort throughout the day to help keep the ballroom area up by removing unwanted service items when they noticed them. I do wish a few more trash cans were discreetly placed around the ballroom so that we attendees could help as well.", "title": "No parking", "user": "Beachiz", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 160520983}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "All in all, nice place for an event. I'd gladly come back.", "title": "An average Marriott on outskirts of West Palm Beach", "user": "Angliskai", "date": "May 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 160063860}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My wife and I stayed at the Marriott WPB last week and I dont have enough room to describe the possitives! The location was convenient to I-95 and other main routes, the location was close to downtown and City Place and the shuttle was very useful and convenient. The shuttle driver made travel fund and he was very prompt. The hotel actually feels like an oasis in the city! Originally our room on the 10th floor was not ready so Darin upgraded us to a wonderful room overlooking the intercoastal. We couldnt have been more pleased. We utilized the exercise room and the Bistro restaurant and they treated us like royalty. The chef at breakfast buffet (Fernando, I think) was pleasant and did a great job.", "title": "Extremely average.", "user": "katensteve", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 159640144}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The Marriott West Palm Beach provided everything we needed, and more. We selected the property because of its proximity to the Kravis Performing Arts Center where we attended a concert (a group of 'gal pals') and, of course, Palm Beach. As a long-time Marriott road warrior, I appreciated the customary amenities, from the concierge lounge to the gym. Service was great, and we lucked out with a culinary event on the outdoor terrace on the Thursday evening we arrived. We were told this may become a once-a-month event. The chefs prepared lovely tapas-sized treats which included fresh ingredients from the adjacent gardens.", "title": "Convenient, good service, exceeded expectations", "helpfulness": 1, "user": "Everycontinent", "date": "April 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158667290}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We were provided a shuttle to the Kravis, as well as CityPlace. It all made for a great long weekend.", "title": "Excellent Bistro, Rooms Need Upgrade", "user": "Sultan1950", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 158151627}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I'll get to the problems and then focus on the good things this hotel has to offer. Although this hotel is close to the airport, unless you are a local this hotel is difficult to drive to; due to the convoluted road scheme it is situated in. I would not advise walking to the downtown area as suggested by several other posters...much safer to take a shuttle or taxi. The room I had was dated and needs an upgrade; reminded me of Marriott in the 1990's.", "title": "Great location and friendly staff - but that's it.", "helpfulness": 1, "user": "skatelefty", "date": "April 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 157347443}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The Bistro was excellent. My sister and I had lunch and breakfast there and both meals were outstanding. We met the chef; who took us on a tour of his herb and vegetable garden on the property. This is where he grew his heritage tomatoes!", "title": "review", "user": "123YHZ", "date": "April 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157190340}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The pool area is very nice...clean pool, nicely landscaped and plenty of seating. This hotel is not more than 10 minutes to the airport; if you know the short cut.", "title": "Location, location, loacation", "helpfulness": 1, "user": "Mark C", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157008743}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I will always spend travel nights in a Marriott if I can so this one worked out since it is a short walk to the convention center. The staff is friendly and helpful which is a good starting point for any hotel. My room while not allowing too much noise from the hallway was decent with a nice view, but the AC ran constantly and was noisy, which might be why I heard little noise from outside the room. When I would go back at say 4 in the afternoon the room was a bit warm, so I would say the AC in the hotel needs so upgrading. The shuttle is a great touch as it saves you a taxi bill. The restaurant is also within walking distance of a number of good restaurants and a food store which is an added bonus. All in all I certainly would stay here again if I had the chance.", "title": "Not all that bad a place to stay but it is showing it's age", "user": "wkrupa", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154698076}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Our group reserved well in advance for a conference block of rooms. I arrived early and got my room, however, things were botched badly for those who arrived later in the week. The Marriott said no rooms were available and moved people in our party to three different hotels that were not particularly nearby. Quite disappointing. In addition, my boss reserved a suite and none was available although he too checked in very early on. The hotel apologized, but did not compensate for these issues.", "title": "Reservations not well managed", "user": "dj0729", "date": "March 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 154587311}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel is well maintained, the staff is generally gracious, the pool area and the Bistro restaurant are both very nice.", "title": "Good hotel - tricky location", "user": "Travelnperson", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 154450416}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "In order of importance:", "title": "A couple of glitches - funky location", "user": "Jeff B", "date": "March 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 153687975}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Bed and bedding - very good and very comfortable", "title": "Fours Season staff at Marriott Hotel", "user": "bekntony", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153473752}], "location": {"country": "United States", "city": "West Palm Beach"}, "stars": 3.5, "variance": {"poor": 24, "average": 85, "very good": 95, "terrible": 15, "excellent": 84}, "aka": "Marriott West Palm Beach Hotel", "slim_ranking": 0.441176470588, "description": "Enjoy various enhancements including a stunning guest room renovation inspired by the tranquil lifestyle and vibrant colors defining the West Palm Beach, FL, destination. Conveniently located near CityPlace, Kravis Center for Performing Arts, Cruzan Amphitheatre, Downtown West Palm, Palm Beach County Convention Center and Palm Beach International (PBI) Airport, our West Palm Beach hotel appeals to leisure and business travelers alike. Appreciate deluxe accommodations and unique amenities at our Marriott hotel in West Palm Beach, FL, including high-speed internet, complimentary airport shuttle and on-site parking."}