{"user_rating": 4.5, "review_count": 976, "name": "Marriott's Cypress Harbour", "reviews": [{"rating": 5.0, "title": "Terrific experience", "text": "This is a great place for families to spend time together. In addition to beautiful, spacious accommodations, there is a scenic lake and busy activities center.", "helpfulness": 1, "user": "janet48603", "date": "December 20, 2011", "id": 121912594}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "2 adult couples stayed at this location and found the rooms to be spacious and nicely spaced apart so you had your own \"space\" in the unit. The master has a king bed, the other room has a queen bed. The beds are nice but not very soft. The amenities in the room are great although if you are in a room not on the top floor you can experience noise from the tenants above you. There are multiple pools including one that has adult only hours in the a.m. and p.m. which is nice if you want a little peace and quiet while you relax by the pool. There are lots of activities including boats and bicycles that can be rented for a nominal charge.", "title": "Great timeshare with lots of room", "helpfulness": 1, "user": "HeritageSoftail14843", "date": "December 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121902735}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I was invited to be a guest of an old buddy and his wife to share a week in a time share they had in this Marriott property. Bringing the little woman on a short, pre-Christmas, inexpensive vacation, I scored some points. While the ladies enjoyed all of the amenities of the resort property, my buddy and I enjoyed some local golf courses. I found the suites to be fully appointed, clean and well laid out. From what I personally experience and from what the ladies reported, all of the facilities were excellent: pools, game area, restaurant, etc. The only minor complaint regarding my experience at Cypress Harbour was that the bed in the guest room was a little stiff for my liking but you might enjoy it.", "title": "Never look a gift horse inthe mouth....", "user": "ImATravelinFool", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121882692}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Our family decided to try one suite here instead of the two connecting rooms we would typically get every year at an on-site Disney Hotel and we were SO happy with our choice!!! First, the room was essentially half of what we would have paid for the two rooms elsewhere. The proximity to Disney World, specifically Epcot, was WONDERFUL (I think it was 3 exits!) Lastly -- there were 7 of us -- we could easily have gotten a few friends in (I think it officially sleeps 8!)", "title": "SOOOO much room!!!!", "helpfulness": 1, "user": "patihalt", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121719376}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The main room was very spacious with a wraparound couch where both my sons spent the night. It was so comfy that they didn't even bother, though they could have pulled it out into a bed. The master bedroom was GIANT with a HUGE jetted tub. The second bedroom had a queen sized bed and a queen sized sofa sleeper. Though we only stayed one night, there was a full kitchen if we had been staying longer (we DID utilize the on-site Pizza Hut and Starbucks!) The entire place was spotless.", "title": "Great location", "helpfulness": 1, "user": "hsqos", "date": "December 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 121673434}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Of all Marriott Vacation Villas in Orlando, this one is our favorite!!", "title": "THE Best in Orlando", "user": "daveron8", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121625805}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Our family recently spent a week at the Marriott Cypress Harbour. We enjoyed absolutely everything about the experience. The reservation desk was located in a lobby decorated with a large, beautiful Christmas tree. The rooms (small apartments) were beautiful and spacious. We had enough room for our entire family to gather together and have meals around the dining room table. The units were clean and quiet, with a beautiful view of the lake. We were able to sit on our screened in balcony and enjoy the beautiful view while we had our breakfast. We had pizza delivered from the Pizza Hut on property. The delivery was fast and the pizza delicious. We were visiting with our 3 1/2 year old grandson and were able to visit the activity center one morning for \"Bubble Fun\" and for our grandson it was lots of fun. We also took a paddle boat out onto the lake, played miniature golf and went swimming in one of the beautiful swimming pools. The primary purpose for our trip was to visit Walt Disney World. Our only regret is that our vacation was only a week long. We all decided that we really needed more time to enjoy the resort and we all wished that we had at least another 3 days to just hang at Cypress Harbour. Next time we visit it will be for at least 10 days!", "title": "Only one regret...", "helpfulness": 1, "user": "cherylwalt", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121380093}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We have stayed here twice. This time it was five of us--Mom Dad, teenager, kindergartener, and preschooler. The pool is wonderful. The proximity to Disney is terrific. Our room was a 2 bedroom unit with a kitchen and washer/dryer and a lovely balcony. The convenience store on-site is terrific and has a lot more than you would expect. They offer room service for the pizza hut as well as some salads and it comes quickly and conveniently at the end of a day running around at the parks. The timeshare is close enough to the restaurants on the main drag to be convenient as well.", "title": "Our favorite off-site Disney timeshare in Orlando", "helpfulness": 1, "user": "MedfordMama", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121363806}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "They have lots of kids activities which we did not use this time but did use last time and enjoyed. They have a cute playground and you can rent boats and bikes.", "title": "Family Vacation", "user": "katherineiris", "date": "November 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121222744}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "I visited this resort for Thanksgiving 2011. I say resort rather than hotel because it has many amenities for kids so the whole family will be entertained and happy! Its private and very cozy feels like a second home. Staff is very helpful and accommodate every need very fast. The rooms are very large with washer and dryer in the room for long stays that is such a great feature came in handy for our stay. A full new kitchen was great for cooking meals.The property sits on a lake where paddle boats and fishing fun are available. Also, 3 large pools, arcade, basketball court, miniature golf and huge golf course for expert players. Overall it is great for families especially for kids!", "title": "Very Spacious 1st Class Hotel!!", "user": "JenEady", "date": "November 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121138689}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My family stayed on a two bedroom apartment on building 68 for a week. We had a great view of the trees and surrounding areas. We enjoyed renting a boat and a 4 passenger bike. Staff is very helpful. We highly recommend this resort. Close to Sea World and I-4.", "title": "Great place for family", "helpfulness": 4, "user": "Viajero736", "date": "December 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 122304050}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Lovely grounds, great service, comphy beds chairs and sofa, cute color sceme. Lots of activities for kids and adults from boating to crafts to firewalkers! Many great pool and hot tubs, and no idiocies about pool towel checkout. Minor kitchen repair was the only fly in perfect stay!", "title": "The best resort in orlando", "helpfulness": 3, "user": "TNewby", "date": "December 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122160557}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Our family of four stayed at the 2-bedroom villa at the Marriott Cypress Harbour during Christmas week. It was our first stay here and our first visit in Orlando in December. We usually stay at the Marriott Grande Vista whenever we visit. But we didn't regret our Christmas trip to Cypress Harbour. We made sure that this time we took advantage of the resort this time around. We were glad that we did. There are 3 pools at the resort. We used the Island pool and the kids loved it. It was rarely crowded and the water was nice. We made a daily trip to the pool. The resort team dressed in elf costume delivered stockings for the kids. The stockings were not free, but it was a nice touch to have that Christmas spirit being away from home. My daughter kept saying, \"I knew Santa would find us!\"", "title": "Great family resort!", "helpfulness": 1, "user": "3LilBears", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122154342}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "There were also many activities around the resort and lots of playgrounds for the kids to use. The resort was courteous about getting our supplies replenished upon request. Cleaning was not included with our stay. But they gave us plenty of cleaning supplies within the villa. We also enjoyed the full size washer and dryer. The Marriott Grande Vista had the two-in-one units in their villas. The only downside was that our villa (Building 72) was far away from the main attractions of the resort. With a toddler, we had to drive to the pool. But that didn't ruin our trip whatsoever.", "title": "Wonderful Week", "helpfulness": 1, "user": "peonyrose", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122048362}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The resort is also close to Publix, Sea World, and Disney theme parks. We also made a trip to Legoland, which was 45 minutes from the resort. It was a nice stay. We would definitely stay here again.", "title": "40th Wedding Anniversary", "user": "Pearl G", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121976480}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I made a quick trip with my husband for New Year's Eve, so I didn't get to take advantage of the many amenities at this resort. The property is very nice. It has gated, secured entry. There's free parking (that was abundant even though the resort was sold out) and several pools. We didn't get in the pool, but it looked very nice. The main pool has a bar alongside it, along with a place to buy food and snacks. There are bike rentals, paddle boat rentals and a larger boat that can be rented. Our room was immaculate. I requested one of the renovated units. The jacuzzi tub was wonderful.", "title": "I'll Return and Bring Others", "user": "mrselett", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122764096}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We (party of 4 adults and 2 teens checked in 12/26. The facility is very clean, neat, well kept and the staff are personable, helful and friendly.", "title": "Great way to spend Christmas week with Family", "helpfulness": 2, "user": "ivorysnowgirl", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122690647}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We enjoyed visiting theme parks nearby and resting by pool. Teens enjoyed the activity center with basketball courts, boats and bike rentals. Activities are well organized and varied. 2 people in our party had no trouble getting same day tee time at nearby golf course.", "title": "Great family resort minutes from Disney, around the corner from SeaWorld.", "user": "captainjake77", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122690530}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Unit was clean and short walk to almost everything if you used the foot bridge. WE were in building 66 nice location backs to golf course and putting green short walk to field and pool.", "title": "Great place, if only you were able to control the room thermostat.", "helpfulness": 5, "user": "vgcr", "date": "January 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 122488865}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Full kitchen and Walmart nearby is great savings for breakfast and lunch. We ordered in from onsite galley restaraunt and pizza hut and both were good, fast and reasonable.", "title": "Very nice...but I prefer Harbor Lake across the street", "helpfulness": 4, "user": "Lois-Lynn D", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 122340315}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 18, "average": 38, "very good": 241, "terrible": 11, "excellent": 668}, "aka": "Marriott`s Cypress Harbour Hotel Orlando", "slim_ranking": 0.0182370820669, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}