{"user_rating": 4.0, "review_count": 355, "name": "Marriott Nashville at Vanderbilt University", "reviews": [{"rating": 3.0, "title": "Be Prepared for Construction", "text": "Be warned that this hotel is undergoing major renovation.", "helpfulness": 1, "user": "DaveLD", "date": "February 18, 2008", "id": 13636933}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "On arrival, the guy at the check-in desk was completely unhelpful. I had planned to self park ($16 vs $20 for valet) but he did such a terrible job directing me to the garage that I chose to valet. Probably worth the $4 difference but I was trying to be frugal.", "title": "Hotel stay lovely after an initial problem", "user": "Sharon P", "date": "January 27, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 13045411}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We had a room on the tenth floor. The room was very well appointed with comfortable beds. However, we had a note saying that the flat screen TV had not been placed in the room yet as the last step in renovation. Otherwise, we liked the decor and the room was very clean.", "title": "Nice stay", "helpfulness": 1, "user": "jdvmd", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11241817}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We tried to go down to the pool/fitness area but the floor it was on was closed for renovation. They did offer a shuttle to a local gym.", "title": "Great Staff", "helpfulness": 3, "user": "opinionsbyL", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10036975, "likes": {"liked": "— staff", "disliked": "— parking"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "I had the breakfast buffet at the \"Latitude\" restaurant. Not memorable at all and there are plenty of places nearby to get better food. The location is wonderful right on the Vanderbilt campus and nearby shopping and restaurants.", "title": "Nice hotel, but not worth 4-star price", "helpfulness": 3, "user": "hoyvenon", "date": "July 2, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 2.0, "rooms": 3.0}, "id": 8039561}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Got this for $75 a night on Priceline, and it was a lovely hotel in a nice location -- centrally located to restaurants and shopping and just a short drive to Music Row and downtown. The front desk didn't even let us know about our parking options (they were not the most helpful bunch), but from reading this, we parked easily on the street in front of the hotel at all times (we were there over the holiday weekend). I suppose the hotel is fairly nondescript in a hotel kind of way, but the rooms were spacious, the bed was huge, and it appeared well-maintained. Only complaint is that the neighbor's plumbing was very loud.", "title": "Nice hotel in nice location", "helpfulness": 1, "user": "richnindy", "date": "May 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 30756982}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Excellent hotel and location with easy walking access to P. F. Chang's restaurant, Starbucks, Border's and Vanderbilt campus. Self parking area is not convenient.", "title": "Great hotel, good location", "user": "tngypsy", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27881318}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We visited Nashville to attend the Grand Ole Opry, but many downtown hotels were booked. We picked the Marriott at Vanderbilt, which isn't far from downtown and saved us money. The room cost about $137 a night including taxes and lugs. The hotel is shoehorned in between businesses and the Vanderbilt University football stadium. Parking is inconvient and costs $20 a night next door. But it's a good hotel with friendly staff. Rooms are smallish but well appointed. The bathroom sink wouldn't drain easily, and no one came when I reported it. Our view was of the Parthenon and the big city park. The breakfast buffet was good but a little pricey for what you get. They have a nice indoor swimming pool, but no whirlpool, which is something I missed. They take you downtown on their shuttle, but it stops at 11 p.m. and that's too early. There is one computer for the public, but kids were constantly on it. On balance, I'd rather we had stayed downtown.", "title": "Fairly good choice", "user": "bigredjohn", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 25047168}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Went to Nashville with my daughter who had an audition at Belmont University. We had a reservation for the Courtyard Marriott West End @ $98/night, but when we drove by the place looked pretty dumpy. So we headed to a nearby Panera Bread for free wireless, went on Priceline and lucked out with a room at the Marriott Vanderbilt for $82.", "title": "Great Hotel, Great City, Great Deal", "user": "mrspotty", "date": "February 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 24225780, "likes": {"liked": "— Comfy, clean, very good overall quality room", "disliked": "— Parking expensive."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Great room with a view of the Vanderbilt football stadium, very comfortable room w/ great beds. Hotel staff were very friendly and helpful. Swimming pool was nice (though nothing special).", "title": "Nice stay for business", "user": "VacaBird", "date": "January 26, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 23929473}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Dirty small rooms.Front desk VERY unfriendly.........as for eating here BEWARE.We had an omlette that was swimming in grease,2 lipstick stained glasses & cups,dirty cutlery,dirty plates & the best ........hair in our OJ.The waitress showed it to the restaurant manager, he just shrugged his shoulders........then I asked him about it & again he just shrugged his shoulders.......really is this a 4 star Marriott.I then tried to call the front desk to complain they kept me on hold for 25 mins......I gave up ......called Marriott main # on hold for another 15mins....in end just gave up.....& got the hell out of there......", "title": "AVOID AT ALL COST", "user": "mysterialmaria", "date": "August 8, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 37065829}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "I stayed at this hotel for a week with family and friends, as we all prepared for my wedding day. (My wedding reception was at the Parthenon immediately across the street, so the location couldn't be beat.) For starters, the hotel is gorgeous. It seems new, with dynamic and modern decor. The rooms are immaculate, and I visited a lot of them, as family members had rented out perhaps 30 rooms in the time before and during my wedding weekend. Food at the restaurants is expensive, as is the case at most hotels, and delicious. Many of the rooms either have a view of West End Ave. and the Parthenon, or Vanderbilt and the football stadium. Restaurants and stores including Borders and P.F. Chang's are steps away, easily accessed on foot without crossing any streets.", "title": "Fantastic hotel; best Marriott I've encountered", "user": "watchdog3", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36055620}, {"rating": 2.0, "title": "Unless you have a huge expense account, don't stay here.", "text": "The service deserves really special mention. The staff at the Marriott bent over backwards to facilitate smooth check-ins for guests and distribution of all our \"welcome bags.\" They also pitched in numerous times as my mom and I pulled together last-minute wedding tasks -- this includes sending and receiving faxes and other deliveries, as well as helping my mom (not a Nashville native) figure out good sources for different things. They helped my mom and I deal with several large, odd loads of stuff -- all the reception favors, for example. Several of them knew our names by the end of the week and were extremely friendly, helpful, and congratulatory. Bear in mind that our wedding utilized no Marriott services other than the block room reservations, which came at a block room discount. But they were more helpful to us in that last week, in lots of little ways, than some of my vendors.", "user": "Arlene F", "date": "July 27, 2009", "id": 35926340}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I stayed at the Marriott a few weeks later for a friend's wedding, and this time the reception was actually at the Marriott. Their reception area was beautiful and the food was terrific.", "title": "Exceeded expectations!", "user": "whosyer12", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34947078}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "In closing, I couldn't have been more pleased with our stay at the Marriott. The rooms are nicer than some of those at \"boutique\" Nashville hotels, including nearby Hotel Indigo, and the service is impeccable.", "title": "Service levels not up to scratch", "user": "electroshock", "date": "June 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 32961980}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed for only one night at the Marriott.", "title": "Just a Marriott Hotel", "user": "nanisnanis", "date": "January 12, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 23491396, "likes": {"liked": "— The location close to PF Changs and Flemmings", "disliked": "— The parking garage location and price"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I was a little disappointed on the hotel, from some research I thought it would be a little fancier. I've stayed at different Marriott hotels and this was no better than the Courtyard, Residence Inn or Fairfield. I wish I've stayed at the Courtyard Marriott and saved some money.", "title": "Clean Hotel - Worst Service I've Ever Seen", "user": "cliffsc", "date": "December 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 23035536, "likes": {"liked": "— Good Location", "disliked": "— Worst Service Ever"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We had to pay $19 for self park our car in the parking garage. There is one parking garage NOT FOR HOTEL GUESTS, right next to the hotel that costs $10 max per day.The parking garage for Marriott costs $19 per night for self parking and you have to walk a little more, only like 3-5 minutes from the hotel. The hotel has some side doors closer to the parking garage but they are all locked, so you have to walk all the way to the main lobby to get in the hotel. When its 30 degrees or less outside that little walk is not too fun.", "title": "too many charges", "user": "moskonos", "date": "December 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 22984482}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The room was ok, not to big not to small. The restroom was ok also, but the bath shower was ripped, which is kinda bad when you are paying over $100 per night. The bathtub was a little slippery.", "title": "Confusing Staff & Crazy charges", "user": "fishlab", "date": "November 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 22293529, "likes": {"liked": "— view", "disliked": "— parking"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Overall it was ok, but next time I go to Nashville I will try another hotel.", "title": "Great Stay - Love the beds!", "user": "WIBadgergirl", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 21517653, "likes": {"liked": "— The Beds of course", "disliked": "— High cost to park and charging for internet"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "We just returned from a 4 day visit to Nashville and very much enjoyed our stay at the Marriott. The hotel was easy to find from the airport (at night). We opted for the valet parking versus self parking for a few more dollars a day. The location was convenient to several restaurants and stores and close to downtown area. We were greeted by a pleasant front desk guy who made sure we had a king bed and good view of Centennial Park without us asking. Our room was good sized with a comfy bed and good linens, large flat screen TV, work desk and a comfy TV chair. I loved the Bath and Body bathroom products!", "title": "Great stay.....would go back.", "helpfulness": 2, "user": "Daphne418", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21514792, "likes": {"liked": "— Location and staff", "disliked": "— Price for parking. Boring menu at restaurant/roomservice"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Even though the hotel seemed full, we still had a quiet night of sleep and did not feel ignored when we needed something from the staff. We ordered room service each morning for breakfast which was average but the coffee was hot! I was there for one day business meeting at the hotel and the meetings went very well. The Marriott staff did a great job setting up the meetings, rooms, and the lunch. My husband found the gym/pool small but well maintained and good enough for a morning workout. We didn’t take the shuttle out at night but instead took a taxi since it was a short and cheap ride. But I heard others rave about the friendly shuttle service. We did have a few drinks at the bar with Joe the Bartender who gave us recommendations on where to eat, drink and what to see. We recommend BBQ especially the rack of ribs at Jack’s and check out any of the bars with live bands on Broadway….but note they can still smoke in some bars….thankfully the Marriott had a washer and dryer near the gym for a quick wash and dry. Check out Centennial Park for a nice walk across the street from the Marriott and see the Parthenon! Even if you aren’t a Country music fan, head over the Grand Ole Opry. A bit of drive but an amazing area and the show was great! The fans really got into all the acts from the HOT young stars to the old timer crooners. Being history buffs we also stopped off at The Hermitage - Andrew Jackson’s home on the way to airport. It was a nice afternoon walking the area and a great US historical site.", "title": "Great for business!", "user": "dawgfan2020", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21462038}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Overall, we loved our visit to Nashville and had a great stay at the Marriott. We’d highly recommend for a local stay for a good value for $120 not including taxes a night. This place is a steal!", "title": "decent", "user": "cuckatoo", "date": "October 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20972117}, {"rating": 1.0, "title": "Dissatisfied", "text": "Stayed at this hotel the first week of October 2008 on a business trip. Valet parking is kind of expensive, $22 per day. The conference I was attending was in the same building so I decided to self park. There are tons of resturants within walking distance so this proved to be a wise decision. The hotel is directly beside Vanderbuilt's football stadium and directly across from the Parthenon. My room was on the 8th floor and was facing the street. The room was very quite and had a great view of the Parthenon...very pretty when it's lit up at night. I was in a standard king room. Very clean, nicely decorated. It did have a LCD television so that was a plus. Bathroom was very clean and spaceous. The bed was amazing, pillow top with about 8 pillows.", "user": "alabamaflossy", "date": "October 8, 2008", "id": 20735814}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "All in all it was a great trip. I would stay here again if I travel back to Nashville.", "title": "Location not a problem thanks to the free shuttle service", "user": "dbd80", "date": "September 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 20282068, "likes": {"liked": "— Free shuttle service in and out of town/main tourist sights", "disliked": "— Smell in the lobby"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "It is locatad far from the city centre BUT the have a free shuttle that leave you downtown and pick you up when called.... nice service. room was big, clean with Parthenone view.", "title": "Good choice", "user": "marco.to", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 40089336}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Front desk staff is very helpful and always greets you with a smile when you return. Valet is quick. The food inside is just ok but many places to eat nearby. PF Changs is right out the door. I would tell anyone to stay here and I will again.", "title": "Great stay", "user": "thewhitebuffalo", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39668175}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This is the best option closest to Vanderbilt unless you want to pay a lost more bucks to stay at the Loews. I only wish it had been on the other side of the University closer to the Hillsboro Village. Its a far far walk from the hotel to the village. Take a cab.", "title": "Best option closest to Vanderbilt", "user": "JAM02", "date": "August 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 38819373}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I have stayed here multiple times. It would be nice if the rest of the staff was as customer oriented as the valet staff. They are awesome. The front desk is either hit or miss and rarely make you feel welcome but I have gotten used to that. The staff in the concierge lounge is wonderful. They always make you feel welcome and go above and beyond. Do not eat at Latitude. It is overpriced with poor service and even worse food. Walk across the parking lot to one of the many places to eat surrounding the hotel. I will always stay here when in Nashville because the hotel is convenient and I like the valet staff however I am sure there are better options.", "title": "Average Marriott-Dine somewhere else", "user": "yogitrvlr", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 38536660}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We used Priceline to find our hotel for our trip. When we were looking for our hotel we looked at a place with free wi-fi and also free parking and what we got was having to pay 10 bucks a night for 24 hours of internet service, 4 bucks if you wanted the bottle of water in the room, there was no fridge in the room or microwave and even if it is a 4 star hotel I have stayed in other 4 star hotels that do have them so I thought that was kind of crappy and also I thought that the hotel staff was not very helpful when we had a water leak in our bathroom our last night there and also I could not believe again we had to pay for parking is Marriott that broke they can’t have free parking or do they just milk people for all they have. Another thing is they do not give the best directions ether to find the place. So I have to say my family never again plans to stay at the Marriott chain of hotels and I was very disappointed with this one. I can see if you have all the money in the world to stay at a hotel like this but if you are on vacation you do not want to shell out another 200 bucks just to stay at a nice hotel for a week while you are trying to enjoy a Music filled week.", "title": "Not as happy as we thought we would be at this hotel.", "user": "babytink_9", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 5.0}, "id": 37706038}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "Stayed during May graduation. Perfect location for visiting the university and only a 7 minute drive to downtown. Rooms were much nicer than an average Marriott", "title": "Perfect location", "user": "tatabob", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16630937}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "My family stayed at this hotel while attending the graduation festivities at Vanderbilt, and it couldn't have been more convenient. We were able to walk out the door and be at all of the various events within minutes. (And, for football games, the stadium literally is out the hotel's back door and across the alley.)", "title": "Couldn't be more convenient", "user": "Historybuff52", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16552120, "likes": {"liked": "— Convenience to Vanderbilt", "disliked": "— A bit pricey"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Our room was very comfortable, clean, and attractive. We had access to the concierge level, which gave us (there were nine family members, staying in four rooms) a place to congregate. The drinks and hors d'oeuvres available in the evening on the concierge level were very nice.", "title": "OK to visit your kids in college", "user": "gypsyjetter", "date": "May 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 16221224, "likes": {"liked": "— PF Chang's was next door", "disliked": "— Nothing special at all"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The hotel is pricey, especially during big events--like graduation--at Vanderbilt, but the comfort, level of service, and convenience made the cost tolerable.", "title": "Very comfortable and great location", "user": "Pat&Georges", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15818894, "likes": {"liked": "— Comfort and location", "disliked": "— Parking & internet cost were high"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Not that great of a hotel overall, but it will do for a visit to your kids in college there or if you are planning to go there and want to see the campus. It's conveniently located on the campus, near a lot of restaurants. Not a lot of amenities offereed at the hotel itself for a Marriott, so I thought it was pricey for what we got. Nothing special at all about the rooms. I would not want to stay there for a long trip, but a couple of nights would be ok. Only good thing was that it was next door to PF Changs, one of my fav places to eat.", "title": "Chattanooga Mom", "user": "ChattanoogaMom", "date": "March 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 14130534, "likes": {"liked": "— Fast check-in; valet parking; room service", "disliked": "— Beds and no water pressure in the shower!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Stayed at the Mariott Vanderbilt for one Saturday night. We did not have a reservation but were able to get a room immediately. They give a 5 percent AAA discount too, which helps when all the taxes add up.", "title": "Nice, but not perfect", "user": "Wilmera", "date": "August 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 18860783, "likes": {"liked": "— Location", "disliked": "— Internet Fee; Expensive parking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Our room faced the Vanderbilt football field, which was cool. Beds were comfy, bathroom roomy, everything clean.", "title": "Fantastic Experience at the Nashville Marriott at Vanderbilt Hotel", "user": "DealMakerDallas", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18574475, "likes": {"liked": "— The proximity to the Vanderbilt University campus."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Location is great -- try a salad a Calypso across West End or venture to PM Cafe for tasty Asian fare. Cabs were waiting out front if you needed them and they also have a \"drunk bus\" which will take guests around town within a two mile radius.", "title": "Best ever......coming back!", "user": "margoTexas", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18463316, "likes": {"liked": "— location, comfort, quality, FOOD", "disliked": "— nothing!"}}, {"rating": 4.0, "title": "Convenient, but overpriced", "text": "For $149/night, I was disappointed that you still had to pay for Internet. (This is not the case at the Courtyard by Marriot down the street.) Also, parking is expensive. The indoor pool looked okay and the fitness room is open 24 hours. Ample cardio equipment but no ab machines or mats to lay on the floor for stretching.", "user": "Whiteys", "date": "June 28, 2008", "id": 17314543}, {"rating": 3.0, "title": "Agree with others about parking", "text": "This property is nice but on the expensive side, if you ask me. It IS Nashville, after all.", "user": "ustbart", "date": "June 26, 2008", "id": 17237388}], "location": {"country": "United States", "city": "Nashville"}, "stars": 4, "variance": {"poor": 23, "average": 59, "very good": 116, "terrible": 13, "excellent": 144}, "aka": "Marriott Nashville At Vanderbilt University Hotel Nashville", "slim_ranking": 0.202702702703, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Nashville's premier hotel is located in the center of vibrant midtown and the heart of Nashville's West end. The hotel overlooks the historic Vanderbilt University campus and stadium, one of America's leading private colleges. The hotel offers over 11,500 square feet of meeting and banquet facilities and is only a short walk to some of the finest restaurants and attractions in the city, one of Nashville's premier hotels."}