{"user_rating": 4.0, "review_count": 403, "name": "Marriott Heidelberg Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Great and Welcoming. We went as a large family during Christmas season. This hotel may not be as impressive on the ouside as it shines on the inside. The hotel staff was quick to respond to any question or need. My kids needed more towels after swimming and in less than 2 minutes, they were in my hands. They have fresh water and towels in the front lobby for the early morning joggers. Shoe shine service when your shoes become dirty from city walking, and my children's favorite treat - bathrobes and water toys for the children. I was also immensely impressed with the phone reservation department and the manager. This may be primarily a business hotel, but as a family enjoying a vacation one wouldn't know it.", "title": "Excellent Hotel!", "helpfulness": 2, "user": "cj15", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6749570, "likes": {"liked": "— Great View of the River, Fantastic service, Felt Pampered", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "They have connecting rooms for families with great views over the river. I would recommend the higher floors and the executive lounge. Of course, the beds , bathrooms and linens very luxurious and welcoming. They also have a large, warm, inside swimming pool.", "title": "wonderful", "user": "sadaka2006", "date": "November 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6165643, "likes": {"liked": "— staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The Breakfast buffet included waffles, champagne, and a great variety of just about everything. I always order fresh fried eggs and they arrived fresh and quick every morning. The waiters in the restaurant remembered us each morning. This hotel experience made us feel more pampered than on any of the many cruises I have been on. The buffet breakfast was the best of all the hotels we had stayed at during our Christmas vacation. My children preferred this trip to the Christmas Markets better than going to Disneyworld.", "title": "Good hotel", "helpfulness": 4, "user": "Victor54", "date": "August 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5613131, "likes": {"liked": "— good beds", "disliked": "— location (to far from center"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I especially appreciated the hotel's Giving Christmas tree to help other children have toys for Christmas. My kids really thought this was a nice gesture.", "title": "Fine american style hotel right on the river", "helpfulness": 3, "user": "Joe_from_Boston", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5531659, "likes": {"liked": "— River side location", "disliked": "— Away from the old town"}}, {"rating": 2.0, "title": "nice hotel", "text": "There is a bus stop that takes you into center of town just a few blocks away. From the train station, for our large group it was about 10 E. I have some great pics and hope to show them soon. I do not praise easily, but this is a fabulous place to stay.", "helpfulness": 8, "user": "miamul", "date": "July 13, 2006", "id": 5463068}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "I would NOT recommend this hotel for tourists looking for a “German” experience. For that you MUST stay in a local guest house or Inn in the Altstadt (old city), although this hotel does have a great location downtown. BUT for the BUISNESS TRAVELER who is looking for extreme comfort, ultra high cleanliness, added amenities like swimming pool, exercise room, wellness/messages, and in-house restaurants/pub then this is the place.", "title": "Best Business Hotel in Heidelberg", "helpfulness": 7, "user": "Peezfrog", "date": "May 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5026830}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I also must say that the hotel staff is probably the friendliest and helpful I’ve EVER experienced in Germany.", "title": "A bit far from the tourist areas", "helpfulness": 3, "user": "Aeryn", "date": "January 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4368479}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Most importantly, for the business traveler with a few extra bucks to spend (or be reimbursed) the “Executive Floor” (3rd floor) is a must (where I stayed). The continental style breakfast, afternoon hot snack, and evening desert offerings are a nice bonus – not including the free beer and wine which you can drink on a patio overlooking the Neckar river/valley and the Heidelberg castle after a hard day of work or studying.", "title": "Very nice but more American than German", "helpfulness": 3, "user": "Pesca7", "date": "October 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4065270}], "location": {"country": "Germany", "continent": "Europe", "city": "Heidelberg"}, "stars": 4, "variance": {"poor": 22, "average": 69, "very good": 197, "terrible": 7, "excellent": 108}, "aka": "Marriott Heidelberg", "slim_ranking": 0.225}