{"user_rating": 4.5, "review_count": 568, "name": "Marriott's Aruba Ocean Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "My Boss let me use his timeshare there for the week. Was absolutely blown away by how gorgeous it was. The room I stayed in was nicer than some of the apartments I have lived in! Staff was very friendly and I enjoyed my stay. Can't really say anything about the value because I didn't pay for it, so for me it was great! Definitely a lovely place.", "title": "Just Beautiful!", "helpfulness": 2, "user": "srs2112", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122577961}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "We had a spectacular time. Nine days and loved it. Weather was great as always and we love the Ocean Club. Not as fancy as a Ritz or Four Seasons, but comfortable, clean and convenient ournkids windsurfed every day and I did most days. We were never bored. We have two teenage boys and they had a great time too!", "title": "Wonderful!", "helpfulness": 4, "user": "neilex", "date": "December 30, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 122297564}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This hotel is great. We had a lovely time there. The staff is great. All the check-in/check out process has been simplified. The rooms are very spacious and lovely decorated. Very very clean. Every things looks very new. I stayed in this hotel about 4 years ago, and since then they have update the decor to keep the rooms very modern and looking as new. And of course, Aruba is for me, the best place to relax and enjoy. Congratulations to the staff and the company.", "title": "One of the best places I have ever been", "helpfulness": 3, "user": "CSisco", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122223763}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Just got back from our first stay in Aruba and at Ocean Club. Overall a very nice resort. The two bedroom was perfect for our family of four as the kids could have their own room and we had ours. The kitchen/family room is very well done and stocked well. The biggest complaint I have about the room was the view...or lack thereof. We had rented the unit from someone else, so I learned that we get low priority...hence our room was on the ground floor with a view of the resort next door. I guess this is the case if you're not an owner and the resort if full. Not much to look at. I enjoy having a balcony with a nice view and had nothing even close.", "title": "Ocean Club Review", "helpfulness": 2, "user": "sirsir", "date": "December 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122107488}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "During the day, about 90% of the people are at the beach rather than the pool. I thought the process for reserving the huts on the beach was well done. You can reserve for I think three days ahead of time, or get there in the morning by 7:00 AM. I got there around 9:00 each morning and never had a problem. That would have probably been more difficult the next week as the place got much more crowded beginning on the day we left (Dec 24.). The beach itself is beautiful.", "title": "Our Stay at Marriott's Aruba Ocean Club", "helpfulness": 2, "user": "Lavonne S", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121867490}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We had an spectacular time. Went with my daughters and have a very good time, the snorkelling and diving were fabulous but the best for my daughters was the glamorous nights. We own an ocean view appartament at Marriott Ocean Club since 1999 and was the first time we use it, other years we rent it.", "title": "GREAT VACATIONS", "helpfulness": 1, "user": "Francisco1", "date": "January 27, 2012", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "rooms": 5.0}, "id": 123697387}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It´s a very clean, comfortable and convenient hotel.", "title": "Couldn't Agree More!!!!", "helpfulness": 2, "user": "PSUgirl80", "date": "January 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123577419}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "If you need moore tips for your season vacations, so to have a great time too, just ask for them,", "title": "Kids Everywhere", "helpfulness": 6, "user": "Reanie8", "date": "January 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 123543681}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "I TOTALLY agree with the comments regarding the 3rd and 4th weeks of January!!! Avoid them! We have owned at the Surf Club for years and finally felt fortunate enough to go in January last year! The first few days were miserable with the kids/teenagers running amuck! When they finally left on a Thursday, we were able to enjoy our last 3 days in peace! Do yourself a favor...go the first 2 weeks in January or wait until February! We are going mid February this year in order to avoid it!!!", "title": "Vacationers Beware!", "helpfulness": 9, "user": "Millie M", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123431901}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "My husband and I took a whirlwind vacation to Aruba to celebrate our retirement. We agree with the previous comment about the east coast \"community\" that shuts down for the third and fourth week in January to come to the Ocean Club. Loud noisy and obnoxious kids-teenagers who think they are entitled to act anyway they choose. We were horrified.", "title": "Marriott Management Dropped the ball", "helpfulness": 12, "user": "robbin n", "date": "January 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123256217}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We are owners at the Ocean Club, who bring family and friends with us every year (for 7 yrs), and the reaction is always the same: Fantastic! The Ocean Club excels in providing a beautiful and happily laid back atmosphere, so anyone from 2 to 90 can find enjoyment there. The staff is unfailingly friendly and cooperative, without being intrusive, and often go the extra mile to accommodate your needs. We are usually there in high-season, but even at full capacity, there is plenty of room to absorb the extra guests. You never feel crowded, or stressed that you won't get a nice place by the pool or on the beach. It honestly never seems over crowded. The management does it's best to maintain the high quality of the premises, and acts promptly if a problem arises. They are also proactive, making sure that renovations and updates are done in a timely manner, with little disruption to the guests. It ranks far and above the environment at its sister, the Surf Club, which seems to have been cloned as a Disney-style \"Theme Resort,\" right down to the loud background music and crowded atmosphere. As long as Marriott holds the Ocean Club at the standard it enjoys today, we will enthusiastically keep returning.", "title": "The Ocean Club 4-Ever!", "helpfulness": 5, "user": "ronay55-", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31643284}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I traded our Orlando timeshare for a one bedroom unit at Marriott's Aruba Ocean Club during the week of May 18, 2009. After reading some of the reviews about this resort, I was concerned about the quality of the beach and the rooms. Don't be concerned--this property is amazing, and it exceeded our expectations!", "title": "Outstanding. Can't wait to go back!", "helpfulness": 11, "user": "Neurosciprof", "date": "May 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30622598}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The Ocean Club is an older property, but as many of the reviewers have said, age has advantages. It is located right in the middle of the Surf Club and the Stellaris Resort and Casino, which means that you can take advantage of these properties (with the exception of the pools) without walking far. Because they are all connected, you can charge drinks, food, etc. to your room with ease, regardless of which property you are in. Perhaps most important, there are NO CROWDS at the Ocean Club. The Surf Club had a \"slow\" week while we were there, and the pool looked full to us. I can't imagine how crowded it is when the property hits full capacity.", "title": "Can't wait til the remodel.", "helpfulness": 4, "user": "GoogleEarther", "date": "May 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 30495389}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We used the pool and beach at the Ocean Club everyday, and had no trouble securing a palapa with a good view. The staff went out of their way to help, from the doormen to the front desk to the concierge. The room was spacious and well-appointed, and we were surprised to learn that our room was \"old\" and in need of renovation. We were also shocked to turn the TV on and see all of our NY stations...it felt like being home!", "title": "Beautiful island and resort, we will be back!!", "helpfulness": 11, "user": "dotti105", "date": "May 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 29172152}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Food is expensive, but there are many options within walking distance, including several that are on the water just behind the resort (Hadicuirari, Moomba). You can't beat the sunset views! We also took the ABC Jeep Safari tour (affectionately called the \"Shake and Bake\" tour by the Marriott workers) and were happy that we opted for the three hour--and not an eight hour--package. It was fun, but we will likely not do it again. We also took a sunset cruise with the Jolly Pirates (walking distance from the hotel). I'm not sure I'd recommend that unless you are a teenager.", "title": "One happy island!!!", "helpfulness": 8, "user": "joepetes", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28521275}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We rented a one bedroom unit for a week in December 2011. The unit itself was fine, bedroom was good, the living room had a pull out couch that was impossible to sleep on, and even with a pad, a board, it was awful. Since we were with the kids, we put them in the nice bed in the bedroom, and suffered on the living room couch. For the couch alone, we will try to rent a 2 bedroom next time, as we really could not sleep!", "title": "Good for the money", "helpfulness": 1, "user": "NYCtravel", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 124271194}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "the staff was wonderful. Our daughter got an ear infection, and the hotel staff sent a get well note and a stuffed toy for her. Very impressive for a time share!", "title": "Teenagers were a nightmare! Shame on management.", "helpfulness": 7, "user": "Med421", "date": "February 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124087050}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "we went shopping once at the local supermarket and bought enough for a week of breakfasts and lunches. We ate dinner out every day.", "title": "Great room - great beach", "helpfulness": 4, "user": "timeisshort", "date": "January 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123915671}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "One restaurant I would NOT recommend is Bucaneers - we literally left when we saw what the appetizers looked like!", "title": "Great stay. Good service. A little stressful getting spot on the beach", "helpfulness": 2, "user": "JAR55", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123825783}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "we spent most days in the pool and beach (until the ear infection), and overall had a pleasant stay. I would recommend this to everyone, but would caution you regarding the pull out couch.", "title": "Great stay; less-crowded than neighboring resorts", "helpfulness": 4, "user": "toastytravels", "date": "January 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123780402}, {"rating": 3.0, "title": "Better options elsewhere", "text": "We just returned from a weeks stay. Do not stay in room 5285! Although listed as and charged to you as an ocean view room, you get a view of a tree and the iguana family that live in it. Be sure to have lettuce ready at 9:00 a.m. According to staff, the Ocean Club is routinely 80% booked by members so it is difficult to get an ocean front or ocean view room any time of the year. The washer/dryer situation is demanding. Trips that are sold at the Concierge Desk can easily be purchased for much less by vendors on the beach outside the Ocean Club. Aruba is also a very expensive place to eat and drink, even if you buy food to bring back and cook yourself.", "user": "RobertLivonia_MI", "date": "January 14, 2012", "id": 123079225}, {"rating": 5.0, "title": "Our Home Away from Home", "text": "In spite of this, we had a wonderful trip. The island, hotel, beach, weather, and locals are wonderful. However, Marriott has many wonderful properties and due to the cost and view issues, we might look elsewhere next time.", "user": "Travelgrl911", "date": "January 12, 2012", "id": 122987074}, {"rating": 4.0, "title": "Great experience at the Ocean Club", "text": "We are owners at the marriott Ocean Club, and have gone four times now. We LOVE this resort more than any other place we have travelled to. We bought when my son was 1.5 yrs old, and now he had his 4th time back as a 9 year old. my kids made friends with the many other owners and their children, and for our two weeks there, we established a bond with many other guests and will miss them dearly!!! We only hope that we can see our friends Deb and our \"poolside dancer\" rockin Ronnie in July of 2013 when we go again. It truly is one happy island. The staff goes above and beyond to take care of our needs. We espcially enjoyed Mike and meldrick, and the \"Mike and Meldrick Halftime show by the pool.\" These guys entertained our kids with Karaoke, and bingo (played everyday!) and watermelon eating contests, etc., etc. The kids night out allowed our large group (yes, 18 or us total between surf and ocean) a night at Chalet Suisse. It was great! We would not stay at Surf Club though, because personally for me it is just too insane. The only complaint I do have is that the icecream store on the main floor closes too early, and wont stay open a second past closing time! Thankfully we could take our kids over to the hotel for the same stuff. Aruba is a very safe island, and if you have kids, it is the best place to come! You are encouraged to leave the resort at night and go out, and the Plaza is a five minute walk away. We cant wait to go back!!!!!", "user": "RKalaba", "date": "January 11, 2012", "id": 122943126}, {"rating": 5.0, "title": "ocean club members using surf club pool", "text": "My wife, daughter and I spent a whole week at the Ocean Club in December. It's great hotel and not too crowded even though it was holiday season. Very friendly staff, clean rooms. Never had any issue renting a cabana. Highly recommend.", "user": "atsea", "date": "January 9, 2012", "id": 122824672}, {"rating": 3.0, "title": "Nice property, but just another guest!", "text": "Unless they have changed the policy at th eocean club i believe if you stay in the ocean club you can use the pool at the surf club. The way i understood it surf club members cannot use the ocean club pool. Surf club pool much better for kids.", "user": "jenstyle", "date": "January 6, 2012", "id": 122665857}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Still at the resort. Great weather. A very nice week.", "title": "Nice Rooms, nice beach", "helpfulness": 9, "user": "DocVB", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 28261613}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Nice 2-br room, seems vast by by standards over the usual hotel-room size. great to have a kitchen and living room as well. Room as clean but sort of Menards-cheap fixtures. did have a/c problems in the sub-suite x2.", "title": "Better than Maui!", "helpfulness": 12, "user": "Rainy64", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27828319}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Pool area and beach were very nice. entirely adequate for size of resort, even with it being Easter week. Yes, the neighboring Surf club is a zoo and very crowded. Was able to get free palapa every day.", "title": "Need updating", "helpfulness": 3, "user": "1983lawbaby", "date": "April 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27819899}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "In-resort prices are rediculous. I felt like I was experiencing bankruptcy by a thousand cuts. Tip, tip tip me. Even though we used the room charge very sparingly, the room charge was $1000 by weeks end. At least the rumored 10% room charge fee was not made. even lunch for 4 at poolside was $120. $9 drinks. Beer? I donwannknow.", "title": "Beaches, weather, restaurants are exceptional!", "helpfulness": 6, "user": "rslocum", "date": "April 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27677233}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Every meal on this island is hugely expensive. Minimum $200 for 5, without wine, desserts or lobster. Last nite at Texas Brazil the total with tip was $380 with a $45 pitcher of sangria. Had so-so meals at Ruth's Chris, the Pelican Pier, and better luck at Moombas and Iguana Joes (although the pulled pork is suspiciously Sysco-like). We dined at the harbor at a Heiniken bar and enjoyed watching a huge cruise ship leave port. Great Drafts of Heinie!", "title": "One Happy Island!", "helpfulness": 7, "user": "MoCaribfan", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26987751}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I were at the Ocean Club July 10th - July 17th, 2009. This was our first time going to Aruba; we couldn't have had a more relaxing fun experience.", "title": "Fantastic experience - we will go back!\"", "helpfulness": 11, "user": "kalzok", "date": "July 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35073114}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The ride in from the airport was a breeze; just look for the Taxi's with \"TX\" on the license plate as these are the government sanctioned cabs. It cost us $25 for four bags and two carry on's to get to the Ocean Club.", "title": "interesting experience.....I'll go back", "helpfulness": 5, "user": "njmet", "date": "July 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34483829}, {"rating": 5.0, "title": "Awesom Aruba", "text": "At check in we were given a room with a view we did not like; one phone call to the front desk and the Manager happily gave us one with a better view. Every time we encountered anyone from Marriott throughout the week we were always cheerfully greeted; they go out of their way to make you welcome.", "helpfulness": 2, "user": "Pattynola", "date": "June 23, 2009", "id": 32962245}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Each morning I went out to the Towel Hut at the beach around 8:15AM to secure a palapa on the beach. The palapa's are grouped 100-600 with 100 and 200 being on the beach; the higher the number the further from the beach and closer to the pool you go. The 100/200 palapa's rent for $15 (100 level) and $10 (200) per day. All other ones are free on a first come first serve basis. We preferred sitting in the 400/500 area as we found we got more privacy, there was no rental fee and the walk to the beach was insiginificant.", "title": "Fantastic", "helpfulness": 3, "user": "Krumdog89", "date": "June 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 32391003}, {"rating": 4.0, "title": "Marriott Ocean Club", "text": "Both the Surf Club and the Ocean Club were booked to 98% occupancy from what we were told. I was amazed at how crowded the beach/water was in front of the Surf club - many families. The beach and water in front of the Ocean Club was half as crowded; plenty of room to stretch out. I would highly recommend the Ocean Club over the Surf Club if you want to avoid kids and families.", "helpfulness": 3, "user": "katie019", "date": "June 13, 2009", "id": 32231009}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Stayed here for one week at the end of June with 9 family members. We had 2 condos on the second floor of the wing closest to the Surf Club property. The rooms were very large and well equipped. We easily slept 6 in our full condo with additional room. There is free WiFi so bring your laptop. The laundry is not in the condo itself, it is in one wing on each floor. For us this was slightly inconvenient because we had to walk clear to the other side of the building to monitor our laundry. I used the fitness center once and it was pretty well equipped and maintained.", "title": "Average", "helpfulness": 3, "user": "LuvSLO", "date": "August 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 38087861}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The pool is nice but small and the whole family commented on this. The beach was nice and it was very easy to get a palapa in the morning. However if you want a palapa right on the water, you will have to reserve the night ahead which I believe costs money. The restaurant by the pool has pretty decent food but a limited menu and it's very expensive so you're better off going on a shopping trip when you arrive to stock up on supplies. The bar by the pool makes very weak drinks and they melt in seconds because it's so hot so I didn't spend too much money there. We also ate at the sports bar inside the hotel which was surprisingly good. We at at the breakfast buffet over at the Marriott hotel property. The buffet was delicious and had a great selection.", "title": "Another great trip", "helpfulness": 3, "user": "slthurlow", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36192632}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I bought a souvenir at the Coconut Trading Company in the lobby and the saleswoman was very rude which I didn't appreciate. I had a coupon up in the room for a \"free gift with purchase\" and when I asked the woman if I could still get the free gift she told me I had to go back to the room to get the coupon. When I found out the gift was a very cheap magnet, I was irritated. I could understand getting my coupon if the gift were of value but the magnet was maybe 50 cents.", "title": "Not at the top of my list of places to return!!", "helpfulness": 2, "user": "wdm73", "date": "July 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 35552178}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We went to a timeshare presentation while we were there so that we could get $100 in gift certificates to local restaurants. This was a great use of my time and we also got to tour the Surf Club property which was beautiful; much nicer than the Ocean Club although the condos are smaller than those at the Ocean Club.", "title": "Aruba - Forget it!", "helpfulness": 3, "user": "MarcoPolo242", "date": "July 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 35317910}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The complex could use some updates. In particular, we had problems with our keys. The key reader on our door was broken so it occasionally stopped working so we would have to hike back down to the front desk to fix the issue.", "title": "i would never stay there again", "helpfulness": 4, "user": "my3kidsNewYork", "date": "July 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0}, "id": 35114954}], "location": {"country": "Caribbean", "city": "Palm - Eagle Beach"}, "stars": 3.5, "variance": {"poor": 23, "average": 47, "very good": 163, "terrible": 9, "excellent": 326}, "aka": "Marriott`s Aruba Ocean Club Hotel Palm/Eagle Beach", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}