{"user_rating": 4.0, "review_count": 631, "name": "Marriott San Francisco Fisherman's Wharf", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "We visited this hotel as a gift from a very generous uncle. The hotel had the clean, high standard finish you would expect of any Marriot. The location is literally 2 minutes from fishermans wharf but the hotel doesnt benefit from any stunning views of the wharf or the golden gate bridge from any windows. It has an almost dwarfed apperance and in honesty looks more like a motel; It is only once inside you see the luxury. We had a hire car with us and were told there was no where to park in the vicinty and had no choice but to take advantage of the hotels garage which we thought would be free or at a discount at least for residents...but it actually cost £45 for 2 nights parking!! Our room cost alot and this on top was extortionate espcially as my partners uncle was paying for it I couldnt enjoy our stay as much thinking about it. On the upside our room was great and the bed very comfy but purly on extreme lack of value for money I would go else where next time.", "title": "\"Great location but expensive\"", "user": "Travelling_Queenie", "date": "March 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 14301820}, {"rating": 4.0, "title": "Marriotts have never disappointed me!", "text": "I just got back, had great Marriott service as I always do and would stay at this one again in a heartbeat. Great fitness center, free internet at the business center, friendly, friendly, helpful staff, very clean room, 5 star service in a 3-4 star hotel. Its also a stone's throw from the Wharf and not noisy. Price was good considering the location (I paid about $200 a night). The staff was always, always, ready to help me out.", "helpfulness": 2, "user": "Karrieb", "date": "February 16, 2008", "id": 13587107}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Fantastic location within walking distance to just about everything. Traveled out 4 miles by bus then walked back. Hotel concierge was very helpful in selecting dining locations and all were above expectations. Bedrooms were ample in size and comfort. Bed linens were fresh each day and the room tidy and restocked appropriately. Room service was fast and the food above average. Enjoyed the sitting area near the bar with the fireplace and \"table service\" from the bartender. Friendly staff. Excellent breakfast bar but a bit pricey. My husband and I would happily stay here again and recommend it to any traveler. One drawback was the significant walk from the elevator to our room. If walking is a problem, travelers should specifically ask for rooms closer to the elevator. But, that's a nit when you are away from home for vacation. Great hotel.", "title": "Great Hotel", "helpfulness": 1, "user": "happyflick", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13446354, "likes": {"liked": "— Comfortable beds", "disliked": "— View"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Great location, quiet area, with easy access to cable cars, buses, or street cars, and we walked a lot too. The staff was very nice across the board. The concierge gave GREAT recommendations on restaurants; he hit the mark 3 out of 3 times, exactly what we were looking for at the moment. We especially recommend the Steps of Rome Cafe on Columbus St. (next door to a sister restaurant, the Steps of Rome Trattoria which we hear is good also, but more expensive.)", "title": "Highly Recommended", "user": "TravelAngst", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13395673, "likes": {"liked": "— Location, beds", "disliked": "— Noise from adjoining room, through the very thin door (TV, lud talking)"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We also recommend the Pescatore Cafe, near the hotel, and also Alioto's on Fisherman's Wharf. We were delighted by the beautiful gardens on Alcatraz, the view of the city skyline from the now closed prison, boat trip over and back, and self-guided tour of the place. We also enjoyed the nearby dockside tour of the liberty ship SS Jeremiah O'Brien, and submarine USS Pampanito. The Muir Woods (redwoods) site across the Golden Gate bridge was inspiring and also the Benziger Family Winery in Glen Ellen (Sonoma Valley), and their practice of sustainable and biodynamic farming, plus their fabulous guided tour and wine tasting. We rented a minivan right around the corner", "title": "It was okay...", "helpfulness": 1, "user": "wisekas0327", "date": "January 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 3.0}, "id": 13070796, "likes": {"liked": "— The staff was courteous and the bedding was amazing!", "disliked": "— The location."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We stayed at this hotel using our Marriott points and chose between this property and the JW Marriott near Union Square (same amount of points). Being that we have stayed several times at the JW (Pan Pacific until a year or so ago), we chose to stay at Fisherman's Wharf for a change of pace. As soon as we walked into the room I wished we would have chose the JW.", "title": "Needs a major facelift", "helpfulness": 4, "user": "JT3373", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 14862505, "likes": {"liked": "— Bed, location", "disliked": "— Room decor"}}, {"rating": 4.0, "title": "will return", "text": "The lobby and lounge area were comfortable and well decorated, but as soon as you get off the elevator you see that the hotel could use a facelift. The carpet, furniture, bathroom counters/fixtures were are all very dated, and supposedly we were in a recently renovated room (I don't think so, or at least hope not). There were also dirty dishes left out in the hallway for about 6 hours at approx. 7 different rooms, even though housekeeping was on the floor for at least 3 of those hours.", "helpfulness": 1, "user": "begley85", "date": "March 31, 2008", "id": 14693212}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Housekeeping staff was also not very into customer service. No, I didn’t complain about the dishes, or anything else for that matter, though they (3-4 women at different rooms), looked very unhappy and avoided eye contact. I found this unusual for a “nicer” property, where I am used to being greeted by staff (we were when we were downstairs). I would have gave them a friendly “hello” first had they even looked at us…Maybe too harsh, but I am making this critique mostly for the hotel management who hopefully check these reviews.", "title": "2.5 Star for 4 Star Price", "user": "srbmpna", "date": "March 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 14540752, "likes": {"liked": "— bed was really comfortable", "disliked": "— shabby decor for the price"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The pros for this hotel were the bed (feather duvet, pillows and mattress pad), friendly staff (except as noted), and proximity to Ghirardelli Square, Fisherman’s Wharf and Pier 39. The lounge was also comfortable and service was excellent.", "title": "Fantastic Time at Marriott Fisherman's Wharf!", "helpfulness": 2, "user": "missyoulikegravy83", "date": "March 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14320350, "likes": {"liked": "— Concierge", "disliked": "— No view of Water!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "For breakfast we chose room service (hung our order on the door the night prior), which arrived on time, just a bit cold, but was very good (California Omelet was fantastic). Our room service waitress was also very friendly, asking not only was there anything else for our meals we needed, but asked if she could answer any questions about the area or property. That was a much appreciated touch, even though we had no questions.", "title": "Great location, no concierge room, normal rooms.", "helpfulness": 2, "user": "iflewjetz", "date": "March 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14318872, "likes": {"liked": "— Location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "The softest, largest and most comfy bed in the world!", "title": "Best beds in the world!", "user": "smokeyrasher", "date": "July 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18337724}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The friendly staff at the hotel (desk and concierge) helped to make this a memorable family stay for us. They gave us wonderful restaurant and sightseeing recommendations and for the restaurants they even helped us to make bookings. Our room was clean, quiet and comfortable. The location by the Fisherman's Wharf area and a short walking distance to North Beach make this an ideal reasonably priced hotel for tourists.", "title": "A Super Stay", "helpfulness": 1, "user": "TravelfamSingapore", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18259188, "likes": {"liked": "— The helpful staff and the location", "disliked": "— One bed was too soft"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The room was very nice...the bed was like a cloud with luxurious linens and LOTS of pillows. The toiletries were Bath & Body Works. The in-room coffee was Starbucks. The tub, while not jetted, was rather deep. There was a hair dryer, iron, iPod docking station, internet ports, etc., etc. Anything you could have asked for in a perfect location to the Wharf and various bus/cable lines. The staff was very helpful and cheery. VERY well appointed and CLEAN for the extreme value we got through Priceline. Couldn't have been happier.", "title": "FABULOUS!!!!", "helpfulness": 2, "user": "rcajd", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17995305, "likes": {"liked": "— All of the upgraded amenities", "disliked": "— The view"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008", "text": "Nothing special about this hotel. My room (533) had adjoining rooms on both sides so I got to hear my neighbors well. Not a good strategy for trying to stay on east coast time during a short business trip", "title": "Totally Unremarkable", "user": "keatingfamily", "date": "July 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17674370}, {"rating": 3.0, "title": "What You Would Expect For the Area", "text": "I did enjoy my room service meal of San Francisco Clam Chowder in a Sourdough Bowl and the Fisherman's Wharf Cobb.", "user": "cinncitraveler", "date": "July 2, 2008", "id": 17453668}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "I did not like this property. The lobby area was nice and the staff was courteous, but the rooms were SOO OLD and outdated!!! Not at all what I expected by pictures. I would recommend the holiday inn express down the street, it was newer and much nicer than the marriot. Very dissapointed with my stay for the price we paid.", "title": "Old, ugly, and overpriced!", "user": "PinotNoir25", "date": "June 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 17095093, "likes": {"liked": "— location", "disliked": "— dirty and old; overpriced"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "After staying at several SF Marriott properties in recent years, landed at this place for the first time after scoring a $100 room rate. Used my platinum status got me a Junior Suite, which was huge. The place was nice, bathroom looked a little dated. When I travel to SF I NEVER rent a car. It doesn't make sense as between trolley, BART and cabs, you can get around easier. If you don't like the spendy parking charge, well, DON'T DRIVE. Love the free breakfast buffett (another platinum perk) and the walking distance to all things on the Wharf and North Beach (an easier walk home than going up the hill). Anyway, I would stay here again in a heartbeat if the rate was right.", "title": "Ask for a Junior Suite", "user": "MarriottGuySanDiego", "date": "June 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16627522}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "I've stayed here several times and the location can't be beat for things to do. The room had several nice touches like a Tempurpedic type matress, nice linens and duvets. In room refrigerator and a window that opens were all nice touches. The concierge couldn't have been nicer and arranged Alcatraz tour tix on short notice. My only complaint was the brkfst buffet was pretty pricey, but there are some great local brkfst places close by the staff recommended.", "title": "great room with attentive staff and conciierge", "helpfulness": 3, "user": "davidgmg", "date": "May 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15904390, "likes": {"liked": "— location", "disliked": "— expensive breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I stay in hotels about 3 weeks out of the month and this was a very nice hotel and furnishings.", "title": "Pleasantly surprised!!!", "helpfulness": 3, "user": "katjop", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 15782050, "likes": {"liked": "— Location... (22 yr old daughter liked free internet)", "disliked": "— Parking cost... (23 year old daughter said Hilton Wharf fitness center better)"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We didn't know what to expect after reading these reviews but we were very happy with our stay here. (Glad we picked Fisherman's Wharf location.) The room was a nice size, quiet, older, but clean. (Refrigerator would have been nice though) The hotel staff extemely helpful. We requested an early check-in (11am) and they did everything to make this possible, we checked in at 10am. Two nice breakfast places nearby, Buena Vista Cafe (YUM!) and favorite (the name escapes me..Mary's?) on corner of Columbus and Beach on the west side of Joseph Conrad Park. Public transportation so easy from here!!! A convenient Columbus St bus stop nearby (travels right to North Beach, Chinatown...), F-line around the corner (Pier 39, Ferry Building) and cable cars just a few blocks away (Union Square). Always easy to find our way back from every part of the city. Remember... not 5 star... we were not expecting it but were pleasantly surprised.", "title": "SF Marriott Fisherman's Wharf STINKS!!!!", "helpfulness": 6, "user": "Beedrill", "date": "April 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 14989401, "likes": {"liked": "— beds", "disliked": "— staff"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 29, "average": 123, "very good": 283, "terrible": 15, "excellent": 181}, "aka": "Marriott San Francisco Fisherman`s Wharf Hotel San Francisco", "slim_ranking": 0.336170212766, "description": "LOCATION In the heart of Fisherman's Wharf, between two of San Francisco's cable car lines Near attractions, shopping, and 15 miles north of the San Francisco International Airport 1.5 miles from the San Francisco Financial District SLEEPING ACCOMMODATIONS 285 Deluxe Sleeping Rooms (including 12 Junior Suites and 1 Hospitality Suite) Five Floors Completely Renovated Guests Rooms and Meeting Space MEETING ACCOMMODATIONS Seven meeting rooms totaling over 6,000 square feet We can accommodate meetings and food & beverage functions for groups of 5 to 250 RESTAURANT AND LOUNGE FACILITIES Casual dining in a full-service restaurant, Spada EXTRAS tComplimentary Limousine Service to Financial District (7 a.m. – 9a.m., Mon – Fri) Health Club with Sauna (24-hour access with guestroom key), located on the second floor Gift Shop, open daily 7:00 a.m. to 10:00 p.m. Fully-stocked Honor Bars in Each Guest Room Handicap Accessible Rooms Safety Deposit Boxes Available Iron, Ironing Board and Hairdryers in Each Guest Room."}