{"user_rating": 4.5, "review_count": 2944, "name": "Marriott Niagara Falls Fallsview Hotel & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I read the reviews here before staying at the Marriott Fallsview....because the Casino hotel was already full.", "title": "Great location, nice hotel", "user": "AHSPAO", "date": "March 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 59376354}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The hotel is nice, the place is clean, the beds are comfy and nice (on the level of a 4 star hotel) The rooms are not bad, I read a review that said not to bother with a Fallsview Room because the RiverView room gets the same view. ABSOLUTELY FALSE, the Riverview is on the side of the hotel and you will NOT get to see the Falls at all. Believe me, I stayed in the Riverview side.", "title": "Beautiful View of the Falls", "user": "WorldExec", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59296510}, {"rating": 3.0, "stay_parameters": "Stayed March 2010", "text": "Parking is $20 Valet or Self-Park...so you might as well Valet. Or you can park about 5 minutes down the street for $5, and yes the bottle of water in your room is $10, so bring one with you...no fridge in my room", "title": "Great view but a long walk to the Falls in the winter", "user": "trustytraveller62", "date": "March 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 58841839}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I walked to the falls, ya about 10 minutes or so, I walked to the Casino...even though they have a shuttle. All in all, i'd probably try to stay at the Casino unless I don't want to gamble but still get a great view of the Falls.", "title": "Great View", "user": "TruthbeToldToronto", "date": "March 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58658230}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "PS...I also did notice that the staff were just \"doing their jobs\" and not the most cheerful people around. I think Canada has that effect on some people.", "title": "not happy!", "helpfulness": 1, "user": "mj_elia", "date": "March 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 5.0, "location": 2.0}, "id": 58636372}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "We checked in at 5:30 pm and our room was not ready. We had to wait until 6:30pm. Check in is at 3:00 pm and to make us wait let in the lobby for one hour is awful! Especially when you are on vacation and with a 2 year old. The view was nice but I had paid for a fallsview. The person behind the counter told us that we could pay $60.00 more to get a room higher up right away and not have to wait. They should have just put us there as it was there fault that the room was not ready not ours. Unreal! Poor customer service. They also had bugs in the rooms and only 2 pillows on each bed. They had large pillows for decoration but you could not sleep with them. I won't recommend this hotel as I will not go back there or to any other Marriotts in the future. Sheraton hotels are much better.", "title": "Won't go back to this hotel", "helpfulness": 3, "user": "Love2Travel100", "date": "July 6, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8068326}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed for a couple of nights from 31 May 2007. We got a good deal through Opodo", "title": "Fantastic views, why else do you go to Niagara Falls?", "helpfulness": 2, "user": "bonus", "date": "July 4, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 8057409, "likes": {"liked": "— Location and views", "disliked": "— A bit pricy, but hey, look at the locaton"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Our room was a standard room on the twelfth floor. It was a good room with a drop dead gorgeous view of the Horseshoe Falls and rapids and a good view of the American Falls a little down river. We were right by the lift and noise from the corridor wasn't a problem. We also heard the distant roar of the falls through a vent in the window - fantastic!", "title": "Beware the exchange rates!", "helpfulness": 4, "user": "jvbeachlover", "date": "July 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8056471}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The room was large and bright with a huge window overlooking the falls. There was a nice big bathroom including a shower over the bath. The room was clean and well maintained and the bed was very comfy. My only complaint is about all the junk that many hotels insist on peppering on every flat surface; wee leaflets, cards, notices, forms, brochures, and directories etc about this, that and the other. Anyway, they all ended up on top of the telly so we could lay our own junk out!", "title": "Average Room - Great View", "helpfulness": 3, "user": "gumba69", "date": "July 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8040302, "likes": {"liked": "— Great View", "disliked": "— Every little thing costs something (to be expected though)"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room had a coffee maker, mini-bar, a safe and , bizarrely, a shoe polisher! Everything was in good repair. The ice machine on our floor was out of order but there was another one downstairs .", "title": "Good trip but wouldn't stay again.", "helpfulness": 5, "user": "Christina0322", "date": "July 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8036438}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "the consierge was horrible. the girl was rude for no reason, i asked one question and she had alot of attitude. we booked a riverview but got a falls view for no extra money, it was a beautiful view. the beds wernt as comfortable as i had hoped. you should book ahead as much as you can. we got a room for valentines day for 187 a few days before people were paying 387 for the same room. we went to dinner at the keg, it was more pricey than usual but amazing, the staff there was really nice.", "title": "good price for the view.", "user": "bobbysaget", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 57532301}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My boyfriend and I just came back from our weekend getaway to Niagara Falls. We are a fairly well-traveled young couple who have stayed at a fair share of hotels, b&bs, and hostels around the world, and although Niagara Falls isn't exactly an prime sightseeing destination, we just wanted to get away.", "title": "Overpriced but not a ripoff", "helpfulness": 3, "user": "elmiaberlin", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 56714435}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "So anyway, first and foremost, this hotel has outstanding and attentive service. At times everybody who worked there (from the check-in to the bell boys to the waiters at the restaurant) were so friendly I felt like I was Jim Carrey on the Truman Show...", "title": "Amazing view, room, location.", "helpfulness": 4, "user": "Pizzlovestotravel", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56323059}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The rooms were clean and spacious--we enjoyed the use of the in in-room whirlpool but not the skimpy supply of soap. I'm not a really picky or sensitive person when it comes to room temperature, but I had to admit that the room we stayed in was also exceptionally stuffy, despite the fan being turned onto maximum at all times and the window being open. The internet service has an absurd charge--and yeah I guess not everybody neurotically checks their email but it's 2010, you would expect a hotel with a 200/night price tag to offer complimentary albeit slow internet service.", "title": "Amazing!!", "user": "GOVtravelerNewYork", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56231120}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We booked the two night package, which was a pretty good deal. The breakfast at Terrapin Grille was acceptable considering we received two vouchers as a part of the package that was paid for already. I definitely would not have paid 45 dollars up front for the cold muffins and powdered eggs, albeit the nice view and the decent service. My boyfriend enjoyed the omelette station, apparently it was impressive. We spent the $75 dinner voucher on room service, which was acceptable considering the bad reviews the dining room has received on this board. Everything in the hotel as well as in the area had extra service charges tacked onto it.", "title": "Brilliant, great value and everything you want in a hotel", "helpfulness": 1, "user": "meljup", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56113511}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I stayed at the Marriott Falls view with my girlfriend and we loved it. The view from our room was near perfect, I don't think we could have asked for a better view to be honest. The staff was very courteous, the food in the hotel was great... a bit pricey, but good quality. The only thing that was a bit stressful was the Canadian vs. US fee's. The hotel kept charging me Canadian fee's even though I told them repeatedly I was paying US cash. Then they tried charging me 14% tax on the Canadian fee even though I'm paying the US fee in American CASH. After arguing with the staff for a bit they eventually did the right thing and even took off the parking fee which is $23 a day. So would I stay here again, absolutely... BUT I will make sure to get all of the fee's and taxes upfront before even reserving the room.", "title": "Almost Perfect", "helpfulness": 3, "user": "jason8478", "date": "July 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8267009, "likes": {"liked": "— The View", "disliked": "— The Fee's"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We are Marriott Rewards members, so we used our points for first night - \"city view\" room - we were pleased to be on 5th floor w/ a partial view of the Horseshoe Falls. There was a mix up at check in and it was chaotic at the desk, but our great Bellman, Rick, marched us back to an asst. mngr. and told them we got the wrong room. Quckly straightened out. Fairly quiet and lrg. room. Next morning, I went to desk to inquire about our reservation for a \"full fallsview\" room. We got a n/c upgrade to the 19th floor. Allowed to transfer immediately (at 11:30 AM no wait til check-in.) The almost cormer room (#1928) was smaller than the first one, but the view was supreme -watched the fireworks in awe. Got what we paid for with that view!", "title": "Great views, average hotel", "helpfulness": 2, "user": "TeeCee21", "date": "July 31, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8264867, "likes": {"liked": "— the amazing views from full fallsview room", "disliked": "— customer service from restaurant, concierge, some front desk interactions like money exchange"}}, {"rating": 4.0, "title": "Wheelchair Friendly!", "text": "Breakfast Buffet at Terrapin was really overpriced, crowded and average. Don't do it! Use the mini-bar refridge. for your own bev./snacks.We did this on 2nd morning. Had cont. breakfast we brought to the room. Parking is crazy -crowded, cars stuffed in the driveway entrance all the time Valet told us the parking lot is a block away so they have to run back & forth to get/move cars. We took cab to Clifton Hill - $6.00 one way but fast. Service from concierge was lame bcause they push their own tour. We did fine on our own. We saw huge increase in crowds on Sat. so glad we did MoM, Clifton Hill on Fri.", "helpfulness": 2, "user": "Binkey", "date": "July 30, 2007", "id": 8262707}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "**This is an average Marriott in terms of rooms, food, and service. You are paying for the view but you will get a great one! Fallsview casino and incline railway are a short walk. Casino has some decent restaurants around it and lots of average restaurant chains right there, too.", "title": "Best view but with a price", "helpfulness": 2, "user": "Lark M", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8252423, "likes": {"liked": "— The view of the falls", "disliked": "— The price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Room 1411 is the best wheelchair accessible room I have ever stayed in over an eleven year span. The room is large and manouverable, the bed is large enough for physio, the bathroom actually has a roll-in shower and the toilet is set up for anyone who has to do a bowel routine. I could not believe I finally found a completely wheelchair accessible room....finally!", "title": "Fantastic View!", "helpfulness": 4, "user": "scorpio5", "date": "July 28, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 8247446, "likes": {"liked": "— the view", "disliked": "— price--it was a fabulous view but the room was very expensive--about $300/night with taxes etc!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "1. Get a room with a view.", "title": "Good location", "helpfulness": 2, "user": "seethesightsUSA", "date": "August 19, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 137670693}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "2. Get a map of the shuttle route and use it, it is too far to walk to the Maid of the Mist.", "title": "Great for a night to see spectacular view but the price!", "helpfulness": 1, "user": "TravelGuy0001", "date": "August 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 137620139}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "3. Get an all day pass to the incline railway. It is fun and right behind the hotel and will save you some walking. Walk out the back of the hotel, across the walkway, down the railway and across to the visitor center then out to Table Rock.", "title": "Awesome View!", "helpfulness": 2, "user": "schinnyNewJersey34", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137614678}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "If not for the view this hotel is average at best. The value not there at over $400 a night. Hotel somewhat tired and the superior room is far from that. With areas like Niagara-on-the-Lake and its hotels close by it may be a better option.", "title": "Great location, great view (if you pay for it)", "helpfulness": 2, "user": "nomadica", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137555466}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The view is perfect! The hotel is pricey, but worth it! We stayed on the 14th floor and loved it! The pool had an excessive amount of chlorine, it burned your eyes to sit in the hot tub. Parking was $25.00 a day. We did not eat at the hotel.", "title": "Super view", "helpfulness": 2, "user": "ginai54", "date": "August 17, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 137447691}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I was surprised at how good this hotel was for the rate we paid! Great views of The Falls from all rooms. Very clean, nice pool and gym too. Location was great, there is a stair lift type thing to get you down to the promenade level (for a fee). Would definitely stay here again.", "title": "Excellent hotel...perfect location", "user": "jfitzpa", "date": "August 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137301340}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We selected the Marriott Fallsview after reading all the reviews. We selected the Superior King Fallsview room. They put us on the 21st floor. All I can say is WOW!!! What a spectacular view we had. The room is Very comfortable: Plenty of room to navigate despite some negative comments. Two comfortable chairs by the window. A great roomy two person hot tub, in fact the best we ever had in a hotel. Our room was overall quiet with the exception of three young kids playing ball in the hall way. Where the heck were the parents, and what are they thinking. The hotel is very clean, staff was extremely friendly. Yes you pay tp park but they did take good care of our vehicle. Some times it get a bit conjested dropping off or picking up your car but overall they are prompt. Had breakfast delivered two days to our room. It arrived on time and warm. We thought this was a great value overall so we could further enjoy our view.", "title": "Met All Our Expectations", "helpfulness": 3, "user": "RayV555", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137296691}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Eating in the restaraunt as others mentioneed is very expensive, howver the food and service was good. The views are now obstructed due to the trees growing.", "title": "Great amenities, poor valet attitude", "helpfulness": 1, "user": "StanleyChua", "date": "August 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137272838}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Pool size is adequate dispite what one other reviewer commented. What did they expect an olympic size pool.", "title": "Great Location", "helpfulness": 3, "user": "Suninder", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137114778}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were there on the weekend in August and they were tolerable. As mentioned, many things to do in the area so you need at least two full days/three nights. Don't miss Niagra on the Lake, it was beautiful.", "title": "Fantastic view!", "user": "SpangeMart", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137097672}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "More or less our stay was ok. Valet was quick Our check in went smooth Elena was great explaining what hotel has to offer. Room was average clean but had hairs from previous guests in the washroom.. Gross. We only ate in terrapin for breakfast as we didn't find the menu too appealing for us southerners! Sam & Thereza at starbucks were awesome gals and such a hoot to chat with! Definitely one of the fastest serving starbucks I've been to with excellent service!!! Tour desk gave us some great info on local areas and attractions! ! The lobby was packed every morning and felt like a jungle gym with kids climbing all over the seats and couches running everywhere!!!!! Was not impressed as it looks like an upscale hotel... The gifts shop is plain and is very pricey and manager lady seemed very rude if you were not buying anything! Found better deals at actual souvineer stores so hold out!!! The bathrooms in lobby were disgusting always dirty later in the day with toilet paper everywhere and toilets not flushed .,yuck! The hotel is very close to the falls casino and we enjoyed walking to the falls as its only 10 min!", "title": "5 star view ..3 star hotel?", "helpfulness": 1, "user": "Fashionfash", "date": "August 16, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 137391544}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "What a view! The Marriott Fallsview hotel has undeniably spacious and comfortable accommodations perfect for families of all sizes. Our room had 2 queen size beds,a sofabed, jacuzzi tub (separated from shower and tub area), and a cute little fireplace. The family rooms are on floors 5-9; with three beds, the setup was perfect for our family of 4 (14 yr old twins) The view of both the American and Horseshoe Falls was spectacular from the 9th floor. Our suite #915 was next to a supporting wall that jutted out into the direct line of the American Falls, but did not obscure the ability to view it.", "title": "Family suite with impressive view", "user": "fkmcja", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137382938}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The beds were comfy with good pillows and inens. The sofabed sheets were dirty and had not been changed; unfortunately, my daughter did not say anything about the soiled linens as she exhaustedly climbed into bed at midnight (she said she tried to sleep on the other side of the bed....ewwww). We'll be more diligent about inspecting the linens on our sofabeds next time--and understand that if a guest puts the sofabed away themselves, it might be easy for housekeeping to overlook the linens. The rest of the room was spotless and immaculately clean and we felt the sofabed linens were an oversight.", "title": "Can't Beat the View", "helpfulness": 2, "user": "Ryan H", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137356069}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We did get to the hotel early and the front desk graciously put an expedite request on housekeeping.", "title": "Perfect!", "user": "UNLVRebel1", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137346335}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We headed to the hotels' Terrapin Grille for lunch while we waited and enjoyed our view. Although we were not in a hurry, I was disappointed at the very slow service, given there was only one other table in the restaurant during the lunch hour.", "title": "Great view, nice room", "helpfulness": 1, "user": "Danapu", "date": "August 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137317396}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We stay at this hotel at least 4 times a year for a little family getaway. I have two small children 2 & 4 and they love this getaway. We always take advantage of the 1 night package they have. The room is clean and spacious (2 queen with separate sitting area and two TV's), the washroom is clean and the beds are comfortable. The dinner included at their restaurant is excellent and their breakfast is very good!! The price you pay for the room and the two meals included is worth the money. Its walking distance to the falls and its a great view when there are fireworks. The pool is okay, the water a little cold but the children love it. The only thing is that the valet parking is a little pricy. But overall great little getaway!", "title": "Comfortable and Clean", "user": "Jazna", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 61193496}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "I' ve stayed in the 19th floor and the view was breathtaking, unique. I' ve been astonished.", "title": "Simply the best", "user": "Stylianos", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61115417}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "we stayed here for one night in the New Years. it was a great stay, the room is spacious with an en-suite louge area overlooking the Falls. excellent view, we could also see the fireworks from the room at night. the beds are very comfy with lots of fluffy pillows. room was clean and quiet. but the tv and other furnitures are rather old but tolerable. we also had complimentary breakfast buffet, which was superb!!... with omlette stations and bottomless coffees/juice and wide selection of hot food. we also had dinner at the hotel's restaurant, which was a fine dining place, but it was worth the fallsview if you can get a window seat. valet parking was mandatory and rather expensive. all in all, nothing to complain, i paid for what i get and i might stay here again if i visit next time.", "title": "excellent choice!", "user": "qtcupid", "date": "April 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 60663220}, {"rating": 5.0, "title": "Amazing!", "text": "My husband and I stayed here for our honeymoon, and it couldn't have been better. The most comfortable beds EVER, the most amazing view, the Terrapin Grill is fantastic, and the staff is great. They suggested and booked a wine tour, which was our favorite thing we did on our honeymoon.", "user": "MalindaKay", "date": "April 1, 2010", "id": 60082255}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It has been over ten years since we stayed at the fallsview. On a whim we decided to to drive up and see if it was as we remember. Marriott provided a with a spectacular room, on the 14th floor which provided an out of this world view. The service staff, from the valet to the room service, went out of their way to please us. A shuttle service is provided if needed for transport to events, casino... Dinner and Breakfast was provided and was prepared in 4 star culinary fashion. Marriott sure does try to be consistent in our opinion. WE ARE SOLD !", "title": "OH WHAT WE HAVE MISSED !!!", "user": "sgtspoon56", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59450448}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "This was by far one of the nicest hotels i have ever stayed in. The view on the falls are unbeatable, and the staff at the hotel was extremely nice. The room my wife and i stayed in had a Fire place (fake), and a whirlpool bath, with a queen size bed. The reason i didn't give the hotel an excellent review was because; if you are from the USA and rely on a Debit/ Visa checkcard for all your purchases, you better bring enough cash to pay for the room in full because you cannot use it, even if you reserved the room on the same card. Second, make sure you bring hygene supplies cause at this hotel, you have to purchase them from your room. Finally, I would recommend getting the package deals offered, because if you buy your meals straight out of pocket it will get very expensive. (EX: $80.00)", "title": "Had the best view of the Falls.", "helpfulness": 7, "user": "dep90", "date": "July 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8118155, "likes": {"liked": "— The view of Niagara Fall, and whirlpool bath.", "disliked": "— Expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "All in all, this hotel and location was very nice, and i would highly recommend it if you want great service , and specatular views of the falls. I plan on revisiting again in the near future...", "title": "Stunning views", "helpfulness": 3, "user": "Seaburn", "date": "July 12, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8108389, "likes": {"liked": "— The wview", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2004, traveled as a couple", "text": "MIKE", "title": "Amazing view!", "helpfulness": 3, "user": "Gremio", "date": "July 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8106510, "likes": {"liked": "— View, Room", "disliked": "— Front Desk"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Spent 2 nights here in July. We had a fallsview room with jacuzzi on 11th floor with the falls right in front of you when you walked in. It was simply stunning and we had to try hard to think of a reason for leaving the room itself. The jacuzzi was large and you could see the falls from it through the large window that opened from the bathroom to the bedroom. The bed was probably the most comfortable I have ever slept in. The rest of the hotel is to a high standard. Most things are quite expensive but if you don't want to spend a lot, there are a host of restaurants etc nearby. There is a free magicians show on some if not every night and he was entertainng, especially for the kids. Most of Niagara's attractions are well known (Maid Of The Mist, Journey Behind The Falls etc) and are a must-see but, if you have a car, take a drive up to Niagara On The Lake. It's a really pleasant drive through the vineyard area with several places to stop off on the way. This hotel is highly recommended for the view alone but it was hard to find anything wrong with it in any other area.", "title": "Great view but don't buy the package deal with dinner & breakfast", "helpfulness": 3, "user": "bepierce59", "date": "July 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8103248, "likes": {"liked": "— Location and views", "disliked": "— Resteraunt prices"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This hotel is beautiful! it is located right next to the falls. Its interior is very nice.", "title": "Avoid the Spa At All Costs", "helpfulness": 3, "user": "MehimandkidsOntario", "date": "July 11, 2007", "detail_rating": {"front_desk": 3.0, "value": 1.0}, "id": 8102539, "likes": {"liked": "— leaving", "disliked": "— everything at the spa"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We reserved a high floor and upon arrival took the \"upsell\" for a higher floor. Honestly, they should book the rooms like this in advance and be honest about the cost- but it was worth the view. 23rd floor and amazing view of the falls, which was perfect for watching the summer fireworks over the falls, and my family really enjoyed the view. Hotel is very close to the incline and falls proper, and a 20 minute walk to the Maid of the Mist tour.", "title": "Amazing view- ideal for family and fireworks!", "helpfulness": 2, "user": "YaleDad", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137072475}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Quiet room, nice amenities. My complaints: the hallways were full of empty beer bottles and food trash, the bathroom was tiny and laid out poorly. IMO those are small complaints for a nice hotel room during a very busy time.", "title": "Breathtaking View Worth the Splurge", "user": "toddunger", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137010797}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Be aware parking/valet is $25 + tips, but the service is good and valet was attentive, polite, and appreciative of tips. Would stay here again.", "title": "Excellent views", "user": "ssarin", "date": "August 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "service": 4.0}, "id": 136998825}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We picked up our kids from camp near Buffalo and surprised them with an overnight trip to Niagara Falls. Since it was for just one night--and could be the one time any of us go--I picked the Marriott Fallsview for the view and splurged on the superior fallsview room. It did not disappoint. We got a room on the 23rd floor, higher than I expected, and the view was just spectacular, even at night when we arrived. We all just sat down in front of the huge window, put the gas fireplace on, gazed in amazement, then enjoyed the 10 pm fireworks. One of those truly memorable, priceless family moments we were glad to be able to give our kids.", "title": "Best View", "user": "PJandLindyLu", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 136994803}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Our room was lovely, the staff very friendly (gladly extended my checkout by an hour), and the rest of the hotel very nice, including a Starbucks in the hotel lobby. Only downside is that the fitness center is small and sub-standard--4 exercise machines, an all-in-one weight machine and some free weights. But I was in too good a mood after waking up to a sunrise over the falls to let that bother me.", "title": "Great view of the Falls and away from the bustle", "user": "TheTravelingCs", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136969253}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Book 2 nights from hotwire-which sometimes but not always saves you alot of money. Its is how ever always no refunds or changes so be sure of the days you want to go. I got a great deal after checking for a few weeks. Check in to the hotel at a little after 2pm, was fast and easy however was told for $40 more I could have a falls view room on a higher floor. I had to ask, is it $40 total or $40 a night ? Its $40 a night, said no thanks was spending enough in the falls. Well I was to get a room with 2 queen beds but was then offer a king falls view room for free-very nice but I do like the 2 queen beds-this way I have 1 bed to just sleep in and the other for watching TV or laying around after just coming in without cleaning up and what ever else I like. Well I ask if I could get the same floor room but with the 2 queen beds. She said yes but then was given the 5th floor. I found out a bit later thats the lowest floor with rooms and I could just see the edge of the falls. Well I thought for the price it is nice and only 2 nights so I did not ask for a diff. room. The beds were great, even better than the Toronto Sheraton that I had just left. Shower was great also.", "title": "First time at a Marriott", "helpfulness": 3, "user": "stillsmoking", "date": "June 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7985553, "likes": {"liked": "— The beds", "disliked": "— No parking lot at the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Getting my room clean took all most all day, think it was clean around 4pm, did a nice job but I always keep the room clean in the first place.", "title": "This is a wonderful hotel. Great views, excellent service.", "helpfulness": 2, "user": "BucksCountyGramps", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7974585, "likes": {"liked": "— View, room clealiness, and friendly staff.", "disliked": "— No complaints, it was great. Just expect hight prices everywhere."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Did not eat there-I hear its not worth it so went across the street to Tony Romo's was just fine and fair prices for a tourist area. Theres a Keg steak house near by too.", "title": "Nickel and dimed to DEATH.", "helpfulness": 8, "user": "RomanHans", "date": "June 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7974438}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Parking, well its off the hotel area and you need to let them park it and keep the keys. No thanks, I park at the casino and walk back, it was not the money but not knowing where my car would be and not having the keys to it I did not care for. If I could have seen it park right at the hotel would have been fine but guess I am not in to trusting strangers much. Notice that the Sheraton right across the street has a big parking lot around the hotel. Very nice and will stay there next time.", "title": "A heavenly view of the Falls!", "helpfulness": 4, "user": "bagsalwayspacked", "date": "June 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7968128, "likes": {"liked": "— The location right above the Falls.", "disliked": "— They should not charge for internet service in the rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "For the price I paid-$188 total for 2 nights, was very happy.", "title": "What a great hotel and the view!!!", "helpfulness": 2, "user": "sklin", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7958905, "likes": {"liked": "— view, jacuzzi, fireplace, firework", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I would recommend this hotel to anyone. It is surely a great choice for Niagara Falls.", "title": "Great hotel, wonderful views", "helpfulness": 2, "user": "cjb213", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8085319, "likes": {"liked": "— staff", "disliked": "— item costs"}}, {"rating": 5.0, "title": "Loved this hotel!", "text": "Great hotel with fabulous views of the falls. We upgraded at check-in to a fireplace room on the 21st floor for $50 extra. The fireplace was a joke as it is stuck in the corner. I was expecting a lager room as the clerk indicated that the we were saving $70 over the standard upgrade. The 21st floor view, however, was worth it. We had the $75 dinner voucher and buffet breakfast for two. The dinner cost us an additional $80 for what I would consider an average dinner for two (no alchohol and $155 for dinner???). The breakfast buffet was also average. I would not recommend the deal. Just get a room on a high floor and find your own food. Although we didn't watch much TV the reception was poor.", "helpfulness": 1, "user": "MrsOdie", "date": "July 8, 2007", "id": 8078428}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had a 17th Floor Falls View room with fireplace and spa bath and could not fault this hotel. From the moment we pulled up in the entrance foyer and the parking valet (CAD$20 per day) took our car away until the moment he delivered it back to us 2 days later we had a fantastic experience here. The room was large and beautifully presented with a huge bathroom and separate toilet and shower room off it. The spa bath was double size and had windows alongside so that you could look into the bedroom. However the most remarkable thing about the room is the view of the falls from the window. The hotel is no more than 200 yards from the Horseshoe Falls and we were mesmerized by them. You could not help but stare at them whenever you re-entered the room.", "title": "Amazing view", "helpfulness": 4, "user": "Tam Carr", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8239693, "likes": {"liked": "— The view", "disliked": "— Bar prices"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Other comments on the hotel are the prices in the lobby bar. CAD$30 for 2 glasses of wine we thought was excessive.", "title": "Impressive Views", "helpfulness": 3, "user": "Berkut", "date": "July 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8237548, "likes": {"liked": "— The Views of the Canadian Falls", "disliked": "— Pricey Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Eating outlets are not hard to find although most are of the chain variety and not particularly to our taste. We did find a Wlofgang Puck outlet though which we would recommend.", "title": "Great hotel!!", "helpfulness": 2, "user": "wmegowan", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8230467, "likes": {"liked": "— the view from our room and they let us check in at 8am because our room was ready, even though we thought we would just check in our bags", "disliked": "— the ridiculous price for items in the guest basket in our room (like $5 for a mini can of pringles)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Nothing is too far away in Niagara Falls and we would definitely recommend this hotel to anyone wanting the best view of the Falls we could imagine.", "title": "Fab views, great spa!", "helpfulness": 2, "user": "Neurogirl", "date": "July 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8229927, "likes": {"liked": "— The location and view of Niagara Falls.", "disliked": "— Too pricey, but par for this area."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here by using credit card points. I thought the hotel was great. Our room was very clean, and the staff was courteous and professional. We didn't take advantage of many of the amenities, but the tourist guides/concierge services were helpful.", "title": "Couldn't ask for anything more!", "helpfulness": 4, "user": "michellefromontario", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 8128598, "likes": {"liked": "— the views", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We just came back from the 1-night-getaway package for my birthday and it was very nice. With the weather not being so great , there was added traffic within the hotel, therefore added pressure for the hotel employees to be on their game, and I think they did a good job. Service downstairs (valet, front desk and Starbucks!) was very courteous and efficient. Restaurant, spa and housekeeping staff were very accommodating and welcoming. Our room was a clean, Fallsview king bed with fireplace and whirlpool, and definitely had an uncontested view of the falls. It was just like the photos posted on the hotel booking website. It was nice to utilize the fireplace and whirlpool. The only disappointment was the additional cost for internet access($10 for 24 hrs). The hotel overall is very well kept and clean in all the areas we went to- we even checked out the arcade for a quick game of gitz and good old calfornia cruisin'. I am very pleased with our stay at the Marriott Fallsview Hotel and Spa this weekend- it was exactly the low-key, relaxing and enjoyable weekend I was looking for.", "title": "Nice getaway from not too far away", "user": "Freedom2010Toronto", "date": "March 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58562970}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed at the 18 th floor in this property .", "title": "An hotel with an great View", "helpfulness": 1, "user": "Karthic", "date": "March 11, 2010", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "rooms": 5.0}, "id": 58300461}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Had an wonderful view of the falls .", "title": "Will go back for sure", "user": "nate51", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 58092757}, {"rating": 3.0, "title": "Underwhelmed", "text": "Food was great .", "user": "geedee7", "date": "March 8, 2010", "id": 58001260}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The room had an view of the fireworks also .", "title": "Enjoyed it", "user": "mirrabooka", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57841704}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Just wanted to let readers know, if they are reading older reviews on this site about the Marriott and hoping to take advantage of the free parking at the nearby Fallsview Casino garage using a Players Card, this policy will discontinue on July 1 and after that you will be required to swipe your Players Card in the garage so they can see whether you merit free parking. It did work for us however and I'd like to thank all the people who suggested doing so. We had a deluxe room on the 22nd floor and the view was FABULOUS. Room was large and beds comfy, staff was very nice, overall we had a wonderful experience and I would recommend this hotel to anyone. We booked using the 2 night package and used our $75 dining credit for room service, you get more food choices that way and the prices are a little better. You will still be chaged a 20% fee and you should also tip. For us, two nice sandwiches and fries cost us $13 tax and fee total, we didn't think that was bad at all. Be sure to get a room on a high floor. SO BEAUTIFUL!", "title": "No Free Parking at Fallsview Casino after July 1", "helpfulness": 3, "user": "ALRRM", "date": "June 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7942977, "likes": {"liked": "— the amazing view", "disliked": "— $20 per night to park with no in and out"}}, {"rating": 4.0, "title": "Good place to stay", "text": "We stayed at the Marriott the middle of June. Very nice hotel: clean rooms, good service, comfy beds, quiet at night. The location is right at the Canadian falls. Loved the view we had. We had the package with 2 breakfasts, $75 voucher for dinner. The breakfast was a nice buffet, nothing spectacular, but we like to eat breakfast at the hotels we stay at and not search for a place in the morning. Restaurant for dinner was very expensive, even with the voucher we paid extra, but I guess it depends on how big an eater you are. The food was good, so I'd recommend as a special treat. The in-room safe is a very nice extra. The bathroom had lots of counter space which is a plus. We did not rent a car and walked everywhere. If you don't want to walk the buses stop nearby. Only thing I didn't like was that the pool was not clean enough. I know it must be hard to keep the area clean, but the smaller of the two jacuzzis was dirty and some debris around the pool tile area.", "helpfulness": 2, "user": "heidi123", "date": "June 18, 2007", "id": 7927036}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Overall though, I would highly recommend the Marriott Fallsview!", "title": "Decent Hotel- not as good as expected", "helpfulness": 1, "user": "simmie17", "date": "June 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 7873273, "likes": {"liked": "— restaurant and room service", "disliked": "— front desk- air conditioning did not work"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "arrived at this hotel after an exhausting 7 hr ride. Valet for check in was fine. However, young girl at front desk was not too pleasant. Had booked a Canadian falls view room. Room was on high floor next to some kind of outside vent that blocked a little of the view. Bathroom was huge. Went to dinner in hotel restaurant- very expensive but very good food. Waiter was exceptional as was host staff. However, on return to room air was not working properly. Called and maintenance came and said it was fixed, but it was not. I was too exhausted to call and request another room. Next day used the spa- very good but the room was stifling hot and we checked out early after room service. Again, waiter was very pleasant. I mentioned lack of air conditioning to lobby concierge as we left and he really did not care. This is a lovely hotel, but just short of a 4 star facility. If I returned to area, would try the Doubletree- saw its location a few blocks away- or the Renaissance. We also visited Niagara on the Lake- really charming small town, though did not have time for the Shaw Festival. Suggest checking out the wineries though.", "title": "The view is worth ten times the money!", "helpfulness": 7, "user": "LiztheWhizz", "date": "June 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7848039, "likes": {"liked": "— The View", "disliked": "— The crowded lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We stayed at the Marriott Niagara Falls Fallsview Hotel for 2 nights as part of a two week holiday in Canada/USA in early June.", "title": "Great Value", "helpfulness": 6, "user": "Penstar", "date": "June 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7834345, "likes": {"liked": "— The view, the beds and the fireplace", "disliked": "— The prices at the restaurant"}}], "location": {"country": "Canada", "city": "Niagara Falls"}, "stars": 4, "variance": {"poor": 99, "average": 235, "very good": 1040, "terrible": 72, "excellent": 1498}, "aka": "Marriott Niagara Falls Fallsview Hotel", "slim_ranking": 0.0144927536232, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Marriott Fallsview Niagara Falls Hotel & Spa has the enviable distinction as being the closest hotel to Niagara Falls. As the area's premiere AAA Four Diamond, five-star luxury hotel in Niagara Falls, this Marriott Niagara Falls Hotel overlooks the majestic waterfalls and is located just minutes away from a variety of exciting attractions and casinos, as well as the Scotiabank Convention Centre."}