{"user_rating": 3.5, "review_count": 655, "name": "Marriott Savannah Riverfront", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I stayed here for my entire trip in Savannah, GA. I wanted a riverfront view (which they can guarantee) and a balcony (which they cannot guarantee). They gave me the consierge room for no additional charge this way I can get both. FYI - consierge floor is $15 more. They have limited food during a specific time frame for breakfast, snack, dinner and desert. This is only available to people who stay in the room. Everyone was very nice! Hotel was clean. Indoor and outdoor pool. Bar in the lobby is only open until 10pm. The bar in the restaurant in open later. Not sure how much later. The restaurant is good and not expensive. Great breakfast buffet. You can walk to River Street which is great. Other hotels are in the middle of the city and it doesn't look like they have a place for you to sit outside and relax.", "title": "Best choice!", "helpfulness": 2, "user": "ttrinchi82", "date": "August 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8276689, "likes": {"liked": "— Their willingness to help you get what you want.", "disliked": "— No furniture on the balcony."}}, {"rating": 3.0, "title": "Nice but power failure", "text": "Feel free to ask me about this hotel or Savannah.", "helpfulness": 2, "user": "fairiespixiedust", "date": "June 16, 2007", "id": 7858099}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My family & I stayed here for 3days/2 nights June 14-16 '07. We arrived @ 2:30 & was checked in early. Great so can get ahead start on touring Savannah. We went to our room & the air conditioner wasn't blowing out cool air only warm. We called the front desk & a friendly engineer came up really fast. He fixed the problem & said the motor was not moving. We left to do some sightseeing on the Riverwalk. A nice view & walk to River Street. Make sure you stop and get some pralines at River Street Sweets. They give samples too. We ate the first night at Huey's. It was good. Later that night we took a Ghost Walk Tour thru Savannh Walks. It was @ 9:30 & was very interesting. The guide was very nice & chatted with everyone. Don't know if the stories were true but gave you a chill when he told them. We called it a night. The next day enjoyed breakfast at the hotel (buffet) with a view. We did a lot of walking & saw most of the squares. We finally found the Mercer-Williams house. The tour was interesting. This was the setting of the famous book/movie. We ate later at the Pirates House(haunted). I took a lot of pics inside the diff. rooms. The server told us some stories. I haven't upgraded to a digital cam yet so will have to wait till I develop to see if anything shows up. Got back to the hotel @4:00 & the power went out for 1.5 hours. They had problems with generators. I was told this had happened previously. We were stuck up on the 7th. floor waiting for someone to tell us what was going on. The phones didn't work while the power was out. I had to use my cell phone to call 800 # customer care. They couldn't get thru to the hotel either. It was frustrating. When the power came back on the elevators were acting weird. It was a bad night.", "title": "Wonderful", "helpfulness": 1, "user": "team_fletch", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7837275, "likes": {"liked": "— The whole experiance", "disliked": "— The valet parking"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "They took off my parking fees for the entire stay. After the experience we had I would still stay here again. It was quiet & clean. The walk to River Street was short. We saw a family of otters in the river and enjoyed the view.", "title": "Excellent Again!", "helpfulness": 3, "user": "RoswellDad", "date": "June 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7818933, "likes": {"liked": "— Room, location, staff", "disliked": "— Pillows too small and too soft"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel is very well located. . The hotel itself is very attractive, and the river walk on a Sunday morning...well..you have to experience it yourself!The room was big, well appointed, and clean!", "title": "Don't Stay Here", "helpfulness": 2, "user": "sgill30", "date": "May 30, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "value": 3.0, "service": 3.0, "business": 1.0}, "id": 7720905}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I stayed 3 nights at a conference. The hotel is a little removed from the center of town but in easy walking distance. However, the halls smelled moldy and my room smelled very damp. Housekeeping threw out my medication, only styrofoam cups are provided for coffee in the room, space for the mini bar was empty, there was no remote for the TV, and I was double charged for parking. Each day there were about 3 toilets in the lobby women's room that were completely out of toilet paper. There were two conventions in the hotel so these bathrooms were used heavily. A minor annoyance is that the hotel has a contract with Pepsi so only Pepsi products are offered. A gin and tonic cost me $12.00 ($14 with tip). The staff was very friendly at all times and the hotel has a great view of the river. Next time, though, I'll look for another hotel.", "title": "Disappointing", "helpfulness": 1, "user": "seeone", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20616354}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Enjoyed our stay at the Marriott Riverfront, no real issues. A little removed from the downtown, restored areas but that's easily overcome with the river walk back and forth to the Hotel. The riverfront rooms offer a terrific view of the Savannah River and all the activity taking place on the River. Suggest high-level, riverfront rooms, if at all possible.", "title": "Enjoyed Our Stay!!!", "user": "andyMassachusetts", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20407991, "likes": {"liked": "— Quality of the room itself and the amenities", "disliked": "— Can't really identify anything specific"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at the Marriott on two separate nights (Sep 18 and Sep 21) during a recent getaway to Savannah/Dafuskie Island. The hotel was very nice, with a great location right at the end of River Street. It worked out well for us because the Dafuskie Island Ferry was a short walk from the hotel so we did not need a cab to get to the Ferry.", "title": "Nice Hotel, Good Location", "helpfulness": 1, "user": "BK_Travel_Virginia", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20307533, "likes": {"liked": "— Location", "disliked": "— Rooms were a bit bland"}}, {"rating": 3.0, "title": "nice hotel", "text": "We had similar rooms for both nights, on the 5th and 6th floors with balconies overlooking the river. The rooms were very nice, nothing super fancy, but comfortable beds, nice bathrooms, quite and good climate control.", "user": "dvnyc", "date": "August 13, 2008", "id": 18921743}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We did not eat at the hotel, but recommend the following local places we did eat at:", "title": "friendlyest staff in savannah", "helpfulness": 1, "user": "thirty8ginger", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18625232, "likes": {"liked": "— The view, the Marriott beds, the staff, the location", "disliked": "— everything was great"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Wow, there were some negative reviews?! . . . I am not having that experience at all (writing on my 2nd of 3rd nites here on a business conference trip).", "title": "Olde Towne Savannah - Marriott style", "helpfulness": 2, "user": "Marriott_Devotee", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16683930, "likes": {"liked": "— Location -- not too close, but very convenient for parking, driving, walking, etc.", "disliked": "— That the conference wasn't held here!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": ".", "title": "One of the worst Marriotts", "user": "nickatgt", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 15624498, "likes": {"liked": "— Room, Hotel Service, Decor"}}, {"rating": 3.0, "title": "Not Perfect", "text": "At the end of Bay St. and River Walk 1/2 mile from the absolute center of the historic district (not too close; not too far) sits a typical, comfortable, well appointed full-service Marriott. Even though the conference I was/am attending was at the Hyatt, I chose to stay here, since, well I am devoted . . . and the rate was competitive (when my company or client pays for the room, I make sure they/we get a fair deal).", "user": "kssjenni", "date": "May 3, 2008", "id": 15617480}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": ".", "title": "Could not wait to say goodbye.", "user": "cactuscromwell", "date": "April 23, 2008", "detail_rating": {"front_desk": 2.0, "value": 1.0, "service": 1.0, "business": 3.0, "location": 2.0}, "id": 15281477, "likes": {"liked": "— Nothing", "disliked": "— Not clean"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Staff seemed terrific. Doormen on the parking deck connected me with the city busses. Housekeeping did NOT pick up $7 (I intended to leave $3) for a first nite's tip) even though the money was left out and she could have . . . I gave her $5 in the evening. . . . Concierge helped me over the phone before I arrived Front of House Manager made a special arrangement which was in order when I checked in.", "title": "Ok but expensive", "helpfulness": 2, "user": "DivaJuls21", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 15052831}, {"rating": 2.0, "stay_parameters": "Stayed November 2008", "text": "Despite the efforts of the bell stand and front desk, the Savannah Marriott is overdue for an update. The employees we encountered were very professional and accomodating.", "title": "Staff can't make up for a hotel stuck in the 90s", "user": "Bill L", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 22132439}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "However, the hotel management needs to rethink their policies. We were nickeled and dime throughout the stay. I felt $15 for overnight self-parking was excessive. Add on to that $10 for Internet and $2 for a weak cup of coffee.", "title": "OK", "user": "akstravel", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 21035491}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The public areas of the hotel were tired and cold. In addition, the pillows were the worst I've encountered in a long-time. I am a frequent business traveler and Marriott is my default chain. However, I would not stay at this hotel again. There are too many other options in Savannah to put up with a hotel that is stuck in the '90s.", "title": "The Staff makes it worth staying", "user": "MMtravelers", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 20991091, "likes": {"liked": "— The wonderful Staff", "disliked": "— leaking roof"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Front desk staff was wonderful.", "title": "Not typical Marriott quality", "user": "kwilger", "date": "October 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 20850153, "likes": {"liked": "— waterfront location", "disliked": "— room comfort, friendliness of front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The rest of the hotel was just ok. Could use some paint and TLC.", "title": "Great location, good value", "user": "WanderingCarolinian", "date": "October 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20765565, "likes": {"liked": "— Location, location, location.", "disliked": "— Rooms are pricey in season."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed two nights on points and the hotel was very nice. Lobby was nice if unexciting and the our room was large and in excellent shape. As at most Marriots the bed and linens were top notch. The bathroom and shower were clean and spacious with a nice shower head. Yes, the chlorine smell in the lobby is noticeable but understandable since the pool is in the atrium, but it really wasn't a problem. If you want a quaint Savannah hotel this isn't the place for you, but I was happy we stayed there after the bed and breakfast we were originally going to book showed up on our ghost tour! While the location at the end of Riverfront was not quite in the thick of things, it was a easy 5 minute walk to shopping, restaurants and bars, not a big deal at all. We ate at the Blue restaruant on the property for breakfast twice. The first morning it was fantastic (I recommend the blueberry pancakes) but the second morning my husband had to send back his eggs and hashbrowns. Other than that small issue, we would absolutely recommend this hotel.", "title": "Very nice hotel, we'd stay there again.", "user": "kb1601", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17503360}, {"rating": 2.0, "title": "Not my favorite place to stay in Savannah", "text": "The kids and I tagged along with my husband on a quick weekend business trip to Savannah. His meeting was at the Marriott Riverfront so we stayed there, along with all the other conference attendees.", "user": "JRLCW", "date": "June 24, 2008", "id": 17170793}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "On previous trips to Savannah, we have always stayed at B & B's or small inns, so the Marriott was somewhat of a disappointment. Not much in the charm department, but I guess we knew that upfront. Still, it was within easy walking distance of the rest of the historic downtown area and is (as the name suggests!) right on the river. We watched fireworks from the deck outside the lobby. And our kids liked the indoor pool, even though it was a little weird being right in the middle of the lobby. We arrived late in the evening, so decided to have breakfast at the hotel the next morning -- that was mistake! Although we had a nice view of the river, neither the food nor the service was very good.", "title": "Hotel Nice, Rooms Average", "user": "poulsbo99", "date": "June 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 16908141, "likes": {"liked": "— The pool", "disliked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Unless you are in Savannah for business or for some other reason need a conference-type hotel, I'd opt for one of the smaller places sprinkled throughout the historic area.", "title": "Enjoyed the Marriott", "user": "JRD33141", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 16853934, "likes": {"liked": "— The room was great and the Staff was very helpful", "disliked": "— The room"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel is nice and if the rooms were upgraded then I would recommend it. Even though we were on the 8th/top floor concierge level, the room we had was worn. From an old door and loose doorknob for the bathroom to older carpet and dirty windows, the room wasn't up to my usual Marriott experience. The bed and linens were very good but we had them deliver a fold out bed and the pillow that came with it smelled horrible.", "title": "No atmosphere", "user": "Sophie2604", "date": "June 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 16768069, "likes": {"liked": "— Used Marriott Points", "disliked": "— Location and pool"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Our stay was wonderful. When we entered the hotel, every single staff person we encountered greeted us with a warm welcome. We booked two rooms, one was on the first floor and the second was on the fourth(both riverview). I stayed on the first and the room was great. The furnishings(including the carpet) all looked new. We slept on the most comfortable bed I've ever slept on. The bathroom was spotless. The a/c is controlled with a thermostat and was completely quiet. There was a small refrigerator in the room. I didn't see the fourth floor room, but my friends said they had a balcony but no refrigerator. They had the same opinion on how comfortable the beds were.", "title": "Loved it!", "helpfulness": 7, "user": "AB31", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5812553, "likes": {"liked": "— Friendly staff, the beds, cleanliness, and the quietness of the a/c", "disliked": "— The location of the pool."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "It's approximately a 5 to 10 minute walk to River walk. A very pleasant walk along the riverfront. The walkway is paved and lighted.", "title": "One night but will return", "helpfulness": 4, "user": "ntaylor2", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5615179}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I have been to Savannah several times. This was my first stay at the Marriot Riverfront. I have stayed at the Hyatt and the Desoto Hilton and both were nice. However, my overall experience was so good at the Marriot that I will stay there on my next visit.", "title": "You have got to be happy here.", "helpfulness": 7, "user": "GoFigure1", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5579588, "likes": {"liked": "— Close to everything", "disliked": "— Pool location in hotel."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "We traveled through Savannah two different times during a vacation and stayed the first time at the Courtyard- it was ok- but decided on the spur of the moment to try the Marriott Riverside. Yes it is a little outdated but the service and rooms were superior compared to all the hotels I have stayed at this summer which is a total of seven in the last four weeks. I slept better this one night than I did in my whole summer travels. The beds were so comfortable and rooms are peaceful and cool. Staff is very pleasant and accomodating. We had two children with us and they agreed. We will definately go back to Savannah and stay with the Marriott. Took the carriage tour located in CityMarket. It was fun!", "title": "So So", "helpfulness": 4, "user": "Lisa18", "date": "July 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 5480549}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "This is a great hotel with a great location for visiting Savannah. The hotel is located at the beginning of the river walk with access right out the door. We had a river view and it was beautiful. Make sure you ask for a balcony if you book the river view because not all river rooms have the balcony. I don't know why someone would have a problem with the AC in this hotel because we stayed there on the hottest days of the year and the room was cold. Also the AC is very quiet the quietest I have ever experienced in A hotel. I am sure that if there was a problem the hotel would have changed rooms. The staff here was fabulous and the rooms were spotless. The river tour boat docked right outside the hotel and the tour trolley spots right in front. The only thing I found strange about the design of this hotel was the location of the 2 pools. The indoor was placed next to the river view dinning room and the outside pool was stuck in the corner of the parking lot on the back side of the hotel. Although it was strange the water was great!", "title": "Watch for charges", "helpfulness": 2, "user": "McDonald's", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5437525}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I stayed here for a conference last week and I had some good experiences and some not-so-good ones.", "title": "Good overall, but...", "helpfulness": 4, "user": "jvteach77", "date": "March 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 7010616, "likes": {"liked": "— Location", "disliked": "— extra fees for parking and internet"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The good....My 2nd room was clean, comfortable, and cool. The front desk staff were excellent and helpful. The business center was never busy when I wanted to use it. The hot tub was good the 1st day I was there.", "title": "Solid Business Hotel", "helpfulness": 3, "user": "Crookedridges", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6849541}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The bad....My 1st room had an AC that wasn't working and there was still soap particals from the previous user in the bathtub. The hottub was about room temp the 2nd day and didn't get any hotter when I asked the front desk about it and checked it again 2 hours later. Internet was $10 per 24 hours. $12/day to SELF park?!", "title": "Enjoyed our stay", "helpfulness": 3, "user": "By_His_Grace", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6836256, "likes": {"liked": "— Friendly staff", "disliked": "— Price for the Internet connection"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "Overall.....A good hotel and friendly staff, but I would have expected free internet for $200+/night. Also, I would have expected the hottub to work. $12 a day to self park vs $15 for valet also seems a bit much. The location is good, if you want to be near river street and on the water.", "title": "Excellent rooms - a bit off main street", "helpfulness": 5, "user": "cruzca", "date": "December 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6521509}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "This is your typical Marriott...no surprises.....good clean room, good for business, excellent location on the river.", "title": "It was great in the 80s!", "helpfulness": 5, "user": "JWAIII", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6022674, "likes": {"liked": "— The staff.", "disliked": "— The old dated look."}}, {"rating": 2.0, "title": "Not All That and a Bag of Chips", "text": "While Savannah is very beautiful and filled with history and southern charm, enjoying this city is only possible with the resources/tools provided by the city itself.", "helpfulness": 2, "user": "LascassasBelle", "date": "May 29, 2007", "id": 7713113}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Riverfront Marriott, in my opinion, a very nice place in a good location. However, I found the \"extras\" (parking shouldn't be an extra) to be pricey. With it's very own garage I felt the fee for parking ($12 daily) resembled a scam. This fee applied even if you drove to Tybee Island and spent the day at the beach wherein you payed another parking fee (I think I'm seeing a pattern here). I must add though, the parking fees were waved by the Marriott after my complaining of a very loud neighbor in the room next to ours.", "title": "An exceptional experience!", "helpfulness": 2, "user": "OldGoldyandLilEmma", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7707951, "likes": {"liked": "— The room and hotel were great, but the staff made it even better! Great team!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We also ate at the famous The Lady and Sons establishment. Very good food, but an extravagant price for a simple buffet. Standing on the street in line to sign a waiting list? The final kicker however was the multi-legged (six) critter that wanted my desert. I calmly and politly notified my server who helped me dispose of the creature with my own napkin. He thanked me for not making a scene, I mean come on, the building is old and these kinds of pests are very hard to irradicate, but not even a simple apology from management?", "title": "Watch out for the charges", "helpfulness": 1, "user": "dachshundgirl", "date": "May 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 7567304, "likes": {"liked": "— The bed was heavenly.", "disliked": "— Secret charges on my debit card."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We enjoyed many of the shopping venues available, but simply put, a souvenir shop is a souvenir shop with most everything made somewhere else (cheaply at that). When my friend picked up an elastic beaded bracelet, the elastic either broke or became untied which resulted in the beads going everywhere. The clerk very politely charged my friend for the bracelet because of the \"you break it you pay for it\" policy. Come on, it was cheap and defective to boot.", "title": "Nice hotel but a little far for walking", "helpfulness": 1, "user": "unc-law", "date": "April 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 7341394, "likes": {"liked": "— Quality", "disliked": "— Location - Distance from historic district attractions"}}, {"rating": 4.0, "title": "Very Nice", "text": "In summary, a very beautiful place that gives southern hospitality a bad rap.", "helpfulness": 4, "user": "knisely", "date": "March 22, 2007", "id": 7203024}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 63, "average": 130, "very good": 242, "terrible": 33, "excellent": 187}, "aka": "Marriott Savannah Riverfront Hotel", "slim_ranking": 0.446428571429, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "An imposing hotel overlooking the river."}