{"user_rating": 4.0, "review_count": 346, "name": "Marriott Cleveland Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stay here about 4 times a year and the service is consistently superior to my experiences with other locations. Friendly and responsive to any and all requests. I like the design of the lobby with the restaurant incorporated into it. Rooms are standard Marriott fare, no surprises. The staff is exceptional.", "title": "Great Service Every Time !", "user": "Wilda", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120781072}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Not a bad place for a quick business trip - I had one with PPG, which is close by. Big foyer with the right ambience. The restaurant/bar was part of the foyer, so you didn't feel isolated from the foyer and could people watch, if you desired. Rooms are average for the Marriott chain. Great workout room and heated indoor pool.", "title": "Great hotel for the price", "helpfulness": 1, "user": "Vahndulife", "date": "November 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120738025}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The hotel is an average Marriott in the \"old style\" of architecture and room layout. It is a nice hotel but nothing special. One thing makes it less than even average though - the 9th floor is horrible. As a very frequent Marriott guest I usually get a room on the club level - but will not accept it if I stay here again. The constant slamming of the club lounge door is jarring. There is no escape from it, the club is situated in the middle of the floor.", "title": "Don't stay on the 9th floor - even if you are elite", "helpfulness": 1, "user": "Bradley A", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 120643775}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This is one of few Marriotts I've stayed at where the lounge access is so poorly thought out. As the only worthwhile (non-points) amenity of Marriott status I think this makes this hotel a poor choice.", "title": "Very good but not exceptional", "user": "Finder10", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120401144}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "If you want a comfortable, clean, reasonably priced and convenient hotel, this is it. That said, the bathroom sink/countertop was small, the only towel racks were in the shower, there was no phone book or hotel services directory and the bar was essentially part of the lobby and noisy. The breakfast buffet was great.", "title": "Good hotel. Great people", "user": "Lronn H", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 120354722}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I read reviews on The restaurant at this Marriott and they were right on. The dinner was oustanding at a great price. The servers in the restaurant were great. Hotel was updated and in good condition for a fair price. Lobby had things to do and places to plug in if you wanted to take advantage of the free wi-fi in the lobby.", "title": "Great Airport Hotel!", "user": "Lisa_CrystalLake_IL", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120014618}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is our new favorite hotel in Cleveland. It's not downtown, but this is a great hotel if you don't need to be downtown. No parking fees, wonderful bar and restaurant, and great rooms. The rooms are big with a small refrigerator and the beds are super comfortable. We were on the 8th floor which is one of their secure floors, and it was very quiet. There were tons on kids in the pool, so if that will bother you, I guess this could be an issue. My only complaint, the bathroom counter space was very limited. This hotel is a great deal.", "title": "Favorite in Cleveland", "user": "Rocketfire", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119759050}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Great beds, nice sized rooms-of all the Marriotts we've ever stayed at globally this is one of 2 that has had our room set up as we requested. Concierge was also extremely service oriented. First time the attendant was kind, friendly and consumer centric. This hotel is stellar among many.", "title": "One of the better Marriotts we've stayed at-only one where our room contained everything we request in our profile!!", "helpfulness": 1, "user": "BotRoad", "date": "October 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119736434}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This Marriott surprised me. Most airport hotels are outdated and not appealing. Thishotel was remodeled and very nice. We picked this because we got free parking and free shuttle to the airport, which saved us alot of time and money. Only drawback for me were the noisy pocket doors in the bathrooms which are very small. Other than that worth the money, but make sure tht the free parking is n your rate.", "title": "Nice hotel easy access to airport", "user": "ohiorona", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119584679}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I used to enjoy my stay at this hotel. But one weekend changed that. The hotel was full of childrens soccer teams. That was the good part, the bad part was most children were running around with no adults in site. The parents were either in the bar or outside between the building having a beerfest. Noise from both went on until the early morning hours. No management of security to quiet and children and sober up the adults. Two seperate times employess stated that there were car breakins on a regular basis and to \"park by your room\" was suggested. Maybe after I get over this I will try the hotel again. The ironic twist was my former wife made the reservations for my staying there with my new girlfriend.", "title": "Drunk parents and wild children", "helpfulness": 1, "user": "Nick M", "date": "October 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 119202634}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Outside looks like a typical early '80s marriott, once inside, you'll never know. Everyone was very friendly and the everything is very current inside. I don't know what the true Cleveland vibe is, but AMP lounge deffinately has one. Food was very good and well excuted. The beer menu is massive. There's a Denny's next door for the discrimiative eater, but for the time I was there, well worth it. Close to the airport and close the the RTA station. No a fan of Ohio, but don't mind the Marriott.", "title": "For Cleveland and near the airport, hard to beat", "user": "shttrdrvr", "date": "October 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119104612}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "1st stay was very good. They really seemed busy that week but I was fairly well satisfied as my room was in a good location in the tower and very nice. The only thing I wasn't pleased with was I needed a late checkout and they didn't come through to meet my needs.", "title": "A busy place with different experiences during 2 separate stays.", "helpfulness": 1, "user": "Freqtraveler58", "date": "September 28, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118717355}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "2nd stay wasn't so hot. This Marriott is really spread out and my room couldn't have been farther from everything they had to offer as it was on the back side of their garden area. My room was basically the same but smaller and more cramped feeling. They said they were really busy when I checked in but I didn't see that as the main back parking lot was nearly empty each evening compared to the week before.", "title": "A very nice Marriott", "user": "lovemytanner", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118564347}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Will I go back---most likely if I need to stay in that area again. BTW, the beds were very comfortable which is always worth value points with me.", "title": "Okay Marriott", "helpfulness": 1, "user": "Travel159549", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 118285917}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We stayed here because we had an early flight back to Tampa in the morning and wanted to be close to the airport. The bar was great, the service was wonderful. I wish we hadn't eaten dinner elsewhere. I would have liked to try the restaurant in the hotel. Apparently, they have their own farm out back and grow vegetables. They also try to buy from local farmers. Very clean and comfortable rooms. Shuttle service to the airport worked out great!", "title": "A Nice Surprise", "helpfulness": 1, "user": "CoasterWarrior", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 118006760}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This Marriott was redone a few years ago and has comfy furnishings, especially the beds. We had no trouble falling asleep here. The linens were luxurious. I greatly appreciated the fact that all rooms have refrigerators. Another great feature was the fact that food was available until midnight, both the restaurant and room service, and there was an area in the lobby that sold snacks and drinks 24 hours. Also loved the free transportation to and from the airport. I would definitely stay here again.", "title": "the most comfortable beds", "helpfulness": 4, "user": "janet b", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117556331}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here for one night while on way from NY to Cancun on vacation. The shuttle picked us up promptly after our evening flight. The hotel lobby was lively with a busy bar and people playing pool. Our room was spacious, very clean and everything worked. I heard they spent $$$$ on updating the entire property recently- and it shows.", "title": "Great option for overnight stay between connecting flights.", "user": "Luv2travel1966", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117496824}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The complimentary breakfast was substantial and the service was great!", "title": "Lovely hotel, but...", "helpfulness": 1, "user": "Toton-traveller", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 2.0}, "id": 117475774}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Overall, very good value too!", "title": "Home Sweet ... Away From ... Home", "user": "DollLover60", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117419719}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel has been recently refurbished to a very high standard. The decor is tasteful, but also quite funky and modern. We were given connecting rooms, one with a king, one with two doubles, which was perfect for our party. The rooms were clean, and tastefully furnished.", "title": "beautiful wedding", "user": "Maryann M", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117401154}], "location": {"country": "United States", "city": "Cleveland"}, "stars": 3.5, "variance": {"poor": 17, "average": 34, "very good": 112, "terrible": 10, "excellent": 173}, "aka": "Marriott Cleveland Airport Hotel Cleveland", "slim_ranking": 0.25, "description": "Explore a recently-renovated hotel at Cleveland Airport, which boasts a convenient location, free airport shuttle, and premier accommodations, making it ideal for business or leisure. Featuring over 350 modern guest rooms and suites with flat screen TVs, spacious bathrooms and innovative Plug-in Panels perfect for an invigorating night of rest and relaxation. Socialize with colleagues in the impressive hotel lobby or enjoy the award winning AMP 150, boasting locally grown cuisine in an eclectic environment. Plan spectacular events in 15,500 sq feet of flexible space and host productive functions in one of 24 dynamic meeting rooms. Just a short drive away from downtown Cleveland, visitors can enjoy exciting area attractions, including the IX Center, Rock & Roll Hall of Fame, sports venues and much more. Book your next trip to the Cleveland Airport Marriott, a contemporary hotel near the Cleveland Airport."}