{"user_rating": 4.0, "review_count": 602, "name": "Marriott Resort at Grande Dunes Myrtle Beach", "reviews": [{"rating": 5.0, "title": "Wonderful!!! Relaxing!!", "text": "Beautiful, relaxing, comfortable, wonderful employees! Marriott saved us from a horrible stay at an inn in Charleston. We drove from Charleston to Myrtle Beach to save some of our long weekend and it was so wonderful at the Marriott we went back the following weekend with our son. The rooms are clean, spacious, comfortable and quiet. The pool area is large and relaxing, you don't want to go home. The staff was very pleasant, thoughtful and went out of there way to help. We truly enjoyed our stay and plan to go back for a week.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 3, 2006", "id": 5030431}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stayed for 3 nights during our April vacation and loved every minute of it! The staff was wonderful and the beach was even nicer than Cape Cod. Broadway at the beach was a terrific shopping/eating/entertainment area. We can't wait to go next year. The perfect hotel !", "title": "Best Atlantic beach resort", "helpfulness": 4, "user": "capecodder14", "date": "April 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5012676}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We (2 adults/3 kids) truly enjoyed our stay at this hotel in an oceanview room (side view of ocean on the 15th -top floor, but still beautiful) All of the the staff were friendly and helpful. The rooms were extremely clean, comfortable and beautifully decorated. The pool area was clean and well-kept. There are two outdoor pools (unheated) and one indoor pool, two hot tubs and a water slide which my kids enoyed. They also have a nice cafe' where you can order drinks/snacks at the pool. The hammock was a nice treat, too. This hotel has everything that you look for on vacation (and more). Maybe the rooms are small, but generally not a lot of time is spent there anyway. We were at the beach enjoying the ocean, searching for shells, swimming at the pool, exploring Broadway at the Beach, etc. I would highly recommend this hotel. It's worth every penny!", "title": "Immaculate in every way!", "helpfulness": 10, "user": "mms45", "date": "April 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5001481}, {"rating": 5.0, "title": "One word.....perfect!", "text": "I am extremely critical when it comes to hotels, and I have only one word when it comes to the Marriott Grande Dunes.....perfect! My family and I stayed for spring break (April 14th-21st) and had what was probably one of the best vacations ever.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4995435}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "The hotel is absolutely beautiful, and well above our expectations. The pools are immaculate, and were cleaned on a daily basis. The hammocks and padded lounge chairs are also a nice touch, although you may have to get an early start to make sure that you are able to get one!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4991488}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "We stayed at the Marriott in early June 2006 and did not have one single complaint. The room was larger than average with a great view of the ocean. (I didn't even ask for an ocean view) The staff was very courteous and efficient, from the housekeeping crew to the manager, they were all great. The hotel location is spectacular - right on the ocean in a more quiet area of Myrtle Beach. The pool area includes a water slide for the kids, hammocks, plenty of lounge chairs, and a great poolside cafe and snack bar. There is also an indoor pool in case of bad weather.", "title": "Awesome Hotel", "helpfulness": 14, "user": "cupcake3439", "date": "June 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5328781}, {"rating": 5.0, "title": "The hotel to stay at if you are ever in Myrtle Beach, NC.", "text": "We drove around alot during our stay and this was by far the nicest hotel in Myrtle Beach. WOW!", "helpfulness": 8, "user": "fishfry", "date": "June 3, 2006", "id": 5296251}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I decided to stay at the Marriott Grand Dunes Hotel from February 17-18, 2006 because I was participating in the Myrtle Beach Half-Marathon. I could not have been more pleased with the hotel accommodations. I knew I was in for a special treat when I drove up to the hotel entrance and entered one of the most beautiful hotel lobbies that I had ever seen (I do a lot of traveling and I have stayed at a lot of hotels). The staff was pleasant and professional, and the rooms were large, very nicely furnished and extremely clean. The hotel sits right on the water so be sure to ask for a room with a view of the water. Even if you do not get a room with a water view, the layout of the hotel offers absolutely wonderful water views from the lobby level without you ever having to set foot on the beach. After the half-marathon, many race participants treated themselves to the hotel spa where their aches and pains were massaged away. You definitely will not be disappointed by the Marriott Grand Dunes Hotel. (In case you are wondering why my entry is dated several months after my hotel stay, it is because while writing a review for one of my recent hotel stays, I realized that I was negligent in not writing a review for the Marriott Grand Dunes and several other hotels I stayed at in the last few months.)", "title": "Great way to kick off the summer", "helpfulness": 9, "user": "valuemkt", "date": "June 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5295551}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This place will only get better ! Two of five buildings are complete.. beautiful pools and hot tubs.. VERY short walk to the ocean. next to the hotel if you need a restaurant and a spa treatment. Out of the honky tonk part of myrtle, it's between the pavillion and North myrtle, just two miles or so from restaurant row and the Rt 22 bypass. Typical two bedroom marriott suite .. everything sparkling clean, large master bedroom, spacious balcony. Like most of the Marriott spots, there's no night life onsite, but plenty to do if you;re so inclined in the Myrtle area. Otherwise sit back and enjoy the ocean ..", "title": "Smiling Faces, Beautiful Places", "helpfulness": 6, "user": "leondrataylor", "date": "May 29, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5233025}, {"rating": 5.0, "title": "Best on the beach", "text": "First off, the location is great and it is the best hotel on myrtle beach. We spent Memorial weekend at the resort but we could have used a few more days. The rooms are an average size and unless you get an oceanfront room you won't be guaranteed a balcony. The pool area is nice with a water slide and hammocks. I like the fact the business center offers free internet service. We drove an hour and a half to Charleston on 17 South and it was worth the drive. If we had another day we would have driven another hour and a half on 17 North to Wilmington. Best of all, the office manager gave us $100 a night off our room rate because the room originally assigned to me was given away. I appreciate the acknowledgment of my gold status which is why I only stay at Marriotts. This hotel is ideal for families because it is in a residential area away from the crowds. Enjoy!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 27, 2006", "id": 5223770}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We had a nice, very comfortable stay at this hotel. It was winter, it was raining, it was dreary, so it was nice having such a nice hotel. Room was very comfortable, not overly large, but had everything we needed. Service was good. They have some very nice public areas. Food in restaurant, both dinner and breakfast, was very good. I'd return!", "title": "Very Nice Hotel", "helpfulness": 4, "user": "wintersummer", "date": "March 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4738641}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We stayed here one night and the hotel was beautiful. And the beds - they were so comfortable we didn't want to get out. Would have loved to use the pools, they were so pretty and clean. Just wrong time of year. This hotel is by far the nicest hotel we have ever stayed at in Myrtle Beach. Would love to go back in the summer.", "title": "Wonderful Hotel!", "helpfulness": 8, "user": "luvmiami", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4566499}, {"rating": 5.0, "title": "We're still talking about this great hotel!", "text": "My husband and I stayed at the Marriott Grande Dunes over Labor Day weekend, and we really loved it. We've been to many beach resorts/hotels, and this one definitely rates as one of the best. I noticed many people added posts here saying this is the best hotel in Myrtle Beach, and I would have to agree, as I checked out alot of them before and during our trip, and was really glad we chose this hotel.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "January 13, 2006", "id": 4351641}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We still talk about the awesome pool and grounds, and the view of the ocean just beyond the pool is pretty spectacular. I have a great picture of it as the screensaver on my computer, so I look at it every day and still wish I was there.", "title": "The Marriott Rescued Us", "helpfulness": 15, "user": "Dalsemer", "date": "November 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4149028}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "We loved the beach, not only because it was so clean with great sand and water temps, but also because it wasn't crowded. That's what's so great about this hotel. You're close enough to join the fun of the area by driving just a few short miles, but far enough away from the crowds when you want to relax.", "title": "Grab a Hammock!", "helpfulness": 12, "user": "BeachBoomer", "date": "November 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4112367}, {"rating": 5.0, "title": "Beautiful & Relaxing", "text": "Of course it didn't hurt that we had great weather either.", "helpfulness": 7, "user": "lynk11", "date": "November 11, 2005", "id": 4105568}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "I'm a very picky hotel person, so when I say it was great, it was great. About 98% of the hotels in Myrtle Beach are terrible. They are smoky, sandy, dirty, moldy, icky, etc. This hotel was very clean. The only drawbacks were that the walls were thin and I could hear people around us opening and slamming drawers. There was also a private party going on down by the pool with a LOUD band that played until 10 pm. Not too bad unless you have two small children who go to bed way before 10. The sheets seemed sandy to me, or maybe they were just a rough texture. There was a pillow top mattress, but it seemed still too firm for my taste. And the 18 pillows on the bed were way too soft. I thought I was going to suffocate when my head would sink into the pillow and touch the hard bed and the rest of the pillow would cover my face. Too much of a contrast. Okay... now on to the positives: There was a mini fridge in the room as well as a safe. When we arrived, they had upgraded our room and already had a crib in it for our baby. Much appreciated since it was late at night. I had only made the reservation about 7 hours before arriving. That's only happened to me at one other Marriott hotel in Orlando. They gave my three year old a stuffed turtle which she promptly named \"Myrtle the Turtle.\" That was very thoughtful of them. The outdoor pools looked awesome, but they were cold. The indoor pool was nice. Parking was free which was a plus for a full service hotel. Turn down service and nightly housekeeping was appreciated. There were hammocks out near the ocean and it was relaxing at night looking up into the star filled sky while listening to the ocean. Room service was just so so.", "title": "Great hotel with lots of positives", "helpfulness": 26, "user": "abbysmom2004", "date": "November 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4090525}, {"rating": 3.0, "title": "Over-rated", "text": "I have to say that this was the nicest hotel that I've ever stayed in in Myrtle Beach. I just hope they can keep it that way!!", "helpfulness": 27, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4051958}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "This hotel is very pretty. All of the public areas at the hotel are the best myrtle beach has to offer. The rooms are small compared to others in Myrtle Beach. The staff is helpful. Parking is a big pain. You must choose from valet parking for $12 per night which takes time when you must leave the hotel, or you can park your car for free in the parking lot and then take the 10 minute walk back to your room. There is no easy way to park your car and if you're in a hurry, then you're out of luck.", "title": "Nicest resort in the area", "helpfulness": 7, "user": "toipoole", "date": "October 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4044113}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The hotel is undergoing construction now and driving in to the hotel is simply ugly. The websites do a nice job of covering up what the place actually looks like. If you're looking for a vacation spot in Myrtle Beach why not stay somewhere with a bigger room than this place. There are plenty of rooms with kitchens and balconies which overlook the ocean elswhere in Myrtle Beach. Even though the hotel is nice, the ocean is the same at every hotel, might as well get a room at another hotel close to the ocean and with a balcony so you can enjoy it. The only rooms with balconies at this hotel are the ocean front rooms. THE OCEAN VIEW ROOMS DO NOT HAVE BALCONIES. Breakfast is good but expensive, seems like it should be included for what you pay to stay there. Internet is also for a fee which is stupid for a nice hotel.", "title": "Lovely Resort", "helpfulness": 8, "user": "FrannyK", "date": "October 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4036856}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "My husband and I visited Myrtle Beach in mid-October and stayed at the Marriott Resort at Grande Dunes. The resort is very nice, and the pool is extremely beautiful.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3944647}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 31, "average": 65, "very good": 173, "terrible": 14, "excellent": 319}, "aka": "Marriott Resort At Grande Dunes Myrtle Beach Hotel Myrtle Beach", "slim_ranking": 0.157657657658, "description": "The hotel is ocean front,located in the upscale Grande Dunes community. Our guests enjoy the many amenities our AAA rated four diamond hotel has to offer! Consider championship golf, tennis,a work out in our fitness room, swim in our indoor or outdoor tropical ocean front pool,visit our on site European spa or relax and enjoy the simple but priceless pleasure of sitting on our pristine beach and soaking up the South Carolina sun."}