{"user_rating": 3.5, "review_count": 215, "name": "Marriott Minneapolis Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Facility was older and I was thankful to only stay 1.5 nights (had a 6:30am flight so I checked out at 4:30am). The bed was not comfortable, and luckily for me, since I travel frequently for work, I was prepared with Clorox wipes and disinfectant spray because the room wasn't very clean. Marriotts are typically better than this. On the plus side, the staff was very friendly and helpful.", "title": "Great Staff but not a typical Marriott", "user": "ZMommy", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 157007014}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I expected a cruddy airport hotel that was small, stinky, outdated with airplane noise in the middle of nothing. What I found was a very large property with meeting and conference rooms, fabulous onsite restaurant (Bistro 79), coffee bar, little sundry store, out of this world great service and very nice rooms. and NO airplane noise that was directly across the street from MOA. I can;t say enough how great it was to spent a few nights there for meetings (OH and the catered meals were AMAZING). I usually hate Marriotts but I LOVED this one!! Only down side was there was no battled water in the room and the in room coffee was yucky. The shuttles ran until midnight too to the mall:) The hotel said they updated 2 years ago but it looked like it had been done last week. Great for couples and business travelers but it might a bit tight for parents with kids in one standard room.", "title": "Exceeded Expectation", "user": "cayennev8", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156519236}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This hotel has issues. In fact, as a loyal Marriott customer who has stayed at many different Marriott hotels at all the different levels of luxury, this is the worst of the bunch. While the staff was super friendly and outstanding, the hotel is in desperate need of renovation. The wear and tear in hallways and elevators is bad. I can accept the fact that it’s an older hotel and the rooms are smaller. What I could not accept is that our room was not very clean—especially the bathroom. The first thing I noticed walking into the bathroom was the dirty top cover behind the toilet. It hadn’t been cleaned in a long time. YUCK! The second thing I noticed was a large toothpaste stain on the counter. Double YUCK! And of course, there were many hairs in the tub and on the floor. That’s just plain gross. The room needed vacuuming. There was dust on the coffee maker. The beds were O.k. but worn so that your body rolled to the middle. Honestly, this hotel is a black eye to the Marriott chain! While it’s great that you can get a free shuttle ride to the very close Mall of America and Airport, I now understand why the nearby Fairfield Inn is so much more expensive. This is my last stay at this hotel.", "title": "Disappointing for a Marriott", "user": "vanclaners", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 155640606}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "This was not a nice hotel. Not really sure what more to say. Constantly disappointed with Marriotts. They just don't seem to care about how nice their hotels are. Seems like punishment every time I have to stay at a Marriott. The people at the hotel were very pleasant, that's all I can say about this hotel.", "title": "A Marriott Courtyard in disguise", "user": "Houston3214", "date": "March 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 154017059}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Near mall of America and the airport, not a bad place to spend the night stranded in Minneapolis or on business. Friendly, chatty bartender and decent food. Otherwise, it's a typical Marriott, which is not a bad thing at all", "title": "Decent Marriott with good location", "user": "ryskalchick", "date": "March 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153955201}, {"rating": 3.0, "title": "Not your normal Marriott", "text": "But a good second. Rooms have been renovated and are smaller then the norm. Heating unit has not turned off since I checked in. Not a good sign. Towels are just okay again they don't have that Marriott feel. Building is not well signed if approaching from the west. Not much in the area unless you are in to malls then you have mall of america across the street. Had to drive a bit to get dinner.", "user": "JCSfoodguy", "date": "February 28, 2013", "id": 153407415}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I actually stayed at this Marriott for for business (3 times) in February. The reason for picking this location is my loyalty to Marriott point, but actually for the convenience and courtesy of the hotel.", "title": "A lot of convenience and courtesy, and the occasional smell", "user": "fastball16", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 153289015}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The hotel is pretty much adjacent to the Mall of America and on the flip side of the airport. Together with the amble parking, this Marriott is very convenient to go between work/airport/dinner. The other strength was how courtesy the staffs were. The front-desk staff crew were very nice and friendly and the morning door-staff offered to start and bring our car up in the sub-zero weather. (They even remove the snow as well). I was also able to utilize the free shuttle between the mall and hotel (and got a custom pickup after 10pm).", "title": "Nice Beds!", "user": "Suzie H", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152981590}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "As a frequently traveler, I was glad to see how efficient the staff were in cleaning the rooms, lobby, and general areas. The concierge/executive lounge were very busy in the mornings and the evenings. My personal highlights were the sausage links and the fruit varieties in the lounge. The on-site restaurant was okay. I wasn't a big fan of the Pappardelle, but was of the Shrimp and Grits. I did wish the other seafood option on the menu wasn't just the Salmon Nicoise salad.", "title": "Couldn't complain", "user": "NolaHal", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152895487}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Staying with a couple colleagues, the one drawback for both our stays was the staleness / odors from the rooms. My rooms were not smelly, but the scent of cleaner did linger. Unfortunately, one of my colleagues had to request a different room due to the smell. Also, rooms on the far west side near the elevators had a very chlorine smell due to the proximity of the pool.", "title": "OK room horrible service", "user": "Lronn H", "date": "February 23, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 152855818}, {"rating": 3.0, "title": "Everything is good except the hotel says \"I'm tired\"", "text": "We stayed at the Marriott before and after our vacation to Costa Rica, so we didn't need much. It pains me to right this because everyone was so friendly and helpful. I'd like to rate this as a 3.75. It's a very big hotel, so it takes a little to get acclimated.", "user": "A TripAdvisor user", "date": "December 26, 2012", "id": 148089581}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "We used reward certificates that I had earned and they even let us park our vehicle for a week and didn't charge us!!! We were upgraded to suites both days.", "title": "Friendly staff & free shuttle to the Mall of America", "user": "Grmabear", "date": "December 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 147402974}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The only negative is that the property needs a little tender loving care. Everything was clean, but it just need some sprucing up.", "title": "Old time service next to the Mall of America", "helpfulness": 1, "user": "Steve M", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146724079}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Stayed here for a conference. The conference rooms were a nice size. Staff were friendly. We had a long walk to our room. The food at the restaurant was good. Used the free shuttle to go to the Mall- drivers were friendly too. Bed was comfy.", "title": "Excellent service", "helpfulness": 1, "user": "Jane11B", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146640394}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The Marriott near the Minneapolis airport and across from the Mall of America is an older property but provides that extra service that is rare for hotels other than the elite 4-5 stars. There are actual doormen (or women) that handle all of your needs as you enter or leave. There is a small cafe/bar right there at the entrance with seating, newspapers, and TV news.", "title": "Service is Top Notch here!!", "user": "maelee23", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145737041}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I was among 60 or so Delta passengers stranded in the middle of the night Minneapolis. The airline booked me a room at this hotel and I ended up being very happy they did.", "title": "Haven for a stranded passenger", "helpfulness": 1, "user": "David J", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152801177}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Here's what impressed me: The shuttle driver and front desk staff were very pleasant and helpful, even though it was close to 1 AM and freezing rain was falling when I arrived The management had called in extra front desk people to help expediently check in the influx of waylaid passengers, and my room was large, well-appointed clean and quiet.", "title": "Strange place, but okay", "user": "MassIS300", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152726319}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I plan to stay here again when in the Twin Cities, although I'm hoping the next time we be a planned stay.", "title": "Clean room, great staff!", "helpfulness": 1, "user": "Ron L", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151827554}, {"rating": 1.0, "title": "Not on Marriot level", "text": "The layout of this hotel is very strange. Many corridors and hallways that wrap around several outdoor courtyard areas. You can tell it is a renovated older facility.", "user": "Snell01", "date": "January 8, 2013", "id": 149152028}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Check-in & front desk", "title": "Great Stay", "helpfulness": 1, "user": "Stimpson", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148910026}], "location": {"country": "United States", "city": "Bloomington"}, "stars": 3.5, "variance": {"poor": 26, "average": 46, "very good": 86, "terrible": 13, "excellent": 44}, "aka": "Marriott Minneapolis Airport Hotel Bloomington", "slim_ranking": 0.710526315789, "description": "Among the top hotels near the Mall of America and the Minneapolis St. Paul International Airport, the Minneapolis Airport Marriott offers complementary shuttle service to both the Airport and the Mall of America. Across the street from IKEA, located off of 494 between 35E & 35W, the Minneapolis Airport Marriott is a great place to stay when visiting the Minnesota Zoo, Valley Fair, downtown Minneapolis or St. Paul. When attending a Vikings or Twins Sporting event in Minneapolis utilize our complementary shuttle service to the Mall of America and catch the Light Rail Transit stop. The Marriott guest rooms with luxurious amenities and high-tech business services make it the perfect destination for business and leisure. For business meetings, social events, or weddings, our hotel's 19,000 square feet of event space can be transformed to your specifications. Enjoy our Courtyard with a gazebo, perfect for outdoor wedding ceremonies or receptions. Discover a new standard for hotels on your next trip to the Twin Cities."}