{"user_rating": 4.5, "review_count": 218, "name": "Marshall Slocum Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I just got back from a pleasure trip to Newport Rhode Island where we stayed at the Marshall Slocum Guest House. We had a wonderful time. The Inn was well appointed, and very comfortable. It was also close to all the attractions and things we wanted to do and see in the area. In addition, the Innkeepers -- Mark and Debbie -- were very friendly and helpful, especially considering a problem that developed with their facility after we made our room and airline reservations, but before we traveled to the area. The innkeepers resolved all our problems with a smile. We were very satisfied with their response.", "title": "Wonderful inn -- with great customer service", "user": "sunspotimages", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 32474295}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We would not hesitate to recommend this facility for anyone who wants to get away and enjoy Newport.", "title": "Relaxing stay, nice accommodations", "user": "EmHersh", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30933872}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Marshall Slocum was the perfect choice for us while we visited Newport for a wedding. Most guests attending this wedding stayed at the Hyatt and had unremarkable service and accommodations. We enjoyed quaint surroundings not too far from the town center and reliably good breakfasts each morning. The hosts were helpful and friendly without being intrusive. We heartily recommend this guest house.", "title": "Best Place to Stay in Newport", "user": "jmhinckley01", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28384777}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We recently stayed at the Marshall Slocum Inn in Newport, RI. The Inn is located on Kay Street in a beautiful, quiet neighborhood just outside of the downtown area, in easy walking distance to all of Newport's attractions. We stayed in the Captains Quarters', which was beautiful and comfortable, with a nice Jacuzzi whirlpool tub in the bathroom, which sure came in handy after walking the entire Cliff Walk the first day there. The owners, Mark and Dana, were the nicest people and were genuinely concerned with us having a great time while we were there, whether recommending a \"local\" restaurant outside of the tourist area or helping us plan what we wanted to see for the day. Mark is also a gourmet chef, and the breakfasts that he cooked in the morning were a highlight of our day. I would certainly recommend the Inn and Mark and Dana to anyone looking to have a great vacation in Newport, whether looking to spend a nice weekend getaway, or for a relaxing week. Great time at a great place !", "title": "Great time!", "user": "SashaCT", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27474692}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed at Marshall Slocum for two nights (Friday and Saturday), for a very reasonable price of $ 125 a night.", "title": "Loved It!!!... Will be back!!!", "user": "dct2244", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21430978, "likes": {"liked": "— The service!", "disliked": "— That Monday came!!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed at the Marshall Slocum Guest House during our road trip to Cape Cod and Rhode Island. We usually fill our days with too much to do, and that was the case even this time. After driving from Cape Cod to Newport quite late in the evening, and with rain pouring down, arriving at the Marshall Slocum Guest House felt like coming home to a good friend.", "title": "A highlight of our trip", "helpfulness": 1, "user": "dsilfvas", "date": "August 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37856661}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The house was warm and welcoming, and the Bostonian room we'd reserved exceeded our expectations by far. The bed was good and the bathroom was great.", "title": "Romantic Mini Honey-Moon -", "helpfulness": 2, "user": "bri01605", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37379253}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The breakfast was also very good and Mark, the innkeeper, was very friendly.", "title": "Great 4 days at Slocum", "user": "3MinMiami", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37177983}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at the Marshall Slocum Inn as our mini honeymoon, arriving on August 2nd and staying for 3 nights. I would highly recommand this inn to anyone visiting the Newport area. We were blessed to have reserved the greatest little apartment and it was bigger then my first apartment! With a full living room, kitchen, bathroom and bedroom we made ourselves at home. It also saved us some money by packing deli meat and brown bagging it to the beach!", "title": "Relaxation right next door!", "helpfulness": 1, "user": "barb111", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36923014}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "The room was clean and cool each night with a hot breakfast in the morning, we were all set each day to explore Newport. The great location of the inn made downtown Newport within a quick walk and points further was a quick tolley ride. The owners were very helpful in helping us plan or day with inside suggesstions to help us on our way! Every person needs to walk the Cliff Walk - it was breath taking, but be sure to wear sneakers!", "title": "Another Perfect Stay", "user": "ABC3702", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36530999}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I were looking for a B&B to spend a long, romantic getaway weekend. We decided on the Marshall Slocum Guest House based on the reviews of others -- and were so happy that we did! Mark and Dana were warm and inviting, the food was uh-mazing!, and the room was exactly what we hoped it would be. We can't recommend it highly enough. Thanks, Mark and Dana!", "title": "Couldn't be better!", "user": "NYCJackson", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35654723}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "<My wife and I spent three days this summer at the marshall slocum guest house. We were impressed by the professionalism and friendliness of the staff. The room was beautiful, but also comfortable and relaxing. Some B and B's can be so stuffy, but the room really felt homey. If you go, be sure to stay for breakfast. I had the crab benedict and it was outta sight.", "title": "A great romantic getaway", "user": "climbboy", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35513082}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We hope to plan a return visit this fall.", "title": "Very clean, comfortable. Misrepresented breakfast.", "helpfulness": 1, "user": "NewYorkBinghamton", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 35512364}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Beautiful inn. Very comfortable and clean. No TV as noted in earlier review. Breakfast was the same every day. Not a full breakfast. Yogurt, fresh fruit w/ a few granola sprinkles. Grilled cinnamon bun or sweet roll. Same menu put out. Other guests complained about this. Housekeeper pushing 3 very expensive restaurants for dinner. Check out the Brick Alley. Great place and reasonable. Not one she recommended.", "title": "Excellent location, great breakfast!", "user": "Marysela", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34151804}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Our host called us the day before our arrival to say that the Inn was booked for a group and we would have to stay in an apartment next door!", "title": "It's Not On The Menu", "helpfulness": 2, "user": "Chichimo", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 32814830}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "That's really the only adjective I have to use about this place, it was just fine. My husband and I are in the process of taking a road trip around New England stopping at bed and breakfasts along the way, this place was very average. Our room was nice and clean, the inn itself charming, the breakfast good, but we didn't feel very welcome.", "title": "It was fine...", "helpfulness": 1, "user": "shay9179", "date": "October 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20869030, "likes": {"liked": "— clean and cozy, great location", "disliked": "— lack of interest in the hotel guests"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We arrived at about 5:30 on a Sunday night and a staff member half-heartedly greeted us and showed us to our room. I kind of expected cookies or a snack or something upon or arrival, but there was nothing. The staff member showed us our room, quickly answered some questions and was gone. We met Mark and Dana the next day at breakfast, Mark introduced himself and served us breakfast, but Dana seemed put off that she was even there. She also shot Mark a couple of \"looks\" throughout breakfast. There was some obvious tension between the two of them, which, of course, is nothing abnormal when a couple is running a business together, but don't make it obvious to the guests!", "title": "Nice place, nice something, but...", "helpfulness": 1, "user": "T2008J", "date": "September 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20515266, "likes": {"liked": "— Characterful building up to a point", "disliked": "— No Innkeeper 'presence'"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed two nights at Marshall Slocum and will probably look elsewhere on our next trip to Newport.", "title": "Great B&B", "user": "RedEyedandBlue", "date": "September 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19863087, "likes": {"liked": "— Comfortable bed, good breakfast", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Yes, I can see what all of the other reviews mean... but there was a certain something missing from our stay. That was the Innkeepers themselves were noticeable by their abscence. The only time we saw Mark was at breakfast time when he served up what was an excellent breakfast. He was helpful and knowledgeable too. But come the evening or daytime, there was a young lady hidden away in the kitchen who I felt I was bothering everytime I spoke to her. It wasn't the friendly service I've come to expect from Inns that are highly rated on these forums.", "title": "So Beautiful- nice weekend get-away", "user": "bambina25", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19336076, "likes": {"liked": "— Extremely Clean, wondersfull hospitality made us feel right at home"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Another gripe was the lack of coffee on the side. All the Teas under the planet were available out of hours, but no coffee. To add insult to injury, the milk for the tea was very creamy, almost as if it was cream which of course you have in Coffee.", "title": "Lovely New England Inn", "user": "candylynch", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18973197, "likes": {"liked": "— charming and breakfast", "disliked": "— n/a"}}], "location": {"country": "United States", "city": "Newport"}, "stars": 3, "variance": {"poor": 6, "average": 9, "very good": 44, "terrible": 4, "excellent": 155}, "aka": "Marshall Slocum Guest House Hotel Newport", "slim_ranking": 0.137254901961, "description": "Located in the Historic Top of the Hill district and just minutes away from Newport Harbor, the mansions, and beaches, the Marshall Slocum Guest House is a five room bed and breakfast that has been meticulously preserved to it's original 1855 charm. Join us for exquisite breakfasts, wonderful lobster dinners and five star service while touring the beautiful city of Newport."}