{"user_rating": 3.0, "review_count": 541, "name": "Marseilles Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "DO NOT STAY IN THIS HOTEL.", "title": "Big Expensive mistake", "helpfulness": 1, "user": "Robbed_John", "date": "March 1, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6898562, "likes": {"liked": "— Location", "disliked": "— Price, room"}}, {"rating": 2.0, "title": "Great city, bad hotel stay", "text": "First, we feel we were robbed by a man with a keyboard instead of a gun.", "helpfulness": 3, "user": "Andrea H", "date": "February 3, 2007", "id": 6733678}, {"rating": 4.0, "title": "Pleasantly Surprised.", "text": "Secondly, it is shabby at any price.", "helpfulness": 5, "user": "lthompson22", "date": "January 31, 2007", "id": 6719789}, {"rating": 1.0, "title": "If you like trouble..", "text": "Being robbed was partially our fault. A friend recommended the hotel as a good location and it is. When I looked at trip adviser I saw prices from around $150 - not bad for South Beach. My wife made the reservation on their web site for two nights in Feb.,07. The confirming email said: \"Total (before tax) 310.00\". So far so good. She did the checking in and they did not discuss price because she had reserved online. We ended up with a Superior room with an Ocean View. That is a joke, you can see the ocean with binoculars through a crack between the buildings. (This was not an Ocean front room with a nice balcony but a room at the street end of the building with a window that stuck out from the building and you could see the Ocean. They also charge 25.00 for parking and the tax (which is high in Florida) was $40.30. Also there is a $1.00 charge for the room safe. for a total of $378.05 per night. When we went to check out, our bill was $765.10 for TWO NIGHTS not a week. My wife did not print the confirmation, so we could not argue and just paid the bill.", "helpfulness": 2, "user": "KateTheNetherlands", "date": "January 27, 2007", "id": 6705021}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Second, our room was old, shabby, and noisy as many of the reviews state. Perhaps there are better rooms, but ours certainly was not one of them. The carpet was worn and dirty. The tile in the bathroom was moldy and dirty. The plumbing did not work well. The water was only luke warm. The window was so dirty, you had to stoop and look around to find a semi-transparent place to \"enjoy the ocean view\". The walls are paper thin and you can hear every noise in the hall. The doors are so bad, everyone has to jank on them to open them and then slam them to close them. With paper thin walls, this is just delightful to hear all day and night. We also had a room near the elevator and this just added to the din. It was an absolute disgrace for $378 a night even for South Beach.", "title": "Good location but dowdy hotel and unfriendly staff", "user": "elisa_salsera", "date": "January 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6584086, "likes": {"liked": "— location", "disliked": "— overall condition of the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Just got back last night-", "title": "Updated Decor- Great Location", "helpfulness": 2, "user": "nolasgirl504", "date": "May 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3482874}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "1)ROOMS: All of the cheaper rooms are small, especailly if you get a double- BUT, VERY WELL DECORATED AND SPOTLESS! What they lacked in size, they made up for in understated designer decor. REMEMBER, these are remodeled old hotels; the bathrooms are all art deco tile, but very well reworked! We got a double(my boyfriend and I) and it was OK, the frig. worked well and the beds were VERY comforatble!!! CHARLIE at the front desk was very helpful-ask him for insider info. to eats and clubs. Fitness room below lobby.", "title": "Cool Hotel", "helpfulness": 1, "user": "Creyes80", "date": "May 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3475610}, {"rating": 1.0, "title": "Rude staff, misleading hotel", "text": "Next time, I'm going to ask about the SUITES...not many avail., but they are 5 times larger- have full kitchenettes and a balcony-some with direct ocean views- ASK ABOU THEM, because I didn't see them advertised anywhere!", "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3438701}, {"rating": 2.0, "title": "Alright, I guess!", "text": "2)LOCATION:Fantastic...1 block away from Lincoln blvd.-pedestrian mall-great designed knock-offs of everything, plus lots of boutique style clothing stores with trendy pieces= Just what any girl with expensive taste on a budget could ask!! For serious designer shopping (ie. serious financial damage)-go to Ocean drive(starts at 15th and Collins) or lower SOBE (around 5th/6th st.) All things Vercace are there!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3437804}, {"rating": 2.0, "title": "Wouldn't go back", "text": "The Cuban rest. just down the street- has excellent baked chicken with saffron rice and veggies-plus their coffee stand is open 24/7-great midnight snacks. Also, the hotel has a cute cafe in front (we didn't wake up early enough to eat their breakfeast)", "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3432634}, {"rating": 2.0, "title": "Great Location, Not so Great Staff nor Hotel Itself", "text": "Just like all of the reviews said, the location is great. Lincold Rd, Collins Ave, Ocean Drive and of course the beach are all very close to the hotel. You dont need to rend a car at all. The hammocks in the hotel are great and very relaxing. On the other hand, the hotel is pretty old and it definately feels like it. The staff was unattentive and even a little rude. If you don't speak Spanish, they completely ignore you and first service those people who do speak Spanish. The staff does not dress in uniforms, never smile, and all seem like they hate being there. Not friendly at all.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5316070}, {"rating": 4.0, "title": "Good for the money", "text": "Above average for the money..", "helpfulness": 6, "user": "richiegags", "date": "June 5, 2006", "id": 5301475}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Pros... good pool, decent location (about 3-4 blocks from Ocean Drive), clean, friendly service.", "title": "for budget traveler", "helpfulness": 5, "user": "edlara", "date": "May 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5031794}, {"rating": 3.0, "title": "Excellent location, nice staff, clean rooms", "text": "Cons... Room quality is weak, PAPER THIN walls (you could hear EVERY time your neighbors left the room because of the way the door slams back)", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5016538}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "Ideally I'd give it 3 1/2 stars if I could....but definitely worth the money.", "title": "Musty Marseilles", "helpfulness": 3, "user": "Davidrgriff", "date": "April 24, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 5003907}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "not a four star hotel, room was okay, (standard room), BUT the hospitality was awesome, Jorge, angel, moises and Daniel were great..... look for them when you arrive, they know every hole in south beach, they recommended the best restaurants, bars, and night clubs on south beach, and Lincoln road and it wasn't disappointing and women if you love shoes this is the place to go....LINCOLN ROAD......We had to buy addition luggage for my wife's shoes!!!!!!. The pool is clean, you are able to have a beer on poolside, snack on a salad or burger, footsteps from the beach, where you can rent a chair and an umbrella. AFTER a day of shopping, stop at the bar located at the lobby on the hotel and have a cold beer, play a poor game of pool, (we sucked). The hotel is in a perfect location.........i will return, but i will upgrade and rent a suite next time (march 07)", "title": "not bad at all!", "helpfulness": 6, "user": "bulawil", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 5802384}, {"rating": 2.0, "title": "Don't expect 4 Star Service and you will be fine", "text": "YOU HAVE TO CHECK OUT NIKKI\"S BEACH ON 1ST and OCEAN DRIVE...sat and sunday..... party till 5am!!!!! this place has ------- beds on the beach.....buy a bottle of wine lay on the beach and dance to house music ......AWESOME", "helpfulness": 4, "user": "GhingusKahn", "date": "August 12, 2006", "id": 5603320}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "Had a wonderful 8 night vacation....", "title": "Definetly avoid this hotel", "helpfulness": 10, "user": "kjl j", "date": "June 16, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5354373}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I stayed at this hotel because it is close to the Miami Beach Convention Center. It is good location where everything is within walking distance, but after arriving at Miami beach I realised almost everything is within walking distance.", "title": "great location, but that is about all", "user": "Kungfufi", "date": "November 29, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6305491, "likes": {"liked": "— location", "disliked": "— state of the hotel"}}, {"rating": 1.0, "title": "Shocking disturbance kept us awake all night.", "text": "The room itself is in desperate need for upates. However, the hotel is repainting the outside, so they obviously realise that. The service was ok to minimal.", "helpfulness": 1, "user": "JohnnyBB", "date": "October 18, 2006", "id": 5968562}, {"rating": 1.0, "title": "Horrible Hotel", "text": "The room does not provide complimentary slippers, and the carpet does not look like it is clean enough to walk bare foot on.", "helpfulness": 2, "user": "Nkh105", "date": "October 11, 2006", "id": 5943599}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "A few things that that is good about this hotel is that it has an OK pool out back, and walks out to the beach, which is nice. Also our room has nice corner view of the beach, which makes it worth while.", "title": "Don't do it!!!!!!", "helpfulness": 2, "user": "cblossom", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5904865, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Next time I go to Miami I will definitely try another hotel.", "title": "Not a bad hotel at all", "helpfulness": 4, "user": "remotecfo", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5821807, "likes": {"liked": "— Very comfortable", "disliked": "— Room size"}}, {"rating": 1.0, "title": "Not so great.", "text": "The Hotel Marseilles' photos on the Web site were very misleading, as many have said. The odor was awful, kind of musty and moldy. Rooms were very small and cleanliness was an issue.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 21, 2005", "id": 3929667}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "The window of one of our rooms was boarded up and the staff goofed on our reservations and said there was only one room booked, even though we had booked two and verified three days before that the rooms were still available.", "title": "Worst service ever", "helpfulness": 1, "user": "Vaniester", "date": "July 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3680111}, {"rating": 2.0, "title": "Please don't go by hotels website pictures !!!!", "text": "We ended up moving to another hotel, and the only great thing about Marseilles was a supervisor who took away the charge for cancelling on the same day as check-in because he understood our situation.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3673871}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "I just returned from a weekend from hell at the Marseilles. I chose this hotel by the reviews on this website and there is just no possbile way that these people who write glowing reviews were at the same hotel I just left. Where to start.....", "title": "Disgusting Hotel !!", "helpfulness": 1, "user": "voodoopr", "date": "June 6, 2005", "detail_rating": {"cleanliness": 1.0, "service": 3.0}, "id": 3534528}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "The room looked nice enough. It seems to be newly furnished although the paint was chipping. The walls were paper thin. The beds were very very squeaky. The pillows left me with extreme neck pains. All this I could have over looked had the rest of my experience not been so horrible. The bathroom that others called \"quaint\" was very old. The bathtub had been painted white( you could see the paint streaks). While showering expect to get scalded because the water temperature changes very unexpectedly. Also the shower emits a deafening squealing noise when the water is on, I know I am not the only one with such a problem because I was able to hear the same noise comming from my neighbors room every time they showered. The bathroom door got very stuck everytime you closed it because it had been painted over so many times. Our window would not stay open you had to prop something in there to hold it.", "title": "Overpriced, smelly, noisy and rude", "helpfulness": 1, "user": "karen-aussie", "date": "June 2, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3519878}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "The hotel is in a great location. You are on the beach, for a great price compared with the hotels within a two block radius. You stay at this hotel, but you hang out later at the Delano, the Raleigh and the Shore Club, all within walking distance. A great place to eat is La Galleria located about 3 blocks south, 1 block past a Walgreens, which did come in handy. If you reserve an oceanfront room, be sure to request the one where the door is not directly next to the next rooms door. My girlfriends are I were woken up 2 nights in a row at 4 in the morning by our neighbors, the first night it sounded like they were trying to get into our room and then security showed up. We complained to the front desk but all they would do is tell us that the people checked out. The second night it was new people, but again security showed up. This time in telling the front desk we spoke with a nice man who took money off of our room for both nights. The service really stinks in the cafe out front, I would suggest not eating there, the food is better and cheaper at La Galleria right down the street. After looking at the prices of what it would cost to stay at the hotels that I liked better, I have to admit that I would probably stay here again, only now I know what to ask for in a room and where to go for food.", "title": "Great location", "helpfulness": 4, "user": "cmskjg", "date": "March 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 4723589}, {"rating": 4.0, "title": "Great stay for Valentines day !!!", "text": "My girl and I read all the reviews and went into it expecting an average hotel in a great location with less than spectacular staff.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 28, 2006", "id": 4564244}, {"rating": 5.0, "title": "Very Satisfied with the Marsielles on South Beach", "text": "THIS HOTEL WAS MORE THAN I BARGAINED FOR ! There was a problem with the temperature in our room and it was fixed within 15 minutes. The staff were competent and complimentary to the great weather. The rooms are adequate and the shower pressure spectacular.", "helpfulness": 9, "user": "LMN123", "date": "January 17, 2006", "id": 4358398}, {"rating": 5.0, "title": "Can't Wait to Get Back to The Marseilles", "text": "The pool guy they contracted with was entertaining and just added to the flavor of the place. The drinks were insanely expensive but so is the rent on collins ave.", "helpfulness": 19, "user": "mkesg", "date": "November 12, 2005", "id": 4107806}, {"rating": 1.0, "title": "Don't waste your money", "text": "It might be difficult for this establishment to keep up with the day to day stuff during peak season so know this going into it. I would definitely stay here again, as their rates are competitive and reasonable.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4054207}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My husband and I stayed for two nights recently. We were delighted with the location, close to everything including shopping and restaurants, even Walgreen's one block away.The staff were extremely helpful when my husband needed a minor amount of medical attention.", "title": "Convenient to Everything", "helpfulness": 2, "user": "Lisavfr", "date": "March 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4741927}, {"rating": 2.0, "title": "Roaches......Ants........Roaches......& Ants!!!", "text": "Small, but convenient pool, the beach is footsteps from the pool. We especially enjoyed the shady hammocks available for guests.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4741137}, {"rating": 1.0, "title": "Disappointing stay at the Marseilles", "text": "Just returned from a 2 night stay at the Marseilles. Our stay started with rude, inconsiderate staff with the exception of Julian at the front desk. The parking situation was atrocious. We were not able to pull up to the hotel to unload our car because the restaurant manager had the front blocked by a pick-up truck. The manager refused to move the truck and stated that this situation was \"standard operating procedure.\" Shouldn't the staff accomodate the paying customers and not the other way around?? We were never informed that parking was 1/2 block away and cost $18 per day. Furthermore, we were \"promised\" a spot which was a total joke. Our room faced a concrete wall and was next to the elevator which was very noisy. I don't think the beds have been replaced since 1948...it was very uncomfortable with little support. The bathroom was unclean and tiny. The uncaring attitude of the staff trickles down from the owner to the management to the staff. We left a message for the owner on his voicemail and requested a call back which was never returned. The pictures on the hotel's website are very misleading. If you're going to South Beach...do yourself a favor and stay somewhere else!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 1, 2005", "id": 3429409}, {"rating": 2.0, "title": "Great Location", "text": "Just got back from a 4 night stay at the Marseilles Hotel with my boyfriend. The location is excellent, right near Lincoln and Ocean ave, and directly on the beach. Decent pool area and great breakfast is served at the hotel.", "user": "A TripAdvisor user", "date": "April 28, 2005", "id": 3422369}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The pictures of the hotel on their website were beautiful, but in reality the hotel is very old and the rooms were extremely small. The shower had hot water, but the floor and sink was peeling as were the walls. The air conditioner was very noisy as well, and there was no way to turn it off. The room also had a strong odor of must and mold. Our \"balcony\" consisted of a view of an alley, and it was shared by the room next door. It did have a mini fridge which was nice.", "title": "good price and good location", "user": "aqrate18", "date": "April 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3417020}, {"rating": 3.0, "title": "great value and location", "text": "If you don't mind older accommodations, this is a fine place to stay. The price was good, staff was friendly enough, and the location could not have been any better. Besides there is so much to do in South Beach and the weather is so great you will not be spending much time in the room.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3402624}, {"rating": 3.0, "title": "Location, Location, Location", "text": "We stayed 5 nights at the Marseilles. We loved the location near Lincoln Road and the direct access to the beach. They propose a self parking one half block near for 18 S or you can park on public lot on drexel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 19, 2005", "id": 3387911}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "We have stayed at other, more costly hotels nearby, but have decided that we would return to Hotel Marseilles without a doubt!", "title": "Marseilles nice, but less than expected. Total Party Crowd.", "helpfulness": 2, "user": "lauren6318", "date": "March 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4738570}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "If you don't mind sharing your room with a few ROACHES or taking a shower in a clogged bath tub (and by the time you are finished, the water is past your ankles),then this is the place for you!!!!", "title": "Great Staff make the Hotel a nice place to stay", "helpfulness": 7, "user": "ranken", "date": "March 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4726115}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 3, "variance": {"poor": 96, "average": 119, "very good": 177, "terrible": 92, "excellent": 57}, "slim_ranking": 0.586734693878, "detail_rating": {"service": 3.5, "cleanliness": 3.0, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}}