{"user_rating": 4.5, "review_count": 110, "name": "Marsa Shagra Village", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "This was my first visit to Ecolodge Shagra Village as a participant of a technical diving course. The site and the shore are superb, the staff is helpful and the food is good.", "title": "Pure diving nothing else", "helpfulness": 1, "user": "nygyuri", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 105828801}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed in a basic canvas tent directly on the shore with a fantastic view to the see. So it seemed a perfect week of diving adventure but sadly the beer was highly overpriced. :)", "title": "Back yesterday-planning our next trip.", "helpfulness": 7, "user": "izzy83_11", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 104882482}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I'd been before but this was the first time for my partner and our two children (aged 10 and 13). Both did courses (junior open water and junior advanced open water) and both instructors (Berry and Mahmoud) were brilliant with them. All staff were unfailingly helpful and friendly, facilities were clean and efficient and food was really good (and so much of it!). If you're after night life and cocktails though, this is definitely not the place for it. Plenty of people have a beer after diving, but it doesn't seem to go much beyond that and people turn in quite early. I have to mention how lovely the dive and restaurant staff were with the children -it made their holiday (though I would say that children need to be old enough to be relatively independent and aware of risks of being around heavy and expensive equipment). It's still definitely a dive/snorkelling centre rather than a typical beach resort, but that's exactly what we like about it. House reefs are excellent and healthy, saw turtles,baby sharks, morays, nudibranchs, blennies.", "title": "Excellent stay!!! Fantastic place", "helpfulness": 4, "user": "jimmypeck", "date": "April 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104607462}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I was a little unsure what to expect as this was not our usual type of holiday. We were not disappointed. Although it is very much a dive oriented resort, as snorkellers we still had a fantastic time. The house reef is great, and we even saw turtles!!", "title": "Fantastic as Always", "helpfulness": 2, "user": "ScubaDude75", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97280617}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The chalet we stayed in was greatm clean, cool and we have no complaints on any of the facilties. the food was good, if a little repetitive, you have to get there early if you like a pipin g hot meal as the buffett style can go a little cold. The only slight criticism I would have is that for breakfast fresh filter coffee would have been nice instead of instant, and some sun loungers on the beach would be good. Excellent trip though - if you ae looking to go book through these guys http://www.dolphinswims.co.uk/", "title": "I love Shagra", "helpfulness": 3, "user": "purplevonny", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83196075}, {"rating": 5.0, "title": "Super Relaxing holiday", "text": "Had a wonderful holiday, lots of diving. food was excellent, service too! I can highly recommend a stay there. Will be going back soon", "user": "HenryS4", "date": "January 1, 2010", "id": 52298609}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed here for a week and made approx 3 dives a day. Truck dives in the morning and house reef dives in the afternoon.", "title": "great diving !", "user": "bjsmit", "date": "December 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52066390}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The house reef is great !", "title": "Unlimited diving and wonderful snorkelling on house reef", "user": "jax_46Brighton", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32222035}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Despite less than efficient flights (2 hours late outward, 3 hours delayed on return!) it was well worth it on arrival at the Ecolodge!", "title": "Great set up for divers", "helpfulness": 4, "user": "sg2", "date": "May 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31215911}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Shagra is the most developed of their 3 centres. Beautiful setting, and we stayed in a Royal tent at the water's edge. It was wonderful! The only reason I've not given it 5 stars is the discomfort of very hard beds!! but when they offered to move us, we declined, as everything else about the tent was fabulous!! My husband is a diver and enjoyed the shore dives, and the snorkelling is fabulous! We also took truck transfers to neighbouring bays...go to Abu Dabbab and snorkel with large turtles...you may even be lucky enough to see the elusive dugong.", "title": "Idyllic escape & great diving", "helpfulness": 1, "user": "Misscaramel", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30598072}, {"rating": 3.0, "stay_parameters": "Stayed September 2010", "text": "My wife and i are currently staying at the Ecolodge Shagra village (last week of September 2010). Writing a first hand review while the impressions are still \"fresh\" after a few days staying here seems to be best I guess.", "title": "My wife and i are currently staying at...", "helpfulness": 11, "user": "MorpheusNL", "date": "September 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 80924293}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Before i share my experiences I would like to indicate we are staying at a Airconditioned Chalet in a week that's (appearantly) very busy.", "title": "Great diving", "helpfulness": 2, "user": "Stevie999_10", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80441133}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "What describes our impression of Shagra best is; \"Not what we expected\". We booked this trip based on positive reviews and stories we read and received via the internet or friends and family.", "title": "We loved it!", "helpfulness": 3, "user": "tirili", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 62023079}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The Village:", "title": "Diver's Paradise", "helpfulness": 1, "user": "SwedishMagnus", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 61129742}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The village lies in a crowded piece of land close to several big resorts. We expected the Shagra village to lay at a remote location with pristine beaches and a quiet atmosphere. This can be said of the village itself but the noise coming from the resorts closeby is annoying.", "title": "Amazing, exhilarating, fun and relaxing", "helpfulness": 6, "user": "MKH68", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60513805}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I absolutely loved it here! I booked through Oonas Divers who were extremely helpful and gave a lot of information about the place both prior and post booking so maybe my expectations were managed better than some of the previous reviewers. However, even though I had heard great things about the village, when I got there everything exceeded my expectations. Every little detail has been taken care of to make sure you have a relaxing and pleasant stay.", "title": "Magical Marsa Shagra", "helpfulness": 5, "user": "FayeW", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117819164}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I stayed in one of the tents as I loved the idea of sleeping under the stars with the sound of the waves lapping the shore. It was quite warm in there in the daytime due to the time of year and high temperatures, but I could hardly complain when I was awoken at sun rise to a beautiful view of the beach and sea from my tent. There are plenty of places you can relax on bean bags or chairs in the shade and there is a nice breeze so you can cool down.", "title": "We loved it & we`ll be back", "user": "AdamEgypt", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117798994}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The food was much better than I was expecting and there was always a good variety of different salads, vegetables, pasta / rice and chicken/beef/fish dishes. I especially liked the bbq food nights.", "title": "You Won't Regret It", "user": "Filanza", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117661217}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The staff were great and the diving centre very helpful. The manager greeted everyone by name whenever he saw us around, just another example of the personal service you get. Everything is kept very clean and there are numerous cold water coolers dotted around to refill your bottles to keep hydrated. The shaded dive area has freshwater showers to rinse off between dives in addition to the shower blocks near the tents and huts. I found they were kept very clean and did not smell at all - not a problem having showers and toilets in the same area as there is an attendant who cleans them all day. As the number of guests are limited, nowhere is overcrowded and you don't have to queue and wait around.", "title": "Still the same in Marsa Shagra...", "helpfulness": 2, "user": "GaryDiveLondon", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116552773}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Both the Bedouin cafe / bar and the Oxygen Bubbles bar are well worth a visit. You will be greeted with a smile and everything is so relaxed and easy. The oxygen is great after diving and they also make delicious smoothies!", "title": "Great diving and relaxing place !", "helpfulness": 3, "user": "Petipied", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115299628}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa", "city": "Marsa Alam"}, "stars": 2.5, "variance": {"poor": 0, "average": 2, "very good": 37, "terrible": 1, "excellent": 70}, "aka": "Marsa Shagra Village Hotel Marsa Alam", "slim_ranking": 0.142857142857, "description": "Since our founding in 1990, Red Sea Diving Safari has grown into a world-class diving destination. Our eco-diving concept has been internationally recognized as a model of tourism development and our villages offer you the experience of what has become known as “The Eco-diving Adventure”. All aspects of the RSDS experience promote nature-based tourism and maximum diving enjoyment. Our villages were created in consideration of diving enthusiasts and our diving program covers more than 60 shore-based and off-shore dive sites. We offer our guests a variety of diving possibilities including; unlimited diving on our house reef, shore dives, night dives, and boat dives to world-famous dive sites such as Elphinstone and the Fury Shoals. Our operation consists of 3 lodges; Marsa Shagra Village, Marsa Nakari Village and Wadi Lahami Village. Our team also manages Pioneer Divers - Marsa Alam. Our villages are small because we maintain a minimal-impact policy towards the environment. Our guests take advantage of an exclusive experience in a nature based atmosphere. Our villages are simple with traditional eastern style domed architecture and every guest room enjoys an unobstructed sea view. Each one of our villages has a maximum capacity which is based on the carrying capacity of the house reef. Visiting our villages is more than just your typical diving vacation. By the time your holiday is over, you will leave with a new appreciation for the serenity and simplicity of our nature based atmosphere. Explore ancient ruins of long gone civilizations and learn about the long history of the Red Sea region. Take a trek through the desert to observe amazing wildlife and the Bedouins of the south. Meditate under the mutating colors of the setting sun and then fall asleep star-gazing under a moonless night."}