{"user_rating": 4.0, "review_count": 67, "name": "Mary Lee's by the Sea", "reviews": [{"rating": 2.0, "title": "Unremarkable", "text": "We stayed two days and couldn't wait to leave. The first day we had no water and had to move to another unit. While owner was accomodating, the second unit was just as unremarkable as the first one. The first unit was on the bottom floor and had kitchen and a fairly large and decent bath. However, we could not enjoy it because we had no water.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 22, 2003", "id": 1143234}, {"rating": 5.0, "title": "relatively isolated", "text": "The drive to this isolated place is a bit of a challenge and the nearby town was basically a shanty town (I am exagerating a bit here).", "helpfulness": 11, "user": "Pasqualinho", "date": "March 14, 2003", "id": 917364}, {"rating": 5.0, "title": "An unexpected suprise!!!!!", "text": "The view was only good from the owner's home. The rest of the units had no views. If you are looking for an overnight and inviting a large crowd, you would find this place amenable, otherwise, stay away.", "helpfulness": 11, "user": "mcguillicudy", "date": "September 7, 2002", "id": 694923}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "My girlfriend and I spent a nice, relaxing 2 days here on our way around Puerto Rico. It was nice to have a kitchenette and use of her BBQ so we could cook for ourselves. Although it was really hot out during the day, the sea breeze and fans kept the studio nice and cool without having to resort to AC.", "title": "Adorable rooms, warm hospitality", "helpfulness": 5, "user": "lunettes_noires", "date": "January 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4354231}, {"rating": 4.0, "title": "A peaceful oasis of tropical funk", "text": "Mary Lee's story is more interesting than that of your typical ex-pat--ask her about living in Cuba during the revolution.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3728047}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "A huge family gathering was planned as part of our daughter's wedding in Puerto Rico. By good fortune...and after extensive internet hunting... we settled on Mary Lee's. It fit our needs perfectly as lodging for several family groups, plus became the central location for other relatives to visit, hang out and party. It is clean, functional...and funky, in the best island sense (colorful, festive, relaxing) Yes, things there do breakdown, and the power went out a few times...but it really is a place of 'Who cares?...we'll survive, the ocean breeze is cool and we haven't run out of rum.\" Great layout that creates a balance of privacy but connection with other units if you want it. I saw so much of P.R. that truly was nasty, run-down and totally ghetto that this is a diamond...even with it's rough edges.", "title": "Peace and beauty", "helpfulness": 14, "user": "Beachlovers", "date": "June 11, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2183953}, {"rating": 5.0, "title": "Great place to relax", "text": "We had a great, 3 night stay at Mary Lee's. The apartments here are totally charming. Check out her website! Our unit was beautifully decorated, with a practical kitchen....and had a lovely view of the bay and offshore islands. We kayaked over to Gilligan's Island and snorkeled. Guanica itself is non-touristy, which we find a plus...had a great dinner at the Blue Marlin on the Malecon.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 12, 2004", "id": 1776693}, {"rating": 5.0, "title": "Beautiful hideout", "text": "Mary Lee is a gracious hostess. If you want big resort glitz, this is not the place. If you want a real retreat, in an area full of outdoor opportunities, including hiking, kayaking and snorkeling, this is the spot for you.", "helpfulness": 12, "user": "quasar33", "date": "September 16, 2003", "id": 1342443}], "location": {"country": "Caribbean", "city": "Guanica"}, "variance": {"poor": 6, "average": 9, "very good": 19, "terrible": 2, "excellent": 31}, "aka": "Mary Lee`s By The Sea Hotel Guanica", "slim_ranking": 1.0}