{"user_rating": 4.5, "review_count": 245, "name": "Masseria Il Frantoio", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed 3 nights and 4 days in Puglia on our recent 3 week vacation to Italy. The Masseria Il Frantoio was a wonderful base.", "title": "Wonderful authetnic experience", "helpfulness": 1, "user": "Judy D", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7615177}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It is a very authentically converted masseria (fortified farm house). The house is beautifully decorated with antiques and even a lot of belongings from the original family who dates to the 1500. The rooms are smallish but very comfortable and pretty. We stayed in the main house upstairs, and also had a beautiful sitting room to relax in.", "title": "With some reservations...", "helpfulness": 5, "user": "SmallHotelConnoiseur", "date": "December 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6484999, "likes": {"liked": "— The serenity, staff and friendly horse nearby.", "disliked": "— The room."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "But the real highlight here is absolutely the food. Breakfast was a great spread with 9 or 10 kinds of home-baked cookies/cakes, plus the usual meat, cheese, etc. We also had the best meal of our entire trip at the May 1st (labor day) \"big lunch\". This was an unbelievable 10 course meal of Pugliese country cooking, all paired with wine and the farm's own liquers. It was an extraordinary experience, and sooo well worth it at 50 euros per person. Note that they only cook \"big meals\" 2 or 3 times a week, and typically in the Italian manners, not really on any kind of a fixed schedule. So, go with the flow! If you need to extend your stay so you can eat, make sure you do it!", "title": "Paradise on Earth - your own Eden", "helpfulness": 2, "user": "Ratbags", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5931125, "likes": {"liked": "— The whole experience", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The people are very nice. There's a young English guy who works there and gives a nice 45 minute tour of the house and the farm. It's pretty interesting and really quite evocative of how the place was like over the centuries. It's worth taking the time.", "title": "An olive heaven", "helpfulness": 1, "user": "notonlyfivestar", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5904463}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "With some caveats, we agree with 2 other TripAdvisor reviews posted in Oct. 2006. Don't stay too long as there is not much to do on site, and while the beaches are a short drive, they are not as nice as those further down the Apuglian peninsula. Yes, the dinner was wonderful with many organic delights and tasty local wine, but at US $155 per couple, all inclusive, it was a bit on the pricey side.", "title": "The Best of Italy", "helpfulness": 10, "user": "slocum95", "date": "November 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4088531}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Masseria Il Frantoio", "title": "A Stay that satisfies the soul", "helpfulness": 7, "user": "sempreingiro", "date": "May 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3510025}, {"rating": 4.0, "title": "A gem", "text": "On the outskirts of Ostuni, one of the most picturesque towns of the Puglia region of Italy, lies a true Pugliese treasure. This masseria, a fortified farmhouse typical of the area, was constructed in various stages over the last four centuries amid 180 acres of olive trees that date back as many years. Armando and Rosalba Balestrazzi, purchased the farm 14 years ago, the only people outside the original family to have owned it. In search of a slower, healthier way of life, they traveled the whole of Italy, only to return to their native Pugliese soil where the time-honored rhythms of the land set the pace of their days. They have brought the abandoned house back to life and oversee the land, its produce and the gardens with a passion. Rosalba reigns in the kitchen where she recreates dishes of the past and newer innovative recipes using the products and herbs grown right outside her kitchen. The farmhouse has ten guestrooms, each one homey yet elegant. Outside, a shade garden and a nearby citrus grove add to the pleasure of the place, but it is in the evening, when guests are invited to succumb to the pleasures of the table (8 course- dinners), that makes a stay here so memorable.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 19, 2005", "id": 3488034}, {"rating": 4.0, "title": "outstanding food and ambience", "text": "Loved this place and wish I could have stayed longer and tried the legendary dinner. Owners and family/staff make all guests feel so welcome and offer excellent tips for things to do and places to visit in the surrounding area - and there is also heaps of interest on the property itself. The tour of the farm in the 50 year old car was a real highlight. Armando has a wealth of knowledge and is obviously very proud of his place. Rooms are all individual - I was very lucky to get one of the best, it was like a little cottage with its own courtyard garden, kitchen/dining room with fireplace, sparkling clean bathroom and large comfortable bedroom with armchair, desk, wardrobe, bookshelves (complete with books) and a fabulous vaulted ceiling. Breakfast is comprehensive with lots of little home made biscuits as well as fresh bread, jams, honey, yoghurt, cheese, eggs, fruit, juice etc. I also think it's a great idea not to build a pool on the property but instead to arrange access to nearby beaches.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3438249}, {"rating": 5.0, "title": "Wows for il frantoio, Ostuni", "text": "We have just returned from our second trip to this quirky, gastonomic bed and breakfast masseria", "helpfulness": 9, "user": "janehhi", "date": "April 7, 2005", "id": 3341593}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Whilst we cannot fault the food, and general members of staff we cannot recommend this establishment for the welcome we received on arrival. Under our noses our room was given to another couple who were rude, loud and complaining. We were given their room which the woman in question had described as 'poky'. We were offered an explanation in that the woman was 'mad' but no apology. It was only because we had been looking forward to the stay so much that we didnt move to another masseria (we found one that could accomodate us). The woman complainer was loud, whining, arrogant and obnoxious but unfortunately the staff could not handle the pressure.", "title": "demeaned", "helpfulness": 2, "user": "CJS49", "date": "July 6, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17578961, "likes": {"liked": "— the food", "disliked": "— the way we were treated by the receptionist"}}, {"rating": 5.0, "title": "Different Class (but it's NOT near Brindisi !!)", "text": "I've just spent 4 glorious days here, the two big attractions are the team of helpful hardworking staff, and of course the food. The restaurant, which is not always open, not sure if there is any set days when it is, is available to non residents so if you're just in the area and get the chance to have their €55 8-course banquet (wine - apparently unlimited, and very good, included), don't hesitate; predominantly vegetarian, exclusively from their own farm, and quite as tasty and delicious as you could imagine. On other days you may have to \"settle\" for their 5-course \"light\" supper (€39). Staying there was OK, breakfasts mirror the evening meals standards , and most rooms are lovely, and share a common sitting room and kitchen, but I had the one single room which is off the main stone staircase above the office and is a bit noisy (day staff clanking about from about 6am). No air con, there is an internet point for free use. And, it's not really very near Brindisi, it's just west of Ostuni, and the hotel should be listed under \"Ostuni\" instead.", "user": "PeterHarvey", "date": "June 6, 2008", "id": 16735437}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Nearby visits - Ostuni, Lecce, Gallipoli, Trani, Castel del Monte :-yes. Alborobello ? No, it's frightful - (as is anywhere where all shops have signs in Japanese). If you want to see real Trulli houses, just drive along the road between Locorotondo and Ostuni. And stop at the Cantina Sociale at Locorotondo (open until 7pm) for their deliciously spicy and dry whites and rosés.", "title": "A Magical Place", "helpfulness": 1, "user": "gourmt", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15599928, "likes": {"liked": "— the food", "disliked": "— small single room, snug shower in double room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Often, when places become famous, their quality changes for the worse. NOT Il Frantoio. And this place is very famous indeed. (On request the owners will show you their press file, which has articles in too many languages to name and weighs a ton.) Our schedule has us staying at Il Frantoio for one night on May 1 which is a major public holiday in Italy. This was unfortunate because it meant we would not be able to one of Rosalba's famous dinners. (Am I using the word famous too much?) So you can imagine our delight when we arrived at lunch time to be welcomed with the words \"Welcome home!\" - not sure if that is a deliberate mistranslation of the phrase \"Bienvenuti a la nuestra casa\" (welcome to OUR home), but it was certainly very lovely. We had not made a reservation but a table was set for us outside (no room inside) and we were in heaven for the rest of the afternoon. Just before lunch we were taken on a tour of the gardens, orchards and the ancient olive presses from which Il Frantoio gets its name. Armondo, the owner, left a high position in a dairy factory to buy the abandoned farmhouse 17 years ago and he and Rosalba are clearly in their element there. Their love for what they do (organic farming, hospitality, living in the countryside) trickles down into everything at Il Frantoio and our stay there had almost a dreamlike quality. Try to time your visit to coincide with a dinner (they do not do it every night) and make sure to spend a few hours relaxing in the grounds (don't miss the herb garden behind the kitchen with 22 varieties of herbs).", "title": "A real Italian experience", "helpfulness": 1, "user": "diane s", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10058922, "likes": {"liked": "— welcoming hospitality and food", "disliked": "— unable to lock door to room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "My husband and I were celebrating our 35th wedding anniversary and stumbled upon the Masseria Il Frantoio while doing our trip research, 6 months in advance. Upon arrival at the Masseria, we were offered an apertif ( a special drink and local snacks of nuts, olives and Pugliese crackers), introduced to all the staff and generally felt the warmth of being welcomed into someone's home. Armando and Rosalba have done an excellent job of making guests feel welcome and comfortable. This is not a hotel, but a home, so if you are expecting a luxurious vacation stay this is not the place for you. Our room was the bridal suite, so it was very apropos for our celebration. The bed was comfortable (slightly smaller than a king size bed) and the room was bright and airy. The bathroom was large, with a tub and hand held shower. The grounds are beautiful and the patio area calm and relaxing. Everything was super clean, from the bathroom to the patio. A tour is given of the Masseria and the history is presented to understand the special place in which you have been welcomed. I found the cave to be the most interesting. This is a place where the olives were pressed and made into oil, all the original equipment still available to view. Plus it is a working storage area for the farm. Now for the absolute best reason to stay at the farm...the food. Breakfast was the typical Italian breakfast, meats, cheeses, fruit, yogurt, pastries and cakes. But here the fruits are bursting with freshness, the pastries ever so tender and delicious and the yogurt fresh from the farm. By all means make sure you have dinner at the Masseria. Every course, and there are between 6-10, is lovingly prepared with the freshest of ingredients, cooking only the foods of the season. Each course is prepared with a different olive oil from the farm and Armando presents each course with a story of it's origin, preparation or special ingredient. Also accompanying each course is an endless flow of local, organic wines. You are seated at tables with other guests, if you choose, or you can sit by yourself. We chose to sit with others and had wonderful conversation and made friendships we have saved in our hearts. After a day of site seeing or going to dinner in one of the many little towns nearby, we were welcomed back to the house with an after-dinner drink of the local Rosolio. Another nice touch was when we were invited to share a bottle of Prosecco by another couple staying at the house, we asked if they could put together a few snacks to go with our drink. Wow! They presented us a tray of salami, cheese, nuts, olives and the Pugliese crackers...and here's the best part, we were never charged for any of these little extras! We thought the costs were very fair, 88 euros per person per night and 53 euros per person for the dinner. We stayed 3 nights and wished we could have stayed one more so we could have enjoyed another dinner. The dinners are not prepared on a set schedule, but make sure you get to include one in your stay.", "title": "Masseria", "helpfulness": 1, "user": "bjorkebo73", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 10018921, "likes": {"liked": "— Courtyard and service from staff", "disliked": "— The single room and there is no pool"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We spent 2 days at Il Frantoio this June; overall we had a very good stay, but that was an average of a fantastic stay with respect to the two meals we had there, and an OK stay with respect to the room we had. The meals at Il Frantoio, in particular lunch and dinner are truly unique and worth a trip on their own. 8 courses, all excellent, at both meals we had.", "title": "Stay here for the food, not for the lodging", "helpfulness": 1, "user": "MikeBOS", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 68677191}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The rooms, on the other hand, were a disappointment. We had a 2 bedroom \"apartment\". We got there on a very hot day to learn that only one of the two rooms had air conditioning. The other room did not even have a fan of any type, and suffice it to say it was stiflingly hot. The room sat right near the kitchen, and starting at 5am we heard lots of clanging as they started work. This went on for several hours. There are no phones in the rooms, and internet access is very limited. The bathrooms were small and cramped. Overall, for the price, I don't think the rooms were a good value.", "title": "Enjoyable stay", "user": "Joannaspencer", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 48569846}, {"rating": 5.0, "title": "Really great spot with an amazing meal", "text": "Netting it out, we would come back, but would be much more careful about specifying, in advance, exactly what we wanted from the lodging.", "user": "MaloneV", "date": "May 14, 2009", "id": 30009618}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Despite experiencing bad weather during our stay in mid-October we would recommend this masseria for its charm and hospitality. We stayed three nights during which only one supper was offered and thoroughly enjoyed. Only half the rooms were occupied and some people arrived without reservation.", "title": "Disappointing", "helpfulness": 1, "user": "UKJennings", "date": "September 16, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20109749, "likes": {"liked": "— Uncomfortable bed, couldn't lock room, no A/C"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The owners are obviosuly very proud of their achievements since taking over the masseria eighteen years ago and transforming it to a thriving business. Their staff are charmingly helpful and at times opiniated", "title": "Honeymoon in Puglia", "user": "Denise W", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 19104037, "likes": {"liked": "— Scenery and food", "disliked": "— bed, bathroom, absence of A/C"}}], "location": {"country": "Italy", "region": "Puglia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 8, "very good": 48, "terrible": 2, "excellent": 184}, "aka": "Masseria Il Frantoio Hotel", "slim_ranking": 0.111111111111, "description": "Masseria Il Frantoio is an organic farm set in the countryside of Puglia, a 10-minute drive from Ostuni and the sea. It offers free parking, rustic rooms, and excellent regional cuisine.Il Frantoio is surrounded by citrus gardens and olive groves and features an original mill of the 15th century, still producing quality olive oil."}