{"user_rating": 5.0, "review_count": 29, "name": "Mateya Safari Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This was our first Safari and whatever you read or whatever you are told can never really prepare you for such an awsome experience. There are two parts to the story, one is the experience of being with animals in the wild, in magnificant Africa and the other is Mateya Lodge, a little piece of heaven in this vast country.", "title": "A truly memorable experience", "helpfulness": 2, "user": "papafour", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89502192}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We were met by our ranger, Francois and tracker, Richard on a desolate airstrip in Madikwe. The luggage was loaded into the open sided truck and off we went to the lodge. Within minutes we had stopped, Richard had spotted White Rhino, we were enthralled to be so close to these wild beasts and then a few minutes further on it would be Elephants or Giraffe, Kudu or Wildebeest. By the time we had reached the lodge we had completed our first Safari.", "title": "Most beautiful lodge we've been in Africa", "helpfulness": 2, "user": "soroste", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88061974}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We arrived at the lodge and were met by Christine who gave us wet flannels to wipe our hands and then took us to the lounge for a cool drink. We were shown around the lodge with its beautiful antique African art and taken to our lodge. It was totaly on its own with an uniterupted view as far as the eye could see, beautifully furnished and extremely spacious, its own deck and plunge pool in total privacy and as the finishing touch, seperate air conditioning units for each side of the bed.", "title": "Phantastic Safari Experience", "helpfulness": 2, "user": "francoangelo", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59584398}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "We were treated to a morning Safari at 5.00am and were returned to a magnificent breakfast by 10.00am. We then relaxed, read, slept until the afternoon Safari at 4.00pm, preceded by a beautiful high tea and returned for dinner at 8.00pm. The chef, Innocent, is there to please your culinary taste buds and he knows just how to go about it. With five courses of the most sublime food and a wine cellar with a choice of 8,000 bottles, just go down and help yourself to a bottle of your choice. If five courses is just too much, tell him what you would like and and he will not disappoint.", "title": "Lovely resort, but doesn't measure up to others ..but this is my opinion", "helpfulness": 4, "user": "berniss", "date": "February 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 56664269}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We were lucky enough to see all of the big five, also wild dog, brown & spotted Hyena and many other animals and birds. Our ranger, Francois is extremely knowledgeable and informative and showed us trees, plants and insects as well as the animals and birds, he understands the land and had us enthralled for hours. One can't imagine what it is like to stop at dusk in the African bush, the silence, the smells the views, it is an experience like no other.", "title": "Fabulous", "helpfulness": 1, "user": "anniejet", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55119182}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We got lucky: first because the place I originally opted for couldn't take us so we went to Mateya instead; secondly because for three of of four nights we were the only people there, thirdly because - well, because it was wonderful.", "title": "Wonderful", "helpfulness": 3, "user": "JeffStranks", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124404804}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel is beautiful in every respect (though be warned that there's plenty of walking to do to move around in it). Accommodation fantastic, excellent wine included in the price, food wonderful (you can basically choose what you want, and Innocent the chef makes everything so succulent), and the whole place is filled with fabulous African artefacts.", "title": "Don't look any further. This is it!", "helpfulness": 3, "user": "winnoSydneyAustralia", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124264391}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "But what made it so memorable for us were the people, in particular Christine, Werner and Paul. We were so well taken care of and Paul and Werner showed us so much of, and taught us so much about, the beauty of Madikwe reserve and its wildlife. Everyone strikes the perfect balance between taking care of you and not getting in your way.", "title": "Put Mateya on your bucket list if it isn't there already!", "helpfulness": 9, "user": "Crazydukefan", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113952111}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Unreservedly recommended. Go if you can. You won't regret it.", "title": "Wonderful", "helpfulness": 5, "user": "JeffStranks", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95198994}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My wife said \"This is not 6 star. This is 7 star!\" These people could not have done any more to improve our 4 night stay. We were welcomed and treated as special guests.", "title": "Nothing beats perfection", "helpfulness": 4, "user": "kenbod", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95185730}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I do not usually use words like enchanting to describe travel experiences. The Mateya Lodge breaks the mold for me. The physical surroundings of the main lodge and private suites, adorned with African art work, paintings and furnishings create a magical experience for the guest fortunate enough to have chosen this setting for an African safari. During our July visit, Madikwe was teaming with game, and the skillful Ranger and Tracker we were assigned to for our stay, made the encounters in the park's high veld equally magical. Add to this the outstanding cuisine, the service ethic and attention to detail by all the staff, and we had the makings of one of the most memorable adventures we have ever had. Cannot recommend this game lodge highly enough!", "title": "Truly enchanting experience", "helpfulness": 3, "user": "scott719", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36170392}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "First the one disappointment. We came hoping to see wild dogs but a pride of lions had killed nearly all of them 2 months ago-nobodies fault-its what lions do. Otherwise the game viewing was great-we saw all the big 5 the first afternoon and evening from the lodge. If you were so inclined you could have spent your time game viewing from your own deck and the main lodge. However we went on a sunrise and sunset game drive each day with our great guide Brendan who was knowledegable about animals birds trees and insects . We also had a terrific tracker, Edward, who guided Brendan to unusual sightings. One of the best things about this lodge is they only have 4 guests to a vehicle", "title": "luxury in the bush", "helpfulness": 4, "user": "llewellynroger", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21101970, "likes": {"liked": "— The views of game from the lodge", "disliked": "— Getting up at 5.am"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "|The food was good, and the house wine extraordinary We ate one night with all the guests (there are only 5 suites) at the main dining table hosted by Susan the American owner, and another downstairs in the wine cellar.", "title": "PERFECTION", "helpfulness": 5, "user": "818madison", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17171985, "likes": {"liked": "— The staff to guest ratio", "disliked": "— It was perfect"}}, {"rating": 5.0, "title": "A wonderful experience", "text": "The whole complex was like a museum of mainly West African art collected by Susan-I'm going to inspect the Benin Bronzes in the British Museum next time I am in London.", "helpfulness": 6, "user": "eifionrefail", "date": "March 24, 2008", "id": 14485849}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our rooms were very comfortable and air conditioned -however do use the mosquito netting -I was careless the first night and got bitten .We did have trouble with bath water but it was fixed quickly .The internet access was the best I had on this African trip. However ,cellphones don't work in the lodge.", "title": "Fabulous", "helpfulness": 2, "user": "TTravel71", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13645553, "likes": {"liked": "— Wonderful Staff", "disliked": "— Nothing to dislike"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We spent our first 2 nights at Madikwe Hills, which we thought was amazing. Then we went to Mateya, and Madikwe Hills paled in comparison. A truly spectacular experience.", "title": "Truly Spectacular", "helpfulness": 2, "user": "JimboG", "date": "July 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5440137}, {"rating": 5.0, "title": "Mateya Safari Lodge is BEYOIND magnificent!", "text": "I recently returned from my 4th trip to South Africa. I stayed at the Mateya Safari Lodge in the Malaria Free Zone of Madikwe (Northwest part of South Africa). This is the nicest accommodations I have ever stayed at anywhere in the world. I'm well traveled and have stayed in luxury properties around the world but this ranks # 1 for pure luxury, attentive service, friendly staff, outstanding gourmet food including the presentation, and magnificent game viewing with knowledgeable drivers.", "helpfulness": 13, "user": "pjammin123", "date": "May 13, 2006", "id": 5066859}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "I have stayed in nice properties in South Africa including Mala Mala, Singita, and Leopard Hills. Each of these were nice but nothing as special as Mateya. There are only 5 very private suites . Each is huge with large bathrooms, fireplace, outdoor showers, air conditioning, private decks and plunge pools. The main lodge is full of original artwork, furniture and sculptures. There are even spectacular massive wooden doors on the main lodge and each of the suites. They did not spare any expense or overlook any detail. There is a wine cellar that I believe I overheard has 8,000 bottles of wine. Complimentary laundry and internet are included. There is a wonderful spa that offered every service you would find at any high end spa. (I had good intentions but never made it there for a massage and facial). The game drives are in comfortable land rovers with only 4 of us, not the usual 6 people. No more than 3 rovers are allowed at any one sighting so you never felt crowded and the wildlife (including wild dogs) was everywhere. Excellent game drives and I never once saw a mosquito. Mateya also offers bush walks, boma dinners and bush breakfasts. The boma dinners are outside on a round deck with a sunken firepit. It was a magical experience I will never forget.", "title": "Spectacular!", "helpfulness": 13, "user": "day1", "date": "September 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3910833}], "location": {"country": "South Africa", "continent": "Africa", "city": "Madikwe Game Reserve"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 27}, "aka": "Mateya Safari Hotel", "slim_ranking": 0.739130434783}