{"user_rating": 4.0, "review_count": 134, "name": "Maui Schooner Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Stayed at Maui Schooner 8/12/2007 thru 8/19/2007 as an exchange week with Interval International. This \"resort\" is not comparable to my ownership at the Los Cabos Country Club in Cabo San Lucas. The \"resort\" sits on oceanside but you can't get in the water because of the coral and the beach is not appealing either. The pool at the \"resort\" is quite small but plenty of room to catch some sun if you didn't want to lay on the many beaches not too far from there. The room we stayed in (B101) was clean and had all amenities listed on the description. You're on your own here with no restaurant or bar, no frills just a place to bathe, sleep, cook your own food, if you want and wash clothes. My overall experience was okay because I was in Maui and enjoyed the island very much, but when you exchange a week you expect the facilities to be comparable to what you gave up. I will probably do a little more investigating next time I decide to exchange.", "title": "Just Okay", "helpfulness": 4, "user": "txgirl07", "date": "August 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8471914, "likes": {"liked": "— clean and grounds well maintained", "disliked": "— wasn't what I was expecting"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The Maui Schooner is our home resort and by exchanging our 2006 week for one in 2007, we were able to get 2 2-Bedroom units at the same time. There were 7 of us there, celebrating a 50th wedding anniversary. The accomodations were perfect for our group of 5 adults and 2 children.", "title": "Home Away From Home", "helpfulness": 4, "user": "Tapisfun", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8124170, "likes": {"liked": "— Between 2 condos we had 4 BR, 4BA, 2 Kit, 2 Washers, 2 Dryers...all well equipped, clean, and comfortable", "disliked": "— Pretty far from our favorite snorkel spot at Black Rock"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "If glitz and glamour are what you are looking for, you won't find it at the Schooner. But if you want a clean, quiet, well equipped place where you will feel at home, this is it. Over the years, the resort has added an elevator for the B building (we all voted to be accessed for it), added storage facilities for folks with late flights or early arrivals, kept the pool and landscaping up to date, and made sure the units were equipped with anything you could think of...even beach towels , chairs and an ice chest to take to the beach of your choice. Recently they added free Wi-Fi.", "title": "Not a five star property but comfortable enough and you're in Hawaii", "helpfulness": 2, "user": "poupee1", "date": "June 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7957614, "likes": {"liked": "— the view of the ocean", "disliked": "— older property and furnishings"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "There is ocean in front of the resort, but it is where the Hawaiians used to raise fish in ponds and is too shallow for swimming, but great for walks, runs, and beachcombing. The sunsets and sunrises from the balconies in both units (one in the A building, the other in the B) were beautiful.", "title": "Great Resort", "helpfulness": 6, "user": "Cancuck", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6928653, "likes": {"liked": "— Clean and good location", "disliked": "— Small pool"}}, {"rating": 5.0, "title": "Great time in Kihei", "text": "We ate breakfast and dinner on the balconies most days. We also were able to fix healthy food that matched our dietary needs (one diabetic, two organic-food nuts).", "helpfulness": 9, "user": "GGriffith", "date": "March 4, 2007", "id": 6911876}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I stayed here for one week with apparently the best suite of the resort.", "title": "Not For Singles", "helpfulness": 2, "user": "Alohaal", "date": "January 1, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 1.0}, "id": 12216591, "likes": {"liked": "— Large room with an amazing view", "disliked": "— Isolated boring"}}, {"rating": 5.0, "title": "Maui Schnooer ROCKS!!", "text": "It was avery large unit with a very large lanai overlooking the ocean, clean and well kept. The pool/hot tub area was beautiful for sure.", "helpfulness": 6, "user": "chrisandjulie", "date": "December 4, 2007", "id": 11245322}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "These were the memorable positives.", "title": "Loved It!", "helpfulness": 3, "user": "Marquette_MIYooper", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11139209, "likes": {"liked": "— Comfortable, quiet and affordable", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Being single, I would not return here as the pool area was an overly busy, noisy kids and family zone because you can't use the beach.", "title": "Maui Surprise", "helpfulness": 3, "user": "Lee H", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8738838, "likes": {"liked": "— Location and friendly staff - great view from the A building", "disliked": "— Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "No social interaction at all and no amnetities unless you drive for miles.", "title": "Lovely time at Maui Schooner", "helpfulness": 6, "user": "JoiaVegas", "date": "August 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8472942, "likes": {"liked": "— Great all-around Time-Share experience, everything we needed!", "disliked": "— Earlier check-in, later check out (one hour each way would have been great)"}}, {"rating": 5.0, "title": "A great experience at Maui Schooner", "text": "My wife and I just returned from Maui and our one-week stay at the Maui Schooner. We booked it through a vacation club - Travel 2 Go - and it only cost us $398 for the full week. The unit was on the ground floor in the building nearest the S. Kihei Rd but that did not pose a problem,,, although you knew when the trash trucks came around (assuming you were at the resort at the time). The unit was a perfect size for 2 people. Airflow in the bedroom was lacking but sufficient using the ceiling fan and standing fan together. The lanai was great as you could walk right out on the lawn w/o going up/down stairs and the pool was within 200 feet -- still far enough away to avoid the noise from kids in the pool. The unit was fully supplied with everything one would need including W+D (rather noisy), iron+board, hair dryer, 2 beach chairs, beach towels, and small, well-insulated cooler. The front desk clerks were friendly and helpful, and there's an activity marketer onsite to book activities at discount.", "helpfulness": 11, "user": "daner49", "date": "August 11, 2006", "id": 5598298}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My inlaws have a timeshare at this resort and invited us along for the trip. I highly recommend staying here versus any hotel! We stayed in a two bedroom timeshare which was perfect! We had a kitchen, 2 full bathrooms, a great view, it was clean and we had no problems whatsoever. For the value, staying in a place like this is better than any hotel just because all you really need staying in Maui is a bed and someplace to rest after a fun day full of activties! Pool is fine, used it twice and while there isn't really a beach in front of the resort, there are so many to chose from that are nearby! Just hop in the car and go! I was a little aprehensive staying here before the trip because I am a \"hotel\" kind of girl but I would only stay here when going to Maui from now on. It's so easy and a great value.", "title": "Great place~", "helpfulness": 3, "user": "funwifey05", "date": "February 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6833440, "likes": {"liked": "— Location, cleanliness, room set up", "disliked": "— No beach"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at the Maui Schooner from Dec 15-21 via a timeshare exchange.", "title": "Nice place", "helpfulness": 7, "user": "BvilleTraveler", "date": "January 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6569053}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Overview: From the looks of the place this is a small condo conversion....it has 2-3 buildings, a pool, several BBQ grills, well tended grounds, Oceanfront location. We were in a 2 BR unit facing the ocean. This is not a full service resort, rather it's like staying at a (very neat) friend's apartment while they're away. The Island of Maui is terrific and offers many enjoyable activities...we drove the Hana Hwy, hiked to several waterfalls, snorkeled several times (including an excellent trip to Molokini), watched the sunrise from the top of Haleaka volcano, and took a sunset cruise.", "title": "A great experience", "helpfulness": 5, "user": "mstravelnut", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6555060, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Pros: (i) The unit was spacious and well maintained with linens changed and cleaning service on Tuesdays. (ii) The unit is well equipped with a full kitchen, laundry facilities, and beach towels/beach chairs. (iii) Kihei has many shopping and dining options.", "title": "liked so much we bought a timeshare", "helpfulness": 3, "user": "lyndaray", "date": "December 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6333527, "likes": {"liked": "— clean and had all the home amenities needed for a comfortable week stay"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Cons: (i) While this is an Oceanfront unit (the water is approx. 200 yds away) the beach is not accessible for swimming or watersports. (ii) The room decor is so-so, sort of a 1980's rattan and pastel theme. (iii) North Kihei is somewhat commercial and lacks the resort feel & beauty of other parts of the island. Many destinations require a 20-45 minute drive, though we didn't mind.", "title": "Maui Schooner .... not so good...", "helpfulness": 9, "user": "Realitychk", "date": "October 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5961668, "likes": {"liked": "— the immaculate grounds and flora", "disliked": "— the unit itself was outdated and inadequately cooled and maintained"}}], "location": {"country": "United States"}, "variance": {"poor": 12, "average": 21, "very good": 46, "terrible": 3, "excellent": 52}, "aka": "Maui Schooner Hotel Kihei", "slim_ranking": 0.338709677419, "description": "Maui Schooner Resort is a beach-front property with sprawling ocean views and charming Aloha hospitality. The resort boasts a tropical, Hawaiian resort atmosphere. Relax in your one, two or three bedroom suite, spacious enough for a couple on a romantic getaway or for the family. Unlike the typical hotel room, The Schooner's condominiums are equipped with a full kitchen, separate living room and all the amenities necessary for a comfortable stay in Maui. Enjoy beach side tennis courts and a an expansive scenic stretch of Maui sand and surf."}