{"user_rating": 5.0, "review_count": 281, "name": "Maui Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Wonderful, accommodating service. Beautiful private room & lovely shared space. Delightful breakfasts. Perfectly clean. Recommend to anyone. Can't wait to return.", "title": "Best ever", "user": "Karla J", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124743988}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second trip to the Maui Guesthouse, the last time six years ago. The quality was great then & has only improved since. The house is in a residential neighbourhood, about a 20 minute walk (or two minute drive) to the heart of Lahaina. It falls into the don't judge a book by its cover category. The neighbourhood is nothing special to see, nor is the guest house itself on first approach. But once inside, it is magnificent, with stained glass doorways, tiled flooring, and a personal soft tub for each of two back suites. Breakfast was ample - fresh fruit, cereal, bagels & English muffins. There were also store bought muffins which we didn't indulge in. Would have preferred locally made banana bread, but it's a small quibble. The staff are outstandingly helpful and fun. You immediately feel part of a family, but not in an intrusive way. We particularly liked the 9:00 pm quiet time. We could read quietly in our rooms and turn in at 10:00 pm without hearing anything but the sound of the geckos....The only true complaint was a squeaky sliding bathroom door & rather loud toilet (strange as that sounds). We'll be back!", "title": "Wonderful place to stay", "user": "Portnoff", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124550591}, {"rating": 5.0, "title": "Relaxing Maui Inn", "text": "We stayed at the Maui Guest House for 4 nights earlier this month and had a wonderful time. The people (particularly Amanda) were very friendly and went out of their way to make us feel at home. We liked being within a very short drive of town, and the hot tub in the room was fantastic, particularly after long days spent diving and nights walking around Lahaina. I would highly recommend, and will return when I come back to Maui. Thanks for a great weekend!", "user": "Lisa S", "date": "February 9, 2012", "id": 124366214}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This was our first trip to Maui, and staying at Tanna's Maui Guest House was a wonderful experience. Her home is amazing and in a quiet location. Tanna is super helpful, a lot of fun, and very, very attentive to everyone's needs. Amanda had just arrived from Alaska to help Tanna, and she fit in right away. If we return to Maui, we'll stay here again, for sure! :)", "title": "Fantastic B&B, Fantastic Service", "user": "Irene V", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124065084}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Irene & Len, Smithers, BC, Canada", "title": "GREAT PLACE TO STAY!", "user": "danniedow", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123952394}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There is not much to see from the road when you pull up so we were thrilled when we walked into the Maui Guest House! It is a piece of Paradise tucked off the main Hywy. The website does not do justice to the size and quality of the house itself nor the beauty of the stained glass windows and the tile turtle floor in the center of the house. They offer free range of the kitchen and a huge selection of food for a continental breakfast and dishes and condiments for any other in house eating you decide to do. There is a side hallway with an available washer and dryer with cupboards full of laundry supplies, picnic supplies, and all assorted sundries that you may have forgotten (lotion, suntan lotion, polish remover, sunburn ointment,etc). The shelves on the other side of the hall are stacked with nice huge beach towels. Extra towels are also stacked in the bathroom of each room. The closets hold a fan, ironing board, laundry basket and enough hangers for a month's stay. The room has nice adjustable lighting and speakers for the huge wall attached TV next to each side of the bed which allows a nice level of sound without blasting out into the house's common area. The jacuzzi in our room was in a seperate screened in lanai with both a sliding glass and screen door. This room and the jacuzzi were spotless; the afternoon and night breezes were fantastic if you wanted to use this as a reading room and the screen door allowed the breeze to flow into the bedroom.", "title": "A Paradise Tucked Away", "helpfulness": 3, "user": "PPTA", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130473496}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The deck area has tables and chairs as well as a grill if you want to BBQ and the sweetest salt water pool just perfect for a cool dip!", "title": "Cozy, clean, and everything we could ask for.", "user": "BruceMacD", "date": "May 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 130380504}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Beach chairs and all necessary snorkel gear as well as boogie boards are available; with the strip of beaches with in 5-10 min drive, these were well used.Snorkeling at Airport Beach was our favorite morning spot!", "title": "Aloha", "helpfulness": 1, "user": "cabanaroad", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128377568}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The help at the House while we were there were 2 of the nicest folks we have met: Barb and Jim were helpful without being in our way and yet always there to listen and share stories and information when we wanted to talk.", "title": "Very helpful staff!", "user": "MnVH", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127363164}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We truly were sad when we had to leave and if we ever get another trip to Maui will be sure to stay here again.", "title": "Maui's Little Secret", "helpfulness": 1, "user": "BlackMurano", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127041694}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We just spent 10 nights at the Maui Guest House and we completely enjoyed our stay. The staff was wonderful! Our room was nice, quiet and very clean. It was wonderful to have access to the kitchen and laundry....when we left it was like saying goodbye to family (that you enjoy visiting)! Can't wait to go back....", "title": "Great Place To Stay", "user": "Deanna R", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125917476}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We stayed 3 nights and then came back at the end of our trip. The B&B was lovely, great room and bath- comfortable, clean and perfect. We never had time to use the jacuzzi in our room, but it was there for us ready to go. Tanna does a great job. Breakfast was there for us even when we had to leave a little after six. There were beach towels to take with us as well as coolers. A washer and dryer which came in very handy. We drove the road to Hana and there was a CD to take with us to orientate us along the way. She pointed us in the right direction for dinners and was font of knowledge.The last night we came back late and showered in the guest bath before leaving for the airport Would I recommend her place- oh yes! The only reason I didn't give it excellent was the breakfast could use a little boost and it would be great to have cookies or something when you come in after a day of activities.", "title": "Great way to start our trip", "user": "beartrac", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125824966}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "My husband and I stayed at the Maui Guest House for eight days from 02-28 to 03-01-12. Our room was always immaculate and so was the whole place. We had access to a great kitchen and the owner certainly knew her stuff when it came to snorkel gear (which they had tons of). Our room also had a salt water jacuzzi, which is one of the reasons I picked Maui Guest House. Being a holistic practitioner, I don't get into anything that has chlorine, so I really appreciate having that in my room and a pool outside with the same. Also, the drinking water was filtered, so that was fantastic. Oh, and every morning, there was this great array of fresh fruit on the table to partake in. I would stay there again, and I highly recommend staying here if you are in the area.", "title": "Enjoyable and Near Everything", "user": "Judith P", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125818941}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed here for three nights for a terrific price! It is an adorable, clean, homey, but beautiful B & B in a residential neighborhood right near downtown Lahaina Town, which included free parking! The common area included a piano, free internet and free phone calls (!), & couches. There was a cute pool with lounge chairs, tables, a BBQ, and hammock in a fenced-in front yard. We had our own hot tub on our own screened in porch! Included so many free amenities: towels for the beach, beach chairs, snorkel equipment, hospitality bathroom (our plane was later), breakfast, of course, AC and fans, small fridge, spacious clean room & bathroom, one block up from the beach and across the street from Front St.! Tanna, Amanda, Tami, and Barbara were all terrific! We can't wait to go back!", "title": "Wonderful B & B!", "user": "calpeach", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125259997}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Tanna runs a very good operation. She serves a good fruit plate at breakfast, with the usual accompaniments. The best things: she knows the island intimately, and has good advice (and lots of stories) to give; she is very generous--providing water, iced water bottles, coolers, beach chairs, boogie boards, snorkel gear, beach mats and towels, hats, binoculars....We enjoyed our week there.", "title": "Good Maui intro", "user": "Don03", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124841062}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I had the chance to meet Tanna, Barbara and Amanda while I spent 5 days in Maui. They are a great team. What I really enjoyed were:", "title": "The aloha spirit welcomes you as you get in", "helpfulness": 1, "user": "2012Ana", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126867394}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "-the whole house was spotless", "title": "Without a doubt the best place to stay on Maui", "helpfulness": 2, "user": "Greg R", "date": "March 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126523097}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "-the room was big and confortable and the bathroom very nice and modern (lots of towels)", "title": "Wow! They do it all!", "helpfulness": 5, "user": "BTA", "date": "March 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 126467617}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "-the private lanai very welcoming and relaxing", "title": "paradise in paradise", "helpfulness": 1, "user": "cam w", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125964258}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "-the pool and patio were great to take a drink or to do a BBQ", "title": "Central to everything!! OMG!", "helpfulness": 1, "user": "recoveryroom", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125917877}], "location": {"country": "United States"}, "variance": {"poor": 5, "average": 3, "very good": 20, "terrible": 0, "excellent": 253}, "aka": "Maui Guest House Hotel Lahaina", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Nestled in a quiet residential neighborhood between historic Lahaina and the beach resorts of Kaanapali, The Guest House is the perfect location as your “home” to explore the island of Maui. Just a block from Wahikuli Beach, enjoy phenomenal snorkeling.Guest rooms are setup for maximum privacy, each with their own hot tub, yet there is plenty of space to mingle. Full breakfast, kitchen, laundry, internet access, salt water pool, discount car rentals and activities."}