{"user_rating": 4.5, "review_count": 938, "name": "Maximilian Hotel", "reviews": [{"rating": 5.0, "title": "fantastic location, great breakfast", "text": "having read all the guidebooks, i had expected prague to be swarming with tourists and it was on all the main routes, but walk for 5 mins outside the main tourist zones and it was quiet and relaxed. The hotel is 5 mins walk from the old town square, in a quiet street but with lots of restaurants to the right and left (try orange moon if you like thai just 2 mins away - delicious)- at night I couldn;' hear a thing and having stayed in plenty of european cities where you can hear the racket even through ear plugs, this was a real treat.", "helpfulness": 4, "user": "baphead", "date": "July 4, 2006", "id": 5423073}, {"rating": 5.0, "title": "great location, great staff,great breakfast", "text": "Very modern in style - a bit too much for me really, as it lacked a bit of soul I thought, but you do get a hotel that is exactly as described. Everything else I couldn't fault - staff were polite, honesty bar and free tea/coffee and pastries were a really nice touch when we wnated a quick pick me up in the afternoon, breakfast hours and choice great.", "helpfulness": 4, "user": "dreamermil", "date": "July 1, 2006", "id": 5415690}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Woud definately stay here again", "title": "Lived Up To Expectations", "helpfulness": 7, "user": "AshWat", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5331096}, {"rating": 4.0, "title": "Wonderful Boutique Hotel", "text": "My wife and I spent four nights at the Maximillian recently. It suited us perfectly! The room was comfortable with a small balcony overlooking a quiet square. The Hotel is located very close to the Old Town square but is very quiet and calm. The staff was genuinely helpful and showed extra initiative in helping us with our car rental. I don't normally get excited by breakfast but the buffet at the Maximillian was very good. There was an excellent assortment of fruit, cereal,pastries and hot items--served in very pleasant surroundings. We also got coffee brought to our room while we were waking up. A really pleasant stay in a great location.", "helpfulness": 10, "user": "knspr", "date": "June 6, 2006", "id": 5317034}, {"rating": 5.0, "title": "Great location", "text": "We booked this hotel after reading numerous favourable reviews on Tripadvisor, and the best price for us was obtained using the hotel’s own website. The Maximilian is very well located, only a short walk from the Old Town Square, with all the main sights within walking distance. Bear in mind when packing footwear that many of the pavements are cobbled.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 2, 2006", "id": 5292070}, {"rating": 5.0, "title": "Great hotel", "text": "Stayed in the Max' from 29th December till 1st January 08. Couldnt find fault with the hotel, fantastic location a 5 minute stroll from the old town square - which is really beautiful at Xmas with the tree and the lights and the markets... We did venture to Wencalas Square which is awful - you could be in any country in the middle of stag / hen night parties - stay away if you want to see the real Prague. The street the hotel is on is a bit of a back street, and at first I felt a bit weird and didnt think id be happy to walk it alone - but its fine, tons of people around all the time and even when its dark & quiet - there's no question of your safety - i couldnt say the same for the always packed Wencalas Sq though.. The hotel is spotlessly clean, the beds are extremley comfy - we had room 604 (i think) which is in the \"red house\" its the block at the back of the hotel, the lift only goes to the 5th floor and you have to get out and walk up the remainder of the steps!! but its only about 10 steps.. We could see the old town square churches from our room etc. The staff were friendly and helpful. We booked the car to pick us up from the airport & bring us back - its expensive but handy. The hotel is actually very quiet, and you never really see any other guests. The honesty bar is ok but extremley quiet!! We ate in Chez Marcel next door - good food but a slightly limited menu. Prague is strange in that people bring their dogs into restaurants - kinda odd!! there is a good (cheap) bar just around the corner from the hotel - left out of the hotel & first left again - small looking pub on the right hand side, friendly owners. if you go off the beaten track you'll find much nicer & cheaper restaurants, be warned - wine is very expensive in Prague. Some of the best food we ate was from stalls in the square!! Overall a fantastic experience, we would defo return to Prague and wouldnt even consider booking anywhere other than the Max...", "helpfulness": 2, "user": "Dimples", "date": "January 28, 2008", "id": 13062173}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "I had a wonderful stay at the Maximilian for three nights in May, 2007. This is a beautifully designed hotel tucked away on a small cobblestoned square in Stare Mesto, very close to the Josefov Jewish Quarter. The neighborhood is quiet and peaceful, removed from all the hustle bustle of Old Town Square and Wenceslas Square yet both are a short 10 minute walk away. The hotel is conveniently located between two subway stations (Staromestska & Namesti Republiky) but they are really not necessary as all the major attractions are easily within walking distance. Dlouha Street, which winds behind the hotel, is a direct route to Old Town Square and is lined with great restaurants, cafes, and even a couple all-night convenience stores! My single room was clean and quiet with a sleek, contemporary and very efficient design. The same design is carried over into the \"library\" and other sitting areas. The hotel also offers free Internet access and PC usage in its business center which is a big plus. All staff, including the front desk people, bellhops and restaurant staff, went out of their way to make sure my stay was pleasant and comfortable. When the first room I was shown to was a bit too warm for me, I casually mentioned it to the bellhop and he immediately called down to the front desk and had it changed! There was also a complementary bottle of wine and plate of fresh fruit waiting in my room for me! The awesome buffet breakfasts featured an incredible array of hot and cold foods, fresh fruits, meat and cheese platters, homemade yogurts, etc all served in a contemporary, glass-enclosed atrium. This is truly one of the nicest hotels I have ever stayed in and I look forward to returning again.", "title": "Quiet, Comfortable Stay - Walk to Everything!", "helpfulness": 2, "user": "kevinkoke", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13016031, "likes": {"liked": "— Quiet location yet a close walk to everything", "disliked": "— Room was sometimes a bit warm but easily remedied"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "If you are going to Prague and you want to stay in an amazing boutique hotel with absolutely the best location, look no further then the Maximilian! I absolutely believe that the Maximilian Hotel is the best lodging available in Prague and could not have been happier with our stay there! We were able to secure a great rate on hotels.com (about $240 a night, which was over the New Year's Eve holiday), so I feel like we really lucked out!", "title": "FABULOUS Hotel! Wow, wow, wow!!!", "helpfulness": 2, "user": "Kimberly530", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12823927, "likes": {"liked": "— Location, location, location!", "disliked": "— Nothing - I liked it all!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The boutique hotel is beautiful inside - comfortable king size beds with great bed linens, nice pillows, and plenty of towels in the bathroom. And the rooms are so clean! When I had lost an item I brought along I moved furniture looking for it and noticed just how clean the room was. Also, the hotel provides free in-room high-speed internet, which we took advantage of every day.", "title": "Excellent", "user": "bulldogsfight", "date": "January 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12787648, "likes": {"liked": "— size of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel has an Honesty Bar where you can mix yourself a drink (and then just record your room number) and a small library across the way with wireless internet. I preferred to be in the library area because it was smoke free; the Honesty Bar was not.", "title": "One of the best!!", "user": "sg1973", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12660612, "likes": {"liked": "— everything", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The Maximillian hotel was a little oasis of modern luxury right in the heart of the old town in Prague. The reception is cool and bright, as are the rooms and the breakfast area. In the bedroom there are all the amenities you need for a comfortable stay, and I could not get enough of the gorgeous bathroom. I've never seen such a huge shower head! White bathrobes, jelly babies on your pillow and complimentary slippers complete the picture. Breakfast looked absolutely incredible but was slightly pricy (16€) and wasn't included in our booking. Check ahead, but there is Chez Marcel next door who do a lovely continental breakfast for a few euros. Overall a fantastic stay in a wonderful place.", "title": "Modern Luxury in the heart of Old Prague", "helpfulness": 3, "user": "parislights", "date": "June 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7849106, "likes": {"liked": "— The modern design of the hotel and the spa", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I would love to stay at this property again, I won the bid on luxurylink.com. Great location, excelletn breakfast, good service, nice rooms. Loved Prague too!", "title": "great stay in prague", "user": "pjs536", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7840673, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I chose this hotel because of all of the great reviews on trip advisor, so I thought I should re-pay the favor! It lives up to it's great reputation - nice, modern room with comfortable beds, modern bathroom, very clean. The staff was very nice, helpful, and efficient. Also, the hotel has great amenities such as an honesty bar with free coffee and tea and a computer with free internet access. They also have a great library with current newspapers and travel books. I will definitely recommend this hotel to my friends and if I ever return to Prague I will return this hotel!", "title": "Nice, comfortable, great location!", "helpfulness": 1, "user": "Batcindy", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7752415}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I took my boyfriend to Prague as a surprise for his birthday in April 07. I wanted to stay somewhere special and the Maximilian certainly delivered that! The room was excellent, very spacious, all the facilities I wanted. Complimentary wine and fruit was left for us on arrival. The staff were extremely friendly and helpful, nothing was too much trouble for them. The breakfast was the best breakfast I have ever had, with everything there from fruit, pastries, english breakfast, numerous fruit juices, cheeses, breads etc. This hotel is definitely worth the money, if you can afford it then I definitely recommend you try the Maximilian", "title": "Fantastic hotel", "helpfulness": 2, "user": "toptotty11177", "date": "June 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7742055}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We have just returned from a three night stay in Prague. We booked the Maximilian direct with the hotel as, at the time, that was the best rate we could find (under their special offers).", "title": "Fantastic hotel", "helpfulness": 2, "user": "toptotty11177", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7724422}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "phoned ahead about arriving a day early. Staff advised that we could arrive early but only a twin room was available and we could switch to a double for the remaining three nights.", "title": "Location,Modern,Clean", "helpfulness": 1, "user": "steve62", "date": "May 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7594999, "likes": {"liked": "— small size", "disliked": "— view from room was non existance but lots of light and high ceilings"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "upon arrival a few hours later they were able to get us the double so we wouldn't have to move. It was much appreciated.", "title": "A brilliant hotel in the centre of Prague", "helpfulness": 2, "user": "RayMaidenhead", "date": "April 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7485076, "likes": {"liked": "— Beatifully situated and excellant", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "clean modern rooms, excellent internet with two terminals and printer just off the lobby, beautiful breakfast room with lots of natural light, an afternoon honor bar with complimentary coffee and tea, parking was available in the hotel, staff was courteous but not overly friendly.", "title": "Nice stay at Maximillian", "helpfulness": 3, "user": "SaltyW", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7362657, "likes": {"liked": "— Modern,very clean,good staff", "disliked": "— Old style tv with limited channels"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "5 min. walk to old town square, actual location was a bit away from the crowds which can be a plus or minus depending on your perspective, safe neighborhood at all times of day and night", "title": "Good and Bad", "helpfulness": 2, "user": "AlohaAll", "date": "April 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7313972}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "IF you like the website it is a great representation of what they have to offer", "title": "Superb service, great location", "helpfulness": 2, "user": "Psychostar", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7269994, "likes": {"liked": "— Modern minimalist design", "disliked": "— Air conditioning not up to the job"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Amazin hotel!", "title": "Brill!", "helpfulness": 1, "user": "Christophe_and_Tina", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11989954, "likes": {"liked": "— high class! value u for money", "disliked": "— was a bit hard to find at first"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "would recommend 100% , staff great, rooms great.. excellent", "title": "first class Maximilian", "helpfulness": 2, "user": "movingmax", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11985570, "likes": {"liked": "— modern hotel with lots of facilities and location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stayed three days at the maximilian for our wedding Anniversary.", "title": "glad we picked this hotel", "helpfulness": 1, "user": "rafinelson", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11390887, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled with friends", "text": "Took the prague Airport Shuttle as recommended by other reviewers and found the Driver very informative and friendly, Suggested some restaurants to visit and were not dissapointed.", "title": "Gorgeous Luxurious Hotel in Prime Old Town Location", "user": "MadelineNewYorkCity", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11287658, "likes": {"liked": "— The location is amazing!", "disliked": "— The price"}}, {"rating": 5.0, "title": "Couldn't have been better!", "text": "The Restaurant Strelecky Ostrov on the Island overlooking the river downstream from Charles Bridge served more traditional food(very romantic) wise to book in advance as seemed popular.", "helpfulness": 1, "user": "oneyear", "date": "November 25, 2007", "id": 11039037}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Just back from a great weekend to prague. We were there for a wedding and stayed here for two nights. Very well located just off the main square (far enough eway to be quiet - silent in fact at night) but close enough to be convenient. Great rooms - very clean with huge beds that were just so comfortable we would gladly have made off with them and brought them home if theyd have fitted through the doors. Free internet, great breakfasts. the spa looked great but was sadly fully booked for the duration of our stay so pre book if thats for you.", "title": "Great Hotel - most comfy beds in the world", "helpfulness": 13, "user": "wipeout75", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5502033, "likes": {"liked": "— beds!", "disliked": "— no pool"}}, {"rating": 4.0, "title": "A little gem in a great location", "text": "We stayed at the Maximilian 8 - 12 July and it was hot - unseasonally so we were told. The hotel couldn't be in a better location. Peace and quiet yet 5 mins walk from the Old Town Square. The hotel is spotless and the staff helpful, if a little dour but then that seems the norm with Prague staff. The breakfast is excellent and offers everything including superb service. The hotel is a little souless but if you want the reassurance that you have a very comfortable hotel to return to at the end of a very tiring day - this is the one to choose. We arranged for the hotel driver to collect us from the airport and it was worth every penny. There are countless restaurants and bars and we cannot recommend the Old Town enough if you wish to avoid the stag/hen nights. Wenceslas Square is awful and to be avoided unless you like a rowdy night out. Prague is a wonderful place to visit and we can't wait to return. We will definitely book the Maximilian again. Great value for money", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 18, 2006", "id": 5478316}, {"rating": 4.0, "title": "Great 4 Star hotel", "text": "Stayed at the Maxmillian Hotal in Prague from the 09 July to 12 July 2006.", "helpfulness": 6, "user": "P&SSmith", "date": "July 13, 2006", "id": 5461556}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "The hotel is ideally located and within 5 minutes from the Astronomical Clock and Stare Mesto. Although the hotel did not have a restauarant of its own, there are many restaurants around the vicinity that are great. Try the Dahab (Turkish food) on the street next to the Maxmillian - Great food and they have a belly dancer on Friday nights!", "title": "great little hotel no alarm clocks", "helpfulness": 6, "user": "akworldtraveler", "date": "July 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 2.0}, "id": 5457284}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The hotel is very clean and minimalist - the standard room was bright, clean and had everything you would need for a short stay. They even gave us complimentary fruit and a bottle of champagne when they realised it was my birthday - we had gone out for lunch and returned to find this in our room - a most pleasant and thoughtful surprise.", "title": "Functional and Clean", "helpfulness": 2, "user": "Samantha314", "date": "July 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5424486}, {"rating": 5.0, "title": "Don't consider anywhere else!", "text": "We chose the Maximilian after reading reviews on Trip Advisor. It was wonderful. A charmingly authentic exterior led to a modern, functional but tasteful interior. The staff were delightful and our room was comfortable and spacious. The bed, which was huge, proved to be conducive to a good night's sleep and the bathroom was great with a superb shower. There was open plan hanging space and a safe which was fine once you got the hang of it. The breakfasts were fantastic - you name it , they had it (right down to Actimel, of which a surprisingly large number and variety of nationalities were taking advantage) and you could have freshly cooked food too if you needed it! Depending on your capacity, you could have eaten enough healthy food to keep you going most of the day! There was a pleasant lounge with games, newspapers and reference books. There was a second lounge with complimentary tea and coffee and an honesty bar. The hotel is situated in a quiet area opposite St Castellus Church and just a couple of minutes from St Agnes Convent which houses a fantastic collection of medieval art - don't miss it. It is less than five minutes walk to Old Town Square. Don't be tempted to stay near or on Wenceslas Square - it is pretty horrid! Yet all of Prague is very compact so it is easy to walk to see all the main tourist areas, from this hotel, if you are reasonably 'sightseeing fit'.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5232382}, {"rating": 5.0, "title": "Fantastic Hotel-One of my Favorites of the Trip.", "text": "We stayed 5 nights in the Maximillion and have only good things to say about the hotel. The rooms are very clean and modern, the bed was huge and comfortable, they have free internet access in their business center with two computers, a library and lounge; and a great breakfast. Great value, I would definately stay here again or recommend the hotel to a friend. Great location for everything, right off of Old Town Square.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 20, 2006", "id": 5183976}, {"rating": 5.0, "title": "Top Notch", "text": "My wife and I recently stayed in the Maximillan to celebrate out first wedding anniversary. We stayed for five nights and cannot fault this hotel, the customer service was so good. They even up graded us to a suite for 4 of the 5 days of our stay. It is within walking distances of the old town square and there are lots of bars and restaurants nearby. We found the Bombay Cocktail bar had a great atmosphere. The hotel was very very clean and the beds comfortable. The breakfast was very good with everything you could ask for.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 14, 2006", "id": 5068121}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Would I stay there again ? Without a doubt,", "title": "Best hotel and best location in Prague", "helpfulness": 9, "user": "Stoke-on-Trent Member", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5038305}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Hotel taxi service I would recommend also.", "title": "perfect choice", "helpfulness": 4, "user": "Lemy", "date": "April 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5014178}, {"rating": 5.0, "title": "Excellent Hotel", "text": "We have just recently spent 3 days at the Maximilian. The hotel is in an excellent location, about 5 mins walk from the Old Town Square, which is the heart of the Old Town.", "helpfulness": 12, "user": "jbw64", "date": "April 25, 2006", "id": 5007434}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The style of the hotel is modern. The rooms are very good, clean, comfortable and quiet.", "title": "The Great Maximilian", "helpfulness": 6, "user": "plannack", "date": "April 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4988909}, {"rating": 5.0, "title": "Hidden Treasure", "text": "The breakfast is excellent, with the presentation of the food being superb, ie neat rows of fruit segments on a large plate instead of everything in a large bowl.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 7, 2006", "id": 4947228}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The staff are very helpful and knowledgable. We went to a lovely restaurant, hergetova cihelna by the river on their recommendation.", "title": "Maximilian is a Gem!", "helpfulness": 9, "user": "karussell", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4721907}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "On a slightly negative side, There is only an honesty bar in the hotel which is very quiet. If you are looking for a lively bar, then this is not for you.", "title": "Wonderful hotel!", "helpfulness": 3, "user": "RWAppleWannabe", "date": "March 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4692886}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "This was a good boutique and we had read about its sister hotel the Hotel Josef. The Josef was booked so we went with this and it was a great stay.", "title": "Interesting boutique hotel", "user": "kridot", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13825033, "likes": {"liked": "— lounge/honor bar downstairs", "disliked": "— bell staff was a little too"}}, {"rating": 5.0, "title": "Stay in 206", "text": "The design reminded us of NYC boutiques (small hallways and weird hallway/entry point). The rooms were clean and well designed as was the entire lobby level. Breakfast was good and the location is pretty good for access to major tourist sights.", "user": "SGlowing", "date": "February 22, 2008", "id": 13752965}, {"rating": 4.0, "title": "Great Place!", "text": "Bottom floor has an asian spa, but you can hear footsteps and movement upstairs from the restaurant.", "helpfulness": 2, "user": "Michelle&Hol", "date": "February 18, 2008", "id": 13643541}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Stay in room 206! My husband and I came here for a \"babymoon.\" I was about 20 weeks pregnant, and I couldn't have asked for a more perfect spot to relax and enjoy. The location of the hotel is ideal. In the middle of a quiet, yet happening part of town. We were able to be away from the crowds, but close enough to them to walk there comfortably. I lived in Prague several years ago, and our return trip there was more than I could have asked for. The room itself was beautiful. We had a door that opened onto our own little balcony and it was just perfect.", "title": "Fantastic hotel, well worth staying here!", "helpfulness": 1, "user": "JellyBaby24", "date": "February 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13297769, "likes": {"liked": "— It was so modern and really gorgeous, plus quiet but excellent location", "disliked": "— Staff were business-like, not very friendly, but still treated us well all in all"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "My husband and I have just spent 3 nights, over Valentines Day in Hotel Maximillion. Can't really fault the hotel apart from the honest bar prices when we checked out, very, very expensive.", "title": "A good hotel", "helpfulness": 2, "user": "blackeyes", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13084146, "likes": {"liked": "— Quiet room", "disliked": "— Smoking is allowed in certain areas"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We just returned from a great 5 days in Prague and 3 days in Zurich and found the Maximilian Hotel to be more than we expected. A great deal from LuxuryLink that included one of the best breakfast buffets I have had in many years of traveling as well as an authentic Thai massage.", "title": "An Unexpected Find!", "helpfulness": 2, "user": "MtnBoy", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7714801, "likes": {"liked": "— Everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was a Junior Suite and just the right size for 2 with clean and ultra modern fixtures and a comfortable bed. The staff was helpful, friendly and made you feel like a regular the first day. Being within a few blocks of everything, including the main train station, Old Town Square, the Charles Bridge and many great restaurants made this the perfect place to explore Prague for our first visit.", "title": "Exceeds expectations", "helpfulness": 2, "user": "SallyDenver", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7713889, "likes": {"liked": "— service", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "Not to be missed were the Thai massages and the salt float in the private chamber..... a great way to add relaxation and get the kinks out after a hard day on the cobblestone streets.", "title": "Great breakfast", "helpfulness": 1, "user": "fussyUk", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7693429}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My fiancee and I just returned from 5 days in Prague and stayed at the Maximilian Hotel. It really met or exceed my expectations in all areas. Kind of reminded me of a \"W\" hotel with its sleek, modern and clean interiors. The staff is friendly and accomodating. Our last morning there we had a 5:30AM departure and they even packed us a breakfast to go.", "title": "Nice modern amenities and a great location", "helpfulness": 1, "user": "Appraiserdewd", "date": "May 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7636331, "likes": {"liked": "— The location and the modern decor", "disliked": "— I could not find a fault with this hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "hotel in the centre of the old part of town very close to most things for walking.Been updated recently to modern style in an old building.Good sized rooms with all mod cons.Quiet which is important,Prague is a busy place and can be noisy with stag parties.Staff spoke very good english (I'm afraid our Czech was minimal to say the least)and were extremely helpful.", "title": "Fantastic jewel so close to Town Square", "helpfulness": 2, "user": "Phams", "date": "May 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7632912, "likes": {"liked": "— Facilities", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We loved everything about the Maximilian. It is in an excellent location; about 3 blocks from the main square. We walked everywhere. Prague is a beautiful city!!!", "title": "Loved the Maximilian", "helpfulness": 2, "user": "BackTooSoon", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8220831, "likes": {"liked": "— Modern look and feel of the hotel"}}, {"rating": 4.0, "title": "Great Hotel", "text": "The rooms are beautifully decorated and spotless. We had two rooms and one was larger than the other, but even the smaller one was spacious. There was also plenty of storage space. The breakfast was plentiful and offered a great variety of foods.", "helpfulness": 3, "user": "LeFlaneur", "date": "July 16, 2007", "id": 8127287}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "This is really a wonderful little hotel in a prime location. We had a great room on the top floor with a sloping roof and views of the rooftops of Prague. Beautiful bathroom etc.", "title": "Prague is just magical!", "helpfulness": 2, "user": "Heline", "date": "July 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8118954, "likes": {"liked": "— location", "disliked": "— not enough electrical power"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "Two complaints: there is no separate concierge (the front desk people handle everything) which is fine, and all were friendly and helpful, except when I asked where some good art galleries (to buy) were, the response I got was \"I don't know, I don't buy art.\" When I travel I don't expect hotel staff to personally shop in the stores I'm looking for or eat in all the fine restaurants, but it helps if they at least know where they are to recommend to their guests.", "title": "A perfect choice", "helpfulness": 2, "user": "5fortravel", "date": "July 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8117988}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The other thing I would note is a warning: check whether breakfast is included in your rate. We booked through Expedia and it was not; upon check-out I was charged the equivalent of US$50 per day for two breakfasts--which seemed pretty steep to me. The hotel's taxi service to/from the airport is also about 2x the rate of a normal taxi; you can just ask them to call a normal (AAA) taxi to save a few $$.", "title": "Modern hotel, great location.", "helpfulness": 2, "user": "InMiami", "date": "June 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8017090, "likes": {"liked": "— Location and great breakfast, modern decor", "disliked": "— Some of the front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I was considering what I could add to the range of already highly accurate reviews posted on this hotel and decided on the following:", "title": "Perfect location for a small group outing", "helpfulness": 2, "user": "LauraJHodson", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15971888}, {"rating": 5.0, "title": "The perfect place to stay in Prague", "text": "The service in the breakfast room is perfectly pitched- lots of staff, all eager to assist without being overly attentive- absolutely faultless. We love the tea caddies- look out for the 'Caravan' tea", "helpfulness": 2, "user": "Aar-Kar", "date": "April 27, 2008", "id": 15401407}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "made me chuckle and well it does taste a bit, er, gravelly (is that a word?).", "title": "Very nice place to stay", "user": "StubbingtonBob", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15054575, "likes": {"liked": "— Clean and tidy", "disliked": "— Having to go to sister hotel for breakfast on the last day!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The ambience is extremely relaxing- the hotel has a beautifully calm atmosphere.", "title": "Could have been better.", "user": "Traveler145", "date": "April 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14851316, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The design of the hotel is superb without drawing attention to this fact- the attention to subtle detail is really something.", "title": "Fantastic Trip to Prague - Perfect Hotel and Location!", "user": "buckiz1980", "date": "February 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13862814, "likes": {"liked": "— Location", "disliked": "— No complaints!"}}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 10, "average": 20, "very good": 212, "terrible": 3, "excellent": 693}, "aka": "Prague Maximilian Hotel", "slim_ranking": 0.0267459138187, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A small luxury hotel designed by Eva Jiricna, provides a stylish, relaxed and cozy atmosphere in the heart of medieval Prague: 1 suite, 70 rooms, all rooms are equipped with Nepresso Coffee Machine or Tea & Coffee facilities, WiFi connection. Conference room with terrace. Breakfast restaurant: 6.30 - 11.30 on weekends till 12.30"}