{"user_rating": 3.5, "review_count": 184, "name": "Maya Hotel & Restaurant", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "It is near the Taj Mahal and convienant. It could be a place for resting. The only thing that spoils the end of the day is the unexpected increase in room price when I check out. The owner refused to acknowledge the previous agreement. If I were to come back again, I would choose another hotel with more integrity.", "title": "Be careful", "helpfulness": 1, "user": "JapKoreanThai", "date": "June 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 132353196}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Great location in the middle of tourist central, only 10 minutes walk to the Taj Mahal. Despite people saying you only need a night in Agra, we stayed for four giving us three full days which we easily filled with seeing sunrise at the Taj followed by Agra Fort in the afternoon, the second day taking a car (provided by the hotel) to visit Fatehpur Sikri, and a leisurely final day visiting I'timād-Ud-Daulah's Tomb (known as the baby Taj) followed by sunset over the Taj from the other side of the river. Yes, you could probably do it quicker, but we are travelling so in no major hurry and besides it was nearly 40 degrees so why rush?", "title": "Worth more than just one night", "helpfulness": 1, "user": "Angry_13", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130035579}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel has a nice patio restaurant on the second floor, and despite charging approximately double the prices we enjoyed in Delhi and Japiur, it was still fair value and typical of the area. The food was tasty, with a great choice which included meat and vegetarian options aplenty.", "title": "highly recommended", "helpfulness": 1, "user": "Raimund F", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129052622}, {"rating": 4.0, "title": "Great new place!", "text": "The room was clean and nice, if dated compared to what you'd expect in western countries. The aircon worked well, apart from being noisy, but you can switch to the quieter ceiling fan at night. The aircon broke once but was fixed efficiently by the staff.", "user": "Marielle M", "date": "April 23, 2012", "id": 128426172}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "All of the staff were helpful, including the manager who at first comes across as so laidback he was almost horizontal, but turned out to be very helpful in booking cheap train tickets to Jaipur. There is also a driver that works at the hotel who is able to provide a dedicated car or tuktuk service for competitive rates.", "title": "Simple, pretty hotel near the Taj Mahal", "helpfulness": 1, "user": "stinaandjm", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127731060}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel was the 3rd one that we finally choosed (recommended by our taxi driver) after having look at 2 others that were out of discussion. Later we learnt that taxi drivers get a free meal when tourists choose to stay in Maya. The room clean was spacious with 2 double beds (but we were only a couple). The noise from the street can only be tolerated when the windows are kept closed. The clean kitchen which you can see going up to the rooms inspired us to take the dinner in the hotel. To express it in a gentle way: the taste was suitable for westeners with chronic gastroenteritis but disapointing when you expect tasty indian cuisine.", "title": "Ok but noisy street in front", "helpfulness": 2, "user": "SagIchNicht", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 127404138}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Pros", "title": "A good base for exploring Agra but not without some teething problems", "helpfulness": 1, "user": "Philby_W", "date": "April 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127240739}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "----", "title": "clean and nice staff", "user": "assern", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126891492}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "- Very reasonably priced (we were quoted a price of 4 times as much for a very comparable room at the hotel next door) given Agra's status as a tourist trap", "title": "Gives budget hotels a bad name", "helpfulness": 3, "user": "mleach74", "date": "March 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 126679192}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "- The en-suite double room was a good size, clean and tv was a modern mid-sized flat screen", "title": "Good for Taj visit", "user": "Sid74", "date": "January 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123816656}, {"rating": 4.0, "title": "Good place for Taj Mahal visit", "text": "This hotel is a small little gem with easy going people and good rooftop restaurant. Since its so close to Taj Mahal its the perfect location for a stay if you just want to visit the Taj in Agra. Its a budget hotel so don't expect too much, anyway its clean, hot water is provided and bed sheets were fine.", "user": "Joerg76-Maria81", "date": "January 28, 2012", "id": 123746796}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed here for one night on a dehli/agra tour. This is 5 minutes walk to the taj, the room was nice and clean. The bathroom was all good. We both had showers at about 5.30 in the morning and hot water was a plenty. We got taken to a resturant by are driver and when we got back had a few drinks on the roof. This was really nice and the staff were great. You can take in the madness of the road wilst having a good beer. We had eaten allready but the food that was coming out looked so good that after a while we had to share a curry, which was fantastic. Price was sound.", "title": "great hotel 5 mins from taj", "user": "tortiseshell", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123709669}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were brought here by a Tuk Tuk driver after being dissapointed with our first Hotel. It did not look like much from the busy, noisy street but when you get inside you find the rooms are very light, clean and well furnished. It is the only hotel I have seen with double glazing, so a lot quieter than most hotels in busy areas. The terrace was ideal too as we could watch the people go by on the street below. The food was good and the staff polite. The hotel is really just around the corner from the entrance to the park where you can have a quite 5 minute walk to the western gate. It is also not too far the the Taj ganj from there either. All in all the Tuk Tuk driver found us the ideal spot in Agra.", "title": "Really good", "user": "David B", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123336444}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Nice rooms, good food at the restaurant - a bit expensive food, but good", "title": "Nice, comfortable stay - right by tajmahal", "user": "ThiaTravelvast", "date": "January 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 122871550}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The rooms are quite well done", "title": "Happy happy joy joy!", "helpfulness": 1, "user": "Slaursen", "date": "January 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122693599}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel was clean and the room was good, plenty of power sockets. The roof top terrace was good which was just as well cause there wasn't really anything else going on around the immediate area.", "title": "Close to the Taj...but that's all", "user": "charlenedj", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 140840176}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We asked for the free pick up at the station. Vikram came to collect us in his rickshaw. He had waited on us quite a while as our train was late. Once we set off he presented us with his guest book, a small book of reviews from passengers he has picked up from the station from all around the world. This then turns into a bit of a sales pitch and all of a sudden he's offering to be our driver for 2 days, We took him up on his offer as it was only working out to £10 for 2 days. He showed us all the sights in Agra and lots of places we wouldn't have known about with out him but he took us to a lot of shops on the second day and we had to endure the hard sell.", "title": "Marvelous location, the rest...pretty awful.", "helpfulness": 1, "user": "Joe R", "date": "August 24, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 138172829}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We've since learned that when a hotel in India offers you a free pick up, it is just a chance for a rickshaw driver to try and push his services on you for the whole drive to the hotel. If you can be bothered with the little hassle, you may as well take the free pick up.", "title": "Train Ride Fiasco - Don't Use to Book", "helpfulness": 1, "user": "AlexaHart", "date": "August 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137408932}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Hotel is very, very close to the Taj, we set off at 0555 to see sunrise and got there for the gates opening at bang on 0600 - we didn't have to queue at all.", "title": "Clean, comfortable with great food", "user": "Tugelia", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136137660}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The only reason we visited Agra was for the Taj Mahal, i'm sure we're not alone on that. So as a refuge from the rest of tuc tuc and tout addled city, we were after a clean and comfortable hotel. You won't find that in Hotel Maya. My problem with the place began immediately after stepping off the night train from Varanasi. The promised 'free pick up' never showed so we were plunged into the nuisance and trickery of the local cab drivers at dawn. On arrival we were offered neither apology or explanation, just shooed to our rooms by the rude mustachioed man that unfortunately occupied the reception for our stays duration. The room wasn't so bad, despite the repeated power failures, and the restaurant was only moderately below average (though it remained inexplicably busy) but i wouldn't recommend this as a base while visiting the beautiful forts and Taj. (Although begrudgingly i must admit the hotel is amazingly situated for the latter.)", "title": "Stay A way", "user": "Liat S", "date": "July 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 135362373}], "location": {"country": "India", "continent": "Asia", "city": "Agra"}, "variance": {"poor": 14, "average": 41, "very good": 84, "terrible": 11, "excellent": 34}, "aka": "Maya Hotel And Restaurant", "slim_ranking": 0.152}