{"user_rating": 4.5, "review_count": 282, "name": "Mayfair, Bangkok - Marriott Executive Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Our time in Bangkok came at the end of two long flights from Hawaii to Tokyo and Tokyo to Bangkok. We did not arrive at the hotel until 2:45 am. However, the staff attended to our every need and this was so important at that point in our long journey. The front office staff assisted us with all manner of information about the area and gave excellent directions each time we needed guidance. In particular, we noted that Ann was just wonderful in helping us to orient ourselves after such a long trip. The suite was excellent in every way. We were delighted that it was quiet on a 24 hour basis. The gym was extremely well equipped, one of the best we have found anywhere. The pool is large and ideal for lengths. The hotel is very well located, being just two blocks from the sky train and two clock from the Central department store. We recommend this hotel to anyone who wants to be pampered in a perfect situation!", "title": "Wonderful Caring Staff", "user": "tacopat", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189421573}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We've stayed at a lot of nice properties around the world and they have excellent staff members, but nothing tops the staff at the Marriott Mayfair. They are consistently number one in our book. They are genuinely concerned about our happiness, always with a smile. This is true of every department. They treat us like family.", "title": "Staff and Location Fantastic. couldn't be better.", "user": "love to travel 18", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189305467}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We are in the second month of a five month stay and the performance of this property has remained consistently top notch.", "title": "A very nice experience...", "user": "JDavid14", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 189143574}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The breakfast provided is excellent and has a good variety.", "title": "Nice staff", "user": "Dennis C", "date": "December 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188984495}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The location is ideal. There are two Skytrain stops within easy walking distance. there are several very good restaurants within a short walk and a Villa supermarket (many western products) that delivers to the Marriott Mayfair is next door.", "title": "stay during X'mas time, it was nice", "user": "Iris H", "date": "December 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188957421}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 10, "average": 22, "very good": 87, "terrible": 4, "excellent": 159}, "aka": "Mayfair, Bangkok - Marriott Executive Apartments Hotel", "slim_ranking": 0.14693877551, "description": "Located in the heart of Bangkok, our \"All Suite\" Marriott Bangkok Executive Apartments - Mayfair and Hotel is near shopping, global businesses, embassies, sky train stations, numerous restaurants, markets and the Lumpini Park. Choose from elegant 1-, 2- or 3-bedroom apartments, ranging from 54 to 186 sqm, with all first-class services you expect from a Marriott hotel and serviced apartment in Bangkok."}