{"user_rating": 4.0, "review_count": 75, "name": "McBee Cottages", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed at McBee Cottage for one night on June 9 in room35 (lucky we got the room for the one night gap since they usually have a policy to stay 2 nights minimum). When we made the reservation we were a bit skeptical since it is one of the smallest room in the lodge. When we got there, we were pleasantly surprised at this newly remodelled room. The room is superbly clean and neatly decorated. Although it's small but we don't feel it's really \"that\" small. Cannon beach area's accommodations are famous of being expensive and McBee Cottage provides a good accommodation with very affordable rate. Plus it's extremely close to the Haystack Rocks and within blocks of Cannon Beach downtown! We will definitely come again to try other lodges by Cannon Beach Hotel Lodgings.", "title": "Great Value Clean and Neat little place", "helpfulness": 2, "user": "spicykit", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8020206, "likes": {"liked": "— Great value and close to all the popular spots at Cannon beach", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "McBee Cottages are marketed as the \"value option\" for lodging in Cannon Beach. We stayed there at the tail end of a week long trip along the Oregon Coast, and I fully expected a clean, but slightly run-down motel-type accommodation.", "title": "A very pleasant surprise", "helpfulness": 7, "user": "HermioneLee", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7722049, "likes": {"liked": "— Bright, clean, comfortable - great location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We were so surprised to find a lovely, bright, modern, tastefully decorated and renovated 1 bedroom suite waiting for us (Room 28). Lots of room for our toddler to run around, with a living room, good sized kitchen, bathroom and separate bedroom. The kitchen appliances were new, and the bathroom recently remodeled. Everything was spotless, and the hotel staff provided us with a generous basket of complimentary teas, hot chocolates and coffee.", "title": "mcbee cottages", "helpfulness": 2, "user": "cookies7", "date": "May 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7668653, "likes": {"liked": "— close to beach", "disliked": "— don't have anything"}}, {"rating": 2.0, "title": "Get what you Pay For", "text": "The pull-out bed in the living room was actually comfortable enough that my husband and I decided to give our toddler the bedroom.", "helpfulness": 8, "user": "Jen123", "date": "July 10, 2006", "id": 5448193}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We had a recent stay on Cottage #29 for two nights and were entirely pleased with this accomodation in Cannon Beach. This was a roadtrip throughout Oregon for us and Cannon Beach/McBee was our first of ten accomodations for the trip. We expected a beach cottage in a coastal city and that's what we got. Coming from an Atlantic state we felt right at home with the white wicker furniture, coastal theme white barnboard walls, and shells for soap dishes - just as it should be.", "title": "McBee OK with Me!", "helpfulness": 5, "user": "kasey363", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19207578, "likes": {"liked": "— Cleanliness and amenities in unit", "disliked": "— Time to restock the chair cushions"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Just as it should be that some of the cushions on the wicker chair and sofa maybe saw better days - but it's a beach cottage. It's clean, spacious, great kitchen area with everything you'd need to cook/eat/clean etc. Full size fridge, microwave/oven the works. Just do your own dishes they say....no prob. Bath was clean, roomy enough (we only had a shower in our unit which was fine for us). Table for four - plenty of room for two - with the queen size bed in it's own alcove. Windows new and wide open for great breezes...and the best part - beach access was right down the side street this property sits on, and Haystack Rock looms right there. Parking was on location, beautiful flower gardens and sitting area on small lawn that borders the street. Gas grills were available for use also.", "title": "Retro Fun!", "helpfulness": 1, "user": "CwazyWabbit", "date": "August 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18515060, "likes": {"liked": "— It's proximity to great beach access (half a block!)", "disliked": "— That they didn't have one more night available :("}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Staff at Cannon Beach Hotel (a block 1/2 away- where you check in/out etc.) were very nice, when we needed extra towels, we let them know and they were delivered in less than 10 minutes. Other than that, we were on our own since you had your own \"house\"; one that comes with maid service which is nice! They do give you the option to not have them clean and just leave you fresh towels on the door during your stay - also.", "title": "More shabby than chic", "helpfulness": 2, "user": "D78travels", "date": "July 12, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 4.0, "value": 1.0, "rooms": 2.0}, "id": 17801805, "likes": {"liked": "— location, potential"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Location is certainly walkable into town and even closer are several restaurants/coffee cafe's etc. Lot's of choices for eats through out this main drag.", "title": "Absolutely Awesome!", "helpfulness": 2, "user": "espressoconpanna", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16756875, "likes": {"liked": "— The people!", "disliked": "— .....nothing comes to mind!"}}, {"rating": 4.0, "title": "McBee Cottages were so cute!", "text": "We enjoyed our stay both in this town (as a jumping point to travel north during one day also) and this accomodation. Can't beat good amenities, good location and cleanliness. My only advice is that if you don't like the laid back flip-flops coast life and want to be pampered in 800 count sheets, china or plush carpet on your feet - you won't find that here or in Cannon Beach for that matter. This is all about outdoors, fresh seafood and a fridge to stock brews and a good bottle of wine.", "helpfulness": 2, "user": "lesliebachman", "date": "January 5, 2008", "id": 12343022}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 4, "average": 7, "very good": 32, "terrible": 2, "excellent": 30}, "aka": "Mcbee Cottages Hotel Cannon Beach", "slim_ranking": 0.111111111111, "description": "Located less than 1 block to the beach, McBee Cottages celebrate the best of an old-fashioned family trip to the Oregon coast. Built in the 1940's, this motor inn has been renovated to reflect the charm and character of the period with sparkling white bead board walls, schoolhouse light fixtures and box beam ceilings. The ten attached cottages offer a combination of separate sleeping rooms or nooks with queen beds, living areas with sofas and kitchenettes, gas fireplaces, and comfortable furnishings. Guests can take advantage of a manicured lawn complete with stone fire pit, propane barbecue grill, Adirondack chairs, picnic tables and informal flower gardens. This appealing property is completely pet-friendly and a short stroll to downtown."}