{"user_rating": 4.0, "review_count": 56, "name": "McGrory's of Culdaff", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Stayed over a Saturday night after reading the positive reviews on this site. The hotel was very modern and clean and the room was comfortable. Dinner in the restaurant was ok but could have been better. Service was excellent.", "title": "Clean, comfortable, modern hotel", "helpfulness": 3, "user": "loveluxury", "date": "March 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4583604}, {"rating": 5.0, "title": "What a gem in Ireland's N W corner", "text": "This is a really popular spot. There is a lively bar with music at the weekend and a busy nightclub at the back of the hotel. We were woken up as the party goers left the nightclub and starting talking in the street. As such, if you are looking for somewhere quiet and peaceful then this maybe isn't the best place. However, if you plan on enjoying the entertainment then you'll love it.", "helpfulness": 5, "user": "martico", "date": "January 26, 2006", "id": 4390235}, {"rating": 5.0, "title": "Great!", "text": "I would recommend one of the rooms at the front of the hotel as the back rooms are over the nightclub and are probably pretty noisy as the music goes on until around 3am.", "helpfulness": 7, "user": "Neevil", "date": "January 21, 2006", "id": 4366783}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "It is hard to fault McGrory's. This is a nice pub / hotel with loads of atmosphere and we had a great time here. We stayed for 5 nights and the room was very modern, clean, spacious and bright and no hint of the noisy shananigans that were going on downstairs. The food was excellent and the service was fine. Apart from these good points, I left feeling that McGrory's just didn't cut it, and this was probably due to the hole left in my wallet. We paid 65 euro per person for bed and breakfast. For a triple room at 185 a night, this was simply too much as I would expect to pay this in Dublin or a major European city (not a small country town in the middle of nowhere). Friends of ours rented whole houses (brand new and uber-modern about a 5 minute walk away) for half the price.", "title": "Very nice - but pricy", "helpfulness": 2, "user": "imabari", "date": "September 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 8693745, "likes": {"liked": "— Front Bar. Modern, clean and spacious room. Food.", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled with family", "text": "Perhaps I am being too harsh as we did have a really good time here. However, I would say that McGrorys is worth staying in perhaps for a weekend for the craic. Anything else and there are probably better/cheaper options in Culdaff or nearby towns.", "title": "Mc Grory's has got it all...looking forward to going back there", "helpfulness": 2, "user": "tuftytravels", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8465169, "likes": {"liked": "— Food and atmosphere", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "McGrory's is by far the best place to eat / drink / sleep / listen to music in (need I say more!) in the Inishowen area. It's a wee bit off the beaten track but all the better for it. Culdaff is a good location to explore Donegal from and McGrory's is the perfect place to come back to every evening. Rooms are comfortable with modern tasteful decor and clean, nicely -proportioned bathrooms. Breakfast was very tasty with plenty of chioce from what I could guess was locally sourced produce. (good eggs) The overall atmosphere in McGrory's is relaxed, warm and welcoming without being in your face. The front bar is the perfect place to relax in after a cobweb clearing walk on the beach. The Guinness and fab bar food may also be strong factors in the unwinding. It's a difficult place to leave once the music starts. The traditional sessions can be amazing...you just never know who might turn up to play a tune or give you a song. The restaurant also deserves a mention....you'd be hard pressed to find such a good standard for those prices anywhere else nearby.....good wholesome Irish food with a modern twist, not too finicky, just how we like our food. Oh, and when you ask for your steak medium, it comes out medium not chargrilled (!) like many Derry restaurants. The winelist is excellent. We chose house red which was a very decent French wine. The McGrory's are lovely, warm people who obviously have a magic touch.", "title": "Expensive, poor buisness sense", "helpfulness": 2, "user": "stuartyoneknobi", "date": "June 18, 2007", "detail_rating": {"cleanliness": 4.0, "value": 2.0}, "id": 7924050}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We can't wait to go back.", "title": "sold us a room, restaurant 20 minutes away", "helpfulness": 4, "user": "bclancy", "date": "August 15, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 5613847, "likes": {"liked": "— ask if you are able to eat there if you stay"}}, {"rating": 4.0, "title": "Spotless, friendly & great craic", "text": "Over priced small servings from a very limited menu, hotel itself is clean and presented but over all lacking the class the price suggests", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 2, 2006", "id": 5417023}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I spent last weekend in Culdaff with some family members ,including young children ,and I had been looking forward to staying in McGrory's as it had received such good reviews.What a disappointment!", "title": "What a disappointment!", "helpfulness": 5, "user": "Iris", "date": "July 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 34750718}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Whilst the bedroom was pleasant enough the heat was intolerable.I asked next morning if the A.C could be turned on and I was told there was none!", "title": "McGreat", "helpfulness": 1, "user": "D-Dog101", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32884196}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The breakfasts were just appalling for a hotel that cost more than the Ritz Carlton in Powerscourt which is a 5 star hotel.The \"Special\" porridge was a gluey brown mixture straight from the microwave.One croissant was all there was and the cut fruit was finished before we had our portion even though we were well inside the prescribed time.Fried eggs were burnt and an attempt was made to hide them under the toast.We had to ask three times for our coffee and eventually it arrived when we had almost finished.", "title": "Very nice", "helpfulness": 2, "user": "Galwayangel2009", "date": "June 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 32594832}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The service in the dining room was very slow and one receptionist at the desk was surly and never even said thank you or good morning.I noted an advertisement at the door for a chef and a breakfast chef! no wonder the food was so dreadful.It's a bad sign for the rest of the summer if they are looking for such vital staff in mid-July!", "title": "The best there is", "helpfulness": 1, "user": "AllaninNI", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30364181}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I paid 278 euros for two nights bed and breakfast for two adults, one 5 year old and a nine month old infant.I thought this was very expensive for the poor quality I received.The surly receptionist informed me that this was a special rate!", "title": "A little gem.", "helpfulness": 3, "user": "sonya13", "date": "February 15, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24590802, "likes": {"liked": "— Food", "disliked": "— no fridge in room"}}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 6, "average": 3, "very good": 15, "terrible": 4, "excellent": 28}, "aka": "Mc Grory`s Hotel Culdaff", "slim_ranking": 0.75}