{"user_rating": 4.5, "review_count": 275, "name": "McMenamins Kennedy School", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "If you had told me that there was a place, that was a) a hotel, b) a brewpub, c) a movie theater, & d) a restaurant. I would have said that you were nuts. If you also told me that this property was a converted elementary school built in the 1910's, I would have shook my head in disbelief. Simply put, this place is a unique gem, unlike anywhere you will stay. The rooms are converted classrooms. Clean with quirky furnishings. Food in the restaurant was decent & eclectic. The Beer is AMAZING.", "title": "Say Hello to Heaven", "user": "Steve C", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 142254145}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My only complaint (and it's a minor one) was the lack of sound insulation between the hallways and the rooms. It looks like they tried to address this by how they partitioned the classrooms. On the plus side, hallway noise was almost non-existant after 10pm. I also wasn't crazy about the fact that random people could use the soaking pool, but maybe I'm just east coast \"uptight\".", "title": "Very, very Portland", "helpfulness": 1, "user": "Trista-SP", "date": "October 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 141986915}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Geek Night trivia was a riot. The movie theater is the best executed \"living room / restaurant\" style I have ever seen. Reminds me of the old \"Beehive Theater\" in Pittsburgh, Pa (from the 90's) but better executed.", "title": "A Pleasant Surprise!", "helpfulness": 3, "user": "Gooey_9", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 141837596}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "It's a must stay if you are in portland.", "title": "Great for family with toddler!", "helpfulness": 2, "user": "Moxy_16", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 141509458}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We stayed as a couple, for 3 nights at Kennedy School, 3 weeks ago. The hotel is located in a residential neighborhood, quite far from the main touristic attractions. Portland itself is a very odd place (in a good way) and the hotel captures perfectly this \"wierdness\". It is located in a building that once was a elementary school. The work they did to turn this school into a hotel was amazing. We spent (literally) hours exploring the building, its nice and unusual decor. There are artworks in almost every corridor and walls, as well pictures and frames that tells the story of the school itself. The old classrooms were turned into spacious and well appointed rooms (no TV, but hey, who needs TV during vacation anyway?). The best of all, there are 5 (yes, 5) bars on the premises, serving basic pub fare and good beer on tap made in the microbrewery that is also located at the hotel. There is also a hot tub and a movie theater (tickets free for guests - pizza and beer available). Basically, you don't have to leave the hotel for having fun. We used public transport to move around Portland and was very convenient. A 25 minutes bus ride to downtown. We stayed during weekdays, but I guess this place may become very noisy during the weekend. If you are a light sleeper, make sure to book a room far away from the bars.", "title": "My Favorite Place!", "user": "Tonya3512", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141499531}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed for a night on each side of our Oregon trip. Perfect for the night you fly in and quick access to the airport on your way out.", "title": "Really enjoyed our first stay in Portland!", "user": "jodi_123", "date": "October 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144182982}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The rooms were nice, we had a very comfortable bed and the bath was clean, shower only, basic, but they did have some shelves for your items by the sink and provided the basic shampoo/soap/conditioner. No blow dryer, make sure you use the right plug (the red one in your closet) if you want to use the heater. It was pretty cool when we were there and the room was fine, almost toasty with the heater on. Our room was Sally's room, which was up by the front and across from the restaurant. I was concerned about the noise and we did hear some carts rolling around in the morning, but things were pretty quiet between 11 pm and 7 am.", "title": "Fun place to stay if you're looking for something unique", "user": "Patricia M", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143956574}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "They had events occuring both nights we were there and I thought that the crowds added to the ambience and enjoyed knowing the local people also enjoy all the fun. I met several gals from the neighborhood in the soaking pool and had a nice chat, if only the soaking pool had bar service! But, not to worry, there are many places to eat and drink all over the school. We enjoyed wandering around and grabbing a brew while checking the different parts of the school out. One of the events included live music so we got to enjoy that the first night.", "title": "Great Urban Vibe", "user": "Mike T", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143626862}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Our favorite bar was the Honors bar, that may have been because it was close to our room. The only bar we didn't go into was the Detention Bar because, while we think it's cool they allow cigar smoking in there, just too much smoke.", "title": "Very special experience; great neighborhood", "user": "Sephuzzy", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143025871}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We went to the main restaurant for dinner first night in. It was OK. For better bar food, just catty-corner on Killingsworth, by the Subway, is Concordia Ale House - much better for burgers and sandwiches. Don't get me wrong, Kennedy School's food was pretty good and quite convenient, we ate there again. Twice for breakfast. The best breakfast dish we had was a Southwest Omelet, nice spicy chorizo without a lot of grease and the worst was sweet potatoe pancakes, hard to get them done well enough.", "title": "A unique experience", "user": "Sandy N", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 142388253}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We saw Sigur Ros at Edgefield and wanted to stay somewhere pretty close and this was a perfect option. About fifteen or twenty minutes from the venue. Great little B&B in a giant building. Staff is a little green but eager. Room was clean and comfortable and the chalk broad was a great source of entertainment. The soaking pool is a must-do. Lovely place to stay. Food is second tier, at best, but it's really just bar food at bar food prices and no since complaining about that.", "title": "Great field trip", "helpfulness": 1, "user": "soleswornthin", "date": "August 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137369237}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed last year with my husband and three little boys. Having young children and vacationing is a bit of an oxymoron however we found the Kennedy School to be a perfect fit.", "title": "Fun, not your average hotel", "user": "Sashagray", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137333600}, {"rating": 4.0, "title": "Well worth the price", "text": "Between the fantastic concept, movie theater, soaking pool and community feel we just loved our stay. Thank you!", "user": "worldwidewroey", "date": "August 10, 2012", "id": 136852165}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "Uber cool hotel, with huge rooms and a hell of a lot of character. Beds are comfy and bathrooms well-appointed.", "title": "A little disappointed", "helpfulness": 2, "user": "agentCodyboy", "date": "August 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 136395307}, {"rating": 5.0, "title": "Portlandia", "text": "It's a bit of out town, but there are a lot of restaurants and bars nearby.", "user": "Patrick K", "date": "August 2, 2012", "id": 136057695}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This place was super cool! I never thought I would get to stay in an old class room. It was a bit of a shame the message on the chalk board referred to a wedding schedule that must have happened the day before though. But besides from this we had an amazing stay.", "title": "Brilliant!", "user": "Hollie_Pax", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141237968}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The singing receptionist was super helpful and all the staff we encountered were really friendly. The cinema and soaking pool is a must. This place definitely helps to 'keep Portland weird'", "title": "Disappointed", "helpfulness": 2, "user": "hannypops", "date": "September 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 140420169}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "An interesting building with really cool and quirky bars and great artwork on all of the walls but located well outside of the main action in Portland. The room was really basic. Small bed, giant spider in room and no hairdryer or tv. Bathroom was dingy and the noise from the road was not insignificant. On the plus I did like doodling on the chalkboard in our room.", "title": "Worth the trip!", "user": "Nancy B", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139401535}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Staff were distinctly average. However the biggest let-down was that the day we arrived - and we could only stay for one night - both the soaking pool was closed and they were showing no movies in the theatre; the main reason for us deciding to visit the School.", "title": "Definitely a destination", "helpfulness": 2, "user": "Carryon86", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 139290559}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I loved the vibe of this place and knew I could have loved it here if only it hadn't both attractions hadn't been unavailable to us when we visited.", "title": "Fantastic fun, not your typical B&B", "user": "alexk333", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139085397}], "location": {"country": "United States", "city": "Portland"}, "stars": 3, "variance": {"poor": 13, "average": 20, "very good": 93, "terrible": 5, "excellent": 144}, "aka": "Mcmenamins Kennedy School Hotel", "slim_ranking": 0.276923076923}