{"user_rating": 4.0, "review_count": 1033, "name": "ME Madrid Reina Victoria", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This hotel has concentrated so hard on being cool and funky that it's forgotten the fundamentals of innkeeping: to provide a comfortable night's stay for guests.", "title": "Cool, funky and ..... uncomfortable", "helpfulness": 1, "user": "Rover10", "date": "October 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 47862680}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "First, the location is excellent, on Santa Ana square, 5 minutes one way to the Plaza Mayor with its bars and restaurants and 10 minutes the other to the Prado and in the middle of the shops.", "title": "You'd struggle to find a better location in Madrid", "helpfulness": 2, "user": "Mordonian", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47762041}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "But, the hotel is built for looks more than comfort. The standard rooms (\"Deluxe\" in ME parlance) are large enough to take a bed and just be able to walk round it, sliding doors to the bathroom are needed due to the space. ME's \"Supreme\" rooms are rather larger but still not generous. Bare wood (laminate) floors look good but are not comfortable and noisy if the person above wears shoes.", "title": "MODERN HIP HOTEL", "user": "ggisonna", "date": "October 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47608501}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Finally, the noise - on the first night, after wrongly being checked in to a \"Deluxe\" room, we were correctly given a \"Supreme\" room on the 1st floor overlooking Plaza Santa Ana. The double glazed picture windows cannot cope with the noise from lively bars which start only 20m away. At 4 00am on a Thursday night we finally slept using the earplugs kindly supplied by the hotel in all rooms. Unfortunately at 5 00am the bin collections start.", "title": "Terrific Experience", "user": "kdub_SF", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46265134}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "After a sleepless night we were allocated a 3rd floor room on the side of the hotel. The staff, by the way, (all under 25) are adequate and completely lacking in customer service - expect waits at the understaffed Reception.", "title": "Great hotel!", "user": "Begonia21", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45925844}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We had a wonderful weekend at ME Madrid, On arrival we were met and taken to our room by Jose the Experience Manager, the room was very modern with great views over the Plaza. We booked a Supreme room and it was very comfortable with a huge bed and a very nice bathroom with a large shower. We did experience noise throughout the night but nothing more than we expected from being on the Plaza which is surrounded by cafe's and bars with outside seating, The hotel is very modern and has a lovely atmosphere with nice lighting and candles all over. When we returned to our room at night there were candles left in your room and fresh towels etc.", "title": "Great Hotel", "user": "sallyimb", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45312648}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Reception recommended and made restaurant reservations for us and they were spot on with what we had requested. Overerall a very nice stay and very central we would definately stay here again.", "title": "Excellent - could not have been any better", "user": "casandra16", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44487914}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I normally do not write however this was the best in Madrid for location, fun, food, hotel amenities and service. This was absolutely super.......directions on metro to hotel great, directions to sights great, great atmosphere, all in all would not stay anywhere else in Madrid.", "title": "Nightclub in your room", "user": "adlondon41", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 43288848}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "If you intend to have a relaxing week-end, do not go to the ME hotel. They have a club on the top floor of the hotel and the music and vibrations traveled down to my room (situated on the second floor of the hotel). Being on Spanish time, the club only closes very late (around 3am).", "title": "Great, modernized hotel in a perfect location", "user": "CS01", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43202782}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Another problem was the difficulty to operate the lights in the room with a remote control that was very confusing.", "title": "Nice decoration but poor service and the worst management I've seen", "helpfulness": 3, "user": "Suabo", "date": "August 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 37391700}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Absolutely gorgeous place to stay. Be sure to book a room with view of plaza Santa Ana. Room was spacious and high class, bathroom huge ( separate shower, bath tub and 2 sinks), bed linnen and towels first class. The only thing I could not manage was the remote control for all the lights awailable. I guess you need to stay at least a week in order to control that.", "title": "One of the top Hotels in Madrid", "user": "elydia", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37158825}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Personal at the reception is extremly kind and helpfull. Breakfast no big choice but excellent quality. A pity that the breakfast room has no natural light. The same place is used as restaurant for lunch and dinner. Quality here is also very good, but a bit pricy (small portions). Also service could improve here.", "title": "Great Location-Try and stay in the bigger rooms", "user": "fj74582", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36405655}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "There is a stylish terrace bar on the roof, very popular among the locals, which is worth visiting at night. For non Hotel guests, there is an seperate access to that terrace. I definitely recomend this Hotel.", "title": "Magical Hotel in a magical city", "user": "keciaanne", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35889063}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I have been to Madrid several times and usually stay at the Westin Palace. This trip was for about two weeks so I decided to stay a few days at the Westin, Palace and the rest of my time at the ME.", "title": "Couldn't fault the hotel", "helpfulness": 1, "user": "schloofer", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34120094}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "The ME has a great location (in front of la Plaze de Santa Ana) walking distance to pretty much everything. Good service, great rooms (make sure you get the bigger rooms), roof top bar, gym and free internet.", "title": "This was a great hotel.", "helpfulness": 1, "user": "farhanakhan", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34088064}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We selected the ME Madrid because of its location in the Old Town section of Madrid, near the Prado and other historic sites. After a stay of four nights, we are big fans of the hotel. The location, in Plaza Santa Ana, is terrific. We stayed on the \"Level\" Floor, which had great views of the square. The room was modern and attractively decorated. The bed was comfortable and the bath area was large and functional. The roof-top bar was very cool and trendy. The breakfast was terrific (included in a very reasonable room cost). Free internet service available via computer in their business center.", "title": "Cool, Trendy Hotel in a great Location", "helpfulness": 2, "user": "RJ/HM", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33957654}, {"rating": 5.0, "title": "ME Hotel Madrid", "text": "This my first time to Madrid and without knowing the \"lay of the land\" I picked the ME Hotel in Madrid - it turned out to be a great choice. The hotel is fabulous and the location gets a 10 out 10. Really comfortable and well appointed funky rooms. I'll be retuning to this hotel again for sure.", "helpfulness": 1, "user": "Geeman63", "date": "July 4, 2009", "id": 33864675}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "We stayed here for 3 nights in May for a long weekend with friends. I have been in Madrid twice before and knew of this hotel from previous visits as it looks spectacular when standing in Plaza St Anna where the hotel is located.", "title": "Superb Roof Terrace & Location", "helpfulness": 1, "user": "TheGrimesReview", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32796952}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "On reading reviews I decided this would be the best base for our weekend in Madrid. The hotel itself is in a great location as so many bars and tapas bars nearby and also in the middle of the old town. The hotel has a great design inside and the rooms are also well designed if a little on the small side however big enough for a city break when you really only use it to catch up on some well needed rest.", "title": "Good location. Quiet room", "helpfulness": 1, "user": "FloraDenmark", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 32784369}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We were booked in room only so cannot comment on the food. To be honest there are so many places to choose from nearby it would seem crazy to spend money on hotel food. I can comment on the roof terrace which is stunning. It has been designed by Randy Gerber (Cindy Crawford's husband) and no expense has been spared. The views over the city are amazing and would recommend that you try this place out at least once.", "title": "agree with everything written, but.....", "helpfulness": 1, "user": "magicwand", "date": "June 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 32180842}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 4.5, "variance": {"poor": 41, "average": 83, "very good": 356, "terrible": 38, "excellent": 515}, "aka": "Me Madrid Reina Victoria Hotel Madrid", "slim_ranking": 0.107221006565, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The ME Madrid Reina Victoria is strategically located in the heart of the city, with easy access to the major attractions such as the Prado Museum, Thyssen-Bornemisza Museum and Reina Sofia Museum, Retiro Park, Congress building, Puerta del Sol, Plaza Mayor, the Royal Palace and the city’s shopping and business areas."}