{"user_rating": 4.5, "review_count": 564, "name": "Meadowmere Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I have stayed at Meadowmere numerous times and have never been disappointed. I've booked the luxury suite (the weekend deal for our anniversary), it was wonderful. No problems with the space, jacuzzi, comfort. I am amazed at the complaints posted.", "title": "Love Meadowmere", "user": "hurricainesmom", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14745334, "likes": {"liked": "— proximity to everything I wanted"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I have stayed in all of the buildings with various groups, I've come in summer with my kids, with the \"girls\" to go shopping and for quiet time with my hubby. I have always found Meadowmere to be pleasantly accomodating.", "title": "Very nice experience~", "user": "mOmOpOcUs", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13892248, "likes": {"liked": "— Surpassed all expectations", "disliked": "— Had one broken bulb in room? Not a real problem - plenty of other lights!"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Once, I smelled an odd odor in my room, and immediately it got changed. Another time, there was some issue with the room we were meant to stay in, I got the feeling it was \"trashed\" by some younger guests, and we were placed in a different building, but upgraded to a King with a skylight, which was nice.", "title": "Febuary school vacation tips for moms", "user": "lilacfairy", "date": "February 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13623264, "likes": {"liked": "— Proximity to Ogunquit Beach - even in the winter!", "disliked": "— All the logistics involved with children and pools."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I've never had a problem with route one noise, though I've only stayed during high season twice, and only once at the Country Squire in summer.", "title": "LOVED IT!!!!!! Def will stay here again!!!!!!!", "helpfulness": 2, "user": "LIMom78", "date": "December 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11502772}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I cannot believe all the problems people encountered here, I've just found it awesome each time. Great location, accomodating staff, fun amenities. I wish the pub was open later in the off season, but other than that, I've got no complaints. I'm planning another Meadowmere stay this spring to do shopping with the ladies....", "title": "Only staying one night but it was just fine!", "helpfulness": 3, "user": "krammajo", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10088527, "likes": {"liked": "— Location - very handy to the water.", "disliked": "— Coffee machines in the units would be nice."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Meadowmere for one night after dropping our kids off at summer camp. We had been looking for a place in Ogunquit that had a bit of everything and was not too expensive. After reading reviews on trip advisor, we focused on Meadowmere because it had decent sized rooms, a gym, hot tub, pool, and spa. We did book early. As another reviewer pointed out, this was not the way to go, especially in late June. Prices dropped considerably ($30 or more) but with the $50 cancellation fee, we were stuck at the higher rate. Lesson learned.", "title": "Everything we needed", "helpfulness": 1, "user": "BostonBruins33", "date": "July 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 17576029, "likes": {"liked": "— cleanliness, gym, appearance", "disliked": "— would have been nice to have been a bit closer but not a problem"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The room was nice and very clean. My wife did ask for shower caps and they didn't have any. That's her minor complaint. The gym was very nice with up to date equipment and flat screen televisions with several stations right on the machines. The outdoor pool water was a bit cold and the location of the pool was not great. The hot tub, however, seated several people and was clean and nice. The continental breakfast was decent. The hotel is adjacent to Jonathan's and we had a great dinner there. We also walked to Perkins Cove (12-15 minutes) and to town and beach area (same walk).", "title": "Book early and pay more at Meadowmere", "helpfulness": 7, "user": "TravelinaBoston", "date": "June 23, 2008", "detail_rating": {"value": 1.0, "location": 2.0, "service": 1.0}, "id": 17160458, "likes": {"liked": "— nothing", "disliked": "— that they charge more for folks who book early!!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "There is a trolley stop at the edge of the property. We used this on the way back from the village when it rained.", "title": "Nice but with a few drawbacks", "helpfulness": 2, "user": "dhinfo", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 16397375, "likes": {"liked": "— Clean, well kept", "disliked": "— Location, breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I would stay at the Meadowmere again. But if I go late June, I won't book that early and wait for bargains.", "title": "Put a damper on our evening!", "helpfulness": 3, "user": "Pinecones", "date": "May 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 16287018, "likes": {"liked": "— The cleanliness of the whirlpool tub in our room."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "In November 2007 we made our reservation for a July 2008 one-week stay at Meadowmere. Our room rate: $238/night. My sister called on May 10, 2008 to get a room for the same July week and got her room for $50 less/night. I called the manager to ask for the lower rate and she told me that \"the rates vary depending on when you reserve your room\" and that she could not lower our rate. Imagine that for customer service: pay a $50/night penalty for booking in advance!! Needless to say, we all cancelled our reservations at Meadowmere!!", "title": "Great for a long weekend", "user": "NB329", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16194224, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Centrally located, if you want to walk to town you can. Parking extremely difficult in town. Nice place but if you stay out til 10 you might have trouble parking. Go early for breakfast or you'll have to wait. Everyone is very pleasant. Ogunquit is a bit overrated. Maine lobsters overpriced, in fact just about everything is overpriced. The town beach is like sitting on the D train during rush hour. I'm not exaggerating. It was shoulder to shoulder on the beach, it took over an hour to get out of the parking lot. It is easier to get out of a stadium parking lot than the town lot & they charge you while you wait. The cops just sit around & watch instead of directing traffic. I've never seen anything like it in my life. Nicer beach down the road, don't go near the beach in town. Jonathan's Restaurant was excellent!", "title": "Good location", "user": "razzrazz", "date": "August 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18761096, "likes": {"liked": "— closeness to town"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Family of 4 with two young children. Booked a family suite which was very nice and very well maintained, with a nice little outdoor patio (not too big though). Suite has two rooms (fair size), with a small fridge which was in the bathroom sink area (thought it should have had some type of kitchenette area).", "title": "Nice Place to Stay", "helpfulness": 1, "user": "ThomasAlbany_NY", "date": "July 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 18321593, "likes": {"liked": "— Facility very well maintained", "disliked": "— Outdoor Pool (too small)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Resort itself is on the small side (not a lot of parking either), but very well maintained. The indoor pool is nice (perfect size) but the outdoor pool in very small. The game room is nice, the outdoor jacuzzi and roman spa are fantastic, and the little movie theatre is a nice bonus to have (they run new movies on DVD and some older family movies). Complimentary Breakfast was very good, but served in a small pub area that is very nice but much too small for the number of guests. Recommendation is that you go early to breakfast (which is what we did around 8am and found space to sit), or face not being able to be seated right away (which around 9am it looked to be overcrowded with people waiting outside).", "title": "pretty good", "user": "Traveller111Usa", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 18132237}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Walk to the beach (Perkins Cove) is about 1/4 mile, or about 10 minutes. We did it every day with a good stroller that could carry everything. It is a nice walk, but if you have kids, esp. small children, it could be too far without a good stroller. But a trolley stop is right next to the resort to take you to the beach ($1.50 per person per ride I think).", "title": "The ONLY place to stay in Ogunquit", "helpfulness": 1, "user": "ibentmywookie", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17657082, "likes": {"liked": "— Everything you need is on-site", "disliked": "— Not everything is in the greatest condition?"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Staff is very pleasant and helpful. We even left several things behind in our room, which we called about and they promptly shipped to us. Very responsive and accomodating.", "title": "overall a great stay at meadowmere", "user": "upstateNewYorkRnmom", "date": "July 7, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17629702, "likes": {"liked": "— cleanliness,proximity to attractions,great beds,attractive resort", "disliked": "— front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Me and more boyfriend wanted to go for a nice get away so we booked the medowmere, not knowing anything about it. We loved it... but then again we were a lil bit smarter than to go during the busy season we went a week before there season started, I am 21 and was probally the youngest person there. It was relaxing and quiet. Breakfast was no problem at all the staff was friendly to me, and evey night i would go into the indoor pool and outdoor hot tub and roman bath, and would pretty much have the place to ourselves. From what i read it sounds like the meadowmere is hopping during the peek season, and i don't know it i would have enjoyed myself then either, if you wan my advise go just before the season starts, the weather is still pretty nice, and the town is less crowd and the majority of things are open. I loved my stay at the meadowmere, and my time in ogunquit, there was plenty of parking by the beach, and no waits at the resteraunts. I would go to ogunquit and stay at the meadowmere again if it was off season.It's not just the meadowmere thats nuts during peak seaon it's the whole town. it can't be helped, and shouldn't be blamed on the meadowmere, most resorts like that would be crazy and filled with children, if children annoy you that much ( like it sounds like in other reviews) go in the off season, cuz there is no escaping that when they get out of school, besides it's cheaper..", "title": "I loved it", "helpfulness": 1, "user": "sarajane4", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8823487, "likes": {"liked": "— Roman Spa", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Excellent experience for our 4 night stay! Four retired teachers booked 2 rooms at Meadowmere Resort in Ogunquit, ME through Priceline. We had excellent off-season rates and beautiful, clean rooms. I booked Meadowmere for location and facilities. We walked to the village, Marginal Way and Ogunquit Playhouse. This is a large resort with an indoor pool, outdoor pool, hot tub , Roman Spa and large excercise room. It is next door to Jonathan's Restaurant (which was a little pricey). The staff was VERY nice. They OFFERED to book dinner reservations for us twice and gave us a lot of good advice about attractions in the area. One of the two rooms was in the older back building and on the first floor. The room above had residents that arose VERY early and there was some noise heard. The other room was on the top floor above the Pub and was totally quiet. We enjoyed our stay and will return. The lobby area had nice sitting areas and a nice room with a computer to check email on free! The included breakfast was a large bar set up with all kinds of cereal, pastries and fresh fruit from 6:30 in the morning. This was off season, so we had no problem of waiting, which I read was a problem in season. Great 4 night stay!", "title": "Excellent experience for 4 nights", "user": "saundrobe", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8723975, "likes": {"liked": "— Location, staff, cleanliness", "disliked": "— small bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We have been to the Meadowmere before, always in the fall or winter, let's say off-season. We had no idea how crazy Ogunquit would be over Labor Day weekend! The whole town was buzzing! We LOVE the Meadowmere, and how it was just a few steps away from Shore Road, the Beach and the downtown shops!", "title": "Loved it so much we'll be back next month!", "helpfulness": 2, "user": "JimmyRC", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8682245, "likes": {"liked": "— Our Room", "disliked": "— nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We looked forward to each day, and evening, returning to the quiet, peaceful property at the Meadowmere, lounging by one of the pools, or just enjoying our own private balcony overlooking the garden area with a glass of wine! The room, which was a Fireplace Jacuzzi Suite, was beautifully decorated, and extremely clean. All of the staff, from the Front Desk personnel to the housekeepers, all went out of their way to smile and greet us everywhere we went. We felt like family!", "title": "dissapointed", "helpfulness": 2, "user": "olivejo", "date": "September 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 8608956, "likes": {"liked": "— it was clean and the bed comfortable", "disliked": "— the breakfast and the room size"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We know the prices are high in the summer, and holiday weekends - but look what you are paying for, not just the room, but everything else! The only thing we would have enjoyed was a coffee maker in our room, so we could have lazed around a little more in the morning before going down to tackle the Continental Breakfast. We can't wait to go back in October! They always do such a nice job decorating the grounds - they are impeccable. You can tell the owners take a lot of pride in their property and staff.", "title": "Depressing 2nd visit", "helpfulness": 1, "user": "jimlNewton", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8507039, "likes": {"liked": "— Pools", "disliked": "— Rooms"}}], "location": {"country": "United States", "city": "Ogunquit"}, "variance": {"poor": 31, "average": 41, "very good": 143, "terrible": 17, "excellent": 332}, "aka": "Meadowmere Hotel", "slim_ranking": 0.405405405405, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Begin a tradition at The Meadowmere Resort, a family owned hotel in the heart of Ogunquit. Relax with award winning amenities, great location, environmental excellence and every room choice to make your hotel stay special. Set on the Southern Coast of Maine and one hour away from Boston, the Meadowmere is a favorite Maine vacation resort for generations. Enjoy gourmet getaways, spa packages, Maine weddings, corporate meetings and year-round vacations in the heart of Ogunquit Maine."}