{"user_rating": 4.0, "review_count": 124, "name": "Medallion Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I agree with the other posts -- this is an exceptionally clean and well run hotel for it's class. Good value for money, efficient and friendly staff, plus a free hearty breakfast. Will definitely stay here again.", "title": "Agree with others - It's great!", "helpfulness": 1, "user": "Rabidpuppy", "date": "March 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6893718, "likes": {"liked": "— Cleaniness and size of the room", "disliked": "— It's entrance was a bit nondescript and hard to find."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "My husband and I stayed here for two days at the end of May. We had just finished staying at a hotel in Richmond, BC - Canada that was the same price and was awful so we were not expecting much from the Hawthorn Inn. They may not be a five star hotel but they certainly try to be. Great service, very clean & spacious rooms. The hot buffet breakfast included in the price was another wow for us. Okay, it wasn't a huge selection but it was hot & fresh.... and FREE.", "title": "Wow, So Impressed!", "helpfulness": 2, "user": "1habfan", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 5294352}, {"rating": 3.0, "title": "Overall an enjoyable experience", "text": "It is right near the Prime Outlet mall and the Casino. We are not gamblers but thought the Casino might be a good place to have dinner but the buffet which didnt look all that great was $20 US each so I guess the Casino is hoping people win a little money that they wont mind spending in the restaurant. I guess we were expecting Vegas buffet prices.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 9, 2006", "id": 4334814}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "This hotel is about half an hour from Seattle and that was just fine with us because we were on holidays and in no rush for anything.", "title": "Very Nice Accommodations", "helpfulness": 2, "user": "waiomaogirl", "date": "September 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3880390}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Great stay, would absolutely recommend and will no doubt be back.", "title": "Great place, great value, would recommend", "helpfulness": 1, "user": "VAN-BC-Traveller", "date": "August 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3791405}, {"rating": 4.0, "title": "Highly recommended!", "text": "My girlfriend and I stayed at the Hawthorne for just 1 night over the Memorial weekend. We drove down from Vancouver for a shopping day at the Seattle Outlet Mall which is about 5 minutes south on the I-5. There's an overnight shopping package which includes a foot massage and a credit towards the Outlet Mall but we booked too late. Apparently, they need about 48 hrs notice for the spa and credit voucher so I can't comment on the spa. The shopping was quite good though and there's a very nice large casino right next to it (I think it was called Tulalip or something like that. I went there after my feet got sore from following my girlfriend around.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 1, 2005", "id": 3515702}, {"rating": 5.0, "title": "We will return!", "text": "The hotel is set in an odd area (on a side road facing a car dealership tucked just east off of the I-5), however it was very well landscaped including a Koi goldfish pond. The inside was modern and appealing to the eye. We didn't use the pool (looked a bit small) or hot tub due to time constraints. The check-in was quick and painless with a very friendly front desk clerk who provided information on nearby restaurants. All staff that we encountered were friendly and helpful.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 24, 2005", "id": 3498187}, {"rating": 5.0, "title": "What a lovely place to stay..............", "text": "We booked a room with a king size bed, jetted tub, vcr/dvd player and a large balcony. It was quite roomy and much better than I had expected for a town the size of Arlington. My only complaint is that the water pressure for the shower wasn't that great.", "helpfulness": 5, "user": "DogwoodAussie", "date": "May 28, 2004", "id": 2125021}, {"rating": 5.0, "title": "It's Like Heaven On Earth.", "text": "A buffet breakfast was included with our room and was quite decent. Overall, I would rate the hotel an 8.5. It proved to be an excellent value for the buck. We will return and try out the spa next time!", "helpfulness": 2, "user": "Amber A", "date": "April 20, 2004", "id": 1803160}], "location": {"country": "United States", "city": "Arlington"}, "stars": 3, "variance": {"poor": 6, "average": 17, "very good": 51, "terrible": 7, "excellent": 43}, "aka": "Medallion Hotel Arlington", "slim_ranking": 0.333333333333}