{"user_rating": 4.0, "review_count": 774, "name": "Mediterranean Inn", "reviews": [{"rating": 5.0, "title": "Forget Overpriced Downtown Seattle Hotels", "text": "I stayed here for 4 nights and I loved this little hotel. The room was clean and there was a kitchenette. The staff was very helpful, they kept our luggage for us because we got there way before the check in time. They put tags on our luggage and placed them in the back room. There were 2 computers w/ internet on the lobby, a gym and not to mention the starbucks downstairs. The bus stops are a block away which takes you to Downtown Seattle and Pioneer Square for $1.25 and it runs late. Downtown Seattle also has a ride free zone so you can pretty much go around Downtown Seattle for free and you don't have to worry about parking. There are a couple of good places to eat and shop near the hotel - check out Pagliacci's (awesome salad) and Underdawg Records (awesome music collection & the owner was very friendly and helpful). The Seattle Center (Space Needle, EMP, Pacific Science Center, Children's Museum) is about 2 blocks away. There's a Safeway and a 24 hour neighborhood grocery store around the corner. Do not miss the rooftop deck - it has an awesome view of Downtown Seattle, Queen Anne Hill, Elliot Bay & the Space Needle. You can also walk if you're comfortable walking about a mile or more. We walked from the Bellmont District to our hotel and it was not that bad. To get to and from the airport, call the hotel for a car service (Mr. Maru $35.00) - if you take a cab, it will cost you the same, if not more. The car was roomy and clean, and he avoided the traffic by going on the side streets - imagine if you're taking a cab and how much this would have cost you. The driver was very friendly and very professional. If you must take a cab - take the yellow or orange cabs. I will definitely stay here again and will recommend this hotel to anyone.", "user": "audzky", "date": "October 21, 2006", "id": 5979852}, {"rating": 4.0, "title": "Great value, great location.", "text": "I found the Mediterranean Inn on Trip Advisor and stayed there in the spring of 05. I was there in August of this year and was once again very happy with the hotel. As others have mentioned the Queen Anne area is terrific. Lots of good restaurants close by like the Melting Pot and the Five Spot Diner. We drove into downtown but you could easily take the transit just a block away. It's a nice comfortable area to come home to. The hotel itself is basic and you definitely need to request AC if you want it as all rooms don't have it. The bathrooms are small but livable. The rooftop deck is outstanding. I could have spent a day there just reading and ejoying the view. Starbucks downstairs is a nice attraction and convenient.", "user": "edmjournal", "date": "October 6, 2006", "id": 5923060}, {"rating": 4.0, "title": "Enjoyable stay", "text": "All in all I'd highly recommend the Mediterranean. Great rates in off season. Quite a bit higher as all hotels are in summer. I'd definitely stay here again.", "user": "AD_WDC", "date": "October 4, 2006", "id": 5907456}, {"rating": 4.0, "title": "A Great Place for the Price", "text": "I enjoyed my stay here, and would definitely both recommend it and stay here again. While not in downtown, it was easy to get around with the bus (stop a block away, 4-5 lines) and free transfers. The surrounding area (Lower Queene Anne) had good restaurants (Racha, Pesos, Caffe Ladro) and stores (music, books, safeway, drug store). The hotel decor was fine (nothing special and nothing mediterranean about it, a bit dated) and everything was clean. Rooftop view was amazing, free bottled water in the room was great, free internet in the lobby also was helpful. Front desk was extremely helpful with directions, getting messages, extra keys, etc. Not necessarily a place to stay for a romantic weekend getaway, but for anything else, it works.", "user": "Pastry_Princess", "date": "September 12, 2006", "id": 5793900}, {"rating": 5.0, "title": "Very pleasant stay in a great location", "text": "Great location, clean rooms, good amenities, great rooftop view. Only a few rooms have AC so beware when you book if it's summer. Easy to get downtown with the bus schedule and stop a block away. Good, safe parking garage below the hotel, although you would not park your large SUV there. I would definitely book again, specifying a room with AC if in warm months. The only thing that would have made the stay better was a slightly more comfortable bed, thicker pillows, and free internet ($5 daily or $15 weekly).", "user": "Darylemad", "date": "September 4, 2006", "id": 5769278}, {"rating": 4.0, "title": "Highly Recommended for tourists!!!", "text": "My husband and I stayed for 3 nights from February 21-23, 2007. We decided to book in this Hotel based from the Internet reviews made by Expedia/Trip Advisor travellers! Personally speaking, we both are quite impressed with the hotel in terms of cleanliness, customer service, amenities, and the location of the hotel!", "helpfulness": 7, "user": "Tinskie143", "date": "February 28, 2007", "id": 6893296}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Hotel staff are very helpful, friendly and accommodating, the one complaint I have is that we didn't get the Space Needle view in our window, although my husband and I enjoyed the Hotel's roof- top view of Seattle during the night!", "title": "Very Nice!", "helpfulness": 5, "user": "pdxswing", "date": "February 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6813528, "likes": {"liked": "— Good Price, Good Location", "disliked": "— No free WI-Fi"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The location of the hotel is just walking distance to Seattle Center, as well as downtown Seattle! Apart from the Hotel, I highly recommend the Argosy cruise tours--Harbor and Lake Seattle...it was such a treat that we saw Bill Gates' mansion along Lake Washington via Argosy Lake Seattle cruise! Anyhow, a definite \"A\" rating for the Meditteranean Hotel, for sure!", "title": "Had a great time", "helpfulness": 1, "user": "homebody00", "date": "February 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6799039, "likes": {"liked": "— Price, location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "I learned about Mediterranean inn through this website. I was very happy with my stay. They have internet in the lobby so that is nice. The room was pretty nice, had a nice sink/microwave/refrigerator with complimentary water/popcorn/starbucks coffee. Nice touch. TV full of stations. The roof deck has a beautiful view as well.", "title": "Bright and cheery place in Seattle", "helpfulness": 3, "user": "Libbety", "date": "February 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6766131, "likes": {"liked": "— The cherry atmosphere and the color yellow paint", "disliked": "— The blinds in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Overall nice place. Will stay again for sure. Pretty central, lots of restaurants around. not to mention Safeway grocery store across store, very convenient.", "title": "Great Place on The Cheap!!", "helpfulness": 4, "user": "rakasome", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6711374}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "I booked this hotel for a two-night stay because of it's close proximity to Key Arena (just one block away), and I was very impressed. The hotel is bright and the rooms very clean (though I would bring a pillow case from home - their's are paper thin). The front desk personel were very friendly and accommodating. The rooms do have a microwave and mini-fridge, but do not have any utensils of any kind, so you may want to bring anything you think you'll need.", "title": "Great Stay", "helpfulness": 3, "user": "Sierra_Van", "date": "January 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6607006, "likes": {"liked": "— location", "disliked": "— no rooom service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The bus stop into town is a half block away, the Safeway is right next door (so handy!), there are several pubs, restaurants and fast-food places surrounding the hotel, and you cannot beat the Starbucks directly off the lobby.", "title": "Great hotel for reasonable price", "helpfulness": 7, "user": "Locheriboll", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6557581, "likes": {"liked": "— Large room, windows that open, fridge and microwave", "disliked": "— No wifi in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I would highly recommend this hotel. And if you do stay here, you cannot leave without checking out the roof top deck (what a view!)", "title": "Great location! Nice hotel.", "helpfulness": 10, "user": "snaproll21", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6177712, "likes": {"liked": "— Location, free internet, clean", "disliked": "— small room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "We were looking for a hotel close to where our son lives, and the Mediterranean was ideal. But we were pleased to find it was also a great hotel. Best was the Starbucks right off the lobby. Even if you don't like Starbucks, you can start there! My husband and I had our daughter with us, so we wanted a room with 2 queen beds and the Website didn't appear to have any, but I called directly and was told that they do indeed have rooms like that, but don't put them out on the Web as they don't have many. It was a large room on a corner with French doors that opened. Lack of air conditioning was not a problem at Thanksgiving and the noise didn't bother us either despite being on a busy intersection. Summer with open windows might be a different story. Fridge and micro were an unexpected bonus. No wireless Internet in room, but computers available in the lobby and in fact we could pirate someone's wifi at night. Close to the Space Needle and Pacific Science Center, and to the monorail to downtown. Altogether greatly recommend this hotel.", "title": "Really nice hotel", "helpfulness": 7, "user": "shreevie", "date": "November 22, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6165061, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My girlfriend and I spent a week at the Mediterranean during November 2006. The room was perfectly adequate, nothing fancy or lavish, but a nice bed, clean, full bathroom, big enough fridge, etc. Not a room you'll spend much time in, but there's plenty right outside to enjoy. We tried a handful of great restaurants within 2 blocks (everything from Thai food to an Irish pub w/great pot pies). There's a nice bar a block away. A movie theater and a Safeway half a block away. The Seattle center is about a 5 minute walk (2 blocks) with Key Arena (see the Sonics while they're still there), the Space Needle (good restaurant and not insanely expensive), a food court, kids stuff, a GREAT music museum (don't miss it!), and much more (lots of kids stuff if you have kids). Also the monorail is right there ($2) which will take into downtown--only a mile away and an easy walk if you choose--and drop you off right in the thick of things in the Westlake shopping center which itself is a 6 to 9 minute walk to Pike's Market.", "title": "Good location, great views", "helpfulness": 7, "user": "silentcmh", "date": "October 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6008744, "likes": {"liked": "— Plenty of bars/restaurants in the area, nice walk to the Market", "disliked": "— The mattress and pillows!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We were looking for a hotel near the city center that wouldn't break the bank, yet keep us close to the attractions of the downtown area. The Med fits the bill for those who don't mind a bit of a walk - though the walk itself is through nice downtown areas with plenty of shops and restaraunts. If you don't feel like making the mile or so trek back after a night on the town, a cab ride from Pike's Market area is less than $10 (and worth it if it is raining). The staff was friendly, and there is a Starbucks inside the main level. While you won't get wireless internet in the rooms, there are two terminals located in the lobby, and a business center with three more computers and printers on the main floor as well. The workout room was unimpressive, but if you are hard-core you will probably prefer to run along the waterfront anyway. All and all a good choice for younger travelers or those who don't mind a quick cab ride to save some coin on the hotel room price.", "title": "Good location/value for those who can walk", "helpfulness": 5, "user": "Horshack", "date": "April 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7412152, "likes": {"liked": "— Value accomodations in nice area near downtown", "disliked": "— $12 a day for parking"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Great location (for Seattle Center), clean rooms, comfy beds, large bathroom. But the walls were paper thin!!", "title": "Ew, thin walls!", "helpfulness": 2, "user": "cbchriste", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7302270}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "First night we heard the cleaning people at 6 am (woke us up)! Vacuuming, moving dishes around etc. The second night around midnight--for 2 hours--we had to listen to the people next to us having s*x. No matter how loud we turned up the Tele, we could still hear this women's voice. Not a pleasant experience, I can still hear her voice in my head 2 days later!!", "title": "Excellent Location", "helpfulness": 6, "user": "cambriant", "date": "March 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7202955, "likes": {"liked": "— Location", "disliked": "— Quality of bed"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "If you stay here, get a room that will be isolated or else expect to get little to no sleep!!", "title": "Precisely as expected.", "helpfulness": 6, "user": "frankfurtermadchen", "date": "March 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7177570, "likes": {"liked": "— clean", "disliked": "— noise"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the Mediterranean from 16-20 March 2007. Booked the hotel after reading the reviews on tripadvisor and I must say it was as good as we hoped it would be. As we were traveling with our 20 month old toddler, we really wanted to stay somewhere central and clean. Mediterranean Inn had everything we need. From a sink to wash dirty cups to a microwave to heat up milk and fridge, we were glad with the amenities.", "title": "Lovely hotel in a great neighborhood", "helpfulness": 7, "user": "kdaisy", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6924891, "likes": {"liked": "— Location", "disliked": "— Internet was not free"}}], "location": {}, "stars": 2.5, "variance": {"poor": 40, "average": 132, "very good": 347, "terrible": 28, "excellent": 227}, "aka": "Mediterranean Hotel Seattle", "slim_ranking": 0.591397849462, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "We are ideally located for business or pleasure in the vibrant Queen Anne neighborhood of Seattle. The Space Needle, Key Arena and downtown Seattle are just moments away and for our coffee lovers we feature a Starbucks ®Café off the lobby. The hotel is beautifully appointed with the look of the Mediterranean that embraces you with a comfortable and relaxed feeling, each guestroom features a kitchenette and the entire hotel is 100% non smoking."}