{"user_rating": 3.5, "review_count": 492, "name": "Mediterraneo Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed two nights in july. We had a pleasant stay. The hotel is located within a few minutes walk from the termini station and about 15 minutes walk to the colloseum and trevi fountain. Most places of interest are within walking distance as long as you are prepared to walk on average of 25 minutes to get there. Rooms are reasonably sized and clean with a flat screen tv. We had a classic room on the 8th floor and to be fair it was slightly nicer than the pictures up on tripadvisor. Breakfast had plenty of variety and gave us a great start to the day. The only negative I have about the hotel is the service we received from the reception staff. Even though it was functional we didn’t feel that they were as welcoming as we have experienced at other hotels in Europe. However we got a good deal with breakfast included.", "title": "“nice, clean rooms- pleasant stay”", "user": "DaveTJ", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 41256285}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "You felt welcomed from the moment you walk through the doors you are met by a reception desk thatis very caring and polite. The staff was extremley friendly. They were very informative and made reservations easily. This is a 4 Star hotel with the feel of a 5 Stars. They were able to answer all your questions. The weekend front desk staff were amazing. The Roof Garden Restaurant had a teriffic view & food exceptional the price was comparable to other restaurants. The wait staff in the restaurant could not do enough for you they too were able to give you suggestions of touring. The location was great close to tranportation and made touring", "title": "Wonderful hotel.", "helpfulness": 1, "user": "h360906", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40100481}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "easier. We would definitely return. Thanks Mediterraneo....Mary Ann", "title": "Rudest Hotel I have ever stayed at.", "helpfulness": 2, "user": "Hahachick", "date": "August 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 39054238}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Warning: To anyone who plans to take their fantasy vacation to Italy, do not stay here at this hotel. The reception at the front desk was cold and unwelcoming. Once we got into our room that we payed good money for, we discovered that the air conditioning was broken. This is a big problem in the hottest month in Italy. When kindly asked if someone could check our AC in the room, the hotel did not respond. It took 3 calls and a visit to the front desk before they sent someone. Also, when my friend had needed ice for an emergency medical situation, she was told by the UNFRIENDLY staff, \" We can not get you ice. You may have that in hotels in America, but not here.\" We have travelled all over the world and have never experienced such laziness and hate from someone in the service industry. This hotel is archaic and there have to be much friendlier places to stay in Rome.", "title": "Couldn't have wanted better", "user": "caykon", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38248607}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We got the train from the airport as we knew the hotel was near to the train station. On arriving we thought we had the wrong hotel as it looked too smart!", "title": "Average hotel", "user": "negranelly", "date": "August 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 36638140}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Styed in the Mediterraneo on a surprise trip to Rome. Was delighted with the hotel. Located 2 blocks from the train station (Termini) it was handy when we got off the plane to get the train directly into the city centre.", "title": "Lovely hotel, great location", "user": "sloping_fungus", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 33581746}, {"rating": 4.0, "stay_parameters": "Stayed June 2009", "text": "The hotel was lovely with 10 floors, the 10th with a roof terrace/bar which terrific views of the city, well worth a look even if your not staying there!", "title": "Convenient", "user": "JenaC", "date": "June 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 32937986}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The room had twin beds even though a double was booked, easily pushed together! Room was quiet spacious. The only real bad side was that the safe was a bit didgy and took a lot of tries to get finally locked. The bathroom was spacious amd light.", "title": "Great Hotel, Great Location", "user": "scholnicks", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 32674097}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "We stayed here twice this June, for 2 nights at a time. The rooms vary considerably in size - on our second stay we requested a move, as our room reeked of smoke and the floors were uneven and creaked loudly. They gave us a choice of alternatives, so we saw the variations in size. We ended up with an excellent room - very spacious and with a lovely outlook. Most rooms are quiet due to the double-hung windows, although one of our group found themselves over a loading bay, which was unpleasant. On our second stay a gay rights parade, complete with 100+ decibel bands, took place right under our window - after we were tired of watching we discovered how effective the silencing was!", "title": "Great hotel, good location, clean, spacious rooms", "user": "jenVirginia", "date": "June 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32114069}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We found the front desk very efficient and pleasant, and the concierge helpful (our taxis and airport limousine arrived promptly). The breakfast buffet was excellent.", "title": "Great location, rooms pretty dated", "user": "Jordan52777", "date": "May 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 29949828}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Have just spent four days at this hotel and on the whole very pleased with it. Unlike previous reviews we have read, we found the hotel staff to be extremely pleasant and helpful. We arrived at the hotel at 11.30am and were able to check in straightaway. There was a very good choice at breakfast (although the only hot foods were scrambled eggs and bacon). The hotel was well located for the Termini but quite a long walk to the major sights. However, the Metro was very convenient for travelling to the Vatican (only 1 Euro each way).", "title": "Enjoyable Stay - but hotel photos slightly misleading!", "helpfulness": 1, "user": "robert28", "date": "November 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 48756617}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The only slight complaint we had was that our room looked nothing like the bedroom photos shown on Hotels.com (and I think the hotel's own website). The room was quite basic and although advertised as having a combined shower/tub, we only had a shower.", "title": "Arrogant staff at the reception.", "helpfulness": 1, "user": "Brunch4two", "date": "November 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 48656690}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Tea/coffee making facilities would also have been appreciated.", "title": "Brilliant value, excellent location", "helpfulness": 5, "user": "sgperry", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48611584}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "When we check in, the reception apparently did not get our booking . Weird, as we receive their confirmation. To make a long story short, we have encountered a not so helpful staff, A certain lack of professionalism, a bit fed up with the chinese tourists ? This is the impression that we got. Pity as the hotel is well situated , 5 mns from bus and station.", "title": "Loved the room and the service", "helpfulness": 2, "user": "PaSunlover", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 48068269}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "As a base for exploring Rome, this hotel is ideal. We stayed in a Superior Double room and it is probably one of the biggest rooms I've ever had anywhere in Europe. Very clean, very friendly staff, perfect location opposite Termini.", "title": "Good hotel but a bit noisy", "helpfulness": 3, "user": "herculesgal", "date": "October 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 47971537}, {"rating": 4.0, "title": "Good value for money", "text": "As American's living in England, we found this hotel to be of good value for the money. Often European hotel rooms are smaller and don't offer as many in room amenities unless it's expensively priced. However the Hotel Mediterraneo offered a large room including a mini-bar/fridge, free bottle of water, biscuits, shampoo, body lotion, etc. The location is very convenient being near the metro station and very walkable to many sites. We found the staff to be helpful and friendly. Our only complaints were that the room was a bit noisy as we could hear the elevator 'ding' every time it came to the floor we were on and the noise from outside, but it wouldn't be enough for me to not recommend the hotel. Also on a Saturday night the terrace restaurant/bar was unavailable as there was a private event AND the bar downstairs was closed at 9:30 p.m. Was a bit disappointed as we would have liked to get a nightcap drink on a Saturday night. Overall though, very good hotel!", "helpfulness": 1, "user": "StaceyMcC", "date": "October 21, 2009", "id": 47397478}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Stayed at this hotel for two nights in September at the beginning of a Trafalgar tour. The hotel was comfortable although the staff were not friendly and obliging at times. The room was average and there was some noise from the wooden floor above. The location is great with the Termini railway station a couple of hundred metres away.", "title": "Great location", "helpfulness": 1, "user": "Ozjamboree", "date": "October 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 46908978}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Agree with many other reviewers: great location (5 minute walk to train station, 20 minutes to Coliseum and Forum), very clean, service fair to excellent, breakfast room too small but good selection of foods, good value, etc. Rooftop restaurant was very good at good prices, plus excellent views of Rome. Rooms ranged from dark and small to very comfy and roomy. Sister Bettoja hotels next door and across the street (Atlantico and Massimo d'Azeglio) also with good food and meeting rooms. Was there for business but wife loved it. Typical Euro AC fixed at 70F. Noisy if windows opened, but quadrupled pained windows made it very quiet. Restaurants near the hotel (like Trattoria Cecio) were fair to OK.", "title": "Pleasantly Surprised", "user": "Bloodman33", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 46687403}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The hotel was clean. The help at the desk was great. It was in walking distance to many of the sights of Rome, but close to the bus. It was also walking distance from the train, which you can take from the airport, and to many destinations in Italy. The best way to see Rome is on foot, but be careful. The streets are uneven. If you go take time to just sit at any little cafe and enjoy a glass of wine, and watch the world go by. Also, don't miss the gelato-there is nothing like it!", "title": "The hotel was great-Rome was awesome!", "user": "greeneyedtraveler77", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45767909}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at Hotel Mediterraneo the end of August. We were greeted with a warm smile upon arrival at the front desk and were given a beautiful room on the 9th floor. We really enjoyed being able to open our window and see St. Peter's Basilica and the rest of the city sites. Also when we were checking in, the receptionist gave us a card for 2 free drinks on the Garden Rooftop terrace our first day. It was such a pleasant gesture and we used it that night. The front desk was always helpful in answering questions we had. The breakfeast buffet was very nice and probably the nicest we had on our entire trip traveling through Italy. Great location - 2 blocks from the termini train station and metro. Made it really easy to get around.", "title": "Amazing views of Rome", "user": "jaxxmack", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43368086}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 41, "average": 116, "very good": 206, "terrible": 19, "excellent": 110}, "aka": "Bettoja Mediterraneo Hotel", "slim_ranking": 0.470078740157, "description": "The Italian Art Déco Mediterraneo is located in the center of the city: on the Esquilino Hill, the highest of the seven hills of Rome. The elegant penthouse suites of the Mediterraneo command a sweeping view of the city of Rome. The Roof Garden Bar & Restaurant “La Terrazza” has a panoramic view of Rome from its flowered terrace. The Mediterraneo Hotel has 251 Rooms, 5 Conference Rooms, Garage, Roof Garden Bar & Restaurant, Fitness Center, Air Conditioning, TV Satellite, Minibar, Free Wi-Fi."}