{"user_rating": 4.5, "review_count": 2090, "name": "Meeru Island Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I hope you're sitting comfortably......", "title": "Anniversary to remember!", "helpfulness": 10, "user": "Eena", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139060075}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We went to Meeru for our 25th Anniversary and I want to share some of our thoughts with you.", "title": "A bit of paradise to suit every taste", "helpfulness": 5, "user": "chappers56", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139041260}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were in Water Villa 516 and our friends in 517, smack bang in the middle! Perfect place to be and looking straight out to the ocean. Water front heaven! Inside was lovely and we had a fab four poster bed! Outside bathroom and loo which was very strange at first but got used to that.", "title": "Fifty shades of turquoise... and so much more!", "helpfulness": 3, "user": "Wardje64", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138995939}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The food was to die for! So much and such a great variety! We were there for 10 nights and had something different on each one. Chocoholics beware - desserts are mouth watering!", "title": "Amazing honeymoon!!!", "helpfulness": 6, "user": "Lis05", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138774580}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The staff had to be some of the friendliest, happiest people I have ever come across. So attentive and nothing too much trouble!", "title": "It's a great place to stay, forget what others say its nothing but lovely", "helpfulness": 7, "user": "Bridget S", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138759907}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This was the most perfect destination for our honeymoon. It felt like absolute paradise!! The staff were amazing, so friendly and always so eager to bring you another drink when your current one was getting low...no bad thing! The rooms were clean and maintained as such daily by a designated room boy. You also get a designated waiter in the restaurant and so you feel extremely well looked after throughout the entire stay. i cannot say enough good things about this island really, it is truely beautiful. I would say it's more of a couples destination though. I don't have children but i imagine if you brought them here that they'd be at abit of a loose end! One thing i have noticed people mentioning which made me feel dubious about going after we had booked was the rat presence. Yes there are rats, but they only appear at night time and they do not come anywhere near the bars and that. We only noticed them as we tended to sit on the decking outside one of the bars where there were trees and shrubs, and rats tended to crawl from the trees up a drainpipe and into the roof, presumably for heat or shelter. At the end of the day theres rats everywhere and as long as they keep themselves to themselves i did not find this to be an issue, nor something that would put me off going again! Also...if you are worried about going during monsoon season as i was, we stayed from the 2nd august until the 12th and we had 2 days were there was a brief torrential downpour, probably for about half an hour. Then it was over as soon as it began and everything dried up quickly. There was one day toward the end of our stay where it was stormy and remained pretty much all day. Not bad for going during the monsoon season though, it's just a hit or a miss but it didn't put a dampner on our stay!", "title": "Perfect Honeymoon, absolute paradise!!!", "helpfulness": 1, "user": "Melissa M", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137987066}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This is our fourth visit in as many years to the Maldives, having previously stopped at veligandu, villamendhoo and sun Island each island has had something to offer. If we were to grade each island we have been to we would put Meeru 3rd. The staff (the best we've met) and food quality could not faulted many thanks to Sowbrey and Fazeel our waiting staff and Abdulla our room boy. The Island was in many ways the same as veli and villa, being owned by the same company designed and laid out along the same commercial lines but it works well. The lagoon was mostly sea grass you had to swim out quite away to get to any living coral alot of damage created by too many tourists hence not the amount of fish as the other islands which were in the South Male Atoll. The only comment we feel we need to mention is the wildlife every island we have stayed on has had rat,bats,geckos,ants and cockroaches. These are tropical islands and for the out of town experience and the health of the island should be tolerated the complaints we have read were quickly dismissed. The cockroach in our room was soon rounded up using the dustbin and room guide as a cover and released back into the wild. BUT the rats!!! as usual we heard and saw a few until we got to Thursday the 2nd August this may have been something to do with ongoing building work, a supply ship or even the full moon but the rats were everywhere on the north of the Island from our room (509) to dinner, during dinner we watched them playing in the trees outside and return to the room we counted over 30 mainly on the 10 minute walk from our room to the restaurant and back they were very brazen running along beside us and even after seeing us coming some would stop check us out and then run straight at us, I should say after this time the numbers quickly went back to the usual low level amounts but we never felt like walking barefoot around the island.", "title": "4th year in the Maldives", "user": "baz-rochester", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137920553}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Please don't be put off by this review, the overall holiday is everything you would wish for from the maldives on your first visit and mostly what you would expect if you have been before and what keeps you going back for more.", "title": "lovely..but with issues!", "helpfulness": 3, "user": "jaeamyross", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 137907586}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "My wish list would read please crown and champa stop building on this island before you overpopulate it..", "title": "Loved Everything!", "helpfulness": 5, "user": "Chic_chef81", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137774943}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband,myself and 7 year old daughter stayed for 2 wks from 6th aug 2012. We were in a beach villa 257 which was perfect for us as close to the beach and pool and of course the bar.We were told by thomas cook 5wks before our holiday about the beach villas and pool with childrens pool were being refurbished,we were worried by this but on arrival we were given a newly refurbished villa which was lovely and didnt notice any other villas being done. However the childrens pool that they expected us to use was a blow up one situated behind the pavillion pool. We did'nt use this as water was too warm and my daughter couldnt do anything in it. The Pavillion pool is ment for over 18's but we had no option but to use this pool, i imagine guests were a little put out by the fact there where children in the pool, but we paid for her to holiday and she prefers pools to the beach.When you first see the island and its white sand you are blown away but after a few days we were becoming more and more unhappy with some parts of the island. As we had a child we were limited to where we could go and the best parts of the beach were the adult only end. The soft white sand is there but walking into the sea you have to walk through dead coral, we had to buy water shoes to make it a bit easier as every day it was more and more unbearable to stand on. I read reviews on here for weeks before our holiday and thought some maybe a little over exaggerated, but although most of it was good there were more bad.There was a boat sucking up sand about 30ft from our villa onto the beach which was bringing coral with it and this was being used to replace unsandy parts, so we had to wear flipflops.We had a builders yard behind us and was woken every morning to the sound of a digger and electric saw. There is a constant droaning sound from the generator and around the pool you smell the diesal and some days it was nasty. They are planning to build a new 24hr bar also which i imagine will be not good.We know that the island has to be maintained but the work that is going on there is not minor and i feel that the island should be closed for a couple of months to do this amount, the pool is no where near finished and there is a block building being built beside it and the 2 weeks we were there never saw anyone working on it. We took insect repellant but i got bit so many times i had to stay in for 2 nights. There are large ants, which every night returning home were in the toilet, midgy flies and yes there are rats. We seen the most sitting outside the dhoni bar, watching them scurry up and down a drain pipe, and no im not exaggerating, we never seen them in the day just evenings. We did enjoy our holiday as it is very relaxing, apart from the 5 days rain we had.The food was outstanding. The waiters,bar staff, room boys were lovely. We spent most of our evenings in the pavillion bar as this was the most friendly and relaxing bar to us, the other bars were nice but never really built a rapport with the staff. our daughter spent a lot of time in here as Alwyn,Shereff, Anthony and Billy whom we knicknamed as his name was a mouthful to remember, loved her and really made a fuss of her, and as it was just meters away from our villa she used to fall asleep on the sofa and we carried her home at the end of the evening.All in all, we wont be revisitng meeru as we felt it was like a building site. The beach spoilt it a lot for me. Also a little pricey, check what you have to pay for and what not, we were AI but still spent $1800. I dont usually write reviews but reading some of them, i think make it out to be the best but clearly they must not walk near the middle of the island just around the island or maybe not as fussy. We have complained to thomas cook as we were really unhappy and wasnt worth the money that we paid for it due to the disruption.", "title": "Wonderful holiday!", "helpfulness": 1, "user": "atuckbyash", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137757986}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I work in the Travel industry and this was my 2nd time staying at Meeru.", "title": "Truly Amazing", "helpfulness": 2, "user": "chriscook7", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31014922}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I cannot fault it in anyway and it was even better than when i was last there 2 year ago.", "title": "Absolute Paradise", "helpfulness": 2, "user": "mandyflo", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30985432}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "They have a new pavillion bar at the end of the 300 JWVillas, a new open planned check-in area/ bar, Cinema Screen and a Fantastic new 3G football Pitch !", "title": "Fantastic honeymoon in stunning Meeru", "helpfulness": 3, "user": "Gennard46", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30547623}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The Island has something for everyone, The staff were really friendly and nothing was too much. The Asian Wok is an extra cost but food there was fantastic", "title": "Best paradise bang for your buck", "helpfulness": 3, "user": "TravelAddictCouple", "date": "May 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 30472605}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I would recommend going all inclusive as soft drinks, water and alcohol is not the cheapest i.e 5% for a 300ml bottle coke.", "title": "Amazing Island", "helpfulness": 5, "user": "shanekindy", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30440267}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I read all the positive reviews on TripAdvisor, and booked based on that. After having spent a couple of weeks on the island, I thought it was worth giving some feedback - as it may be different from what other people had written.", "title": "A different Maldives experience", "helpfulness": 5, "user": "gilesc", "date": "October 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46399161}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "My initial impressions of the resort are that it's similar to a the resort complexes in somewhere like the Mediteranean - with the associated activities etc. Nothing wrong with that, but it's not really what I was looking for, or expected.", "title": "pure paradise, truly breathtaking", "helpfulness": 4, "user": "holmos", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46291864}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The island is an undeniably beautiful place, as are the Maldives in general.", "title": "You Can Make It What You Want - as long as you know a few things...", "helpfulness": 4, "user": "brownie_CE", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 46172987}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The snorkelling was fairly average, the lack of a directly accessible house reef is a bit of a pain, There is a twice daily boat trip to the islands house reef, at a small cost. But obviously that limits your ability to come and go as you choose.", "title": "My nails are recovering - they had to drag me back on to the plane", "helpfulness": 7, "user": "LondonDavidS", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45876393}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "To use a couple of other examples where I've been, the snorkeling on Bandos is far better, closely followed by Sun Island.", "title": "Fab relaxing honeymoon, shame about the initial room downgrade!", "helpfulness": 7, "user": "Ickleme", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45782644}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Just returned from two fabulous weeks in Meeru having left on 1st June. Whether it rains or shines, its a beautiful, relaxing resort. Having been to the Maldives before I would say that Meeru's biggest USP is that the resort provides something for everyone. Its one of the biggest islands with a wide age and demographic range of guests who are down to earth. Its friendly without being intrusive as its obviously couples-orientated. Whether you want to dive, hire boats, experience fishing, dolphin watching and desert island excursions, play tennis, football or knock a golf ball around, or just chill and snorkel around the shallows, its all there if you want it, fine if you don't.", "title": "Could have done with another week!", "helpfulness": 2, "user": "CyproMike", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31618017}, {"rating": 5.0, "title": "Paradise for Pounds \" A Bargin\"", "text": "The bars are varied and service is good. The freshwater pool is excellent. The restaurants' wide choice of 3 to 4 star, vegetarian friendly food is very reasonable and good value. The all inclusive option is a good deal; we got through 4 litres of water a day which paid for it alone. The inclusive wine and Tiger beer are very drinkable as well. The Asian Wok was a little overrated for the price in our opinion, surprisingly that was more to do with the service than the food, but the setting is truly wonderful. Worth a visit for sure. The spas and treatments are fabulous.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 3, 2009", "id": 31508775}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "There are so many accurate TA reviews of Meeru it is difficult to bring anything new to the table, but here goes:", "title": "Excellent time! Terrific island- paradise!", "user": "rocksta", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31492948}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Doha Airport", "title": "Perfect Honeymoon - Dream resort", "helpfulness": 2, "user": "thechampishere", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31390818}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We had long stop overs, but the airport's not bad. You can leave the airport by paying US$30 for a visa if you have a lot of time to kill. A hotel will cost US$100 to $150 or you can explore Doha. Ground staff in the airport are extremely helpful if you have questions about this.", "title": "Memorable holiday, but downgrade disappointment", "helpfulness": 3, "user": "chrisbeach", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 31160016}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I am from Mumbai, India; and my wife and I planned our honeymoon im Maldives. Meeru came across as a good choice, and to sum it up, we did go the the resort with certain benchamarked expectations, but the stay exceeded all expectations! We were there for a week, and stayed in the Jacuzzi Land Villas. We did have a downgrade for a day at a regular Land Villa, but general impression was the resort does tend to overbook. The rooms were great, esp the outdoor bathroom and jacuzzi, and were cleaned twice a day. In spite of being on a 1.5km stretch of land for a week, there are a lot of activities to be done. We did the snorkelling, night fishing, Robinson Crusoe, Kayaking, submarine trips, and just swimming in the sea. Food at the resort was good with a large variety catering to all palates, and personally the breakfast was found to be the best meal of the day. We had taken the all inclusive package which is a more economical and easy way to have fun.", "title": "The best plae to celebrate a marriage!", "helpfulness": 4, "user": "AashishTrivedi", "date": "May 21, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 30437339, "likes": {"liked": "— Wooden cottages with comfortable arrangements. Outdoor bathroom with jacuzzi did the trick.", "disliked": "— The wood roof and walls would retain the heat of the sun, thereby nullifying the effect of the air conditioning in the afternoons."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The bars and the restaurants were great (we generally dined at Maalan - on the north of the island), and the staff is extremely polite, helpful, and go a long way in making the stay more memorable. A special mention to Caroline - our guide cum expert. and Claudia - the head customer relations.", "title": "Paradise but beware of the downgrades", "helpfulness": 3, "user": "chrisdawson32", "date": "May 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30192970}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "The prices at the in house shop were reasonable, and in spite of the island running at full capacity, we could enjoy our privacy...", "title": "Awesome experience", "helpfulness": 2, "user": "cubex", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30125755}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "All in all, it was a memorable trip, and we shall definitely plan a trip to Maldives again :-)", "title": "Amazing honeymoon", "helpfulness": 2, "user": "haders79", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29608199}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Aashish Trivedi", "title": "A fabulous 2nd part of our honeymoon - almost paradise", "helpfulness": 3, "user": "mrsswood", "date": "May 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29600282}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "An excellent Maldivian island. Good accommodation with a wide range of activities if you want them.", "title": "Great Island", "helpfulness": 3, "user": "theflyingscotsman59", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138300089}, {"rating": 5.0, "title": "Bliss", "text": "Staff are very attentive and do their very best to help.", "helpfulness": 1, "user": "Claire S", "date": "August 24, 2012", "id": 138248757}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We booked a deep sea fishing trip and on the morning we went out there was a lot of cloud and a bit of drizzle. Ten minutes out to sea, it became a bit choppy.....another ten minutes and it was like an aquatic fairground ride. So...we ate a little breakfast and waited for the weather to break. It didn't. It got worse. Only day of the holiday we had bad weather. Sod's law....but hey, how often do you get a white-knuckle fairground ride in the middle of the Indian Ocean!", "title": "sun sea sand", "helpfulness": 1, "user": "MrsMac1963", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138217710}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "We decided to head back for land. We were out for two hours (of a four hour fishing trip) and didn't touch the rods once.", "title": "Absolute paradise, perfect honeymoon", "user": "Lindsaydaubney", "date": "August 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138177249}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "How much did this cost? NOTHING. We were not charged for the trip. Thank you to the resort for that. I've made a charity donation to acknowledge their generosity.", "title": "Much prefer Kuredu Island", "helpfulness": 2, "user": "Anne1761", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 138093769}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Myself and my husband went to the Meeru for our 5th wedding anniversary, it was an excellent holiday. Think turquoise sea and white sand decorated with palm trees.It is very hot and bright therefore i recommended taking a straw hat and very dark sunglassess, also high factor sun screen. Despite the intense sun there are loads of options of sitting under palm tress and still enjoying the amazing view of the beach and sea. I e mailed the resort before we arrived and asked for a room in the 600s , i got a very quick response to my e mail and on arrival we were granted a room no 617 which was lovely. This was a jaccuzzi beach villa and ensured that we ate in the adults only restaurant which appeared better than the other restaurant, we ate outside every night. The staff were wonderful and very attentive. There was great food with a wide variety including traditional English ....personally i enjoyed my Sunday roast sat looking at the beach. Evening entertainment is very relaxed with soft music playing while you sit on cushioned wooden benches looking at the moon shimmer on the sea. If you wanted you could go for a drink to the other end of the island ,where they did once a week have a disco night and twice a week had live music. Our favourite was an accoustic band who played classic rock on the beach surrounded by candles......brilliant. The Asian wok is a restaurant which you have to pay extra to eat in, however you can go and have a drink with the all inclusive option i absolutely recommended doing this to enjoy the sunset. Certainly go for the all inclusive option as we drank three litres of water each a day and this alone would cost a lot of money if you were only full board. Also the all inclusive package entitles you to two trips the sunset cruise was good (saw dolphins) and the fishing trip was okay. Snorkelling is good but did not have a house reef ...however you could pay to go on a boat to a reef. Overall be careful as there is apparently a risk of overbooking rooms however when you get there if you are in a jacuzzi beach villa or above you have an option to go island hopping to another island or a cruise ...we would have been keen but sid not want to risk losing our room. We have been to the Carribean but the Maldives was even better. Prepare to be spoilt in paradise,.", "title": "paradise", "helpfulness": 2, "user": "pampered44", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29585254}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I won't go into much detail because I found it all quite upsetting as this was our honeymoon, but we were due to be staying in a jaccuzzi villa and on arrival, after 30 minutes of waiting while they got the other guest's out of the way we and 4 other couples were sidelined and told that they had no rooms for us. We were put into temporary accomodation which was terrible!, ( broken furniture, a septip tank for a view and red ants) for 2 nights ( according to the rep this has happend a lot). Other than this and once in the right accomodation, our stay was fantatstic.", "title": "An amazing island, but very dissapointing to be downgraded on our honeymoon!!", "helpfulness": 2, "user": "KMPitts", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29455614}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The jacuzzi water villa was amazing. Although the actual jaccuzzi didn't work too well. We stayed in the 700's which were private and peaceful with steps straight into the sea, this part of the island also has an adult only restaurant which was much calmer than the restaurant in the centre.", "title": "Paradise with a touch of Pontins about it", "helpfulness": 1, "user": "5th_Attempt", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29403478}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "There are plenty of bars around the island that each have different qualities. Our favourite was the small wooden bar by the 300's. But the 'ship' is a great place to enjoy cocktails and watch the impressive sun set.", "title": "Heaven - Stay here!", "helpfulness": 1, "user": "neil-amy", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29316276}, {"rating": 5.0, "title": "Great Place", "text": "We had a his and hers massage in the over the water Spa, which was amazing! myself and my new husband were very relaxed after and were sent off with a bottle of champagne - perfect and if your nervous about stripping down, its fine they are very careful with keeping you covered.", "user": "BryanMumbai", "date": "May 4, 2009", "id": 29274244}, {"rating": 4.0, "title": "Nice resort for \"all-inclusive rest\"", "text": "The Meeru Island Resort is very nice hotel in the Paradise of Earth.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 28, 2012", "id": 138635360}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The food is delicious but everything is very spicy! But at the hotel everything is expensive. If you experience \"all inclusive\" the bar in the room and alcohol are not free of charge. Softdrinks are included in the price of room. The local whiskey and vodka are not very tasty, i don't recommend it.", "title": "Jacuzzi water bungalow", "user": "6Lovelyliz", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138475864}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The things we did not like: a lot of rats, they are eveywhere! We went on a trip to Male, nothing much interesting. Souvenirs in the city are expensive, but you can bargain.", "title": "Great location, lovely Jacuzzi Water Villas, a bit package holiday in some respects", "user": "Pollenstein", "date": "August 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138386105}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Overall it's a nice all inluseive resort with the beatiful nature beaties around. Come by if you ever travel to Maldives.", "title": "Dream honeymoon", "user": "vlad4321", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138378505}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We have been to the Maldives four times and stayed twice on this beautiful island. The first time we stayed in a beach jacuzzi bungalow which was amazing, but then discovered the water bungalow which is just out of this world. Relaxing in your jacuzzi looking out onto a turquoise Indian ocean, turtles if lucky ,schools of beautiful coloured fish,reef sharks,manta rays,sting rays it just couldn't get better. The island is white sand,you can walk around the island in a short time passing through banana and coconut trees. Breakfast ,Lunch and Dinner is buffet style , fresh fruit,salads,fish just caught from the ocean and plenty of freshy cooked wonderful food.We made the mistake of booking bed and breakfast the first time we experienced the Maldives on a what seemed like a good deal, we ended up spending a fortune on drink and meals and learnt half board , full board or all inclusive is best. There use to be a sea plane that took us from Male where you land to the island, but apparently now it's boat whichs takes longer . Shoes are not required whilst on island so at the end of your trip , feet are super soft.", "title": "25th wedding anniversary heaven!!!!!!!!!!!!!!!", "helpfulness": 3, "user": "Lynn0665Durham", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138341493}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at Meeru for 10 days in October 2009, we booked with Hayes and Jarvis and flew out with Qatar Airways.", "title": "Magicial Meeru- A fantastic stay", "helpfulness": 3, "user": "Geo2006", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47891070}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Our room was a standard room- the room was very spacious, with a large double bed, mini bar, satellite tv, hairdryer and safe. There`s quite a few reviews on tripadvisor berating standard rooms, however we found ours to be of good quality and were pleased with the room.", "title": "The friendliest most amazing place!", "helpfulness": 1, "user": "fiona604", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47887981}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The food is fantastic- not once during our 10 day stay did we have the same dish twice. Only breakfast you get the same options, however there are so many different foods to try. Dishes ranged from local curries to freshly grilled local fish, fried rice, noodles and pasta made to order, roast lamb, vegetable mousakka & beef goulash. The desserts range from cheesecake to hot chocolate pudding to pineapple upside cake.", "title": "paradise- exceeded all my expectations", "helpfulness": 1, "user": "Reneesme", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47817887}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The dive centre is fantastic- very professional, there is a big catalogue of dive sites so you can read up on each site before you decide which ones to dive. There are trips daily ranging from 2 hours to all day. They also regulary have night dives. The staff are friendly and professional,", "title": "Our Amazing Honeymoon at Meeru", "helpfulness": 4, "user": "smileyleanne", "date": "October 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47503984}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The Hayes and Jarvis rep, Pete was helpful and answered all our queries promptly. You don`t need to carry any cash around the island as everything is put on a tab which you pay when you check out. We would definetly recommend going all inclusive or full board at least.", "title": "THE ULTIMATE PARADISE RETREAT", "helpfulness": 1, "user": "mjbrum", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47449527}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "What can I say about one of the most beautiful places I have ever been to. Meeru is a fantastic holiday destination it was the best holiday that I had ever had!", "title": "Amazing Meeru", "helpfulness": 4, "user": "Diwinny", "date": "November 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48475529}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We flew out with Monarch , I had upgraded our seats to the Premium Class service on the way out , only extra leg room on the way back. The service with Premium class is much better, but you basically pay for standard service that you would get on a long haul scheduled flight ie: tv's in the back of your set , complimentary headphones , inclusive drinks and choice of in flight entertainment . You don't get this service in economy be warned you have to pay for all drinks, headphones and the tv's are overhead and the food is also not as nice as the Premium class, I don't think I would ever fly Monarch on a long haul again !!.", "title": "Amazing - cant wait to return!!!", "helpfulness": 3, "user": "jaimebriggs", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48418824}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Arrival at Male is well organised and the speed boat tranfer was excellent. On arrival at Meeru my only qualm was that check in took ages over an hour and half, but there were a large number of guests to deal over 100. But it was done in a very calmly , we all took a seat and waited until we were allocated our villa. I had orignally booked a water villa but fortunatley for us we were upgraded to a jacuzzi water villa 726. We were told that we would stay in the JWV for 2 nights and then go into the water villa after that. It seems that Meeru is currently converting all their water villas to JWV so at least 6 of them are not available.", "title": "Best holiday ever but some minor issuess", "helpfulness": 3, "user": "Chrkol", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48358991}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Villa was breathtaking ! it was beautful , clean and spacious with all the home comforts , plasma tv, dvd player , expresso machine and wi-fi access. The food was lovely , so much variety it catered for all tastes mainly a european theme to the food but I have to say that Friday is traditonal maldive cusine and it was was my favourite night. Our waiter Didi was lovely and really looked after us , he even set up a table on the beach on our last night as a special surprise . The staff in general are fantastic the cannot do enough to look after you , when you walk around the island they will always greet you , I don't think I ever spoke to anyone who wasn't curteous. The Island is what you make of it, if you enjoy a bit more action the south of the island is the livelier part , flim nights, crab racing etc. The north end of the island is quieter and has no live entertainment. I originally choose Meeru because my husband likes to be on the move a lot but to be truthful this is the first holiday he has had were he totally chilled out . We never used any of the facilities that we planned like the Tennis, Golf or Gym.", "title": "Nice but there are many better Islands in the Maldives", "helpfulness": 3, "user": "Dave501", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 48101045}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The new infinity pool had just been opened ( two weeks) and I have to say it was absolutely stunning , fantastic location and with two jacazzi areas in the the pool. There are plenty of trips available and the nice thing is that because they are organised through the hotel you don't get a hard sell by your rep to go on them.", "title": "Fantastic!!!!!!", "helpfulness": 1, "user": "Cazza201159", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48045560}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My partner and I have just returned from Meeru. This is the 4th resort we've stayed at so have seen some of the variety of holidays available in the Maldives.", "title": "Meeru - a very enjoyable holiday!", "helpfulness": 3, "user": "MaldivesJunkie", "date": "October 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 47297781}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "When travelling to the Maldives certain things can more or less be taken for granted - the weather will usually be great (in the high season), the beaches and sea are picture postcard stuff. The main differences in resorts are in relation to the standard of accommodation, service of staff and the facilities/activities on offer. The weather was fantastic for both weeks we were there. I'd certainly advise high factor sunscreen as some guests were very very red in the first couple of days (the UV index was 12!!) which must have affected their holiday. We didn't burn however and have both come back looking more like the locals of the island thanks to factor 40 in the first week and 25 in the second!", "title": "Fantastic Holiday, beautiful location!!!", "helpfulness": 4, "user": "sherazandaneesa", "date": "October 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47240897}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Thankfully, we didn't suffer any problems with our room allocation - although be advised that the 'Jacuzzi Beach Villas' in the 600's are not on or near the beach! In fact with the exception of a small few, you can't even see the beach from them. Our villa was probably 50 yards from the beach with a large tree/shrubbed area in front. A bit disappointing but not that much of a problem as we asked to be placed there so we were at the 'adult' end of the island. The villa itself was fine although perhaps a little 'tired' looking.", "title": "Every moment is magical at Meeru!!!", "helpfulness": 2, "user": "I_Love_Sunshine1", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47240289}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The island is large compared with most others and as such caters for the variety of tastes of its guests. If you want peace and quiet and no children the north end of island is ideal. If you want something a bit more lively with activities and entertainment the central part of the island is good. The new pool on the opposite side of the island is lovely although it wasn't quite finished and could be a bit 'smelly' at times due to being located near the 'industrial' hub of the island containing generators and septic tanks.", "title": "ABSOLUTELY FABULOUS!!", "helpfulness": 2, "user": "uggTeeside", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47162514}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The lagoon is beautiful although as there isn't a house reef there isn't the variety of fish to see. That said, snorkelling at the north end of the island was ok as there are a few up there including some very large sharks! The lagoon near the new pool is also ok with lots of Titan Triggerfish amongst others.", "title": "Meeru Island - Standard Room - Amazing", "helpfulness": 2, "user": "BrisolGirl", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46994807}], "location": {"continent": "Asia"}, "stars": 4, "variance": {"poor": 45, "average": 112, "very good": 417, "terrible": 31, "excellent": 1485}, "aka": "Meeru Island Hotel North Male Atoll", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Meeru Island Resort, surrounded by a beautiful lagoon and long stretches of white, sandy beach, is the only Resort on the island of Meerufenfushi, North Male’ Atoll. It is 1200 meters long by 350 meters wide, about 90 acres. Your speedboat transfer from Ibrahim Nasir International Airport is a scenic, 55 minute ride"}