{"user_rating": 4.0, "review_count": 322, "name": "Mercure Hotel Trier Porta Nigra", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "You can't get a better location to stay at when visiting this gorgeous city. Right in front of the main gates. Highly recommend a room facing the ruins as they light up at night and it really is gorgeous to see. The front reception staff was very helpful, allowed us to store luggage before our room was ready etc. It is an easy and safe walk to the train station. Reception also made great dining recommendations!", "title": "Gorgeous Views", "user": "cccanada", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143761205}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Have stopped here both for a long weekend and 1 overnight stay. The hotel is in a very convenient location for the town centre and for exploring around the Rhine valley which is close by.", "title": "Wonderful location, comfortable hotel", "helpfulness": 1, "user": "sasperella", "date": "October 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142797509}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is comfortable, clean with a good restaurant for both evening meal and breakfast. Would definitely stay again", "title": "Porta Nigra view", "user": "mortam", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142194277}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We arrived early, our non-smoking room was not ready so we were upgraded to a suite in the 5th floor looking directly at the Porta Nigra---good beginning. Not only was the suite massive, it was VERY comfortable. Furnishings were 1960's Scandanavian, stark and not our taste but functional and comfortable.", "title": "Good views, great location, nice hotel", "user": "JUDITHbristol", "date": "October 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141730725}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Dinner very good. Full breakfast is 16euros and all we eat in the morning is a bread roll and coffee, which we got at reduced cost.", "title": "Porta Nigra View", "user": "PDJ", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141686415}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Hands down best Mecure I have stayed in to date. Great rooms, great view from my window of the Porta Nigra. Friendly service. Would stay again. 148 euro.", "title": "re: Hands down nicest Mecure I've been to!", "helpfulness": 1, "user": "ArmySpousechicagoil", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134024166}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I just took a quick trip to Germany. One of the places we visited during our travels was Trier, Germany. I booked three nights at the Mercure Hotel Trier Porta Nigra on short notice. I got a good rate-- three nights cost about $430, not including breakfast or Internet access. This hotel is an easy walking distance from the train station and is situated directly across the street from the Porta Nigra.", "title": "Hotel Mercure is clean and very convenient", "user": "knotheadusc", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131010450}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "We arrived at the Mercure hot and thirsty after a long, crowded train ride from Cologne. The staffers were very friendly and ready to welcome us. We were assigned a room on the third floor, facing away from the street. The window in our room was open. We shut it, which allowed us to use the air conditioning and shutting out the noise from the bar across the street.", "title": "Excellent location, Clean, Friendly!", "user": "RideOrDie765", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130903324}, {"rating": 5.0, "title": "Definitely a top choice. You cannot go wrong.", "text": "The room was very comfortable and had a flatscreen television, desk, phone, and large bathroom. There was a tub/shower combination which took me a try or two to figure out. The trick is to pull out the shower button before you turn on the water or pull very hard. Otherwise, you'll be taking a bath! If you like hot towels, you're in luck. The room has a towel warmer. We didn't use it, of course. You need to use a card to keep the electricity on, but the good news is any card will do. My husband kept our lights on using a grocery store loyalty card! Very handy if you want to keep the room cool when you're out. The room has a minibar. I thought the prices were somewhat reasonable and partook of a Coca-Cola one night. Internet is available for nine euros per 24 hours or 35 euros for a week.", "helpfulness": 2, "user": "B P", "date": "May 26, 2012", "id": 130634568}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "On of the best locations - right across the Porta Nigra. Rooms were very spacious with Porta Nigra view from the window. The breakfast was awesome and still cannot forget :). Stayed there for couple of nights and had a pleasant time.", "title": "A very good place", "user": "tourhunter", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139716797}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel overlooks the Porta Negro at the start of a very large pedestrian center, the Ideal location in this beautiful city. The hotel breakfast was expensive at 15 euros, but within 2 minutes walk you have a choice of coffee shops or bakers at less than half the price.", "title": "Good location", "user": "hortsy", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139631293}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We stayed three nights in August 2012. Excellent service in reception. Good advice on restaurants for a meal. Clean and high standard room. Hotel breakfast with good choice. Very good locations for trips on the Mosel river or a train ride to Luxembourg. Old city of Trier has a lot to offer,", "title": "Good value for money - good location", "user": "retired43Oslo_Norway", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137797917}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "You cannot get closer to the Porta Negra, it is across the street. This is a very good part of the Mercure chain. Staff is excellent and attentive. The breakfast in typical first rate german style. It is close to the grand pedestrian center of the old town, near the market square and only a little walk to the Cathedral and St Gongolf.", "title": "A very good link in the Mercure Chain.", "user": "Buppa1", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136154920}, {"rating": 4.0, "title": "Fantastic location, and nice rooms", "text": "Stayed here for a very reasonable €65 as part of a summer special, and was very pleased with the room and the hotel overall. But the charge for the Internet was surprising at this class of hotel. Location cannot be best, right across from the Porta Nigra.", "user": "James_Glucksman", "date": "July 23, 2012", "id": 135178673}, {"rating": 2.0, "title": "So sad !", "text": "I have never really liked this hotel. Despite being located just in front of Porta Nigra, it never won my heart. I have had to stay in this hotel a number of nights over a few years before my Company switched to another hotel. Mid December 2012, back again as the hotel of our choice was fully booked.", "helpfulness": 2, "user": "Travellersfromswitzerland", "date": "December 17, 2012", "id": 147593100}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "When entering the reception, I had the impression that nothing has changed in this hotel: in the breakfast room, I found the same old sadness hanging over there for years. The breakfast is modest, but adequate to hotel rates (in my case, it was included in the hotel rate).", "title": "Clean, comfortable and central", "user": "Lynn C", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145663970}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The room was correct, with a view on Porta Nigra and passing cars in front of it. When you do not enjoy your view, the cars noise stays. The bed was incredibly hard ( room 418), same for pillow: hence I see no possibility to get used to it, given its hardness and 30 cm of height. The bathroom was spacious.", "title": "Porta Nigra", "user": "wdesmet", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145307985}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "In the morning, when i woke up, I could not switch bedside light on, this being said, this is one of the minor issues. When i got to drying my hair, I noticed that hairdryer was not working. I called housekeeping and the girl brought another hairdryer within 5 min. This one, however, did not work neither and I had to call housekeeping again asking to check if electricity was on for appliance sockets. Indeed, the girl confirmed to me that the switch was off. After 10 min of investigations i could finally dry my hair...", "title": "The view!... that's it.", "helpfulness": 1, "user": "StephT06", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 144987267}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Check-in / Check-out is efficient and reception staff friendly. Beware: WiFi connection is being charged.", "title": "Great hotel, great view's.", "user": "bigmanJohannesburg", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144357994}], "location": {"country": "Germany", "continent": "Europe", "city": "Trier"}, "stars": 4, "variance": {"poor": 7, "average": 40, "very good": 167, "terrible": 2, "excellent": 106}, "aka": "Accor Hotel Trier Porta Nigra", "slim_ranking": 0.170212765957, "description": "Next to the world-famous Porta Nigra and just a few minutes from the historic center, our modern 4 star hotel bids you a warm welcome with its 106 rooms. Our restaurant features a view of the Porta Nigra, the tavern Salong, the international casino of Trier, conference rooms and a fitness center (near the hotel) with medical section, sauna and solarium."}