{"user_rating": 4.5, "review_count": 239, "name": "Mercure Clear Mountain Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "A bit out of the way & still being updated. the day spa was not finished. the pool & tennis court needing work. the gym is small but has all new gear & a great outlook.", "title": "the view & the peace", "user": "wiskey", "date": "November 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86114172}, {"rating": 5.0, "title": "Escape the city", "text": "the room we stayed in had views over the bushland to the lake & bay from a good sized balcony. full height & width windows gave a great outlook & being in the front row was still private.", "user": "A TripAdvisor user", "date": "November 5, 2010", "id": 86103813}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "the dining areas & bar take full advantage of the views, which are great day & night. the menu is limited but the food is really good, backup by friendly prompt service.", "title": "A Hidden Gem so near to Brisbane", "helpfulness": 2, "user": "KiwiExplorer", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71433036}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "our stay was midweek so all was quite but the weekends could be loud?", "title": "You have to come here if only for the food", "helpfulness": 2, "user": "BrisCaz", "date": "June 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 16576976, "likes": {"liked": "— The food in the restaurant and the views", "disliked": "— Very basic rooms"}}, {"rating": 4.0, "title": "Great Mountain Outlook", "text": "I stay here once a month and have done so for past 18 months it is a wonderful bushland mountain setting, great atmosphere, friendly staff and the food is excellent.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 11, 2006", "id": 4965589}, {"rating": 3.0, "title": "Resort is tired and rundown", "text": "Have stayed here many times but since Quality Hotels have taken it over it has become tired and rundown. The pool was dirty and full of leaves, the outdoor furniture was scattered about with empty bottles on the tables from the night before. The outdoor area around the Sanctuary Spa was messy. We had booked lunch in the restaurant and spa treatments for the afternoon. Menu choice for lunch was very limited and food was so-so. The Spa is a separate business from the Hotel but was very disappointing as the Therapists didn't seem to know what they were doing. If you want a pampering Spa experience I would not recommend this one. The whole place had a ghost town like atmosphere, whereas once it was vibrant and top class and bookings had to be made well in advance...which should have served as a warning as we booked the package on Thursday for Sunday and had no trouble getting in. There were hardly any diners at lunch and we were the only 2 for the day spa...Our treatments were supposed to be 1 hour 15 mins but only lasted 1 hour...negotiated new price accordingly.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739089}, {"rating": 4.0, "title": "De-stress at Clear Mountain", "text": "Would recommend going elsewhere for spa treatments.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 20, 2005", "id": 3684791}, {"rating": 4.0, "title": "Breathtaking views", "text": "I arranged for 10 of us to go away for my best friends \"hen's\" weekend. We booked 5 rooms, but unfortunately they were spread throughout the resort and not together. Our package was fabulous value, as it included a 3 course dinner in the restaurant (service and views are top quality), one night's accommodation and a full buffet breakfast the next morning. We were also supposed to get a bottle of champagne and strawberries per room but they were not supplied. However, when we mentioned it before we went in to the restaurant, they gave us the 5 bottles and 5 lots of strawberries to have with the dinner instead, so all worked out OK. Be aware that the spa has nothing to do with the hotel. We had booked treatments in the afternoon for all of us, and this must be paid for and arranged for separately. The reception staff were helpful, but weren't able to tell us who each person was sharing a room with when we checked in, even though I had given them this information beforehand. The resort is only 30 minutes north of Brisbane, yet you feel a million miles away as you drive up the mountain. The rooms all have fantastic views, and although they look basic from the outside are nice inside. The sound proofing between the rooms is not great either, however, I had such a great time with my girlfriends, especially in regard to the wonderful food and views, that I have booked to go back in the next month with my husband.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "August 1, 2004", "id": 2349810}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 7, "average": 20, "very good": 108, "terrible": 1, "excellent": 103}, "aka": "Clear Mountain Hotel Clear Mountain", "slim_ranking": 1.0, "description": "Clear Mountain Lodge is located on a mountaintop among 20 hectares of native bushland and gardens, 35 minutes from Brisbane. Offering breathtaking panoramic views of the Glasshouse Mountains and Moreton Bay islands, this amazing lodge features 53 rooms with private balconies, plus a restaurant, bar, pool, gym, day spa, conferencing facilities. Offering true relaxation in serene surroundings, Mercure Clear Mountain Lodge is the ideal option for any occasion."}