{"user_rating": 4.0, "review_count": 716, "name": "Mercure Stratford-Upon-Avon Shakespeare Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We went to the RSC so stayed for one night at the Mercure. The room was spacious and quiet, and good value. Not perfectly clean (toothpaste in the sink and on the taps) but that doesn't bother us too much. The odd thing was that the reception never answered the phone, despite us trying again and again over the 24 hours we were there. The room service button on our phone was broken so there was no way to contact anyone apart from going down to reception ourselves, which sometimes wasn't manned, and sometimes had a long queue. They forgot to deliver our paper in the morning as requested, so overall we felt there was no care or attention at all, despite it being convenient location - we won't be back next time.", "title": "Convenient but no attention", "user": "kate w", "date": "January 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123817316}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Lovely hotel full of old charm ! We have just arrived home from our one night stay at the Mercure Shakespeare. Our bedroom was amazing, infact it was more like a suite with a seperate lounge area. Plenty of space. My parents also stayed over. Their room was equally as nice but slightly smaller with a newer bathroom. Both rooms were immaculate and completely addequate for what we wanted. Stratford is a beautiful town. We also visited Leamington spa and Warwick before heading home. What a lovely part of the country ! This is the 2nd Mercure we have visited in the last 12 months having stayed at the one in Bristol as well. Highly recommended and fantastic location in comparison to the other hotels recommended on trip advisor.", "title": "Fantastic mini break - Lovely Hotel", "user": "derby1012", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123745988}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Have stayed at the Shakespeare lots of times for various reasons and usually find it makes me smile a lot. And there was still good things this time, it's just that I didn't feel as \"looked after\" as before. Reception was great - efficient, pleasant and helpful. I was helped with my bag without any fuss and I stayed in a room I've had before - small but fine. No bottled water in the room this time which was a shame.", "title": "having an off day I guess", "helpfulness": 1, "user": "gloria-a-c", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123619588}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "We arrived a bit late and so ate in the restaurant and sadly, it was not great. The restaurant has lost the smartness of the past - more bistro than restaurant now and somehow that just doesn't suit the Shakespeare - slate platters, no tablecloth etc - but it's a style which sits uncomfortably with the stately lady which the Shakespeare has always been. I think hotels should try to keep to their character (if they have one) and the Shakespeare has one, it's not chic, it's grand/cosy - not European, traditional English.", "title": "Simply divine...", "user": "myinelegantlove", "date": "January 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123509691}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "My partner had tortellini which was ok, and I ordered cod loin. Their food is nouvelle and so the portions are small - without veges it's just not enough - I haven't got a huge appetite but even for me it was much too small. When it arrived we had to ask for some veges because it was never going to be enough - the only thing available was green beans which arrived when we'd virtually finished. Really sad bit was that they'd run out of cod loin but instead of offering me the choice of changing my order the chef used a fillet (small white fillet, ?plaice - not cod) but the fish wasn't cooked - it wouldn't flake and it was cold. I didn't eat it, spoke to the waiter who was really kind - he went off to speak to chef who sent a message back to say something about it being that way because of the cooking method - baked rather than pan-fried - just not credible I'm afraid - the fish was cold and spongy - it hadn't been cooked properly. So my dinner was a dessert spoon of lentils, a dessertspoonful of salmon (base) and half a roast potato (diced).", "title": "Excellent location", "user": "Tipsyagain", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123269787}, {"rating": 4.0, "title": "excellent hotel", "text": "Everything perfect except bathroom extractor fan went on far too long when light in bathroom turned on. Annoying in middle of the night otherwise highly recommended. Location perfect in centre of Stratford, staff very friendly and helpful.", "user": "A TripAdvisor user", "date": "June 27, 2013", "id": 165449699}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed at the hotel for one night only to take part in a Murder Mystery Weekend.", "title": "Absolutely Fabulous", "user": "Hazel M", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165141509}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "Everything about this hotel is 4 star, from checking in and being able to leave the car in the car park even before the room was ready, to the overall cleanliness and politeness of the staff.", "title": "Beautiful historic building spoilt by less than appealing historic decor.", "user": "Sarah L", "date": "June 25, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 165136941}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "The food was of a high standard, for afternoon tea (never ending coffee), dinner and breakfast the next morning.", "title": "Surrounded by History", "user": "widowc", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165070576}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The room was, in fact, a junior suite. Tea/coffee facilities, a fridge, 2 televisions and the biggest bed we have ever seen in a hotel.", "title": "Wonderful stay", "helpfulness": 1, "user": "Maxine51", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164939397}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "he shakespeare is a regular venue for us .Ideally situated in the centre of stratford.Rooms are quaint and comfortable Staff are always friendly and helpful.Breakfast good value for money especially the continental", "title": "historic location", "user": "primlea", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124059748}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The booking system, once accessed, was very helpful and all our preferences were met. Being partially disabled, we were given an allocated car space with our name for the duration. The welcome was businesslike but very pleasant and we had help to the room which had lift access.", "title": "Trip to Royal Shakespeare Theatre plays.", "user": "Ant1austin", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124051833}, {"rating": 1.0, "stay_parameters": "Stayed February 2012", "text": "The room was well equiped with simple tea-making facilities and the room bar stocking was available ; the two single beds were wider than usual singles and very comfortable. The room service was first rate.", "title": "Poor standard of rooms, great location!", "helpfulness": 1, "user": "PorscheGirl997", "date": "February 1, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 123990471}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We only ate breakfast; the continental side was a bit basic but the \"full English\" section was excellent.", "title": "Good Service", "user": "Alan O", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 123860300}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This is a lovely hotel, full of atmosphere due to it's original features. The rooms are not huge however are nicely decorated and are very comfortable, we had a large bathroom. We didn't eat in the restaurant and at £12 each for breakfast decided to go elsewhere however we did have a drink in the bar and this was lovely and cosy, very relaxing and perfect for a cold, dark evening.", "title": "Lovely atmosphere", "user": "JosieH", "date": "November 8, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10694169}, {"rating": 4.0, "title": "Just loved this hotel!", "text": "Beware of getting a good deal here! We booked online and got a hotdeal", "helpfulness": 3, "user": "englishrose", "date": "October 29, 2007", "id": 10427242}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "- £130 room only. However checked prices a week or so later and found that the room only rate had dropped to £85 and £100 inclusive of breakfast - don't book in advance, unless you're desperate to secure a room, it's worth hanging on a bit, they change their rates daily. Reception staff were not very friendly, quite gruff and very slow to check people in, there always seemed to be a queue at the desk. Don't let this put you off though.", "title": "Not a bad hotel...", "user": "Julesdbaker", "date": "October 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10420490, "likes": {"liked": "— The location", "disliked": "— Sinking mattress!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "If you are looking for the perfect position to explore Stratford for the weekend then this is your hotel. It is right in the centre amongst all the sights, very close to Shakespeare's houses and a wide choice of excellent restarants. It's a traditonal hotel with roaring log-fires (in October) and really warm cosy public rooms. We stayed in the Garrick wing which was very quiet and over looked the carpark. . We had a standard double room which was a good size with a large bathroom. Breakfast was excellent and service throughout the hotel was very good. Americans are obviously well-catered for as there was a large ice-bucket and a big stand-up fan in our room!", "title": "fantastic stay", "helpfulness": 2, "user": "nutz31", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8485735, "likes": {"liked": "— great location", "disliked": "— nothing"}}, {"rating": 4.0, "title": "nice hotel", "text": "Like many other TripAdvisor's, my Husband and our friends were a little bit weary of the hotel after reading some of the reviews. We have just come back from a two night stay at The Shakespeare. We booked the £90 per room, per night including breakfast on the Hotel's website, under their Internet rate. I would recommend looking at the hotel website when booking a room, other websites were double this amount. The Hotel itself is lovely, full of charm, the seating area in Reception is very cosy with the huge fire keeping you very snug and warm. After reading some of the reviews, I asked for the two rooms we had booked to be at the back of the hotel, and thankfully, we received this and it was very quiet. We had room 136, which was a double, and not bad, except the mattress was not very good as it sank in the middle! Our friends room, 138, was a twin, we did book a double, but their room was slightly bigger and they were happy with this. If you do not have breakfast included in your rate, please do not pay £15.95 per person for breakfast as we did not think it was value for money at all! There is a fantastic, cafe/bar/brasserie next to the hotel's car park entrance called Vintner. I can 100% recommend this place for lunch and dinner. We ate there 3 times over the weekend. The food, service and atmosphere is fantastic! We ate at an Italian called Sorrento on the Friday evening, which was over priced and the food not brill. We noticed the Vintner does Breakfasts, so we would have gone there if we did not have breafast included.", "helpfulness": 2, "user": "pole2pole", "date": "August 12, 2007", "id": 8398432}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I chose this hotel for its location and the historic look of the premises and was not disappointed. The room was a twin, and was quite large with a nice sitting area. Amenities were good and the creaking floorboards just added to the quaint quality of this older property. I think if I were to summarize the overall appearance of the furnishings, I would say \"shabby chic\". They could definitely benefit from new carpet and a little spiffing up. The bar area was very comfortable and, as mentioned the location was fantastic - couldn't have been better. Staff were friendly and most accommodating. Parking was a little hairy, and I had to have a gentleman back my car out of the lot when I left. My only complaint was our room overlooked the area where the trash was kept and at 6 am there was so much noise, banging and talk that the dead would not have been awakened. Since I am an early riser, this was not too much of a problem, but was nevertheless not appreciated. Would highly recommend this location to any US visitors - great experience.", "title": "Great Location", "user": "Lesley A", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164273464}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We recently stayed at this hotel to celebrate our ruby wedding anniversary, wanted a hotel in the town so we could just walk everywhere rather than use the car.", "title": "Lovely hotel", "helpfulness": 1, "user": "ThailandAddict", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 164257109}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We were not disappointed very good location has a small car park we were very lucky we were able to use, although they do have arrangements for use of a public car park nearby.", "title": "We enjoyed our stay in this comfortable Tudor hotel", "helpfulness": 1, "user": "EyesD", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 164169116}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We were allowed to check in early and it was swift and efficient, our room was not in the main hotel but in the Garrick annex, it was a lovely room bright and comfortable overlooking the street, only downside was minor traffic noise which we expected with a town centre hotel, what we did'nt allow for was hotel deliveries at 7am for the hotel by lorries with engines running, kind of spoilt a Sunday morning lie in, so I would still reccomend the Hotel just not room 405 on a Saturday night.", "title": "Great hotel", "user": "wsendelback", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163960415}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We had a delightful Champagne afternoon tea in the Quill Bar, and Breakfast was very good too the usual buffet breakfast with hot and cold options.", "title": "Fantastic location", "helpfulness": 1, "user": "CambridgeClimber", "date": "June 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 163410834}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed a Monday night at the Shakespeare Hotel (now owned by Mercure not MacDonald) and were extrememly pleased with the experience. We obtained a good rate booking through the hotel directly (£65 b/f not included).", "title": "Perfect Tudor Retreat", "helpfulness": 2, "user": "LondonTealady", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7494436}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel itself is a beautiful Tudor building right in the centre of town, a stone’s throw from the theatres, shops, restaurant and river. The hotel has a comfortable and relaxed atmosphere, but remains smart and professional. The décor is beautiful, with antique features and furniture throughout - it is a little rough around the edges in parts, but personally I prefer that to 5* sterility! The bar and restaurant are both great – comfortable yet quite formal - and will be even better when the smoking ban comes into force this summer. The breakfast (£16) was very, very good.", "title": "Very Disappointed", "helpfulness": 6, "user": "wantingonlythebest", "date": "May 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 7487479}, {"rating": 3.0, "title": "Change of Hotel Group", "text": "Our room was delightful, certainly the best we’ve stayed in for £65! The furniture was all period, comfortable and smart with beams on the walls and ceilings.", "helpfulness": 2, "user": "2elleray", "date": "April 23, 2007", "id": 7418106}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We stayed here as a get together of old work mates and wives. The hotel is in a really good position with loads of restaurants and the Royal Shakespeare Theatre within easy walking distance.", "title": "Absolutely fine", "helpfulness": 2, "user": "whitehg", "date": "January 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122758167}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The room we had was clean and tidy and of a good size, with everything we needed. During the afternoon, we had tea in the lounge and the staff were very attentive.", "title": "enjoyable stay", "helpfulness": 2, "user": "MrsFidge", "date": "January 5, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 122576944}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "If I have one gripe, it must be the cost of parking - I really do not see why I should have to pay to park at an hotel that I am staying at. Luckily we knew about it in advance.", "title": "New Years Eve at The Shakespeare", "user": "Vicki057", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122513564}, {"rating": 4.0, "title": "Happy customer", "text": "Please bear in mind that this hotel is right in th centre of Stratford- ideal for sightseeing. The room was of a good standard the bed very comfy. But the car par was very small but don't let this put you off you can park at the nearby ncp and I think at a reduced rate. We didn't eat in the hotel as we thought the cost was rather high, but there are very good restaurants and pubs close by. We would definitely stay here again", "user": "A TripAdvisor user", "date": "December 28, 2011", "id": 122184799}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed at the Mercure Shakespeare in Stratford on Avon for 2 nights, one of which was New Years Eve. The hotel apparently always have a New Years Eve Gala evening which consists of black tie dinner and entertainment. We booked the hotel too late to take part in this event but it looked wonderful and everyone we spoke to who had taken part were extremely impressed.", "title": "Good location", "user": "Robert K", "date": "December 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122088140}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My husband booked a night away at this hotel for Saturday 13th July - for my birthday. The \"deal\" included bed, breakfast and a 5 course taster menu and wine package.", "title": "Disappointing, not value for money on the taster menu deal", "user": "SARobinson", "date": "July 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167541314}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Good Points- staff were polite & friendly, great location in the centre of Stratford, comfy beds, everywhere clean & tidy, fridge in the room.", "title": "Great spot for exploring Stratford upon Avon", "user": "coolsue", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166742170}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Bad Points- the air cooling system was broken in our room, on the hottest day the UK has had in years. No apology or moving us to another room, just a fan left in our room whilst we were out! Better than nothing, but not what we'd paid for. The room was quite dark and stuffy. The meal was poor value for money, a tiny ball of sorbet and an abuse bouche are not considered courses in restaurant we normally go to. We felt hungry again at about 10pm! We have eaten at many high end places, and had many taster menus- we have never ever been hungry afterwards. There were only two other people in the restaurant on a Saturday night, the ambience nil, it was also hot and stuffy. Talk about a romantic night out for my birthday! The food was OK, the wine was excellent. I'm not sure why but staff turned a couple away who wanted to eat at about 9.30pm. I'd have thought they'd have dragged them in off the street begging!", "title": "Nice hotel great location", "user": "Laura M", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166740889}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "On check-in the car park was full, but we got a reduced rate (via the hotel) at the local NCP a short distance away. This was £10. Breakfast was OK, certainly nothing special.", "title": "One night stay for the RSC", "user": "Scotty15647", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166740602}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed here for one night to see a play at the RSC, the hotel was pretty much what we expected.", "title": "One night RSC visit", "user": "RallyMonkey", "date": "February 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 124494182}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The biggest selling point is that it is only a few minutes walk from the RSC.", "title": "Great place to stay if you're visiting the RSC", "user": "Toptoga", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124482189}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The rooms are mid-range, tidy, reasonably equipped, but I would not want to sleep in the bed for more than a couple of nights.", "title": "Beautiful Character", "user": "IWantToGoEverywhere", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124442830}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The hotel has a bit of faux atmosphere, although it is an old building, most of the wooden beams are hollow. If you have stayed in a real 17C building, this will not convince. There lounge decor is a very strange mixtures of styles and periods ranging form 1750 to 1950.", "title": "To stay again or not to stay....that is the question", "user": "HenWeekender", "date": "February 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124315266}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Service is variable, sometimes good, sometimes lacking. Excellent on reception, but bar service is slow by European standards, unacceptable by North American standards.", "title": "Very disappointing", "user": "Samantha J", "date": "February 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 124187433}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "From the outside the Shakespeare is a beautiful, very old black and white Tudor period beamed building, with lovely hanging baskets and tiny leaded windows, and the downstairs public areas are also very nice, with a somewhat contemporary modern feel.", "title": "Just OK", "user": "Karen_Kingswinford", "date": "July 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 166058724}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The receptionist was pleasant, not overly welcoming, but pleasant none the less. Our room was on the first floor, at the front of the building, and was spacious, with a good size modern bathroom.", "title": "Fantastic location", "user": "bggoose", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165904513}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The bed had a large Tudor style headboard which was very nice and the bed itself was fairly comfortable. However, the carpet was stained and very dirty, and the cushions, which were on the bed, were also stained with food. The bedside lamps were thick with dust, and the whole room needed a good thorough cleaning. This was supposed to be a 'privilege' room and we had paid extra for this supposed upgrade. The biggest upset was the bathroom towels. There were four, two large bath towels and two hand towels - and to our horror we found two were already used, one covered in pale pink lipstick and the other had some very dubious marks on it. The receptionist did address our concerns about this, and removed the £10.00 per night parking fee from our bill.", "title": "Loved it", "user": "MrMJSesq", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165794488}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Breakfast was not to a standard we are used to. There was no milk for cereal, no butter for toast, our plates weren't cleared, and we were continually having to ask for things that should have been there in the first place. It seemed the international guests were very well attended to, but the locals were left to their own devices and were made to feel an inconvenience.", "title": "A bit dated but thats Shakespeare!", "user": "Mike0210", "date": "June 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165780733}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Overall, the location is superb, the building is superb, it is steeped in history and it could be a fantastic asset to the Mercure group of hotels. However, housekeeping needs a serious investigation, and Mercure should consider investing in new carpets and cushions for the rooms they consider a premium grade in comparison to their 'standard' rooms.", "title": "Well-placed for theatre - but watch the extras!", "user": "JM49", "date": "June 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 165524517}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Shakespeare Hotel is VERY central and VERY \"quaint\". It has all the appearance of an \"olde worlde hotel\" which I can see would attract visitors from overseas. We paid £180 for two for dinner bed and breakfast and the room we had was in the \"newer\" part of the building overlooking the car park and service area. The room itself was pretty small - you open the door and the bed is just there nearly touching the open door. Adequate bathroom facilities and fairly comfortable. Squeaky floorboards so we were glad we were on the top floor (2nd) so heaven knows what it was like on the first floor underneath us.", "title": "Central and quaint - but...", "helpfulness": 3, "user": "RogerAckroyd", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8360080}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "All the staff seem to be from Eastern Europe which is not a problem for bar and dinner but if you need guidance on the attractions of Stratford--0n-Avon you will be better off going to the tourist information bureau.", "title": "Just okay...", "helpfulness": 4, "user": "hsanger", "date": "June 18, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 7873314}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Dinner was fine and breakfast was great.", "title": "Wonderful Hotel", "helpfulness": 1, "user": "CardiffRonnie", "date": "June 17, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 7867356, "likes": {"liked": "— The location and the ambiace", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "No thumbs down from me. Just a little average I suppose...", "title": "All's (not so) Well that Ends Well", "helpfulness": 5, "user": "BardBrain", "date": "June 11, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 7833819}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "First the positives:", "title": "It looked good from the outside", "helpfulness": 7, "user": "Uncommercial", "date": "May 16, 2007", "detail_rating": {"value": 1.0}, "id": 7629715, "likes": {"liked": "— We did not get in", "disliked": "— We did not get in"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 54, "average": 131, "very good": 294, "terrible": 24, "excellent": 213}, "aka": "Mercure Stratford Upon Avon", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "4 star Tudor hotel with 74 ensuite rooms located in the centre of Shakespeare's Stratford. Ideal for exploring local villages, the Cotswolds, shops and theatres of Stratford. 19 miles from Birmingham International Airport, 1 mile from Stratford upon Avonstation, 10 miles from Warwick Parkway station. Easily accessible via the M40. David Garrick Restaurant, Othello's Bar Brassiere, Quill Bar and Lounge, 6 conference rooms with natural light for up to 100 delegates. Limited parking at GBP10.00 per day."}