{"user_rating": 4.5, "review_count": 1197, "name": "Merchant Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had the privilege to stay at the Merchant for few days and I have to say that this is definitely among the best stay I experienced in my travel life! The hotel is just breathtaking, the sumptuous dining room brings you back to the splendor of a past era, the staff is friendly (Louise and Ciaran at the front desk are fab!) , competent and professional, the rooms are spacious and tastefully decorated, the spa hot tub located on the roof-terrace offers a stunning view of Belfast....really an unforgettable stay!", "title": "Definately the place to be", "helpfulness": 1, "user": "REGR_10", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155048503}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Beautiful in every respect. Stunning Decor. Located in the heart of the city, so don't expect amazing views of the countryside. The staff were amazing and our concierge (Kieron) organised everything for us including a last minute private tour to the Giants Causeway. Dining in the Great Room was a pleasure and the food superb.", "title": "First Class Weekend Family Break", "helpfulness": 2, "user": "idcltd", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154964114}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Definitely returning.", "title": "Fabulous stay", "helpfulness": 1, "user": "creagh23", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154929389}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Just waiting for a response from the management to an error with a booking which I am sure will be resolved, but if not will let you know.", "title": "Excellence in the city", "helpfulness": 1, "user": "harry140", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154739199}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Just returned from a two night stay at the Merchant for the St. Patrick's weekend. We were travelling as a group of four to celebrate our mother's 70th birthday and from the moment we pulled the car up outside, the Merchant went out of their way to make sure we had a fabulous stay. The concierge promptly unloaded our luggage and whisked the car away while we were speedily checked in to our rooms, 316 and 317. We stayed in the Victorian quarter and our rooms were luxurious and spotless. The large bathroom was stocked with the usual amenities and a gorgeous rainforest shower head (although it perhaps could do with being descaled for more pressure). There was always an abundance of roasting hot water and the heated towel rails were very useful. Bathrobes and slippers, mini-fridge and tea/coffee facilities were all provided along with a nightly turn down service and complimentary paper in the morning.", "title": "A very special experience", "helpfulness": 1, "user": "Michele S", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154645580}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "After a few months of what seemed like working round the clock , my husband and I decided we deserved a treat and booked into stay at The Merchant . Whilst we live only 10 miles from the hotel, we were transported into a world of pure luxury and indulgence . Our concierge,Kieran , kindly showed us up to our room and spent time showing us all the workings and hidden treasures within - the room and bathroom were to die for and the hidden dressing room and table a lovely addition . Being so close to Victoria square, we took a short stroll for some shopping then headed back to the hotel and straight up to the roof top hottub for some relaxation , champagne in hand ! The cocktail bar in the evening is a must , the staff excel in their cocktail making skills and the atmosphere perfect . After a great nights sleep the talk of \"the breakfast \"was enough to make anyone for go their lie. Do make a point of going to \"The Great Room\" to be served up a delicious selection of everything from fresh smoothies , freshly made warm Danishes ans a delicious hot breakfast of your choice. We couldn't rate it highly enough, the staff excellent and all the small touches make it unlike any hotel we have ever stayed in and well worth every penny ! We will definitely be back !", "title": "A stay like you'll never experience again !", "helpfulness": 1, "user": "REMoore77", "date": "March 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153556804}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Excellent service from the moment I arrived with more than pleasant staff on reception and throughout my stay. After a stimulating evening at the conference finished off the hectic day beautifully with a few delicious cocktails. Sank into a very comfortable bed and then thoroughly enjoyed a very relaxing soak in the hot tub etc the next morning... minus kids! The guilty feelings disappeared over a tasty breakfast. Appreciated the 12pm checkout. Have promised to treat my husband, so will be back soon! Many thanks.", "title": "\"Time out\"", "helpfulness": 1, "user": "REMoore77", "date": "March 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153551084}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "absolutely great hotel, from surroundings, to great rooms, great friendly staff. The best nights sleep Ive ever had in a hotel. Obviously with the price it isnt a regular haunt, but i stay when I can, special occasions. Berts bar attached is great food too.", "title": "Best Hotel in the Country", "helpfulness": 1, "user": "MantassNI", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153538415}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Ten ladies partook of afternoon tea in the Merchant as part of a pre wedding event. The staff were as ever attentive and the afternoon tea was to die for. A three piece provided the back ground music- excellent. All together a very good afternoon. A pity the 'bride' did not appear to enjoy herself but that is normal for her. Would thoroughly recommend .", "title": "Afternoon tea at the Merchant", "helpfulness": 1, "user": "gastrobabe", "date": "March 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 153501419}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Last weekend saw us sample the delights of the Merchant Hotel once more . The prospect of a night away in this beautiful hotel always thrills us and last Saturday night was no exception. The food in Berts accompanied by live jazz was exquisite and the after dinner cocktails upstairs are to die for. Service is so important in a 5 star hotel and the Merchant has got it spot on, not too fussy nor too casual. When it comes to retiring to bed (in the Victorian wing) the gothic furnishings and subtle lighting spell romance with a capital R..........will we be back........yes!!!!!!!!!!!!!!", "title": "Decadent perfection.....", "helpfulness": 1, "user": "erinjude", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153375650}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Blissful stay in wonderful surroundings. All the staff are well trained and very friendly. Spa is lovely and surprisingly spacious for a hotel in the centre of the city. We had the C S Lewis suite which is amazing. Valet parking is very efficient and loved the mint humbugs left in the car for us. Dinner was excellent, bar is beautiful, and breakfast was wonderful. We loved it!", "title": "Real luxury", "helpfulness": 1, "user": "fionnualag", "date": "March 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155341866}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife bought me an overnight stay with dinner and breakfast in the 5 star Merchant Hotel for a birthday surprise. I had no idea where I would be staying, so on arrival at the hotel I was more than impressed. My wife had booked a room in the old part of the hotel for us.", "title": "Luxurious Victorian grandeur - total escapism", "helpfulness": 1, "user": "Wildtracker", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155263369}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Our room was very lavish with luxurious deep-red velvets, gold frilling around the ceiling, a soft king sized bed, coffee and tea making facilities with real silver condiments and a massive ensuite with a bath and shower. It looked like it was straight out of the Victorian era. Bathrobes and slippers were supplied. Little extras like a birthday card, a balloon and homemade chocolate truffles were all nice touches from the hotel.", "title": "Opulence and elegance in the heart of Belfast", "helpfulness": 1, "user": "Grumpiestcat", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155194692}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We dined that night in the Great Room and we couldn’t fail to be impressed by it’s grandeur. Our food was simply amazing and in my opinion, up to Michelin standard. The service was second to none and our waiter, Peter, couldn’t do enough for us. He kept our water and wine glasses topped up and he even folded my napkin when I left the table between courses. He told us all about the history of the hotel and gave us a little personal tour of the old vaults. Our meal was completed by Peter bringing out a small (but very tasty) surprise birthday cake which we had sent to our room to eat later. What a lovely touch from the hotel. After dinner we retired to the Jazz Bar for a bottle of wine. Once again, the ambience and service was lovely.", "title": "Old world glamour!", "helpfulness": 1, "user": "Highheeledlady", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155154031}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife and I had a truly memorable stay at the Merchant. It was total escapism and I hope it won’t be too long until we can do it all again.", "title": "5 star indeed!", "helpfulness": 1, "user": "Catherine R", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155141885}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We booked a double room in the Merchant Hotel for the night of our wedding in October 2010. We had never stayed before and knew it was the kind if place we wouldn't afford to stay in regularly! We booked a standard double room, and informed the hotel that as it was our wedding, we would not be arriving until midnight. They were more than accomodating and gave us a late check-out for no extra cost.", "title": "Wow...perfect", "helpfulness": 2, "user": "StephLav", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154507558}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "When we arrived the hotel was the perfect special end to our perfect day. The doorman was wonderfully suited and carried our bags from the car to reception, and then escorted us to our room. Apart from it wasn't just the standard room we booked ... it was the beautiful C.S. Lewis suite. They had upgraded us as a suprise and the bedroom, living area and bathroom were just superb. The small touches like a note with the weather for the next day, a C.S. Lewis quote on the bedside table, and a wedding card and chocolates were really appreciated. It became apparent very quickly why the Merchant is 5star and why they are so well-known and praised.", "title": "Not what I expected", "helpfulness": 3, "user": "GobnaitIreland", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 2.0}, "id": 153722252}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The soft-furnishings, decor and furniture were beautful, luxurious and the whole place was spotless. The height of the ceilings gave such a spacious feel and the ambience of the room was spot on for a luxury hotel. Breakfast the next morning was room service and it was delicious. We got exactly what we ordered and it was well-persented.", "title": "Absolutely fantastic experience", "helpfulness": 1, "user": "Matt W", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153669435}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Overall our stay at the Merchant Hotel was absolutely perfect. We were so delighted with our free upgrade, which really suprised us as we didn't even have our wedding there and it was a busy Saturday night. Everything about this hotel and the C.S. Lewis suite is special. It's an overall experience and not just an overnight stay. We're married 2 and a half years now and still haven't stayed again. It was worth every penny the first time round, but best to be kept for another special occasion!", "title": "Fabulous Hotel", "helpfulness": 1, "user": "projectmanagement", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153623478}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We got an excellent rate of around 100 euro inclusive of breakfast. Staff at check in were excellent - big downer is the location, as it is not an area you would want to walk around, nor is it in any way attractive to view out of the windows. So, this is a place you come to stay inside in, flitting in and out... bar staff were not as good as front door staff, with slow service [I should add unaccountably slow]. very overpriced for ordinary fare.", "title": "An experience never to be missed.", "helpfulness": 1, "user": "Liquorise44", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 153577144}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Belfast"}, "stars": 5, "variance": {"poor": 49, "average": 63, "very good": 128, "terrible": 33, "excellent": 924}, "aka": "Merchant Hotel Belfast", "slim_ranking": 0.0909090909091, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}