{"user_rating": 4.0, "review_count": 395, "name": "Mercure Gdansk Old Town", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We have been to the Hevelius twice, in July 2005 and in Feb 2006. We had the standard rooms, which were a bit small but well equipped and clean. The staff, esp. in the restaurant was very fiendly and the breakfast delicious - lots of polish specialties. The best feature of the hotel is its location: between central railway station and the historical city center (each a 5 min walk), many rooms have a marvellous panorama view towards the city center.", "title": "Perfectly Located", "helpfulness": 11, "user": "HH33", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4688648}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "If you have more than one day to spend in Gdansk, it´s worth taking the local train to Sopot )approx. 20 min.), a seaside resort which was famous for its casino (today Grand Hotel) and ist glamourous atmosphere throughout Germany before World War II. On the way to Sopot stop at Oliva and visit the Cathedral and the Park.", "title": "Disappointing", "helpfulness": 5, "user": "Frwsch", "date": "August 28, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3811853}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "There was only one downer: Check the bill carefully. We have been billed higher room rates than we had booked. This happened twice!", "title": "Loved for breakfast and service people !", "helpfulness": 17, "user": "Maxlamy", "date": "November 6, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2809940}, {"rating": 3.0, "title": "Adequate but nothing special", "text": "Having come from the Marriott in Warsaw to this Hotel was maybe the wrong thing to do - the shock was even greater. Having reserved a non-smoking room, I first ended up in a smoking room and it took another 25 minutes to get a non-smoking room. Stuffy rooms - no air conditioning. Curtains with holes, beds not properly made, filthy bathroom. Certainly the worst place, I have stayed in for years.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 23, 2004", "id": 2780624}, {"rating": 3.0, "title": "Well situated skyscraper hotel", "text": "This is an exellent hotel. The reception people is very attentief, speaks a lot of languages and are very helpful. A large lobby with comfortabel seats and anex the bar quite open. Rooms are compact but all what you need and very clean, even coffee or thee setting is possibel and two botles water. The side to the old town gives a splendid panorama. Breakfast offers a choice 'impeccabel' I never saw such a choice. Here also the crew is very helpfull. The restaurant offers a lot of local and international dishes. Your car can be on the security parking after the hotel.", "helpfulness": 8, "user": "alanreynolds", "date": "October 18, 2004", "id": 2754678}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We had never been to Gdansk, but a cousin recommended the Hevelius because it was close to the Old Town and close to her parents' apartment. We were not disappointed.", "title": "Love Gdansk, Love the Hevelius", "helpfulness": 1, "user": "Kashub2008", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19567404, "likes": {"liked": "— Friendliness of staff", "disliked": "— Shampoo and conditioner didn't work unless you used the body wash."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Although the high-rise building has a Stalinist-era appearance, it is quite contemporary inside. The lobby is spacious, with smoking and non-smoking areas (welcome to Poland, the capital of cigarette consumption in Europe). The front desk staff was extremely pleasant, friendly, helpful, and fluent in English (and German and Polish, naturally). Our room was rather small, but nicely appointed, with a very nice, up-to-date bath. The room was air-conditioned, but if you opened the window, the air-conditioning shut down - saving energy by not air-conditioning the entire city.", "title": "Until they sort out their renovations, don't bother", "user": "C00kie234", "date": "March 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 14417631, "likes": {"liked": "— The bar was OK", "disliked": "— Unattentive staff, the noise from the renovation"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The breakfast buffet was generous, but decaffeinated coffee has yet to be widespread other than the powdered instant. The restaurant was unremarkable, but good. The bar has smoking and non-smoking tables, not areas with smoke-eaters. If you're sensitive to tobacco smoke, you may not want to be in the bar, rather moving to a non-smoking area of the lobby. Several floors in the hotel, by the way, are completely non-smoking.", "title": "Large Hotel ... but smoking allowed.", "user": "shamus67", "date": "January 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12353544, "likes": {"liked": "— The food", "disliked": "— Smelly room"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "We interrupted our stay to go to the countryside for a reunion. The hotel happily stored our luggage securely for the day we were gone. In fact, some members of our party had to make reservations at a different hotel for the one night back, and the Hevelius happily stored their luggage as well.", "title": "Smelly smokey room ... nice food.", "user": "MrNorfolk", "date": "December 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 11311477, "likes": {"liked": "— The evening meal.", "disliked": "— Smelly old rooms ... ??"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "If you're headed back to the airport from Hevelius, they have a special arrangement with a cab company for a 50 zloty fare, regardless of size of cab. Not bad at all.", "title": "The Executive/Superior rooms were wonderful!", "user": "Audrey-Jane", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10048582, "likes": {"liked": "— The luxurious feeling of the superior suites", "disliked": "— Would've liked a bigger mini-bar fridge as I stored my own stuff in it"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I stayed four days at the Hevelius and found it to be an excellent choice. Well-located within easy walking distance of the old town and the train station, I could walk everywhere. The room was modern and clean and a good size. The restaurant had very good food. The reception staff was competent and English-speaking. It's a very busy place with lots of business travelers and groups. The drawback was it got a little noisy at night with some guests on my floor -- the walls seemed thin. Also a little pricey but it is a three star hotel. I'd stay there again.", "title": "Very nice hotel", "user": "tampatennisplayer", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10026156, "likes": {"liked": "— location", "disliked": "— noise"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Hotel in perfect location for old town of Gdansk, by walk maybe 10 - 15 minutes. From Airport transfer takes you through shabby post soviet’s style neighbourhoods but when you reach old town you might be surprised of radiance of the city. Streets that seems to come out of the middle ages authentic looking chimneys and narrow passages. All nicely renovated clean and welcome for tourist of any kind. But the hotel Mercury is the one that would make you get to reality. Business style, nothing more to offer. Rooms simple or even more than simple. Ask for the room in higher floor if hotel is not overbooked, so you would have nicer view to the area of city panorama. They have few floors of renovated rooms, I had no chance to visit them unfortunately. Breakfast in simple business area – all you can need to fill you hungry stomach but not more. I could not get the difference, but some of the rooms had mini bar and some doesn’t, so if you fond of glass of vine in the middle of the night – you may forget this idea, as down hall bar might also be closed.", "title": "Good location, budget accomodation", "helpfulness": 1, "user": "Gabryte", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 8756278, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Still, very surprised of smoking permitted everywhere, so if you have no smoking habits – inform staff accordingly to get smoke free room and keep distance from bars deep corners. They some there everywhere! Overall – hotel is good as business location, but if you look for something more, Gdansk is plenty of other nice places to try.", "title": "It's a good hotel", "helpfulness": 1, "user": "Magpie70", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8399529, "likes": {"liked": "— Impressive lobby & restaurant", "disliked": "— nothing"}}, {"rating": 1.0, "title": "Overpriced", "text": "Reading some previous reviews they paint a pretty poor picture , but I must tell you this is a spot on place and I was quietly impressed. Great location , sparkling lobby , nice open lounge , bar facilities were good and the evening meal in the restaurant was a pleasure. My double room was not the biggest but I was never in it anyway ! Most of the upper floors have just been refurbished. I got the impression the staff and management were really making the maximum effort for the traveller. All in I would definitley recommend and definitely go back when I am next in town.", "user": "Daithi4", "date": "August 4, 2007", "id": 8349502}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Overpriced. Impressive lobby but old-fashioned rooms are drab, poorly decorated and have no kettle for a much needed brew. Also, a strange noise came from our bathroom ceiling throughout the night. We stayed in numerous hotels around Poland and this was the most disappointing. For almost half the price we stayed in 4 and 5 star hotels in Krakow and Warsaw that were much more comfortable. The hotel also overcharged us as we were leaving and no manager was available to sort it out. Eventually that evening when we came back to collect our bags, we were given a refund of the extra we had paid.", "title": "Below average", "helpfulness": 1, "user": "Liam F", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 5980081, "likes": {"liked": "— location", "disliked": "— Cleanliness, decor and the bathroom"}}], "location": {"country": "Poland", "region": "Northern Poland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 40, "very good": 184, "terrible": 6, "excellent": 153}, "aka": "Mercure Gdansk Hevelius Hotel", "slim_ranking": 0.128571428571, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Mercure Gdansk Old Town is the first choice of international travellers. The hotel pampers guests right in the centre of the city on the perimeter of the historic centre, just 500 m from the railway station and 15 km from Gdansk Airport. Guests enjoy charming views of the Old Town and the historic Gdansk shipyard. An ideal base for sightseeing, shopping and business, the hotel offers 281 comfortably furnished rooms including luxurious suites, privilege rooms."}