{"user_rating": 4.0, "review_count": 417, "name": "Mercure Hotel Hamburg City", "reviews": [{"rating": 4.0, "title": "good for short stays", "text": "Hotel is not far from the railway station, on a busy road but rooms are soundproof and very comfortable. Not far from the hotel is s-bahn station Hamerbrook, whis is only one stop from the main railway station - Hauptbahnhof. Hamburg is a beautiful city, I used to live there for two years. Very easy to get around and if you get a good price at Mercure City I highly reccomend the hotel.", "helpfulness": 6, "user": "nireno", "date": "January 3, 2007", "id": 6545510}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed in the Mercure Hotel Hamburg City for 4 days in December 2006 and were totally happy with our choice. We had booked it a while before via internet on the website of the hotel chain for 60Eur per night (cancellation not refundable). The hotel is located at the big street Amsinckstrasse. The bus stop is just a minute walk away. All buses passing there will take you into down town and buses 120 and 124 take you from down town (bus stop is behind the Saturn) back to the hotel. An advice: As for the bus and train tickets, from 2 persons on it turns out cheaper to take a group ticket for a whole day instead of a day ticket for each one.", "title": "Good value, location and comfort", "helpfulness": 6, "user": "Terence_Hill", "date": "January 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6532867, "likes": {"liked": "— location, price, room", "disliked": "— the breakfast is very expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "The hotel staff was very friendly and helpful and the rooms were comfortable and clean. One of the photos shows the view from our room from the 4th floor. We would stay at this hotel anytime again.", "title": "Excellent value & great service for this class of hotel", "helpfulness": 8, "user": "Funicats", "date": "September 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3881923}, {"rating": 5.0, "title": "Wonderful Hotel, Gret staff", "text": "I regularly stay at this hotel and the current refurbishment has done wonders to an already great value modern hotel. The rooms are immaculate and have all the necessary amenities, particularly for business travellers. Don't expect bath robes or fancy little soaps; they provide a large bottle of liquid/shower/hair soap which is actually quite nice.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 26, 2005", "id": 3809073}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 22, "average": 54, "very good": 223, "terrible": 1, "excellent": 117}, "aka": "Accor Hotel Hamburg City", "slim_ranking": 0.221875, "description": "The Mercure Hotel Hamburg City is a 4 star hotel with a unique decor concept inspired by Hamburg, the media city. This is carried through the 187 guest rooms as well as other parts of the hotel."}