{"user_rating": 4.0, "review_count": 1192, "name": "Mercure Sydney Airport", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Avoid it!!! Service was non-existent; restaurant food/buffet was awful and expensive; no-one will help with bags; restaurant staff had terrible attitude, restaurant \"manager\" the worst. If you just need to crash overnighting between flights etc, then room is okay, but don't expect anything else for your $$$. And pray you don't get a \"footy team holiday tour\" in the hotel at the same time or your will be non-existent like the service. (-:", "title": "Avoid it!", "helpfulness": 1, "user": "TravelTarts", "date": "October 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 21000026, "likes": {"liked": "— Proximity to airport", "disliked": "— Lack of service; bad staff attitude"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Booked into this hotel for work for 3 nights whilst I was on a training course near the airport. I could stay there again if I had to – but next time I’d rather stay at the Holiday Inn if I’m after a Airport Hotel.", "title": "There was good. There was Bad. Mostly Bad.", "user": "msmegmog", "date": "September 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 20519076, "likes": {"liked": "— Bed Linen", "disliked": "— Food"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The good:", "title": "OK for one night between flights", "user": "Amanprana", "date": "September 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 20194404, "likes": {"liked": "— location near international and domestic airport"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Room was fresh, clean and modern looking. All facilities worked well. I found the bed rather hard, but then I’m a person who likes my beds on the softer side – so it may suit others. The amenities were nice and I appreciated having the iron and ironing board. Room was quite large too.", "title": "Right Hotel ,Right time and in the Right place.", "user": "moruya2", "date": "August 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18830991, "likes": {"liked": "— Its location near the airport's international terminal", "disliked": "— Its lack of any character"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed overnight on our way overseas. Checkin was quick and although we arrived with others on the shuttle bus we met with a welcome smile. Room was good size with a firm bed. A little dated but clean. good towels & crisp sheets.", "title": "OK for transit stop", "user": "wiskey", "date": "September 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 140727974}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "Barman seemed out of his depth and was close to being rude when dealing with some guests asking about bar meals. Slow service.", "title": "What a let down !", "user": "Stace072", "date": "September 19, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 140663651}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "As we were already tired we chose to eat in the restaraunt and found the staff pleasant but the service very slow. The meals were well cooked & presented.", "title": "Ideally situated", "user": "AllSquare", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140529527}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Booked in to this hotel expecting a lot more than we got ! We booked a family room with a roll away bed as we have 3 children and in this respect the room was fine . We stayed on the sixth floor with nice views ! The beds moved around alot when you sat on them uncovering huge amounts of dust and dirt behind them also behind the entry door when you closed it was thick with dust as well !", "title": "Our stay", "user": "Trickus1965", "date": "September 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 140489559}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We returned every day from sight seeing to find the air con on 16 and on 2 days the fridge was open for what reason I'm not sure as they don't have a mini bar but my milk and juice were warm ! The bathroom roof was also mouldy !", "title": "Reasonably good stay", "user": "sarpod", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 140478461}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Stayed overnight while in town on business. While the service wasn't anything fancy, the staff were never rude. Check-in took a little longer than would like due to the girl on the desk flirting with the customer in front of me.", "title": "Not too bad", "helpfulness": 3, "user": "nw82", "date": "October 26, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6015583, "likes": {"liked": "— Shuttle service to and from the airport", "disliked": "— Very little information supplied prior to stay"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Ordered room service and it was fine. Again nothing fancy, but adequate, and prices were normal for room service.", "title": "Don't Do It!", "helpfulness": 5, "user": "oneword", "date": "October 2, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5901516}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Rooms are nice and beds are very comfortable. Bathroom was a little dated, but served its purpose.", "title": "Quite Comfortable", "helpfulness": 9, "user": "travellingfour", "date": "August 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5629847, "likes": {"liked": "— Close to airport", "disliked": "— Not much of a choice of eating options. Hotel food pricey"}}, {"rating": 2.0, "title": "try elsewhere", "text": "I booked the room as a 'mystery room' so didn't pay full price. Probably wouldn't stay here at full price, but for the bargain price I paid I was satisfied.", "helpfulness": 6, "user": "cessnapilot", "date": "December 22, 2005", "id": 4255521}, {"rating": 1.0, "title": "Absolute disgrace", "text": "What a lousy welcome home to Australia after a few weeks enjoying the great service and amenities of Asian 4+ star hotels. In fact, I'm embarrassed that international visitors to Australia get some of their first impressions from this hotel.", "helpfulness": 2, "user": "Ray Goldberg", "date": "December 15, 2005", "id": 4244219}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Great Hotel, but woeful service abounds at the Ground Floor Seasons Restaurant. Had pre-booked for 6:30 pm on a Saturday night and the restaurant was about 3/4 full. Warning bells started when, for the first time in visiting thousands of restaurants we were told when shown to our seats, \"There'll be a wait before we can give you a menu to look at as there's not enough to go around\". (Really? Never heard of a photocopier??). Some 20 minutes later and the restaurant has dwindled to 50% full. We were given drinks ordered when we arrived. \"Would you like to order now?\". \"Well we would if we could see a menu\". Finally got one. (they must be made of gold and encrusted with diamonds they are so rare). Another 30 minutes. We were starving now having heavily debated every item on the scant listing. \"Have you decided yet?\". \"Yes - quite a while ago\". \"Has anyone explained the specials to you yet?\". \"No. You didn't when you gave us the menu. Would you like to now?\". \"Ok. There are no specials but there is no veal\". (Rather special as one of our party had decided that's all they wanted). \"OK - sorry you can't have the veal. But I highly recommend the chicken breast (pointing to it on the menu\". \"OK (a bit reluctant) - seeing you recommended it\". Over an hour later some of our meals arrived - several minutes apart. Ex- Veal now Chicken breast orderer - about 30 minutes later, gets a Caesar Salad (which they hate) plonked in front of them. \"Um, we didn't order that - we wanted the Chicken breast\". \"Oh - sorry for the mistake (takes dish away)\". Rest of the party finish their meals. We wait another half an hour. Still no chicken breast. Empty plates cleared (after sharing some with starving chicken breast orderer who was just about to pass out with starvation). \"How was your meal?\". \"Um. OK except one of our party still hasn't got theirs\". \"OK. I fix [sic]\". 5 minutes later a sorry excuse for a stewed Chicken Maryland - bones and all on top of under-done porridge consistency polenta arrives - inedible. We wait for service - trying to attract the attention of one of the 8 or so wait-staff who are experts in avoiding eye-contact and apparently very hard of hearing. We stupidly hope at least for some dessert and coffee. We look over to the sad face of another lady at a nearby table who arrived shortly after we did. She berates her partner: \"Still haven't seen the menu!\". We give up, nearly 3 hours after first being seated. Still hungry as we set off for the nearest take-way to fuel up for the long travelling day ahead. What a grand way to start an international holiday! (Never, ever again....). Fawlty Towers is a 3-hatted restaurant compared to this.", "title": "Terrible Service at the Seasons Restaurant", "helpfulness": 1, "user": "Firsttimecruiser52", "date": "September 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 140376892}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here the night before an international flight. Reception staff were apologetic about the wait at check-in (hardly their fault, we arrived on the Airport Shuttle with ten other people). The room was quiet, tastefully appointed and the beds comfortable. Restaurant was booked out until late in the evening but room service was delicious, reasonably priced and generously sized. Small housekeeping issue was resolved swiftly and without a fuss. Quick shuttle run to the international terminal even in morning traffic. Would stay here again without hesitation.", "title": "Convenient location and excellent service", "user": "Idella84", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140221503}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I was in transit in Sydney from a domestic flights to an early morning international one. The Mercure is near to the international terminal and offered a good rate ($143) for a standard room. There is a reasonably regular shuttle bus, but you have to pay AUD6 each way - I think an airport hotel should have a free shuttle... The welcome was OK - I am Accor Gold and you hope you will one time get recognised and upgraded. But not here. However, I did get a room on the 6th floor and away from lifts. The room was large and had a nice TV, but the rest of the furnishings are old. I think it used to be a Hilton and you could imagine if you had stayed here in the late 1990s it would have been luxury... But not anymore!", "title": "Very convenient for international terminal - showing its age", "user": "wombatdavid", "date": "September 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 140202487}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I really didn't like this hotel at all. It seemed REALLY tired, worn out and the rooms were small, cramped and the bed was like sleeping on a slab of rock cut out from the nearby Blue Mountains.. The fact that Sydney was experiencing over 100 millimetres of rain at the time didn't help the overall experience either!!", "title": "A bit of a dump in all honesty", "helpfulness": 3, "user": "Cameron85", "date": "June 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 7854183, "likes": {"liked": "— Not much", "disliked": "— the disgraceful bed."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My family and I stayed here for one night preparing for our international flight to Seoul the following day, and we're lucky we only had to spend one night here. Definatrely will be spending a bit extra to stay somewhere else next time we have to stay near the airport.", "title": "Great Kangaroo", "helpfulness": 3, "user": "MorningsideMinkel", "date": "May 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7686883, "likes": {"liked": "— In House Restaurant", "disliked": "— Reception Staff"}}, {"rating": 2.0, "title": "Disappointing for a 4 star", "text": "We actually ate at the airport as well, skipping their restaurant :)", "helpfulness": 2, "user": "mylocath", "date": "November 26, 2006", "id": 6177874}, {"rating": 4.0, "title": "A very convenient place to stay", "text": "Located close to Sydney Airports. Rooms were very clean, tidy with very good friendly service. Easy access to transport into city. Transfers to / from airports very convenient. Friendly and very helpful staff.", "user": "A TripAdvisor user", "date": "September 8, 2012", "id": 139774036}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My Partner and I stayed at the Mercure for 2 nights in September; we had flown into Sydney for a wedding that was held close to the hotel. The Mercure is designed for business stays and conferences; it would also be great for overnight stops with its location close to the airport.", "title": "Ideal for Business, Conferences & Overnight Stays. The Staff really made our stay.", "user": "Christine A", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139765115}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The inside of the Mercure including the restaurant, rooms, common areas and reception is modern, stylish and well presented. There is also a shuttle bus service to and from the airports which is something like $7 each way so don't waste your money on a taxi. The tennis court and pool area were very run down though, possibly neglected due to winter, hopefully they'll do some maintenance on the outside leisure areas before it gets warmer.", "title": "Not the best choice of Airport Hotel", "user": "Douglass4", "date": "September 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139640222}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "What really made our stay though was the staff, which inspired me to write this review. They were friendly, welcoming and had great knowledge of Sydney and its attractions. They go out of their way to ensure you have an enjoyable stay and that everything goes to plan. One staff member in particular Alferdito (Red) who works in the restaurant deserves some recognition. We ate at the buffet for breakfast twice and his cheerfulness, spirit and sense of humour made our mornings.", "title": "Close to airport", "user": "Vicky J", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139534435}, {"rating": 3.0, "title": "Good access to Airports", "text": "Overall we enjoyed our short stay and if we needed to make our way down to Sydney for a connecting flight we would defiantly be staying at the Mercure.", "helpfulness": 1, "user": "FrankSue", "date": "September 1, 2012", "id": 139101291}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We were transfering planes from NZ and stop at the Mercure Sydney Airport and found it was a great location. There is a bus that operates from the Domestic and International airports. The staff assist us in taking the train to the centre of town. A 30 minute ride for a lovely evening in town.", "title": "Excellent location for transfering planes.", "user": "Sprocket77", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140199602}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel offers a convenient stay, if you have an early/late flight before or after. The bed is comfy and you don't have to wait in traffic in order to get to your hotel.", "title": "Comfortable and convenient location", "user": "Dunja G", "date": "September 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140038664}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "They run a shuttle bus every 20 minutes from Bus Bay 32.(small fee for return transfer) That means as well that you don't have to drag yor bags through half of Sydney.", "title": "OK but not great", "user": "cblackst", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 139942824}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The breakfast is amazing. We also had dinner in the restaurant, which was fine.", "title": "Average", "user": "Stéphane R", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139922249}, {"rating": 5.0, "title": "Great location for International Airport", "text": "The service was great. The hotel does not offer a minibar, instead you will have to get a card from reception, gurantee it to your creditcard, and you can use it in the vending machines, located on every floor.", "user": "A TripAdvisor user", "date": "September 9, 2012", "id": 139808337}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 87, "average": 250, "very good": 545, "terrible": 36, "excellent": 274}, "aka": "Mercure Sydney Airport Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Mercure Sydney International Airport is conveniently located near both the international and domestic airport terminals, adjacent to the 18 hole Kogarah Golf Club and only 15 minutes from the city centre. Situated on the Cooks River and surrounded by parklands,the hotel features 271 rooms."}