{"user_rating": 4.0, "review_count": 415, "name": "Mercure Warszawa Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I booked this hotel as it had the best rate, in the central city, at the time I set up my trip, according to my travel agent. My overall experience here was quite nice. Room was clean and comfortable, service was not warm but it was professional and efficient. Every day the maid would forget something small when cleaning the room (a glass, no coffee replaced, that kind of thing) but it was always set right if I called reception, and quickly. The fitness room was good and the staff person there helpful. I used the jacuzzi every night after walking a lot each day and it was a pleasure. No pool but I was there for a conference and then walking tours, not swimming. TV selections for English speakers lousy but I wasn't in Warsaw to watch TV. Location is superb for touring Warsaw -- a lot of top sites are within walking distance, with the Ministry of Culture across the street. Hints -- don't use the Hotel Taxi to get to the airport -- mine never showed up even after reception called, then they got me a public cab and it cost 20 pzl less! Also, I would not use the restaurant or bar -- super over-priced with tons of great choices much cheaper within a couple blocks. Food and drink is very inexpensive in Warsaw; go elsewhere. If returning to Warsaw I'd stay here again, though I'd compare rates with the Marriot and probably just take the cheapest. Both are well located, fine hotels.", "title": "Good Experience", "helpfulness": 1, "user": "Ayersdj", "date": "May 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7636952, "likes": {"liked": "— Clean and comfortable room close to everything I was interested in.", "disliked": "— Over-priced restaurant and bar and unreliable over-priced taxi"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is a typical Holiday Inn. You could be anywhere in the world once inside. Comfortable, clean rooms, friendly efficient staff and a breakfast of good standard although the coffee is poor.", "title": "typical holiday inn", "helpfulness": 2, "user": "jcann", "date": "May 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7634295, "likes": {"liked": "— large clean rooms", "disliked": "— other hotels better placed for old town"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The location is excellent for the railway station and the new city, but less good if your main purpose is to walk around the old town.", "title": "Loved Warsaw", "helpfulness": 2, "user": "Galwaybay_lass", "date": "May 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7487928, "likes": {"liked": "— Clean and centrally located"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Hi", "title": "Good Location and Accomadation", "helpfulness": 3, "user": "Kittyoleary", "date": "March 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6933324, "likes": {"liked": "— Proximity to Shopping Centre", "disliked": "— Price of Food"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007", "text": "Visited Warsaw April 2007 had a fab time, weather excellent.", "title": "Great location, but not a great hotel.", "helpfulness": 2, "user": "bjaysfan21", "date": "February 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6788650}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "A very nice hotel. Really good location and friendly and helpful staff. It was baking hot outside and humid at night. However, the air con in the room was excellent and not too noisy.", "title": "Great location, great staff", "user": "EasternWestSussex", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18620315, "likes": {"liked": "— Location", "disliked": "— Limited room service menu."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Jacuzzi and Sauna was good. Would have made a massive difference if it had a pool though. My only other negative point was the limited room service menu. It would be great to get a few more things on there.", "title": "Great hotel and good location", "user": "Numberoneguest", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17172817, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Otherwise, I recommend this hotel to everyone and will be more than happy to stay there again.", "title": "Breakfast checkout ... laughing out loud!", "helpfulness": 1, "user": "WimdeWit", "date": "June 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16689997, "likes": {"liked": "— Con"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Stayed at Holiday Inn Warsaw for 5 night holiday. Excellent location near Central railway station and with huge shopping complex over road including restaurants, shops and supermarket. Easy and friendly check-in with Platinum Priority Club upgrade to Executive room. Hotel common areas and room were very well presented and attractive and in new condition. Good bus connection to Airport on bus 175 every 10 minutes or so in day. 5-10 minute walk to Centrum Metro station which takes you very close to Old Town or even better take Tram 4 from Centrum straight to Old Town (just below Royal Castle). Easy tram ride to National and Army Museums (no change) as well as Lizienski Park and Wilanow (one change). Overall an excellent place to stay and the price was good when booked in advance, highly recommended.", "title": "Still the same....", "user": "flame01", "date": "May 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 16299043, "likes": {"liked": "— Food, room temperature ( too hot)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Location of the hotel is superb, around the corner of Warsaw Central Station, at the opposite of a great modern shopping mall, and with bus 175 only some 25 minutes away from the airport. Modern building, big, well decorated, good rooms, well equipped. As in other Holiday Inn's: you can choose your own pillow, very nice idea. Room rate a bit pricy: 170 euro's for one night. The only flaw was the breakfast check out, with some pride announced on a flyer, supposed to enable busy business man to check out quickly. The breakfast check out however just means that you can leave your key card with the waiter, he will then check your name in his computer and tell you to go downstairs to registration desk. Where .. a super long line is waiting to be served by only two staff. When I asked one of the staff to help me right away (I had already paid with a voucher the evening before) the answer was \"I cannot help you, I am only a student\". Which for me was the sign to leave the key card and walk out. Great hotel, service and communication could be better. Still: I may return to this hotel if fate ever brings me back to the wonderful city of Warsaw.", "title": "Great location next to shopping mall", "user": "auttapol", "date": "May 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16053192}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Check in was ok. Didn't want to use my credit card to check-in and was given a difficult time. Finally they told me they would \"shut off\" all my ammenities. The room was ok. Reminded me of a Cruise Ship stateroom. I found the room to be clean and comfortable. However, I could hear noise from other rooms in the hotel. Didn't know if it was the vents or just bad construction. Room had very few ammenities. The coffee/hot chocolate for the morning was OK.", "title": "Much better than expected", "helpfulness": 2, "user": "DublinTourist", "date": "November 19, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6153221, "likes": {"liked": "— Good sized rooms and very clean", "disliked": "— Prices for drinks seemed high"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Location of the hotel was great. Next the train station. Not good from shopping or restaurants. The city is not up to the standards of the rest of Europe, so had to settle for Train station food that was really bad. Found a local supermarket a few blocks away and was able to buy water/meats/bread for lunch. Prices/service at the hotel was bad.", "title": "Beware Cancellation Policy and High Prices", "helpfulness": 1, "user": "Mr G", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 5535548, "likes": {"liked": "— Location", "disliked": "— Inflexible cancellation policy; pricy food and drinks"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Wasn't impressed with the town of Warsaw and should have gone to Krawkow instead. Not in a hurry to visit Poland again.", "title": "Great rooms, location", "helpfulness": 6, "user": "SK2004", "date": "May 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5023857}, {"rating": 4.0, "title": "Excellent hotel - but pricey for food and drink", "text": "I spent three days in Warsaw for business in early Nov 2006. Having expected the hotel to be pretty average, given that it was a holiday inn, I was pleasantly surprised by how nice it was. My room was quite large, with two double beds, decent wardrobe and drawer space, trouser press, room safe, english news channels on the tv. I was more surprised to see a pillow menu in the room, with different types of pillows that reception would deliver complimentary. Also complimentary toiletries were available if you had forgotten anything. Bathroom was a good size with shower over bath.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 9, 2006", "id": 4595846}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Well, in fact nothing special, just an average 4-star hotel in Poland dating back to 1989. Rooms are clean and quite spacious, but they do not have king beds, only 2 queen beds available. Air conditioning very poor and noisy at the same time. Cant use it at night. 5 types of pillows to choose from, quite impressive. Very strange thing at check in - I was told that as I prepaid the whole stay, all “extras”, i.e. minibar, Internet access and pay TV shall be blocked. Of course, I opposed. Breakfast good but you always have to ask for everything as the service in very inefficient.", "title": "average", "helpfulness": 3, "user": "PawelL", "date": "May 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 7655214}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "In terms of the # 75 bus from the airport & next to the Central Train Station & Golden Terrase Shopping Center, this hotel has a great location & nice American-style comfy rooms. What more do you want! They also have better prices than other nice hotels nearby.", "title": "Best price for a nice hotel taking the bus 75 from the airport.", "user": "Rodomaster", "date": "April 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15336919, "likes": {"liked": "— Location in Central Warsaw", "disliked": "— The breakfast is expensive."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "If you're lucky, you'll find your way about 3-blocks West to the Folks Gaspoda Restaurant if you want to experience the real-deal in a folksy Polish restaurant. I had the duck & it was good!", "title": "Good location, fairly priced business hotel", "helpfulness": 1, "user": "mijansso", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12554440, "likes": {"liked": "— Location, fair prices in bar & restaurant", "disliked": "— Look & feel of interiors a bit worn out"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "For location & price, it's hard to find a better hotel!", "title": "OK, but poor cousin of the InterContinental around the corner", "helpfulness": 2, "user": "tiralb", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 10013601, "likes": {"liked": "— Helpful staff", "disliked": "— Lack of non-smoking rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The Holiday Inn Warsaw enjoys a convenient location near many major business headquarters in Warsaw centre.", "title": "OK but go elsewhere for value.", "helpfulness": 3, "user": "Macca07", "date": "September 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8666958, "likes": {"liked": "— Good sized, clean room", "disliked": "— Customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "The hotel itself is looking a little \"tired\" in its interior deco, but the staff is very friendly and the price for a room is far more reasonable than in some of the neighbouring hotels in the area. Contrary to what was told to me, the hotel is very quiet and pleasant in this way. Prices in the lobby bar are truly reasonable by comparison to many other hotels in the area. Internet access is not free.", "title": "Business Travel Simplicity", "helpfulness": 1, "user": "Sky_Blue_Sea", "date": "July 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8213471, "likes": {"liked": "— Central location, new facilities", "disliked": "— internet cost"}}], "location": {"country": "Poland", "region": "Central Poland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 74, "very good": 204, "terrible": 7, "excellent": 106}, "aka": "Holiday Inn Warsaw Hotel", "slim_ranking": 0.229357798165, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Mercure Warsaw Center hotel is located in the heart of the city and opposite to Palace Of Culture & Science-the icone of capital city. Offices of international companies are in walking distance.Across narrow street from Mercure Warsaw Center hotel new generation multi-functional complex Zlote Tarasy is located (shopping, cinema, entertainment, Hard Rock Cafe, Akwarium Jazz Club). Hotel is located only 2 min. away from Central Railway Station.This 4-star business hotel combines fine polish hospitality, international cuisine and modern business facilities (high speed & wireless internet). Hotel has 338 comfortable air-conditioned rooms (suites, standard, Executive and non-smoking). You can enjoy the traditional Polish Menu in our 'Symfonia' restaurant or simply have a drink in our 'Preludium' bar. To relax, the hotel offers Fitness Centre including sauna, jacuzzi & gym. The Mercure Warsaw Center hotel is the best location for international events, exclusive board meetings and seminars - 11 conference rooms with modern multi-media equipment. Hotel was awarded many times - Torchbearer Award for excellent quality of service."}