{"user_rating": 4.0, "review_count": 481, "name": "Mercure Letchworth Hall", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "My husband and I stayed at this lovely hotel after our wedding, as we wanted a quiet relaxing getaway before we went abroad on our honeymoon. The hotel had a 30% off a 2 night stay and free glass of pimms offer at the time (August 2012) so we accepted this deal and they kindly upgraded our room to an executive room as they heard we had just got married. The room was very clean, spacious, modern and nothing was too much trouble for the staff there. Beautiful hotel with amazing decor and if you stay here you MUST have afternoon tea!! But make sure you get a 2 for 1 deal on groupon or similar site as its £16.95 each! The restaurant dinner prices were quite expensive, but the bar menu was good value for delicious meals. This hotel is out in the middle of nowhere, so if you want to go out and explore, there really isn't much. However, we loved its location as it matched what we wanted - A quiet, relaxing getaway. There is a small town with a small high street of shops, but nothing special. There is a lovely park nearby and on a sunny summers day with ice cream in hand it was gorgeous! Very relaxing stay and we had use of gym and leisure facilities, which were great! On our second night there was a wedding being held at the hotel - the wedding reception room was just below our bedroom, so as you can imagine it was very loud. However, it wasn't a problem as we were newlyweds ourselves, but just wanted to include it in our review so future guests know. We had a lovely stay and would highly recommend this hotel to anyone.", "title": "Beautiful hotel for a relaxing break", "helpfulness": 1, "user": "SarahSullivan", "date": "September 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 139493380}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed here for one Saturday night after a wedding.", "title": "Pleasant stay let down by breakfast", "user": "Burgessimo", "date": "September 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 139228642}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Upon arrival we had no queue before checking into the hotel. However we were told the room wasn’t paid for despite booking and paying for it in January so we handed over the credit card again. This was a bit confusing at the time but found out later there were no charges made on this card. Once we got to our room we discovered we’d been given a suite which was an unexpected surprise. When entering the hotel room it was pretty exciting to have a staircase in the hotel room - although this consisted of a sofa upstairs!", "title": "Excellent Stay", "user": "HlmsLis", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139173294}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "A peaceful sleep was had in the large room with a view of the beautiful hotel grounds. The room was clean and had an air con unit.", "title": "Amazing Room but felt let down", "user": "jeaniem66", "date": "August 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 138937924}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Breakfast in the morning was a bit chaotic. There was a long queue going outside of the hotel for hot food which kept running out as it was so busy.", "title": "Rather Very Good!", "user": "Biriyaniboy B", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138220178}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Stayed for one night while travelling. Got an excellent deal of room + breakfast for 99 pounds.", "title": "Very comfortable overall", "user": "JeffStranks", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140230443}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Room was very comfortable and breakfast was very good too. I found all staff to be pleasant and helpful.", "title": "Letchworth Hall Hotel", "helpfulness": 2, "user": "Mike W", "date": "September 13, 2012", "detail_rating": {"value": 1.0, "service": 2.0}, "id": 140147222}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The grounds are really nice and the original building is attractive too. Rooms appear to have been renovated and have most comforts.", "title": "top value", "user": "graham c", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140016359}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Two minor niggles: why do UK Mercure hotels seem to have no mini-bar? And the soundproofing here is not good, if someone near you gets up earlier you're going to know all about it.", "title": "Letchworth is lovely", "user": "TG58", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 140014622}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Recommended, though. I also stayed on this trip at Mercure Banbury - here was cheaper and way better.", "title": "LHH made our Wedding!", "user": "Marshy218", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139970790}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Four of us went using 'travelzoo' coupons, so we got the 'champagne' afternoon cream tea for £25 per couple.", "title": "Very pleasant afternoon tea", "helpfulness": 2, "user": "dedicatedtraveller", "date": "August 22, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 138011963}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We sat in a large, light, very pleasant, lovely cool hall. The settees and chairs were very comfortable - we sat there for over 2 1/2 hours!", "title": "Nice hotel", "user": "SelbyKarl", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137923514}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "It was lovely to have proper, large, quality linen napkins. I must say when I first saw the sandwiches I did think, 'not very even in shape and contents of filling' but as is often the case, although they wouldn't get 10 out of 10 for presentation, they were all very tasty, very fresh and very nice to eat. The scones were warm. One of our party doesn't eat dried fruit and no plain or cheese scones were available as an alternative but that's only a personal thing. There was plenty of thick cream, the jam was ok but not top quality. The cakes were very fresh and delicious to eat. We were all certainly very full by the end!", "title": "Friendly and Helpful", "user": "MagsW1947", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137891101}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "You could have a number of alternatives regarding tea. Two of us had coffee and we had several cups each.", "title": "Excellent Stay", "user": "Carol G", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137710033}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We've stayed in this hotel twice now, the first time we couldn't really have found any fault however the more recent stay was somewhat disappointing. The room was spacious, clean and modern. We used the gym, swimming pool and sauna which was great. When it came to dinner we were presented with a disappointing menu and poor service. The waiting staff did not seem to want to be there and did not appear to cope well with the demands of a busy restaurant. Eloise especially seemed that she had to force herself to say anything to a customer and did not have it in her to crack a smile. Not sure that we would return again.", "title": "Staff need some training", "user": "flo0912", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139937535}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I bought a Groupon deal for the Letchworth Hall Hotel as a gift which included an overnight stay, 3-course dinner, bottle of wine, and breakfast. After purchasing this deal, I read some of the reviews and was terrified it was going to be awful! Went along last Saturday and have to say I was more than pleasently surprised. The staff could not do enough for you. The room was clean. The dinner in the evening was gorgeous (I chose the antipasta and twice baked pork belly) - shame I couldn't do it justice, as we opted to try the afternoon tea and was still full from that! Again, a nice selection of sandwiches, cakes and a massive scone! Good breakfast in the morning. Well kitted out gym and lovely pool. On the down side - no speciality coffees or cocktails, and a little tired looking in places,", "title": "Groupon Deal for Letchworth Hall Hotel", "helpfulness": 1, "user": "RedsEdgware", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139876175}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "we enjoyed a lovely meal,the hotel has no lift,and the bathroom was badly designed.no rails and you needed to take care on the toilet marble top sticking out you could easily bang back or arm.staff very friendly and helpful,food excellent.Our bedroom was above the kitchen so we found it a bit noisy in the morning Overall an enjoyable stay,", "title": "aniversery celebration", "user": "sandra w", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139840008}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We recently stayed at this hotel when we attended a private 3 course dinner in their restaurant (60th Birthday - 24 in our party) and would like to say a big thank you to Clare Ritchie and Jordan who provided us with great service. The food was fabulous and our room - which looked as though it had been recently refurbished - was very spacious with an effective air con unit. Breakfast was lovely too, although it was great for us all to sit together for breakfast we were a little squashed and it would probably have been better to split us into a couple of tables. Having said that we would certainly return to this hotel.", "title": "Well Done Letchworth Hall and Jordan!", "user": "AnnetteUnitedKingdom", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139651281}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "I stay here an awful lot through work. I am permitted to stay in whatever hotel I like but always come back here.", "title": "Always a pleasure.", "helpfulness": 1, "user": "Major M", "date": "September 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 139590054}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 53, "average": 93, "very good": 152, "terrible": 23, "excellent": 160}, "aka": "Mercure Letchworth Hall Hotel Letchworth", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Refurbished & Relaunched in Nov 09 Mercure Letchworth Hall Hotel is a true 4 star hotel. Dating back to 1625 this quintessential Olde English Manor house retains many of its Jacobean features which have been tastefully restored. The Hotel is set in 8 acres of gardens including a developing meadow which attracts Mont Jaq Deer and Letchworth's Black Squirrels. Letchworth Hall is ideally located for exploring the picturesque market towns of Hitchin and Baldock & the larger towns of Luton and Cambridge."}