{"user_rating": 3.5, "review_count": 272, "name": "Mercure Ayr Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "This hotel has been recently bought over and certainly isn't up to the usual Mercure standard. It needs a good coat of paint and modernisation. I was there on business so ate in the restaurant for convenience. It was unremarkable but not unpleasant. The pork at night and bacon at breakfast were both over-cooked but I suspect that says more about the clientele than the chef.", "title": "Needs a make over but...", "helpfulness": 1, "user": "AnnaF64", "date": "November 5, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 120206003}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The view down to the sea is great. I suppose the hotel is a bit like Ayr - seen better days but trying hard. The receptionist and barman/waiter were really friendly and warm.", "title": "A Great Weekend", "user": "Janet G", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120197148}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "A group of 20 of us were at the hotel for a weekend from the 28th - 30 th oct we had use of a meeting room which was very good. the staff were very helpful at all times, the tea/coffee which we ordered was always on time in our meeting room, the food was fresh and excellent the rooms were very comfortable and clean. I have no complaints at all with this hotel and would recomend it", "title": "Fantastic staff and great location!!!", "user": "Tom151011", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119974533}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "I recently spent a weekend at this hotel and can honestly say I had a great time.", "title": "Brilliant weekend break great hotel", "user": "abarr123", "date": "October 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119888604}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "All the staff were warm and friendly and nothing was too much trouble for them.", "title": "A hotel with soul.", "helpfulness": 3, "user": "beafrrespirit", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119667277}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed overnight at the Mercure, and the room was clean and comfortable. The staff was extremely nice and accommodating. We had a couple drinks at the bar in the lobby and returned for breakfast in the morning. Breakfast was a buffet with a fair choice of foods. We loved the location as it was a short walk to pubs, shopping and restaurants. It was good value for money.", "title": "a nice stay", "helpfulness": 1, "user": "Missizlove", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121425706}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Stayed here on a golf trip for two nights. Staff were very acomadating and organised our transport and anything else we asked. Great view from our room and it was great to come back to relax with a swim. All rooms have been renovated. Would highly recommend.", "title": "Great value, great hotel", "helpfulness": 1, "user": "alansmiths", "date": "November 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121074218}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I've used this hotel numerous times whilst working in Ayr and never had any issues. It has a good central location. Some of the rooms have been refurbished and so are better than others. The hotel has only recently started charging for parking. Breakfast is a bit of a rip off - better off at the Fullerton Cafe across the road. Staff have been helpful although the bar can be quite slow if there are a lot of customers all at once. However, this hotel ticks all the boxes for a short stay business trip to Ayr. Good facilities with gym and pool.", "title": "Central Location", "user": "AngusAsh", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120499732}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Had a weekend golf break here with my sister. Staff could not be more helpful and friendly. Rooms are basic but reflect the cost and the food was enjoyable. Overall great value foe money.", "title": "Great staff", "user": "christinedoig", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 120379649}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I would like to say a big thank you to all the staff and management at the Mercure Hotel in Ayr. I had a wonderful stay last week. The bedrooms where exceptionally cleaned from top to bottom and decorated to a comtemporary standard. Breakfast was lovely and where was plenty of choice from hot or continental. I have to say a special mention to the girls on reception, especially Fiona who went out her way for us on serval occasions with towels and providing information. I will definitely be back.", "title": "Exceptionally Clean and Friendly.", "user": "Richard B", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120376375}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I recently attended a charity night with my old army buddies and decided to use the Ramada due to its central location and health club facilities. On check in the staff were very friendly and informative giving us excellent directions to pubs and shops near by. We found the atmosphere in the bar and restaurant first class and the staff were friendly and chatty. The next morning feeling worse for wear we used the health club facilities and again thoroughly enjoyed our visit chatting to the members of the club and staff who all were very friendly. At breakfast time it was very busy but being a city centre hotel this is always the case so we couldn't really grumble and the food sorted us out for the day. All in all a cracking weekend and will be booking a return visit which is on the cards.", "title": "Great time had by all, great hotel.", "helpfulness": 1, "user": "James A", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118976136}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Stayed at the hotel with my sister--in-law for a short winter break at a great rate from the hotel's own website.", "title": "Warm, friendly with stunning views from sea-facing rooms.", "user": "Maeboyce", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123745852}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "The hotel is easy to find although they charge guests to park (Badge Holders are exempt from this) although parking is at a discounted rate. The two receptionists on duty were particularly welcoming and friendly and we were quickly allocated a room on the top floor with glorious sea-views. The room was very clean although we needed more pillows which were delivered quickly.", "title": "Fantastic", "helpfulness": 1, "user": "Lulu0220", "date": "January 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123077901}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The one disappointment over our trip was that due to very bad weather the hotel had closed off their front door and guests were using the side entrance. This was fine during the day but when we returned early evening, it was very dark and the lighting at the side of the hotel was not working. Unfortunately the ground is just a little uneven (not much) but she managed to find a little divet and went down like a ton of bricks on her ankle. The staff could not have been more helpful and took a note of this and also placed a \"warning cone\" over the rough patch of ground. This was only an issue because there was no lighting working outside.", "title": "Nice staff, but an aging hotel in need of major investiment", "helpfulness": 1, "user": "Chris B", "date": "January 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 122975906}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Later in the evening (after resting her foot) we needed to venture out to eat (the hotel restaurant was completely empty so we would have felt a little uncomfortable eating there), we asked to use the front door and the staff were happy to open this up for us and also telephoned for us (at their suggestion) to find out if a local restaurant would still be open. Sadly it was not and we had to settle for the most disgusting food from a nearby take-out. If we had thought about it, we probably could have and should have had room service.", "title": "just around the corner from everything", "user": "Ferdinand F", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122821852}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Must admit to being a little disappointed not to hear from the hotel to enquire after my sister-in-law after her fall. Not expecgting anything from the hotel just a caring attitude and an assurance the light was now working.", "title": "Great Service & friendly hotel", "helpfulness": 1, "user": "Jane F", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122647370}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 28, "average": 69, "very good": 97, "terrible": 12, "excellent": 66}, "aka": "Ramada Ayr", "slim_ranking": 0.681818181818}