{"user_rating": 4.5, "review_count": 183, "name": "Mercure Porto Gaia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "The hotel is connected to a large shopping mall, the lobby of the hotel is spacious with a bar, small dinning area and a large breakfast room. Check in was quick, staff very friendly and willing to answer any and all questions. Room was on the 1st floor, so not much of a view, except of the freeway which was ok, because I did not intend to spend much time in the room. The room was very nice, large with a comfortable bed, flat screen tv, free wifi, and a mini bar, The window did not open as there was no handle attached, they had been taken away for safety but if you wanted to open the window for fresh air, you could request a handle. The rooms have excellent soundproofing and I did not hear any noise from the outside. Breakfast was not included and IMO was a bit expensive 11euro's the breakfast had a nice variety but not worth the price. There is a large grocery store in the mall so one could purchase some breakfast items and keep them in the mini bar as there is a room for some personal items. Be aware however, there is a notice on the inside of them mini bar that any items removed will be immediately charged to the room, this is done electronically so don't move any of the items around or take them out to look at them unless you want to be charged for this. The hotel is not close to he city center/old town, there is public transportation very close by, but will not go into detail about it. If you are considering this hotel email me and I will give you directions. I did ask at the front desk but they seemed to discourage me from taking it, I think they wanted to sell the tours and taxi's, but then that is the business they are in. Again a nice hotel for a nice stay.", "title": "Perfect hotel for visit", "user": "yvr1", "date": "March 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154409784}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "From check in through advise on Port Wine at the bar, quality of breakfast, availibility of newspapers, or an umbrella on a rainy day .... all staff , reception, bar, restaurant or house keeping, staff are always friendly and efficient ... just perfect!!!", "title": "Perfect in every sense", "helpfulness": 1, "user": "JorgeEnriqueInMC", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150566825}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I have stayed for three weeks in business and was been a great stay. The room is really modern ans comfortable, the breakfast was really nice! All the staff really friendly. There are a huge shopping center connected to the hotel! I recommend this hotel!", "title": "Really nice 4* hotel", "helpfulness": 1, "user": "xfparreira", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147184077}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "Good hotel clean and functional. Well trained staff on reception and very helpful.Hotel is out of town hence cheaper price than Porto hotels but city is accessible by taxi or bus. The rooms are quite small and there is not enough hanging space for clothes only a single wardrobe in bedrooms so one person in a double room will have to live out of suitcase !", "title": "Good value hotel", "user": "DianaMcdonough", "date": "November 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 146005672}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is on the top of a hill in the new area of Porto and has a large shopping centre 2 minutes away. Access to the old city is a 5 euro taxi ride to the river to start you Porto visit. The rooms are very comfortable and alternative transport is available in front of the shopping centre. We paid for private parking but there would be no need for this as there is a large parking area in front of the hotel. Food was good and the room was elevated giving good views to the sea.", "title": "Good Location for Porto visit", "helpfulness": 2, "user": "greymanAustralia", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144969318}, {"rating": 4.0, "title": "Gezgin", "text": "There was group checkin and we wait more then 30 minutes to check inn. This hotel has lower then 4 star hotel standards. Very clean hotel", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 22, 2012", "id": 130417508}, {"rating": 4.0, "title": "Updated Hotel", "text": "I've stayed at several Accor hotels around Porto and always end up staying here because of the mall next door, my previous review said nice location but dated hotel. Well checking into today I noticed a pile of old style TVs, and yes sure enough, years latter than other hotels they have finally replaced the TVs, best part not your usual hotel TV (ie no on demand porn) so this means if you have an HDMI cable you can easily hook up your computer to watch what you want.", "user": "Canadianrobmadrid", "date": "May 12, 2012", "id": 129810274}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Other than that there is nothing I can add to the other reviews", "title": "Quality at an amazing price", "user": "cevada", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 128406112}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Although it's located in Gaia (not central Porto), the Hotel offers a high degree of quality for it's guests. It's not the perfect hotel for one who wants to explore Porto by foot, but for the business traveller it's perfect.", "title": "Up a hill", "helpfulness": 1, "user": "Lazen60", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 127226716}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The Hotel is located in the modern shopping center so in walking distance you can find entertainment, restaurant, gym and large Parking area. The rooms are nice with enough space to feel comfortable and nice decorated. In the morning, I'd suggest take the breakfast at the hotel.", "title": "Comfortable Hotel", "helpfulness": 1, "user": "danvillro", "date": "October 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 144098145}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The Hotel has free internet service. you can get a professional internet service by payment. The only negative point is that despite I paid for the professional internet,It was disappointed because It didn't work well. I did the claim to the reception,the answer was that the hotel has received some claims about the professional internet service and no money back. It looks as a robbery. it isn't?", "title": "GREAT FOR VALUE", "helpfulness": 2, "user": "nabilafarhat", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135660021}, {"rating": 4.0, "title": "Perfect stop during trip", "text": "Anyway, this point didn't make me cut off to enjoy my stay at the Hotel", "helpfulness": 2, "user": "Ewa K", "date": "July 22, 2012", "id": 135045455}, {"rating": 4.0, "title": "Patricia - Portuguese resident", "text": "Excellent situation just off main access road to Porto, by shopping centre with plenty of inexpensive dining options. Had a superior room with tea and coffee making faciloities. Machine did not work and had to phone reception twice and wait a long time for someone to attend. Then we were given instant sachets and a kettle!", "user": "A TripAdvisor user", "date": "October 29, 2011", "id": 119875972}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Two couples came for a 4 day break on the 4th October 2011, one English & one French, the staff were able to speak fluently in both.", "title": "Great hotel", "helpfulness": 1, "user": "Garry S", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119095500}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This was one of the cleanest & quietest hotels I have stayed in. The staff were very helpful, nothing was too much trouble.", "title": "hotel", "user": "racheljerusalem", "date": "August 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 116506269}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The hotel is also great for travellers without a car. Taxis were around 5 euros to get to the centre of Porto for the four of us.", "title": "Nice hotel for business trip", "user": "izarauz", "date": "July 29, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115958051}], "location": {"country": "Portugal", "region": "Northern Portugal", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 12, "very good": 97, "terrible": 1, "excellent": 70}, "aka": "Mercure Hotel Porto Gaia", "slim_ranking": 0.2, "description": "Mercure Porto Gaia hotel is in Vila Nova de Gaia, close to the centre of Porto and alongside Arrabida bridge. The hotel enjoys a privileged location, only 5 min from port wine cellars and 12 km from Porto international airport and the Exponor exhibitioncentre. The hotel is decorated with a port wine theme and offers a restaurant, bar, meeting rooms, WiFi Internet and parking. Next to Arrabida shopping centre and the Holmes Place health club, the hotel is perfect for your business or leisure trip."}