{"user_rating": 3.5, "review_count": 133, "name": "Mercure Lake Macquarie Rafferty's Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Attended a beautiful wedding and stayed in No. 605. Returned after the wedding at 10pm to find there was no hot water, reception was closed. We contacted them at 8am the next morning but still hadn't seen anyone by 10am so checked out. We had no hot water for the entire time of our stay so were unable to shower! Later I sent an email advising of our disappointment and now they are trying to tell us that there was nothing wrong with the hot water, it's not instantaneous. What rubbish! we ran the taps for over 5 minutes and it wasn't even beginning to get warm.......no offer forthcoming for any type of compensation - will not stay again.", "title": "OK if you don't need hot showers", "helpfulness": 1, "user": "Pat W", "date": "June 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132684765}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The website is definitely done by a pro because the real resort does not look as good as in the pic (or are the resorts all the same?). The room which is a two bedroom townhouse with ensuites is basic to the dot. The quality is not more than 3-star, more like 2.5. The food is AWFUL, overcooked, oily, the veggies are not fresh but the restaurant service is excellent. For which very fortunate to offset the disapointment from the food.", "title": "Overpriced", "helpfulness": 2, "user": "hcze", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132631770}, {"rating": 2.0, "title": "Don't understand previous reviews!..awfull", "text": "Apart from the accommodation (we were lucky, we stayed in one of the better apartments) and surrounding gardens the resort falls so below par Mecure should be ashamed. The resort is a franchise. Breakfast..(if you can call it that) has to be the poorest I have experienced in living memory from any hotel or resort. The poor old staff are woefully overwhelmed but credit to them they manage to retain a smile whilst they attempt to find a table to actually seat you! The food is basic and avoid the so called Italian restaurant....crazily over priced and bland and when you examine the surrounds would only just pass off as a cafe. Pizza was undercooked and certainly nothing that fresh about it. Pasta had no taste what so ever. Run down place...and not surprisingly we weren't even asked on checking out whether we had enjoyed the stay.", "helpfulness": 5, "user": "Carlton W", "date": "June 12, 2012", "id": 131803315}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I stayed for two days and overall I thought it was overpriced considering what you are getting in terms of the terrace house and facilities. Although, that’s not the issue; some of the staff have an attitude problem. I was willing to overlook the first time my wife tried to access the wifi and got absolutely no help from the reception staff how to set it up so we just gave up. My second encounter with the rude reception staff was when I tried to check-out. It was about 8:40 am on a Monday and I stood in front of the counter for 15 min while this woman with medium length blonde hair was checking in another guest. She must have asked for the booking name 6 times while they both were looking on the computer for the booking. I found it hard to believe that so close to the 10am check-out time that it was going to take every guest 15 min to get checked out. When there was a break in their conversation I politely said “excuse me how do I get checked out”? This woman proceeded to raise her voice and took an angry tone and told me to “wait my turn while she finished with the other guest”. I think in that case a simple “I will be with you in a moment” would have sufficed. The way in which I was spoken to with the raised voice and the angry tone I know that at many good hotels she would have been fired on the spot. I strongly suggest that this resort needs to teach their staff some better manors and just some common sense of how to speak to paying guests. In addition, the three restaurants on site were very average but the Thai food was terrible; I have nothing good to say about it. This place is a lake side resort and you would think that for what they are charging they would make a little more effort. I defiantly will never be back", "title": "\"very rude reception staff\"", "helpfulness": 2, "user": "eatingoutsydney048", "date": "June 11, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 131716972}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed here for 2 nights in October 2012 on a scoupon deal with my mum and 2 kids. When we arrived the property could not find out booking but the receptionist was very helful and when it was all sorted we were upgraded to a 3 bedroom loft suite. The resort is a 10 minute drive from the nearest town with supermarkets and essentials so good idea to pick up groceries before settling in if you don't wish to leave and you won't need to !!! The pools are amazing, my kids spent 6 hours playing with other kids. We had a voucher for the onsite Italian Restaurant which we used the first night. The food was nothing short of amazing. It was so good we went back the second night and paid for it !!!! The resort is right on the lake with spectacular sunsets. This is the place to go if you want to sit back and do nothing which is what we were looking for as we made our way back to Melbourne from Noosa.", "title": "Fantastic spot to just relax !", "user": "singlewith2kids", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143740082}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Stayed at this hotel for one night at the Cottage . Excellent service !", "title": "Great place to stay !!", "helpfulness": 1, "user": "Yossitr1", "date": "September 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 140739111}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Great location with stunning views .", "title": "Great Weekend", "user": "libloy1", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136865812}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Had a great time again this year. We are a young family we stayed in 99 a three bed unit across from the great heated pool and BBQ. This unit was in better condition than the previous unit 65.", "title": "Easter at Raffertys", "user": "Mum09", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128472486}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The staff at the kids activities lacked interest and experience with kids and the restuarant in the main complex is way too expensive, but we still had a great time and enjoyed the good weather.", "title": "Had a great time.", "user": "Sally T", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128366923}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "Just a warning; make certain you don't leave anything there when you leave you are very unlikely to see it again.", "title": "Horrible Place", "helpfulness": 3, "user": "Janddy", "date": "April 22, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 128328503}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "My husband and I stayed for two nights over the last weekend and would definately come back. We stayed on a scoopon vouchure which was great value for money and we had been upgraded to delux accommodation without even asking. Our two bedroom terrace had just been renovated and was very comfortable. However, I did notice that some of the other villas were in desperate need of updating so I can see what some of the other reviewers were talking about. The facilities were great and well maintained and the dinners and breakfasts were faultless. Dont go in school holidays though if you dont like screaming children as that did become a bit much but not the fault of the resort as it is marketed at families. I would however suggest to the resort manager that some security would be beneficial as there was a brake in on sunday morning and there were a couple of rowdy groups in that went late into the night with no one to complain to. We found the staff very personable and helpful so overall would definately recommend it.", "title": "We booked through Lake Macquarie Resort Accomodation", "helpfulness": 1, "user": "Sabbylicious", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128026531}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Spent a weekend at Rafferty's Mercure Lake Macquarie early November for a family celebration. Stayed in a two bed townhouse which was very nice inside - 2 bed 2 bath, ample space and nicely renovated and clean. Bathrooms and beds were good. A little noise at night from people walking back to their houses from a wedding reception. The pool, lake and grounds were nicely maintained and have nothing bad to report. Seems to be lots of options for 2+ bedroom accommodation however if you just want one room for a single or couple, its a bit expensive.", "title": "nice place for families and for get-togethers", "user": "CiaraB", "date": "November 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144988769}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Had an awesome time. The area is nice and relaxing. There are awesome views by the water, multiple pools and the spas are heated. The customer service was awesome, everyone was soooo helpful and welcoming. The highlight of my trip was the massage by a guy named Andy. He has magic fingers and also gives you advise on different things. The food at the Italian restaurant was awesome esp the sticky date pudding....... finger licking gooooood.", "title": "SERENITY!!!!!", "user": "M C", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144711351}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "overall we had a reasonably pleasant trip but some notable issues were, check in debacle. they are currently doing roadwork near the entrance so avoid a room here as its VERY noisy, we asked to move and reception at first didn't seem too inclined to help and when my husband went back to inquire again reported the staff member was quite rude however the manager himself was very professional. After a 2 hour plus wait as computers were down we got moved but then had to move again as the room had not been serviced. the terrace we got was an upgrade (other 2 cottages were outdated ) was furnished well and clean but as noted in previous reviews the beds are truly woeful....the first night i got 2 hours sleep as the mattress is like concrete, truly one of the worst beds i've slept on and this is the reason i couldn't stay there again actually. i literally cant sleep on it and yes not a single spare blanket so couldn't sleep on the huge lounge downstairs either. they really need new beds as its obvious these are bargain basement mattresses currently. the pool area was nice with a good view of the lake and we utilised this a lot with our young child however there is duck poo everywhere unfortunately and cracks in the concrete surrounding the pool. also my husband noted the service was poor, no one coming to collect empty glasses and a large group resorted to pulling over an otto bin to throw their empties away...service whilst friendly was lacking. TV reception in the rooms was bad and \"foxtel\" amounted to a couple of channels. we ate in the Italian restaurant one night and it was ok. the new caves beach hotel 5 minutes drive away is much better with and has a large children play area which is good for people with kids too. its a shame that rooms and beds arent better quality as this is a good location and easy drive from sydney. could do with some TLC.", "title": "okay...but a couple of big negatives", "user": "rainlover2727", "date": "November 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 144629930}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The resort is very very nice with lovely staff. Best place to relax and not too far from home. We bought a voucher through Scoopon website for a 2bedroom loft cottage. The rooms and the cottage were excellent. Best location to spend a weekend to just relax in the heated pool or just sit by the lake. Highly recommend the place whether you are with friends, family or kids!!!", "title": "The place to relax close to home!!", "user": "akshat c", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144439772}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We had Two nights at Rafferty's. It was average i felt.", "title": "A bit of a Hit and Miss", "user": "ZMR89", "date": "November 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 144428324}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 17, "average": 32, "very good": 50, "terrible": 10, "excellent": 24}, "aka": "Mercure Lake Macquarie Rafferty`s Hotel Cams Wharf", "slim_ranking": 1.0, "description": "Mercure Lake Macquarie Raffertys Resort is located on the shores of Lake Macquarie, just 90 minutes drive north of Sydney and only minutes from the beach.Ideal for a holiday, the resort is in a bushland setting and features 105 self contained cottages, 2 restaurants, 2 bars, 4 swimming pools, 4 tennis courts, water recreational activities, massage centre and a kids club. There are also 6 meeting rooms available for conferences and receptions."}