{"user_rating": 4.0, "review_count": 556, "name": "Metropark Hotel Wanchai Hong Kong", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Booked thru hotel website directly. Stayed 2 weeks and got an extended-stay special (offered until August because hotel is under small reno which has minimal effect on the service level). Booking was very convenient. I called the number and everything was confirmed by email and got what I requested.", "title": "Pleasant stay, central location.", "helpfulness": 2, "user": "Albert C", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170336141}, {"rating": 4.0, "title": "Excellent solution!!!", "text": "The best part of Metropark Wanchai is location. It is only a 5 mins walk from underground train (MTR) station which takes you nearly every where. Convenient store is right across from the hotel, a supermarket is 1 block further south, and a Wonton place with a Michelin Star (called Wing Wah) is a block away. The only downside to the location is that the red light district is a block behind the hotel, but the good thing is that if you don't want to venture out to the district, you can stay on Hennesy Road and you won't even know it is there (avoid the Lockhart Road exit from the MTR station as it leads you directly to the red light district). Also, some buses runs all night and noise might be an issue if you are on lower floors.", "user": "Matteo B", "date": "July 28, 2013", "id": 169544726}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Concierge is very helpful and greet me with smiles always. Checking-in was fast. We arrived early in the morning and the room was not ready until noon which we knew ahead, so they just stored our luggage for us for the time being and we went out to have brunch and shopped a bit. Although the hotel lobby is under renovation, it is not a big problem as the service is still excellent. When checking out, they stored our luggage also before our tranportation arrived. (Joe, you are very helpful!)", "title": "Great location and food, so much food!", "helpfulness": 1, "user": "Ah_Moon", "date": "July 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169113668}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Room is standard Hong Kong sized. It has a desk, a TV and a closet. Mini bar is stocked and has free tea and intant coffee and a kettle. Room is clean and pleasant, and a safe is provided. Toilet is clean, but it would be nice if they can re-grout the tiles; it looked grayish in certain parts. Cleaning was done every day and they have done an excellent job. Supplies (toothbrush, shaving cream) were constantly restocked too. Wifi signal is excellent (they just upgraded the system). For charging your phone/laptop, they even provide a universal converter. A very nice touch. No clock in the room though, so bring your own.", "title": "excellent service", "user": "Simon1067", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168848507}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Overall, I am very happy with my stay. Next time when I visit Hong Kong, this hotel will be on the top of my list.", "title": "Value in HK!", "helpfulness": 1, "user": "TravelCQ", "date": "July 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167890821}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "What is up with the mildew in this place?? This is a really nice, modern and centrally located hotel but man alive, it stinks of damp and mildew. I've actually run across this at several properties in Hong Kong and Macau so I guess it's a thing. I was spontaneously upgraded to the SHE floor, which is a ladies-only floor (that means ballerina pictures over the bed and a sparkly headboard). It's a nice idea, but I don't think they really enforce it...there was no key swipe necessary to reach the floor, for example. Great bed, great features and amenities just...damp and smelly.", "title": "High rating despite the pervasive MILDEW odor", "user": "Phoebe H", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 174306068}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Stayed here for over a week with work and was pleased that there was a direct hotel bus from Central station. With the Airport Express train, less than an hour from terminal to hotel. Great selection of buffet breakfast (including hot food) and welcoming helpful staff. I had a taster dinner plate and it was well presented and tasty. Location is between Admiralty and Wanchai MTR so if you are here for business or recreation it's ideal. Wanchai has nightlife in all its forms and is 'colourful' but the streets felt safe. Lobby is small and rooms on the small side but perfectly adequate and clean. Air con was a godsend in July ! I would happily stay here again.", "title": "Excellent hotel in great location", "helpfulness": 1, "user": "Fun2Fly", "date": "August 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 173803241}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I had forgotten some travel docs in my room and it was brought to my attention after I arrived at the airport, about 30 plus minutes or so away...one of the staff, Ms. Kwong, jumped into a cab and rushed them out to me at the airport! I, of course, paid for that cab, but I was amazed at the level of service, this was second to none! I will be staying with them whenever I go back to HK, you can't believe it until it happens to you...I have started memory exercises, (lol) ...but having staff like this, is beyond measure.", "title": "Above and Beyond the Call of Duty", "user": "BrianSCDN", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173504748}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We stayed in this hotel for a business trip in Hong Kong. The hotel has a modern design and the rooms are comfortable and cozy.", "title": "Good place to stay in Hong Kong (HK side)", "user": "RandellTiongson", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173223392}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "A big plus of this hotel is the breakfast buffet, really yummy dimsum being served. Lobby is small but it doesn't really matter. This is a no frills hotel but offers good value. It is near an MTR station so it is quite accessible. There are many eating areas around the hotel if you fancy Hong Kong food.", "title": "Nice hotel", "helpfulness": 1, "user": "KONSTANTINOS_CRETE", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173010988}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "A very mixed bad of reviews for this hotel. Metropark Hotel ( MH ) was pre booked for me through work. They are currently renovating the reception area which is making the place look somewhat untidy. But hey...things have to be done. Reception was slow on arrival and departure. ,,,but then I do have to say there were a lot of people trying to check in and out so it was busy. But all four desks were open and all staff were doing their best to get things sorted ASAP. There are a few steps to the elevators from reception area which can be difficult for elderly and people with heavy luggage. My particular room was very roomy by HK standards. It was clean. Everything worked ..TV..WIFI...etc. Overall I don't really have much to complain about to be honest with you. Bed was nice and big...comfortable for my liking... Location is good. Very close to many bars..restaurants...MTR... and perfect for Wanchai night life ! Breakfast at MH was fine. Good variety of foods. No complaints there . MH is perfect for a business trip....price reasonable... Not particularly suitable for families in my opinion. I am due to return to HK in a few weeks time and I shall be re booking MH for sure. No reason for me not to !", "title": "For all the mixed reviews ...I have to say ....I had a good stay !", "helpfulness": 4, "user": "TheGeez", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179652528}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I was travelling with a friend and had stayed in another hotel in Hong Kong prior to coming to the Metropark. I spent three nights here and noted the following pros and cons:", "title": "Good but not great", "user": "CDNgirl1230", "date": "September 29, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179098284}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Pros", "title": "Do NOT Disturb means Do NOT Disturb", "user": "BillM1964", "date": "September 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 178781913}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "- Great location: close to the MTR, tons of food and convenience stores nearby", "title": "Don't stay here", "helpfulness": 1, "user": "importerexporter", "date": "September 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 178372112}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "- Rooms are spacious by Hong Kong standards: my friend and I had enough space to open both our suitcases and still walk around the room", "title": "Great loction and service", "helpfulness": 1, "user": "Ben M", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177468989}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I have been to Hong Kong several times but this is my first time staying in a hotel in a very busy location as I usually prefer to stay in a hotel away from the hustle and bustle of a city life. Surprisingly my wife and I had a quiet stay in this hotel as if we are not in the center of a very busy place specially during the night. I emphasized during the night because the hotel is just right in the middle of the red light district of Wan Chai. So for those guys who love bar hopping and drinking 'til you drop this is the place for you.", "title": "A different experience in Hong Kong", "helpfulness": 2, "user": "Pasyalero", "date": "September 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177200600}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I read some reviewers complaining about the noise because of ongoing construction work around but it did not bothered us at all. We had sound sleep in all the 4 nights that we had in the hotel.", "title": "4 days 3 nights Wan Chai Hong Kong", "user": "Jcjman", "date": "September 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177060599}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "The best thing about this hotel is the location. It is very near to everything you need like food, convenience stores and transportation. The hotel is just about 3 minutes walk to the nearest MTR station and just on the other side of the road is a waiting spot for the Airport Express bus. My wife and I enjoyed going around all the popular destinations in Hong Kong using the MTR which is very convenient and efficient.", "title": "Tiny rooms!", "user": "anusuyajohn", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 175857210}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The staff of this hotel are not overly eager to serve but they are respectful and professional enough and they are composed of not only locals but they also have European staff.", "title": "Great staff and excellent service", "user": "VegasDWP", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175673290}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The room is good enough with comfortable bed, clean bathroom and a free WiFi with decent connection. The only negative thing about the hotel is their sign which is very hard to notice. It is very small and the facade does not look like a hotel. So it if it is your first time going here you might find it hard to find the hotel. The best way is take the Airport Express and take the bus link to the Empire Hotel in Wan Chai. Just opposite it is Metropark Hotel.", "title": "Great Location - Friendly staff", "user": "Craig S", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175644050}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 24, "average": 82, "very good": 292, "terrible": 6, "excellent": 152}, "aka": "Metropark Hotel Hong Kong", "slim_ranking": 0.164556962025, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Superbly located in the heart of Wanchai, one the Hong Kong's most popular shopping and business hub, making Metropark Hotel Wanchai becomes an ideal choice for both business and leisure travellers. The hotel is easily accessible to all major landmarks and transportation. 2 minutes walk to MTR Station and 10 minutes walk to Hong Kong Convention and Exhibition Center. Street nearby is a night life spot for all tourists patronizing pubs, bars and restaurants for drinking and dining pleasure. All guestrooms are fully equipped with LCD TV, Broadband Internet Access (Optical Fiber), Mini Bar, Electronic Safe Deposit Box, Hairdryer, Central Air-Conditioning, Telephone with IDD Access, Working Desk and more. Metropark Hotel Wanchai Hong Kong, A modern lifestyle hotel accommodation experience that is sure to please."}