{"user_rating": 4.5, "review_count": 433, "name": "Metro Hotel and Cafe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We booked here for the great price, and it was totally worth it! It's an adorable place, quaintly decorated. Also very clean and comfortable. The cafe wasn't open yet but we had free rein to use the fridge and coffee maker. There are also places to sit inside or outside, with games to play!", "title": "*Fantastic Deal*", "helpfulness": 1, "user": "NYCityGirl13", "date": "July 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3624223}, {"rating": 5.0, "title": "Perfect birthday trip from my husband!", "text": "You definitely need a car to get around, but there's a parking lot available.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3425965}, {"rating": 3.0, "stay_parameters": "Stayed April 2004", "text": "There's a bit of a small town to walk around down the road, and a few cute places to get breakfast, coffee, etc. Sonoma was a 10-20 minute drive away, depending on traffic. The only real negative would be the paper thin walls. There was the occasional noise of people walking by, but we were at the end of the hallway and it could've been much worse, I'm sure. Overall, a great place to stay if you'd rather spend your money on wine than your hotel.", "title": "Reasonable value for short term stays - 3.5 stars", "helpfulness": 4, "user": "lousygolfer", "date": "April 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 2.0}, "id": 3425720}, {"rating": 4.0, "title": "Read this first: The Metro is Fantastic for the price", "text": "My husband and I stayed at the Metro for four nights the first week of April to celebrate my birthday. From the moment we arrived we continued to be impressed and find new things we loved about the Metro. I was not surprised at all to find that the complaints I read about were completely untrue. This hotel may not be for everyone, but, it is for those looking for a touch of country charm. The Metro is so uniquely decorated with French country antiques and reproductions. Each room is different and the beds are incredibly comfortable. Unfortunately, we did not get to meet the owners because they were out of town. However, the guest manager was very helpful and all of his recomendations for food were right on. Sea, the Thai place next door, was incredible as was a family style Italian place in downtown Petaluma by the name of Volpi's. Basically the entire town was full of good food and the cafe at the Metro is predicted to be open in June. Now, to address the negatives I have read about. The rooms aren't huge, but, they are by no means small and keep in mind this is a very old hotel that has been totally redone by the current owners. You can hear a little more due to the hardwood floors, but, it didn't bother us one bit. We were in an upstairs room on the back that looked out on a few lemon trees out of all of the windows. If you are looking for a charming place that is not full of cookie cutter rooms with no personality then the Metro is the place for you. You can't beat the price I am sure, and, Petaluma is a wonderful town. We were able to go wine tasting in Sonoma and Napa counties and even make it out to the beach with great ease. My husband and I both would highly recommend a stay at this quaint hotel.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 10, 2005", "id": 3348746}, {"rating": 5.0, "title": "A Vision of France", "text": "My wife and I stayed here for three days last April and it was a mixed bag, but more positve than not. Depending on our length of stay, time of the year and budget, we mignt stay here again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 22, 2005", "id": 3294156}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "We stayed here Oct 8-9 and had a great stay. The room was very clean and the decor was great. The walls and doors are indeed thin, but the other guests in the inn were quiet. I'm not sure what other people mean when they say it looks nothing like the pictures on the website--it looks exactly like the pictures. There are pictures of Paris on the website--maybe that caused confusion?", "title": "Quite a nice find..", "helpfulness": 2, "user": "RunnerDude", "date": "October 19, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 2757783}, {"rating": 5.0, "title": "Great Hotel", "text": "There is a 10 minute walk to town, but it was an easy and definitely better than driving.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 15, 2004", "id": 2575668}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "I am writing from the Metro now on their free wifi while the baby naps and the husband makes a few work related phone calls before heading off to wine country. I read all the reviews on this place before making a decision to try it out for a night and we liked it so much we are staying a second night. Our drive in from San Francisco yesterday in the evening was lovely. We left just before 5pm and the traffic was not too bad, we were stuck a bit but we got up here in about an hour.", "title": "Metro - o la la", "helpfulness": 10, "user": "BrooklynMaMa", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4594439}, {"rating": 5.0, "title": "Charming, charming, charming", "text": "I'll start off with the good points. The room is great, the hotel charming and the staff has been very accomodating. We have experienced nothing like some of the reviews stated in the way of rudeness from the owners or staff. They called me back after I reserved on their website and I called because I had gotten a response but this was the day of so that was pretty good. They got a little pack and play ready for us for the baby to sleep in. We can see green and trees out our windows. The rooms all seem to be well done, I peaked in a few other then our own as the doors were open, the colors and decor are very nice and the bed does not sqeak. Our room has a lavender wash on the walls with blue doors and red curtains. The bath is white with a claw foot tub you can bath or shower in with a large old fashioned sink and mirror. We love this stlye of accomdation, each room is unique and not the standard feeling of so many hotels. They have done a great job of combining the old and the new. There is art on the walls in the hall ways, books to read, tables to sit at in the cafe where you can have whatever food you bring in. The French theme runs through out the rooms, hallways and common areas of the hotel. We also have a comfy blue chair, two wicker chairs, a little table, a closet, a chest of drawers and a little tv that we haven't watched yet but who give a darn about TV when you have free wifi and you're in Wine Country. A sweet Eiffel Tower lamp with a pink lamp shade, a misquito net over the bed and some ikea like over head lighting. The heat is dry air central heating and we have Quimper, Faienceries de Quimper HB- Henriot on the walls. We are certain we were the noisiest people in the hotel with the jetlagged baby crying in the night and waking up a 3am and 6am, we asked at morning coffee if any of the other guests were disturbed but they all said they didn't hear us so the walls couldn't be that thin.There is also a hair dryer but I never use a hair dryer except maybe to dry a bra or a pair of underwear on occasion. There is an iron & board as well but I don't have time in my life to iron, not with all this wine and scienic wonderland to soak up. There are wood floors through out and tiled baths which makes for a very clean open feeling. There is an interesting stairway just inside the entrance, which I spent a lot of time going up and down because our child is fixated on climbing stairs so for us this was a big plus. The hotel is very close to Sonoma, the coast and the wine, we are going to go out today and check things out. The price for this hotel is a big plus, very affordable.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 18, 2005", "id": 3912364}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "Here are the bad points, which are not really all that bad but need to mentioned for a balanced review and also I believe why the rates are lower than the average hotel/B & B in Northern California Wine Country. First, the Metro hotel is right on a busy road and you can hear the cars going by which is slightly annoying and not exactly the ambiance & outdoorsyness of wine country that I had imagined. Next, the cafe, what cafe? There is a menu on their website and I pictured my family having some nice cafe meals here but there is no service here. The tables exist and so does the cafe but the only thing served in coffee in the morning from 8:30 to 10am. They did let us keep baby food in the fridge. Also, the website is cute but it has pictures from paris and very few of the hotel. The hotel rooms, downstairs common area and little garden are well done and I don't understand why there are not more pictures of the hotel itself and pictures from Paris instead. They would do well to have more pictures of their fine lodgings.", "title": "European-style Hotel in Petaluma", "helpfulness": 6, "user": "Pyewacket60", "date": "September 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3910804}, {"rating": 5.0, "title": "Loved it!", "text": "Last night we picked up some snacks at Whole foods along with some wine & cheese we picked up during the day plus a Pad Thai from the local Basil Thai joint and we had a picnic party in the cafe at the hotel. It was grand and it did remind me of my stays in Paris where we would do the same thing.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 13, 2005", "id": 3898115}, {"rating": 2.0, "title": "Metro woes", "text": "What a treat to stumble upon this charming hotel. The French atmosphere, furnishings and every detail made for a wonderful experience. The owners are very friendly and helpful. The rooms are comfortable and inviting. We were totally enthralled with the cafe, sitting rooms and all of the French details....even French music on the piano. The attention to detail certainly adds to the charm of this little slice of France. We couldn't have asked for a more perfect ending to an already perfect weekend. We can't wait to come back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 8, 2005", "id": 3888729}, {"rating": 4.0, "title": "WONDERFUL NEW HOTEL IN PETALUMA", "text": "As a world traveller I was pleasantly surprised to stumble upon a little slice of European Elegance in Petaluma. The rooms are a welcome 180 degree change from the horrible, stuffy, usually dirty standard rooms that populate the American landscape like a scourge. Clean, clever, and within easy and pleasant walking distance to all of Petaluma's many attractions. This is in the true (and to me much preferred) style of an European Pensione, NOT a typical American B & B by a longshot. Expect to have your needs met if possible, do not expect (or need I hope!) a personal babysitter. These Innkeepers (thank GOD!) treat all guests as adults. I recommend this place to anyone I know who might either be coming to Petaluma or having family to visit. I look forward to seeing this place grow and prosper! Thank you Art and Marie for all of your help!!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3247559}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We stayed at the Metro because we didn't want to drive back to S.F. after a show at the funky-cool Mystic Theater. I picked the Metro from the recommendations here, and we were very, very pleased. The hotel is a little slice of Europe in Petaluma -- reclaimed treasures in the public areas, comfortable rooms with good mattress and bedding, claw-foot tubs, high quality soaps, helpful but unobtrusive staff. An excellent value.", "title": "Lovely", "helpfulness": 3, "user": "MissInform", "date": "February 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3165819}, {"rating": 2.0, "title": "Charming, but few amenities for a comfortable stay", "text": "We wanted to stay here because from the way it sounded, it would be unusual, tasteful and with a European sensibility. While it was all that, there was much lacking. In the rooms, there's very little hanging space for your clothes (a rack with pegs mounted to the wall stretched my sweater), no dresser, no phone, no luggage stand, one nightstand and two uncomfortable (but stylish) chairs. We ended up bringing in a small table and chairs from outside the room to place our things on. Same sorts of problems in the bathroom. The bed was great and they sell the beds (huh?). There are lots of interesting French flea market finds on the premises. But the owners don't seem to want to mix with the common folk, so other than showing you your room, they're pretty much holed up in the back. The cafe is not open and doesn't look like it's gonna be for a while - so why are they advertising it?", "helpfulness": 4, "user": "paintcloth", "date": "October 24, 2004", "id": 2782315}, {"rating": 5.0, "title": "Old World Charm and Work Ethic at The Metro Hotel", "text": "I have had the pleasure of recommending and staying at the Metro Hotel. My husband and I have enjoyed the privacy and ambience of the Metro. At the Metro they pay attention to the smallest of details the soap (gave extra to take home-score), the towels were soft, the sheets were freshly ironed, and the room was very clean and brightly decorated. The Metro Hotel has added some old world charm to an old town that is in its revamping phase. It is a pearl in this little country town, 20 mins. from the Duron Beach, 25 mins to Sonoma, or 40 mins. to Napa, and 45 mins. from our beloved San Francisco. The owners Arthur & Marie are very talented in hospitality and have given us a special getaway. Merci Beaucoup!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 22, 2004", "id": 2779691}, {"rating": 5.0, "title": "Wonderful!", "text": "I travel often for business and Metro Hotel was recommend to me by my aunt who lives in Petaluma. I have to say that my stay there was WONDERFUL. After being in such big chain hotels were you are anonymous, it's nice to visit a place where they know your name. The hotel was clean and the staff was so helpful. The owners Art and Marie are always on hand and can help with many questions and give advice about the surrounding areas in Petaluma. You can stay in Napa for more than triple the price, but why would you when you can stay at the Metro and have that at home feeling without really being home. Can't wait to go back.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 20, 2004", "id": 2760155}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 16, "average": 31, "very good": 127, "terrible": 18, "excellent": 241}, "aka": "Metro Hotel Petaluma", "slim_ranking": 0.142857142857, "description": "French European charm, Located in Sonoma County Wine Country, Only non smoking rooms."}