{"user_rating": 4.0, "review_count": 5114, "name": "MGM Grand Hotel and Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We stayed at the MGM Grand Hotel and Casino in Las Vegas October 5th - 10th, 2013. We had a King suite. Room was very, very nice! Very large! We had a view of the strip, kinda. It wasn't bad. The bed was so comfy! The thing I loved the most was that there are automated shades. Two different types. One lets light in, and I suppose keeps eyes out! The other is a black-out shade, and let me tell you, it is DARK!!! when it is down! We were in town for the International Baking Expo. Most mornings we had to be up early. But on Wed. we could sleep in, and we didn't awake till 9:40! Both of us thought it was still night time! LOL", "title": "Wonderful stay at the MGM!", "user": "Isabell1960", "date": "October 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180873428}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had two problems while staying at this hotel. The first night, Saturday, the TV would not work. I was so tired from the long flight, I didn't really care. All we would get was a big red X on the screen, no matter what I tried! The next morning I called the front desk and after breakfast I was fixed when we returned! Fast service! On Tuesday after a long day of being away from our hotel the whole day, when we returned our room had not been cleaned, and no fresh towels or bed made! I called housekeeping, but no one answered. I then called the front desk and she was very polite and apologetic about it. Within 1/2 an hour we had fresh towels. The man delivering them again apologized, and asked if I wanted him to clean the room. I said no, just the clean towels was good enough. He did take the dirty ones on the floor. The next day all was well again, bed made, fresh towels, etc. Just a glitch, but was taken care of right away.", "title": "Rennovated rooms very nice", "user": "3wilddogs", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180857802}, {"rating": 5.0, "title": "An excellent stay!", "text": "Our room was a comp, so I have nothing to complain about as far as the above service. Both my husband and I found the slots to be pretty loose, not like a few other casino's we visited while in Vegas. Both of us won, and became Gold Card Holders. (More perks coming our way!) We had breakfast at the Rainforest Cafe one morning, and it was very good! There is a little cake/cup cake shop just off our elevator and the cakes, though expensive, are to die for!!", "user": "4given316", "date": "October 13, 2013", "id": 180836268}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "We also took my parents and uncles to see David Copperfield. I highly recommend this show! OMG It was amazing! (My parents were there with us, but in another hotel and my uncles live there) My uncles had never been to his show either and they loved it! I still scratch me head trying to figure out how he did some of his illusions!", "title": "Great location and iconic!", "user": "bassey78", "date": "October 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180830818}, {"rating": 5.0, "title": "great time", "text": "We also went to see Cirque du Soleil Beatles Love. We have seen Ka at MGM in the past. I loved Ka, but now Love is my favorite! You really have to see it again as there is so much going on in the air and on the stage at once! Just a fabulous show with such talented acrobates! A must see if in Vegas!", "user": "A TripAdvisor user", "date": "October 13, 2013", "id": 180804296}, {"rating": 4.0, "title": "Mad mad mad Vegas", "text": "Just returned from seven nights in mad Vegas,what a place,24/7 city never stops,hustle,bustle day and night,you have to go there to explain what it's actually like.Went with Thomas Cook and stayed at the MGM Grand,5,000 plus rooms,massive place,casino was buzzing day and night,the Yanks love the crap tables and when they win you certainly know about it!!!!From Starbucks to top restaurants the hotel had it,bars,shops everything,used the Buffet diner once and that was ok but rushed as we left it a bit late to eat,but best buffet we had was when we went to Hotel Rio for Rat Pack show which was a recommend to see show,go and see it and dine there.", "helpfulness": 2, "user": "Michael J", "date": "October 13, 2013", "id": 180796531}, {"rating": 4.0, "title": "Good but see the show", "text": "We were on a high floor at MGM 25th floor and views along strip were great,helicopters flying over every couple of minutes,good to watch.Walk for miles along the strip visiting the hotels they are all massive,every one a different theme hotel,Caesars was my fave and the wife loved the Bellagio with its floodlit water fountain display.", "user": "john a", "date": "October 13, 2013", "id": 180794332}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Went up to downtown Freemont Street wanted to visit Mob Museum,got there on Friday evening,it was manic!!!!!First Friday in each month is locals night and to cap it all it was the Vegas 2013 bikerfest,hundreds of Harley Davidsons all over the place,great spectacle but noisy!!!got bus back to the strip and went back Sat.morning,visited Mob Museum and enjoyed it,if you like to find out the history of the mobs involvement it's a must see well worth the money.", "title": "MGM Grand room was nice", "user": "Sally J", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180748713}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Went on full day trip to LA and Hollywood,with Thomas Cook,it was a great day out,a long day,picked up at 6 in morning and arrived back at 9,shattered when we got back but worth it,Santa Monica beach,the official end of Route 66,then Rodeo Drive,Chinese theatre,seeing properties owned by the stars,the minibus firm Thomas Cook use were excellent and tour guide Tabetha was very informative and good at her job.", "title": "Another great stay at MGM Grand", "user": "kshusband", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180742120}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "One moan regarding Vegas is when looking for somewhere to eat,there is no middle ground to eat,it's either fast food or expensive dining but the likes of Fatburgers compensate as their burgers are as they say best on strip!!!!Dennys great for breakfast and the likes of Subway,Wendy's ok for lunch.Best bar we found,especially for a cold pint of Guinness was in the Luxor,the Irish bar Ri Ra,the food is also superb,try the Fish and Chips,best I've had,that's a must have if you go there.", "title": "Could be your home in Vegas.", "user": "makany", "date": "October 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180736312}, {"rating": 3.0, "stay_parameters": "Stayed October 2013", "text": "At one end of the strip & such a large hotel service is sacrificed. Long queues to check in & out. Long narrow corridors with low ceilings. Rooms dark but clean. Good comfy beds. Good selection of pools. Booked our stay here 10 months prior, requesting connecting or adjoining rooms for ourselves & our daughters. Despite this the hotel would only offer this if we upgraded by paying an additional $20 per room per night. When pressed what the difference would be the clerk admitted the room was slightly larger & newer. We opted for the original booking with rooms on the same corridor. Incidentally the Sheraton universal in LA upgraded us to interconnecting with no quibble - take note MGM! If visiting Las Vegas again I would book a hotel in the middle of the strip rather than one end, and hope their service is superior.", "title": "Ok hotel", "helpfulness": 2, "user": "racham08", "date": "October 12, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 180725390}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "MGM is a great casino but a word of caution about rooms in the West Wing. If you get a standard King (formerly Petite King) in the West Wing, you will not get a true private bathroom. By that I mean a private door leading to private bathroom facilities. The bathroom area consist of an open sink just outside the main entry and then separate doors for both the toilet and shower. When you exit the shower or toilet,you are literally standing in an open space in front of the entry door. This may be difficult to conceptualize but the bottom line is that if you need bathroom privacy, this is not the room to book.", "title": "West Wing", "helpfulness": 2, "user": "Howard M", "date": "October 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 180724377}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "From the moment we checked in until we checked out we had a fantastic stay, we visited many other casinos on the strip but always came back here, we stayed in a petite king, which was beautiful and very well equipped and clean. The drinks waitresses were ever so friendly. Food court is good in the early hrs when u need some beer soakage and the salon, pools and shopping is next to none. This place is just huge and would be easily lost u would never have to leave the place!! Thanks MGM we will be back.", "title": "Best holel in Vegas", "helpfulness": 2, "user": "Lainey862", "date": "October 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180713935}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My wife and I stayed at the hotel at the end of a 'fly drive' tour of Vegas and the surrounding canyons. The check in was a bit lengthy as it appeared a plane load had arrived but we were not over bothered and found it acceptable. The receptionist was polite and welcoming and we quickly found our room. The room was clean and more than suitable for our two night stay. The remote control for the TV was missing but was quickly resolved by housekeeping. We ate dinner at the Wolfgang Puck Bar and Grill and were impressed with the range and good value of the menu, service was very good as well. In the mornings we found the Starbucks by the centrifuge and it was more than acceptable.", "title": "Good stay but poor customer service when checking out", "helpfulness": 2, "user": "Steve-Marilyn", "date": "October 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180690421}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Hotel is not in the middle or the centre of the strip but as the monorail starts from there access to all of the strip up to the Stratosphere Tower was not a problem. Plenty of eating areas within the hotel and a very busy Rainforest store and eating area. Casino area was as expected BUT you could smell the smoke more than other casinos that we had walked through.", "title": "Very good stay", "helpfulness": 1, "user": "mcarr88", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 180679768}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "What a brilliant hotel.", "title": "Fantastic!", "user": "jessicacotton2", "date": "October 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180670881}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "On arrival I asked for a high floor, the lovely guy sorted us with room 18423 high floor strip view on Mandalay bay, Excalibur and tropicana so I tipped him $20 for his hell. Got to room it was a grand tower King room which was spacious with a huge bed and great view. Went out and came back tha night to a complimentary bottle of champagne chilling on ice courtesy of the front desk, really nice touch!", "title": "Great Stay", "user": "litllemermaid", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180640984}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Would definitely stay hear again loved it!", "title": "Beware the 1st floor", "user": "Brian R", "date": "October 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 180636786}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "After trying to make a decision on where to stay for my first trip to Vegas we finally settled on The MGM Grand as slightly cheaper than a few of the others and therefore upgraded to an executive suite. First impressions of the hotel were great. There was a long queue for check in but it seemed to go fairly quickly. We had a lot of luggage so used the valet parking at the back of the hotel which helped a lot as we didn't have to lift a finger. The suite was lovely with a nice big sofa with flat screen tv area and then our two queen beds we booked being father and daughter, and another flat screen tv. The bathroom was large with his and hers sinks, shower and then a bath with another shower over. Unfortunately there was no fridge and if you had your own drinks the only option was one at a time in an ice bucket. The prices for drinks and food in the mini bar were extremely high. We sunbathed by the pool one day which was a lovely area with a great lazy river. Again, the drinks were pricey, but it is the strip so I guess expected. We ate in the Rainforest Cafe one evening in the hotel and this was really good. Great food with great service and atmosphere. The hotel is in a good location being on the strip but more towards one end. The Bellagio and Ceasers Palace are more central but there is a monorail and buses to go up and down the strip. The main hotel gift shop was good and the prices reasonable compared to some of the other hotels. Some lovely well priced jewellery too! Our room was cleaned every day and if you wanted the maids to come back later they were more than happy too. The check out was great using the express check out and therefore filling in a form and posting it in the box on your way out. Overall a nice stay and I have fallen in love with Vegas!", "title": "Amazing room, poor service.", "helpfulness": 1, "user": "GF2183", "date": "October 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180636264}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "During a recent stay, the staff at check-in was kind enough to offer me a \"better\" room in the West Tower 1st floor. Maybe it was my platinum mLife status that got me the privilege. Note that these rooms back up to service entrance so you do not need to worry about a wake-up call. At 4AM, you can enjoy the symphony of the employee shift-change (30-40 people congregating outside your window) and also that is when they deliver the food and clear the trash. Oh, and yes they have roaches.", "title": "Beautiful property great service", "user": "Monica Z", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180635746}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 192, "average": 619, "very good": 1716, "terrible": 118, "excellent": 2469}, "aka": "Mgm Grand Las Vegas", "slim_ranking": 0.118518518519, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}