{"user_rating": 3.5, "review_count": 52, "name": "Midtnes Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We toured Norway under our own steam and spent 6 nights here and got just what we wanted - peaceful surroundings, friendly and efficient service, a spacious and comfortable room and excellent breakfasts. The only drawback was the evening meals - no choice and a very limited repertoire of dishes, although copious in quantity. Some guests went elsewhere for evening meals and I'd suggest to intending visitors to do likewise. The hotel meets express boats from Flam or Bergen.", "title": "Peace and quiet and amazing views", "helpfulness": 1, "user": "oolite", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115765058}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We arrived in Balestrand on the express boat from Flam and our host, Mr Jon, was waiting on the quayside to transport us and our luggage the short distance to the Midtnes Hotel. Laura, the receptionist, welcomed us and directed us to our room. What a view when we opened the door! The Sognefjord, with its surrounding snow topped peaks, looked wonderful. There was a private balcony with table and chairs where we could enjoy the views when the weather was warm enough to sit out.", "title": "Fantastic View and Great Hospitality", "user": "floydTintagel", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 113529192}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "There were also lounges downstairs to sit, either to enjoy the views or to watch TV. There were also outside areas to sit but, as the weather wasn't that warm, we didn't use these. It was great to be able to adjust the heating in our room though and sit in the window each evening. There were even porpoises playing in the fjord that we were able to watch from our room.", "title": "Quaint, but what a view !", "user": "UkStykindemud", "date": "June 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 111191246}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The dining room was on a lower level but with the same view and breakfast consisted of a selection of cold and hot options. Plenty of choice for most nationalities. Service from Laura (again) and the other girls was very good.", "title": "Lovely", "helpfulness": 1, "user": "HaveCasesWillTravel", "date": "May 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109329059}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had opted for the half board option and dinner was served at 7pm. There was no choice but we enjoyed a very acceptable 3 course meal followed by coffee which was served in the lounge. We noticed that people with intolerance to certain foods were offered alternatives and I'm sure if the hotel knew in advance they would have catered for special diets without having to suddenly come up with an alternative.", "title": "Affordable Hotel in the Fjords!", "helpfulness": 2, "user": "TandD26", "date": "May 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 107897583}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We loved this little town. Small but some nice shops and restaurants. off the beaten path which is just what we were looking . Help was very friendly. Breakfast was one of the best we had. Went looking for a laundry in town. Not handy and very slow.", "title": "Norway", "helpfulness": 2, "user": "Glenn M", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120766257}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room had a very strange smell, We had to sleep with the balconydoor open all night. Perfect view. Very nice breakfast! The lounge was very cozy.", "title": "Very simple rooms", "helpfulness": 4, "user": "oeeneesch", "date": "August 13, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 116676730}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I was impressed with the Midtnes Hotel. While the rooms are very simple - no TV, no coffee, no mini fridge, no safe - they are clean and the beds are comfortable. We were lucky enough to have a balcony with chairs and a breath-taking view. The breakfast was good and well-stocked with great coffee. We also had a dinner here, which was affordable (compared to other places) and had good portions. I would recommend having a dinner here if you're in town for more than one night. Now what really makes this hotel great are the little quirks - go sit in the parlors and look at the wonderful antiques. Play games in the beautiful rooms. Have after dinner tea. Even better, enjoy the dock area they have next to the fjord. Have your grocery-store-picnic lunch right on the water! I would highly recommend this place. Jon, the probably-owner and front-desk man was great and helpful.", "title": "Quirky, nice, and simple", "user": "thesspayne", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116333507}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel was one of the worst I have ever stayed in! First of all, you do not stay in the nice building you see in most of the pictures, but in a shabby old building on the back side. The rooms are old and strongly smell of carpet glue. Even with the window open all night, the smell did not disappear. The bathroom was very \"functional\" and all in dark brown. Clean but nothing else. The breakfast offered some variety. However, the variety was\"outweighed\" by its poor quality. Instead of fresh fruit they had defroozen berries ...", "title": "Never again!!!", "helpfulness": 3, "user": "NorwayTraveller2011", "date": "August 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116204448}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Jon the manager/owner was a lovely guy, was much more helpful that the lady at the tourist information. Gave good suggestions about hiring a car from Kviknes hotel, where to drive and boat times etc...", "title": "Great Host, lovely hotel", "helpfulness": 1, "user": "anotherjason", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115861826}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed here for 3 days / 2 nights and had a wonderful time. Balestrand is a sleepy, charming little town in a heart-stoppingly beautiful landscape. So calm and peaceful, so relaxing. We took a decent length day hike up in the mountains (picked up a simple trail map at the tourist office and got some basic advice from the guy there) which was one of the highlights of our trip through the fjords - just lovely. Many of the hiking trails start from the elementary school up in the hills above the town - was quite something to see the kids having recess, exploring in the woods unsupervised, the kind of thing that's long disappeared at home.", "title": "Simple, pleasant hotel in gorgeous setting", "helpfulness": 1, "user": "Dom-and-Irina", "date": "March 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 101749229}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Anyway, so back to the hotel. The manager, Jon, is friendly, and it's worth asking for advice - he pointed out a place to stop on our drive up to Geiranger that we would have blasted right past otherwise, where you can walk out on a steel bridge over a fast-moving creek. The common areas are in a charming, old house with antiques and family mementoes lying about. The views from all around are just stunning.", "title": "When in Balestrand- stay here!", "user": "HojasRojas", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 81765629}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The rooms are in a modern addition to the home, and as others have described, they are pretty sterile. This is where they could have improved things - a little Scandinavian design sense could have rendered the modern part a lot more attractive while still being minimalist and simple. It's worth getting the fjord side room with a balcony so that you look at the stunning landscape instead of the non-stunning room.", "title": "Friendly, fab location and worth staying a few days", "helpfulness": 2, "user": "thesecondal", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 75176923}, {"rating": 3.0, "stay_parameters": "Stayed July 2010", "text": "We opted for the breakfast + dinner meal plan - I think it's a good thing to do, because the food is good, and there seemed to be few to no restaurants around in town. However, if you're picky, it's not a menu system; dinner is whatever dinner is. Basic, good homestyle cooking. May depend on who is cooking - for us, a young Baltic woman (who lives nearby - her daughter along with another girl staying at the hotel provided our daughter with some much-needed non-adult company for a few days) was cooking, and her food was simple but tasty.", "title": "Would do a lot better after redecoration", "helpfulness": 1, "user": "fussel2010", "date": "August 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 75069984}, {"rating": 4.0, "title": "Quiet little town surrounded by gorgeous views", "text": "We would stay here again - I sure hope we make it back to this part of Norway.", "helpfulness": 3, "user": "travlingigi", "date": "July 16, 2010", "id": 71180915}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This hotel is as far away from mass tourism as you can get. We stayed two nights at Midtnes with our children (aged 4 and 5), and we loved it. The rooms are spartan, and the hotel old, but if you like authentic old world atmosphere, this is the place to stay by the Sognefjord. Great view of the fjord!", "title": "Cosy, with great view!", "user": "ynges", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150254961}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "If you are planning to go there, keep in mind that the place is not a 5 star, however if you are in Balestrand it is enough.", "title": "Simple place, nice view", "helpfulness": 2, "user": "regis f", "date": "November 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 145225052}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The rooms are spartan and the bathroom is very small.", "title": "hostel of a very low standard", "helpfulness": 4, "user": "Alexander S", "date": "August 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 136873158}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The owner is nor very friendly but can give the main tips in the village.", "title": "Hotel visit part of an Inghams multi centre holiday", "helpfulness": 2, "user": "PattiReading", "date": "August 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 136708755}, {"rating": 3.0, "title": "Fantastic views...", "text": "Breakfast has a good quality and variety.", "helpfulness": 1, "user": "philosIsleofMan", "date": "July 6, 2012", "id": 133606975}], "location": {"country": "Norway", "region": "Western Norway", "continent": "Europe"}, "variance": {"poor": 5, "average": 11, "very good": 26, "terrible": 2, "excellent": 8}, "aka": "Midtnes Hotel Balestrand", "slim_ranking": 0.75}