{"user_rating": 4.5, "review_count": 1507, "name": "MileNorth, A Chicago Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Usually when reviews are \"all over the place\" (from outstanding to terrible,) I wonder about a place. So, when I booked a room for a long weekend in Chicago through PriceLine and it turned out to be the MileNorth Hotel, I had a bit of trepidation. I was hoping for the best upon my arrival, only to find that the hotel is just down the street from Neiman-Marcus, Saks Fifth Avenue, Tiffany and around the corner from Water Tower Place and the Park Hyatt. Hello? Location, location, location. That said, there was construction going on in the lobby. They were reconfiguring the space and there was no lobby or restaurant, as a result. (Only a temporary dining room on the 2nd floor.) I was greeted warmly and graciously by the front desk man, given a lovely room on the 24th floor, facing north. No view, except for other office towers, but it was quiet and serene, which is what I had requested. My queen bedded room was large (for Chicago,) and the bathroom was a good size, too. The room was beautifully furnished, very comfortable and best of all, the bed was heaven! Lots of fluffy towels in the bathroom and a Speakman shower. No bathrobe or slippers, but at these prices, who cares?!? The closet had a big safe, iron, ironing board and lots of real wood hangars. Staff could not have been nicer or more helpful. While this hotel is not in the same league as The Peninsula, Waldorf-Astoria or Park Hyatt, you're not paying close to $ 400 a night either! Value for money, the MileNorth rocks!", "title": "Incredible Location, Great Value", "helpfulness": 1, "user": "David49b", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150624732}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Sorry but the pictures and reviews are trash on their web site. We spend one night in the hotel and this will be the last one ever. The pictures are obviously touched up or at least 10 years old. The room is tiny and descriptions are terrible. A two floor room.. you mean a one floor room with two steps.. Really? Paint peeling, bed is weird and uncomfortable. We requested toothpaste in the morning and waited 45 minutes until somebody got us a toothbrush! Really? Come on! We had to ask the person who brought it up to get us toothpaste, who finally got it.", "title": "The MileNorth, a terrible hotel", "helpfulness": 2, "user": "A C", "date": "January 21, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 150201986}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Anyway, this hotel is really an old, run down building with fairly OK service. Only descent thing is the location right off Michigan ave. Best advice is to go somewhere else.", "title": "Well Up to Standard", "helpfulness": 1, "user": "Bonetti", "date": "January 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149670521}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Recommended . A luxurious and spacious two-level room in a good location close to the John Hancock Tower and various good bars and restaurants. Only disappointment was that there were no prices displayed for the mini-bar.", "title": "2 Maids a Knocking", "user": "QZEE1", "date": "January 14, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "value": 3.0}, "id": 149652318}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I purchased my one night stay from Living Social. I then wanted to extend my stay and added another night. Because of booking this way, I was instructed that I had to check out & check back in on my 2nd day. They must not communicate well, as we were sound asleep @ 9:00 am as our maid was A-Knockin! It then happened again the next morning!! Steve the manager was helpful, but as there are so many hotels to stay at in Chicago....we certainly will NOT be going back to this one.", "title": "great experience!", "user": "jessy2811", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149471465}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Actually, I was under the weather and it was more like a whimper. Husband and I like to do a weekend in the city every now & then. Found a Groupon for MN hotel. Absolutely FANTASTIC location (just off Michigan at Superior). Cute room. Nice amenities. Would have liked a lighted make-up mirror (or better lighting in the bathroom) and a blow dryer. We experienced a tiny elevator snafu but nothing terrible. Cute restaurant in the lobby - we only had breakfast. The price was right for this fantastic location and I would definitely stay here again. We like to try different spots so next year wherever we get the best deal. I would not hesitate to recommend this hotel.", "title": "Suburbanite storms the city ...", "user": "Faith653", "date": "January 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149362617}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed three nights over New Year's 2013. The location is a block from the Magnificent Mile and all the shops, theatre and great restaurants are all within easy walking distance. The staff were exceptional and aimed to pleased. The rooms was spacious and the bed was very comfortable. We appreciated the fact that the hotel manager Steve promptly addressed our noise complaint about the family with the screaming kids located right next store. They offered to move us which was really nice but instead the parents got the kids under control which was fine too.The restaurant was a little disappointing. The breakfast buffet was minimal and closed down too early and the full time bartender needs some happy lessons. Although the price was good, the parking price was outrageous. 52 dollars per 24 hours but we found out that was actually a decent price for Chicago. But overall our stay was very memorable and we would happily", "title": "Fab Location at Great Price", "user": "TracyFergus", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148796046}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A wonderful boutique hotel experience in the heart of downtown Chicago. MileNorth features a great restaurant and a welcoming staff. Our bi-level room felt spacious and provided beautiful views of the city.", "title": "Fabulous views and exceptional accommodations for a reasonable rate in the heart of Chicago.", "user": "TomHayes710", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148716904}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed 12/13 - 12/16 with Priceline rate. As others have said, the location was perfect, a block from Michigan, 2 blocks from L and Rush Street. The staff was very nice. I had heard the noise complaints and asked for a room high up and were put on the 20th floor. We could still hear sirens (especially during the day) from the hospital next door, but minimal noise from the neighbors on our floor. We were in a corner room, and had no complaints about the room itself. We did not eat in restaurant, it looked good but expensive. We did go to the small rooftop bar, which was very nice, but the $9 beer was a little more than was in our budget. Overall a good experience.", "title": "Good Location and nice room", "helpfulness": 1, "user": "pjsltk", "date": "January 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148630979}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed overnight for our anniversary, and when we mentioned this to the desk manager, he upgraded our room to a king suite! Fantastic room, quiet, luxurious, beautifully appointed and modern. We had a great time.", "title": "Fantastic place!", "user": "coconutfan", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148563980}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The location is GREAT! Walking distance within everything (that is if you dont mind walking 2 miles in some cases and its not winter!)...that is probably the best part about the hotel, but there are also several million more hotels in the same general location....", "title": "Great Location!", "user": "Jennifer V", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148540407}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our stay was fine, no problems- staff were fine, room was fine, just nothing was outright fantastic to review about...all marks satisfactory. Yes the window did leak severely, but they are improving the building, so they know about it and its in the works-cant write badly about something they are working on fixing! (read a lot of reviews criticizing this)", "title": "Unpleasant Experience", "helpfulness": 2, "user": "Rain G", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 148512007}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Parking is ridiculous...we got a fantastic rate on priceline.com and nearly paid as much as we did in parking fees as we did for our weekend stay. I did read in another review parking is $5 cheaper in the garage across the street for the hospital, but you do not have in and out privileges so it will be actually more expensive if you take your car somewhere and come back to park it because anything over like 4 hours is a flat rate of $47 and the rates below 4 hours are astronomical anyways, so if you do stay, cough up the extra $5 and use the hotel's valet parking!", "title": "Great hotel , friendly staff and perfect location!!", "user": "Suzy H", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148452504}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "No pool and no complimentary breakfast to review", "title": "Price, Staff and Location provided for a very nice stay", "user": "patmanny", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148382536}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I like the location and decoration. But the room condition was pretty poor. It was really noisy during night, you can hear all kind of noise like fans, toilet flushing from next door, people talking in front of the elevator...and the tap was leaking. I could not sleep at all. The room supposed to be new, however it lost several spots of paint. It looked very cheap.", "title": "Very nice room, friendly staff", "user": "KibbleGR", "date": "December 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 148299057}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This was our first time to Chicago and I did my research as to where to stay well in advance. The magnificent mile is the perfect location! This hotel is modern and clean and is literally steps off the mag mile. There's tonnes of plus' like having the Cheesecake Factory, Giordanos and a Walgreens all within walking distance. Chicago is a pretty small city it seems cause we were able to walk just about everywhere, including the Navy Pier and Millenium park. I would definitely recommend staying here and look forward to going back again very soon.", "title": "Location was perfect!", "user": "Travel_Chica079", "date": "February 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151625444}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The only negative was the hospital being nearby....you hear abulances all the time, but you get used to it after a day and we were never in our room anyways.", "title": "Close to the Action but Quietly Sophisticated", "user": "wadd003", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151428010}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Conveniently located next to Neiman Marcus in the bustling area known as the Magnificent Mile, it felt like a secret oasis. We could escape the hustle and bustle but with a few steps rejoin the action. Sophisticated decor in a truly \"snazzy\" room... interior designer went wild and it was a delight to experience. Fantastic view of the Hancock Building and all for less than expected or as compared to other hotels located nearby. Parking garage just across the street, use that instead of valet and save major bucks. Breakfast can be purchased in the lobby restaurant and all items were delicious. NOTE: very, very slow elevators so be ready to wait to ride up or down.", "title": "Just off Michigan Avenue", "helpfulness": 1, "user": "kebrews", "date": "January 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150860904}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Favorite find, the gummy bears are worth the $5-6 mini bar price because they come in a glass gummy bear shaped jar! Sweet!", "title": "Boutique hotel in a great location!", "user": "Mrtsadventure", "date": "January 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150699017}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Great find, will stay here again.", "title": "Great location, great value", "user": "Annailish", "date": "January 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150685550}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 46, "average": 135, "very good": 493, "terrible": 32, "excellent": 801}, "aka": "Affinia Chicago Hotel", "slim_ranking": 0.240963855422, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 5.0}, "description": "MileNorth combines the sophistication and style of an urban Chicago hotel with the comfort of a Midwestern retreat. MileNorth puts guests in the middle of the best that Chicago has to offer. Just steps away from the famous shopping of the Magnificent Mile. An easy walk takes you to the theatre district, the lake, Navy Pier, Wrigley Building or Tribune Tower. The 213 contemporary rooms and suites offer plenty of room to relax and kick back. Dine at our own C-House restaurant with an exceptional contemporary menu or explore the many dining options right outside our door. Enjoy the incredible views of our indoor and outdoor Chicago rooftop bar and lounge, the C-View."}