{"user_rating": 4.0, "review_count": 348, "name": "Milford Sound Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is pretty much the only place you can stay so close to Milford Sound. While that's a great selling point for accommodation, the lodge does not live anywhere near up to it's potential.", "title": "Needs improvement", "user": "schloo", "date": "May 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 159483108}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We stayed at a powered site - totally fine as a site, but the area is quite poorly lit. Considering there's no other light pollution in the area, it's quite hard not to trip over the various boulders marking out parking areas when it's fully dark - relying on just the lights from the lodge is not enough.", "title": "Great atmosphere", "user": "Joanna K", "date": "April 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158972120}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The kitchen and dining rooms were both not of adequate size for the volume of people staying at the lodge - considering I was here in Autumn, it must be total chaos in summer. The kitchen is a madhouse at mealtimes, and although it was the best equipped kitchen I'd used in my travels in NZ, some of it could do with updating. It's hard to drain pasta in boiling water when it feels like the pan handle is going to fall off any minute. Another issue in the kitchen is children. Since the kitchen is separate from dining room, there's no need for them to be in there. The kitchen itself is is small and crowded, and having two seven year olds chase each other round the place while people are trying to cook is a hazard not only to themselves, but to everyone else there. I don't know if there is a no children in kitchen rule, if there is, it isn't enforced. If there isn't, the management could certainly consider one.", "title": "Riverside Chalets", "helpfulness": 1, "user": "Carole J", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 158891135}, {"rating": 3.0, "title": "Bring some earplugs", "text": "The bathrooms weren't particularly clean, lots of draining water to step over in the mornings, but free hot showers and hairdryers is a welcome bonus.", "user": "Brendon B", "date": "April 25, 2013", "id": 158729150}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Staff were friendly and helpful at all times, though sometimes it seemed they were rushed off their feet going back and forth from the cafe and reception.", "title": "typical backpackers", "user": "livingdolldisaster", "date": "April 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 158640574}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The lodge itself was fine, facilities were good and rooms clean. The problem we had was that whilst we were out on Milford Sound, the cleaners left our room door propped wide open (all our belongings were in there). Staff were apologetic and said they would investigate but we didn't hear anything else from them.", "title": "Milford Sound Lodge", "user": "Sueonhols_13", "date": "April 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 157987434}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed overnight in one of the four chalets that are part of the Milford Lodge. If you don't want to stay in a dorm / backpacker setting, and you want to stay in Milford, then this is really your only option. Staying overnight in Milford was a great experience. You get to be in Milford at night and experience the quiet, serene setting and the beautiful sunrise (and the sandflies .. watch out!!). This also enabled us to catch the very early Morning Glory kayaking trip with Rosco's Milford Kayaks, which I highly recommend! (& review separately)", "title": "Nice chalets, highly recommend staying overnight at Milford!", "user": "furf88", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 157822568}, {"rating": 5.0, "title": "You've got to stay in the cottages!", "text": "Here are some pros and cons with staying in the chalets at Milford Lodge:", "user": "newnztraveller", "date": "April 12, 2013", "id": 157560173}, {"rating": 5.0, "title": "Best (In fact, Only) Place to Stay in Milford Sound!", "text": "Pros:", "user": "Traveler4230", "date": "April 9, 2013", "id": 157261579}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "- The chalets are brand new and very, very nice. Comfortable beds, and nicely decorated and furnished rooms.", "title": "For Backpackers", "user": "theoatybear", "date": "April 8, 2013", "detail_rating": {"sleep": 2.0, "rooms": 2.0}, "id": 157096914}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Only stayed here one night but it truly was the highlight of our trip to New Zealand. The riverside chalets are beautiful with a most comfortable bed. Kitchen well equipped, chalet beautifully furnished. As kitchen had no hob (but everything else) I went to main block kitchen to cook my pasta! This made the evening even more enjoyable as you mix in with all the other guests, from around the world, cooking all sorts of different things! It was misty and very atmospheric the evening we arrived but we awoke to beautiful sunshine and the breakfast trip on the boat (part of our package) was brilliant! Visit to the underwater discovery centre was also interesting. It's not cheap but worth every penny and gets booked-up months in advance so book ahead! There were problems with the road (landslips etc.) not long before we arrived so at one stage we thought we might have to cancel. As it turned out, the road was open during the day but closed from 7.00pm until the following morning which made it seem even more of an adventure, seemingly cut off from the world (at least for one night!!) You also get the place to yourself when all the coach tours have gone. Truly the experience of a lifetime.", "title": "Truly Wonderful Experience", "user": "disleksik", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160441117}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "There is surprisingly a severe lack of accommodation in Milford Sound so this is really THE only place to stay, so book ahead in case they are full as it is a very long drive back to the nearest town Te Anu", "title": "Really the only place to stay in Milford Sound", "user": "bodmor", "date": "May 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160429280}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "It is backpacker accommodation but was filled with a wide variety of people, middle aged couples, families with kids, various types of travellers and backpackers.", "title": "There Needs to be 6 Stars for the Chalets", "user": "PW03", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160314169}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "While there is a wee cafe serving tea, muffins soups ...etc if you need proper meal we suggest you bring your own food and use the kitchen facilities in the hostel. We picked up a cooked chicken in the supermarket in Te Anu, a bag of washed salad & bread rolls to save the hassle of cooking dinner. There were a lot of people using the kitchen at the same time, as we arrived at peak dinner time.", "title": "Beautiful\"", "user": "disleksik", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160305409}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "The room was basic, two comfortable single beds with nice linen/duvet and the room was very warm on a cold Milford Sound night. There was a little chair too.", "title": "You can't beat the location.", "user": "ToowoombaBilby", "date": "May 4, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 159656562}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We enjoyed our stay in a backpacker room. The shared bathroom was clean and spacious. The staff was very helpful and friendly. I would highly recommend the \"Summer Bed, Breakfast & Boat\" package. Early in the morning, before the day trippers arrive, it's FANTASTIC !", "title": "A great break after walking the Milford Track.", "user": "Nicole B", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156971648}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "PS : You have to book well in advance.", "title": "Has everything you could ask for!", "user": "leahp_australia", "date": "April 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156762912}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I loved my stay at Milford as a whole and the lodge definitely contributed to my fond memories! We stayed in the double cabins which are basic but clean, have heaters, lots of power points and good lighting! The lodge itself is great and the common room was a great place to meet lots of people. It was awesome that you could also bring your own alcohol in or enjoy their bar. The common washrooms and kitchen were very clean. My only ccomplaint is non-accommodation related and that Is that the vegetarian breakfast I had was awful! Work on your veggie food guys! Everything else was fantastic, great value, I highly recommend this place!", "title": "Only for backpackers", "user": "Jonathanlol", "date": "April 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 156540084}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "we booked 3 double \"lodge\" rooms with cruise as family.We tried to get the chalets but was told that it needs to be booked 1 year in advance due to availability. Many of us coming from queenstown expect some standard of quality. We didn't expect a hotel like accommodation but there was so much to dislike. There were many sand-flies to greet you as you unload your luggage, we weren't made aware of the complimentary repellents. The rooms were basic but something clearly needs to be done about the soundproofing, we could hear our neighbours talking and laughing, we could also hear people walking on the boardwalk outside in the morning.. The stench in the men's toilet reminds you of Rotorua and the smell did not go away even till the next morning showing that no cleaning was done. At least spray some toilet fresheners ?? The pantry was dirty and the pots and pans needed to be replaced badly. It was also too small to accommodate the crowd. We decided to eat out at blue duck since the cafe at site did not serve proper meals. The blue duck restaurant was a huge let down as well. There was no free allocation of wifi either , this was the only accommodation that gave not 1mb of free wifi. The staff were helpful but that's about it. The whole experience makes you want to drive 2 hours back to Te Anau.", "title": "Location can't be beaten", "user": "LittleMrsA", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 156291852}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If you want to stay in Milford Sound then this is pretty much the only option, and it does give you the best option of seeing the scenery early morning and late evening (and without hordes of other people) which, if you get the right conditions, is worth a lot.", "title": "The place to stay", "user": "Brave-Pete", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156284829}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific", "city": "Milford Sound"}, "variance": {"poor": 27, "average": 84, "very good": 115, "terrible": 17, "excellent": 105}, "aka": "Milford Sound Hotel Milford Sound", "slim_ranking": 0.5, "description": "It is simply not possible to fully experience Milford Sound in a day trip... Stay in Milford to enjoy its pure beauty after the day tripping crowds leave and before they arrive. Just 5 minutes drive from Milford Sound cruise boats, Milford Sound Lodge is ideally located. With picture perfect views of the Cleddau River and surrounding mountains, activity bookings on site, and a cafe and a shop, you won’t find a better base for your time in Fiordland. Choose accommodation that suits your needs – from award winning Luxury Riverside Chalets to cosy private and dormitory backpacking rooms and powered campervan and tent sites – and let our friendly staff help you make the most of your time in this World Heritage site.There is so much to do: kayaking, diving, boat cruises and sightseeing, or relaxing and soaking in the beauty of your surroundings. You won’t regret treating yourself to an overnight stay in Milford Sound.Pre booking is essential Nov - March and year round for our Riverside Chalets."}