{"user_rating": 4.0, "review_count": 1998, "name": "Millennium Gloucester Hotel London Kensington", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My wife and I had to find somewhere to stay for 1 night in London at Last minute, we are so glad that we found this great hotel!", "title": "Nothing but good things...", "user": "lbigg", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166955007}, {"rating": 2.0, "stay_parameters": "Stayed July 2013", "text": "Firstly, I was overwhelmed by how friendly ''ALL'' the staff were! The Concierge to reception right through to bar and house keeping staff, all with sincere gleaming smiles and greeted us with a hello. I personally think this is rarity in most hotels that I have stayed in, especially in 'chains' - The staff here actually look like they enjoy it!", "title": "Tired and broken", "user": "Garry966", "date": "July 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 166802418}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The lobby/Reception area is quite grand with marble floors and grand but not over the top decor, again a step away from normal chequered carpets and feature coloured walls you find in most chains. Check in was not a problem and was very smooth transaction.", "title": "3-Star Average experience", "user": "karenstrunks", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 166783488}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We stayed in room 227 which faced the front of the hotel, there was some traffic throughout the night but you must realise that you are in central London, this didn't effect my nights sleep. I thought the room it's self showed signs of ware, but was still modern and most of all very very clean!", "title": "Absolutley Fantastic Hotel", "user": "ArdleyWeddings", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166740633}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "we arrived back at the hotel around 12:30am after attending a concert. We went for a drink in the hotel bar which was very relaxing and lively at the same time. Me and my wife just sat in the corner and relaxed with a cocktail. But if you was returning from a club or in a big group the bar as ideal as it cater for all. There is a waiter service in the bar again met with a friendly smile and hello - goes along way in my book.", "title": "Second time around - much improved", "user": "Izzyk", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166703407}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "This may sound a little confused as some parts of my stay were great and some were appalling.", "title": "Major issue - don't go if you are a lone woman", "helpfulness": 3, "user": "Izzyk", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 133833987}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Location wise it is great - right next to the lovely restaurants and shops on Glouceter Road and walking distance to similar in Kennsington. Also just opposite the tube with handy connections via the circle line.", "title": "2 great weeks at the Millennium Gloucester", "helpfulness": 1, "user": "Cobbie", "date": "July 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133779648}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Check in was great the concierge whipped away my luggage whilst I checked in and the process was efficeint and friendly at the same time which is often difficult to acheive. I was paying for the first night myself and then was a guest of a company the following night and they managed to link my rooms so I didn't have to move. The concierge brought my luggage up 5 mins after I was in my room and was very helpful.", "title": "Stayed 2 July to 4 July 2012 for Wimbledon Tennis", "helpfulness": 2, "user": "Davsion", "date": "July 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 133699967}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The standard room was OK (bathroom a little tired) but the bed was very comfortable and it had a great desk to work at. Overall I was happy with the room.", "title": "My favourite hotel in London", "helpfulness": 4, "user": "StefanonHolidays", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133533051}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I was meeting a friend for dinner and was getting changed (nothing but my pants on) when the door to my room opened and another guest walked in (male I was a lone female). To say we were both embarrassed is an understatement and he left immediately apologising. I rang reception who said sorry and she would get the manager to rung me immediately. I waited half an hour with no response and went to reception as I was now late to meet my friend for dinner.", "title": "Excellent location and friendly staff", "helpfulness": 1, "user": "LAtravelGuy_8", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133461725}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We usually stay at the sister property next door, Millennium Bailey's, but they could not accommodate our room preference on this trip. Although the Gloucester lacks the period charm of Bailey's, the rooms are larger and the location is the same. Gloucester Road tube station, served by three lines, is just across the street. The museum district is a short walk away and there are lots of handy amenities within easy reach. We found the beds to be very comfortable. All in all, a good value for this area of London.", "title": "Excellent location and good value", "helpfulness": 1, "user": "lizbiz", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 167821118}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We can highly recommend this hotel. We took it as part of a cruise package so cannot comment as to the cost. The location in London was excellent. We have travelled to London many times prior to this last trip. The underground station is across the street. Never needed a cab. If you have been to London a few times and want to avoid the tourist congestion in Piccadilly etc. then this location is great. It is a short walk to the Science Museum, perhaps the best in the world. A quick ride to Leichester Circus for theater tickets (direct line). Also easy to get to the Portabello Market. We generally travel without suitcases....just carry ons. Even for a three week tour. No chance of the airlines loosing our luggage. We took the underground directly to the airport. There is an elevator (lift) at this station and just about ten stairs. ((Why can you go down a lift and up a down staircase?)). Also a direct line to the airport. Note; this review apparently was more about the underground station than the Hotel. Sorry. Hotel was very good. Not a Motel 6 by any means. The reception manager was more than excellent! The concierge could use a bit of zip. We went on the hottest days that London experienced in years. The air conditioner was insufficient but I assume that we could not blame them. They wanted to charge for internet. A hotel of this level should give it free. There is a Starbucks across the street . Their internet is faster than the hotel's.", "title": "Convienient location", "user": "Bill T", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167803448}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Made a return visit to the Gloucester on a weekend Travelzoo package which we found to be very good value. Room perfectly acceptable, all usual facilities, very good buffet breakfast and the 20% Travelzoo drinks voucher made the bar prices more reasonable. Just a few yards from Gloucester Road underground, this hotel makes a great base for sightseeing. Only negative was the £5 per hour or £10 per day charge for wi-fi. I expect they will say that this is the going rate in London whereas in actual fact, more & more hotels are providing the service for free. I think they will have to look at this for the future. Otherwise, a very pleasant stay and would recommend.", "title": "Good value, great location.", "user": "Billericaydickie_10", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167637564}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "stayed for 2 nights 12 th july.We were quickly checked in, had a lovely well equipped room,with comfy mattress and good quality pillows. Breakfast was very good with plenty of choise, waiting staff very attentive .in fact all the staff were very pleasant.", "title": "short break", "user": "dendy355", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167635390}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "You can walk to the natural history museum in 10 minutes,tube 2 minutes. Central London on public transport 20 -30 minutes. We requested a quiet room and had 2 good nights sleep. A great place to stay !", "title": "Superb", "helpfulness": 1, "user": "TK1956", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167623039}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "My friend and I recently stayed at this hotel.", "title": "Great Location!", "user": "AD1965", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167549105}, {"rating": 3.0, "title": "Old and gross, screwed by Getaroom", "text": "It is in a fantastic location, close to the museums,shops and restaurants of South Kensington. The Roayl Albert Hall is within walking distance.", "user": "foodiechatcom", "date": "July 14, 2013", "id": 167493979}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "The Gloucester Road tube station is literally, right next door, and provides good transport links to the rest of the city.", "title": "Excellent hotel and great location", "helpfulness": 1, "user": "Iliketotravel70", "date": "July 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167373359}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Although it is very well situated, we were not troubled by traffic noise at all during our stay.", "title": "Good value for money", "user": "Werner B", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167302888}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We ate breakfast in the hotel each morning. There was a very varied selection on offer, and everything we tried was very nice, however the one small problem we encountered was that because the Breakfast room was busy, the service was not as fast as it might have been. On both mornings we had to wait for fresh bacon, eggs and milk for cerial, as it had run out.", "title": "Business type hotel", "user": "Doris L", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 167030776}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "The location was perfect, right next to the Gloucester Underground station. There were a few decent restaurants with-in walking distance, as well as a grocery store. The hotel, on the other hand, was a dissapointment. We booked 2 rooms on the internet, one for my parents, and one for my two siblings and I, for a weeks stay. When we got there they had messed up the reservation and only had my parents room booked. We had to wait for 2 hours for our other room. We were supposed to have one King room for my parents, and one room with three singles for us, and they were supposed to be as close as possible. Instead they ended up with my parents on the 7th floor, and us on the 3rd, and they gave my siblings and I one with a queen bed and a roll-away. They moved us to another room with 2 singles and a roll-away the next night. My parents room was very nice. It was on the club level, with a spacious bathroom, and a very nice bedroom. Our first room was ok, not as big as our parents, but nice. Our last room was horrible. There was rust in the bathtub, and it was very cramped with a rollaway stuffed in there, and the bathroom was almost impossible to maneuver around. I recommend calling to double check your reservations, and ask to be put on a club level if they are available.", "title": "Not What I Expected", "helpfulness": 1, "user": "crissy9683", "date": "April 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3326568}, {"rating": 5.0, "title": "Terrific Hotel!!", "text": "Stayed in this hotel twice during a recent trip to London (March 05). I used priceline to get the reservation bidding only $89 a night for a room (used south kensington 4 star hotels to get the bid). Upon arrival (late at night around midnight) I found that the room I had selected (a non smoking room with a queen size bed), had been given out and I was then told that I would have to stay in a smoking room with 2 twin beds. When I told the night manager that I was completely displeased with this, she immediately upgraded me to a room on the Millenium Club floors, a room with a king size bed, and a price tag of over $300, which I was only paying $89 for. On my second stay at the hotel, I was already upgraded in their computer. When I checked in, I expected a regular room but instead found out that I had again been upgraded to the Millenium Club floors. The hotel is right across the street from the Gloucester Rd tube station, which has three different lines going through it, so you can get just about anywhere pretty easily. The bar and restaurants at the hotel are great as are the ones in the area. The concierge desk at this hotel is terrific! They were able to recommend several restaurants in the area, all of them great! (A couple of them make me want to go back to London just to have dinner, never mind the sightseeing). I would highly recommend this hotel, and hope to stay there again on future trips to london.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 31, 2005", "id": 3315924}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I stayed here with my wife and 2 1/2 year-old son for one week during an unseasonably warm and unfathomably sunny March. We booked the hotel through Priceline and paid a paltry $90 US. The stay was worth every penny and then some. Like others have written, the location is fantastic--right across the street from the Gloucester Road Underground Station and around the corner from two supermarkets, one of which is a 24-hour Tesco. We were hoping for an upgrade like so many others had received, but unfortunately there was none to be had. No matter. The room was plenty spacious and comfortable. The decor in the bathroom was a little tired, and the paint job in the room had a couple of scars, but so what? This is the first time I have ever stayed at a business class hotel in Europe (as opposed to funky, independently owned properties). Normally, I would tend to avoid chains in search of something with a little more character. Then again, I hadn't travelled overseas with a toddler before, so the trade-off was worth it.", "title": "Terrific value thanks to Priceline", "helpfulness": 8, "user": "jerzhoo", "date": "March 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3299565}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "To everyone who has complained about the cost of food and ammenities: it's LONDON, for Pete's sake! You don't want to spend twenty bucks a person for breakfast? Go to the Tesco and get an almond croissant for 89p. Geez. And do try the coffee across the street at \"La Liaison\"--it's quite good and about half the price of the Starbucks around the corner. Why would you want Starbucks anyway when you can get it at home?", "title": "good hotel good location", "helpfulness": 8, "user": "ctorrance", "date": "March 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3298238}, {"rating": 4.0, "title": "Great Location", "text": "Would I be so high on this place if I had paid the rack rate? Nope. But I didn't, so I am. Enjoy!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 22, 2005", "id": 3293583}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I booked this hotel from Australa and stayed with my sister in May 2011.", "title": "Nice hotel , security great, close to tube station", "helpfulness": 1, "user": "feehammell", "date": "July 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135526005}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were not happy with the room so we were upgraded to a nicer one.", "title": "Lacks attention", "user": "Phili22", "date": "July 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 135493519}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel reception is open 24 hours and it has a safe and secure atmosphere .", "title": "Lack of Attention to detail spoils this hotel....", "user": "mitchell251106", "date": "July 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135136241}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The staff were good but didn't go out of their way to be helpful.", "title": "Great stay", "user": "maxisweden", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135051180}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I think it would be much better value if breakfast was included.", "title": "The bad outweigh the good", "user": "foreverdreamin", "date": "July 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134808324}, {"rating": 3.0, "title": "Don't use the phone!!!!!", "text": "My friends and I booked three rooms, as we were going to see CREAM perform at the Royal Albert Hall and this hotel is within walking distance of that lovely venue.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 5, 2005", "id": 3440926}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "PLUSES: As others point out, its just a couple of hundred yards from the Gloucester Road station on the Picadilly, Circle and District lines of the tube. This is a big time and money saver if you're flying into Heathrow. You can get to the hotel (almost the doorstep) for 4.80 pounds. Not Bad.", "title": "Sorry we have overbooked!!!!!!", "helpfulness": 8, "user": "Amichoo", "date": "May 3, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3434634}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "The lobby is spacious and fairly elegant. The rooms are ok. Clean, etc. Bathroom is large and no hot water problems or anything of that sort. Minibars are well stocked but expensive. Use the shops and pubs just down the street instead.", "title": "Okay, but certainly nothing special", "helpfulness": 2, "user": "VarsandPete", "date": "May 2, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3431252}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "MINUSES:", "title": "Great if you get it cheap", "helpfulness": 2, "user": "Guillaume H", "date": "April 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3423996}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "There is no air conditioning (my room had a fan/heat control only). Temperature outside was 60s/70s Farenheit, but the room was pretty uncomfortable. Think long and hard before booking in the middle of summer.", "title": "They gave our pre-paid room away.", "helpfulness": 9, "user": "unicornn", "date": "April 27, 2005", "detail_rating": {"service": 1.0}, "id": 3419254}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Stayed one night on 5th March and I wasn't overly impressed by the hotel. Although it's in a great location close to Gloucester Road tube station, that's about the only thing going for it. The heating was non existent and we never saw the maintence man we were promised would come check it. But comfortable bed in a central location at a reasonable price for London. I always stay in this area when I go to London but will not be using this hotel again. There are others in the same area which are slightly more expensive but alot more value for money.", "title": "OK hotel in great location", "helpfulness": 1, "user": "Diro", "date": "March 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 3285288}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "Stayed at the Millenium Gloucester from 3/23 to 3/28. If you're coming from the U.S. make sure you can get an early check in, I didn't and I had to wait in the lobby until 2pm even though my flight got into Heathrow at 9am. If you're expecting a 4 star quality U.S. hotel, forget it. The rooms are a good size but had to call down to get a portable heater because room was cold, electricity went out in the whole room for about a 1/2 hr. one morning and the carpets have lots of stains. Location is great, right next to the tube and the 24 hr. supermarket next door is nice. Not a bad hotel for 100.00 U.S. a night.", "title": "The Hotel is o.k.", "helpfulness": 5, "user": "Cfarley", "date": "March 17, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3283300}, {"rating": 3.0, "title": "Had a fab time!", "text": "The hotel looks quite grand when you go in and first impressions were good. The staff were really friendly and check in was quick. The standard room we booked for £60 through priceline was great value for money. The room and bathroom were really good sizes and had nearly everything you could need. I asked housekeeping for a couple of bathrobes and they arrived within minutes. Parking cost £30 for 24hrs which was quite expensive but worth it for us for the convenience. There were bits that were slightly disappointing such as the wallpaper was peeling off the corner in the bedroom and the tap on the bath was falling out of the wall! Also, the corner room I had overlooked the Holiday Inn and as a light sleeper all the coaches coming and going in the night was bothersome. I got my earplugs out though and slept well. Over all, we had a great time, good value for money, the staff were excellent and I'd probably go back....might upgrade though!", "helpfulness": 7, "user": "RJPerrelli", "date": "March 14, 2005", "id": 3271913}, {"rating": 3.0, "title": "Close to station", "text": "Have just stayed at this 4 star London hotel with my husband. Booked on lastminute and had bargain room rate, but probably got poor room because of this. You can upgrade room for £30 to a club room with free breakfast if you want to splash out.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 12, 2005", "id": 3268719}, {"rating": 5.0, "title": "Nice hotel and great price for 4 stars!", "text": "I was very surprised to find such a nice hotel after reading some of the reviews. I disagree that this has 3 star rooms in a 4 star hotel. I was disappointed that we couldn't get a free upgrade but they had four conferences going on so it was expected. We booked our room on priceline for $100/night during Thanksgiving. Our room was very spacious - king size bed, mini bar and a huge tub with marble. The front desk was very accomodating with providing extra pillows and blankets. The concierge was great- we loved every restaurant that he recommended. The French restaurant Lou Pescadou is a must. I couldn't beleive the great location either with the price in London! Across the street from the underground and many cafes around to catch breakfast. Do not get breakfast at the hotel, it will set you back and arm and leg and you can find the same for fraction of the price outside.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 14, 2004", "id": 2879587}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "For budget travellers, this is a really good deal for the money for the location. The Gloucester tube is only a half block away.", "title": "Good Value; Half block from tube", "helpfulness": 4, "user": "sfchris", "date": "May 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 2.0, "service": 3.0}, "id": 3475158}, {"rating": 5.0, "title": "Top Hotel", "text": "Americans should keep in mind that hotels are run differently in Europe and the UK. They spend all their money on the lobby. Therefore the lobby looks like a typical American 4 star, but the rooms are more like 2 stars. Nothing terrible, just nothing fancy and plenty of wear and tear on the carpets and furnishings. Even so, you certainly can't beat the location for the price!!!! You will find yourself grateful that you are so close to a tube, particularly when you have luggage in tow!!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 13, 2005", "id": 3470299}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "I also found the staff to be courteous and accomodating as well.", "title": "Very content budget traveler", "helpfulness": 5, "user": "CircusMM", "date": "May 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3457923}, {"rating": 5.0, "title": "Location is ideal", "text": "Fantastic Service, Warm welcome. You should try the Club Service for £116.- Staff very professionnal, and more particularly the receptionists.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3446074}, {"rating": 4.0, "title": "Good solid 4* hotel", "text": "Room very comfortable , High Speed Internet much appreciated.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3442258}, {"rating": 5.0, "title": "Wow!", "text": "My daughter and I went to London on a four day vacation whirlwind trip--booked a package with air and hotel. We stayed at the Millenium Gloucester. Could not have been more pleased. Elegant lobby, attentive friendly staff, clean room, large bathroom, lots of hot water, small desk/writing area, small walk-in closet/dressing room. All of this pales in significance, however, when looking at LOCATION. It is literally 20 steps from the Gloucester Station stop on the Picadilly line. (That is within the first fare zone. You can easily get ANYPLACE you might want to go in London within minutes, and get to and from Heathrow in well under an hour, with no changes or hassles. The neighborhood and tube station are safe at any time day or night. There are a couple of convenience food places open 24 hours, so if you want to use the small refrigerator in the room for snacks it is easy. LOCATION plus elegance. Wow.", "helpfulness": 5, "user": "tsantiris", "date": "April 27, 2005", "id": 3419187}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "My girlfriend and I stayed here for two nights this week. We got a great 'anonymous hotel' deal through lastminute.com", "title": "Very comfortable at great location", "helpfulness": 2, "user": "Eric-A95", "date": "April 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3399770}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "The hotel is very attractive and clean. Our room was on the 4th floor. Everything was clean, and the room was moderately spacious, enough for the two of us. We had a nice daybed in addition to the bed. The bathroom was very nice, and it had a massive bathtub large enough for my girlfriend and myself, so neither of us had to wait after a long day walking around London.", "title": "Helpful hints...", "helpfulness": 7, "user": "PlumSkyes", "date": "April 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3345796}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "The lifts were frustratingly slow. I feel like most of our time there was spent waiting for an elevator to arrive.", "title": "Great location, wonderful room!", "helpfulness": 8, "user": "DanaGirl225", "date": "April 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3344126}, {"rating": 3.0, "title": "Average Hotel", "text": "The neighborhood (South Kensington) was very nice, and the hotel was only 30 seconds from the Gloucester Road tube stop; the Piccadilly line is especially convenient for sightseeing.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 6, 2005", "id": 3337324}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Stayed at the hotel as part of a large group booking for the Cup Final in May.", "title": "Lived up to the 4* billing....great breakfast.", "helpfulness": 2, "user": "cheekymonk", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134422986}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We were well looked after the staff on arrival. The room was neat and tidy...some of the equipment in the room had had better days. The bathroom was spotless with a good range of complimentary toileteries.", "title": "Tired bedrooms in well placed hotel", "user": "watpar", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 134331084}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The TV also had the Sky Sports channels.", "title": "kind staff", "user": "sar82don", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134317095}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Our room overlooked a courtyard so not the best view.", "title": "Brilliant upgrade", "helpfulness": 3, "user": "MrsHotelswell", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133892839}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We arrived at Euston on a two day business trip and took the Undergroud-line to Gloucester Road station. The hotel is just around the corner. It is situated in a busy area full of pubs, shops and restaurants. There are a few small supermarkets as you leave the tube station - really handy if you have forgotten any toiletries etc. Reception was friendly and efficient. The room was comfortable enough considering the rate we paid. We didnt have breakfast here, but there is a small cafe by the hotel which does fantastic breakfast at a reasonable price. It can get quite busy though.", "title": "Good Hotel at a fair price", "user": "magspool", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136157947}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Overall, a good hotel in a buzzing little area. Would stay again.", "title": "Mr. Puck and staff were first rate!", "helpfulness": 1, "user": "Ken H", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135936984}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "From our personal booking from Calgary, Canada by Mr. Puck to a warm welcome to a genuinely comfortable and friendly stay our hotel experience was terrific. We were regularly asked about our stay and any needs we had, including concierge services and tips. Our 9 days in London were made more awesome from the personal attention we received from Torsten, Ripan and other hotel staff.", "title": "location!", "user": "Conrad B", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135897211}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "easy to get to from Heathrow, spent two nights on a business trip, ease of check in, clean room, helpful staff and good spread of breakfast in the morning with easy tube access. Executive room with working desk a great help but surely it could do away with payable wifi!!! its a commodity that most people expect and need to function with , its a standard fee by the establishment and see no reason why individual guest needs to be charged and what a 'plus' this would make for the hotel! recommended!!", "title": "Millenium Gloucester", "user": "Duncan B", "date": "July 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135833066}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Prompt replies to inquiries about pricing and availability. Staff very friendly and helpful. Rooms have nice beds and bed linen. Well located next to gloucester road station, (Piccadilly line), also very near the Natural History museum, the Victoria and Albert museum and the National Art Library.", "title": "Not worth the money", "user": "Dawn S", "date": "July 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135684081}, {"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "We stayed for a dreaded six nights from 8-14 June 13 in a club room. The bed was so uncomfortable. I went to reception after the second night of no sleep and complained. The hotel organised for the mattress to be changed and when it was changed the guy said no wonder it is uncomfortable their is a spring coming through. He then went to put the new one on and said we can't use that- all the material was torn and foam was hanging out the end. He said there is only one more spare mattress left. So that was it. Mattress was replaced with another terrible mattress. I did not hear from reception to ask if everything was okay. But was asked at checkout if I enjoyed my stay. What a joke! I am still having Physio. The reception manager said if I stay again he would look after us. You should have looked after us the first time and we may have come back", "title": "Worst stay - the most terrible bed I have ever slept in!", "user": "tf1966", "date": "July 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 168242481}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "great location , very nice rooms , the restaurant at the hotel is great although quite expensive , the staff were nice and welcoming , business launch is quite bad value for money, compared to other launches.", "title": "great location,evry nice rooms", "helpfulness": 1, "user": "Amichai B", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168200563}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Our party of 8, two families with teens, stayed here for 4 nights and used as a base to explore London. Very good location, across street from tube station, nice grocery, and many restaurants. The rooms, after we got situated are nice (drink refrigerator a plus), and the concierge lounge is great - book on one of the floors with access. We had trouble with check-in, with two of the rooms not ready at 7 p.m., and one not until 10!! Check-in took forever, as each individual room had to be checked in separately and the computers are painfully slow. After 1 night, we had to change one of the rooms because someone was smoking next door, even though it is a non-smoking hotel. Also, the wi-fi was horrendous. Free on the concierge floors, but doesn't work in the lobby and kept kicking us off every few minutes even when in the room (when we brought this to their attention at check-out in response to \"was everything all right\" the clerk was very concerned, asked me to provide written feedback, and took a room service charge off our bill - good job). Breakfast is very nice - full breakfast with lots of exotic food in the main dining room (included in our room rate) but also adequate basic breakfast in the concierge lounge. Happy hour in concierge lounge not to be missed.", "title": "Great location; nice rooms; good breakfast; service glitches", "user": "SLS006", "date": "July 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168195654}, {"rating": 4.0, "title": "Great location and great staff", "text": "This is my second stay here.", "user": "Chris W", "date": "July 18, 2013", "id": 168011254}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Staff are great.", "title": "Room 101, oh dear.", "helpfulness": 2, "user": "philip j", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 167968835}, {"rating": 5.0, "title": "Very Pleasant Stay", "text": "We found this hotel to be a pleasant surprise, considering the great rate we had (via Priceline). The room was modern, clean, spacious and comfortable--and tastefully decorated. The bathroom was a little small. The staff was pleasant and accommodating--though I would do your own research rather than trying to rely on the pleasant but not overwhelmingly competent staff.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 5, 2004", "id": 2807887}, {"rating": 4.0, "title": "Good hotel for the money", "text": "The location is great, too! Right across from the Kensington tube station--couldn't be easier.", "helpfulness": 3, "user": "Alex-Philadelphia", "date": "October 22, 2004", "id": 2779664}, {"rating": 2.0, "title": "Horrible story", "text": "We never ate at the hotel, but the bar area is comfortable and becomes fairly active at night. The breakfast served for free in the upgraded Club level lounge is quite decent.", "helpfulness": 9, "user": "Bhm007", "date": "October 19, 2004", "id": 2758280}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 148, "average": 333, "very good": 793, "terrible": 64, "excellent": 660}, "aka": "Millennium Gloucester London", "slim_ranking": 0.227695167286, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}