{"user_rating": 4.0, "review_count": 777, "name": "Millennium Bostonian Hotel", "reviews": [{"rating": 3.0, "title": "VERY Noisy", "text": "This is a tough review to write because there were both good and bad things about the stay.", "helpfulness": 2, "user": "kbalfe", "date": "November 9, 2004", "id": 2814823}, {"rating": 2.0, "stay_parameters": "Stayed November 2004", "text": "PROS:", "title": "Disappointing", "helpfulness": 2, "user": "Musarion", "date": "November 7, 2004", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2811579}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "Location...the hotel literally overlooks Fanueil Hall and there are tons of restaurants, bars, etc. within a 5 minute walk.", "title": "Great location", "helpfulness": 3, "user": "Babaduck71", "date": "October 19, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2757454}, {"rating": 4.0, "title": "Great rooms", "text": "Service...I thought the staff was very helpful and prompt.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 14, 2004", "id": 2703375}, {"rating": 4.0, "title": "Super location, nice bright room", "text": "CONS:", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 13, 2004", "id": 2701150}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This was truly an exquisitely fine hotel. Room was beautiful, bathroom-spacious and high quality, staff/concierge were helpful and polite. Book a room with the small balcony overseeing the Marketplace. This hotel was in the perfect location for walking to all the sites. It was nice to be able to stroll around the Marketplace in the evening and then cross the street to our cozy hotel room. You won't need to use your car if you stay here, but the parking was expensive-$40 a day. I highly recommend the MB Hotel! Top notch, for sure!", "title": "Wonderful hotel!", "helpfulness": 8, "user": "Chris3051", "date": "August 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5711586, "likes": {"liked": "— location and quality of rooms", "disliked": "— parking fee"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled as a couple", "text": "While not an inexpensive place go stay, nothing in Boston is particularly inexpensive, which makes this place a good value. The rooms are very nice. Our room had a small balcony overlooking Quincy Market and Faneuil Hall. We were within walking distance of so many historic sites, shopping and restaurants making this a most excellent location.", "title": "Very nice & great location", "helpfulness": 8, "user": "joan&mike", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5699307, "likes": {"liked": "— Location, quality of room, excellent free breakfast", "disliked": "— Disagreement on the cost of parking"}}, {"rating": 2.0, "title": "Overpriced for what you get.", "text": "And a free breakfast came with our room - not a bagel and coffee but a complete breakfast in their restaurant, complete with cloth napkins. We were not expecting this.", "helpfulness": 5, "user": "mdray", "date": "August 6, 2006", "id": 5562653}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The parking service is run by a different company. They tried to charge me $70 instead of $35 because I arrived before noon (I got there at 11:45). Because they did not inform me of such an \"extra\" charge when I arrived, I refused to pay it and they agreed to deduct it from my bill.", "title": "Great experience! Wonderful location, and great hotel!", "helpfulness": 12, "user": "xichic", "date": "July 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5441929}, {"rating": 5.0, "title": "Speechless", "text": "While its location is great, the hotel itself leaves a lot to be desired. For starters, there is no lobby in this hotel. That is right, you walk in an there are a couple of desks, you are greeted, get checked in, and up you go to your room, nowhere to \"hang\". We had an 'upgraded\" suite, and other than a (terrible) sleeper sofa, and a double door to divide the two rooms, nothing about this place was impressive. Amenities were average, and the noise level a problem, late into the evening (being across from Fannueil Hall, and Market Place). We needed directions to the hotel, and when I called the hotel, the concierge person cut me off, and hung up on me because I could not write fast enough for him, he was too busy to wait for me. All in all, this mostly stems from the price of the room, at over $300 a night, you'd expect much better. Also buyer be aware, there is a whoping $40 a night parking fee!!! OUCH!!!", "helpfulness": 9, "user": "Julie C", "date": "July 8, 2006", "id": 5438574}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "If you are looking for one of the best hotel locations in Boston - look no further than the Millennium. Bordering on Faneuil Hall and Quincy Market, it is absolutely central to everything.", "title": "Location, Location, Location", "helpfulness": 8, "user": "THN2006", "date": "August 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3742787}, {"rating": 2.0, "title": "Trouble Times Five!", "text": "If you are looking for a clean simple room - again this is the hotel for you.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3653285}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "What lets this hotel down is the way they keep the common areas. The hallways look very sad and the carpeting looks like it should have been repaired/cleaned/replaced some time ago.", "title": "One of the better choices for travelers", "helpfulness": 9, "user": "Beyond_Boston", "date": "July 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3633611}, {"rating": 4.0, "stay_parameters": "Stayed August 2003", "text": "The lobby is small and nondescript and the hotel staff, although efficient and courteous, lacked warmth.", "title": "great hotel", "helpfulness": 5, "user": "tallymebanana", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3623379}, {"rating": 5.0, "stay_parameters": "Stayed August 2003", "text": "There are a lot of deals on the internet and as long as you don't pay the list price - and you want to see and enjoy as much of Boston as you can in a short while - this Hotel can't be beat.", "title": "Gota stay here!", "helpfulness": 1, "user": "yoyo5", "date": "June 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3576307}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Hey, all these good reviews can't be wrong. The Bostonian really is the best location for tourists visiting Boston. I've stayed at the Prudential Center, too, and like this spot better. Good access to the T, easy walking to the National Parks Visitors Center, North End restaurants very close, and that Quincy Marketplace right across the street for eats and shopping -- it's all right here.", "title": "A Tourist's Best Pick", "helpfulness": 6, "user": "paintchipgirl", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5368825}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We loved the location, like all the other reviews. Nice place, our room was right over the street, and directly across from Quincy Market, but exceptionally quiet.", "title": "Great location", "helpfulness": 12, "user": "annasmom73", "date": "May 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5226361}, {"rating": 4.0, "title": "Fantastic location", "text": "The hotel is expensive! Parking is expensive, and I feel if I pay $40 to park I shouldn't have to tip the valets $20 too, in order to get my car quicker. Another weird thing is that you have to call room service for ice. I can get my own, thank you; because next thing you know, you are tipping for ice that is free, and tipping for someone to come light the fireplace, etc, etc, etc.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 20, 2006", "id": 5183498}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The bathroom looked a little Holiday Inn-ish...the paint was cracking onto the floor, the bath rug was torn, and the toiletries were generic. When I pay well over $300 for a room, I expect brand names and un-torn rugs.", "title": "They go above and beyond- always", "helpfulness": 9, "user": "SportsTraveler", "date": "April 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5013186}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "We liked the Onyx much better, for over $100 less.", "title": "Mostly good", "helpfulness": 7, "user": "Bruce4434", "date": "March 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4772599}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "I stayed here on business travel on June 1st. I've been to Boston before and normally stay at the Marriott hotel on the wharf. This hotel is great for tourists; you are right in the midst of the vicinity of the marketplace and can pick up the freedom trail, etc. Room was very nice, concierge and front desk all very helpful.", "title": "Good for location", "helpfulness": 3, "user": "Chickynyc", "date": "June 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3524047}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "Great location, right in front of Faneuil Hall. Unfortunately, the building is a bit old and not too well maintained. Our room was a \"superior room\" with a view of Quincy Market. Nice little balcony and view, but you hear everything.", "title": "Okay", "helpfulness": 5, "user": "idonthave1", "date": "April 8, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3344943}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "Just returned from a stay at The Bostonian. The room was very well appointed, in fact, one of the nicest I've stayed in. The staff was pleasant and professional. The restaurant is very pricey and may not be a good value considering the other excellent places in the immediate neighborhood.", "title": "Nice Experience.", "helpfulness": 1, "user": "WHH", "date": "April 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3322540}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "It is now easy-off, easy-on to the highway with little travel in the congestion. Will stay there again", "title": "Historic Location", "helpfulness": 2, "user": "celem", "date": "March 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3316318}, {"rating": 5.0, "title": "great location for first time visitor", "text": "Good location right in the historic area. Room was good with a huge shower. We used a package deal of $149 including full breakfast.", "helpfulness": 8, "user": "farawaymum", "date": "March 16, 2005", "id": 3278631}, {"rating": 4.0, "title": "Great Location But Overpriced", "text": "This hotel has a fantastic location. We were upgraded to a Junior Suite with a fireplace which was lovely. This hotel is a bit run down for the price, but the service was excellent. It is incredibly noisy, but after a lavendar soak in the jacuzzi, we really didn't care. I reccommend this hotel, but if you are used to super luxury hotels; you will be sorely dissappointed. Oh and stay away from the mini-bar and hotel bar--incredibly expensive!", "helpfulness": 2, "user": "janeknows", "date": "December 6, 2004", "id": 2865838}, {"rating": 5.0, "title": "Amazing!!!", "text": "I can't say enough wonderful things about this hotel.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 12, 2004", "id": 2821627}, {"rating": 4.0, "title": "Great location, attentive staff!!!", "text": "We stayed at the Millenium from 10/6-10/10 and had a great time. I verified my reservation a week before arrival and after some glitches were cleared I ended up w/ a king suite overlooking Quincy Market. The room was very large and the amenities were plenty. We asked for extra bathroom toiletries and loofahs and they were there upon our return. The ice we called up for was delivered within 5 minutes every time. The check in staff, the concierge, and the bell staff were very helpful w/ directions and suggestions. The best part of this hotel is definitely its location. You can't beat being right across the street from Quincy Market. You can shop, eat, start tours, etc. from there. You are also very close the the North End (5 minute walk) and their shops, bakeries and restaurants are all very good. You are also a 5 minute walk from the Aquarium and the wharf. I will admit that there was a lot of noise from the market on Saturday night from about 1:30-2:30 am as people were leaving the bars and hailing cabs. You can avoid this if you want by having a room in back of the hotel. Would I have paid $589/nt for the suite? No way, but I wouldn't pay that for any room anywhere. But hey it was an upgrade and I got a free fruit and cheese tray upon my arrival.", "helpfulness": 3, "user": "ctribbs", "date": "October 13, 2004", "id": 2700848}, {"rating": 1.0, "title": "Parking $35.00 per day! Rooms $369.00 per night ouch!!", "text": "Beware of this place! Tourist trap!! Hotel is an old building that has never ending work going on! Drunks , homeless people! The Sea port or Hyatt is much nicer and only a mins away.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 12, 2004", "id": 2697747}, {"rating": 1.0, "title": "Bad News,Overprice !!", "text": "Sept 18,19 2004", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 7, 2004", "id": 2629104}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "My wife and I went for a night in Boston at this hotel and had a pretty crappy time. The reservation staff (college kids to busy talking to bother with you) was unbelieveable! We had reservations for a non smoking room but they checked us into a smoking room! back down to the front desk with all of the bags. Here we go back up to the next room! Wow, this room had a bucket in the middle of the room dripping water into it from the rain! the best part of it is that the maid told the front desk of this and they still sent us up to it. Third time is the charm on the 1st floor! From 11:30 PM to 3:30AM there is fighting going on outside on the street. Oh, by the way did I mention about the sink in the bathroom leaking all over the floor! No trap under the sink! The good side was when the hotel manager got involved and called me at my home and actually did care about what happened. Although, when I mention a refund ($400.00) it became very quite. I am planning on writing to the corp. headquarters in New York to see about getting my refund!!", "title": "Loved the millenium", "helpfulness": 5, "user": "ajc817", "date": "September 14, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 2574438}, {"rating": 4.0, "title": "Good hotel, but parking price is steep", "text": "we pricelined this hotel for a 5 day stay in sept 04 and got a great deal of £80 night. we were excited about the location since fanuiel hall is a great base for exploring boston. all the staff we encountered, from the check in woman to the people who delivered ice to our room, were very friendly. we managed to get a 7th floor (top floor) room so we didn't hear hardly any noise from down below, although sometimes i heard a little before i fell asleep. (nothing that would wake me up and i'm a light sleeper) i would suggest requesting the top floor,though, just in case. the bed was soft and comfy, the tub was a massive oval one and they had a nightly turn down service, which included chocolates and weather forecast for the next day. also, there are home made cookies at the desk for guests every night. i found the hotel to overall be very accomodating and highly customer service oriented. one of my best hotel experiences and you can't beat the shopping and restaurant options right at your doorstep!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491666}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My wife and I stayed here for three nights. Our room was very clean. Very nice modern decor. We were very comfortable there and the location was fantastic. Across from Quincy market. What was even better was how close we were to the North End (little Italy). So many restuarants and pastry shops. Close to parks with water features. We would go back to this hotel any time.", "title": "Modern, clean, well located hotel", "user": "agbbrown", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74524390}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel is in an excellent location, and it is a relatively easy walk to the harbour, Boston Common and most of the historical sites. There are also plenty of restaurants nearby. Rooms are a good size, are very comfortable and with all the facilities you would expect. Large bathroom with excellent shower. Efficient and friendly staff. If you are looking for a base to explore the city this is highly recommended.", "title": "Good base for exploring the city", "user": "alyth", "date": "August 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74142348}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel was wonderful in many ways. The room was well appointed and clean. The bed was very comfortable and large. The bathroom was nice. The additional dressing area was a nice touch. You didn't have to use the bathroom to apply makeup, etc. The location was great. We were right across the street from Fanuiel Hall marketplace and very close to the T for transportation. The staff was courteous and the restaurant/bar was good as well. The only complaint was a noise issue on Friday night of our stay. The neighboring bar had live music blaring until around 2am. We were on the back side of the hotel. I called the front desk to inquire about the noise and was told the bar would close around 2. When we commented on the noise issue at checkout, there was no response. The hotel was great, but not being able to sleep even with earplugs in is not a good impression to leave your guests with. After all, you are paying to be able to sleep there. I would recommend the hotel only if you weren't staying over a weekend or if they could assure you wouldn't hear the bar from some other side of the hotel.", "title": "Great accomodations but loud music a problem on Friday night", "user": "jcarducci", "date": "August 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 73295909}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The hotel was easy to find, was in a great location, safe neighborhood, close to the waterfront, next to Faneuil Hall and Quincy Market. The rooms are nicely decorated. We had a room with two double beds and very uncomfortable mattresses. The front desk folks were helpful. Check your final room charges -- if you move a beverage in the in-room fridge, you'll be charged for it. We were allowed to leave our luggage with the bellhops after we checked out so that we could see a bit more of Boston before it was time to go.", "title": "Excellent Location - Nice Rooms - Uncomfortable Beds", "user": "M0mfr0mMI", "date": "July 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 72941807}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This hotel is located just across the street from Quincy Market and Fanuiel Hall. The T is a short walk away which was important to us. It is very close to the North End and all the fabulous restaurants. Our room was a double and very spacious. I would definitely consider staying here again.", "title": "Great stay....", "user": "AllieB27502", "date": "July 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72281448}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Located across street from huge Quincy Market with shops, restaurants, and an indoor 2 block-long food court. Try the macaroni and cheese with lobster. Hotel on block that the Freedom Trail crosses and if you can walk without difficulty, it is within easy distance of most historical sights. Room was comfortable with a separate room containing the closet with safe, dressing table, and access to the bathroom. Large walk-in shower. Easy to use thermostat kept room temperature just right; it was very hot and humid ouside and we always run the fan at night to block outside noise.", "title": "Great Sightseeing Location", "user": "bglhvn", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82500810}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Staff pleasant, especially the doormen who always opened the double set of doors for all guests. No problem at check-out removing beverage charges for the cans we moved out of the the small refrigerator to store our water. Don't like this setup, but it may be convenient for some guests since there isn't a lobby store to purchase beverages or snacks.", "title": "Could not have picked a better place.", "user": "Firefighter4", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82387720}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Room wasn't ready for check-in, even after 6 p.m. arrival. Toilet not securely bolted to floor and rocked but didn't leak. Sliding bathroom pocket door wouldn't stay shut. Didn't hear noise from farmer's market being setup outside for Friday and Saturday.", "title": "Great Location", "user": "ka-duncan01", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 82100910}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Out the front door and across the street and I am in Fanuil Hall/Quincy Market Place. Two blocks in the other direction and I am in Bostons famous and historic \"North End\". First night had great meal on the waterfront, then fabulous italian the next. Walked to both places. Hotel was really nice, clean, and centrally located. Staff was wonderful. Only had evening drinks and breakfast in their restaurant and both were superb. Super comfy bed, very quiet hotel.", "title": "How About That Location!", "user": "beau3636", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 80985976}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at the Millenium for one night while seeing a concert at the Garden. It was the perfect location for us right in Fanuiel Hall and a 5 minute walk to the Garden. A five minute walk also to the North End.", "title": "Fabulous!!", "user": "mootz", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78133046}, {"rating": 4.0, "title": "Nice little hotel", "text": "I stayed at this hotel on business in Boston. It has a great location right next to Faneuil Hall and Quincy Market which I can imagine could be quite noisy during summer so get a room facing towards the back. The rooms were pleasant enough although hardly luxurious.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3251312}, {"rating": 1.0, "stay_parameters": "Stayed September 2004", "text": "We stayed for four days at the Millenium Hotel Fanuel Hall Hotel spending about $1.100 on the room bill and were stunned that a four star hotel was so dirty! The entire hotel including the room, had carpets that were filthy. The hair dryer was hanging from the bathroom wall with exposed electrical connections, the towels were harder and rougher than any hotel I have ever been in and there was only towels for one person. The TV could not be made to work, and the wooden window frame was all rotted out and moldy. To top it off, my letters to the management were never responded to! While this review is written some months later, my anger and disappointment at this appalling experience has not diminished one bit. If there had been a room available anywhere nearby we would have immediately checked out. We were trapped!", "title": "Millenium Hotel disaster!", "helpfulness": 13, "user": "pwalsh", "date": "February 7, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3167345}, {"rating": 3.0, "title": "Inflated Price for a Nice Stay", "text": "I stayed at this hotel in 2002 for one night while I was in town for a function and I found it to be a nice hotel convienently placed near Fanieul Hall. I walked in after an evening function and there was no one to be seen in the front desk area, finally someone came out to help check me in. The room was nice it was large and clean and it had some nice amenities such as the dual rain forest shower head in the bathroom and clean crisp linens. The entrance was was nice but it wasn't incredible everything was somewhat average looking within the hotel. The location is wonderful the confort of the rooms is wonderful. The service was very mediocre and the common rooms were ordinary. Nice hotel if you get a great deal, it was not worth the $450.00 dollars it cost me to stay there but that is what I get for staying in the city in the summer, you pay for location!", "helpfulness": 3, "user": "Eurotripper", "date": "February 5, 2005", "id": 3164458}, {"rating": 4.0, "title": "Great Location", "text": "You can not beat the location - across the street from Fanueil Hall, short stroll to the North end and all of the fabulous italian restaurants, one block from Downtown crossing with great shopping, farmers market right outside the front door, across the street from the T, and easy access on and off the highway which is a challenge these days with the big dig. Have stayed several times at this hotel, it is showing some wear and tear, can be noisy at night, and rooms are on the small side, and parking is high - 35.00 per night. However, staff all very friendly and eager to be helpful, and the location make this a good choice for beantown.", "helpfulness": 5, "user": "dogcabo", "date": "January 16, 2005", "id": 3010887}, {"rating": 4.0, "title": "Fun!", "text": "This is a smallish hotel with great service. We had a room with a \"back view\" - we could see the north end and the produce market, and the Zakim Bridge. It was so much fun! We turned the sofa around to look out, and spent hours just sitting and enjoying the view!", "helpfulness": 2, "user": "nancysparkle", "date": "January 15, 2005", "id": 3009735}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Was at a great location. Boston is such a nice city, hard to find a bad spot. Front Desk girl was nice and able to help us with directions and show tickets.", "title": "I love Boston", "helpfulness": 2, "user": "HakuMegan", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15004600, "likes": {"liked": "— Great service", "disliked": "— Wall colors."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Rooms were clean and had nice view of city. Beds were comfortable as well. Was a very good value.", "title": "not a bad hotel...", "helpfulness": 1, "user": "Mikar85", "date": "April 4, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 14788937, "likes": {"liked": "— location", "disliked": "— outside noise"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "Looking forward to going back.", "title": "Great location, great room, excellent customer service", "helpfulness": 2, "user": "purpleknif67", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14487952, "likes": {"liked": "— location", "disliked": "— pricey phone calls"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Recently stay @ Millennium.", "title": "Comfortable & friendly.", "helpfulness": 1, "user": "whatkatydidnext", "date": "February 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13543646}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Upon seeing our room, it was not what I had a reservation for, and the front desk was more than accommodating - even putting the 4 of us in a suite at no extra charge!", "title": "Great location but awful hotel", "helpfulness": 4, "user": "SKS2008", "date": "January 31, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 13136982, "likes": {"liked": "— Location", "disliked": "— Rooms and staff"}}, {"rating": 5.0, "title": "Location is Everything", "text": "Location can't be beat. Directly across from Quincy Mkt & Fanuel Hall. Short walk to North End and more than one T stop. Had a room overlooking Quincy market with the balcony..it was abit noisy---but think about where you are located and what would you expect. Upon check-in they gave us a pent-house room even though we had reserved the \"balcony\" when I called to Complain they immediately changed the room to a front balcony and apologized. My only complaint was with the restaurant and that was a matter of somewhat slow service, However, they had the best English muffin I've ever tasted.", "helpfulness": 1, "user": "SunnyB-N", "date": "July 1, 2004", "id": 2249062}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Millenium last week, and we were very pleased. The staff is very good, the rooms well appointed, and the location is great.", "title": "Nce property, GREAT location", "helpfulness": 7, "user": "Goneonvacation", "date": "March 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4588254}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "The property is next to Fanueil Hall and Quincy market, and two blocks from the North End. The Quincy market has tremendous food kiosks and pubs, and there is a comedy club upstairs. The North End has some of the best Italian restaurants that you will ever find. The North End is also very historic, with Old North Church, the Revere House,...", "title": "Great hotel, Great Location!", "helpfulness": 13, "user": "ziggyhughes", "date": "February 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4442643}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "A piece of advice - don't bother with a car. We had been skiing, so we had a car with us. We should have returned it, as the location of the hotel makes it easy to walk, and parking is $40 per night.", "title": "Perfect Location", "helpfulness": 9, "user": "flower1126", "date": "January 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4386893}, {"rating": 4.0, "title": "Very Satisfied", "text": "I enjoyed the Millenium, and we will stay there again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 29, 2005", "id": 4310475}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "We have just arrived back from a four night stay in Boston at the Millenium Hotel. In all we were very pleased with the hotel. We had a lovely big room on the seventh floor with a balcony and sofa and a separate dressing area. The view on this side of the hotel was not fantastic as it overlooked what is left of the Big Dig however it was quiet. Service was very good and rooms were cleaned thoroughly every day. Having read previous reviews some customers have commented on decor and carpets etc - while it may be quite chintzy in places I dont go on holiday to check out the standard of the carpets as I have more important things to do like enjoy myself!!", "title": "Hotel Needs Work Despite Great Location", "helpfulness": 5, "user": "Manoavalley", "date": "December 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4300246}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We spent a three day weekend at the Millenium last weekend, and had a wonderful time. I would say that the previous 6-8 reviews here are right on the money.", "title": "The perfect place to stay in Boston", "user": "kelb", "date": "August 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 77748935}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We managed to score our room at the Millenium for $200/night which was a bargain considering the quality of the hotel and the amazing location. You could stay here and never use a car and have an amazing time in Boston. In fact, if you are interested in nightlife, you can have an amazing time here without venturing more than three blocks from the hotel!", "title": "Great location and room", "helpfulness": 1, "user": "MM3_HartfordCT", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77558868}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If you are willing to endure a ten minute walk to the North End, you will find a limitless array of great restaurants.", "title": "Pros and Cons", "user": "NJTink", "date": "August 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76680052}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "The subway stop is right around the corner, and will take you to locations such as Harvard or the Charles River in a few minutes.", "title": "Best hotel in Boston - everything is in walking distant from this hotel", "user": "TurtlemomMiami", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75667600}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "We hold off the fifth star for the following reasons...", "title": "The best I ever stayed in....", "user": "Stevo49", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75204446}, {"rating": 3.0, "stay_parameters": "Stayed October 2010", "text": "Although a little on the high end for the current hotel market, what this hotel has to offer is location, location, location, not just in relation to the tourist areas like Faneuil Hall/Quincy Market and the wonderful North End Italian section of Boston, but it is in walking distance to T stops, bus routes, train stations and downtown. The staff was just adequate, nothing great. Although the concierge had sent a pro forma email before our arrival, no one responded when I asked questions back. We had to figure everthing out ourselves. The hotel is clean, comfortable, with small rooms and small windows. When I was given a near windowless, dark room because of late night arrival, the front desk was very accomodating about moving us the next morning. The price could be lower for what you get, but that factor is outweighed by the convenience of its location. The bar tender at the in house restaurant was very accomodating and the ambience very friendly.", "title": "Adequate, well located", "user": "vanholt", "date": "October 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83617592}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I am a Marriott fan, but the reviews of the affordable Marriott's were not that great. So we decided on the Millennium. We paid an average of $266 per night and higher-end Marriotts were in the $300 range.", "title": "I will stay here again!", "user": "Celeda51", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83503251}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We took the T from the airport to the hotel for $2 each - a piece of cake! Email me if you need help doing this. It will save you about $30.", "title": "Wonderful!!", "user": "DDMM70", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83208441}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It is in the middle of all the action; plenty of food, bars and shopping. Lots of Irish Pubs and North Boston (Little Italy) is only a few blocks away. Most of the tours originate near the hotel. Our room was cozy, clean and decorated nicely. The mattress and pillows were really cozy & comfy. Paid $9.95 per day for WiFi.", "title": "In the middle of it all!", "user": "MNtraveler47", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83178712}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We hope to return next year when FSU plays Boston College.", "title": "Absolutely perfect!", "user": "njoytravel3333", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83165200}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I wanted to get away for a night to shake off cabin-fever. At the last minute, I cruised the web and found that the Millenium had a room that night for $130! The hotel is right across the street from Quincy Market/Fanueil Hall and just a short walk to the North End (Italian area). We could even see Haymarket, where vendors of vegies, fruits, assorted cheeses and such, gather outside Friday-Sunday. The prices are a steal for you bargain hunters. Pomegranates for 50 cents!", "title": "What a location!", "helpfulness": 2, "user": "FraminghamBill", "date": "January 4, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 12322123, "likes": {"liked": "— location", "disliked": "— expensive parking"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is hard to find from the outside, a pretty non-descript brick building. You drive into an enclosed rotary at the main entrance to check in and to valet your car if you want. We did. This convenience costs $40 for overnight parking till 2PM the following day. We ended up leaving the car till about 5PM the next day for an extra $12. We just didn't want to deal with parking. But, if you want to save some money, you can try other parking nearby. It will not be cheap, by any means, but it will be less expensive than leaving your car with the hotel. Or you can take the train to the hotel and ditch the car altogether. Boston, especially this area, is a walking city.", "title": "Great Location, Friendly Straff, Nice Hotel", "helpfulness": 1, "user": "intrepid411", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12172276, "likes": {"liked": "— location", "disliked": "— homeless nearby"}}, {"rating": 3.0, "title": "Wants to be a better hotel....", "text": "The lobby was very tasteful and mellow, the four star rating showed. There was a concierge immediately available. The front desk was a place you could sit at, very nice. The employees, including the valets, were very courteous and friendly. They really added to the stay. There's a nice bar, with a special martini of the week. We peeked into the restaurant but didn't eat there. The North End called to us.", "helpfulness": 2, "user": "capecodphotog", "date": "December 28, 2007", "id": 12016757}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I have read that the rooms vary a lot. Ours showed its age, particularly in the rug, but the furniture, drapes and such were of good quality and everything worked. There was a large floor to ceiling window. Ours was a handicapped room by chance. So there was the occasional mark on the wall from a wheel chair, nothing more. The bed was low, nice to see since it amazes me how many handicapped rooms have beds so high that it would be very difficult for a person in a wheel chair to get into bed. Everything a traveler needs was there, an easy outlet for your laptop, a safe, an extra pillow, a robe. Most surprising was that the tap water was delicious! We never drink hotel water, but always try it. This water was great! It was ice cold and nicely aerated, really a treat. Free, drinkable water!", "title": "Price and location", "helpfulness": 3, "user": "baxwelll", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12015488}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "In the bath, there was a walk-in shower, a heat lamp, good brand toiletries, and very absorbent towels. I have long hair so I notice the towels. I didn't have to use the hairdryer.", "title": "excellent staff", "helpfulness": 2, "user": "cherry2", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11535215, "likes": {"liked": "— location", "disliked": "— dated decor (but very clean)"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Although many have said that the location is great, I was disappointed to find the area closed down early. For example, no Starbucks stayed open pass 9pm (unlike the Harvard area which stays open until 1 am). We are staying in Room 710 which has a nice side view of Faneuil Hall to the right, and below, I see the merchants of Quincy Market selling their produce. The room has a European feel with its French glass door leading out to a tiny balcony with flowers overhanging. For some, the noise from the street would be a bother even when door is closed. The bathroom is the best part of the small room. There is a separate boudoir from the toilet/shower room and the large walk-in shower has a GREAT spray wand. The walls to the room must be thin as several times, we were jolted by the banging on the wall; I guess we were a little loud. Checking in to the hotel was fast but lacking in human connection. The bed looked inviting but turned out not very comfortable, especially after finding a bug. Overall, I would have preferred to stay in a different hotel where I am treated as important and not just a number. We did not experience this in NY and Maine.", "title": "European Quaint", "helpfulness": 2, "user": "SexyMom!", "date": "June 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 132590148}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I recently booked a one night stay at the Millennium for our wedding anniversary, a fact that I mentioned in my online booking. We had dinner reservations in the North End so it was a perfect location. Upon check-in, we were told that we had been upgraded to a superior view room with a small balcony overlooking Faneuil Hall and wished a happy anniversary. We thought this was nice enough but when we got to our room we found a chilled bottle of champagne and strawberries, petit fours and brownies. It was awesome, so above and beyond and we will totally go back again.", "title": "Awesome service, great location", "helpfulness": 2, "user": "renee d", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132336489}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The room itself was very nice. The carpet could use some updating but other than that everything was in really great condition. The view was amazing, albeit the location proved for some noise late night but nothing the white noise app on my iPhone couldn't drown out. I would definitely go back and I would confidently recommend Millennium to anyone I know. Well done, service staff, you've gained some true fans!", "title": "Not too shabby", "helpfulness": 2, "user": "Hartman23", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132261749}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Pros: Location Location Location. Boston, compared to other major cities is on the small side, so getting around is not a problem at all. Located in the North End neighborhood, it is more than convienient to make way to any popular destination. Its location next to Quincy Market is perfect with a never-ending plethora of shops, eateries, pubs and musuems.", "title": "Ants in my pants????", "user": "romancewritermmr", "date": "June 18, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 132235283}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "The staff are very nice, I did not encounter any negative attitudes during our stay. From the Behllhops to the Cleaning staff, all were professional and kind.", "title": "Good location, average and clean rooms, good service. Preferable for touristic stay. Oner Ayan", "helpfulness": 1, "user": "ONER A", "date": "June 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 132000681}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Walked in, no reservations on a Wed night. We were not planning to spend the night in Boston but were exhausted at 10pm after a long day of sightseeing and decided to get a room. We were a bit bedraggled from a long day of touring in 95* heat. We had no luggage and were carrying a bottle of wine not finished from dinner. We probably looked a little scary & rough but were politely escorted to the side door in an alley because of lobby construction. We were turned down immediately upon asking if a room was available. We were told they are busier on a weeknight than on the week-ends (huh?). The front desk clerk began listing hotels that had availability along with the prices of the rooms. When we said price was not an issue, he continued to quote prices. We politely thanked him and left, vowing to never try this hotel or any Millenium properties again. Checked their website the next day - rooms were available.", "title": "never again", "user": "twosoups", "date": "July 14, 2008", "detail_rating": {"front_desk": 1.0, "value": 3.0, "location": 4.0, "service": 1.0}, "id": 17866736}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "What a great stay, we were in Boston for the 4th of July. Great location. The hotel is undergoing a huge renovation, we were in one of the newly done rooms, beautiful job. Great bathroom and shower, excellent linens and pillows. We had a balcony over looking Quincy Market and Faneuil Hall. The hotel staff were so welcoming and helpful, the concierge always a great help and happy to help. Would stay again.", "title": "Excellent service", "helpfulness": 1, "user": "sanvanoak", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 17806946, "likes": {"liked": "— Location, beautiful clean rooms", "disliked": "— n/a"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Hotel is under renovation and it is an absolute mess. It's noisy and the whole place is boarded up with plywood. I was horrified by the sight of the place -- I've seen many hotel remodels, this is definitely the worst.", "title": "Stay Somewhere Else", "helpfulness": 1, "user": "frequenttraveler0338", "date": "June 25, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 5.0}, "id": 17214519}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "The front desk staff is rude - wow, the service was bad. When I expressed my dissatisfaction, one lady - tall w/ grey hair, had the nerve to laugh in my face.", "title": "very pleasant surprise!!!", "user": "moneyaware", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16540205}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The only thing this hotel has going for it is location - do yourself a favor and stay somewhere comfortable with friendly staff who care about the customer experience. Millenium certainly doesn't -- I tried to call their Corporate Offices to tell them about my experience and they let all the calls go to a general voicemail box with no access to a live human.", "title": "What a dump !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 2, "user": "byuby5", "date": "May 9, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 15826983, "likes": {"liked": "— leaving", "disliked": "— everything"}}, {"rating": 4.0, "title": "Millennium Hotel and Surrounding Area", "text": "August 2005 brought us the luxury of spending the night at the Millennium Hotel in Boston. With a view of the North Church, Fanuiel Hall, and Quincy Market we were ready to re-discover Boston the capital of our home state. The \"big dig\" has allowed the city to do away with the old, ugly overpasses that literally broke the city into pieces. Now you can see the North End and the Boston Garden (new name--can't remember!). Everything seems within walking distance. We walked to the North End where there are no less than 100 restaurants (maybe a small exaggeration) to choose from. There was a parade in the streets the night we were there, which made it even more festive. Food galore and everything was delicious. Boston is a great city for all kinds of visits. Great for children, lots of history, excellent shopping, catch a sports game, just lots of fun. No limit of things to do and see.", "user": "pahhobbs", "date": "December 20, 2005", "id": 4252298}, {"rating": 1.0, "title": "Don't Waste Your Money...Go Somewhere Else", "text": "Just within the walking distance of the hotel, actually seems like a circle, there are restaurants and bars that really give you the flavor of Boston and New England. They LOVE their sports teams and you can catch the fever at anyone of these places while having a cold beer and a cup of chowder. You can stop and have a drink at a high class joint, or stop in a the dive next door. There really is something for everyone.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 12, 2005", "id": 4236037}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Very, very disappointed. Electrical outlet in wall didn't work so lamps and tv and other items all running off extension strip. Appalled at the limited selection of tv channels. I have gotten a better selection at a Holiday Inn or even a Motel 6. There wasn't even a coffee maker in the room and I never did find an ice machine, even though there is an ice bucket in the room. If I had to pay the bill myself I would have moved to another hotel, but the meetings I was in Boston for booked the room.", "title": "My Boston Favourate", "helpfulness": 6, "user": "DowntownMinneapolis", "date": "November 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4126595}, {"rating": 1.0, "title": "I Will Never Stay There Again", "text": "I also repeatedly informed the front desk that I would contact them if, and when I needed the room serviced but kept getting notices about needing to call housekeeping and then one day they went in the room even though I had the do not disturb sign on the door. Also the pillows and bed were very lumpy.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4066029}, {"rating": 4.0, "title": "Great location", "text": "About the only thing going for it was the location and the concierge was very nice...but I don't think all that money was worth it when I could have stayed elsewhere for less money and easily taken the T into town. Next time I'll know better and I'll go elsewhere.", "helpfulness": 3, "user": "kittykai", "date": "October 24, 2005", "id": 4049435}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed 4 nights at this hotel at the end of April and were very pleased. Not having visited Boston before it was a bit of a shot in the dark as regards location but it couldn't have been better. It was very close to the Italian part of town, right opposite Faneuil Hall and Qunicy markets and within walking distance of many major sights. The Freedom Trail went right past. The room was spacious and very comfortable. The only negative, I suppose, was that the air conditioning was quite loud but we just turned it off at night.", "title": "Great Position", "helpfulness": 1, "user": "lehill", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131991870}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Great location right across the street from Faneuil Hall, but I deduct a star because in the 2 days I was there, staff couldn't get wifi access going, which is critical especially on a business trip", "title": "Great location, points deduction for faulty wifi", "user": "mschoe64", "date": "June 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 131991080}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I stayed here recently for two nights. The location of this place is very good. It is walking distance to Quicy and the harbor.", "title": "Niceeee but...", "helpfulness": 1, "user": "Henry J", "date": "June 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131239034}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I stayed in room 626. Even after a quick shower, the floor outsite the shower area floods. It's a shame because the bathroom is sooooo nice. The shower system is really nice.", "title": "Amazing Location but that's about it!", "user": "jmp660", "date": "May 31, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131017121}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The bed is nice and firm. The entire place is very clean, no funky smell.", "title": "Money well spent", "user": "Mlaporta", "date": "May 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131009094}, {"rating": 5.0, "title": "Very central and in walking distance of everywhere", "text": "Spent a weekend there as a solo traveller.", "helpfulness": 5, "user": "Tim_with_Suitcase", "date": "August 20, 2004", "id": 2478764}, {"rating": 5.0, "title": "It was great!", "text": "Superb, clean, comfortable and large rooms.", "helpfulness": 3, "user": "spikeHenryville", "date": "July 26, 2004", "id": 2323314}, {"rating": 4.0, "title": "Not Bad!!", "text": "Staff friendly and helpful.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 20, 2004", "id": 2310471}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I stayed here for 3 days prior to a cruise and really enjoyed the hotel and surroundings. The hotel is just a short cab ride from the airport and it sits in the most ideal location. The check in was quick and easy and the room large and comfortable with a small balcony. The hotel is directly across the street from Faneuli Hall and Quincy Market. There are 2 Subway stations close by and the Freedom Trail is about a block away. The restaurant and bar in the hotel were outstanding, although a bit pricey, it was well worth it. Great spot for a night cap before retiring to bed. There are many nice bars and restaurants within walking distance.Really no need for a car in this area unless you are planning a trip outside the area. Great pre or post cruise hotel for cruises out of Boston Harbor. I truly enjoyed my stay here and would not hesitate to stay at this hotel on my next trip to Boston.", "title": "Excellent Location", "helpfulness": 1, "user": "bpharo", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133697928}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I stayed here for a job interview and it could have been any better. The rooms were big and mine overlooked the new park near the North End. The beds were very comfortable and the staff was outstanding. It is close to everything like Fanuel Hall, State House and the Government Center T stop.", "title": "Excellent stay", "helpfulness": 1, "user": "Inolan06", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133530120}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "A few minutes cab ride from the airport and you arrive at the door of the Millennium Bostonian. Our room had a small balcony with a view of Faneuil Hall and Quincy Market (which are directly across the street). There are two T (subway) stations within a few minutes walk. The historic Bell in Hand Tavern and Union Oyster House are literally around the corner. Additionally, the aquarium as well as the North End sites and restaurants are easily walkable. The location cannot be beat.", "title": "Location. Location. Location.", "helpfulness": 1, "user": "tarheelblue89", "date": "June 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132917859}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The room was clean and comfortable, although a bit smaller than I would expect considering the room rate. So, was it worth the price? For my family, the convenience more than compensated for the inflated rates. I would definitely consider the Millennium on a future trip to Boston.", "title": "Perfect hotel!!", "user": "LoriTDAR", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132813966}, {"rating": 2.0, "title": "Disappointed!!", "text": "My family recently stayed three nights at this hotel. The location is wonderful! We loved looking over Quincy market and enjoyed the large, comfortable rooms and bed. Staff was extremely friendly. I will never stay elsewhere again when in Boston!!", "helpfulness": 3, "user": "sheckleremporium", "date": "June 24, 2012", "id": 132671893}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Two 30-something couples from New York/New Jersey just returned from a trip to Boston -- and we spent two nights at the Millenium thanks to a great deal due to construction at the hotel.", "title": "Location, Location, Location", "user": "LeeLeeGOP", "date": "August 31, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 19559831, "likes": {"liked": "— Location, Great Rooms", "disliked": "— The outdoor veggie market -- and the stench!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Even with the construction and a less-than-appealing makeshift reception desk, the stay was quite nice. The rooms were fabulous, with a gorgeous bathroom and a wonderful (but small) porch facing Fanueil Hall.", "title": "World’s Best View (if you don’t mind hammering at 6:30 AM)", "helpfulness": 2, "user": "HarryfromLA", "date": "August 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18792531, "likes": {"liked": "— Location, Rooms, Views", "disliked": "— Not much"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Our only true knock is that on Friday and Saturdays there is a long-standing veggie market that sets up right in front of the hotel and above where our rooms were situated. Its hard to enjoy your porch overlooking the city when you are greeted with the stench of rotting vegetables and fruit. Not for the faint of smell!", "title": "Fantastic stay at the Bostonian!!!", "helpfulness": 1, "user": "Torontotraveller13", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18324768, "likes": {"liked": "— staff!", "disliked": "— currently under construction..."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Other things to note -- if you don't valet, feel free to at least unload your bags on the side of the road. The valet failed to mention that to me when we came to ask where we should park. We didn't want to valet and used the lot across the street. When we came by with our large suitcases, he remembered that we could have at least unloaded.", "title": "Great Room", "helpfulness": 2, "user": "JustTheTwoOfUs2010", "date": "July 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18300452, "likes": {"liked": "— The room", "disliked": "— Under construction"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Also, make sure to let the hotel know that you are parked across the street. Although the valet told us to go there, they ended up being concerned that we could leave our car there overnight. They made a call and learned it would be ok, but I am supposing that they don't usually deal with non-valet drivers.", "title": "Beautiful Hotel, Fantastic Staff, Great Location", "helpfulness": 2, "user": "phillyshell", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17889879, "likes": {"liked": "— The staff service and location", "disliked": "— housekeeping"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "This hotel is right next to Quincy Market.. Although it may not look like much on the outside, it has just gone under a massive rennovation and is now a modern looking hotel from the inside.", "title": "Great Location, Huge Rooms", "user": "Daniela P", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130980301}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel rooms are generous sized. there is a walkway that opens up into a big bathroom with oversized shower. Little bathroom amentites like cotton buds, cotton balls, mouthwash, shampoo, conditioner, body moiseteriser and body wash are available. So is a hairdryer.", "title": "Enjoyed our weekend stay", "user": "czbarlow", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130954185}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "It may get a little noisy at night, depending on the foot traffic outside, but you can't complain about that as you're in a prime location.", "title": "Excellent Stay in Boston", "user": "AlRisa283", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130897478}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Walking distance to Hannover Street (little italy) which is fantastic. The best canolis I've ever had in my life can be found at Mike's Pastry.", "title": "Great Location!", "user": "Sherdary", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130686910}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Was able to check in early on Saturday. The reception desk was very helpful and friendly.", "title": "Great place to stay", "helpfulness": 2, "user": "Ryan S", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130643655}], "location": {"country": "United States", "city": "Boston"}, "stars": 4, "variance": {"poor": 47, "average": 76, "very good": 292, "terrible": 32, "excellent": 330}, "aka": "Hotel Millennium Bostonian", "slim_ranking": 0.363636363636, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The Bostonian's chief asset is its prime location adjacent to Faneuil Hall."}