{"user_rating": 3.0, "review_count": 728, "name": "Millennium Hotel Cincinnati", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2006", "text": "Things I liked:", "title": "ugh, terrible stay", "user": "ttcabb", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 5.0}, "id": 7331927}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "* friendly and efficient valet staff", "title": "Good Overall, always room for improvement", "helpfulness": 2, "user": "panama0520", "date": "April 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7327352, "likes": {"liked": "— Location", "disliked": "— size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Things I disliked:", "title": "Great Location and Service", "helpfulness": 1, "user": "TJMingon", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7231179, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "* the faucet handles that were on the verge of falling off", "title": "A great place to stay if it is what you are looking for...", "helpfulness": 6, "user": "Dhritarastra", "date": "February 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6731018}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "* the random banging noises in the middle of the night", "title": "NEVER, EVER Again!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 4, "user": "nodak1", "date": "January 2, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 6540616, "likes": {"liked": "— leaving it", "disliked": "— value"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at this hotel while attending the Cincinnati Wine fest. We arrived on a Saturday around 6 pm. Our event started at 6:30. We used the hotel valet for 20 dollars; seemed a good idea because the place was packed! We found out that there were many things happening this weekend, including the half-marathon. There was a very, very long line at check-in, but my husband was out of there in less than 10 minutes. We were impressed! We booked the hotel at the website for 89 dollars, which was a steal!", "title": "Millenium was great", "helpfulness": 8, "user": "LLindaC", "date": "March 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4735982}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "Our room was on the 23rd floor. It had a view of downtown. The room was very clean with a modern touch, large oak bed, modern glass desk. The only negative was that the windows were very dirty. Given the extremes of this winter, it was not an issue! The bathroom was fine, it was clean. We both agreed that this king bed was great! Sheets were quality grade and mattress was comfy. There was a hair dryer, iron, internet, and coffee maker. It was a quiet room and we were totally satisfied with it.", "title": "unhappy in Cincinnati", "helpfulness": 3, "user": "ginanene", "date": "March 11, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4600410}, {"rating": 4.0, "title": "Staff made it better!", "text": "We had both a late dinner and breakfast at the first floor restaurant. The dinner was very good- the appetizers were HUGE! We had an attentive waitress, Dee Dee, who was so sweet and energetic. GREAT service at dinner and at the breakfest buffet in the morning by Eliza. It seems to me that this hotel is trying very hard to please guests. The service was excellent. The only negative thing I can say, and this is huge for me, is that they allow smoking in the first floor restaurant. Other cities have smokefree policies, clearly this is not the case here. It was smoky in the lobby and restaurant. If you are sensitive like me, too bad. I don't know about other places, but it's probably the same everywhere right now in the city.", "helpfulness": 8, "user": "EmmaJames", "date": "February 12, 2006", "id": 4455031}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "This was a great choice of a hotel for people using the Convention Center, or anywhere else downtown linked by the extensive walkway. We only had to go down the elevator and hall to reach our event. Very nice! We were very pleased with our stay here!", "title": "Fabulous", "helpfulness": 5, "user": "NMurphy", "date": "January 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4390060}, {"rating": 3.0, "title": "Easy to get to from the Airport", "text": "We were unhappy with the small rooms. The bed was uncomfortable and the room had a bad odor.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 19, 2005", "id": 4251775}, {"rating": 4.0, "title": "Great experience", "text": "After reading the Cincinnati hotel reviews, I was disappointed to learn that my accepted $40 Priceline bid for a Friday night stay was for the Millennium. However my experience staying there could not have been better. We checked-in early around 3pm, and were treated very courteously, and were given keys to our room. The room was in the south tower on the 12th floor, and it was very spacious with 2 double beds. The bathroom was on the small side, but clean and adequate. The room looked like it had been refurbished recently, and it was in very clean and in very good condition. We used the parking lot across the street for $8 daily. This was our third Priceline experience with a hotel in downtown Cincinnati in the last couple of years; I’d say the Hyatt was a touch better than the Millennium although both were very good, and only the Hilton Netherland Plaza was a disappointment. I’d be very happy to return to the Millennium on a future visit, especially for such a low price!", "helpfulness": 1, "user": "ats262m", "date": "August 21, 2007", "id": 8466856}, {"rating": 1.0, "title": "Filthy room!", "text": "This hotel is extremely overrated. The lobby may appear clean and spacious, but the rest of the hotel is disgusting. Our room needed a serious cleaning. The wallpaper was dingy and torn, the tub was stained and the carpet was actually sticky! For the price, we will shop elsewhere and recommend that you do the same.", "user": "UofMom", "date": "August 21, 2007", "id": 8465538}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel is right off the interstate with good access coming and going from any direction. It was only two blocks off of I-75 and 6 blocks from I-71 I was hesitant about the $20 for Valet parking, but It was a pleasant convenience for us. The middle aged guy in charge was friendly, professional and did a good job. We used them 4 times in a one day stay.", "title": "Fast in and out of town", "user": "eatmoresalmon", "date": "August 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8460913, "likes": {"liked": "— Price/location", "disliked": "— no free breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We booked on Priceline for $49, after all of the other northern Cincinnati regions were too costly. We were assigned a room on the 18th floor. The Elevators were fast and there weren't many folks crowding into them at all. We were there on a Saturday Night. We were short a towel (we had 5 in our party) and one toothbrush so I called down and shortly 4 bath towels, some hand towels and wash rags were delivered and a toothbrush, as well as a little bottle of Scope. We slept well even though my wife and I are used to a king. We only had a full, but it was a very comfortable full sized bed. The AC kept the room nice and cool like we like. We asked for a late check out and were told we could stay until 1 pm with no additional charge. That was just perfect as we came back after church, changed our clothes and checked out in time to get back to the Tennis finals. One final nicety was a little fold-out map of downtown Cincinnati that was attached to the room key envelope. That helped a lot with our 4 times in and out of the hotel. Can't beat the price for the service and location.", "title": "Once again, glad I didn't listen!", "user": "webbles", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8457570, "likes": {"liked": "— Unlimited hot water, great water pressure and great food!", "disliked": "— The pool did get a little crowded. Also it is was hard to find a happy medium with the ac unit."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Once again I am glad that I did not rely on the reviews listed here. I had a wonderful time at this hotel and have no complaints. At check in the lady was very nice. We got to our room and it was very clean, smelled good and had no visable misuse. The food at the \"Bistro on Elm\" was great! There was very little noise that could be heard. The only time that I heard our neighbors was when they were coming in the door but once they were in their room I heard nothing. We visited their pool on several occasions and it was nice. It was clean and it was not overly chlorinated. Over all I had a wonderful time and I would stay here again.", "title": "What a disappointment!", "helpfulness": 1, "user": "etoiles78", "date": "August 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8447062, "likes": {"liked": "— Free internet, speedy checkout to get away ASAP", "disliked": "— Stained floors, dirty walls, and napkins in room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I decided to give Hotwire a shot for our stay in Cincinnati and got the Millennium for $45 a night which was a great price for the quality of this hotel.", "title": "Decent Hotel but definitely not like other Millenniums", "helpfulness": 2, "user": "MJ24", "date": "August 11, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5601512}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Luckily when we checked in we had missed all of the day's craziness of long check in lines and non working computer systems. Apparently they couldn't give guests room keys.", "title": "Stay away...", "helpfulness": 6, "user": "sfparker", "date": "August 5, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5557767, "likes": {"liked": "— Location to Stadium/Attractions", "disliked": "— Rude Management/Screwed-up Reservations"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The front desk clerk was pleasant to us but busy complaining to her co-worker about having worked 12 hours and being exhausted. I can understand her frustration but these types of conversations are better left to be discussed in the back office.", "title": "Mostly good grades", "helpfulness": 2, "user": "Pelle311", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5457970}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "My boyfriend kept saying for the duration of our stay that the lobby had a \"funky\" smell. I must say, it was an unusual smell, one I couldn't quite put my finger on.", "title": "very dirty", "helpfulness": 1, "user": "kindergal", "date": "July 8, 2006", "detail_rating": {"cleanliness": 1.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 5439312}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Our room was fine, clean and comfortable so I'm guessing we must have been staying in the newer part of the hotel. Our iron broke and after two calls to housekeeping received a new one (within 20 min). We too were there for the sights (Newport on the Levee and the Reds game). Not much going on around the hotel but that's to be expected since it was a holiday weekend.", "title": "Had a Great time !", "helpfulness": 3, "user": "crazyxbabi143", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5424044}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "I would not recommend this hotel to anyone. previous reviews of waiting in line and dirty rundown rooms is true. Something I would not even want someone I did not like to experience.", "title": "Worst experience ever", "helpfulness": 1, "user": "corinne k", "date": "July 4, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 5423414}, {"rating": 1.0, "title": "worst experience ever in the Millennium Hotel in Cincinnati", "text": "If you are checking in avoid a gentlemen Kendal. Rude, incompentent.!!!!!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 4, 2006", "id": 5422478}, {"rating": 2.0, "title": "Millenium Hotels: Consistency is lacking with this company", "text": "Many of us checking in could not get our reservations once hour 75 min of waiting in line was up. After almost a 2 hr event at check in when we got to the room it was not that clean. When a chair was moved we found a dirty sock from a previous guest. We were there for a reds game and after the long wait had to leave right away for the game and checked out as soon as we got up. I would not even stay here if they gave me a room for free!!!!!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 23, 2006", "id": 5377821}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "I was really disapointed on hotel service on this trip. I had made reservations through internet and price was fair( at least 2 months prior). I had made plans of how I was going to spend my 2 night stay (2 nights was enough)! I got there with my family (drove with 4 adults) on hotel grounds through front for luggage drop off...unfortunately, I got stuck in traffic couldn't move my car (the valet parking was so disorganized we didn't know what was going on)!! Meanwhile I had a family member waiting inside to check in realizing a long line and waited at least 2 hours to check in. We were so frustated and the car was still out there stuck in traffic we decided to use valet parking ($20/a day). The line was moving very slow which I believe is through not enough staffing (5 desk available but 2 only open). To my surprise during the wait in line 2 different guest were having problem with their reservations and this delayed more the line (this was a bad sign one which I didn't pay attention to). We gave our luggage to the bell boy giving us a ticket and said as soon as we checked in they would bring it up to us. When we were in our room we called for the luggage and as they came up they brought us the wrong luggage...then when they came back 2nd time they had lost one luggage and couldn't find it. We had plan to go to the aquarium which you could purchased tickets there. I asked at check in if we could purchase at that time he said sales manager not available and would be in next day..no problem of getting them ( I reassure him if that was the case and he said no problem). Next day of wanting to purchase tickets manager said he did not have any giving the excuse of fedex not coming in( I would not have minded then if they would have told me they didn't have any but it's the dishonesty and rudeness that made me mad). I gave the same courtesy back and left upset. I came back from my sight seeing finding my card key being disactivated luckily we found housekeeping and they opened the room without checking ID. We decided to rest a little in the room and called house keeping for 2 coffee cups missing and if they could bring it up(we waited for half an hour so I called again)..she answered me we a \"Listen, I told you I'm busy and as soon as I have someone they'll be up.\" I really don't want to make this any longer ...so to all just wanted to give this info and hope you make the right decision when making a reservation in this hotel. I will never come back there that's for sure!!!!!!!!!", "title": "We stay here all the time", "helpfulness": 1, "user": "Jillsephine", "date": "June 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5327231}, {"rating": 5.0, "title": "Great hotel experience at Millenium", "text": "I had the pleasure of staying in a sister hotel in Minneapolis and absolutely loved it! Great service, decent food, beautiful room! I learned the hard way that with the Millenium group all hotels are not created equally. Of course, there was a considerable wait to check in but once I got the task squared away, I looked forward to taking a nap in a great room and settling in. Poor me. The entire floor was really hot and smelled like wet carpet. Once I got to my room, I noticed several things: 1. It was very small and they were still using those antiquated bed spreads (of course this was not an issue in Minneapolis, even Hampton Inn has moved away from this to down -or downlike- comforters). 2. The room was very dark and had gloomy look to it. 3. My bathroom floor had several stains, my soap dish had brown stuff and hair in it, and the tub and sink was cracked in several places. As if this wasn't enough, I noticed that I was stuck with a connecting room (something that Milleniums are known for getting rid of when they take over hotels). After asking for a room change, I was placed in a non connecting room with a few less cracked amenities, but the door lock looked as if someone had taken a crowbar to it several times. Although the staff was always polite, I found it disappointing that with over 820 rooms there was always only one person at the check in desk. I thought that for over $100 I was getting a real bargain; but it looked no different than the $60 hotels only 2 miles away. Not worth the money--trust me!", "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5288354}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I have stayed at the Millenium on three separate occasions primarily because my company has a location near the hotel. My most recent trip was May of 07. I am shocked that out of all the reviews I have read, no one mentions the most obvious thing that may effect a visitor, the hotel's style. If you dislike modern design, you will hate the Millenium. I personally prefer hotel's with a classic style and posh comfort. I will explain more later.", "title": "Definite Pros and Cons!", "helpfulness": 1, "user": "Mikeysgirlrachel", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7614487, "likes": {"liked": "— Service, location.", "disliked": "— Hard beds and modern style"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Upon check-in, I was greeted kindly by the valet and the clerk at the desk. I had requested a room below the fifth floor and was told they were out so she stated she would put me in an executive room on the fifth floor. No problem. If you like Modern, you would've loved the room. It was very large and had a huge california king bed. The bed however was hard! The pillows were flat. The sheets had small rips and cuts too. Yuck, But they were clean and the room overall was clean. It had a huge desk and a nice sitting area. The bathroom although really cool to look at (Had lights built into the glass shelving) only had an avergae size tub and thin towels. That was dissapointing. The layout of the room was really nice and it looked like something out of architectural digest. Personally I prefer pillowtop mattresses, comfy pillows and nicer bathrooms.", "title": "Pleasant stay", "user": "JRossiOhio", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7605765}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I soon realized I did not have wifi and I went ot he desk to get a cable and saw a huge line! The hotel's maintance man saw me standing and looking around and he offered to get me one free of charge. That was nice.", "title": "Excellent service, great stay!", "helpfulness": 1, "user": "dm713", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7546759, "likes": {"liked": "— Great service, very friendly staff", "disliked": "— Goofy bathroom amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I had room service for breakfast and was very happy with it. They actually added more food than I ordered and it was delicious. I paid cash and as soon as the deliverer left I noticed he forgot to leave me a receipt. Getting this is now tedious since when you call the hotel they demand you send in writing a request. I was told by other co-workers that they often forget to give receipts. Beware if you are traveling for business.", "title": "Nice stay at the Millenium", "user": "BuckeyeNWOhio", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7430189, "likes": {"liked": "— Great location, close to Great American ballpark", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I requested someone to bring my bags down the day I left and a nice guy came up and had to grab my mess and then he even offered to go get my car for me and put everything inside. When I went down, my car was still not out front but the guy stood there waiting. I was surprised a good fifteen minutes had passed. Upon my car being brought around, I handed the valet two dollars and he actually looked at it as if to say, \"That's all?\" The guy who waited and delivered my luggage was rewarded well and the valet rolled his eyes at his counterpart. That got me angry.", "title": "Great stay!", "helpfulness": 2, "user": "GoTribe", "date": "April 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 7342492, "likes": {"liked": "— Proximity to athletic venues.", "disliked": "— $20 valet parking"}}, {"rating": 3.0, "title": "Not as bad as some say...", "text": "I booked this on a popular \"name-your-own-price\" site. Got it for $50/night. I believe we stayed in the South Tower, which is the side that has not been renovated. It was not the BEST hotel I've stayed at but I have to say it was not as bad as some of the reviews I've read. We stayed here for one night, and it's perfect for something like that. Not the best hotel for a week long vacation, but for a few days its fine. Anyone who has ever vacationed in a major city knows, it's hard to find ANYWHERE to stay for $50/night. So for the price it was great. $20 to park or pay $15 for the lot across the street. Bell staff rocks, they were very friendly and helpful, as soon as you pull up, they're there to help, better then the Hiltons I've stayed at. I like the gift shop which was stocked with snacks and magazines at good prices. The bathroom needs to be renovated, I didn't feel like it was dirty, just run-down.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5237493}, {"rating": 1.0, "title": "Would not stay again.", "text": "This hotel gives a nice lobby appearance, however when you get to your room that", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 28, 2006", "id": 5228737}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "all changes. We had two seperate rooms with family. Both were not clean!! There were large cobwebs in the corners, our desk chair had something on it I don't want to know what it was. The tub was dirty. We decided to cut our trip short and stay one night instead of two. I agree the price was very good. I'll pay more next time to stay in a hotel that is clean.", "title": "A Great Stay at the Millenium", "helpfulness": 4, "user": "Dave148", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5187206}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We stayed for two nights beginning May 19. We got a great $63/night rate from the hotel website and Amex. This was our second stay at this property.", "title": "Very nice hotel for price paid", "helpfulness": 4, "user": "Troy S", "date": "April 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4973321}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Even though we checked in during the Friday afternoon rush hour (4:00) check-in was prompt. Only a five minute wait in line.", "title": "Very Nice Hotel", "helpfulness": 3, "user": "jetta83000", "date": "April 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4964246}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here on a Wednesday night for a Reds game. When we checked in I asked for a King bed if it was available. The desk clerk said okay, which led me to believe he gave us a king room. Wrong. The room we got had barely a full size bed (somewhere between twin and full) and the room was so tiny it just fit the bed. Also the bathroom was small and the door was falling off the hinges. We were running late for the game so we decided to wait until after to change rooms.", "title": "Bad experience", "helpfulness": 1, "user": "Cathleen02", "date": "August 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8386049, "likes": {"liked": "— Location", "disliked": "— Small beds, incompetent desk staff, bar closed too early."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "When we got back we went straight to the desk and got the same guy. He said there were no kings available (he could have told us that earlier). I aksed if he had any queens and he said yes but it was handicapped room, I said okay and he told us a bellman would meet us at our original room and bring us to the new room.", "title": "Not What it Seems to Be", "user": "ginnyanne", "date": "July 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 8240233, "likes": {"liked": "— decent location", "disliked": "— uncomfortable beds"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The bellman was the one bright spot in this, he was friendly, sympathetic and knew what he was doing. As we started towards the new \"queen\" room, he said he knew every room in the hotel after working there 20 years and he didn't think it was a queen bed. He was right. When he called the desk for us the only thing they could offer us was two full beds, we decided to just take it (even though I would have preferred to sleep in the same bed as my husband on vacation!)", "title": "Pay the Priceline Amount, But Nothing More", "helpfulness": 1, "user": "TravelingJess333", "date": "July 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8062813, "likes": {"liked": "— Proximity to Ballpark", "disliked": "— Room Service; No drugstores/cafes open late nearby"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "By the time this was over and we were finally in a room, we wanted to get a drink. We went down to the lobby and the bar was closed ( it was only midnight). We would not stay here again and would not recommend it.", "title": "Nice hotel, good location for stadiums", "helpfulness": 1, "user": "LtColBuckRobley", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7924086, "likes": {"liked": "— Location", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We booked it through Priceline so we didn't pay too much thank goodness. I've heard others complain that they are not treated the same at hotels when they use Priceline, but this is the first time it's happened to me, so I don't know if that was a factor or if they just have bad sercive at this hotel.", "title": "Priceline Find", "helpfulness": 2, "user": "Imagine20", "date": "June 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7751592}], "location": {"country": "United States", "city": "Cincinnati"}, "stars": 3.5, "variance": {"poor": 180, "average": 223, "very good": 163, "terrible": 116, "excellent": 46}, "aka": "Cincinnati Millennium Hotel", "slim_ranking": 0.62, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.5}}