{"user_rating": 4.0, "review_count": 125, "name": "Minos Mare Hotel", "reviews": [{"rating": 5.0, "title": "A Wonderful Hotel!", "text": "Excellent beachside location, great facilities, food superb. Best hotel in this area.Entertainment Team (Tina & Michael) brilliant.All staff extremely helpful - friendliest hotel I've been to. Downside - drinks expensive.Would thoroughly recommend this hotel.", "helpfulness": 9, "user": "Julia007", "date": "November 5, 2003", "id": 1437681}, {"rating": 4.0, "stay_parameters": "Stayed September 2002", "text": "We stayed here in September 2002 - and thoroughly enjoyed it. The hotel is modern and well-appointed, with indoor and outdoor pools, a large restaurant, including an outdoor (but shaded) area which was very pleasant, as it got very hot inside.", "title": "Wonderful Holiday/Hotel!", "helpfulness": 17, "user": "ccmanMidlands_UK", "date": "October 1, 2003", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 1372620}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We've just returned from 10 nights at the Minos Mare and would tend to agree with the most recent comments. The hotel accommodation, staff and food cannot be faulted. This is a true 4 star hotel, great location, beach, and the village of Platanes provides everything needed outside the hotel. Rethymnon is about 5k away (5 euro in a taxi).", "title": "Great hotel - apart from the \"entertainment\"", "helpfulness": 5, "user": "Skipper100", "date": "September 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3935999}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The issue is really with the \"entertainment\" provided solely by the Italian company, Eden Village.", "title": "positive praise for Minos Mare", "helpfulness": 7, "user": "LindaW603", "date": "September 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3905665}, {"rating": 4.0, "title": "Well, we managed to have an excellent holiday!", "text": "In the 2005 season the majority of guests at the hotel have been Italian and the entertainment has been specifically laid on for them to the exclusion of any other nationalities (British or otherwise). This is perhaps a little shortsighted on the part of the Minos management and they may well regret the decision.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 27, 2005", "id": 3810402}, {"rating": 2.0, "title": "What an absolute shame!", "text": "Notwithstanding this, if like us the entertainment at the hotel is secondary to the other hotel features (we spend little time at our holiday hotels during the day), then this shouldn't put anyone off booking this hotel. It would however be an excellent holiday hotel if some balance could be introduced into the hotel's entertainment programme.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 16, 2005", "id": 3776990}, {"rating": 3.0, "title": "Lovely hotel but other guests let it down", "text": "Having read earlier negative comments about this hotel, I had become very wary about what to expect. I travelled with friends who had been many times before, and they too were anxious having highly reccommended this holiday. Yes the animation team were Italian, and yes they played funky, beaty music by the pool for the aqua-gym, but a simple request, phrased with a smile, and the volume was lowered accordingly afterwards. The music was mainly Italian to begin with, but when we asked, they added British hits into the mix, and we were all happy. We spent several evenings at the sister hotel, Minos, a short taxi ride into Rethymnon, where, admittedly, the cabaret was more varied. Every single announcement beside the pool was made in English first, then German, then Italian, so absolutely nothing was missed. We even made the effort to learn a little Italian, and were rewarded by being asked out to dinner by some of the Italian animation team, and Iwo, the hotel's own Slovakian animator, whose English and German were excellent. We heard several complaints about the food while we were there, but to be honest, if you want fish and chips or Sunday roast, why are you in a Greek hotel? The food was local, with several choices, particularly from the buffet if you didn't fancy either of the two main meal choices each evening. Just because some of the food was pasta, does not make it italian, and we only had pizza once, and it was gorgeous!! The hotel staff were wonderful, and were happy to teach us a little Greek, then tolerate our hap-hazard grasp of their language with many a giggle I can tell you. We have been assured that things will be different next season, with no Eden Village, but even if they were going to be there again, I would encourage anyone to embrace the challenge, join in, and have some fun like we did.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 1, 2005", "id": 3515923}, {"rating": 1.0, "title": "why not to go !", "text": "I have just returned from this hotel after a 2 week stay. The hotel is extremely well presented but appearances can be deceptive. The beach front location of this hotel is excellent but unfortuantoely it goes down hill from there. Most rooms overlook the busy hotel car park which is extremely noisy and busy at all hours of the day and night. There are no rooms with sea or pool views", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 30, 2005", "id": 3510944}, {"rating": 4.0, "stay_parameters": "Stayed July 2003", "text": "The food is extremely patchy and the restaurant is not large enough to accomodate all guests which does lead to long waits typically 30-40 minutes at peak times. After waiting some 30 minutes for an empty table we commenced our evening meal at 8.50 pm the restaurant closed at 9.00 pm at which time the lights were turned off food removed from the self service buffet to leave us eating in the dark.", "title": "Very Nice Hotel, Good Location", "helpfulness": 6, "user": "blondebabe", "date": "September 29, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 2607609}, {"rating": 5.0, "title": "A lovely hotel for couples and families", "text": "Entertainment programme and staff do not speak English only Italian as were the majority of guests generally other nationalities are totally ignored. Booming Disco music plays all day by the pool, the hotel was extremely busy resulting in some English guests being moved to alternative accomodation on arrival due to overbooking. During our visit most English people were placed in basement rooms about 10ft from the car park resulting in many complaints many guests we spoke to having visited for the first or in some cases over many years have pledged never to return.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 27, 2004", "id": 2324358}, {"rating": 4.0, "title": "OK", "text": "We visited the Minos Mare in July 2003. Its was definately an above average hotel. The service was very good and the staff were polite and friendly at all times.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 12, 2004", "id": 1934221}, {"rating": 5.0, "title": "sumptuous hotel", "text": "The location was excellent with only a 1 minute walk to the town centre of Platanias. Rethymon was only a 10 minute journey by car, which had a better selection of shops and nightlife.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 30, 2004", "id": 1849895}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I fully agree with the opinion written by Marge1.", "title": "Good Accomodation and Location - pity about the food", "helpfulness": 4, "user": "IonutBucharest", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8520130, "likes": {"liked": "— Clean Rooms", "disliked": "— Old - hangings, moquette, bedspreads"}}, {"rating": 5.0, "title": "What a delight", "text": "We were inspired to renounce in time from the FB because we choose to trip around the island by car.", "helpfulness": 3, "user": "Rodrobin", "date": "June 20, 2007", "id": 7940061}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "HB was ok although the dinner was not extraordinary various.", "title": "Great hotel - pity about the food", "helpfulness": 12, "user": "Marge1", "date": "August 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5625914, "likes": {"liked": "— Location and staff", "disliked": "— Food"}}, {"rating": 4.0, "title": "one to ponder among...", "text": "As Marqe1 specifies in his comment lunch is extremely poor.", "user": "A TripAdvisor user", "date": "April 21, 2006", "id": 4993674}, {"rating": 2.0, "title": "Definitely not 4 star", "text": "It is also trough that dinner/lunch is about 10 Euro.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "October 7, 2005", "id": 3998998}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 18, "very good": 57, "terrible": 3, "excellent": 40}, "aka": "Hotel Minos Mare", "slim_ranking": 0.473684210526}