{"user_rating": 4.0, "review_count": 128, "name": "Miramar Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "A clean and comfortable hotel, with the bonus of free wireless internet for guests, and a good hearty breakfast included in the price. Very convenient for getting around the Altstadt, and not far from the cultural attractions of Frankfurt. Reasonable walking distance from the Hauptbahnhof. The staff are helpful and speak English. Like all smaller hotels in Germany the elevator is real slow (and small), at times you wonder if it's stopped, but it gets you there. The room decor is a bit startling, with more fake burr walnut panelling than you'd expect in a fake Rolls-Royce factory, and bright cheerful colours that somehow do work together but shouldn't. A good breakfast is included in the rate. I'd definitely use the Miramar again.", "title": "The Miramar Mix .....", "helpfulness": 3, "user": "BigMac-7", "date": "March 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7240873, "likes": {"liked": "— Friendliness of staff", "disliked": "— That fake walnut room panelling - everywhere."}}, {"rating": 4.0, "title": "Safe, central, and nice", "text": "I struggled to find a hotel right in the centre of Frankfurt rather in the main cluster near the station/red light district, but Miramar fits the bill. Perfectly central, in an apparently safe and reasonably quiet main street near the cathedral. It's not an enormous or particularly luxurious or attractive place, nor did it seem to offer extensive facilities, but I think it has everything one would expect of a 3-star business-travellors' hotel: clean, well equipped rooms, decent breakfast, friendly staff.", "helpfulness": 1, "user": "Tintern", "date": "February 13, 2007", "id": 6785525}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Perfect location for visitng the Christmas Market. Rooms compact but very clean. Staff friendly and helpful.", "title": "Location superb", "helpfulness": 2, "user": "travellersabroad", "date": "December 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6440730, "likes": {"liked": "— location", "disliked": "— Great little bar called Shooters just around the corner"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Going to our first Christmas market in Frankfurt we wanted to make sure we made the most of the limited time we had.", "title": "Perfect Miramar", "helpfulness": 2, "user": "Oldgit2", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6362228, "likes": {"liked": "— Staff and cleanliness", "disliked": "— Couldn't stay long enough"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We had a wonderful time which was helped in no small way by having booked the Hotel Miramar. It was easy to find just 10 minutes walk from the station. The staff were most friendly and helpful (especially Mary who appeared to cover the desk in the evenings), the whole hotel was clean, efficient and the best value for money we have had on several of what we call our 'Ryanair' weekends. The location could not be better and I would have no hesitation in recommending the Hotel Miramar to anyone.", "title": "Well located hotel", "helpfulness": 1, "user": "dunnard", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6174015}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The Miramar is ideally placed for travellers wishing to visit the Christmas markets which are only a minute or so away by foot. Although the rooms are fairly small they are clean and comfortable with good shower rooms. The staff are very pleasant and accommodating and all speak excellent English. Breakfast was also excellent with a good variety of cereals, cold meats, cheese, fruit and bread.", "title": "Excellent value for money", "helpfulness": 1, "user": "lovingthewhitestuff", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11714760, "likes": {"liked": "— Excellent value for money", "disliked": "— Small room (fairly normal for Germany, I believe)"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Over the weekend we stayed which was very close to Christmas there was always a plate of cookies/cake for guests on reception - a lovely touch.", "title": "Miserable Reservations Service", "helpfulness": 3, "user": "dangerpre", "date": "October 15, 2007", "detail_rating": {"value": 1.0, "service": 1.0, "business": 1.0, "location": 3.0}, "id": 10081639, "likes": {"liked": "— location", "disliked": "— miserable reservation service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "All round, this is a very reasonably priced hotel and the service provided is therefore excellent value. We would stay again.", "title": "Fantastic location, clean and reasonable price", "helpfulness": 2, "user": "53BLOSSOM", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10040644}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Based on all the positive reviews I had read on this site, I made my reservation directly with this hotel in April 2007, for a stay in October 2007, during a fair and heavy season in Frankfurt. Everything was confirmed via email six months in advance and I was all set for my trip.", "title": "Pleasant stay", "helpfulness": 4, "user": "Jamy04", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8072665, "likes": {"liked": "— Location", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Two weeks before my trip, the hotel manager sent me an email notifying me that they had \"accidentally\" double-booked the hotel for the fair and my reservation had been canceled. Furthermore, they had made a courtesy reservation for me and my family at a nearby hotel (near the train station). I did not want the reservation they made for me in a red light district hotel.", "title": "Three Stars, But The Location Covers Anything Else", "helpfulness": 3, "user": "ahmed_saffar", "date": "April 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7477055, "likes": {"liked": "— Location", "disliked": "— Small Room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Overall I liked this hotel. The room was a bit small but expected. It was very clean. It has an elevator which is nice. The front desk were very nice and spoke excellent English. Parking was close by and very reasonable. The buffet breakfst included in the rate was excellent. Bacon, sausage, scrambled eggs, cold meats, breads, yogurt, fruit juices etc. I would not hesitate to stay here again. Close to tons of restaurants.", "title": "Nice location", "user": "DeanCalgary_Alberta", "date": "August 9, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 4.0}, "id": 18765337, "likes": {"liked": "— The buffet breakfast and the front staff", "disliked": "— No air conditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "The hotel Miramar is well-located in Frankfurt, in a lovely area very close to the Altstadt. The hotel itself is not impressive looking from the outside and the reception is ridiculously small but that is the worst criticism that I can give it. The room itself was lovely, the staff were friendly and I have never had as good a breakfast as I did at the Hotel Miramar. There was something the cater for all tastes (which is not always the case in hotels on mainland Europe) and I have to say I was really set up for the day of sightseeing after it. I really enjoyed my stay there and if I were to return to Frankfurt I wouldn't dream of staying anywhere else.", "title": "The best hotel breakfast I've ever had", "user": "Milleens", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18462373, "likes": {"liked": "— The clean, quiet bedroom and the excellent breakfast in the morning", "disliked": "— the reception"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Miramar Hotel is perfect located beetween the old town and the shopping area.", "title": "Perfect location", "helpfulness": 1, "user": "MaKaStavanger", "date": "April 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14981446, "likes": {"liked": "— Location", "disliked": "— Waterpressure in shower"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "We walked from the trainstation to the hotel, about 15 minutes along the river Main. We arrived at the hotel around 11.30 am and were surpriced that they had our room ready for us so early. The room was small, but clean and just what we needed for a weekend. It was well heated, perfect after a walk on a very cold day. Our room was facing a busy street, but very quiet with the windows shut.", "title": "plain and simple hotel with good location", "helpfulness": 1, "user": "mugseybear", "date": "January 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12639354, "likes": {"liked": "— its location", "disliked": "— small rooms and appearance of the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Good and varied breakfast. The umbrellas they had for free use of the guests came in good hand as it rained a lot during our stay. We would stay at Miramar Hotel if visiting Frankfurt again.", "title": "Close to Christmas Market", "helpfulness": 1, "user": "Coopers4", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12038881, "likes": {"liked": "— location in city centre", "disliked": "— smallish rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We stayed at the Miramar for two nights in December. The hotel is in a good location being just around the corner from the Christmas Markets. Our room for three was pretty small. While staff were very friendly and helpful, there wasn't really that much going for the hotel except the location. The breakfast was just adequate and the lift could barely fit one person with their luggage. The decor in the room was also a bit faded. All in all though, if you are looking for a reasonably priced hotel in close proximity to the old town, then this isn't a bad choice.", "title": "Pleasant stay", "helpfulness": 3, "user": "CuriousKaren", "date": "January 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4349450}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Stayed at the Miramar for two nights i September with my wife. The location was superb. Just aorund the corner from Römer/Altstadt and just two blocks from Zeil (Frankfurts main shopping street). The room was smaller than usual but was modern and in excellent condition. The breakfast also was nice. Highly recommend this hotel.", "title": "The best location in town", "helpfulness": 6, "user": "Jorgen66", "date": "September 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3901063}, {"rating": 4.0, "title": "Very Good Hotel", "text": "We stayed at the Miramar while visiting Frankfurt for 2 days on vacation. We found this small hotel to be very clean, quiet, and restful. The hotel receptionists were helpful and friendly and assisted us with ease. Breakfast was included and had sufficient assortment to meet most travelers needs. The Miramar was easily reached by the S line and only a few min from the main train station. Great Central location! We will definately stay at the Miramar again.", "helpfulness": 3, "user": "MK_Cal", "date": "June 27, 2005", "id": 3615603}, {"rating": 4.0, "title": "Good hotel in good location", "text": "This hotel is in an excellent location around the corner from the Romerberg in the centre of the old town. I stayed here for 3 nights in June 2004. The single room was compact, but spotless and the bathroom (shower only, no bath tub) looked new. It had air conditioning and was very quiet. The staff were very friendly and helpful. They had a computer set up in reception and one could purchase a voucher from the hotel to connect to the internet via the computer, and while not cheap was very convenient. I would certainly consider staying here again if I ever return to Frankfurt.", "helpfulness": 5, "user": "Jon_Mendel", "date": "July 19, 2004", "id": 2307132}, {"rating": 5.0, "title": "Superb little Hotel", "text": "My daughter and I booked this Hotel last year through the internet as we wanted a Hotel close to the Romer Christmas market. We were not disappointed. The Hotel was ideally placed for market and shops. Bedrooms, average size, brightly lit, very well appointed and spotlessly clean. Good substantial breakfast in a little intimate dining room. No teamaking facilities, however, which would have been appreciated as we had an early morning flight and were too early for breakfast. Extremely pleasant staff who posted my mobile phone to me free of charge. That's service!! Would definitely recommend this Hotel to anyone who wants to be in this area.", "helpfulness": 11, "user": "CreteTraveller", "date": "September 11, 2003", "id": 1281474}], "location": {"country": "Germany", "continent": "Europe", "city": "Frankfurt"}, "stars": 3, "variance": {"poor": 11, "average": 22, "very good": 61, "terrible": 3, "excellent": 31}, "aka": "Miramar Hotel Frankfurt", "slim_ranking": 0.339622641509}