{"user_rating": 4.5, "review_count": 453, "name": "Miraval Arizona Resort & Spa", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Canyon Ranch was the best vacation i've ever been on; Miraval was the worst. i'm fine spending 1000s of dollars for a few days for a professional experience: this was far from it and a rip-off in the first degree. If want to do amazing health classes go to Canyon Ranch; if not, go to a Ritz Carlton instead, get a club room with the food included and you'll have 1000s of dollars left over for their amazing spa.", "title": "Mindless, prideless embarrassment-Go to Canyon ranch instead", "helpfulness": 26, "user": "travelerchicag0", "date": "August 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8421132, "likes": {"liked": "— smoothie bar", "disliked": "— everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "My impressions of Miraval:", "title": "Beyond expectations", "user": "jjbenitez", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8378022, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Wonderful stay!", "text": "the positives:", "helpfulness": 2, "user": "kimweaks", "date": "August 7, 2007", "id": 8370770}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Food:", "title": "An Amazing Experience", "helpfulness": 2, "user": "BooClarendon", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8361381, "likes": {"liked": "— Clean, tranquile. The desert was so pretty, and the place is set against some beautiful montains", "disliked": "— a little expensive, especially in the winter, but June suites me fine!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "The smoothie bar is great. I liked the cookies too.", "title": "An idyllic retreat... everything I hoped for and more!", "helpfulness": 1, "user": "primrose87", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8357020, "likes": {"liked": "— I felt cosseted and cared for..."}}, {"rating": 5.0, "title": "Top-Notch Pampering", "text": "I spent several days at Miraval with my wife as part of our honeymoon. Neither my wife nor I could imagine a better place to relax and enjoy ourselves following our marriage. It was picturesque and serene. The staff was extremely accomodating and friendly. They provided us with great service from the start. The guest reservations manager, Megan, provided us with a tour of the entire resort's grounds and showed us to our rooms immediately following our arrival. That evening, we received excellent service at the Miraval restaurant where we were waited upon by Justin. We were provided with a complimentary bottle of wine as a wedding gift. The following days were spent enjoying the one of a kind spa treatments and activities Miraval offers each of its guests. Particularly enjoyable were the photography lessons and desert mountain biking. If we had the opportunity, we would visit again, and again, and again.", "user": "jking14", "date": "September 30, 2007", "id": 10023160}, {"rating": 5.0, "title": "Self awareness at Miraval", "text": "My wife had been to Miraval once before, and she was interested in taking me with her. I was skeptical, as I didn't think there would be much of interest for a man at a resort of this type. I was very surprised and enjoyed the most relaxing and invigorating vacation I have ever had. We participated as a couple in some of the activities and alone in others, which was a nice balance.", "helpfulness": 1, "user": "SaddleMaker", "date": "September 22, 2007", "id": 8853199}, {"rating": 1.0, "title": "Broken heart - my heaven has gone to hell!", "text": "I'm excited for us to go again, as it was a great experience for us as a couple. The activities are challenging and eye opening, and the resort and rooms are beautiful. I travel extensively and stay and entertain in many top hotels, and I found Miraval to be extremely refreshing. I would highly recommend it for any occasion, as it will definitely make you more \"mindful.\"", "helpfulness": 19, "user": "Kitty_Chicago_7", "date": "September 18, 2007", "id": 8751641}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "My stay at Miraval earlier this month was a terrible let-down. I've been there several times before and I was really looking forward to going.", "title": "Miraval mostly wonderful", "helpfulness": 5, "user": "parker111", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8716922, "likes": {"liked": "— the challenge activities", "disliked": "— the management"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "- My room was literally filthy, the kind of ground-in dirt that can't be fixed quickly. The floors especially.", "title": "Miraval is Losing Its Magic...", "helpfulness": 12, "user": "chicagoshopgirl", "date": "September 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 8607516, "likes": {"liked": "— New, comfortable rooms, Great meals", "disliked": "— Unable to get into the activities I wanted"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Miraval is a magical place where you have no choice but to relax and live in the moment. The staff are friendly and excited to help with all your needs. I went alone for a weekend away and l met new friends, accomplished new challenges and was able to relax and enjoy nature. I am already planning my next trip back. So much to do and see. Food is healthy and fantastically fresh!", "title": "Best weekend !", "helpfulness": 3, "user": "Leeyanna G", "date": "December 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146544607}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Miraval works for friends, men, women, or a lone guest. That is not true of many spas. One can partake of all the traditional services and classes offered at spas. In addition, one can horseback ride, hike, bike, golf, zip line, rock climb, and many other adventurous thrills. One can also partake of interesting guest speakers in the evening.", "title": "Miraval--something for everyone!", "helpfulness": 1, "user": "Roverette", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146521671}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Miraval is a destination resort that has it all and more", "title": "Miraval is a destination resort that has it all and more", "user": "Bryan45992", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146510708}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "My wife and I have just returned from another memorable trip to Miraval, this is an extremely well run full service destination resort spa that will have you returning time and time again. They have so many services to choose from you can fill your days and still never do everything in just one visit.", "title": "Absolutely Amazing!", "user": "wendys7a", "date": "November 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146455385}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I highly recommend signing up for a challenge course and the Equine experience, each person learns something different about themselves yet we are all doing the same activity. Miraval has something for everybody, you custom tailor your own experience and guest services will help you with any questions and scheduling appointments.", "title": "Great Girls Weekend Spa Trip!", "user": "rfamilyadventures", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146261661}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "I took a spontaneous 2-night trip alone to Miraval in July 2007. I was a little apprehensive since some recent reviews had been negative, but decided to go for it. So glad I did. Miraval is more than just a place to get a massage, it is a peaceful place to contemplate and reassess the way that you are living your life. The setting is beautiful. The food was some of the best I've ever had. The service was great overall. The activities were great, I particularly enjoyed the guided hikes, yoga, meditation, and equine experience. There were many women staying there solo. My spa experience was mixed. Overall the facility was tranquil and immaculate, I got a great hair cut, and I liked the prickly pear sugar scrub very much. On the other hand, the showerheads were moldy, and I had the worst massage of my life. I won't go into details about that massage, but it was bad enough that I complained to the management about it. I strongly agree with the other reviewers that at the time that you book your spa appointments you should request an experienced therapist. I didn't spend much time in my room, but it was lovely. There were many thoughtful touches throughout the resort. There are bowls of fruit everywhere, and a nice lady walked around the pool offering guests two flavors of frozen lemonades from her tray. I found that the all-inclusive / no tipping policies did make it easier to relax. The staff informed me that Miraval is planning to expand to Florida and Costa Rica. I hope Miraval retains the qualities that make it special. I will defintely go back, and would highly recommend this resort to my friends.", "title": "Thank you Miraval.", "helpfulness": 3, "user": "Little_Lilly", "date": "August 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8281754, "likes": {"liked": "— Great food, beautiful surroundings, spirituality.", "disliked": "— Bad massage therapist."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Miraval was a bit of a disappointment. The rooms were nice, but the classes and instructors were overall weak. During many of the classes, the facilitators would invite guests to \"share\" their experiences. This would often result in a personal psychotherapy session to which we would all be subjected to. After several of these classes you come away feeling either glad your not as disfunctional as you thought or just plain depressed from hearing someone unload. Either way, not a positive experience.", "title": "go somewhere else", "helpfulness": 12, "user": "FloridaSpagirl", "date": "July 31, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 8267325}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The spa experience overall was average. If you are coming to be \"pampered\", this is not the right place. The therapists and technicans are average at best, as is the facility.", "title": "Mediocrity at Miraval", "helpfulness": 8, "user": "Bbiggam", "date": "June 29, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8026893, "likes": {"liked": "— food and beverage department"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The food at Miraval was adequate .", "title": "The O - Factor", "helpfulness": 10, "user": "Tiffany66", "date": "June 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 4.0, "location": 1.0}, "id": 7989579, "likes": {"liked": "— The food", "disliked": "— They were not equipped for the amount of business they had."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Mostly tasteless and very bland. Breakfast was the best meal of the day.", "title": "Growing pains? hope so", "helpfulness": 7, "user": "havefun135", "date": "June 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7972970}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I visited Miraval the week of August 26, 2012. I was excited but also a bit nervous since the reviews were somewhat mixed. However, my experience was anything but mixed. I had an amazing time. Miraval is a slice of heaven right here on earth. It will appeal to most travelers since you can customize your experience to suit your specific tastes and interests. I did a little of everything including physical challenges like walking across a high wire and mountain biking, gym classes, lectures, and spa services. The instructors were pleasant and very patient, the guests were friendly and interesting, and the facilities were clean and super comfortable. In fact, my blanket was so fluffy that I couldn't see my TV screen from bed. I will say that after the first night I didn't turn on the TV again. One of the great things about Miraval is that if you really embrace the experience you will be successful in unplugging from the day-to-day activities of your regular life. However, be aware that they are serious about making sure that no texting or talking on cell phones happens in common areas (loved this.) My recommendations: 1- sign up for their emails so you can be kept up-to-date with special deals, 2- sign up in advance for high demand activities like the zip line and spa services, 3- bring comfortable clothes, no one dresses up, 4- take advantage of the free lectures and activities and try at least one thing new or off the wall, 5- eat - the food is fabulous and plentiful, so don't expect to lose any weight, and 6- have a great time.", "title": "Luxury Summer Camp For Adults", "helpfulness": 3, "user": "EssaMiami", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148474511}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "This is a luxury spa with more to offer as you become transformed as an individual through nature all around, caring, expert and professional attentive staff from dining room servers to instructors and therapists in the massage room. I felt so cared about and special every day. I felt a tremendous connection to the natural environment of mountains, plants, birds, the blue sky and running water in streams and brooks. The lectures, classes and expert guidance in every class and every service was outstanding. i felt uplifted by what I learned and experienced. Mostly I was amazed at my inner transformation and engaged presence with me as a person. I was newly appraised and ready to move on in my journey in life. I cannot wait to return.", "title": "A unique, relaxing and transformative experience", "helpfulness": 2, "user": "reviewsr", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148224056}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A great spa, food outstanding and all you can eat – very health conscious. You would expect that being a spa. All of the staff were friendly and attentive. If you are looking for a health spa, this is the place to go. Try the Zip line. The rooms appear to be built in clusters around the property. Recommend low numbers i.e. 200s, 300s, 600 was too far away from the main building. This matters if it happens to be cold. In the spa, Noela, gave a great massage. Ray, the driver, was a fine gentleman interesting to talk to and made the trip to and from the airport speed by. The entire staff was great.", "title": "Great experience", "helpfulness": 1, "user": "BikerBoyFlorida", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148095245}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "When you combined these two the experience is magical. The nurturing, relaxing and calming environment of Miraval along with all of the spa services, classes, lectures and food was once again outstanding. The Entrepreneurs Guide to Enlightenment is an amazing process developed and facilitated by two incredible individuals, Alex Giorgio and Heidi Nobantu Saul. If you are an Etype (go to the website to see if you are) and you are open to a process that can create tremendous positive change in your life then this is for you.", "title": "Miraval resort & Spa/ = magnificent. Entrepreneurs Guide to Enlightenment = excellent.", "helpfulness": 1, "user": "karentucson", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147572192}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I was privileged enough to join more than 100 other women on the Louise Hay/ Cheryl Richardson Experience your Good Now retreat. Miraval is an incredible place where you come home to yourself. Carefree walking around in bathrobes listening to the echos of nature, enveloping you in the spirit of unity and love, has made this one of my favourite destinations. The amazing beds are like no other, the exceptional food, relaxation, therapy, spa treatments, horses hikes but to mention a few, this is one place I didn't want to leave!", "title": "Coming home", "helpfulness": 2, "user": "Iris143", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146614586}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "This was my second trip to Miraval and it was even better the second time around.", "title": "Can't wait to go back", "helpfulness": 4, "user": "MsTravela", "date": "December 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11506602}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The first trip was packed trying to attend as many classes and sessions as possible. This time I was more selective in my activities and spent more time at the pool.", "title": "The Oprah Seal of Approval Has Ruined Miraval", "helpfulness": 17, "user": "EleganceCalifornia", "date": "December 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 11473006, "likes": {"liked": "— I left there knowing that I am a happy, well adjusted person. Miraval breeds dysfunction.", "disliked": "— The front desk staff is particularly rude and unhelpful. Management could care less about guests."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "July is super hot in AZ and it rains briefly most afternoons.", "title": "A great experience!", "helpfulness": 1, "user": "rememberSt_Louis_MO", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10720564, "likes": {"liked": "— The bed, activiaties, customer services, spa", "disliked": "— bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The food is amazing, plentiful and does not taste as healthy as it is. I love their approach to eating mindfully and was so happy just being there.", "title": "It has certainly changed", "helpfulness": 12, "user": "arpwoman", "date": "November 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 10667979, "likes": {"liked": "— the privacy", "disliked": "— not cleaned to our specifications"}}, {"rating": 5.0, "title": "Miraval was Great, Can't wait to return", "text": "The spa is good, I've had equivalent or better services elsewhere, but when immersed in the atmosphere the services take on a new level of relaxation. The quiet room in the spa is one of my favorite places to relax.", "helpfulness": 1, "user": "Slodog", "date": "October 3, 2007", "id": 10037284}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "This is a return trip for me after a decade break. When signing up for activities, we were unable to many times. They have just a few spots and more guests than they have had in the past. For experiences that do not require signup, rooms are often crowded. This is unfortunate. Key to finding space is getting to the sign up sheets right at 9 - 10 pm when they put up the new day. You will find it challenging to do anything that requires signing up on your first few days.", "title": "Great place, but a few too many people for the activities", "helpfulness": 4, "user": "Squirreletta1", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 144255182}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The spa was nicely upgraded, but the old rooms look like they could use a spruce.", "title": "Marvelous Miraval", "helpfulness": 1, "user": "vjk7175", "date": "October 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144182912}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "The food is really great and you do not notice that you are eating reduced calories and it is available almost all day long.", "title": "Nice place with a few deficiencies", "user": "Cystokid", "date": "October 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 143955427}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The one thing that seemed sneaky to me was the resort fee. When quoted the room price, I assumed there would be tax, but there is a resort fee added to every night which is about 20% and this was not mentioned.", "title": "Like the Layers of an Onion...", "user": "danceout", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143857399}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "It would also be nice to have an option to do something at night (ie lecture) but everything stops at around 6 pm.", "title": "Authentic Connection of Mind, Body & Soul at Miraval", "user": "Jackie M", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143733232}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "For a once in a lifetime memory or yearly decadent gift to yourself, spend a vacation at the Miraval Arizona Resort and Spa. The breathtaking scenery, choice of relaxing services, food and committed service is not repeated anywhere.", "title": "Luxury Vacation", "helpfulness": 1, "user": "lbbeach", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146054165}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Summer is the staff member that will meet you with sincere happiness daily that will remind you how fortunate you are to visit Miraval.", "title": "An Amazing 5 days", "helpfulness": 3, "user": "Farley R", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145926629}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "when I arrived at Miraval I had just gotten over something very difficult, I needed to be rejuvenated. The staff came through tenfold! Each massage is amazing and they have so many to choose from. The whole package its just magical! The beds are heavenly! there is always something new and exciting to do! I loved the swing and a prayer! this place is so special!", "title": "Magical!", "helpfulness": 3, "user": "Rajj976", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145775360}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I just returned from my first visit to Miraval Resort and the worst part of the visit was getting in the shuttle to depart for the airport! This place is truly magical and provided everything I needed for rejuvenation and reflection.", "title": "ahhhhhh a great retreat always", "helpfulness": 3, "user": "havefun135", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145460104}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "The staff was readily available in baggage claim at the Tucson Airport, however, be prepared to wait if there are other flights arriving around the time of your flight. I had to wait 30 minutes before we could depart in order for the staff to gather all of the other guests who were arriving/waiting for luggage. On the drive to the resort, guests are provided with bottled water, a Miraval tote bag, water thermos, waiver form to sign, and resort guide. The driving time is just under an hour.", "title": "Retreat in the natural beauty Arizona mountains and desert", "user": "BCalumna", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145316717}], "location": {"country": "United States", "city": "Tucson"}, "variance": {"poor": 20, "average": 28, "very good": 59, "terrible": 13, "excellent": 333}, "aka": "Miraval Arizona Resort And Spa", "slim_ranking": 0.0708661417323, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Situated in the warm shade of the Santa Catalina Mountains in northern Tucson, on 400 acres of idyllic land, Miraval Resort & Spa is an award-winning luxury destination retreat dedicated to opening eyes, minds, and hearts. Personalized attention, sumptuous casita-style guest accommodations, and the Life in Balance Spa continuously help Miraval garner accolades from SpaFinder, Travel + Leisure, and Condé Nast Traveler.Miraval’s innovative Life in Balance Spa features unique, mind-body treatments such as Spirit Flight, Naga Thai, and Utopia. Outside of the spa, additional rejuvenating experiences such as healthful cuisine prepared by award-winning chefs, integrative wellness programs, fitness pursuits, and challenge activities are designed to physically and spiritually reconnect Miraval guests on the path to a life in balance."}