{"user_rating": 4.0, "review_count": 626, "name": "Miramonte Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Miramonte resort has become our getaway destination of choice. The service is impeccable, the food and the service in the restaurant is incomparable, the rates are unbelieveable, and as far as we are concerned there is no place that compares! It is family and couple friendly, offering plenty for both and the privacy that a couple enjoys. The spa services are among the best I have had and the staff treats you like royalty. I make every excuse I can to get out there as often as possible. You were not pressured into paying high valet charges and are able to park right in front of your room. They bend over backwards to accomodate you in any which way possible. The rooms are huge and immaculate!", "title": "No other resort compares", "user": "dhuezo", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46241602}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We spent three lovely days and two nights here and everything was superb. The rooms were well taken care by the house maids and the restaurant and bar had an outstanding wait staff. The food was great and we really enjoyed the Thursday night tapas in the bar.", "title": "Miramonte is a beautiful resort in immaculate surroundings.", "user": "bonnetta", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46193376}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The grounds were beautiful. The staff was polite. The spa was FABULOUS! Planning to bring my daughter back here for a spa weekend.", "title": "Beautiful", "user": "SheriB1", "date": "September 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45347012}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We just spent 5 nights at this resort. We booked on an internet incentive pricing - $185 for a King Dolce Suite. The grounds are absolutely beautiful and there were many gardeners working each day. I did not see any bare spots as one reviewer saw. The summer heat was at its tail end and the plants and flowers were still magnificant. The room was comfortable, clean and spacious. There was no mini bar in the room - but they brought a small fridge to our room. There was no robe, but I asked for two and they were brought to us immediately. The towels were thick and new; the sheets were not the best but still comfortable. While the adult pool is not as beautiful as the main pool, it is still very nice . We appreciated the quietness of the adult pool on the Saturday afternoon when there were many families with young children at the main pool. The service at the pools during the weekend was great. However, during the week, we practically had to beg for a server. The spa, although small, is heavenly. The entire staff very caring and helpful.", "title": "A Wonderful Desert Home", "user": "jrcc1", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44815631}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "This hotel just misses a few beats here and there. But, for the price, it is well worth every penny. You are not staying at a Ritz and you are not paying the price of a Ritz. However, you will be very happy here. If you need something, just ask - maybe twice - but you will get it. I will stay here again.", "title": "50th Class REUNION", "user": "dizzyCalifornia", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42056483}, {"rating": 2.0, "title": "The Well Spa", "text": "My husband and I visited the Well Spa at the Miramonte Resort for our first anniversary. The grounds of the Miramonte are very attractive and the spa is lovely, but it is way too small to properly accomodate the number of guests. We were encouraged by the spa hostess to make use of the amenities such as the warm pool and the jacuzzi, and to even enjoy lunch or a drink on the spa patio. This was a ludicrous suggestion due to the fact that every available seat was taken in addition to an exercise class being taught in the tiny warm pool. We went to the hotel pool while we waited for our treatments, but shrieking children splashing about was not what we had in mind when we booked a relaxing spa day. At the Montage Spa in Laguna, there is a very large pool for spa use only, a good way to have a child-free pool since no one under 16 is allowed at the spa. I am in no way kid-bashing here, we just wanted a little bit of grown-up time for our anniversary, and at the price we paid for our spa day, I think we were entitled to it!", "helpfulness": 4, "user": "kingsberry", "date": "November 9, 2006", "id": 6092744}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We both enjoyed our treatments, we had couples massage and facials. The couples massage was in a cabana by the spa patio, here the shrieks of children gave way to the cackling and nattering of the bachelorette party who had commandered the lion's share of the chaise lounges. \"Inside voices\", please, a spa is supposed to be a quiet place for relaxation!", "title": "Pretty resort, needs updating", "helpfulness": 3, "user": "Jolenie", "date": "November 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6059418, "likes": {"liked": "— The views and the grounds", "disliked": "— towels, paper goods in rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The women's locker room had only two showers, both were in use with a line forming after my massage, so I decided to take my shower at home although that meant putting clothes on a very oily body. My husband did the same as there was only one shower in the men's locker room so, of course, it was in use as well.", "title": "I'm definately coming back!", "helpfulness": 2, "user": "Rooster5150", "date": "October 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6027686, "likes": {"liked": "— The pool", "disliked": "— the parking lot"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "Maybe the spa would be much more comfortable on a weekday, but I would say pass on it for a weekend visit. Although the treatments and the therapists were very good, it is too expensive to have to be cheek-to-jowl with a crowd.", "title": "Miramonte - Beautiful grounds - terrible service", "helpfulness": 4, "user": "K44", "date": "October 27, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6018683}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "The Miramonte Resort has attractive grounds and large rooms.", "title": "A little disappointed", "helpfulness": 1, "user": "happyziggy", "date": "October 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5978857}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "I think I am being generous with 2 stars, but I have to say that the food was okay! Overall, my expectations were that of a Renaissance Esmeralda which is right across the street. However, when we got there, I felt like I was in a nicely landscaped Motel 6.", "title": "A Major Letdown", "helpfulness": 3, "user": "dmunk2000", "date": "June 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5332858}, {"rating": 2.0, "title": "Bugs, smells, and overpriced", "text": "- Rooms: Pretty large but inconveniently laid out. The TV was about 20 feet from the end of the bed and angled awkwardly so it wasn't facing you. Okay, so you're not there for the TV. The worst was the air conditioning -- if you are there in the summer, you need a cool room...well, room temperature air was coming out of the vents....not the 55 degree cold air you would expect. Nighttime was brutal sleeping in that warm room. Nice engineer came to try and fix it. Hotel manager said all rooms were booked and did not offer anything until I demanded some credit (so we got 50% off) -- awful service level!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 4, 2006", "id": 5299154}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "- Pool: The main pool was largely unimpressive and overflowing with people, mainly screaming kids. Lucky they had an adult pool, which was also crowded, but unclean (bugs floating on the water), and really small & unimpressive.", "title": "Miramonte - Maybe for you!", "helpfulness": 2, "user": "Zacloed1", "date": "May 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5287756}, {"rating": 5.0, "title": "When can we return?", "text": "- Food: had a very good brunch in the morning after our sweaty sleep...buffet style. Lunch was also quite good, but unfortunately this did not compensate for everything else.", "helpfulness": 2, "user": "Fussy Mommy", "date": "May 8, 2006", "id": 5041415}, {"rating": 1.0, "title": "Not for grownups who like tranquility", "text": "Stay at the Esmeralda or Hyatt across the street and spend the extra few bucks if you can..it'll be worth it!", "helpfulness": 5, "user": "nokidsplease", "date": "April 15, 2006", "id": 4975335}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "- Friendly, well informed, and helpful staff", "title": "Superb Accommodations – Elegant but not stuffy", "user": "FiatLux75", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38113521}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "- Well kept grounds & manicured lawns (minimally painted grass - yes - but I’d rather they paint it, then futilely waste water in 110 degree weather to try to keep it green for me)", "title": "A great place to relax in a friendly, clean, and beautiful hotel dedicated to customer service.", "user": "slehman", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37706398}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "- Fresh food", "title": "Great experience, worth the drive from the airport", "user": "traveladdictOmahaNe", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 37517661}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "- Fantastic drinks", "title": "Fabulous Staycation at my Tuscan Get-Away", "user": "Alirwd", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37311091}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "- Excellent place to retreat to after a day of hiking at Joshua Tree NP or Mt San Jacinto SP", "title": "The Miramonte is... ok", "user": "monkeyherder", "date": "August 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 36753287}, {"rating": 1.0, "title": "Simply Awful... Rude Staff and Bugs!!!", "text": "My husband and I stayed two nights at the Miramonte while visiting family in Palm Springs. We have stayed here before (several years back) and looked forward to a relaxing and lovely stay. Unfortunately, it was just awful.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 11, 2006", "id": 5457198}, {"rating": 5.0, "title": "Loved it! 5stars all the way!", "text": "I made reservations several months ago via the Miramonte website and requested an upper floor (they have great balconies). When we arrived, there was no mention in my file that we had reserved a second floor room and we had been put in a ground floor room. The front desk clerk was polite but couldn't figure out his computer system to find us another room. After about five minutes of him working with the computer, he called back to his manager and asked for help because the computer had frozen. The manager didn't even acknowledge me (or the long line that had grown); instead he berated the clerk for \"breaking\" the computer. The clerk explained my situation and said he was trying to find me a second floor room. Still, the manager didn't even turn my way or express any interest in what room I was given. He fixed the computer problem and stomped off. When the clerk called after him about what room to give me, the manager looked at me, looked at the line and sighed. That was it. I had no interest in being \"that customer\", so I gave up and just accepted the ground floor room.", "user": "LINDA P", "date": "July 10, 2006", "id": 5444330}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Our room was in a fine location, away from the pool and with a small private patio. However, it smelled musty and damp. There were no robes in the room (a smalll problem, I know, but annoying in a hotel of this caliber). Then, we found someone else's underwear and socks in one of the drawers. We laughed all this off and went out.", "title": "A Dog Friendly Hotel", "user": "cko", "date": "July 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5442553}, {"rating": 4.0, "title": "Sunny, warm and intimate", "text": "When we returned we found a few flies and a moth in the room, but ignored and went to sleep. We noticed when we got up in the morning that a room service tray that had been outside of our room when we checked in the previous afternoon was still outside the room. We went out for the day and came back to the same room service tray.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5396732}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "But the worst was yet to come... as we were getting ready for bed the second night, my husband stepped on a maggot. A live maggot on the floor next to the bed. (if it wasn't a maggot, it was some sort of one inch long white larvae, still gross). We were so creeped out that we pulled up the mattresses on the bed to make sure there wasn't something dead under there. We found an opened bag of pumpkin seeds, a hair band, a half chewed something that had turned brown and mushy, and several other bugs. It was really disgusting. Since we had only one night left, we dealt and checked out early the next morning.", "title": "The worst customer service!", "helpfulness": 2, "user": "giftshopgirl80", "date": "June 26, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 5392107}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I stayed at the Miramonte for three nights while on a business trip. My room cost $89/night, which I considered to be a good deal. All of the twelve buildings at Miramonte are attractive, two-storied stuccoed affairs with tile roofs. My room was a comfortable but standard motel room: one king bed, two sinks, a tub/shower, a nice flat-panel television, and a patio outside a sliding glass door.. The room was clean, and housekeeping was diligent about keeping it so. The complex has two pools, and the adult pool was just outside my room--very convenient. The hotel has a spa and restaurant, but I did not take advantage of either during my stay.", "title": "Fine accommodations, but nothing fancy", "user": "Scott_McCandless", "date": "September 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 41612508}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I stayed at the Miramonte 3 nights for a quick getaway. I received an internet special and wanted to check out this 4 star resort. We checked-in and I was impressed with the lobby then we drove to our room. I could not believe the maintenance of the grounds on the outside perimeter of the resort. My first thought was that I don't want to look at weeds, dirt and missing grass everyday as I walk to my room. I was not impressed. The next morning the grounds crew was working on the lawn but really all they did was lower the weeds. Now the inner part of the grounds around the pool was ok. They may want to invest in some artificial turf for those areas they are having issues with. I was pleased with the room. It was clean and spacious(and that is a must for me) My husband liked the TV. The bed was comfortable. The only thing that caught my attention was that there was no robe in the closet. Thought most \"resorts\" have robes for you. The pool was nice and large and it was great that they played movies at the pool. The best part about my stay was the spa. Now let me say that the spa is small or some may say cozy. It almost wasn't enough places to sit and lounge outside. But the spa staff was friendly, helpful and knowledgeable. They impressed me. I had services two different days and I took advantage of the specials they were offering. Again, the spa experience was excellent. Overall, I felt that this was just an average place to stay. Not my type of 4 star resort. I don't see us staying here again. But if you just need to getaway and are on a budget and get an awsome internet deal try it.", "title": "Average resort", "user": "necpix", "date": "September 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 40603174}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I loved it, the room was large the bathroom was great. I will bring the kids, very kid friendly. The movie by the pool is a great idea. I will make this our new weekend getaway spot.", "title": "Great place for the price.", "user": "StdrwlkDaddy", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39979698}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was our second stay at The Miramonte Resort & Spa. We stayed for 10 days and loved every minute. The room was nice and large and comfortable and very clean. Housekeeping was picture perfect. Our room was looked after in 5 star style. We always stay in room 205. A 30 second walk from the car to the room and a one minute walk to the wonderful pool area. The staff is great. Very friendly and helpful. Breakfast was perfect. Everything we ordered came exactly as we had requested. I couldn't fault even one aspect of the food or the service. I couldn't help but notice a very critical review below (avoid this place ike the plague) and I'd like to say the experience described was totally out of touch with our visits to the hotel. The Miramont is a small hotel under 200 rooms and in my view offers great value for money and a very personal touch and I highly recommend it. Yes there are a lot of choices for accommodation in Indian Wells and the Palm Springs area and if you want a large impersonal chain hotel you are soiled for choice. But if you are looking for a great holiday and to have a good time I'd suggest The Miramonte, we just love the place. My wife and I honestly feel you like us will enjoy your visit and highly recommend this hotel.", "title": "Love This Hotel!", "user": "HappyLondonUK", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39891750}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The moment we parked in front to check-in, it was all smiles from staff.", "title": "A day in Heaven", "user": "dgjackson80", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39669318}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We are so glad that we went to Miramonte! We had reservations at a resort a few miles away in a romantic \"Casita\" for 3 nights. That resort was awful to say the least with more on the repair list than my own home. The people at that \"Down the Road\" property were great but did not have a room that was in good repair and clean. And, for over $450 per night, we decided not to stay there. We drove down the road & found the Miramonte. Miramonte was like an oasis!", "title": "Great Property & Great Value", "helpfulness": 3, "user": "jwilsonssandg", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5883624, "likes": {"liked": "— The friendly service & well maintained gardens and pool areas.", "disliked": "— The towels"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "We were greeted by the Valet who was very courteous. We told the front desk that we would like to see a room before we checked in, they couldn't get a list together any faster. The Bellman was showing us rooms and asking what we were looking for. We chose a suite since the patio was larger.", "title": "Horrible Service, wrong room, construction, no electricity....", "helpfulness": 3, "user": "GetawayToday", "date": "September 17, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 5809263, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The property is absolutely gorgeous. A very romantic place with well groomed gardens and a clean & bright pool area. We chose a suite at the rear of the property. It was very quiet & had a wonderful private patio. We could walk out the front door to the adult only pool. (Which is great when you leave your kids at home.) We had a beautiful view of the gardens from our patio.", "title": "Don't waste your time and money!", "helpfulness": 5, "user": "TravellerTo", "date": "September 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5781088, "likes": {"liked": "— Nothing", "disliked": "— Loudness"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The service was outstanding. Ask for Lee the concierge...she is fabulous. The Buddy Greco dinner show is a MUST if you like jazz. The front desk even helped me print out boarding passes when my computer died. The restaurants were delicious. The Spa was magnificent.", "title": "Construction going on......", "helpfulness": 1, "user": "sofia28", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5728609}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "The rooms were comfortable and clean. The bathroom is only average with a combined tub and shower. ( I hate shower curtains that attack you while showering.) The towels are not the thickest and the carpet is not the most beautiful you have ever seen, but everything else is a 5 star. The value is terrific at less than 1/2 of what we had booked at the place down the road. Overall, the staff was very friendly & very accomodating.", "title": "Horrible Service!", "helpfulness": 2, "user": "FunFamily619", "date": "July 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 5477934}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "They have a great marketing dept -- their brochures really look nice -- the place is run down -- the pool is really old -- the TV in our roome didn't work and the on the balconey someone had poured something sticky on it -- we complained a number of times andy they never cleaned it all up -- housekeeping is really lazy -- I have stayed at Motel 6's that were cleaner and better kept this this dump. Save your money -- no matter how cheap a rate they give you -- it is not worth it. They don't care about thier guests -- they just want your money -- there are a lot of better places to stay in Indian Well and the Palm Spring area.", "title": "Avoid like the plague", "helpfulness": 2, "user": "jkresta", "date": "August 31, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 39350886}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I got away for three nights @ $79 for a 4 star resort. The employees and service were outstanding. The main pool, very nice especially when its 104 outside the pool was a constantly cooled. The adult private pool, was nothing special; very dull to look at and the water \"hot\". The guest rooms, are tired and outdated to call itself a 4 star resort. During our stay, there was a $25 credit for food/beverage daily and the resort fee was lowered to $10 per day, usually $25 per day. A fast ok stay.", "title": "Economic Getaway", "user": "Sancarlos4", "date": "August 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 39012814}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This resort is terrible !!! Our room air conditioner did not work, refrigerator did not work. After our trip I found out they overcharged my credit card. They authorized my card for hundreds of dollars more then my final bill. The service is atrocious. I now have to dispute authorizations to my credit card. I asked to speak with the general manager of the resort and was sent to his voicemail. He never called me back. They are ripping off customers intentionally. Stay as far away from this resort as possible and never ever give them you're credit card information !!!!!!!!!", "title": "Very Upset Customer", "helpfulness": 2, "user": "Motopro", "date": "August 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 39007943}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Rooms are large and with nice decor. You can park near your room, so you don't have to trek through a hotel lobby. No charge for parking. Nice landscaped areas and pool. Restaurant is good.", "title": "Great value, easy access", "user": "MsLlama", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38918392}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed in Miramonte during the summer when it was 118 degrees outside. What is there to do in such a hot place? More than you think! Our teip to the Miramonte with one teenager and a child was AMAZING! The pool is nice and cool! There is plenty of shade and chairs. We ate some food by the pool. They have really, really, really good smoothies! They serve things like salads, hot dogs, hamburgers, usual food you'd see at the hotel pool. It was quite good. They have one resturant, The Grove Artisan Kitchen. They serve Califonia/Italian cuisine. They have a nice kids menu and a wide variety of food on the adults menu. The fitness center is small, but nice. I have been to the spa before and it was the best thing there! The staff was kind and happy to assist you. It is a great spa, and one of the best out there! Across the street they have a golf course, but we did not have the time to go golf. The city has a wide variety of resturants and shops! I will come again and again!", "title": "The Best Getaway!", "user": "TravelerGirl1001", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38578002}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 45, "average": 84, "very good": 172, "terrible": 35, "excellent": 290}, "aka": "Miramonte Resort And Spa", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in Indian Wells, 15 miles from Palm Springs, the AAA Four Diamond 215 room Miramonte Resort & Spa features a world-class day spa with nearby championship golf courses."}