{"user_rating": 4.0, "review_count": 320, "name": "Mirbeau Inn & Spa", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "I was a guest at the facility on December 2nd and 3rd. For the record, I have stayed at Mirbeau on multiple occasions and have used gift certificates in the past as holiday gifts for employees. In addition I have referred visiting guests, SU parents, and others to the hotel many times in the past.", "title": "Customer Service hits an all time low!", "helpfulness": 16, "user": "Tellertale", "date": "February 15, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 4461943}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "Friday night my wife and I checked into the hotel. We were given room #121. Since we were late arriving, we rushed to dinner in the dining room where we had 4 other guests meeting us. We had an enjoyable meal and managed to exhaust the supply of Beaulieu Vineyard Georges de Latour.", "title": "THIS PLACE IS OVERRATED AND OVERPRICED!!!!", "helpfulness": 13, "user": "lubby", "date": "February 14, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4459324}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "When we returned to our room, we noticed the that the room was a handicapped room. We were never informed the room was handicapped equipped, and as a result we had a tiny shower and bathroom with only one sink. Not what we expected from Mirbeau.", "title": "Romantic Gateaway", "helpfulness": 19, "user": "G102000", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4124387}, {"rating": 1.0, "title": "Terrible Experience at the Finger Lakes Lodging", "text": "Even more important was the mattress was bad. Rather than the comfortable, custom mattress that we have come to expect, we had a sagging back-breaking mattress.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4050661}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "In the morning when we spoke to Rita (front office desk manager) her response to the issue of a handicapped room was, \"its all we had\" and to the issue of an uncomfortable mattress, \"how would I know, if you didn't tell me\". After much fuss, she agreed to change our room to #125, after the guests currently occupying the room left. Since we didn't know \"when\" was, we left the facility and went to town. Rita never used the words: Sorry, Please, or Thank you, in her conversations with me or my wife. Her attitiude was that she was doing us a favor.", "title": "Love Mirbeau!", "helpfulness": 6, "user": "DTNPROMAN", "date": "October 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4026536}, {"rating": 4.0, "title": "Great for Day Spa travelers!", "text": "I took my girlfriend to Mirbeau for a very enjoyable day at the Mirbeau Spa. We did a day spa package that included a treatment for her (she chose a nice Swedish massage and said it was wonderful), and lunch. We arrived around 10AM and left around 5PM, and enjoyed the amenities of the spa, including the footbath, quiet room, aqua terrace (with an amazing kidney-shaped stone hot tub and waterfall!), and fitness center.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 1, 2006", "id": 5289706}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The day was very relaxing and a wonderful, and lunch, despite small portions, was outstanding. My girlfriend commented that she felt like she was vacationing in Europe for the day, which was of course the point! Hats off to to the staff, they were very professional and courteous throughout our stay.", "title": "loved mirbeau", "helpfulness": 5, "user": "jenninejHouston", "date": "June 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5288925}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Two minor complaints:", "title": "Perfect birthday getaway!", "helpfulness": 4, "user": "FrankandBruno", "date": "May 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5043671}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "First, we sat outside for lunch, and there were a lot of bees nearby. They didn't bother us too much, but it was a bit annoying. I wish they'd take care of that.", "title": "A Wonderful Weekend", "helpfulness": 4, "user": "housecount", "date": "April 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4954620}, {"rating": 5.0, "title": "A true Experience at Mirbeau", "text": "Second, I had to stop by the spa's front desk a couple times to ask where things were, how we used our vouchers, etc., and every time I did I was greeted with \"Would you like to check out now?\"... instead of a friendlier and less presumptive \"How can I help you?\" or something along those lines. It wasn't a huge deal, but it did make us feel like they were trying to get rid of us, for whatever reason.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4726675}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed at Mirbeau for our anniversary last week and overall I was enchanted with the place. We stayed mid-week (Wed-Fri) in mid-October, which is decidedly off-season, and recieved an excellent rate for that reason. Our room was under $200 a night, after taxes, when it normally would have been closer to $400. So we knew we were getting quite a bargain, and that does adjust your expectations.", "title": "Luxury in the Finger Lakes", "user": "maynecorse", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6006783, "likes": {"liked": "— The serene environment and wonderful amenities.", "disliked": "— No in-room coffee."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Our route to the hotel took us through the Seneca Lake wine trail, so we didn't end up arriving in town until 8. Note: most restaurants close early. We tried Joe's Pasta Gagrage only to find the kitchen had closed at 8pm! Arrived at Mirbeau around 9pm. The front desk is not very obvious- we drove around a bit to find it. Our greeting was rather indifferent as well. And when we arrived at our room, after hunting for the small numbers in the dark, there was a forgotten folded serving table in a nook outside our door. Not the kind of first impression one would expect. But we loved our room, which was an upper-level cottage room. The decor is lovely, the linens divine and the bathroom was perfect. The view was of the interior \"courtyard\", which was a beautifully landscaped take on Monet's garden, with a large pond and flowering waterlilies. And really, for most people that is what you pay for- the room and the amenities. I read in their in-room book that the beds are made just for them and can be purchased- which made me laugh until I tried one. I may just end up ordering one of those if I can think of a way to work from bed!", "title": "not worth the money", "helpfulness": 5, "user": "maebyn", "date": "October 16, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5962155, "likes": {"liked": "— bathtub", "disliked": "— price, quality of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The folowing day I had a massage at the spa. Pricier than what I am used to (in a major city) but not nearly as out of line as the ridiculously priced manicure. It was, however, a wonderful massage and worth the price. Overnight guests can visit the spa for the steam room or sauna or the Aqua Terrace's oh-so-wonderful hot tub, which is unlike any hot tub I've ever seen. Do not miss this- my husband and I went out (it's outside) despite a chilly rain. There is also a small but well-equipped cardio room and exercise classes, but I'm guessing that unless you are super-serious about exercising, most people will choose the spa over the cardio. Still, all facilities are in top condition. The spa also has a small shop which sold the same shampoo and body lotion that was stocked in the room. Loved the rosemary mint body lotion. Their lotions use essential oils, and all of them smell and feel wonderful", "title": "Absolutely Stupendous", "helpfulness": 3, "user": "hotelstayer23", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5800116, "likes": {"liked": "— Room", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "We did not eat at Mirbeau at all, preferring simple breakfasts on the road while exploring and dining at local eateries. It would have been nice to have coffee in the room. That was a surprising omission. And no free bottled water, although the stuff that comes out of the tap up here tastes better than Evian.", "title": "Received much appreciated pampering.", "helpfulness": 2, "user": "anonymousalways", "date": "September 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5782026, "likes": {"liked": "— The \"Monet\" theme and the gorgeous property.", "disliked": "— Some lapses in service and details in the rooms."}}, {"rating": 1.0, "title": "Not Keeping Up to its Reputation", "text": "We went to Mirbeau for a quiet weekend getaway in February. We ended up getting the room closest to the entryway and dining area, and could hear the outer door open -every- time someone walked down the hall. We could also hear just about every word our neighbors were saying in their room, and some of the clients seemed rude and obnoxious (apparently they were not there for a relaxing weekend). We requested a new room and was told there was nothing they could do. Dinner was billed twice to my credit card (although they fixed that pretty quickly.) All in all it was -not- a very relaxing weekend. We will not be going back there again. I felt like I was robbed of a few hundred dollars.", "helpfulness": 3, "user": "Jtor", "date": "August 8, 2006", "id": 5577734}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I just spent 3 days at the Mirbeau and have to say it's one of the loveliest places I've ever been to. That atmosphere has a real Monet/southern France feel. Our room looked out over the koi pond and Japanese foot bridge, lovely in March but must be breathtaking in summer, when all the rose bushes are in bloom. This was one of the prettiest views from a hotel room I have ever had. The gracious rooms are more than spacious and the bathrooms are double sinked, with a claw foot tub and large walk in shower. I did hear the phone ringing next door, so perhaps the walls are thin but noises (voices or tv) from the neighboring rooms never bothered us. We found a wonderful rate on their website (be sure to check, especially off season when they're trying to lure people in) which included spa treatments, which was the primary reason for the visit. We were not disappointed - impressive resting area with a huge common massaging foot bath, clean good sized locker area with many personal amenities (that varied from day to day, though; that was weird). My friends and I had 13 treatments total and all were wonderful, right up there with the best we've ever had The Aqua Terrace is such a lovely feature. I found all the staff to be gracious and pleasant - one morning we brought in pastry for breakfast, they had no problem with us eating in the little common area outside the dining room and even provided us with napkins and offered to clean up. They did seem to all be on the young side, which is neither here nor there. The only thing I noticed was there didn't seem to be anyone around to take our bags, not that it mattered, but they didn't even offer, when we checked in. We did not eat dinner there, we did have breakfast which was very nice but overpriced ($5 bagels?) but I understand the dining room food is excellent. We ate at Rosalie's (a 5 minute walk behind the cottages) and the Sherwood Inn, both good, and had lunch at Valentine's, a great place for an inexpensive lunch or quick supper. We went to both the Long Point and King Ferry wineries, chosen because they're about 5 minutes from each other and both were great experiences - I had emailed ahead, they offered us tours and extensive tastings. But back to the Mirbeau, probably you can find fault no matter where you stay if you look hard enough, but between the lovely room, beautiful grounds, friendly staff, upscale spa and general casually elegant ambiance, unless you have an isolated experience I can't imagine your having anything but a memorable time at this wonderful inn.", "title": "Just Lovely", "user": "PaulaRuth", "date": "April 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7288145, "likes": {"liked": "— Lovely view of the pond from the room", "disliked": "— NOthing in particular"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My fiance and I stayed here one night mid-week and absolutely loved it. We received a welcome glass of champagne on arrival. Stay in the cottages if you can. Tastefully decorated, huge bathroom including walk in shower, fireplace. Very romantic. The grounds are simply stunning - very quiet and peaceful. It's not cheap but you get what you pay for. I can't comment on the dining (we walked up to Rosalie's", "title": "Fantastic.", "user": "jb347", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7153839}, {"rating": 5.0, "title": "Pampered, Pampered, Pampered", "text": "for dinner), but the spa was very relaxing. The resting area was rather impressive.", "helpfulness": 2, "user": "STaylorSkaneatelesNY", "date": "March 11, 2007", "id": 7013180}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I are in our 50's and wanted a superior oassis to spend our 35th wedding anniversary. We found it right in our own back yard at Mirbeau Inn and Spa.", "title": "How relaxing!", "helpfulness": 3, "user": "vld8783", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6363164, "likes": {"liked": "— The convenience of the spa, outdoor hot tub, and restaurant", "disliked": "— The bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband really wanted a Spa stay, but I was a little hesitant about attending a Spa because I'm not the picture perfect body type, so while I expected him to have a wonderful time, what I didn't expect was for all my personal apprehensions to be erased so completely by an expert staff that was as considerate as they were capable.", "title": "A Wonderful Honeymoon Resort", "helpfulness": 2, "user": "kshute", "date": "October 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6012371, "likes": {"liked": "— The Club Level experience", "disliked": "— The bed linens"}}], "location": {"country": "United States"}, "variance": {"poor": 40, "average": 39, "very good": 66, "terrible": 15, "excellent": 160}, "aka": "Mirbeau Inn And Spa", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Mirbeau Inn & Spa is a 34-room luxury Spa Resort combining the amenities of a boutique country inn, world-class spa and nationally acclaimed fine dining, all with the elegant comforts and residential feel of a wine country estate.The Inn and Spa consists of six buildings clustered around beautifully landscaped ponds and impressionist gardens. The exterior architecture, interior decor and landscape design are reminiscent of an Old World French Country Estate."}