{"user_rating": 2.5, "review_count": 174, "name": "Mithila", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "My parents came to SF for my wedding and we had to find not-so-expensive accomodations for them. After reading some of the reviews of Mithilda I was very sceptic, but the prize was right, so I booked it. My parents enjoyed their stay there. It's not fantastic, but it'll do. It's clean, it's inexpensive, it is a good location, in a ok-safe neighborhood. Who needs a lot of TV stations when being in a city as great as SF? You will not find anything better in a better location. It is loud whereever you go in the city! The breakfast, I have to say is not continental -it's coffee and danishes. Their website makes the rooms nicer then they are, but again, they are not bad and quite roomy. I am still recommending it to friends coming to visit.", "title": "Not that bad", "helpfulness": 4, "user": "sandra2004", "date": "August 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3782416}, {"rating": 4.0, "title": "Good choice", "text": "We were planning a family trip to San Francisco and didn't want to spend all our money on a place to sleep. One option was staying at one of the less expensive places out near the airport or in South San Francisco, but then we'd have the expence (and hassle) of bus or taxi rides back and forth, so we decided on staying \"downtown\". We took BART from the airport, transferred to a bus and arrived within a block of the hotel on Sutter Street. It's a few blocks walk to the gate of Chinatown, a few more blocks to Union Square and the cable cars, two and a half blocks from a supermarket. All very convenient. The rooms are well-sized, as one would expect in a building as old as this. Everything is in working order, the beds are comfortable, naturally everything is clean. We had TVs and refrigerators in our rooms. The bathrooms have bathtubs! And of course you can take a shower instead, if you'd rather. Most rooms face away from the street, so are quiet. The staff is very friendly, helpful and knowledgeable about the city. We felt appreciated as customers. In a city teeming with average hotels, the Mithila staff succeeds in pushing their place above average.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 25, 2005", "id": 3698429}, {"rating": 1.0, "title": "Not very good, not worth the money", "text": "I was not at all impressed by this hotel, and even though it is only $85 a night, it's still not worth it. The sheets had, what lloked like small blood stains on them for the entire week, so obviously they do not shange the sheets, not even when we asked. The continental breakfast was a JOKE: really awful coffee and processed danish - if you got there in time. The area is ok, it is in the area between Nob hill and the tenderloin, which is the worst part of the city. The room was a decent size, but the Tv doesn't have cable and only gets about 5 channels with so-so reception. I would not recommend this place and shame on Orbitz for being affiliated with it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3508736}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2, "variance": {"poor": 29, "average": 39, "very good": 35, "terrible": 66, "excellent": 5}, "aka": "Mithila Hotel San Francisco", "slim_ranking": 0.846808510638}