{"user_rating": 4.0, "review_count": 217, "name": "Mitsui Garden Hotel Shiodome Italia-gai", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I was really pleased with this hotel. The rooms were excellent, the free public bath a wonderful bonus and the service was polite with staff who spoke good English. I was particlarly pleased with the hotel's location. A ten or fifteen minute walk into Ginza, there really is no need to take the subway or hire a taxi. The JR station is a 5 min walk away (with luggage), ideal if you are on a budget and have the JR rail pass. We used this all the time in Tokyo and found that we never needed the metro. The district around the Hamamatsucho Station is very well served with excellent retaurants and the fish market is within walking distance if you fancy checking it out before breakfast.", "title": "An excellent choice, brilliant location too!", "user": "BillParis", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73215074}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The hotel restaurant is expensive and so too is the breakfast. at around 20€. Still, we tried it once and thoroughly enjoyed the range of tastes. Afterwards we settled for nearby cafés in the morning. I would heartily recommend this hotel to any visitor to Tokyo.", "title": "New & Clean", "helpfulness": 1, "user": "Midoringo", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 21561089}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The only reason why I stayed at this hotel is that it is literally next to my Japanese office. This new (less than 2 years old) hotel in a new district Minato-ku is certainly playing up to some Japanese's liking for some things Italian. The only restaurant in the hotel only serves Italian/Japanese buffet, so if you're a Japanese food purist, the restaurant is not for you. However, the breakfast appears traditional Japanese though. The hotel and room has nice clean lines, and the rooms of moderate size for a city notorious for the smallish rooms. Swinging to the other end of its schizo spectrum, the tv channels are all Japanese, so no CNN or BBC for you. 1 of the \"selling points\" is the traditional japanese public bath, which I guess is pretty for the international business traveller to at least experience it once. At the very least, the locals seem to enjoy it.", "title": "More Italian or Japanese?", "helpfulness": 1, "user": "bcheong", "date": "October 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20993347}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 7, "average": 38, "very good": 131, "terrible": 2, "excellent": 39}, "aka": "Mitsui Garden Minato", "slim_ranking": 0.315217391304}