{"user_rating": 4.0, "review_count": 1532, "name": "Mitsis Rodos Maris Resort & Spa", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "When I booked this holiday in the UK, I was asked what type of holiday experience I was looking for? I explained that my Husband and I were celebrating our silver wedding anniversay and we were travelling with another middle aged couple with no children. We wanted 5* luxury, a bit of class, a place to remember - well we certainly got the last one but not for the right reasons. Our bookings were meant to be linked but upon arrival at check in we ralised that it meant nothing, we were seated in row 32 and the other couple in row 5. We didnt say anything because we did not want to start our holiday on a bad note, but that soon changed as soon as we reached the hotel. I had e mailed the hotel directly enquiring about the cost to upgrade our room to a seaview and the response I had was that they would provide one as a courtesy due to our special occasion. When we booked in I produced the e mails and was abruptly told that \"This doesnt count now because the member of staff no longer worked for the company\". We were put in room 503 and the other couple in room 1053 - you could not have got further away. When I said the booking was supposed to be linked, I was told \"Not guaranteed, if you are not happy take it up with your travel company when you get home\"! I said this was disgusting and asked to speak to a manager and then miraculously a new room in the adjacent block to our relatives was found! We went to find the rooms and noticed that they were backed onto the outdoor entertainment which was situated on a baseball court and was bellowing out - what else could go wrong?", "title": "Definately not T 5* by any standards - dont waste your money.", "helpfulness": 1, "user": "tokar", "date": "October 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 46922675}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "When we saw our rooms I could have cried (and in fact did many times I was there), this was", "title": "Value for money 5+", "user": "Chassad", "date": "October 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 46751925}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "no more than a 3* at best. Two single beds made up and pushed together with a sheet over to make it look like a double bed, nothing classy or luxurious - quite the opposite. We left our bags and went to find the late night buffet supposed to be laid on for late arrivals (by now it nearly midnight), only to find some skanky rolls that had been there all day and a few slices of cold pizza! I ordered a sprite and it came in the smallest glass imaginable and was consumed with 3 mouthfuls. I went to get another and asked for a bigger glass this time to be told I could not because I did not have alcohol (beer) in it and if I had one everyone else would want one!! I was now penalised because I do not drink alcohol.", "title": "It was a great holiday until I caught a Gastrointenial Virus - be warned !", "helpfulness": 1, "user": "minxyem", "date": "October 13, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 46746205}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "When we returned to our room tired and hungry , my Husband oped the balcony doors only to find that they were not in line and could not be shut or locked again.", "title": "Not a 5* and someone is trying to fill Sister Hotel with Maris guests !!!!", "helpfulness": 2, "user": "MoDoKent", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 4.0, "rooms": 1.0}, "id": 46286418}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The next morning we went to reception and reported the doors (seeing the same rude receptionist from the night before) and she said it would be attended to, we also asked for some extra pillows and bath towels - going to a 5* hotel we didnt bother to pack bath towels but all they provided were hand size towels - some 5* (we ended up going out and buying towels in the end because it was evident the hotel did not know what a bath towel was)!", "title": "Great Holiday!", "helpfulness": 2, "user": "JuliaMc", "date": "September 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 5.0, "rooms": 3.0}, "id": 45527401}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "well the gang did it yet agin!! thanks for a great stay yet again would like to thank tasos and the animation team for such a great stay an nicolos the best bar man in rhodes they all worked really hard for a great stay an the hotel an food were great well worth it was sorry to leave a++++++ thanks once again xxx", "title": "our 2nd trip", "user": "ntsjbell", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 40591390}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Good points.", "title": "Beware of overbooking", "helpfulness": 2, "user": "bagpusUk_Glos", "date": "September 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 40017551}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Food, good quality, plenty of choice for fussy eaters & children (Not as good as the Lindos but still good quality) Snacks, Ice Cream ect in the day from the galltaire or beach bar of good quality.", "title": "Very average holiday hotel.", "helpfulness": 1, "user": "Swa_Belgium", "date": "September 7, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 39991554}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Drinks were of good quality, didn't seem to be weak or watered down.", "title": "Slippery even not wet. Comfortable. Poor choice of food. Not 5 star", "helpfulness": 1, "user": "THESLIMLINES", "date": "September 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 39912894}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Kids Club - Twice daily and the kids really enjoyed it. Run by the entertainment staff", "title": "Excellent Holiday.... Take a fan to keep you cool at night... Poor Air Con!", "user": "Tannerz", "date": "September 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 39792645}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "As we went to the island of Kos last year, we decided to go to a more different island. We chose rhodes and this hotel.", "title": "Very poor 5* Average 4* Average 3*", "helpfulness": 1, "user": "Minister123", "date": "September 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 39736692}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Upon arrival in the very early hours of the morning, we were checked in easily but the promissed drinks were not given. Not exactly a good start. They then told us the room number, gave us a rather un-accurate map to find it and took the luggage to that room. With us trying to find our way there.", "title": "Fantastic family holiday with plenty to do!", "user": "JillDudley", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39707195}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "When we DID find our way there (20 minutes later) We examined the room. This was one of the bungalows so be prepared fr those! Upon entering, the ceiling above us was straining and looked as if it could fall in. The beds were extremely rough and the room had hardly been cleaned. There were coffee stains on the table for lords sake. Ants littering the bathroom and the balcony hard to reach due to doors we could not open. We were going to complain but we waited until morning...", "title": "Great place, great people and would definitely go back again", "user": "Anna1981Aylesbury", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39465594}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Meanwhile, in the night. I woke up screaming. My mother was swatting at my bed. There were ants on the bed! On me! In the end, I didn't sleep.", "title": "3*** not 5*** star", "helpfulness": 1, "user": "indieGreenwichLondon", "date": "August 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 39074431}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Next morning, we complained. We told the reception about what our... issues were. Well, you must admit, ants on my body, possibly seeping through my mouth or something.", "title": "There was something for all of us", "user": "nicolaleicester", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38519331}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The Hertforshire 8 had a very enjoyable summer holiday. This was made better by the personal touches of Tassos and his staff especially Elizabeth and Romana who went out of their way to ensure our every need was met. The food and beverage manager Tassos was always on hand to make sure everthing was 100% perfect. The only down side was getting up too early to get the sunbeds!!", "title": "Hertfordshire loves the Rodos Maris", "helpfulness": 1, "user": "Hollyfields8", "date": "September 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 44779276}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Some of the rooms could do with a shower curtain , but hey perfect is boring. All in all this hotel has a lot to offer and you will struggle to get a better all round package /an all round 5 star holiday we cant wait to return.Top tip eat in the chinese -Peter will look after you, as will George in the pool bar. Thanks to the staff in the beach bar -you are brilliant-so hard working. An all round great team, great location and a superb holiday.", "title": "Totally Relaxing Holiday", "helpfulness": 1, "user": "KateW4", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 43379524}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "Just returned from Rodos Maris. Hotel excellent. Plenty of Sun-beds and staff all very polite and willing to assist. Two really worth a mention - Tassos - the assistant manager, Nothing was too much trouble. He was popular with all guests as far as I could see. Always smiling and very professional and excelled in customer service. Also Elizabeth who worked in the bar in the evenings. - whose customer service was excellent too. I would recomend this hotel to couples wanting a really chilled and relaxing time.", "title": "Amazing Holiday best ever !!!", "user": "BECKYBOO77", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 43048670}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We returned from the Rodos Maris on the 10th Septemeber after two weeks of fun. My new husband and I got married in Lindos on the 4th September so we travelled with a large group of 32 family and friends who all stayed at the same hotel. The ages ranged from 18 months to 62 years and I can honestly say we had a fabulous time. After reading previous reviews I was worried about going as I wanted this holiday to be very special and as I had picked the hotel felt a responsibility to my party to give them a nice hotel. Well that I did. When we first arrived we were allocated a bungalow, which would have been perfectly o.k if we were staying there on a normal holiday but as this was a special holiday we felt it abit small, so complained to reception who told us that they could not do anything till the morning, so we accepted this and went to get a drink, only ten minutes later the reception staff came and found us and told us that they had organised a new room which to us was brilliant, this room was in a block with a great view and a lot more spacious. The rooms aren't 5 star standards, I have been to Greece before so I knew it was very basic but they were cleaned everyday with clean towels and they were not bad at all. At the end of the day a room is somewhere to sleep and get changed in. The food at all times in the main food hall is excellent with more than enough choice, we went to the chinese twice which was lovely and the taverna twice which is even nicer with pizza, pasta, chicken, kebabs all cooked in front of you and you must try the panini's at the beach bar there good too. The beach is sand shingle and does get very hot but thats life. We stayed by the pool most of the time and got our usual 20 sun loungers everyday and there always seemed to be extras stacked everywhere. Drinks are always flowing and the animation team seemed to liven us up to, I enjoyed water areobics a few times and the afternoon quiz was always a good laugh with boys against girls, we won. Everyone who came on the holiday had a fabulous time and thought the hotel was great, we are hoping to go back next year for a week on our anniversary. Beware though there isn't alot outside the hotel we did go to Dimitris Bar to watch the football a few times and theres a few restaurants but thats it. There is a bus stop right outside the hotel which runs till 11.30 at night if you fancied going to Pefkos or Lindos for the day or evening, I would recommend going to Lindos its beautiful but was alot hotter there than at the hotel. Anyway a superb holiday and wedding had by all.", "title": "Don't believe the brochure photos", "helpfulness": 3, "user": "honest-johnny", "date": "September 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 1.0, "service": 2.0, "rooms": 2.0}, "id": 42141326}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Greek resorts are rarely 5 star bu this is seriously below par.", "title": "Baby Paris her first holiday", "helpfulness": 1, "user": "GAILANDDAVEChorley", "date": "September 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40804641}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 5, "variance": {"poor": 101, "average": 197, "very good": 443, "terrible": 60, "excellent": 731}, "aka": "Mitsis Rodos Maris Resort And Spa", "slim_ranking": 0.384615384615, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}