{"user_rating": 4.5, "review_count": 418, "name": "Moevenpick Hotel Deira", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Excellent hotel, well appointed and maintained. Clean. Staff anxious to serve. Excellent level of English by most staff. About ten minutes from the airport terminal, this means it is not in the most desirable part of Dubai, rather the older part of town. There is a metro stop about 100 yards from the hotel. Bellmen can hail a taxi but this may take a few minutes depending on time of day. Rooms are good sized and well furnished, sound proofing is good, air conditioning excellent. Breakfast buffet is typical European and extensive. This appears to be primarily a business hotel although some airline crews are observed here. Book early to obtain a decent rate.", "title": "Just the facts, ma'am", "helpfulness": 3, "user": "notnecessary", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 180486538}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I booked this hotel for its location and for what it offers, such as a free shuttle to a private beach at the Jumeirah Palm. I booked an executive room as we were in Dubai for a week as part of our honeymoon and the hotel and staff were incredibly helpful and kind. My wife travelled in from Germany while I travelled in from Afghanistan. She arrived early in the morning and when she arrived at the hotel they had our room ready for occupation and allowed her to wait for me in our room without any additional charge. Not only was this a very nice gesture on their part but the room was so incredibly presented. My wife had to take photos as she was worried that she might disturb it before I arrived. The executive room came with additional benefits such access to the executive lounge where we were able to have breakfast in a very nice and quiet environment, complimentary afternoon tea and later complimentary happy hour. Two hours of each! Access to coffee and tea as well as bottled water and soft drinks all day till 11:00 pm each day. Happy hour also came with your choice of alcohol. We cannot speak highly enough of the hotel and its staff and management. You have made our week long stay memorable and we would most definitely stay again. If I could give you six stars I would!", "title": "An Outstanding Experience", "helpfulness": 2, "user": "frankvassallo", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179580027}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Every year I travel Dubai to visit my friends and to explore the beauty of its own.I stayed in Moevenpick Hotel for the second time and what I can say is...\" it's the best place to stay\",because of their excellent service,the staff are very friendly which I met one of them named Jay Dy,he always assist me every time he saw me in the lobby and called for a taxi for my tour.This hotel is full of compliments which treated me like a princess.A hearty, hospitable reception or greeting, as I got a very warm welcome when I arrived and the same thing when I checked out.I will definitely be back in this hotel,an amazing place to recommend.", "title": "\"BEST PLACE TO STAY\"", "helpfulness": 1, "user": "mariauk1983", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179413919}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Luxurious, clean, spacious, 10 min from airport, there’s a metro station in 5 min walk", "title": "Luxurious good hotel for stop over in Dubai", "helpfulness": 1, "user": "Peterson76", "date": "October 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 179405723}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Good buffet breakfast and friendly staff (except some doormen)", "title": "Comfortable and Well Located Hotel", "helpfulness": 1, "user": "gonzodeaddog", "date": "October 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 179388531}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "We are staying at this hotel at the moment. The hotel is lovely and most of the staff very helpful. Unfortunately we did not realise the laws in Dubai state to have a drink you must be 21. We came here on holiday with our twenty year old daughter (soon to be 21) and there is no where at all in the hotel apart from the Indian restaurant we can all sit together and have a drink. She would be happy enough to have a soft drink if we had an alcoholic one but there is no where at all to go. We", "title": "Nice hotel but,,,,,,,,,,,", "helpfulness": 2, "user": "Wendy190832", "date": "September 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 177275967}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "couldn't even sit in the lobby or reception to have a drink. This has totally spoilt our holiday.", "title": "Excellent service", "helpfulness": 2, "user": "travel61addict", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177221021}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "As we arrived very early in the morning, we were very lucky and pleased that the hotel was able to check us in immediately. Mr. Bashar at the reception did a wonderful job there. The hotel itself is very convenient located near the airport and close to 2 stations to reach the touristic sightseeings. Moderately priced this is really a great hotel if you fancy a good bed, a very well equipped large room (executive room), standard facilities and don't want to pay for an enormous lobby or large swimming pool you don't intend to use.", "title": "I wanted more, especially in Dubai", "user": "BR0wNTr0UT", "date": "September 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 177012423}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I want to give this Hotel 3.5* but can't - There is nothing wrong with this hotel but in comparison to others it doesn't warrant more.", "title": "Excellent hotel and service", "helpfulness": 3, "user": "GoranJ", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 175967012}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Positives:", "title": "Good sleep quality", "helpfulness": 1, "user": "ranjeet5", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175638287}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This was Hotel is clean and modern and located in a good location that is close to the Airport and a very short walk to one of the incredible Railway Stations and the excellent Railway. On arrival at this Hotel we were warmly welcomed by the staff at the door and our experience at Check In was faultless, all staff were very friendly and obliging and ready to assist in any way. The rooms themselves are huge with an enormous bed and a large bathroom, tea and coffee making facilities are available, mini bar and a great selection of TV viewing is available. The food in the Restaurants is excellent with a very good selection available, the only criticism is that like most Hotels, the cost in the restaurants was a little expensive. Hotel offers a Shuttle service that will take you to the Souk and Shopping Malls. The only negative that I have is that the Pool was very small and there was limited area available to sit or lay down, but, when the outside temperature was 46 degrees, it was a most welcome relief. Would not hesitate to recommend this Hotel.", "title": "Good Hotel close to Airport and Railway", "helpfulness": 5, "user": "Dreben", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 178355815}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I stayed at the hotel with my wife and four children. We stayed for four nights in the executive level [5] in two executive rooms that slept 6. We arrived around 1145am and the hotel staff were excellent and within 20 minutes were in our rooms. The rooms were spacious and had all the facilities of a 5 star hotel. They even provide an ironing board and iron...which helped us. We had an excellent service from the staff and can say they were 10/10. The breakfast was international with chefs making fresh omelettes etc., to order. The choice and range of breakfast was huge. Air conditioned throughout the hotel and very secure and safe. With the children I can honestly recommend this hotel to all visitors and families. The location of the hotel is around 10/15 minutes to Diera mall shopping centre., Dubai mall around 20 min by taxi and wild wadi about 20 min by taxi....there is a nice shopping area walking distance from the hotel. I have visited Dubai 3 times now over 8 years and stayed in a higher priced 5 star hotel.........but will definitely recommend this one. Excellent service second to none. I WILL DEFINETELY VISIT MOVENPICK AGAIN....Jahid Jan Oxford, UK", "title": "Excellent Hotel", "helpfulness": 4, "user": "Jahid J", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177805556}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed here late July after a long flight from New Zealand. Excellent service, quiet room, extremely welcoming staff who helped us in every way possible. Could fault nothing - Absolutely 10 out of 10!", "title": "Excellent", "helpfulness": 1, "user": "sallie005", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177581542}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Ariel in the executive lounge 5th floor was great help, he was always welcoming, smiling and really great and helpful to us and he would us feel Asif we are at home. Great person Ariel most recommend.", "title": "Amazing", "helpfulness": 1, "user": "Ali7861", "date": "September 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177521681}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We stayed at this hotel for 10 nights from 8th of September in the fifth floor in the executive room. We arrived early at 9am and the receptionist checked us in within 1 hour which was excellent. I received excellent service from all the staff especially Imran, Shah and Bong who were extremely friendly and were allways there to help with the strollers and bags whenever we left or returned to the hotel.", "title": "Excellent service", "helpfulness": 2, "user": "ukusman", "date": "September 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177520049}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Hi,", "title": "Only one word \"WOW\"", "helpfulness": 1, "user": "ibrar a", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179202818}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Me and my father stayed at Movenpick Deira from 18/9/13 til 25/9/13 on the 4th floor. This was a pleasure visit to Dubai for both of us, I travel to Dubai every year, but this hotel was a first.", "title": "Another great visit", "helpfulness": 1, "user": "Beaklington77", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179166789}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "From the moment we stepped in we were treated like royalty's, to our luck, we were attended by a chap called \"Mr Fadi\". he took care of our signing in.", "title": "Top people make it a top place", "helpfulness": 1, "user": "Kayva", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179053766}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "This hotel staff are a true exceptional and a credit to the business and industry. Whilst our stay we were assisted by Mr Fadi, Mr Nishat, Mr Chad.", "title": "It's the best", "helpfulness": 1, "user": "kamran m", "date": "September 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 178813225}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Through our stay Mr Fadi greeted us every day as we passed reception and made us feel welcomed. He helped us by advising us where to go and arranged it for us.Without Mr Fadi it would not have been the same.", "title": "Excellent hotel and staff.", "helpfulness": 4, "user": "andy d", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178424942}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 5, "variance": {"poor": 9, "average": 39, "very good": 118, "terrible": 3, "excellent": 249}, "slim_ranking": 0.106609808102, "description": "Located in one of the most diverse and culturally rich parts of the city Mövenpick Hotel Deira is ideally situated, just ten minutes away from Dubai International Airport and from the world-famous Gold Souk. Close to several shopping malls and the Dubai Metro, the hotel is well-placed for guests wanting to explore Deira’s vibrant winding and historic Creek area, were local \"abra\" water taxis ply their trade. Guests staying in any of the hotel’s 216 rooms will be attended to with exceptional hospitality by the renowned Swiss hotel group Mövenpick Hotels & Resorts. From the seven naturally-lit meeting rooms, including a fully-equipped business centre, to the hotel’s restaurants, Mövenpick Hotel Deira offers five-star service to business and leisure travelers alike."}