{"user_rating": 4.5, "review_count": 139, "name": "Mohican Lodge and Conference Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My husband and I stayed here for two nights on June 16-17, 2012. We selected the lodge because it was very close (less than 10 minutes away) to the starting point for the Mohican Trail ultrarun (my husband ran the 50 mile race!)", "title": "Beautiful Location!", "helpfulness": 1, "user": "starhawk", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132783617}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The good:", "title": "Look at your sheets!!!", "helpfulness": 3, "user": "xXHoteldudeXx", "date": "June 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 132624827}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Great location if you're participating in the Mohican ultra. Easy to get to from Cleveland Airport. Incredibly friendly and helpful staff. Got free Starbucks coffee from the gift shop close to closing time from the sweet cashier; a free toothbrush from the front desk after I forgot mine; and the waiter (Matt) in the restaurant was super accommodating and helpful when we told him my husband was vegan! The room was large, with two armchairs, a king sized bed, a desk, entertainment cabinet, and dresser. The bed was comfortable and the linens were surprisingly soft. The toiletries had a nice fragrance, and the food at the restaurant was very good ($8.95 breakfast buffet rocked - pancakes, eggs, bacon, fruit, etc. and the coffee was good). The view from the restaurant patio over the lake was spectacular and there are lots of hiking trails around the lodge (ask the front desk for a map). There seemed to be fun activities for families as well, there were lots of kids at the pool and at a forest ranger-led info session for kids. Relatively large LCD TV with DVD player and large mini-fridge. The room had solid oak furniture with plenty of storage. Free, easy WIFI in the rooms!!", "title": "Average and Dated", "helpfulness": 1, "user": "mooseman325", "date": "June 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 132603033}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The not so fabulous:", "title": "Family get-away", "user": "Stephanie P", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 132592935}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The price for the room was really steep (over $160 per night) for what you get. The room was somewhat freshened although it could use some more. The furnishings were pleasant but low-to-mid end (the whole updated rustic vibe kind of saves it). The fixtures on both sinks (there are two - one inside the bathroom and one right outside the bathroom) were updated but loose and moved around a bit when you turned the faucets. The lights were no match for the darkness and it got pretty dim at night. Housekeeping was ambivalent at best. Bed was a little haphazardly made and the cleaning was okay but not fantastic. Pick up supplies before you get there, because it's a fair trek to get to a supermarket, drug store (there's a little one in Loudonville), etc.", "title": "Overall - great visit", "user": "Fmly_o_5", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132368477}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our family stayed here in April. The room was spacious and clean. The lobby area and gaming areas were clean and well-maintained. The restaurant had a spectacular view. The menu was somewhat limited, but the food was very good. The breakfast buffet is a little pricey, but unless you bring your own food, there is no alternative. The indoor pool area is clean and could benefit by having a few more towels on hand. The HVAC unit ran nonstop and the bed was a bit soft for my liking. Nevertheless, our family had a great time. You can borrow board games to keep the children entertained as well.", "title": "Great Family Getaway", "user": "CurseReversed", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129315813}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very impressed with this state lodge, did not know what to expect, but we could not have had a better time, excellent employees, very friendly, very clean rooms, rooms were bigger than expected, excellent grounds, really enjoyed the lounge and restaurant. Highly recommend, if you are considering, make your reservations, you will not regret it, Great Value", "title": "Wonderful Lodge", "user": "Aviator500", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128399213}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I am definitely impressed with Mohican Lodge. Check-in was quick and friendly. The room was very clean and spacious with a gorgeous view of Pleasant Hill lake. The bathroom had been recently updated. The bed was comfortable as well. The swimming pool and area was clean, with the water temperature being perfect. I wish we could have had more time to enjoy the lodge as we only stayed overnight! Had breakfast at the restaurant, and the food was excellent! Thanks for a great stay!", "title": "WONDERFUL TRIP TO HOLMES COUNTY", "user": "Ilovetotravel96", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128111798}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "As a travel agent, I highly recommend this lodge.", "title": "A Great Family Retreat", "user": "Christy W", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127383432}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We had no idea what to expect upon our arrival at the lodge, but when we arrived we found the lodge and our room to be clean and spacious. Our room had a great view from the balcony and we were able to enjoy watching nature~ we even saw a bald eagle! There were so many things to keep us entertained during our stay; we enjoyed the indoor pool, the tennis court, and shuffle board. We also had a great time hiking on nearby trails. We chose to dine at the lounge and what a great choice! The food was delicious. This was a very affordable trip for a family of four. We are already planning our next retreat.", "title": "A great place to meet friends...", "user": "GalionGuest", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127242498}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Mohican Lodge was very clean and the service was great. Its a little pricey. The area is beautiful. We have stayed before and will again. Extremely helpful staff and very friendly. Stuff to do no matter what age..", "title": "Very, very nice lodge", "user": "matthewdick", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131892225}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My family and I absolutely love Mohican Lodge. The rooms were very clean and comfortable. The bathroom in some rooms have yet to be updated but they are very clean. The staff was very friendly and knowledgable of the area. We can't wait to go back. The pizza in the lounge area was very tasty!", "title": "Very friendly staff", "user": "Julie M", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131439847}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My mother and I went to Mohican Lodge the weekend before Memorial Day. The weather was perfect, the views were lovely, the lodge wasn't terribly crowded, and everyone was helpful. This was not our first stay there. We like the lodge so much, along with the area, we plan on returning again.", "title": "beautiful views, lovely area", "user": "lcommisso04", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131142887}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There are some really nice paths to walk around, so bring your tennis shoes.", "title": "Our get away vacation!", "user": "Marty S", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131095783}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I had not had a vacation in ten years , and I also had recently quit my job due to the stress. We were looking for somewhere to \"just get away\" for a couple of days of solitude. We found that at the Mohican Lodge! Our room was comfy cozy! We were able to leave the balcony door open at night to let the breeze in.... And in the morning, we awoke to birds chirping.... It was awesome! We also used the pool and sauna which were both so relaxing and enjoyable. Food in the dining room was fabulous! No matter what we ordered, it was like eating in a gourmet restaurant. The staff at Mohican was always willing and ready to meet any requests we may have had. My husband and I TOTALLY enjoyed our stay... So much so, that we did not want to leave! THANK YOU SO MUCH TO THE STAFF AT MOHICAN LODGE!!!!", "title": "Great Lodge!", "user": "Sarah M", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130035797}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I was so impressed with Mohican Lodge. I had read the reviews on Trip Advisor before booking our stay. The Lodge was peaceful and family-friendly. Very clean and the room was very spacious. Everything smelled clean. (A biggie for me). The bed was so comfortable. And I couldn't believe the price...very affordable. Our balcony overlooked the woods...it was beautiful! We will be back!", "title": "BEAUTIFUL! We loved Mohican Lodge!", "user": "Adrianne S", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127029487}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The lodge is just a couple of hours from cleveland but you really get a chance to disconnect. I always feel very refreshed by the time I return. The staff is better than most 4 star hotels that I have stayed in throughout the US and abroad. Friendly, attentive, but not intrusive. I just love this place.", "title": "I just can't stop raving about the place.", "user": "Mikeld2010", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126877211}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This a great place for families, in the off season it can be a great place for couples or older adults. We visited in February mid week and there were only 8 other people in the lodge. There is a wonderful fireplace to gather and the lake is a short walk away.", "title": "Really enjoyed it.", "helpfulness": 1, "user": "chino53", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125710549}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "There is an indoor pool and sauna. (Be careful though, the day I visited the chlorine in the pool made my eyes burn for hours afterwards. ) There is an on site restaurant and lounge and you are allowed to bring your drinks and sit by the fire.", "title": "First Class!", "user": "cardin11", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125351132}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The best thing for us though, was that the lodge was PET FRIENDLY! We were able to bring our older two dogs and they had such a good time! I highly recommend the hiking trails to Lyons falls. The Mohican river is known for its canoeing and there are many canoe liveries in the area.", "title": "Incredible Experience", "user": "Nathan R", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125032713}], "location": {"country": "United States", "city": "Perrysville"}, "variance": {"poor": 7, "average": 12, "very good": 31, "terrible": 3, "excellent": 86}, "aka": "Mohican Hotel", "slim_ranking": 1.0, "description": "Overlooking picturesque Pleasant Hill Lake and surrounded by forests and gently rolling hills, Mohican Lodge and Conference Center is a 90-minute drive from Columbus or Cleveland. We offer 96 guestrooms, all with private balconies. Bromfields Dining Room is open year-round offering breakfast, lunch and dinner. The lodge also offers a full-service cocktail lounge and gift shop. Enjoy swimming, boating, hiking and horseback riding, as well as golf at nearby courses or a zipline tour through the tree tops. For group gatherings, we feature fully equipped meeting rooms, professional on-site meeting planners and a variety of planned or customized packages."}