{"user_rating": 4.0, "review_count": 1066, "name": "Mohonk Mountain House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My wife and I just returned from Mohonk after spending two nights there with our three daughters. From the moment we walked into the hotel, we were treated with excellent service. The staff was very customer oriented. Our large lake tower room was cleaned by housekeeping before we returned from breakfast.", "title": "Great Service, Great For Families", "helpfulness": 4, "user": "Marc J", "date": "February 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4472105}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "If you are interested in an activity or outdoor oriented vacation in an atmosphere that is welcoming for families, Mohonk is for you. Our daughters enjoyed ice skating and swimming and of course the large dining hall buffet is great for families.", "title": "Don't Go! Mohonk under Asbestos Abatement & Bad Service!", "helpfulness": 21, "user": "beigekc13", "date": "February 17, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4467921}, {"rating": 5.0, "title": "Thank You Mohonk for keeping the standards high!", "text": "If you are not going to take advantage of the spa or the beautiful outdoor amenities, Mohonk probably is not right for you.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4448486}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "For two nights, we had a great time. I strongly recommend this as a great short trip for families.", "title": "Nice place, but a few things to be aware of...", "helpfulness": 28, "user": "molin", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 4360719}, {"rating": 5.0, "title": "Gorgeous, unique hotel experience", "text": "We went to Mohonk for a second time expecting a quiet , relaxing, romantic birthday & Valentine's day. It was anything but that. We were put in a room right next to closed off construction area for asbestos abatement.We asked to be moved to a quiet room away from construction so they put us down a floor to solve the problem. We were awakened at 8 am by hammering & sawing. Incompetent \"kids\" at the front desk did not even investigate to see if the room we were being moved to was in fact away from construction.We left the room to go to breakfast only to be blinded by flying dust, and maybe even asbestos.Complained to the manager. Nothing was done. I had to keep on asking to have a room change & for them to close doors to construction. Any self- respecting high end hotel would have immediately taken care of the problem, and offered a reconciliary room upgrade .Not this one. Manager seemed just as incompetent & clueless as front desk \"kids\".", "helpfulness": 26, "user": "A TripAdvisor user", "date": "January 13, 2006", "id": 4350325}, {"rating": 5.0, "title": "Beautiful escape!", "text": "This place was wonderful. Great hiking trails, beautiful scenery, friendly staff, and very romantic. There are many activities you can participate in. I highly recommend this place. The dinner menu needs improvement but the place overall is something not to be missed.", "helpfulness": 10, "user": "Evie049", "date": "March 13, 2006", "id": 4614887}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "I have been going to Mohonk for years. Now with the added Spa it has crossed over from wonderful escape to heaven. My husband and I went up pre Valentine's day... we saw the workers doing construction but we never encountered any problems in the area. We LOVED the spa. And yes, there is music underwater in the pool. I suggest a relaxed mid week visit... The food has improved alot in recent years and the emphasis on fresh produce and fruit makes healthy choices very easy. Just let me say I'm going up again with friends next week for a girls getaway. For people who \"get\" Mohonk it becomes a special part of their lives.", "title": "Amazing Mohonk!", "helpfulness": 8, "user": "alexmaui", "date": "March 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4591636}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I stayed on a Sunday through Tuesday and got a special deal that included breakfast and dinner. The rate did not include lunch. We did not miss it. We had never stayed here before and had wanted to for many years. We stayed three days and two nights and checked out on Valentine's day and our entire stay was fantastic. We loved our warm, quiet, and cosy room, the incredibly picturesque surroundings both inside and out, and the snow was perfect. We also had a balcony that overlooked the mountains, and we went out on it several times. We had a very pristine private bathroom with a real claw foot tub too.", "title": "A Victorian Paradise in the Mountains", "helpfulness": 22, "user": "LoraLee S", "date": "March 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4579296}, {"rating": 1.0, "title": "What happened to the decent folks who once ran this place correctly?", "text": "Some of the reviews here are so unfair to this place and frankly, I am shocked at some of the things people say about this gorgeous resort. We thought that the food was excellent, expecially for dinner and the custom made omelettes in the morning. There were NOT ANY poor quality issues. We encountered friendly and helpful staff all throughout the hotel, but then again, we are very friendly and kind people. We find that we get excellent service ALMOST everywhere when we appreciate people and smile and look at them in the eye instead of treating them with distain like we noticed that some guests did during our stay. We especially noticed this at dinner. We had fantastic and personal service, and kind and friendly waiters, with cuisine bordering on the sublime. Local gourmet cheeses and other unique ingredients were showcased, to our delight. The cookies at the informal Afternoon Tea were surprisingly homemade tasting.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4568337}, {"rating": 4.0, "title": "My experience!", "text": "I think that one of the perceived problems with this resort is that they charge according to the room you choose and the meals are included. People think that the better the room they pay for, the more outlandish the food should be. Everyone gets the same food, despite paying $250 or $2000 per night. If you do not like this arrangement, stay in the smaller rooms. Ours was extremely nice and had beautiful mountain views even though it was NOT on the lake side of the hotel.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 26, 2006", "id": 4522238}, {"rating": 4.0, "title": "Majesty in the Mountains", "text": "When planning a trip to the Hudson River Valley area, I came across a picture of the Mohonk Mountain House and knew I wanted to stay there. I booked reservations for my husband and myself and our good friends. We got a lake view room that shared a bathroom (although after we got there we found one room had a small room with a sink and mirror.) Later, I found this website and read the reviews. It gave me great concern that I had paid a huge sum of money for a place that would be run down and the food not fit to eat. Surprise, surprise. Our room was fine - old, but clean. Sharing the bathroom was no problem. We each had our own balcony. And we thought the food was good. We went sightseeing one day and they fixed a sack lunch for us to take. Even that was a wonderful meal when you are outside taking in the beauty. We had no problems. The views are to die for and to be honest, that is what you are there for. It is such a peaceful place. It is expensive but we thought it was worth it all things considered.", "helpfulness": 17, "user": "nantippe", "date": "September 28, 2005", "id": 3945635}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Mohonk Mountain House is a very special place. It is located at the edge of a mountain top lake, surrounded by thousands of acres of some of the most beautiful natural landscape in New York State. There are vistas across the Hudson Valley from a mountaintop tower, vistas across nearby valleys, vistas across the beautiful namesake lake. The property is laced with miles and miles of hiking trails -- from gentle walks to highly technical scrambles. For those looking for a place to relax away from the hustle, bustle and noise of the city, surroundings don't get more restful than this. You are away from traffic and it only takes a few minutes walk from the hotel to feel that you are completely alone -- even when the hotel is full, the trails are extensive enough that you can quickly be on your own. The mountaintop lake is a terrific place for swimming. A very small beach area along with two floating docks provides access. The beach often gets crowded in the summer, although the new indoor pool may relieve the crowding somewhat. For most of the time, there is a good sized roped area for swimming with a diving board that kids love. A couple times a day, they open up the ropes for a cross lake swim -- very special if you don't mind the 50+ feet deep water.", "title": "Beautiful landscape, special place, but very very expensive", "helpfulness": 29, "user": "Marhaba", "date": "September 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "service": 4.0}, "id": 3936817}, {"rating": 5.0, "title": "Love this place!", "text": "The hotel itself is a rambling, occassionally creeky place, with lots of nooks and crannies for sitting, reading and relaxing. Lounges and balconies galore, although owing to the owners' beliefs, a bar was only opened this year (and even now, it is tucked away in a spot with no view - almost as if the family is slightly embarrassed by its presence). Hallway floors slope up and down, walls bulge in odd places, doors creak open and occassionally stick. If you are looking for Four Seasons perfection, this is not it (not a bad thing - just don't want anyone to be surprised, because the rates could lead you to expect 4Seasons perfection if you have not been here before). It is not rustic by any means, but definitely quirky.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 12, 2005", "id": 3897157}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "Rooms, except for tower suites, are generally small, although all have balconies with consistently excellent views. Furniture and other room items are a bit tired and bathrooms are really nothing special (particularly for the high rates that are charged). Many rooms do have fireplaces, particularly the Victorian category -- remember to ask. The hotel has installed air conditioning in all rooms in the last couple years, although I don't think this was really necessary even in the summer -- the churning air conditioners also take away a bit from the peace and quiet that is the essence of Mohonk. There are no TVs in the rooms, but refrigerators can be brought in on request (tower rooms have them automatically). Hallways are not airconditioned (who cares), but dining rooms are. Mohonk has recently adjusted its dress code, with jackets no longer required for dinner in the buffet restaurant (I believe the waiter served dining room still does require or at last suggest jackets).", "title": "We make an annual trip to Mohonk", "helpfulness": 16, "user": "Homergirl", "date": "August 31, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3833624}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "There is a myriad of activities here, many family friendly and virtually all free. The lakefront beach has a giant closet full of beack toys, there is a skating rink in winter with free skate rental, hikes are led by guides, movies are shown on the lawn and viewable from the front porch (free popcorn provided), croquet and a putting green flank one entrance of the hotel, a hedge maze provides a place to run and hide with kids, canoes and paddleboats are plentiful and free, there are musical performances at night on summer weekends, tennis courts and platform tennis are out the front door. The list goes on and on. Again, virtually all activites except horseback riding and the 9-hole golf course are included in the rates. Mohonk rates are American Plan Plus -- not just three meals a day, but even afternoon tea is included in the rates. Food is good, but not great, although dinner entrees have been getting consistently better.", "title": "Mohonk Mtn House - amazing place but very expensive", "helpfulness": 21, "user": "Ushuaian", "date": "August 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 3814684}, {"rating": 5.0, "stay_parameters": "Stayed January 2002", "text": "It's been a few years since I last stayed at Mohonk, but I remember everything about the stay well because I have loved the place since I first stayed there as a child more than 50 years ago. Some things have changed for the better -- they used to forbid card playing in public (my family was made to feel bad because we didn't know this). And I'm very glad air-conditioning has been installed in the dining rooms; mostly there's a breeze, but sometimes in the summer the dining room was unspeakably hot, and men were still supposed to wear coats and ties at dinner. I'm glad about some of the things that haven't changed, such as that the rooms don't have televisions; those of us who like to stay somewhere quiet will enjoy that, and those who are addicted to noisy televisions are free to go somewhere else. (Unfortunately, it is now possible to get a television in your room for an extra charge, so I guess I can't count on my room being quiet any more.)", "title": "My favorite place to stay", "helpfulness": 20, "user": "beadcraft", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4320848}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "One of the features of Mohonk that I haven't seen discussed in other reviews is the quality of the trail marking and the maps of the trails (most of the trails are now part of the Mohonk Preserve). I've never been anywhere else where I could walk a substantial distance and feel safe that I wouldn't get lost, because the trail markings are so clear and the maps so intelligible. When I was younger and felt sure-footed, I would use some of the rougher paths, but there are still wonderful carriage roads where one can go for miles without seeing motorized vehicles while still walking on a level surface. If one is walking quietly, there is a good likelihood of seeing deer. And on many of the paths, there are beautiful handcrafted gazebos (made from fallen branches of local trees), with wonderful views out over the valley or the lake. Some of the gazebos jut out over a substantial drop, but they seem reassuringly sturdy (I assume there are people checking them periodically, because there often seem freshly repaired sections). It seems to me that when people are discussing the cost of Mohonk, it's only fair to take into account the huge costs for maintaining all those miles of trails, all those gazebos, the gardens, and all the public areas that are pleasant to sit in. A lot of luxury hotels have beautiful rooms, but they rarely offer wonderful areas to sit around in the public parts of the hotel.", "title": "Mediocrity at Mohonk", "helpfulness": 16, "user": "Chellco", "date": "January 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 4.0}, "id": 4319919}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "I know Mohonk is expensive, but I still think it's a great value for what it provides. I think of it as a very special place that's wasted on people who don't value its special appeal, and it's also wasted on those who are so unable to entertain themselves that they need television in their rooms. For me, I'm quite content with the television in the public rooms if there's something special on, and otherwise, I'd rather go and read in the comfortable library, or sit in a rocking chair on the porch, or go for a walk on the trails.", "title": "Hot and Bothered-But Love this Place", "helpfulness": 18, "user": "tessiebud", "date": "January 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4316215}, {"rating": 1.0, "stay_parameters": "Stayed July 2002", "text": "As for the food, I've never wanted Mohonk to be the kind of gourmet experience some people want. I've always found the food to be adequate, and sometimes wonderful in its own way (creamed finnan haddie may not still be on the menu, but I used to love it).", "title": "Inhospitable Hospitality", "helpfulness": 31, "user": "LonelyAvenue", "date": "November 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4103112}, {"rating": 2.0, "title": "beautiful area But!!!!", "text": "I visited the Mohonk Mountain House with my boyfriend on December 1-3, 2005. Although we had a wonderful time, Mohonk is not worth anything near the $600+ per night charged. Sure, the grounds are spectacular, & there are plenty of activities for people of all ages (ice skating, hiking, trips to town, etc). Further, the newly remodeled gym is more than adequate, and for those who enjoy swimming, Mohonk boasts a very nice pool. However, the food (other than breakfast & afternoon tea) is barely edible -- I lost about 3 pounds during our 2-day stay at Mohonk. Further, while our room (6th floor, in a windowed turret w/a fireplace) was quaint, it was also dated. In fact, the entire resort is very dated -- it was probably very exclusive in the seventies, but that decade is now long gone. In sum, I recommend a trip to Mohonk, but only at a discounted rate.", "helpfulness": 29, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4006131}], "location": {"country": "United States", "city": "New Paltz"}, "variance": {"poor": 89, "average": 99, "very good": 275, "terrible": 62, "excellent": 541}, "aka": "Mohonk Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "A hotel, built in the 1860's and filled with charm...ideal for families in summer."}