{"user_rating": 4.5, "review_count": 841, "name": "Monaco Baltimore, a Kimpton Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Ever since my husband and I stayed at one of your hotels last year (when we were engaged), nothing compares. Last summer, we needed a break from the stresses of life, but money was tight, so we stayed in area. We live in Baltimore, but I never actually spent time at the harbor; so for our stay-cation, we made accommodations at the Hotel Monaco in Baltimore – and we got spoiled! When we booked the room, we originally intended on seeing different attractions in the area, but once we got to the room, it was hard to leave!", "title": "The Perfect StayCation", "user": "Moore777", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117421592}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First of all, we loved the luxurious décor and the warm colors, both inside the room and throughout the hotel. We also fell in love the huge king size bed; now our queen-sized bed at home, (or anywhere else we stay), seems too small. We also loved the spacious and alluring bathroom; now, when we stay anywhere else, we feel like the bathroom is inadequate - no matter how nice it may seem. We also loved the fact that we could control the temperature of the room instead of just having the air either off or on. We were also glad that the room had a flat screen TV (like what we have at home), and that the cable was NOT limited (like it is in other hotels). In our entire three-day stay, we only left the room maybe three times; out of those three times, we only actually left the hotel once. The other two times we left our room, was to eat at the hotel’s restaurant (where the food and service was exceptional) and to explore the rest of the hotel. My husband and I have very sedentary lifestyles, but we even loved the gym! We actually worked out together and had fun (which was something we always wanted to do but had never done).", "title": "Love it! They went above and beyond to make this a wonderful experience!:", "helpfulness": 1, "user": "Jeremiah S", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117351418}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We have nothing but good things to say about this hotel chain. Our stay at the Hotel Monaco in Baltimore was an experience that we will always remember. It was just what we needed. Our only disappointment is that we couldn’t stay longer. We got married this year (in May), and wanted to stay at Hotel Monaco again, but money is still tight. We didn’t even have a wedding, (just a very small, short private ceremony.) We stayed somewhere cheaper (about 30 minutes from home). It actually pretty nice, but it wasn’t the same. We kept comparing everything to Hotel Monaco and didn’t enjoy our time the way we could have. So I want to surprise my husband by staying at the Hotel Monaco in Baltimore for his birthday in December. I don’t get excited about many things, (and neither does he), but I can’t wait to stay here again! I only wish we could stay more often!", "title": "Great value & services", "user": "bom2535", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117068626}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I got married right before hurricane Irene hit and therefore out travel plans out of Baltimore were cancelled. We found the Monaco online and thought lets give it a try just to get out of the house for our celebration. We were greeted by friendly and helpful staff who jumped right on dinner reservations for us with out even being prompted. When we walked into our room - Mediterranean Room - we were welcome by champagne and chocolate covered strawberries with notes of congratulations! Rose petals lead us through the beautiful room and fabulous spa bathroom!!! So romantic and decadent!!", "title": "Beautiful and Perfect Hotel!", "user": "emtgirl14", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117060933}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The gold fish roommates were one of the main reasons we picked the hotel and the little cuties greeted us too! Next time we come we know we will want to bring our puppy since they are so pet friendly!", "title": "Another wonderful Kimpton property !", "user": "MrCsMd", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117000646}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Went to Baltimore for a family vacation and stayed at the Monaco, mostly based on previous reviews on Trip Advisor. The previous reviews are extremely accurate! The Monaco was fantastic. It is in the building that was the world headquarters for the B&O Railroad. The entire entranceway to the hotel is marble and just a breath-taking entrance. The Valet/Bellman was immediately ready to assist us with the bags. The Front Desk staff was extremely friendly. Our room was a two double bed room. The room was cozy...a little small, but we didn't feel crunched in. The room had a \"bonus\" room, which was very odd. The bonus room was empty and really had no function as it was very small and probably could double as another closet. The bathroom and room were very clean, even spotless. The kids enjoyed complimentary cookies and milk in the afternoon. The hotel also had a Wii gaming system available in one of the lobbies for the guests to use. The hotel is very close to most attractions. We walked to Camden Yards for a Baltimore Orioles game. The Ravens stadium is just a little further, but certainly within walking distance. The National Aquarium and the Inner Harbor are also just a short walk from the hotel. The B&O Brasserie Restaurant at the hotel was clean and had courteous service. They ran a special where kids eat free through the summer time... BONUS! Took other Trip Advisor's recommendations and parked around the corner in the public parking. It cost me much less than utilizing the valet parking.", "title": "Awesome Hotel Within Walking Distance To Everything Baltimore", "user": "Burgs4862", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117727636}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed here for a long weekend and brought our dog for his first hotel stay, choosing it merely because they welcome pets. Not only did they make our dog so welcome (doggy bed, treats, maps to dog parks nearby) but it is a great hotel with an attentive staff and modern, luxurious rooms.", "title": "when they say they are pet-friendly, they MEAN it", "helpfulness": 1, "user": "nicoletravels", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117680187}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I stayed here quite a few times and this place is amazing. The staff is very professional and welcoming. The rooms are simply beautiful! This is a really upscale hotel and its the best in Baltimore! I've stayed in quite a few hotels in Baltimore! And let me mention the restaurant....just fab!!!! If you want to experience a perfect hotel visit...stay here! Feels like home! PS....they are pet friendly and treat the pets like royalty! My min pin Diesel loved it! And they are good at calling you by your last name...its as if they knew you your whole life! I loved hearing....Hey Ms. Anderson! Just FAB!", "title": "GREAT HOTEL WITH A GREAT STAFF...BEST IN BALTIMORE...STAY HERE!!!!", "user": "MzAmerica", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117637558}, {"rating": 3.0, "title": "For a Kimpton, I was a bit disappointed.", "text": "Kimpton has become my favorite chain. So I was a bit disappointed in the lackluster service at this one. As others have noted, the building is a grand old thing, with typical stylish Kimpton furnishings. But I shouldn't have had to ask 3 times for a yoga bag to be delivered (the one I requested in my on-line reservation) or the non-feather pillows. (Curiously, the bag lacked even a strap -- though if you turned on the available Yoga routines on the Kimpton channels, straps were \"required\" for many of the exercises.) The staff was exceedingly polite, the room was comfortable, and parking -- mandatory valet -- was $36 a night. Make sure you join their frequent guest club to take advantage of the free internet and raid-the-mini-bar. All guests enjoy the complimentary drink-and-snack reception in the evening.", "helpfulness": 1, "user": "SirBowen24", "date": "September 3, 2011", "id": 117637448}, {"rating": 5.0, "title": "I have stayed here several times - first class all the way", "text": "Note that at night the neighborhood does get a bit deserted; not necessarily to the point of feeling unsafe, but walking around I was certainly on my guard, so I would probably choose a slightly different area. Otherwise, not much to say. Other than the a-typical service issues, it's your standard upscale Kimpton.", "user": "C Z", "date": "August 31, 2011", "id": 117493734}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was the official hotel for our wedding in February 2013. The historic building is gorgeous. and the staff works very hard to meet your needs. The Mediterranean Suites are huge with separate living and sleeping areas along with an enormous bathroom with jacuzzi tub. There are still some kinks to work out such as smoking by the valet drivers but overall the enthusiasm and effort of the staff makes this a good hotel to stay at when in Baltimore.", "title": "Staff tries very hard", "user": "dnumgis02", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156088162}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I recently stayed at the Monaco as they had gotten great reviews here and had no pet surcharge, which was a tremendous value over other hotels. The booking process was great and when I explained that I was a Hilton member, I was told they were making a note to \"impress me,\" which was nice. When we arrived, however, the front desk person seemed a bit out of it. I asked for a high floor and an isolated room since we have a dog that barks. He basically nodded and we were given a regular room somewhat by the elevators. I ended up having to upgrade at my expense and waited some time to get the key and move. I later learned (and wish he had told me) that the 10th floor is the designated pet floor, which is fine, but I don't understand why he didn't mention it. The upgrade to the suite was the right decision, it was lovely. The architectural details and soaking tub are great and it was easier to keep the dog in the bedroom when we weren't there. I later received a call from the manager about the wait time (I think) and was sent a bottle of wine, which was nice, although a bit random. The room service was good as well. Seemed a little dead at night in the area though. Overall, I would recommend.", "title": "Good but some inconsistent customer service", "helpfulness": 1, "user": "kateinphilly", "date": "March 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 156053304}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We had the pleasure of staying at this hotel while visiting family. From the moment we arrived to he day we left all the staff made us feel at home. They remembered our conversations day to day and talked to us about dinner plans and gave us reviews about places in town. When returning they remembered and asked how we enjoyed the restaurant or touring adventure. The rooms were huge, sound proof and super clean. The city view was exceptional. There was a nightly wine and snack hour which we found relaxing too, Although there was no pool there was a whirlpool bath and exercise equipment was great. They even had my favorite, a hoola hoop. The breakfast was ample and fresh, service again was great. Marble stairways, chandeliers, awesome from top to bottom.", "title": "Perfect in every way!", "user": "tkasper3", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156019855}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "This hotel was originally the headquarters for B & O Railroad. Stunningly gorgeous marble staircase and Tiffany stained glass windows in the entryway. Our hotel room was very roomy with large windows and 12+ ft ceilings and the bathroom (gorgeous tile and granite) was quite large as well. Very, very nice place! The location was great as well: about 4 blocks to the Inner Harbor. Service was friendly and attentive and the wine hour in the lobby was fun and relaxing... Great way to start your evening and end a day of touring! I can't wait to go back!", "title": "Love this beautiful hotel and historic building!", "user": "chkirkpatrick", "date": "March 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155966318}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I couldn't have asked for a warmer welcome after a sketchy cab ride from the airport!! I was traveling with a friend and we were exhausted after a marathon and a busy weekend in DC. Upon check in we were greeted with an extremely helpful employee who promised to arrange a car for us in the morning. While carrying up our bags the bell hop mentioned that we missed the complimentary wine hour and offered to bring us a glass. He returned with a fresh bottle of wine and two glasses. The hotel itself is beautiful and historic. The rooms are amazing and they offer C.O. Bigelow (for someone who travels a great deal, the toiletries are important) toiletries. We did not have the opportunity to venture out in to the city so I am not able to review the location but I would definitely recommend and revisit this hotel.", "title": "A welcome relief!!", "user": "Dannelle S", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 155765867}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I always stay in Kimptons if they are available where i travel. Great stay for business travel. I love the free wine hour, and the staff at this kimpton in particular were very helpful. Also it's in walking distance of some good dining options, which is always a plus.", "title": "Stay in Kimptons whenever you can.", "user": "nancy t", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154867806}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "First time at a Kimpton and it won't be my last. This property is centrally located in Downtown Baltimore and close to many of the prime sites and on the free bus line through the hart of Baltimore. Leave your car and take the bus to explore the city as parking is difficult and expensive downtown. The turn of the century style is very grand. The lobby is one floor up with no signs to steer you upstairs, but you'll figure it out. The elevators require your room key to get to your floor, a nice security feature that they should mention when you check in - but you'll figure it out. Surprisingly the Hotel does not have a pool but does offer a small workout facility. Would definately go back.", "title": "It all there.", "user": "H T", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154805918}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed one night at the Hotel Monaco and were very satisfied. The hotel is in a beautiful historic building. We were visiting both the Inner Harbor and Camden Yards, and the hotel is just a short walk to both. Nice area, and we had no concerns about safety walking in the area of the hotel even at night. We travelled with our teenage daughter and her friend, and stayed in one of the rooms with the 2 double beds and 2 bunk beds. This was perfect, as the girls liked having their own space with a TV and xbox. This hotel is the cleanest that I have ever experienced. There is free wifi if you sign up for the kimpton rewards type program ( it's free to join). The free wine hour in the evening is nice.", "title": "Spotless and great location", "user": "Donna B", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154803126}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "There were a few things that could be improved- an inroom coffee maker is not provided unless you ask for it- I think this should be a standard amenity. Also, there is an in room fridge, with mini bar, but the items are ridiculously expensive. 6 dollars for a bottle of water, 5 dollars for a very small bag of chips, 40 dollars for facial cream, etc. Excessive pricing even compared to the usual high prices of these items in other hotels.No soda or snack machines are available in the hotel. I found it somewhat annoying that upon entering the hotel lobby, there is no sign or anything directing customers to go up to the next floor to check in. There is a reception desk in the entrance area that was not staffed, and although hotel employees were standing around chatting with each other, no one could be bothered to direct us to check in one floor up until we interrupted their social hour to ask.", "title": "Stunning rooms", "user": "Erica G", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154792949}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Super friendly staff, wonderfully decorated and efficiently stocked rooms. In close proximity to the 1st Mariner Arena and semi close proximity to other major venues. The building itself is old and beautiful with modern, updated amenities and fixtures. There is no signage, but when you come in off the street, check-in is on another floor. Go to the elevator and go to \"L.\"", "title": "Convenient, lovely and reasonable", "user": "DotD", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154566687}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We live in Baltimore and booked this hotel as an in-town get away because we got a great rate. Thrilled that we did. The Monaco was fabulous. The overall building is impressive. Historically significant and decorated very nicely. The ammeneties and staff are top notch. At check in I forgot to print a paper I needed and the person who checked me in llowed me to use the business center free of charge to print the paper (normally $8 for 15 min. which si quite expensive). Our toddler was a last minute addition to our stay and I emailed ahead to let the hotel know. They already had a pack n play in our room waiting for us. They also sent a goldfish up to our room (I reqquested one knowing it was a Kimpton option) and my daughter thought it was the coolest. And they gave her a Disney Princess coloring activity to do.", "title": "Excellent stay. Good location. Great staff. Clean.", "user": "RLP144", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155434422}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had a King Premiere room that was large, comfortable and CLEAN. Like, one of the cleanest rooms I have ever stayed in. The two person Fuji soaking tub was a luxury for sure. There were cute animal print robes in the closet. And we received a $10 minibar credit at check in which was a very nice touch. They also have a happy hour wine reception from 5-6 in the area they call the \"living room.\"", "title": "Beautiful environment, lumpy bed.", "helpfulness": 2, "user": "Frank A", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 155105211}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We received two continental breakfast coupons with our package and the check in host gave us a third for our daughter, another wonderful touch. We had dinner with friends at the restaurant that night and had a wonderful meal. The food was really good, and I was comfortable having our toddler there. She was really well-behaved, but it was also a place you could take kids in general if anyone was wondering. Everything we had was good, especially the crab mac n cheese and the Flounder entree (amazing). Our waitress was great. The continental breakfast consist of your choice of a house made pastry, scone, muffin or croissant, coffee or tea, choice of juice and fresh fruit or the yogurt and granola or oatmeal from the menu. We chose a couple of options from the continental offering and an eggs benedict to split. All was excellent. Sometimes it's fun to be tourists in your own town and the Monaco made for a wonderful getaway. I have already looked at rooms for when my family will be in town this summer. You really can't go wrong with the service, ammenities and accommodations. All are top notch.", "title": "Great location", "user": "dickpat", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155079551}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed in room number 803 on March 9, 2013. Upon arriving we were very impressed by the physical attractiveness of the property. Marble stairs, high ceilings, crown molding, and beautiful decor and furniture. I almost expected to see Cary Grant walking through the lobby. It was that classy. The people we interacted with were friendly and accommodating. The room (803) had a tall ceiling, nice furniture, and nice large screen TV, and a bathroom that was beautifully tiled, although using a shower with no door and a small splash shield that allowed water to splash onto the tiled floor was a little unusual. It needs a door, or a much larger shield.", "title": "Wonderful Anniversary Weekend", "user": "Joanna D", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155076269}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The bed was a whole other matter. The mattress was overly soft, very, very lumpy and the edges had almost no support whatsoever. I almost rolled out of bed twice during the night because of no edge support. It belonged in the dump, not in a hotel like this. If we had a nice firm mattress with edge support, we would have given the hotel five stars.", "title": "Wonderful Service!", "user": "Ibsla", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154952866}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "make for a great opening experience. The marble staircases are beautiful. This is an old building that retains its original charm. There are little oddities - elevators are divided between the hotel and some other business. Also, the lobby is on the second floor. But, this is part of having a repurposed building.", "title": "Beautiful lobby and public spaces...", "user": "otsthedog", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118130904}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Check-in was great --- they told us about the milk and cookies to start about an hour after we checked in and about the wine reception that began an hour after that. Valet staff are efficient and secure taxis quickly. The public space off the lobby had nice furnishings and provided a very comfortable location for the wine reception.", "title": "Wonderful stay!", "user": "CARNashville", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118078372}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "We went up to our room which is nicely designed. I loved the bathroom --- looks upscale and the shower is huge (no curtain) and it has an airy feel. The bathroom door is a slider with a full-length mirror on the outside, so, the door can be open without feeling as if it's infringing on the bathroom space.", "title": "Beatiful hotel in great location.", "user": "Pmanster", "date": "September 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118045079}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Other amenities include animal print robes, clock radio with ipod dock. Wi-fi included if you join their Kimpton In-touch program (free to join). Also included in the program is the opportunity to raid the mini bar for $10. I didn't notice the fridge at first -- I thought it was part of the HVAC system.", "title": "Enjoyed our visit and would definitely return!", "user": "VNB", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117959255}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The hotel (like all Kimpton resorts) is pet-friendly. We didn't bring our pet, but enjoyed seeing people arriving with their pets. The vestibule in the lobby has a discreetly placed dog bowl full of food and water. Normal amenities associated with pets are included by the hotel. Best of all, no size limits on pets!", "title": "Beautiful Hotel", "user": "cruisinonnie", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117958430}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed at this hotel for the Inaugural Baltimore Grand Prix. Its 2 blocks away! The staff are all pleasnt and knowledgeable people. Suggestions to places to eat were spot on. Oh, I almost forgot, FREE wine/beer hour! 5 pm to 6pm. Very comfortable stay. Visually, the hotel is as close to functional art work.as it can get. Resturant at hotel was borderline eh, and ok. Only had breakfast there. My only minor complaint, the hallway was hot. The room I was in, AC worked flawless. Very comfortable in the room. Also, tried room service twice (late night), both times unavailable. But they gave us numbers to places that delivered late, problem solved. There was a dog, so i'm assuming its pet friendly. But the quesion is, would I stay there again? Without a doubt, YES. Would I recommend it to others, I'm telling you to give it a try. I'm not picky, so unless you are, this hotel is above and beyond.", "title": "Plesant surprise, Plesant People, Plesant Stay. Would recommend for Baltimore Grand Prix.", "user": "stantheman16", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117850710}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great hotel; great location; great rooms; great for traveling with pets.", "title": "Historic Hotel in heart of city.......and very pet friendly!", "helpfulness": 3, "user": "Stokvis1", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117839547}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Great service. From the bellhop to frontdesk, very helpful. Quick service. We wanted to reheat some food, they brought up a microwave to our room! Lounge is nicely decorated.", "title": "Good Choice- for family, family w/ pets, & walking distance to Dwntwn", "helpfulness": 1, "user": "jerseyians", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "service": 5.0}, "id": 117804027}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here while dropping daughter off at college. This is a very cool property: the Kimpton chain buys neat old buildings, renovates them into cool new hotels, and gives great service. A bonus is that the B&O Brasserie, one of the BEST restos in Baltimore, is in the building. Great location near the Inner Harbor, wonderful staff, cool rooms, great buildng. We're going back.", "title": "very cool place", "user": "bwwst", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117765253}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel was beautiful. It was a little confusing finding the check in desk because it's on the second floor of the building. You walk in and see gorgeous chandeliers and marble staircases. After walking up the staircase, you see more marble floors, beautiful decorations, several elevators, and the check in desk surrounded by furniture, a fake (but gorgeous) fireplace, and complimentary milk and cookies. Our check in was quick and easy and our room was extremely clean and comfortable. It was quiet, cool, and the bedding was wonderful. I'm a bit OCD when it comes to hotel rooms so I even double checked and there weren't any bed bugs! Our only qualm was that we requested a complimentary companion goldfish for our stay (simply because we'd never been to a hotel where we could do that!) and it never arrived. However, lack of a goldfish certainly isn't a big deal.", "title": "Beautiful and comfortable!", "user": "Travelling4Fun06", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117763290}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the Monaco for New Year's Eve and the night of the 1st. We had a corner room on the 7th floor, which was wonderful. High ceilings, spacious, great linens, clean, and a GREAT bathroom. It was my birthday, and they sent a bottle of wine for us to celebrate with, \"just because...\". That level of service/attention to detail is special, and just not seen at many other hotel chains.", "title": "Wonderful hotel", "helpfulness": 1, "user": "corlyn", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155755412}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "That being said, the restaurant was a bit of a disappointment. We had a larger party for breakfast(7). Our server was the bartender and she was prompt. However, our food took exceptionally long to arrive. And some meals were delivered 15 minutes after the first plate was delivered. Some of the meals were no longer hot. Puzzling, because the restaurant was not that busy. Lots of open tables. Complaints were met with 20% off our bill.", "title": "Beautiful room", "helpfulness": 1, "user": "amy52787", "date": "March 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 155659279}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The gym has been moved due to remodeling. Not as nice or spacious as it used to be. Perhaps it will be moved back once the remodel is completed.", "title": "A \"Royal\" Gem!", "user": "nmbelton", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155558044}, {"rating": 4.0, "title": "Great downtown hotel that meets all expectations", "text": "Stayed here in early Mach while attending a conference in Baltimore. Beautiful clean room with an elegant bathroom. Two concerns: First, confusing check-in. It is located on the second floor and there is no sign indicating this. Took me a while to figure this out. Secondly, I agree with other reviewers that it feels more like an apartment complex than a hotel. I personally prefer the hotel feel when I travel. Good clean elegant hotel...just not my personal preference.", "user": "lager108", "date": "March 24, 2013", "id": 155520109}, {"rating": 2.0, "title": "Still Waiting For Our Room", "text": "If you're ever in Baltimore & you need a place to stay, look no further. You will not be disappointed. The room was amazing! A lot of natural light from the very large windows, and an elegant marble bathroom with a deep jacuzzi tub that's big enough for 4. I had a wonderful birthday weekend, & this hotel played a very important role. Saturday evening, I received balloons, a bottle of champagne, & two cupcakes for me & my husband to share. Thanks again, Christina, for making my birthday a very memorable one.... I will definitely be back to visit!", "helpfulness": 1, "user": "ww54", "date": "March 23, 2013", "id": 155445103}], "location": {"country": "United States", "city": "Baltimore"}, "stars": 4, "variance": {"poor": 27, "average": 72, "very good": 215, "terrible": 14, "excellent": 513}, "aka": "Monaco Hotel Baltimore", "slim_ranking": 0.1, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "In one of our nation's most distinctive cities, you'll find one of its most remarkable hotels. Hotel Monaco Baltimore, a Kimpton Hotel, uniquely reflects the spirit of this vibrant, historical city. Situated in the landmark Baltimore & Ohio Railroad headquarters, built in 1906, our downtown Baltimore hotel provides an experience like no other. From our elegant three-story lobby, with its original marble floor and Tiffany stained-glass windows to each of our 202 beautifully appointed guestrooms and suites, Hotel Monaco Baltimore surrounds you with spacious, timeless style."}