{"user_rating": 4.5, "review_count": 1033, "name": "Monaco Alexandria, a Kimpton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We travelled with our whole family this trip to see the sights in DC. Alexandria was a perfect place to stay. Great \"historic city\" feel. Without the hustle and bustle of DC. Rode the King Street trolley daily to the Metro to get into DC. Ended the day at some great local restaurants We especially enjoyed eating @ the Hotel's Jackson 20. Kids went swimming nightly. The lifeguards especially Andrea the last night were very attentive with my children. Watching them even though we were there. We barely missed the wine tasting everynight. Too bad. Wished we could have timed it right to get there.", "title": "Great stay at Hotel Monaco Alexandria", "user": "pcloangirl", "date": "October 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119500732}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Front door attendants and bellmen were very attentive and prompt. Jessy at the front desk was super helpful. Great customer service. I had emailed some requests before our arrival. She wrote back to me and everything that was available was taken care of. The only reason I gave 4 instead of 5 stars is because we called several times to ask for additional items and twice they were not delivered.", "title": "Excellent location and excellent service!", "user": "Trevor-EDM", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119491586}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We stayed in Alexandria for three nights before moving on to Washington DC and picked the Hotel Monaco. Right from when you pull up to the Hotel you are greeted and the doors are held open for you while they help you with your bags. All of the staff throughout the check-in process were extremely nice and helpful.", "title": "It is okay.", "user": "businesstraveller038", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119465830}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "For those arriving at the Reagan airport there is a shuttle that the hotel offers. You are supposed to call the hotel when you arrive and it will be sent to pick you up.", "title": "What a treat:comfort, service, funky, location", "user": "Susiegirl1", "date": "October 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119455054}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The basic rooms are tasteful and simple; they are not over the top or lavish.The AC was not noisy and the hotel walls must have been well insulated as we could not hear any of our neighbours. All of the basics that you would expect (flat screen TV, etc.) are in the room.", "title": "Hotel Monaco - Alexandria - Loved it!", "user": "UCLaw98", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119410646}, {"rating": 4.0, "title": "Weekend getaway", "text": "My wife and I planned a three day/ two night getaway in Old Town Alexandria at Hotel Monaco. I have stayed at Kimpton hotels before and was excited to be in the neighborhood of this property and explore Old Town. I have also experienced top notch customer service at their hotels and new that if any issues came up, we would be taken care of. Our getaway was also to celebrate our wedding anniversary and my birthday, so there was some fine dining on the agenda each night.", "user": "Farmerica", "date": "October 30, 2011", "id": 119916275}, {"rating": 5.0, "title": "they wow'd us", "text": "We arrived early afternoon on a Friday. Check in was prompt and smooth AND we had been upgraded from the king terrace room I had reserved to one of their loft suites. This was a phenomenal upgrade and when we got to our room there was a bottle of wine and a cheese plate waiting for us. A very nice touch, but there was no note or letter from the manager for me to personally thank him/her personally while there. The loft has a first floor with a powder room, sofa, tv, desk and chairs. There are stairs up to the loft where there is a king size bed, dresser and tv and a full bath with a huge soaker jacuzzi tub. If I had to voice any kind of complaint about this room it was only that the heating system was noisy as it cranked into gear.", "user": "spalovingirl", "date": "October 27, 2011", "id": 119806771}, {"rating": 5.0, "title": "Home away from Home for DC Touring", "text": "We did not have the cooperation of the weather (rain and snow!) for our stay, which made being indoors in a large comfortable room a great respite for our getawAy. We did not eat at the hotel, so cannot comment on that service. We peaked into the pool one evening and it looked like greAt place to lounge. Despite not being able to do all of the outdoor activities we'd planned, we had a great stay and I plan on a return trip to the Monaco as soon as we can get away again.", "user": "CorporateHotelier", "date": "October 25, 2011", "id": 119718547}, {"rating": 5.0, "title": "Great place for an escape.", "text": "I am very hard to please after working in luxury hotels for many years, but this team did it right! I made a note in my online reservation that it was a special trip for my significant other and myself, and was very impressed when they greeted us with a personal welcome note AND a complementary upgrade to a two story room with a jacuzzi bath for two. So thoughtful! Complementary breakfast (our choice, and was excellent- many options and no stale pastry buffet) OR evening wine reception is included, and a really great pet program (next time we will bring the dogs) that was fun for pet lovers, but not intrusive for those who don't like animals. Room was modern...maybe a bit too \"cold\" decor style for my taste. Needed more art, but the furniture was tasteful and in perfect condition. Make sure you join Kimpton's reward program before you arrive.....a treat will be waiting for you in the minibar if you do!", "user": "andrewm873", "date": "October 23, 2011", "id": 119626889}, {"rating": 4.0, "title": "Great hotel with some minor issues", "text": "We chose the Monaco Alexandria as our jumping off point for a family trip (2 kids, 7 and 10) to DC. From the moment we arrived, we were given a warm welcome and made to feel that we were perfectly welcome. More important than the convenient location, physical features and amenities of the hotel (all of which were top notch) was the personable and familial qualities of the staff. Without trying to feel forced of stuffy, they really connected with my family from the first moment to the last. As great as the sightseeing and learning was on our daily sojourns into DC, there was an equal amount of anticipation for returning to the Monaco each night as it just felt like coming home.", "user": "Kurt12", "date": "October 20, 2011", "id": 119535377}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Perfect location, excellent staff, fantastic rooms, a nice restaurant, and free wine??? Yes, that is the Monaco. I was in town for a conference being held at another Alexandria hotel and, fortunately having lived in the area, purposely chose to stay at the Monaco. Yes, that meant incurring an additional ten block walk (each way) daily, but that simply afforded me the opportunity to experience more of the city, and coming back to this hotel each night is well worth it.", "title": "Wonderful", "user": "Jason B", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118929610}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I recently stayed at the Hotel Monaco as part of a block of rooms for my best friend's wedding, that was being held nearby. There were 4 other weddings in the hotel that weekend, so it made for a bit of craziness, but all of the staff were extremely helpful and kind. We had a goldfish put in our room named Hannah, which was a cute touch you don't find everywhere! The rooms and hallways are all very dark, but it made it feel cozy, especially as the weekend was cold and rainy. Rooms are small but nice, and I didn't feel like we were crammed at all. The room service staff was EXCELLENT - we had ordered lunch for the bridal party, and then continued to keep requesting additionals plates, glasses, scissors, super glue, you name it - we asked for it. The delivered each item quickly and with a smile! Its nice to know when you have a million other things going on, that the staff at the Hotel Monaco is there to help you with anything you need to ensure your day goes smoothly. The decor is bright and slightly funky, which made for some great pictures. We also had a group hang out at the bar at Jackson 20 two nights in a row, and the bartenders were awesome and accomodating. Overall it was an amazing weekend, and we would definitely come back to this hotel again!", "title": "Great service, fun decor", "user": "cml214", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118928758}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My family and I have visited the Monaco and Morrison House", "title": "Ritz Lite at the Monaco in Alexandria", "user": "tappyt", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118906363}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Hotels in Alexandria several times.", "title": "Add charm to the DC visit", "helpfulness": 7, "user": "Drvivekbansal", "date": "October 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118897327}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "When I say \"Ritz Lite\" - What I mean is, that it has all of the", "title": "Still Great but Beware of Kimpton Rewards Program", "helpfulness": 2, "user": "relaxandread", "date": "September 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118788866}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Classy, clean, wonderful ambiance, perfect location. We loved walking around \"old town\", shopping and eating at the awesome stores and restaurants. This hotel is 3 blocks from the water front, with its many features; visit the torpedo art factory! Take the free trolley to the metro station and zip over to DC.", "title": "Perfect!", "user": "Ncmo", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119390971}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I give this Hotel a perfect 5 stars!", "title": "Another Excellent Stay", "user": "travelersK&W", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119320328}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I always try to stay at this hotel when traveling to this area. This stay was no exception to the previous ones. Great wine hour, room and food at the restaurant. I found the staff to be very accommodating and helpful.", "title": "A great hotel in a great town", "user": "Keystone_Traveler", "date": "October 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119312956}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel is just a few blocks to the waterfront and is surrounded by great shops and restaurants..", "title": "Gave away our suite...on our 10th anniversary!", "helpfulness": 1, "user": "J B", "date": "October 12, 2011", "detail_rating": {"value": 1.0, "location": 4.0, "service": 1.0}, "id": 119222270}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I along with our two younger sons spent a few fun filled days in the Washington area and opted to stay in Alexandria. I chose the Monaco based on the very high marks from other TripAdvisor reviewers. Our family consensus concurs with the high ratings. It is definitely well deserved. The feel to hotel is unique; not ordinary at all. Sit in the lobby for awhile and you will see what I mean. We had a top floor room with the dormer windows. Room was large enough; beds were very comfortable; very clean; soft towels; good service. After a day of sightseeing we came back to the hotel before dinner. A lot of great dinner options within walking distance of the hotel. Something I found out after we checked in...dogs are allowed in the hotel. So keep this in mind if dogs are an issue for you. However, the hotel common areas (and our room) are kept very clean. We loved the hotel and would definitely stay here again.", "title": "Radically Inconsistent", "helpfulness": 3, "user": "nalts", "date": "October 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 119031183}], "location": {"country": "United States", "city": "Alexandria"}, "stars": 4, "variance": {"poor": 23, "average": 65, "very good": 230, "terrible": 14, "excellent": 701}, "aka": "Hotel Monaco Alexandria", "slim_ranking": 0.12, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Hotel Monaco Alexandria, in the heart of Old Town Alexandria, is a luxury boutique hotel with rich design. Discerning travelers will appreciate the sumptuous décor, top-notch service and eclectic sensibility that this Kimpton Hotel provides. The hotel aptly reflects its historically rich surroundings, adding contemporary comforts for a memorable stay near Arlington National Cemetery, Mount Vernon and all of Washington DC’s many attractions. Conveniently adjacent is the exceptional Jackson 20 restaurant."}