{"user_rating": 4.0, "review_count": 914, "name": "Monaco Washington DC, a Kimpton Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "I have just returned from a 5 night stay at this hotel for a conference. I would not stay here again. The hotel is in a historic building and has some beautiful features, including lots of marble and very high vaulted ceilings. The decor is funky and fun, but not overly luxurious. The rooms in most of the pictures shown on the travel web sites must be suites because none of our rooms had guest chairs or space in which to put one.", "title": "Overrated and Overpriced", "helpfulness": 6, "user": "2lhasas", "date": "June 29, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 5411547}, {"rating": 4.0, "title": "Great location, Comfortable room, Spotty Service", "text": "When I first arrived I was given room 153. Do not accept this room under any circumstances. It is much smaller than any other room I saw and the desk is in a virtual cavern. (I ended up in 3 different rooms and was traveling with 9 other people so I saw a number of rooms). It smelled as if it had been flooded and immediately set off my allergies. All of the rooms on the first level are in the basement of this building. They have very high ceilings - at least 16 feet - and small windows at the very top. These windows did not provide any natural light for the room and you could not see out of them to check the weather unless you stood precariously on the back of a chair.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5332176}, {"rating": 2.0, "title": "Disappointing!", "text": "I returned immediately to the second level, where the lobby is located and they relocated me to another room on level one. They did not have any rooms on the upper levels at that time. This room was larger and had a better layout but still the idea of not having any windows bothered me. They had curtains with light strips behind them to make it appear as if you had windows, but only one of the 4 light strips was even working in this room. I kept my bags packed in hopes of getting a room higher up the next day as others checked out.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 9, 2006", "id": 5327508}, {"rating": 5.0, "title": "Loved the Hotel Monaco", "text": "The front desk person in the morning was much more helpful and offered to move me when a room became available. He asked that I keep my bags packed by the door and they would transfer them to a new room so I did not have to keep checking back. When I returned later that day, I learned I had been moved to the 4th level. The room overlooked the roof of the restaurant, but at least there was light.", "helpfulness": 3, "user": "Mcclan1", "date": "June 6, 2006", "id": 5314994}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The next morning, the water in the shower was pretty tepid. There was a large convention in town so I assumed I needed to get up earlier to catch a hot shower. When I returned in the evening, I decided to take a quick shower before dinner. Again, no hot water. I skipped the shower. When I returned from dinner, I really needed a shower - DC in June and all, I was pretty sticky - but still no hot water. At this point I called the front desk and was told that something was broken and they were working on it. Morning came - more of the same. This went on for the remaining three days we were there.", "title": "Overated", "helpfulness": 3, "user": "Travel_Daughter", "date": "May 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 5224338}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We visited DC after three weeks cross crossing the US staying in 4.5 star hotels and this was by far the best experience. Great building, great location, great staff, particularly the guy on check out who I had a chat to about the F1 race that night. We booked through hotwire and got a super cheap price. Would stay again.", "title": "Great experience, Great Price", "helpfulness": 2, "user": "GJITravel", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 114862029}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "TA friends- please look at my profile of hotel ratings before reading this review. I do not write this kind of review lightly. Husband and I decided to have a relaxing evening before our son's college graduation in DC and, after reading the reviews of hotels located near the Mall, decided on Hotel Monaco. What a disaster.", "title": "Ethics of Hotel Clearly Questionable", "helpfulness": 10, "user": "booklover52", "date": "June 26, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114769183}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We also decided to book through Expedia. What a mistake.", "title": "great personal service from start to finish!", "user": "mary1samm", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114737335}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Problem 1: Upon arrival the service desk clerk told us he had given us a first floor room so we could avoid the noise of two weddings occurring that night. Our \"first floor\" room was in the basement. This hotel (as other reviewers have stated) rents expensive rooms in a basement. That should give anyone pause.", "title": "Fun Hotel", "user": "Carl L", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114688711}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Our room consisted of two feet of space from front door to the bed, a queen bed, pushed up against a small desk, two feet of space to the tiny bathroom, and one small window looking up to what appeared to be the outside of the building. A narrow, inexpensive Ikea- type wardrobe filled up the rest of the room. This was a $480 room.", "title": "Wonderful and Unique with a great staff - Location Location Location!", "helpfulness": 2, "user": "DBTrips-NC", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114673907}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "This was my first stay at a Kimpton Hotel anywhere.", "title": "Only if Verizon Center Event", "helpfulness": 3, "user": "Atlanta4Travel", "date": "October 14, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 5956102, "likes": {"liked": "— Location across from Verizon Center", "disliked": "— The Room"}}, {"rating": 5.0, "title": "Fabulous", "text": "It was a not a good first impression.", "user": "murphymullen", "date": "September 25, 2006", "id": 5835734}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Reserved Monte Carlo upgrade and indicated higher floor in reservation. Got there and they wanted to put me in the dungeon. Said that wasn't acceptable.", "title": "Great Location, But They Don't Respect Their Guests", "helpfulness": 5, "user": "windowseat4me", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 5637556, "likes": {"liked": "— Location", "disliked": "— The fraternity house level of noise"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Waited for over an hour for them to clean one on a higher floor.", "title": "Hotel Monaco's are always great - this is no exception", "helpfulness": 1, "user": "HappyHawaiiKaian", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5563937, "likes": {"liked": "— Beautiful Room", "disliked": "— Requested rollaway on reservation, but f/d didn't seem to know about it. However, they were very quick to accomodate, so no problem at all."}}, {"rating": 1.0, "title": "Horrible; Won't Go Back", "text": "Finally, just went with a standard closet....I mean room.", "helpfulness": 7, "user": "newyorker284742", "date": "July 31, 2006", "id": 5532111}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Clean, well located hotel. Staff went above and beyond to help us with directions, restaurants and downloading documents free of chrage.", "title": "Great hotel - extrordinary staff", "user": "minnesotatravel17", "date": "June 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114616427}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband & I stayed at the Monaco from June 11 to 15. The staff were extremely friendly and the location was amazing; across from the subway station, blocks from wonderful restaurants and great museums.", "title": "Perfect Location but Disapointing Room", "helpfulness": 1, "user": "dovebvi", "date": "June 18, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 2.0, "service": 4.0}, "id": 114177222}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We were put in one of the rooms on the '1st' floor which is actually the basement. We took the elevator \"down\" (always a bad sign) to our floor and then proceeded to walk down this endless hallway with ramps and no natural light.", "title": "FANTASTIC STAY", "helpfulness": 1, "user": "catravelmom_11", "date": "June 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113881595}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our room was a corner room and extremely spacious. The windows were half windows and looked onto the sidewalk, which also meant that everyone on the sidewalk could look in so we had to keep the curtains drawn which made the room very dark. The bathroom was enormous! The shower had two rainheads and it could have been amazing but was cheaply tiled so that it exactly resembled a locker room! No exageration- it was very odd. One of the bedside lamps did not work and the furnishings seemed quite outdated.", "title": "Best of all the Kimptons we've seen", "user": "eakNYC", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113832787}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The worst thing about the stay though was the bed. It was hands down the worst hotel bed I have ever had to sleep in. When I sat on the edge it creaked. Then my husband & I found out that it sagged enormously in the middle. It must have been an extremely old mattress. I never once throughout our stay slept through the entire night and always woke up with an achy back.", "title": "Great location, great amenities, what's not to love!", "user": "tarajsims", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113562126}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "This is a beautiful historic building, very convenient to many attractions in Washington including the convention center. The extremely wide hallways are elegant. My only caution is that first floor rooms in at least one part of the hotel are below grade level, so they have no view and if you look out your window you're staring at the legs of pedestrians. They can also stare in at you if the curtains are open", "title": "Very nice but try to avoid rooms on first floor", "user": "dkmr", "date": "July 4, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 115020311}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I stayed at this hotel for business and I would not recommend it for a long-term stay. The location is excellent - close to restaurants and the metro. It has a snazzy, fun interior with what is admittedly some of the best amenities I’ve found in a hotel yet (nice touches such as small packets of Woolite in the bathroom for the odd pair of stockings you need to wash). I would not, however, advise staying longer than a few days. They don’t cater to business professionals. For example, there is no laundry service aside from dry cleaning and the concierge seems unable and unwilling to assist beyond telling you that there is nothing available. Furthermore, I’ve had a poor experience with customer service. I requested a “complimentary fish” 3 times before it materialized. The toiletries in my bathroom were not refreshed when needed and I had to ask. I was in my room on a Friday afternoon, having returned early from meetings, and the housekeeper walked in without knocking to ‘check the room’. The phone didn’t work, engineering accessed my room several times to work on a thermostat that seemed to work fine without asking my permission first. Service from the front desk staff was inconsistent at best.", "title": "Great location, lacking in customer service", "helpfulness": 1, "user": "lawgeek77", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 1.0}, "id": 115016989}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "On the whole, while this may be a great location, it would seem the hotel rests on its laurels in the customer service department, depending on the Kimpton brand and location to “carry the day.” I have not received the level of service I anticipate from the Kimpton brand. It is notable that many hotels in Washington, DC have a great location and comfortable rooms with great amenities. The one quality that can distinguish a hotel from the rest in this city is the level of service. I would “go fish” on this particular location.", "title": "Exceptional Stay", "user": "grandtraveler2", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114968503}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We had an absolutely wonderful stay at Hotel Monaco when visiting Washington DC. My husband and I have traveled all over the world and the service we got at this hotel tops even the finest 5-star hotels we have stayed in. The front desk staff was exceptionally friendly and helpful. Upon checking in, we were treated like royalty and when checking out, they offered to print our airline boarding passes and even checked the time of the metro trains so we would be sure to catch one that would get us to the airport on time. The wine hour is also a nice treat and was done in a way that you felt you were at a party with people you had known for a while. The beds were very comfortable and the room amenities were first class. We especially liked the room's high ceilings and that we were staying in the grand old Post Office of Washington DC. We only ate in the restaurant in the mornings where we chose to have a continental breakfast which was adequate. We will go back to Washington again soon and will definitely stay here.", "title": "A rare treat...exceptional service with a genuine smile!", "user": "ICIMIW", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114947259}, {"rating": 5.0, "title": "Let's make that old saying \"Location, location, location AND service, service service\"", "text": "Let me begin by saying that this is the first review that I’ve ever written on-line. And there is a very good reason for it today. I just return from spectacular stay at The Hotel Monaco in Washington D.C. It of course has the basics of being located in the heart of everything good about D.C. such as Museums, The Verizon Center, The Convention Center, various famous and significant historical sites. But The Hotel Monaco has so very much more to offer…exceptional service. I was made to feel welcomed from the time I entered the hotel. I was greeted with a warm smile from several people at the front desk. Whitney, Brea, and another young lady where all quite friendly and knowledgable.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 1, 2011", "id": 114945290}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I stayed at the Hotel Monaco over Christmas while visiting relatives in the DC area. I chose the hotel for its location, which was within walking distance of the Smithsonian museums and White House, and across the street from a Metro station. The hotel was gorgeous, very European in feeling. Our room was large enough to be quite comfortable and had amenities such as free internet, plush bathrobes, and cd player. The staff was super-friendly and helpful. Room service was prompt and the food was excellent; I want their grilled-cheese sandwich recipe!", "title": "Superb hotel in a great location", "helpfulness": 2, "user": "WillowG", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6501950, "likes": {"liked": "— Friendly staff, convenient location", "disliked": "— Room needed better bedside lighting."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Our 4th Kimpton hotel stay, and definitely the worst. Previous stays at Kimptons in DC (Topaz), Seattle (Monaco), and Denver were terrific.", "title": "Weakest Kimpton we have seen", "helpfulness": 6, "user": "tarheal", "date": "December 23, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6484709, "likes": {"liked": "— Location", "disliked": "— Poor service from staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Location was great, furnishings good. Comfortable bed, That's the good news. We asked for a quiet room, on a high floor. Our room was on ground floor (#2), directly across from a noisy construction site. I understand that all requests can not always be complied with, but they should at least acknowledge at check in that they did their best but could not comply with everything.", "title": "Great Historic Hotel in terrific location", "helpfulness": 3, "user": "CaryandMindy", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6472681}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed in a Mills Suite- their best. Very large, not like some of the regular rooms that others complain about. High ceilings. Chipped/broken moldings that are painted over and not first repaired- some people may think that’s rustic or authentic. I think they are broken and not appropriate for a room that approaches $400/night. Very cheap 10 year old TVs, very limited channel selection. No HBO, no Fox News Channel. There are the usual pay per views. I expect upgraded TV and service in the best suite, not a 1995 Panasonic.", "title": "Would stay elsewhere...3 star at best!", "helpfulness": 5, "user": "turbos", "date": "November 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 6166293, "likes": {"liked": "— location", "disliked": "— poorly maintained room, lack of compassion from the staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "No coffee in the room. The desk man said that “no one was using them so we took them out.” Yeah, right. My res confirmation said that there is in room coffee; at least they took it off the rest of the website. There was coffee service in the lobby in the morning- again, on the cheap. I sat there a couple of mornings and saw the dispensers run out several times. Refilled only when a guest went up to the desk to complain. Cheap paper cups only when a small supply of china cups was used up. Selection of tea bags that was quickly picked over. No cocoa or other offerings that are standard at Hampton Inn. Other Kimptons have cookies and/or fruit at the front desk. This one had cookies on the 3rd day of our stay.", "title": "Hotel Monaco was awesome and great location.", "helpfulness": 10, "user": "mkely42", "date": "October 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6018614, "likes": {"liked": "— Location", "disliked": "— Don't have any major dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The Monaco is perfectly situated in the Penn Quarter of Washington D.C. It is within walking distance of almost all the major sites, and Metro distance of all the others (Gallery Place Chinatown Metro entrance is directly across the street.) My experience with service was excellent at the front desk, especially the concierge who successfully steered us to two excellent restaurants (Zaytinya and Ceiba). My room was quite large, tall and very pretty. The bathrooms are a bit small. My business companion upgraded to one of the suites and the thing was enormous. Key here: if you do not like your room, ask to change. He did and was very happy. One curious thing was the bizarro toilet flushers they have. Very loud and not too effective. We asked them to fix it several times. They snaked the heck out of it (scarring the bowl), but never really fixed it. Eat at Poste (restaurant in the hotel; rabbit is divine.) Reference a previous writeup, not sure I understand why you wouldn't be able to have al fresco dining in the spring here, but you certainly do not want to eat outside in July in DC (it was 100 degrees for several days). Dress accordingly. Any of these restaurants are nice slacks and collared shirt type places for men. Enjoy the Monaco and the Penn Quarter.", "title": "Knowing the floorplan is the key", "helpfulness": 1, "user": "Ben W", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5491541, "likes": {"liked": "— Location", "disliked": "— Bizarre toilet flusher"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed at the Hotel Monaco from July 11-16. Although we booked on Priceline, at no time were we treated as \"second class\" guests. At check-in we asked for a non-smoking room, on the second floor or above, and we were able to get into our 3rd floor room early. Our king deluxe room was very clean with two large windows. Turn-down service was offered every evening. The wine hour was great - a pleasant way to meet other guests - and on several occasions the servers asked if we would like another glass. On one evening a graduate student was present to answer guests' questions about the hotel's history. We appreciated daily room delivery of the Washington Post and the NY Times. Our room was always quiet and the bed was very comfortable. Our request for an extra blanket at 10 pm was quickly met, as was our request for help with luggage storage on our departure. The hotel location is ideal - across the street from the Chinatown-Gallery Place metro stop, the National Portrait Gallery, and down the street from the very cool International Spy Museum (kids love it). I booked this room several months ago, and after reading some of the comments on this site about the service and 1st floor rooms, I was concerned about what we would find. We were delighted with the friendly employees and the accommodations.", "title": "Outstanding!", "helpfulness": 1, "user": "thanksforhelp", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5489728, "likes": {"liked": "— renovation of historic building", "disliked": "— ---"}}, {"rating": 3.0, "title": "Just not Kimpton's best", "text": "We LOVE Kimpton hotels, they are great....at least all the we have been to so far. The Monaco just doesn't seem to be up to their standards...or mine. We stayed there a few months ago and it wasn't very good, for a number of reasons, mainly service. So I complained and they gave me a complimentary night, and this weekend we tried again....still isn't better.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5474196}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "For a hotel of that ranking, the service should be better. They have a heck of a time just getting the reservations correct.", "title": "Not anywhere as good as their San Fran location!", "helpfulness": 17, "user": "Gertsdad", "date": "July 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 5437772}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "The rooms....eh, they are ok, small is an understatement....I know it is is DC, but I have stayed at two other Kimpton's in DC and the rooms were HUGE...literally HUGE.", "title": "Nice hotel, great location!", "helpfulness": 2, "user": "winechick1", "date": "July 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5431239}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed here for 4 nights for a convention with my husband and was very happy. The initial room that we got we did not like and we were switched the next night for the following 3 nights. They sent us a fruit basket and a bottle of wine for the inconvenience. They also upgraded our room. We had breakfast included and it was very good. The restaurant was nice and had a sustainable garden outside. The room was decorated very pretty and was large. The bed was really comfortable.", "title": "Wonderful & quaint hotel", "user": "laura818", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113343223}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I travel to DC constantly and am always looking for a nice place to stay that is near the mall (so I can walk and run) but also is clean and has a nice atmosphere. Hotel Monaco fits the bill and more. The staff is the most friendly and helpful of any hotel I have stayed at anywhere. And they gave me a glass of wine upon my arrival! The gym is great! The hotel is clean and nice and the decor is cool . It is a beautiful historic building right near China town and the metro. If you are a Kimpton member you get a $10.00 coupon for the mini bar and free wifi. This was a great experience!", "title": "Hotel Monaco is one of the best hotels I have stayed in in Washington DC", "user": "skate_skier_79", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 113277501}, {"rating": 3.0, "title": "Quirky hotel", "text": "IIf you", "user": "atlanta14", "date": "June 13, 2011", "id": 113145068}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Stayed here for business twice now - restaurant is very overrated. The rooms are nice with high ceilings, and the hotel itself feels unique with its wide hallways and high ceilings. Service was just average.", "title": "For the business traveler, the Monaco DC is your home away from home.", "user": "BJB622", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112799227}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I've stayed at the Monaco DC many times and the experience is truly like having a home away from home. Hotel employees, every one of them (from the bellman to the desk clerk to the host at the 5 pm wine reception), were consistently driven to provide service, whether providing concierge type assistance to recognizing me by name as I arrived back to the hotel. Especially Kelly, at the front desk, who always greets me by name and welcomes me back.", "title": "Exceptional service, location, and a chance to stay in a building with a long history", "user": "jeffmarraccini", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112658277}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 4, "variance": {"poor": 53, "average": 91, "very good": 245, "terrible": 25, "excellent": 500}, "aka": "Hotel Monaco Washington Dc", "slim_ranking": 0.209302325581, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The luxury Hotel Monaco Washington DC, centrally located in Penn Quarter, occupies the former General Post Office and is a National Historic Building. Built in 1839, this recently renovated beautiful marble building has a stately grace that is matched by the hotel’s exemplary service and luxurious amenities. From the comfort of elegant guestrooms, you are steps from the bustling Poste Moderne Brasserie, Verizon Center, the Smithsonian, National Mall and a plethora of museums."}