{"user_rating": 4.5, "review_count": 359, "name": "Monmouth Historic Inn Natchez", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Only a 3 hr drive from New Orleans, but a world away! Monmouth is a GREAT bed and breakfast with rooms and suites available in rebuilt outbuildings, as well as in the main house. Built in 1818 and abandoned in the 1960's before it was purchased and lovingly restored by current owners, Ron and Lani Riches, in 1978. After 4 years of restoration and continuous improvements, it's a stunning property with luxurious accommodations, including antiques and fine reproductions. Our Garden Cottage room featured a four poster super comfortable king bed, a working fireplace, antique armoire, and completely modern bath with a whirlpool tub. Really appreciated the bathrobes, complimentary water bottles, free wi-fi (though signal was weak in our room), and especially the delicious full Southern breakfast.", "title": "great weekend getaway from NOLA", "helpfulness": 2, "user": "RiverlanGone", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124905089}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Only negative comment - they really need to find the cats that are spraying and causing an awful odor in certain outdoor public areas!", "title": "ASk Questions", "helpfulness": 10, "user": "juju78028", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124711298}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We received a deluxe suite with a working fireplace for a cold weekend in February. When we arrived we immediately turned on our fireplace only to find that it did not work. On speaking to management we were told that \" you should ask if the fireplace is working\" When I asked if they should not advise a guest of this at check in I was told that sometimes the jacuzzi didn't work either. Ours in this case did. Remember this property is touted as one of the Leading Small Luxury Hotels of the World. I have stayed in many of such properties and never found such disrepair. The shower barely trickled, their was hair around the Jacuzzi, and the \"gourmet\" dinner in the 1818 restaurant began with watery turnip soup. and had very salty redfish as one of the main courses. Now the grounds are beautiful, our room was cold sans fireplace, but spacious, and the wait staff exceptional. For a lovely meal, go to the Castle restaurant at Dunleith, or the Lorman Country store for down home cookin. Obviously, some over sight is lacking here. It is a shame, as the setting is to beautiful.", "title": "Authentic Plantation Stay", "helpfulness": 2, "user": "peteonholiday", "date": "February 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124466707}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "If like us you are looking to stay in a true plantation style house look no further. We had a great stay at Monmouth Plantation. We chose to stay in two of the rooms upstairs in the main house for the most authentic of stays. I would recommend it for fellow travelers. The rooms were large and very nicely decorated. They have all the conveniences you would expect for a hotel but you are just going for the room. The grounds and house are awesome, it's really nice to walk around and take it all in. Dinner in the restaurant was ok, there certainly wasn't the quantity of food you become accustomed to in the south but what I had was very nice. A special mention to Washington, his authentic Mint juleps were fantastic. We nearly bypassed dinner and kept drinking. Breakfast again was ok, there were not enough staff on to service everyone and breakfast items/cutlers kept running out. All in all though we had a great stay.", "title": "Exquisite property, but a number of small things wrong", "helpfulness": 11, "user": "vpoleshuck", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 123809788}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We have stayed at many Small Luxury Hotels of the World properties, and have found them to be uniformly wonderful. This was our first exception. The property is incredible, the main house is beautifully restored,and don't miss the wonderful tour to get the full explanation of the plantation and the furnishings as well as great stories about the past owners. We had a 2-room suite in one of the outbuildings (#42) which was spacious and comfortable. BUT, it was a little shabby. The front stoop is covered with a worn and shredded cloth; the furniture in the sitting room was tired and shabby. Not antique and lovely, but worn and shabby. Not up to the expectations. There were no instructions for using the very complicated satellite TV, only a sketch of the remote and what each button does. It required much playing around to get it. On check-in, the person ahead of us had reserved (and paid for) a specific suite for their anniversary, but it was not available and he was given a regular room which did not sit well with him. The desk clerk was unable to deal with his distress (and he was very polite) and take care of the two other parties waiting to check in and also handle the busy phone. Yet she had no help and said she had no one to call. We had to wait almost 1/2 hour to check in. The lovely breakfast was marred by having to listen to Christian hymns and gospel tunes on the Musak (interspersed with other music). This may be the bible belt, but not everyone enjoys Christian religious music with breakfast. And on and on, a number of small things. The shame is that the property is truly lovely, and it would take only some attention to these troublesome details to have made it a great stay. Management is at fault.", "title": "Loved Monmouth for the second time", "helpfulness": 2, "user": "roxhills", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123718566}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were very unhappy with the room we were allocated. We booked a Deluxe Room. Their website says that the Deluxe rooms are ‘located throughout the grounds and gardens: the Courtyard Building which is adjacent to the Main House, the Garden Cottages, Pond Cottage and Quitman’s Retreat’. Their photogallery of buildings shows (apart from the main house) only pretty cottages in the grounds, with nice porches opening onto lawns. So it seems reasonable to assume that you will be in something like that. Unfortunately, our room was in the Courtyard Building, which is not in the grounds and is adjacent not only to the main house but also to the courtyard and bar where guests congregate, and it also accommodates on the ground floor the gift shop and reception office. Rooms in the Courtyard Building are on the upper floor, and the whole building has only a very limited balcony at the stair head, overlooking the main carpark, with a filthy swing-seat and dirty, worn carpet. Like recent reviewer D_M_Penny (whose review we only saw after our return home), we were allocated room 29, immediately above the office and overlooking the courtyard – and thus inconvenienced by chatter noise, phone rings and door bangings from below and around. Room 29 also has just one window (overlooking the courtyard tent), heavy with fixed drapes and thus admitting little light.", "title": "Very, very disappointing", "helpfulness": 8, "user": "salmoneater", "date": "March 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 126188793}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The website also advertises a ‘hot and hearty Southern breakfast’. It was awful. A single presented plate of tasteless grits, tasteless ‘scrambled egg’ that must have been made from powder, and a small, grey, tasteless sausage. And even the mint julep at the bar was miserable.", "title": "Needs overhaul, fault poor management", "helpfulness": 10, "user": "D_M_PENNY", "date": "March 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125472016}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "The grounds are nice! (Except for some untended paths.)", "title": "Great room and service", "helpfulness": 3, "user": "Denver_Mullican", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125310899}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Beautiful grounds, nice layout of buildings. Staff was generally nice, but I would have expected more greetings by upper management, who mostly walked by us \"guests\" as though we were invisible.", "title": "Great place", "helpfulness": 6, "user": "northstar2012_12", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125199681}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Strike 1: upon checking in, even though we were able to confirm our reservations by our debit card, we were not told many of the soon-to-be coming charges, including a $100 hold for our night at the 1818 dining room. While not a direct debit, it did place a hold in our account for that amount, limiting our expenses outside of the hotel.", "title": "A little disappointed...", "helpfulness": 8, "user": "JandCsMomma", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124968284}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "We were given an awful little lean-to shed of a room by the garden, without any natural light. It was very dark and cramped. For what we paid, we expected more. I really wish this had been a better experience, but we won't be going back.", "title": "Bad room in a nice place.", "user": "Bojoellis", "date": "December 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 121934168}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our room was beautiful with period furnishings, comfortable bath, warm bathrobes, and view of the fountain in the pond. The complementary breakfast was freshly made and delicious.", "title": "Very romantic location for an anniversary!", "user": "JBernard20", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121561448}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I recently spent two nights at Monmouth Plantation in one of the deluxe suites. The decor was elegant and the grounds were lovely to walk around. The grounds are more naturalistic rather than very formal, and manicured, if that makes a difference to you. And the food at the 1810 Restaurant (the restaurant in the main house) was excellent; one of the best meals I've had in memory, and I live in New Orleans.", "title": "Great spot for a romantic & intimate stay", "user": "AustenNut", "date": "December 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121535342}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "As others have said, there are a few signs that this place is having some difficulties. The breakfast wasn't quite up to expectations for a B&B of this caliber, and there were some cobwebs in areas that weren't on the regular path of the cleaning crew (a picture frame, by the ceiling of a building door). Overall though, these were small imperfections that did not mar our lovely and relaxing stay.", "title": "Roof Leak", "helpfulness": 2, "user": "Richard F", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 121199494}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed in the one of the suites for an anniversary getaway. First off the jacuzzi tub did not work in our room. Then on our second night the roof started leaking over our bed. This was a tester bed so I looked up on top of the bed and found that a tarp had been stapled over the top to catch the water from this leak, meaning management knew this room had an issue. They moved us quickly, however they moved us to a smaller room in which our fire place was broken. For the amount of money they ask to stay in a suite I thought the conditions were terrible. No hotel should be allowing people to stay in a room that has a roof leak. I also found the food at 1818 to not warrant the price. Many of the dishes were not well thought out and they were uninspired.", "title": "Unique and wonderful spot but the service was not great", "user": "PaulKenny", "date": "November 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121191847}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Building & grounds: lovely. Very nice room. Nice grounds, with charming touches such as a \"chef's garden\" full of herbs, a lake with ducks, etc. The room was fresh and clean; not the most ambitiously decorated of the inns along our road trip but very nice.", "title": "Very good but not top notch", "helpfulness": 3, "user": "AlexanderGr", "date": "January 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122839401}, {"rating": 4.0, "title": "A wonderful place which needs a little TLC now...", "text": "Bar: We loved the afternoon cocktails with the home made mint juleps. Very nice touch. The snacks were a bit uninspired though.", "helpfulness": 2, "user": "Malim27", "date": "January 6, 2012", "id": 122653033}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Dinner: was very good but we wanted to try the tasting menu but couldn't because the chef refused to accomodate my travel partner who doesn't eat red meats, which I believe a fine dining institution should generally be willing and able to do. The a'la carte menu was nice too though, so we did enjoy dinner experience in the end.", "title": "Charming, romantic bed and breakfast", "user": "cliving549", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122510210}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Breakfast: a bit too basic and unambitions for a luxury inn. Other inns along our route did make a noticably greater effort with the details and quality of the breakfast.", "title": "A taste of the Old South", "helpfulness": 1, "user": "Ronhel", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122402921}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Overall, It's a great place but they need to work on the details to bring it up there with the best inns along the Mississippi. I would recommend Monmouth to anyone staying in the area. Just don't expect to be blown away.", "title": "A nice Colonial Home", "user": "SixPipes", "date": "December 25, 2011", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 122089421}], "location": {"country": "United States", "city": "Natchez"}, "stars": 4, "variance": {"poor": 11, "average": 26, "very good": 54, "terrible": 12, "excellent": 256}, "aka": "Monmouth Plantation Natchez Hotel", "slim_ranking": 0.0555555555556, "description": "MONMOUTH HISTORIC INN was built in 1818, and is a National Historic Landmark. As a charter member of Southern Living’s Hotel Collection, Monmouth is the perfect choice for travelers seeking an authentic southern travel experience. Wake up each morning to the aroma of a full Southern style breakfast, then take a tour of the magnificent mansion before exploring the grounds and all 26 beautifully landscaped acres. As the sun sets on the picturesque surroundings, relax on the veranda with a Mint Julep and complimentary hors d’oeuvres. In the evening, enjoy fine dining at the award winning “Restaurant 1818” in the antebellum home. As the end of the day draws near, retire to one of the 16 luxury suites or 14 elegantly appointed rooms, where a turned down bed and sweet dreams await!"}