{"user_rating": 4.5, "review_count": 101, "name": "Monopol Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Wonderful hotel, professional, courteous staff answer all your questions and cater to all your needs. Great spa, roof top lounge. WiFi is free. Excellent restaurant (Italian).", "title": "Centre of town, every amenity imaginable", "user": "BroadmeadTraveller", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122633113}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Not a cheap hotel, but worth every dollar.", "title": "Great for Our One Night Stay", "helpfulness": 1, "user": "Prince_nz", "date": "December 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121401731}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed at hotel Monopol for one night during Dec 2010 as enroute to our scenic train journey on the Glazier Express.", "title": "Not equipped for handicapped", "user": "Kermit68_9", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120134291}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We booked Double Room via Otel.com for 300 Euro's which included breakfast. This is the first time we have used this hotel booking system as it had cheaper rates then Hotel.com", "title": "great staff and nice accommodation", "user": "cosmopolitancary", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117997776}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The hotel exceeded our expectations as we did not know exactly what to expect as per the mixed reviews for this hotel, however during our experience we found the following:", "title": "Nice and Neat", "user": "NStar M", "date": "September 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117817873}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel is situated in the semi-pedestrianised area of St Moritz, close to the funicular station for the Corviglia and the buses for the Corvatsch and e surrounding area. Worth using the local transport system if you receive the Engadin card when you check in. We had a corner romm with good views over the town - it was a pity about all the cranes which seem to blight St Mortiz and other Swiss resorts. It was rather noisy at the weekend but fortunately the clock tower only chimed from 8am to 8pm. Room and bathroom were spacious, clean and comfortable; breakfast was very good. Service in reception was also very good.", "title": "Excellent Location and Comfortable Room", "user": "TonyQ", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117785185}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "As a tip - make the most of the Engadin Card and the bus service to the Corvatsch area, and make use of the local supermarket for snacks, water etc, but note that it closes on Sunday.", "title": "Great service, nice location", "user": "Dorothee S", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117591454}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We stayed at the Monopol for a long ski weekend. The service was fantastic! We got an unexpected room upgrade, which is of course a great start. But also otherwise the hotel was super. NIce and cosy breakfast, great Spa, very friendly staff. But the best part of it was yet to come - I had asked the hotel in advance to order a cake for my partner's birthday. They had to order it from an external bakery. And they did! It was delivered in style and with lots of candles during breakfast, really cool. And I was more than surprised when they told me during checkout that the cake was on the house. This is excellent service, and I hope I will come back!", "title": "Comfortable room, pleasant staff, central location", "user": "overthehill79", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117110282}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We arrived in St. Moritz by train from Zurich. The hotel advertises that they will pick you up at the train station so when we arrived I was looking for a phone to call the hotel. I found the Monopol van and driver who apparently meets trains every day to pick up hotel guests. He put our luggage in the van and off we went up the hill to the hotel. That's a nice service for someone who has never been to St. Moritz before.", "title": "Great food, Great Service, Great hotel", "user": "GordonMuir", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115660595}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We were greeted by a young man who told us our room number and gave the key to the bellman (he was the van driver) who took us and our luggage to room 506. See my photos of the room. We found the staff friendly and helpful and the bar man informative as to the local economy and the effect the strong Swiss Franc was having on their tourist business.", "title": "small but clean", "user": "borvornchai", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115525998}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "Centrally located in the town centre, with comfortable rooms, good bathrooms and a light and airy roof top spa with great views, the Monopol is a reasonable quality functional lodging in St Moritz, more suited to a two night stay than a long vacation. Breakfast in the basement restaurant is adequate but not exceptional, the bar off the lobby comfortably modern but marred by a rather surly barman. Beds are a little too soft, and too low. Adverse comments about the adjacent clocktower appear overblown as it doesn't strike until 8am when any self respecting St Moritizen should be up and preparing to go about their business hitting the slopes or the shops.", "title": "Comfort and convenient location in central St Moritz", "user": "Intrepidtoo", "date": "February 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 125386121}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Stayed here with a tour group. Good nice modern room, with view over the lovely laneways. I would certainly stay here again. Easy to walk around town.", "title": "Great Hotel", "helpfulness": 1, "user": "Sawnbay", "date": "February 28, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "service": 3.0}, "id": 125329898}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed at the Hotel Monopol in St Moritz for a week, commencing 4th February 2012 as part of a ski package booked via Inghams. The hotel is in a good, central location; just a few minutes walk from the Chantarella funicular, which takes you to the Corviglia ski area. We found the staff to be very customer focused apart from one individual we encountered on our arrival when we arrived at 10pm after a 5 hour train transfer from Zurich airport. When we called the hotel to collect us from the station, as arranged by Inghams, they refused and instead sent a taxi, for which we were expected to pay. This cost was subsequently reimbursed by Inghams, but made for a very irritating start to our stay. The next time we encountered this individual his manner was much improved.", "title": "Good location for skiing", "user": "forty-somethingUk", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124746661}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel is clean, modern and tastefully decorated and has a large comfortable lounge. Our room (a superior double) was not huge but was comfortable and frequently serviced. There are no kettles in the rooms and the hotel does not loan irons to guests (but will iron clothes for a charge).", "title": "Deserves higher ranking!", "user": "beluvbo", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123895478}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We stayed on a half board basis, which included a buffet breakfast and five course evening meal. The breakfast buffet was extensive and the evening meal was of excellent quality with a good choice of meat, fish and vegetarian dishes every day. Drinks prices were on a par with other 4 star hotels; around 7CHF for a glass of wine. The restaurant and bar staff were friendly, very helpful, flexible and extremely attentive throughout our stay. We would definitely eat in the restaurant again even if we weren't resident.", "title": "Nice hotel", "user": "bentleysinoz", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 123814506}, {"rating": 5.0, "title": "Luxury", "text": "Probably the best 4 star hotel I have ever stayed in. From the pickup at the station, to the welcome at reception and inviting hotel bar, the staff were an mixture of warmth, friendliness and efficiency. Downstairs restaurant missed out on the views afforded the top floor sauna and lounge area, otherwise this hotel was perfect. Food was excellent and 5 course meal included with my stay was a bargain. All the small touches expected from a top hotel are provided. Interior is new, modern and kept clinically clean. Loved it.", "user": "MartinDee", "date": "May 15, 2011", "id": 108286154}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "This is a very convenient hotel for skiing at Corviglia – a 5 minute walk to cable car. Very noisy at night with revellers returning from bars at 3 am underneath our window. Expensive even with a 20% discount for off season. Didn’t try the restaurant in the evening as the menu looked overly complicated and rich. There are plenty of other options in the town. However, the skiing was fantastic, so we will come back to St Moritz – but not to this hotel", "title": "Noisy and expensive", "helpfulness": 2, "user": "SWKA", "date": "April 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 102878591}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This Hotel is typical of a 4 star Swiss hotel it is clean, tastefully decorated, the rooms are comfortable and it is efficiently run with the exception of the restaurant. I would especially mention the courteous and helpful reception staff and the hotel bar which is run exceptionally well.", "title": "Hotel is generally fine but the restaurant is dreadful", "helpfulness": 1, "user": "EDRICE", "date": "March 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 101246533}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "However, the restaurant rates about 2 stars the food lacks taste, imagination and quite obviously there is nobody in the kitchen with a modicum of creative ability. On our first night we were served chicken which which was not cooked properly, gnocchi which was tasteless and resembled kitty litter and deserts which were simply awful. No improvement was evident our second night and in fact it took the disinterested and indifferent staff 90 minutes to realise that they had forgotten our main courses - I had words with the restaurant manager who did not seem to care.", "title": "Nice Stay at Hotel Monopol", "user": "Robins44", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98858960}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Breakfast was an experience, the 3 minute boiled eggs were raw and the 5 minute eggs could be used in an artillery barrage. The scrambled eggs would have been ideal for filling our many potholes and the coffee was undrinkable.", "title": "Effortless stay", "user": "cocodemer82", "date": "February 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97343729}], "location": {"country": "Switzerland", "region": "Swiss Alps", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 12, "very good": 38, "terrible": 0, "excellent": 47}, "aka": "Hotel Monopol Swiss Quality", "slim_ranking": 0.40625}