{"user_rating": 3.5, "review_count": 32, "name": "Montague Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We did not stay at property, although we have done so many times in the past years. It was always a special, anticipated trip. We came for dinner before a concert at Dow Event Center.", "title": "Sad visit", "helpfulness": 5, "user": "Melanieann", "date": "February 16, 2009", "detail_rating": {"value": 2.0}, "id": 24642247}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "As we came up the walkway of this stately home, we were both saddened by the general feeling that it was being let go. Shutters askew etc. When we entered 3 workers turned and gave us a dear-in-the-headlight look. We were settled in. and dinner service started. We ordered Champagne, was brought out a split, which was fine.", "title": "Disappointing", "helpfulness": 4, "user": "pamelaksch", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 21012221, "likes": {"liked": "— beauty of the grounds", "disliked": "— the food"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "Tasted it and realized it was cheap sparkling wine. We mentioned that it was not what we ordered and it was taken off bill. Dinner plodded along, even though we had mentioned quite a few times that we had an event to attend. Finally after one hour our mains were brought out, they were fine, but had to be bolted since we had 15 mins to get to our show. Our waiter tried, I think, but was woefully untrained. I had read it was under new management and I hope they have bags of money to restore this gem to its former glory. It will be a while until we return, if ever.", "title": "Perfect for genealogists!", "helpfulness": 1, "user": "kayakgrady", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14602441, "likes": {"liked": "— Location, the mansion itself, and friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband and I don't get to spend much time together, because he travels quite a bit for work, so we cherish time together on weekends and like to travel to Bed and Breakfasts/Inns around the state. When we mentioned the Montague Inn, my parents raved about the times that they stayed there in the past. Well, the Montague is under different ownership, and those days are gone. The mansion is unquestionably beautiful, as are the grounds. The rooms are beautifully furnished. Our room, however, was not very clean (especially the bathroom floor) I thought that this was a fluke, but the cleanliness did not improve our second night.", "title": "Private Dining On Our First Anniversary", "helpfulness": 1, "user": "cruisecontrol75", "date": "January 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13133764, "likes": {"liked": "— Their ability to focus on the details!", "disliked": "— Our schedule limited us to two nights."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We arrived late Friday night, and because they had openings in their restaurant we decided to dine there. Our dinner took an exceptionally long time- our total dining time was 1 and a half hours. My husband's beef was well done, when he asked for medium rare, and the morel mushroom topping described on the menu was absent. Also, the serving size was exceptionally small- his meat was probably less than 5 ounces. The price for this entree was $30. I had the pecan pork tenderloin for $28 which included about 6 ounces of meat (the meat tasted good) accompanied by an undercooked potato and a few asparagus stalks. The waitstaff was very sweet, though, and we thought all of this was a fluke. We dined again on Saturday night, and my husband ordered the beef entree again,(medium rare) reminding them to not forget the morels. I ordered an indian chicken dish. The beef entree came well done + , and was topped with ordinary mushrooms. My chicken dish was awful. It was approximately 2 ounces of grilled chicken on a bed of al dente mixed peppers with curry sauce over the peppers. I told the waitress that this was the strangest indian dish I had ever tried, and I asked for some rice to go with it. She gave me a plate of rice pilaf. I ate the chicken, but left the rest. I also pointed out that on the menu, the indian dish is advertised to come with tomatoes and onions, she shrugged and explained that they had a new chef. The cost of this chicken dish was $21. None of our entrees were presented like the entrees pictured on the website. We spent a total of 2 hours 15 minutes at dinner.", "title": "The elegance may be faded but still charming", "helpfulness": 2, "user": "Sommerset", "date": "January 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 12734441, "likes": {"liked": "— Very pretty rooms filled with character and charm.", "disliked": "— Staff is bit hit and miss, breakfast options, location"}}, {"rating": 5.0, "title": "Lovely mansion", "text": "Great place to stay. The staff is wonderful and makes the guest feel like royalty.", "helpfulness": 6, "user": "djelcc", "date": "February 11, 2005", "id": 3178981}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Montague Inn is simply amazing. My wife and I love it and have been treated with the utmost respect and friendliness and have always felt like we were special. Our dinner this past trip (New Years Eve) was spent in the gorgeous and wonderfully romantic Robert's Room. The fireplace and Christmas tree in the room were both really a nice surprise. As for our meal, I had the Beef Medallions which were cooked perfectly and my wife had the Lamb Shankwhich was so tender it was falling off of the bone. Our server was bright and bubbly and let us take our time through all the courses of a wonderful dining experience in the very crowded dining room. We expected the crowd as it was a holiday so there is no use complaining about a restaurant that is busy. I believe some people find things to complain about and it's too bad. I 110% recommend the Montague Inn", "title": "Not sure what the negative reviewers are smoking", "user": "jimdrw", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52404927}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "This was the worst experience of my entire life! We had dinner reservations for 8 people at 6:30 to celebrate my Mothers 85th birthday. Four of us traveled from Tampa Fl and the rest were local. I guess I should have been worried from the start when on a Friday evening there were only two cars in the entire parking lot.", "title": "Montague Ruined my Mothers 85th Birthday Party!", "helpfulness": 5, "user": "ShelbySue06", "date": "October 23, 2009", "detail_rating": {"service": 1.0}, "id": 47570977}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were greeted eventually by a younger man that was poorly dressed. Our waiter was very nice and I believe his name was Justin. Believe me he was the only bright spot in the entire evening.", "title": "Completely false advertised!!", "helpfulness": 3, "user": "MACgirl312", "date": "September 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 39624146}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We placed our drink order and every beer that was ordered they advised us they were out of.", "title": "Good for wedding, but forget leisure!", "helpfulness": 4, "user": "gwkelley", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 39098501}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We all ordered our meals from a very very limited and somewhat expensive menu. Only one person ordered an appetizer which was a shrimp cocktail which took about 45 minutes to come out to the table. It would have been better if it didn't come out as it tasted like rubber and was just horrible.", "title": "The Best place to stay in Saginaw", "helpfulness": 1, "user": "ThomasWaters", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37472238}], "location": {"country": "United States", "city": "Saginaw"}, "stars": 3, "variance": {"poor": 9, "average": 3, "very good": 5, "terrible": 4, "excellent": 11}, "slim_ranking": 0.25}