{"user_rating": 4.5, "review_count": 572, "name": "Montebello Splendid", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My husband and I stayed at the Montebello for 3 nights the week of July 10. The hotel is a short 10 minute walk from the train station and about 15 minutes from the major attractions (Uffizi, Accademia, etc.). This normally would not present a problem but proved challenging during record setting temperatures (high 90s,) and a taxi strike.", "title": "Almost splendid", "helpfulness": 2, "user": "Jackson071004", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 5511463, "likes": {"liked": "— The staff was just great.", "disliked": "— It's a little bit of a walk to the major attractions. The rooms are TOO small in some instances."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The hotel was a welcome oasis. We experienced none of the problems with the air conditioning, internet, or flooding mentioned by previous reviews. The staff was wonderful. They reserved the Uffizi and Accademia for us so we did not have to wait in line. The concierge recommended a great restaurant a block or two away, Il Profeta. They serve a GREAT tiramisu! They also pointed us in the direction of a self-serve laundry that was right around the corner.", "title": "Fantastic Find", "helpfulness": 3, "user": "Stenna", "date": "July 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5492051, "likes": {"liked": "— Location", "disliked": "— Aircon controls"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Breakfast was included; however, it was awful! Mostly hard, dry pastries, cereals, one chafing dish with runny eggs and limp bacon. Although a short hike to the city center and shopping, the Montebello is very close to many restaurants and dining options. Take advantage of them.", "title": "Very close to perfection…", "helpfulness": 2, "user": "Member in Philadelphia", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5459398}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Other nice finds in the vicinity: an internet cafe, small grocery store/market, a newsstand with english language newspapers.", "title": "Gorgeous hotel but....", "helpfulness": 3, "user": "magvictoria", "date": "June 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 5405774}, {"rating": 5.0, "title": "Fantastic", "text": "The primary reason I rated this 4 instead of 5 is the room. Beware the rooms in the basement. They are EXTREMELY tiny. Barely large enough for the the two twin beds that were pushed together. The flat screen tv was also very small. The size of a screen on your average laptop. The bathroom, tiny and poorly designed. I'm 5'9\", medium build. When sitting on the toilet, my knees were almost touching the facing wall and I had to reach about 3 feet for the toilet tissue. The shower is open i.e. no door; and because it was under the stairs, the ceiling sloped and narrowed. My husband is 6'1\" and could barely stand upright in the shower. Also, because the shower head is facing the outer room, you could not turn on the water without it spraying all over the bathroom. After realizing this we took baths for the remainder of our stay.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5395366}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I loved this hotel. The service was impeccable and the room was very comfortable with lots of details that made the experience special (e.g. bed-side controls to open and close the window shutters and turn on a do-not-disturb light on the room's door). The hotel is not as close to the center of town as some may want, but the neighborhood is a quiet retreat from the congestion just a few blocks away.", "title": "Wonderful", "helpfulness": 4, "user": "SFAdam", "date": "September 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5782187, "likes": {"liked": "— The quality and comfort of the room.", "disliked": "— There is no fitness facility."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Just returned from Florence and my stay at the Montebello. There were good and bad things about the hotel but it's definitely not splendid; more like so-so! The rooms are not very large but satisfactory. They are tastefully decorated and the bathroom is a good size. The 'hydro\" shower was a plus. The breakfast was not great. Not a good selection and not the good quality food you would expect from a luxury hotel. The hotel is about a 15-20 minute walk into teh heart of Florence, but manangeable if you don't mind walking. The main problem with this hotel is the staff. They are indifferent and some don't even try to hide the fact that they detest tourists or Americans or both. I asked one particular gentleman at the front desk to just confirm arrangements that another staff member has made for me. He became annoyed and argumentative with me. I have stayed at many fine hotels and have never been treated this way. You would expect the staff to be polite and try to accomodate you. SO if you are lloking for a mediocre overrated hotel, far from the heart of Florence with apathetic rude staff, then this is the place for you!", "title": "Not so Splendid!", "helpfulness": 6, "user": "traveldiva23", "date": "September 4, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5768738}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This place was terrific, great rooms and amenities. And...it was quiet. Other reviewers commented on the long walk to the central area, but it didn't strike me that way. 2 blocks to the Arno and a lovely walk into the central area. A nice way to counterbalance some of the terrific food we ate whilst in Italy. Only negative - the concierge sent us to a restaurant that was a hard core tourist trap - view was stellar but the food was only OK -- and we paid dearly for it.", "title": "Loved it!", "helpfulness": 8, "user": "Woman9876", "date": "August 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5623851, "likes": {"liked": "— the bathrooms were awesome", "disliked": "— concierge service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "My Best friend and I decided to book a fun vacation to a great place that we had dreamed of for years. We booked our entire trip on-line one evening and hoped for the best.", "title": "NIce Surprise", "helpfulness": 11, "user": "Aspden", "date": "August 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5575231, "likes": {"liked": "— Small size, beautiful surroundings, security", "disliked": "— menu very limited - a little pricey , long walks back from city center"}}, {"rating": 3.0, "title": "Sometimes Splendid", "text": "Upon our arrival we took a cab to the hotel, which took about 8-10 mins and costed 20 euros, and were very pleseantly surprised- it looked like the pictures! Never before had published pictures truly represented what the site actually looked like.", "helpfulness": 4, "user": "MistressofthePark", "date": "August 1, 2006", "id": 5534667}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We were going to Florence for a few days and wanted to spoil ourselves with a luxury hotel. And luxury we got!", "title": "Fantastic", "helpfulness": 3, "user": "LHIS", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6106502, "likes": {"liked": "— Everything", "disliked": "— A little bit out of town"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We walked into a beautiful lobby and were welcomed by really friendly staff. They were really helpful and gave us a welcome pack which included a guide book of sight to see in Florence (this was better than the one I bought from the UK!). We were then escorted to our room and made to feel very much at home.", "title": "Loved this hotel!", "helpfulness": 1, "user": "Martina76", "date": "November 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6095168, "likes": {"liked": "— Friendly staff", "disliked": "— Light control"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The room itself was well equipped, with very modern equipment (which provided my partner with much entertainment!).", "title": "Great Choice as long as you are able to overlook the arrogant staff at the front", "helpfulness": 6, "user": "opus11", "date": "October 29, 2006", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6026891, "likes": {"liked": "— everything was just as shown on their web site", "disliked": "— front desk staff terrible attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The bathroom was well laid out with ample toiletries, dressing gowns and lots of towels. The 'massage' function in the shower was lovely!", "title": "Fantastic Stay", "helpfulness": 3, "user": "Henryny", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5985689, "likes": {"liked": "— Service", "disliked": "— nothing in particular"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The bar and restaurant teams were great, it was much quieter during the week which meant you got lots of attention. They were a little more stretched over the weekend but still were very hospitable.", "title": "So So", "helpfulness": 3, "user": "Sleepless_Travelers", "date": "October 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 5908582, "likes": {"liked": "— Entrance, breakfast", "disliked": "— Location, Rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We just returned from a great vacation at Florence. We stayed 2 nights at Montebello Splendid. We chose this hotel from the recommendations of other trip advisors. It was certainly a beautiful hotel that was immaculately maintained - we especially liked the courtyard. The rooms were very well appointed and the variety at the complementary breakfast was terrific. It was disappointing, however, that the attitude of the staff - from the front desk and concierge to the restaurant - was more one of indifference - they were unfriendly and just didn't seem very happy being there. This was certainly not a 5 star experience.", "title": "Beautiful Hotel - Indifferent staff", "helpfulness": 4, "user": "GFlorida", "date": "January 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 6562818, "likes": {"liked": "— Beautiful Hotel and courtyard", "disliked": "— Unfriendly staff"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The rooms and public areas in this hotel were very elegant and well maintained, and the location, 10-15 minutes by foot from the main attractions in Florence was reasonable. What was not reasonable was the dysfunctional Internet service, which marred our stay. Given that we paid top dollar and that Internet service was advertised as available, we were very shortchanged. The \"regular Internet service\" (through a very confusing arrangement combined with the TV) was impossible to master. The wireless connection to a laptop was often unavailable and, when available, was asking for username and password six times an hour. The front desk staff was sympathetic but unhelpful.", "title": "A nice property with poor Internet connection", "helpfulness": 4, "user": "Reuel_Tidhar", "date": "January 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 6552636, "likes": {"liked": "— Elegant decor", "disliked": "— No Internet"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I consider a reliable Internet service a necessity in my travels and hence I will not go back to this hotel.", "title": "hotel experience", "helpfulness": 5, "user": "brea-traveler", "date": "January 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6545542, "likes": {"liked": "— spa inside the bathtub", "disliked": "— the staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We just returned from Italy and we stayed at multiple hotels. One hotel that I have the urge to comment about is this one. The overall staff was overly unfriendly. For example, one thing that bothered me the most was when we were having our complimentary breakfast, our server dropped a silverware on the floor and she simply placed back where it could be used again. In addition, when my wife used the toaster, the toaster didn't work properly. And when we told the server, they gave us a look as though we broke the machine. However, the hotel room was great, but I would think twice before I book this hotel again.", "title": "Wonderful hotel - Highly recommended.", "helpfulness": 3, "user": "Eti", "date": "November 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6308007, "likes": {"liked": "— The amazing attention to details, the beautiful atmosphere, the feeling of luxury", "disliked": "— Dinner at the hotel restaurant"}}, {"rating": 5.0, "title": "Comfortable Stay", "text": "Wonderful hotel - highly recommended.", "helpfulness": 1, "user": "ejs", "date": "November 15, 2006", "id": 6134932}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 23, "average": 55, "very good": 131, "terrible": 21, "excellent": 342}, "aka": "Montebello Splendid Florence", "slim_ranking": 0.186147186147, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "An old villa from 19th Century with private garden located in the lively heart of Florence and transformed into a boutique 5 stars hotel full of charm and warm atmosphere, according to the neoclassical Florentine tradition. All rooms are elegantly designed and decorated differently but all equipped with the most up-to-date comforts. In a few step from the hotel you can easily reach all the most important attraction of Florence. Opened in June 2004."}