{"user_rating": 4.0, "review_count": 7718, "name": "Monte Carlo Resort & Casino", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stayed at the Monte Carlo from 11/29/07-12/4/07. 3 of our nights were under $60, weekend nights were a little higher, but not bad. We arrived late and they did not have a king size bed strip side for us, which is what I requested. Based on other reviews, I did not take a pool side room (based on construction noise), so we took 2 queens on strip side, 16th floor. They said they would hold a King size strip side room for us if we wanted to move the following day. Their key machines were broken, so we had to wait for security to let us into our room and come back later for keys. The room was clean and the view was nice, but we did decide to take them up on the king size since we were staying 4 more nights. After multiple attempts to see if the new room was ready, we finally moved into our new room at about 5:00 PM the next day. Now we had a room on the 31st floor! View was even better, room seemed a little cleaner, and we had more space without the extra bed. We definitely did here horns and beeping from the construction starting at least by 6:00 AM in the mornings - even being high up, strip side. I don't think there are any rooms that wouldn't hear it. Otherwise, no complaints on the room.", "title": "Not bad, good price", "helpfulness": 4, "user": "Family-with-four", "date": "December 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11267217, "likes": {"liked": "— Location and Price", "disliked": "— Construction noise, some hallway/room noises"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Restaurants we tried - Diablos, the Cafe, and the Buffett were all good. The buffett was free under the football fan promotion, which was a nice perk. We tried the brew pub for drinks and it was decent. Not a ton of action going on, but to get a quick decent drink, it was fine. We also got a free drink under the promotion. No problems with any of the restaurants we tried.", "title": "Stay Elsewhere - Construction surrounds the hotel --", "user": "SunsetLane", "date": "December 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 11232382, "likes": {"liked": "— Cannot think of one item!", "disliked": "— The hotel not informing guests of construction noise on making reservation."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We both used the spa for massage and pedicure and both satisfied with their service. Under their promotion, these services were reduced as well, which was also a nice perk.", "title": "Would'nt recommend staying at the monte carlo", "helpfulness": 1, "user": "joseph55", "date": "December 3, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 11230875, "likes": {"liked": "— Nice lobby", "disliked": "— Average at the best especialy for the price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Casino was quiter than others I've been to, so if you want a lot of 'action', you may think about going elsewhere. They usually had $5 craps tables available, which I used often. Employees were always helpful and friendly.", "title": "Elegant hotel, perfect location", "helpfulness": 3, "user": "Gaviano", "date": "December 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11219418, "likes": {"liked": "— Location", "disliked": "— no complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Overall, very satisfied with our experience. Nice hotel for the money.", "title": "Semi-good luck at the Monte Carlo", "helpfulness": 7, "user": "flygirl75", "date": "December 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 11192543, "likes": {"liked": "— The staff and the location.", "disliked": "— The bedding, the shower, the view (on-going nearby construction)."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We had 5 nights at the Monte Carlo, great location right in the middle of the strip and not to far to your rooms like some of the other hotels. I tried for an upgrade but as we arrived mothers day the hotel was completely booked out. The room we had was a good size with a king size bed very comfy. The rooms are very dated really needs a refurbishment reminded me of the 70's. Pool area was huge but they pack you in like sardines very hard to find a seat and if you get one its not near one of the pools but further away and still no room to move. The cocktail service in the casino is very slow but on the positive you dont have to pay for a drink whilst playing the slots or tables. We had rude service in the Chinese restaurant when we asked to put tab on room. But forgetting all of this we had a great trip there. Make sure you book maverick helicopter for a trip to the grand canyon and back over the strip at night truly amazing.", "title": "Great location", "helpfulness": 1, "user": "Susanna61", "date": "June 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 131106142}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed at the Monte Carlo from 5/21/12 - 5/26/12. We are a family of 4 with 2 sons (ages 21 & 25). When we arrived, the check in counter was a bit crowded, however the line went rather quickly. I requested that we not be placed near any bachelor or bachelorette parties, away from the elevator and no adjoining room door (to cut down on the noise). My requests were granted along with the refrigerator I requested, at no extra cost. The resort fee was changed to $15.00 from $20.00 since we booked before the price increase became official. The hotel is very clean and well decorated throughout. Yes, the rooms are a bit dated, but not worn or dirty. The room has a safe, room control AC, flat screen TV, comfortable bed and pillows, blow dryer in the closet, etc. - your typical hotel room. No problem with water pressure and bathroom was well equipped and maintained. The remote control did not work in my sons' room, service came up quickly and repaired that. The 1st refrigerator in my room was inoperable, but service replaced that one rather quickly. Maid service arrives between 8:00-10:00 a.m. which was perfect for us because we were out of our room by 7:00 a.m. daily. We used the gym daily at 6:30 a.m. which was well equipped with cardio machines and free weights, towels, water and cleaning wipes to wipe down your machine. The gym is located on the 2nd floor in the spa, however, the spa is not included in the resort fee (i.e., sauna & whirlpool use), however you can purchase an all day pass for $10.00. The hotel is a better fit for adults, only. Although, I do not believe Las Vegas is a place for children to begin with the reason I waited until my youngest was 21 years old to visit. The pool area was clean and well serviced. The pool does rent a float for $10.00/day, but you can purchase a ring at the CVS and bring with you. Do not bring any food or drink (including bottled water) to the pool. You may only consume their products. I've read a few reviews about the volume level of the music at the pool. Yes it was loud, but not so loud that I could not converse with my party. There were a few children at the pool, but mostly adults.", "title": "Great Place, Great Value", "helpfulness": 7, "user": "Maria2668", "date": "June 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131086955}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We purchased the buffet all day pass at $32.00/per person/per day because that was the best deal for a variety of good fresh food. We all enjoyed the buffet, including my sons. I tried the cupcakery and the yogurt place, both were average in taste and quality. We took the free tram north to the Bellagio then picked up the bus to go north on the strip to the Stratosphere. I dont care to gamble, but figured I would spend $20.00 and I won $170.00 at the roulette table at the Stratosphere! I cashed in my chips and left. My husband and son did the sky jump at the Stratosphere, expensive, but they enjoyed it. The skyjump is the highest free fall ride in the world - so we were told. Dont go to the observation level, you get a better view from the sky jump area and its free. They charge you to gain access to the observation level at the Stratosphere, but you can go up to the restaurant during happy hour (4 - 7 p.m.) w/out a cover charge, but there is a 2 drink minimum. We saw a great comedy show at the Laugh Factory in the Tropicanca and the Ultimate Vegas Variety Show (this was a recommendation by the concierge desk at the Monte Carlo) in the mall in Planet Hollywood. Both were excellent and I highly recommend them. The price was reasonable for both. We were not able to fit in a Grand Canyon or Hoover Dam trip, but I am sure we will return and will fulfill both of those \"must do\" activities. We visited the M&M store across the street. The M&Ms are found on the 2nd floor and priced by the pound, not exactly cheap, but the visit was entertaining especially when creating my own bag of M&Ms from the several varieties offered. On the 3rd floor, you can create your own personalized M&Ms. The people that stand on the streets and hand out cards were not overly aggressive or disrespectful. Do not make eye contact, keep your hands at your side and continue walking, if you want to avoid taking a card. In fact, they were far more focused on handing the cards to men, which was a plus for me! There is a roller coaster in NYNY and a Ben & Jerry's! Try not to get fooled into walking too much on the strip. We are city people and are stubborn about walking and paid the price. Just because you can see it does not mean its w/in a reasonable distance, LOL. There are areas on the strip, especially near the City Centre, where you can only cross the strip by way of pedestrian bridges the path to which may take you up and down a few escalators and stairs BEFORE you reach the pedestrian bridge only to meet a new set of the same. We had another adventure when we were headed home from the Stratosphere, however, instead of looking both ways for a bus stop, we immediately walked south on the strip instead w/out bothering to look north for a south side stop. We had to walk a few blocks before we hit one (mind you a block in Vegas or any other city is far longer than a neighborhood block). Despite eating at the buffet 3 times/day, with all the walking, we didnt gain a pound!", "title": "Read some reviews so you know what to expect.", "helpfulness": 2, "user": "islegal13", "date": "June 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131072447}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The all day bus pass is $7.50. The bus goes north and south on the strip then to Fremont Street. There were too many places to visit for me to stay on the bus long enough to figure out if the bus goes as far as Pawn Stars, oh well, maybe next time.", "title": "Vegas vacation", "helpfulness": 1, "user": "biggramp", "date": "May 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 4.0, "service": 5.0}, "id": 131052677}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We really enjoyed our trip to Vegas and will certainly return. We also plan on returning to the Monte Carlo for its great price and amenities.", "title": "Excellent Girls weekend", "helpfulness": 1, "user": "trvldog", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131041153}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Stayed at the Monte Carlo last week I can say that it was OK for Vegas. The location was close to the centre and it if you prefer to taxi to one of the further ends of the strip and walk it is a fairly cheap ride (ask to go the back way and NOT down the strip). As other reviews have mentioned the hotel is showing its age but the room was nice and was clean and the bed was excellent so as far as I am concerned all was good!! I am a little paranoid about dirty hotel rooms and after reading LOTS of reviews of other Vegas hotels I felt hesitant about this trip but after a close inspection of the room when we arrived I was happy and had no problems sleeping on the very comfy bed. We also ate at the Mexican restaurant (I think is was called Diablos) and the Chinese Noodle restaurant at the hotel and both meals were very good. The Noodle restaurant was one of our best meals in Veags and I would highly recommend it - there were six of us and we each ordered something different and then shared it and all the dishes had their own unique flavour and were wonderful! I also liked that there was a Starbucks and McDonalds downstair and in the morning there were short lines and hot coffee only a minute away!! I can say that I am not a big gambler so I wasn't expecting much when I decided to try the slot machines at the Monte Carlo but for the first time ever in Vegas I actually won money every time I played at our hotel !!! I have to admit I had fun playing them!! I do agree with other reviews that it is an average hotel for Vegas but for what we paid I have no complaints and if I did I would totally be telling you here as I value Trip Advisor and the honest opinions that people post. Thanks Monte Carol for a very nice Vegas vacation.", "title": "Vegas!", "helpfulness": 3, "user": "Melster", "date": "October 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 119340565}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "Very nice hotel in s great location. Good beds and bedding. The only thing we didn't like was the daily \"resort fee\" added to your bill. What a bogus way to add $18 a day to the price if the room. Probably will never stat again because of this fee.", "title": "Great location", "user": "COLO_USA", "date": "October 15, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 119320585}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed at the Monte Carlo Hotel from 10/3/11 thru 10/9/11. After reading the reviews, we were hesitant - however, I am certainly glad that we picked this one! This hotel is in a great central location on the strip & downstairs right around the corner from the elevators is a Starbucks (great for coffee in the morning), McDonald's, Subway, etc. The food at \"The Cafe\" is extremely good - we ate there for breakfast each morning. Beds are so comfortable you don't want to get out of them in the morning. Yes - the hotel could use a little updating but if you want extreme luxury, then stay at a 5 star & not a 4 star. The hotel was extremely clean!", "title": "Nice Hotel & Nice Location", "helpfulness": 3, "user": "Sharon G", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119311681}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "One thing this hotel had that we noticed many others didn't was padded benches in the lobby. This may sound silly to some of you; however, when you are traveling with an 85 year old woman, these benches came in handy while the rest of us were in line checking in. The other hotels had zilch in their lobbies to sit down & rest if you chose to.", "title": "Great Hotel", "helpfulness": 2, "user": "tigerlily32", "date": "October 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119299163}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We had nothing but extremely friendly waitstaff, clerks, housekeeping, etc. The \"stains\" in the hallway on the carpet were minimal & something we barely noticed (someone must have spilled their coffee or something). And the previous reviews we read about the shower heads - I LOVED that shower! It comes out quite hard & feels great on your sore back or feet.", "title": "Average Everything on the Strip", "user": "wopdango", "date": "October 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119294732}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We stood at the MonteCarlo for my friends wedding and it was really nice. The pool area is amazing lots of fun!! Not sure why some people are giving it a bad review it's actually a really nice and affordable hotel. Staff was very nice & the rooms were nice and clean. I would recommend it especially if you are going in a large group. Totally worth it! Don't forget to see Cirque Soleil Zumanity at the New York New York!! Amazing!!", "title": "Nice & Affordable", "user": "ma0106", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119220685}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Had the pleasure of staying at the MC for the first week of October. Could not understand", "title": "Very happy with Monte Carlo", "helpfulness": 4, "user": "Joan Smithers", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119220640}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "any of the complaints I had read about before I came here - we did not find any fault anywhere except perhaps the horrid music around the pool. The MC has a good location and we were very happy with our strip view (room 30-212). Possibly the only complaint would be the lack of a tea/coffee maker in the room but would have had trouble faulting the room otherwise (did suffer noisy neighbours). Reception were a little slow on arrival but nothing other than helpful at other times. Would definately recommend this hotel to anybody who mentions coming to Las Vegas.", "title": "If you only read 1 review - read this one !", "helpfulness": 10, "user": "PapaPierce", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119196330}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "My wife and I & our 2 friends have literally just returned from a weeks holiday at the Monte Carlo. Quite frankly, I dont understand why so many people are giving this such a bad review. Perhaps they are too fussy are perhaps my standards are too low - but I'm certain it's not the latter !!! The staff were excellent throughout the entire duration of our stay, our bed was the most comfortable I've ever slept in, our room was cleaned everyday - along with clean towels changed daily, the range of food offered in the various cafes was really good, the pool was lovely and the casino was great - I really can't see what anyone has to moan about ! Yes a couple of pieces of furniture in our room were scratched, perhaps the bathroom was a little outdated and maybe the music round the pool was a bit too loud ( weekends only ) but this is quite simply one of the nicest hotels I've stayed in - simple !", "title": "Monte Carlo Las Vegas", "user": "Debbsi1", "date": "October 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 119160435}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Tips - make use of the $44.99 buffet of buffet pass, really good value for money - we had dinner at the Rio, breakfast at the Paris ( fab ) , lunch at the Imperial Palace ( :-( ) and dinner at the Spice Market buffet in Planet Hollywood. 4 meals each within 24 hours - would thoroughly recommend it.", "title": "room less than adequate", "helpfulness": 1, "user": "Lynne B", "date": "October 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 119152209}, {"rating": 5.0, "title": "Excellent", "text": "My husband and I stayed a week at the Monte. The hotel was super nice and clean. The decor was elegant and upscale. I was most impressed with the non-smokey atmosphere in the gaming section. The hotel offered a Texas Holdem lesson for one hour each morning. This was really helpful for a first time Vegas visitor. The buffets were awesome. I liked the location on the strip, convenient to everything. The room rate was low compared to other hotels in this level. We rented a car at the hotel and went to the Grand Canyon for two days. The only negative thing I can think of is the rooms were not very sound proof, especially noise from the hallways. We will definately stay here again when we return.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 28, 2004", "id": 2954102}, {"rating": 3.0, "title": "Good prices in return for not much else", "text": "Stayed the week before Christmas and the rates were fabulous however we had requested adjoining rooms to our children weeks in advance when we booked the hotel. They had none except on the vip floor which was $39.00 more a night per room and they promised the next day we would have adjoining rooms to move to on the lower floors.Our key to the vip floor was very difficult to access, rarely working on the first few tries. We waited all day for this and at first they said we had to be out of our room at 11:oo am and our new room wouldn't be ready until 5-6pm. They ended up letting us stay in the old room but refused to call our cell to tell us when it was ready and we had to keep checking back to see if it was ready so we wasted a day. In both rooms the water pressure for the shower was so weak I thought it would take all day to get the shampoo out. They had a bad selection of slot machines and they were so tight they squealed. The buffet was good. the selection of fast food was good. The crap tables were cold and the blackjack too. The people at the hotel were for the most part unfriendly with the exception of a couple. If you go on a cheap rate don't expect much!!", "helpfulness": 2, "user": "swimmom1960", "date": "December 28, 2004", "id": 2947425}, {"rating": 5.0, "title": "Great time, great hotel", "text": "Stayed at the Monte Carlo from Dec 19-22. Had a great time. The hotel was in a prime location on the strip with Bellagio, Caesars, MGM Grand, and other hotels very close by. The rooms were very clean and comfortable, and unmatched for $49 per night. What a deal!! The property was a good size: not too big, but not too small. Lots of low limit blackjack tables available. Good food court and helpful and friendly staff. Only negatives were a few rude dealers and tight slots. Would stay at the Monte Carlo again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 27, 2004", "id": 2946953}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "The Monte Carlo was a very nice place to stay. We had requested a king size bed, and it was the most comfortable bed I've slept in at a hotel. We got the hotel through a package deal so I'm not sure what the 'regular' price was. The bathrooms were huge. The service was fantastic and everyone was extremely helpful. Even though the Monte Carlo isn't right in the middle of the strip, it is in a nice place. The buffet was good, a lot better than the MGM Grand buffet.", "title": "Excellent place to stay.", "helpfulness": 5, "user": "king710", "date": "December 17, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2887420}, {"rating": 4.0, "title": "Great Value for the $$$", "text": "We are planning on going back to Vegas someday and the Monte Carlo is the place we will stay at.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 17, 2004", "id": 2887401}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed for two weeks at the Monte Carlo and had a great time,we were given a high floor and a strip view which is just what we wanted .The staff were very friendly and helpful,our check in and check out were fine,even though there were ques they went down very quickly.", "title": "Good stay", "helpfulness": 3, "user": "San000", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130840545}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "My only grip there wear to many sun beds round the pool,which meant you were very close to the person next to you,and had to slid on to the sun bed from the front .", "title": "So much fun in Vegas!", "helpfulness": 3, "user": "Sccrmom3", "date": "May 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130823081}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Stayed at club 32 in a beautiful room wonderful views of the strip! The services were hands down the best I've received in Vegas in a while!! The restaurant Brand had yummy food and drinks and fun dance club at night! The music at the pool in the day was really just super fun!!", "title": "Can't Really Complain for the Price", "user": "Luckyduck2012", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 130813125}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed here for 4 nights in mid-May. This was our third stay at the Monte Carlo and I can't really complain about too much. Everyone was extremely friendly and helpful. Everything was kept really clean. The hotel rooms are basic and are definitely a bit beat up but the cleaning staff made sure everything was super clean. We didn't have to wait to check in. The repairman came really fast to repair the remote for the tv, extra towels were delivered really fast. Our checkout was really fast. The only thing that could have been different is that the tub spigot and shower spout were in disrepair. We were travelling with others so we didn't want to have to move them out of their room as well to get a room that didn't have this issue.", "title": "Monte Carlo rip off", "user": "Michael J", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130801629}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Ate at the buffet for brunch and the selection was really good and everything was hot and fresh. Good value for the price and the wait staff were superb.", "title": "Redemption", "user": "Rory M", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130781159}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "the good thing about this hotel is that it does not have a gimic. most of the other hotels in las vegas all have one. there was alot of road works and building works going on around the hotel which made it confusing. the location is fine as you can get around the strip by using the monorail from the mgm across the road . the rooms were average, but clean and tidy. there seemed to be not much on offer for breakfast and long queues at the buffet and cafe when we looked. there was a sports bar which was open for dinner one night but closed another night which i found strange.the staff were helpful enough and the valet parking was very good.", "title": "an average hotel", "helpfulness": 1, "user": "moodycow", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20665968, "likes": {"liked": "— location", "disliked": "— building and road works"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Built in 1994, run like a Detroit Auto company in the 70's.", "title": "I'll bet it will be the newest hotel to be imploded.", "user": "pete_ryan_slo", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 20654606, "likes": {"liked": "— It wasn;t an expensive lesson.", "disliked": "— The pool was like a New York Subway, noise everywhere, the muzak was very annoying."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I can't think of a reason to return. What wasn't bad was mediocre. The only plus, when it was time to leave, valet had the car ready really fast.", "title": "Monte Carlo - thumbs up!!", "helpfulness": 2, "user": "MelissaPgh_Pa", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20642891, "likes": {"liked": "— Location, spacious room, low-key atmosphere", "disliked": "— liked it all!!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "The should have let it burn in January.", "title": "Noisy Monte Carlo", "user": "BeijingAussieinchina", "date": "October 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 20557263}, {"rating": 2.0, "title": "the monte carlo no longer the \"full monte\"", "text": "After much research and consideration, we booked the MC for our first trip to Las Vegas. I was moderately concerned about the construction I read about in many of the reviews. We decided to go ahead and stay at the MC due to the great deal and location. The Monte Carlo main lobby is beautiful, the casino is low key, the buffet was better than others we tried. We loved the food court for the convenience. Our king room was quite large and clean. The bathroom was also surprisingly large. Our room did face the massive construction zone, but on the 30th floor, we only heard minimal noise, in fact, we found it very interesting to watch the construction in progress of such a large scale project. After visiting the other \"upscale\" casinos on the Strip, we actually found the MC much more to our liking - nice, clean and low key. Every single employee we encountered was polite and helpful, answering our questions with a smile! We did not drive or rent a car, and due to the construction, I would not recommend it, as it appears it would be problematic at best. The only slightly negative things I would say are there is no exhaust fan in the bathroom, and the elevators are hot and stuffy. Otherwise, we would definitely recommend the MC, and we will probably book here again.", "user": "A TripAdvisor user", "date": "October 1, 2008", "id": 20541285}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The hotel is nice with large rooms and friendly people for hotel and casino staff. We paid exorbitant rates for the convention and expected top notch accomodations. Our tub filled up but I can only count on one hand the number of times a tub has not been clogged in a hotel.", "title": "Relaxed stay at the MC Vegas", "helpfulness": 1, "user": "MicheleSW", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 12499976, "likes": {"liked": "— Convenience and layout of hotel", "disliked": "— Access to tram and cost"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The casinos cater to an older crowd but it's less busy than other hotels. The hotel is convenient to most things but for the same price I'd probably pick MGM Grand. I didn't see the rooms there but you don't travel to stay in the room!", "title": "Surprisingly nice hotel...", "helpfulness": 6, "user": "zabb333", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12474933, "likes": {"liked": "— Very nice clean room, great Spa, tasty buffet", "disliked": "— Casino was one of worst on the strip, not as fun an atmosphere as other hotels"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "As my trip to the Monte Carlo this January neared, I was worried about the hotel due to all of the negative reviews on Trip Advisor. I decided not to cancel the booking, however, and I am pleased that I did not. The Monte Carlo has about 3000 rooms in it, and is located on the southern end of the strip. The location is basically unbeatable since it offers easy access to the five hotels south of it (Hooters, MGM Grand, Excalibur, Luxor, Mandalay Bay) and also great access to hotels just north of it.", "title": "Great stay at Monte Carlo", "helpfulness": 2, "user": "sailordude_sd", "date": "January 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12392324, "likes": {"liked": "— location, quality of amenities", "disliked": "— parking situation"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "After suffering through a 1.5 hour shuttle ride back from the airport by a new driver (I highly recommend you take a cab, not a shuttle), we arrived at the Monte Carlo. We were checked in around 2 PM, an hour before the promised check in time. They had about 10 lines open to check customers in and the wait was only around 15 minutes. We booked with the “CHILL” promotion (good until Feb. 1, use promotion code “CHILL”) which gave us 4 free buffets, 2 spa admissions (the gym + sauna/steam room/Jacuzzi) and some free slot play and drinks.", "title": "Like the hotel, but wouldn't stay in the Monte Carlo suite again", "helpfulness": 3, "user": "karoleigh", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 12391828, "likes": {"liked": "— proximity to strip and action", "disliked": "— the noisy room we had"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The room was very nice, and for the four of us it offered plenty of room. Contrary to the other reviews on the site, the room we stayed in was very clean. The bathroom is also pretty roomy and the water pressure in the shower is excellent. The maid didn’t give us quite enough pillows, towels, cups or shampoo, but after calling down to the front desk at midnight it was promptly brought up. The one main downside of the room was that the bathroom has no fan. So that you don’t stay in the room all day, the TV in the room has only basic cable. You get the Vegas propaganda channel along with about 20 other stations. There is no HBO or other premium stations in the room.", "title": "Good Hotel, Watch for construction noise!", "helpfulness": 3, "user": "WindsorTenor", "date": "January 6, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 12385130, "likes": {"liked": "— Location of the hotel", "disliked": "— Construction Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "I just came back from a 5 night stay at the monte carlo, and was very satisfied with our stay.", "title": "Recent stay at the monte carlo in vegas", "helpfulness": 1, "user": "daryn b", "date": "May 31, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 131028118}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The check in was quick and easy, however on the resort fee felt a little unneeded seeing as we never felt any of the benefits!!!", "title": "Decent room and nice lobby", "user": "JennyDiaz", "date": "May 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131026678}, {"rating": 4.0, "title": "Nice room, busy weekend", "text": "The rooms were clean, with 2 big comfy beds!!! However the wifi didn't seem to work!!!", "helpfulness": 1, "user": "JenniesHusband", "date": "May 31, 2012", "id": 130987545}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The location was very good, set back off the strip but not that far away.", "title": "GREAT LOCATION ON THE STRIP...", "helpfulness": 1, "user": "ym1986", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130985520}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The hotel isn't as big as some of the others, which in my opinion isn't a bad thing it just encourages people not to remain in the resort and explore!!!!", "title": "Great value at Monte Carlo", "helpfulness": 2, "user": "Spencer B", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 130978662}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "I was honestly quite disturbed that, after booking my stay at the Monte Carlo, there were so many negative reviews about it on this website. I couldn't change it and went in dreading the possible outcome. Luckily, I was very surprised with the service and the hotel as a whole.", "title": "Monte Carlo is Worth a Shot", "helpfulness": 7, "user": "lettertonoone", "date": "December 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12117736, "likes": {"liked": "— Location", "disliked": "— Expensive table games"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Upsides were friendly staff, quick check-in, nice room, comfortable bed, clean bathroom, efficient dealers in the poker room and on tables.", "title": "Great Hotel Excellent Deal", "helpfulness": 2, "user": "hello17", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12110674}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The downsides were few: Elevators were malfunctioning during check-out time which caused a decent delay, and because we were closing in on new year's, cheap people like me were nary to find a $5 table of just about any game. But there's plenty of other places to stay, and as far as a quality place to rest your head, this was good!", "title": "a few flaws", "helpfulness": 5, "user": "kmm2007", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 12060352, "likes": {"liked": "— Location", "disliked": "— Thin walls, the noise"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This is my second time staying at this hotel.", "title": "My Home town & I wouldn't stay at the Monte Carlo again", "helpfulness": 6, "user": "super996mum", "date": "December 29, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 4.0, "rooms": 1.0}, "id": 12058783}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The rooms are very clean, excellent service.", "title": "Great place to stay", "helpfulness": 1, "user": "SanDiegoBuckeye", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12042345, "likes": {"liked": "— Price", "disliked": "— Construction - not the hotel's fault"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Stayed 11/27-11/30 and that other reviewer was dead on. The sheets here are terrible. Hard and scratchy as if old and starched. They're even noisy! Enough about the sheets.... Our last stay was at NY/NY and that is much nicer for being in the same price range. Monte Carlo does not have as large a variety of food or entertainment. Other than Wednesdays, no live music here. The casino floor is large, bright, open and just generic. Not really much atmosphere or fun to hang around. The table games are all lumped together in the middle of the floor and also not too exciting. Had a great Blackjack dealer here, but also one of the worst I've ever played with. Totally slow, lethargic and unenthusiastic about being there. The \"Brew Pub\" discontinued brewing their own beer and doesn't even have a great selection of other beers. Although our room had a good view of the strip, the windows were so filthy, you could barely see through the dirt on the outside. The cleaning crew managed to be so loud outside our door they woke us up two mornings in a row. The building and guest rooms are starting to show a lot of wear and need to be cleaned/updated. Overall, I'd try something new, or for around the same $$ go back to NY/NY", "title": "Same here, Monte just OK", "helpfulness": 2, "user": "TomRoy", "date": "November 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 11173258}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Just came back from Vegas and I actually left early. The Monte Carlo should not even be open. Their was construction going on everywhere. For that matter, everywhere along the strip there was work going on. What made the problem worse was there was no place to park, that was if you could find the self parking lot. Inside the hotel it was just as bad. No matter what tower you stayed in, you were awaken (very early) by construction. To make matters worse, the rooms were small and nothing to impressive. I actually tried to leave and stay at the Orleans. They actually have a better buffet. I did check out a day early and couldn't wait to get out of Vegas. Here's two major tips: Wait a few YEARS before going out to Vegas. Also, if you really want to go, stay off the strip.", "title": "Don't go!!!", "helpfulness": 1, "user": "cardinal", "date": "November 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 11172817, "likes": {"liked": "— The reservation dept."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My fiancé and I stayed at the Monte Carlo the weekend after Thanksgiving from 11/24 - 11/27. I preface my review by saying we are both in are early 30's, are not picky people, and are pretty easy to please.", "title": "OK overall stay, sheets were terrible", "helpfulness": 5, "user": "srauhala", "date": "November 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 11162637, "likes": {"liked": "— location, view, price", "disliked": "— cleanliness, beds/sheets"}}, {"rating": 3.0, "title": "Was Just OK...", "text": "This was my fourth time to Vegas and I have stayed at the Excalibur, New York/New York, and the Flamingo in previous stays. When I go to Vegas I look for a cheap room with a good location on the Strip. We are not in our room much so we don't feel we need to spend a lot on a room.", "helpfulness": 1, "user": "Fortier2024", "date": "November 29, 2007", "id": 11153405}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I decided to go with the Monte Carlo for this trip since it was under $300 total for the stay and it was in a decent location. Since it met my basic criteria and it got decent reviews I decided to go with it.", "title": "OK, but wouldn't stay here again...", "helpfulness": 2, "user": "geminiangel528", "date": "November 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 11152633, "likes": {"liked": "— Location, friendly staff", "disliked": "— Cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We have not been to Vegas in a couple years. This was like a mini 2nd honeymoon for hubby and myself. Of course, I did my research in where to stay. My choices were: Planet Hollywood, Luxor, New York New York, and Monte Carlo. I finally chose Monte Carlo because of the price and location. I read some of the reviews and became worried because of the bad reviews it had received.", "title": "Very surprised. Loved it", "helpfulness": 2, "user": "lovely622", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 20161100, "likes": {"liked": "— location and price", "disliked": "— toilet was too loud"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Checkin was fast and easy. We probably waited for 5 minutes which isnt bad. The staff was friendly and helpful. We didnt use the pool but it looked like a pretty good size and I liked the lazy river. Probably next time we will use it especially with my 3 year old son. The casino was not bad at all. It was pretty quiet compared to PH and Paris which I did not mind at all. Cocktail waitresses were coming by every so often compared to PH where we waited for 30 minutes for one to come by. We were on the 6th floor and the view was the roof facing the strip. We had no problem with noise from the construction. My only complaint is with the toilet. Every time we flushed the toilet, it seemed like it was going to suck us up as well. It was very strong. The room was pretty clean. We didnt eat at the MC but we did order Starbucks. The food court had many choices such as subway, mcdonalds, rubios, chinese wok, starbucks, etc. Next time, I would certainly eat there.", "title": "Room Okay, Staff very unfriendly", "user": "LanaG", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 20154756, "likes": {"liked": "— Quietness of Hotel", "disliked": "— Friendliness"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The location of the hotel was great.. CVS is right outside the door. Walgreens is across the street. I think the hotel is in the middle of everything. Ceasars is 10-15 minute walk. Luxor is only 10 minutes away walking. PH and Paris and MGM Grand is a 5 minute walk. New York New York is close was well. LOved it that CVS and Walgreens was so close. We bought water, soda, snacks, and souvenirs from here which saved us some money.", "title": "Good value", "helpfulness": 1, "user": "tcapBraintree", "date": "September 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20144743, "likes": {"liked": "— cleanliness", "disliked": "— too quiet at night"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We would definetly stay here again. We were very happy with our stay.", "title": "Monte Carlo, Las Vegas", "helpfulness": 1, "user": "SCoombe", "date": "September 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20134159, "likes": {"liked": "— Good location - right on the strip.", "disliked": "— Major Building site right next door"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The check in was okay. Room was average, no perks. The windows are very dirty which makes taking pictures from your room awful and splotchy. The construction was all around us, but we were on the 24th floor so it didn't wake us up or anything. My major complaint was the unfriendliness of the staff and dealers. NO HUMOR WHATSOEVER. We did have two dealers at the Texas Hold em table that were nice... Dallas and Joe. Other than that, they had the humor of a box of rocks. We live in Houston and could not get a flight out due to Hurricane Ike. The Hotel was less than accomodating for a late check out, or a good rate for the extra nights. We will stay elsewhere next time.", "title": "Good hotel, some issues", "user": "operationbabygoal", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 1.0}, "id": 20125169, "likes": {"liked": "— cleanliness", "disliked": "— The cleanliness of our room- this was taken care of"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Monte Carlo looks great on the outside, but the rooms are pretty plain--especially for the Strip. The bathroom in the room was larger than expected, but everything else about the room wasn't very exciting. It wasn't bad, but nothing to get excited about.", "title": "Plain Hotel for the Strip, but good value", "helpfulness": 1, "user": "shaggyman", "date": "October 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 20541418}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The food court there was nice if you are looking for \"normal\" fast food and not wanting to spend a ton of money on expensive restaurants.", "title": "Bed 10, Hotel 1", "user": "minniemoomoo", "date": "October 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20538152}, {"rating": 5.0, "title": "Monte Carlo - One of my favorite casinos", "text": "The location is pretty good being on the south side of the strip near NY, NY, Excalibur and the rest.", "user": "Terri_1230", "date": "October 1, 2008", "id": 20530790}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "If you are looking for a no frills, decent hotel on the Strip, Monte Carlo might be it!", "title": "Great Stay!!!!", "helpfulness": 2, "user": "TikiTorcher", "date": "September 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20477800, "likes": {"liked": "— Pool Area, View, Customer Service", "disliked": "— No complaints!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "We always try to stay at a different hotel each time we go to Vegas. Why not? There's so many choices. This time we decided to stay at the Monte Carlo.It had been closed from the fire and now reopened, we got a great deal, so why not? We checked in and asked if there were any upgrades and were told they were booked. But in the same breath, he announced that he was giving us a good room with a view. We went up to the room only to find on the non smoking floor, a room saturated with cigarette smell. Housekeeping should have informed the front desk. Anyway, back downstairs to the front desk. Given another room. When we arrived at the door, the electronic key wouldn't work. Back down to the front desk. By this time, I was already unhappy. The desk reissued the keys and we finally entered our room,not a great view, but no cigarette smell. Tired, we decided to order room service. No room service menu. The front desk was adamant that a menu had to be in the room. There was none, finally a menu arrived. We had no numbers on the phone, just holes where the plate should have been, so we didn't even know what number to call for room service, we had to call the front desk and ask for the number to room service. The toilet lid wouldn't stay up for the hubby, therefore he had to stand to the side, hold up the lid. The door on the TV stand wouldn't stay open, so we had to prop it open with a towel. The tub took forever to drain, and their was mold growing in the shower. Mold in the desert, that's a new one to me. The restaurants in the hotel was another hot topic. It took forever to be waited on in the cafe. On one occasion, we actually waited 15 minutes for someone to take our order, we finally just got up to leave and the desk insisted we pay for our coffee and tea, even though we explained that we had waited 15 minutes for someone to take our order, and we were leaving upset. Unbelievablely, they still insisted on payment. When no ticket could be located for the drink order, they finally said, forget it. We already had! There is no signs for the high roller line. After standing in a line for 10 minutes waiting to be seated, we were told that we were in the wrong line, when I asked how was I to know that, she explained there was no sign, I should have asked. I said we had been there on 2 other occasions, and never given this information. She said, \"oh well\". Customer service is not their strong suit, matter of fact, it is no where to be found on this property. The bed was the only thing great in this hotel. We had been given a room that had newer bedding, and it was great. Thank goodness for a good night's sleep, otherwise, we wouldn't have made it. Monte Carlo is defintely off our list of do overs.", "title": "Monte Carlo Good Experience For Me", "helpfulness": 4, "user": "OccasionalVacationer", "date": "September 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20455221, "likes": {"liked": "— Service, Location, Competitive Price, Room, Pool Area", "disliked": "— Neighboring Construction consticting sidewalks"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Just got back from the monte carlo for 6 nights with 2 other couples and none of us have a bad thing to say about the facility, we were there from may 23rd-29th for the UFC. I have been reading all the reveiws prior to leaving and noticed there were some negative but mostly positve, so I was a tad nervous about staying here. We checked in wednesday the 23rd at 3pm and it was maybe a 5 min wait to check in, the front desk staff was nice and the whole process took less than 3 minites. the nice thing about the monte carlo I liked was that there was only 1 set of elevators and you don't need to walk through the casino or half way around the property like some other places. The rooms were spotless and I am a neat freak, smelt clean and the 2 other couples said the same thing about there rooms, the rooms are defenatly a not a 10 out of 10 though, we all thought the A/C was a joke I never looked into it but it was very weak and deffinatly didn't cool the room down, overall that was the only flaw I had with the room and the other 2 couples as well, water preasure and plumbing were all fine but the shower head is a little on the low side so if you are over 6ft you will have some issues. The casno was the best smelling casino we went in the whole trip, we were in alot and the monte carlo was hands down the best smelling, sure there are hundreds of people smoking but you only notice it if you are close to somebody smoking. We ate at diablos 2 times and the cafe 1 time, all the meals and drinks were very good and very resinable, the drink service in the casino was unbelivable, you are asked for a drink every 15 mins, they were very good at making sure your beverage was full. The pool area is nice with a good atmospere and tunes, there are alot of shaded areas in the pool so get a chair early if you want the sun or you will be against the wall at the beach vollyball court, that as well was a neat feature of the property. Im really not a breakfast person so having the food court downstairs was nice option for breakfast and a late night snack. Overall we were all glad we stayed here the value is second to none the service was awsome and most importantly for me is that it was clean and well looked after, it is not a place where you should be nervous to pull back the bed sheets, that's my main concern and they exceeded my expectations.", "title": "Fantastic place to stay eat and gamble", "helpfulness": 2, "user": "Ryan P", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130978476}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The Monte Carlo is a nice hotel for the value, though it doesn't live up to the legendary luxury of the European name for which it takes it name. That's okay though, because the rooms are big and comfortable and room rates are generally lower than at other nearby resorts. And you can't beat the location as the place is located right on The Strip, within easy walking distance to The Cosmopolitan, CityCenter, Bellagio, New York New York, and MGM Grand.", "title": "Worth it for the price and location", "user": "Seth G", "date": "May 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130962517}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I stayed 1 night at Monte Carlo to catch an early connecting flight back to LA in the morning. I got the room for $40 on Priceline- and then paid the $20 resort fee upon arrival. The check-in process took way too long- I stood in line for nearly 40 min waiting! I was there a bit earlier than the 3:00pm check-in time but the gentleman that helped me let me into my room early.", "title": "Nice but a little dated", "helpfulness": 1, "user": "allierskine", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130958593}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room was standard. There were no king beds available so I got a room with 2 queen beds. The furniture is old both in age and in style. Not really my style. The bed was surprisingly comfortable and the pillows were super squishy! I did not like the bathroom at all. I am a hotel snob and I judge rooms based on their bathrooms. The shower was old and the shower head was covered in hard water build-up. The shower head sprayed water in every direction and the tub was peeling.", "title": "LOVE Monte Carlo!", "helpfulness": 1, "user": "Tracy L", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130919459}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I went to the pool for a little bit and it was nice. I don't actually swim IN pools- I more lay beside them and the atmosphere was pleasant. There were a lot of employees around to get drinks or bring over more towels. I saw a lazy river pool, a wave pool, and a sandy volleyball court which all seemed pretty cool. Would like to visit this pool again with some friends and maybe even get in.", "title": "Amazing honeymoon", "user": "sylvia h", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130881159}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "With all the new fancy hotels in Vegas the Monte Carlo could use an update. The rooms are mediocre. We had a view of the pool, which was decent. The showerhead is way too low for the average person and the tub never drained. Ick. Although we weren't for work we thought the hotel had WIFI but instead you had to plug in. We could not get online b/c we brought our iPad. We had to go to the downstairs Starbucks to get wireless access. Apprently they're updating their wireless but I'm not sure when. As for location, the MC was great and the monorail up to the Bellagio was ideal. We had also reserved a King room connecting to another King room. Upon checkin we were placed in a room with two queens and no adjoining room. This was disappointing. They told us they didn't have adjoining rooms but they clearly did. We were moved the next morning to a King room on the same floor. With a little updating the hotel could be improved but all in all we enjoyed the trip and the friendly MC staff.", "title": "Decent but nothing crazy", "helpfulness": 1, "user": "Trifish", "date": "October 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119286023}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "We planned our first Vegas trip last minute and decided we would rather have an okay hotel and use most of our money for gambling and shows and whatnot. It's an okay place to stay on the strip. It's gorgeous on the outside but the inside is showing its age. The casino is great and had a good payout. Smells of old cigar/cigarette smoke. Take advantage of the tram between Monte Carlo and other hotels!", "title": "Decent hotel on the strip", "user": "sugarcrisis", "date": "October 14, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 119280538}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I stayed here last month for my first trip to Vegas, and had absolutely no problems with it. It's not the most grand of hotels, but it works!! The room was cheap-$59 USD a night, and it had a good casino and food court and such. The buffet seemed good too, lots of choices. The location is the best part, it's right in the middle of things and isn't a far cab ride to many of the touristy spots. It was great for our group but we really just needed a place to pass out in at the end of the day, so for anyone who is looking for a more upscale stay I would suggest somewhere else!", "title": "Good experience for my first time trip to vegas", "helpfulness": 1, "user": "dayla89", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119279964}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Went here for a bachelor party - best idea ever! Great location centrally located on the Vegas Strip. The rooms are clean and very inexpensive with expedia or other holiday booking websites. The best part of the hotel: Great outdoor swimming/drinking area! The \"lazy river\" where you can float, walk, or swim along as the current takes you around in a circular route so that you can drink and mingle with all the great people enjoying the sun. What a blast! Been to \"Treasure Island\" and \"New York, New York\" which didn't hold a candle to the Monte Carlo. Just be sure to have great friends along and you're guaranteed a great stay!", "title": "SWEEEEEET!", "helpfulness": 1, "user": "TripSkipper1", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119279147}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "My brother and I stayed here over a weekend in early October. Hotel is in a good location, but not right at one of the main strip corners (Tropicana or Flamingo Aves.) One thing I like is it is lively, but not overcrowded like some of the other Strip hotels get on weekends. A free tram is available to City Center and Bellagio. Pool area is nice, with a small lazy river, volleyball court, wave pool (which is closed for the season unfortunately) and a regular pool with a hot tub. Poker room is somewhat small (maybe 6 tables) but interesting looking with all the old-time poker paintings on the walls. Would recommend.", "title": "Good time at Monte Carlo.", "user": "mheid", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119277806}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "I have stayed at the Monte Carlo before that is what made me go back to the hotel. I had no idea about all the construction that is currently being done around the hotel. First issue they did not have a parking garage. You have to either Valet Park your car, use a tiny surface parking lot (if you can find a space), or park at the MGM Grand and get shuttled back to the Monte Carlo. Just this by itself was a major nightmare.", "title": "Construction Nightmare", "helpfulness": 2, "user": "nicemann", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 20453077, "likes": {"liked": "— Location", "disliked": "— Construction"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I stayed for a total of two nights. Both of the nights I could not get much sleep due to the sounds of the 24 hour construction going on behind the hotel. I had a \"pool view\" room and was told this was the loudest part of the hotel. Even though I was on the eighth floor I could still hear the metal pounding and trucks and sirens going off. I could not change my room because they were totally booked.", "title": "In the middle of a Construction Zone.", "helpfulness": 2, "user": "Spa8110", "date": "September 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20362175, "likes": {"liked": "— Nothing", "disliked": "— Small rooms far away from elevators, contruction noise."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Trying to get in and out of the casino was also a head ache. Roads were blocked off. Semis and dump trucks were always coming and going. I had to take different ways in and out of the entrances depending on the current events.", "title": "Shame about the pool area", "user": "britsbest", "date": "September 23, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 20299841, "likes": {"liked": "— Everything else", "disliked": "— Obviously the pool"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The staff was very nice. I like the location and the casino. I will be back but not till at least January of 2010 when the construction is complete. Till then I will stay at another hotel on the strip.", "title": "Seriously Disappointed", "user": "ericb67", "date": "September 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 20196414, "likes": {"liked": "— Everything else", "disliked": "— Everything else."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Nice hotel, but right now in the middle of a construction Zone. I mean High rise condo's are being built all around the pool area and the side zones. Your views are horrible, and if you like to swim, forget it. They are playing music so loud, I had to wear my noise reductions just to read a magazine. They have a lazy river, but still charge you $12.00 for an innertube. The pool was crowded, even on a Thursday. The rooms are small, and not unlike a Holiday Inn, No real luxury here, and if you are low in the building or not near an elevator, you either have a noisy night, a bad view, or litterly a hike to get to your room. The elevators are set up ok, but whoever designed the building, wasn't thinking about the customers. Not a lot of parking during construction, so valet is pretty much your only choice. The restaurants are overpriced, and the buffet ought to be shutdown. It was the worst meal I have ever had in Vegas. I'm not really sure what the theme of the hotel has to do with your overall experience, it sure didn't feel like we were staying in Monte Carlo, more like Grand Rapids, Michigan. The desk clerk was rude to one of our party at Checkout, so they comped us a lunch, which was overcooked.", "title": "Very Satisfied", "helpfulness": 1, "user": "muimui77", "date": "September 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 20187354, "likes": {"liked": "— good location on the strip. bus stop right in front of hotel.", "disliked": "— buffet restaurant, small pool, need renovation in rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "It was our first time staying at the Monte Carlo and we will definitely return. The staff was extremely polite and helpful and our room was beautiful. The hotel has great \"deals\" and they were most accomodating. Unfortunately for the hotel, a lot of construction going on around them, but to the hotels credit, they put us in a room not facing or where one could hear the noise. (all of Vegas seems to be under construction) We highly recommend this fine hotel.", "title": "Loved the Monte Carlo", "helpfulness": 2, "user": "hawaiitrader", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10965001, "likes": {"liked": "— The staff friendliness and decor.", "disliked": "— Construction around the hotel but that doesn't reflect on the hotel..It is what it is."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Great location on the strip I personally think this end feels safer due to it being well lit and having less drinking establishments close to the street.", "title": "Great pool, great location.", "helpfulness": 1, "user": "Vickyjo", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10950575, "likes": {"liked": "— Location", "disliked": "— Lack of shops"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Rooms are spacious and we had a great view of the strip though walls can be thin if you have an arguing couple next door as we did. They are well kept, clean and have everything you'ld expect including nice decor and big, comfy beds.", "title": "Is this the Monte Carlo?", "helpfulness": 1, "user": "ItsMissBrooks", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 10939257, "likes": {"liked": "— It is a beautiful hotel, in the center of everything, and the food was delicious.", "disliked": "— housekeeping and front desk staff was rude"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "With regard to bars and shops there is a lot less to offer at the Monte Carlo than many of the other hotels but what it lacks here it makes up for with the pool area. The pool area is fab! Can get crowded but you don't eactly go to Vegas for solitude.", "title": "No gimmics. Just great", "helpfulness": 3, "user": "navigator", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10895553, "likes": {"liked": "— The atmosphere", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "IMO this is a very well located hotel, for the safety aspect but also that is is close to stores and everything without being right in the middle. Just that bit better than the MGM location wise IMO.", "title": "Great Place to Stay...", "helpfulness": 2, "user": "Albertagal03", "date": "November 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10878856}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We were married in Las Vegas, and spent a couple of our nights at the Monte Carlo. We liked it for many reasons, one being that it is not a mega resort that a lot of people pass through to see different attractions (like the Bellagio or similar or Mirage). Although there were quite a few people, it wasn't overflowing and we didn't encounter many long lines for restaurants, etc. The hotel was clean and th staff was helpful, especially housekeeping. We stayed in a spa suite, which had a fairly large bathroom w/steam shower, hot tub, and wet bar. The room itself was quite large compared to other rooms I have stayed in.", "title": "Nice Stay at the Monte Carlo", "helpfulness": 4, "user": "KH54828", "date": "January 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 12381634}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I apologize for the clutter in the pictures.....it was right before the wedding and we were digging through our luggage to make sure we had everything for the wedding!!", "title": "What I expected for the price", "helpfulness": 1, "user": "almey1014", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 12364841}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "We went for a package (A & H)- so it was a great deal. That's why we chose it. Great location on the strip. I asked for a room away from the construction and we got it. The room was average, comforters were stained- gross. Our t.v. did not work properly and had to ask 2 days to get it fixed and it was never done. Spend the extra $ and stay somewhere else if you will be spending a lot of time in your room.", "title": "Wedding Chapel & stay at Monte Carlo - good & bad!", "helpfulness": 2, "user": "jdisney", "date": "January 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12303178, "likes": {"liked": "— Location, price, casino, wedding chapel incl service, staff service, food choices.", "disliked": "— Slightly tired rooms (but still clean & perfectly functional), construction work next door & around pool area"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This is a slightly belated review of our wedding & stay at Monte Carlo, Las Vegas - grab a cup of tea as it's going to be a long one!!", "title": "Very good, could be excellent", "helpfulness": 4, "user": "Pitias", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12276754, "likes": {"liked": "— location, price, room", "disliked": "— noise and cleaning issues"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had originally booked our wedding ceremony & stay at Monte Carlo for 2 weeks in total, back in June 2006, having previously stayed here for New Years Eve 2003/2004 and being impressed with everything to do with the hotel.", "title": "Satisfactory stay!", "helpfulness": 4, "user": "paqmkl", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12226283}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Our first time in Vegas. Really pleased with hotel. Clean, nice big room and great shower. Good location. Music is off at 12 midnight too so doesn't keep you up all night. Lobby is large and busy. Parking is free, no wi fi but they do offer Internet service via a keyboard in bedroom which didnt work? There was a plastic sheet in the bed too for all those who wet the bed! We didn't fortunately so ask for our room! We had a strip view, which overlooked part of the roof but could see plenty at night. That didn't make us wet the bed either... Used the buffet in restaurant, that was 24 $ each, food was very good but seating wasn't great. Casino was clean and didn't smell. I'd stay here again and will still be able to refrain from peeing the bed :-)", "title": "There are better but you pay much more!", "helpfulness": 2, "user": "emalou2", "date": "October 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119274475}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Had a three night stay last week in September. Room was adequate but could use some updating. Major problem was we had a room with a door to adjoining suite. You could hear any voices or noises through the door. It seems person was sitting on their bed, talking on the phone, and sounded like a loudspeaker through the door. Maybe thicker doors or some kind of sound deadening material needs to be placed between the doors. Overall, stay was enjoyable, check-in and out went smoothly, and food was good", "title": "Good but with one problem", "helpfulness": 1, "user": "MarylandKid_At_Heart", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119269666}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Really enjoyed our stay at he Monte Carlo. Very friendly and helpful staff, comfortable and spotless room and a variety of eating options. Very good location on the Strip and enjoyed the convenience of the mono rail from the Monte Carlo to the Bellagio. Would stay at the Monte Carlo again. Although the wave pool was not open certainly enjoyed the rest of the pool area. Pleasant and comfortable and nice river/lagoon.", "title": "Excellent service at the Monte Carlo", "helpfulness": 1, "user": "MarleneComox", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119268506}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is the 4th time we have stayed in this hotel. We have always found it serviceable, friendly staff and a great place to stay. Having just returned we won't stay again. The hotel definitely needs upgrading, there was blood on the door handles, light switches and mirrors. As the hotel was full we couldn't get a move. We cleaned the room ourselves as it was an easier option! Checking in and out was a farce, it seemed they tried to double charge for everything and when explaining to us that it was a genuine error and rarely happened, both couples either side of us burst out laughing as it was happening to them too! There must be better places to stay.", "title": "Needs some tlc", "helpfulness": 1, "user": "BassRockBoy", "date": "October 12, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119225737}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "A group of friends and I went to Vegas to celebrate our friend's birthday. From beginning to end of the trip was seamless. The check in was easy and efficient, the rooms were beautiful, the casino and restaurants were fantastic and I would recommend the Monte Carlo to anyone! Thanks for the great stay!", "title": "Amazing time!", "helpfulness": 2, "user": "misslissm", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119225478}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed at the Monte Carlo back in August. It was our second time at the hotel. Our first time wasn't that great and my wife wrote them a letter to express her disappointment. The hotel actually called us to apologize and offered to comp us to a suite the next time we were in Vegas, so we took them up on it.", "title": "Better the second time around", "helpfulness": 1, "user": "The_Mystic", "date": "January 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 12635750, "likes": {"liked": "— central location"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We like the restaurants and the casino because they never seemed to be too busy, and the hotel isn't that large that you get lost. If you're looking for a busy place or a lot of entertainment, go somewhere else.", "title": "Nice and Clean", "helpfulness": 2, "user": "sugerkat", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12624005, "likes": {"liked": "— comfy bed and nice shower. monte carlo bre pub.", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Not super-themed like some of the bigger places but we had a nicely appointed room on the 31st floor with a view of New York, New York.", "title": "Great hotel at a great value (usually!)", "helpfulness": 1, "user": "ACG580", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12616824}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "It was clean and the staff was nice. Decent location and we didn't have any trouble with noise as they are building another juggernaught right next door.", "title": "Monte Carlo-Low End Hotel", "helpfulness": 3, "user": "Cruiselvr36", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 12560247, "likes": {"liked": "— Friendly Casino Staff", "disliked": "— Lack of great restaurants, internet access spotty"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The price was perfect. After all, when you are in Vegas, you really don't spend too much time in the room.", "title": "OK Rooms, Great Prices", "helpfulness": 3, "user": "bkimberly", "date": "January 11, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 12514876, "likes": {"liked": "— Cheap price, comfortable bed", "disliked": "— Slow check-in, smoky casino"}}, {"rating": 4.0, "title": "Best rates and very clean", "text": "We've been to Vegas several times, business and pleasure, and for the amount that we stay in our room...it is the best. Very clean and nicely decorated. Actually saw Mike Tyson and \"girls\" in elevator. Casino employees are not snooty and atmosphere very comfortable, no matter what you are wearing or the amount of money you are gambling. We stayed in the Deluxe and the Suite, and besides a couch and extra bathroom, quality the same in both. Not really a place for kids, pool is nice, however nothing else for them to do...I would suggest New York NY with game room, or Circus Circus with huge amuzement park inside. Have fun and be safe.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 10, 2005", "id": 2993371}, {"rating": 5.0, "title": "Nice property and staff", "text": "We have stayed in Vegas 3 times, always before in a time share my parents bought. This time we wanted something nicer. There were lots of bargains for the time we were going to be there, but none as nice for the price we got ($49/nite). I had read many reviews, some glowing and others negative. My sister stayed there in October and was pleased so we booked our room (over the internet).", "helpfulness": 14, "user": "Winecountryguy", "date": "January 9, 2005", "id": 2992043}, {"rating": 5.0, "title": "Great Time at the Monte Carlo", "text": "First, let me say that everyone we had contact with was wonderful. The valet that parked our car was very considerate to my wife. She had left a bag in the car after it was parked and he went with her to retrieve it. Check in was a little slow, not bad, but the clerk was very helpful in getting us an upper floor (29th) with the view we wanted. The bell hops were \"Johnnie on the spot\" delivering our luggage.", "helpfulness": 26, "user": "Venderhack", "date": "January 5, 2005", "id": 2977778}, {"rating": 3.0, "title": "'Depends'", "text": "As to the room itself, I was very impressed. Nice carpets, attractive furniture, quiet adjustable heat, spacious bathroom and comfortable beds. I think the shower has plenty of power. As to noise, we had no problems at all. Maybe if someone is shouting, you might hear, but otherwise nothing to complain about.", "helpfulness": 3, "user": "KayteeHertfordshire", "date": "January 3, 2005", "id": 2972871}, {"rating": 5.0, "title": "Great Location!", "text": "The hotel itself was layed out nicely so you can bypass the casino to get to the pool area and some restuarants. I didn't get a chance to use the pool as there was a bad storm and cold weather the days we were there (Jan 2-5).", "helpfulness": 11, "user": "MeercatMD", "date": "December 29, 2004", "id": 2961223}, {"rating": 4.0, "title": "Very Nice", "text": "My wife and I spent Thanksgiving at the Monte Carlo. The room was very nice, and we were pleasantly surprised by how friendly and helpful the staff was. The casino itself was spacious and well-lit, never overcrowded; we also enjoyed the wide variety of restaurants in the hotel. We rented a car to get out of town and access to the highway was very easy. And, granted, you are at the bottom of the strip, but most other hotels are walkable. On the downside, the self-park is far too small (but, again, the valet staff was great) and if you are looking for an active poker room in the daytime, be prepared to go somewhere else.", "helpfulness": 6, "user": "Raise", "date": "November 27, 2007", "id": 11103041}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I stayed at the Monte Carlo from 11/18 thru the 23rd. My experience was great. Having read prior reviews I requested a quiet room and was accommodated. Was given a 13th floor room with a view of NY NY.", "title": "Loved this Hotel!", "helpfulness": 3, "user": "PeachfromGA", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11057717, "likes": {"liked": "— Price and cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I was concerned about staying at such a large place; usually use B&Bs or small family owned and operated hotels. Well, my fears were for naught. The staff was great, very pleasant and helpful; always ready with a smile. The room was spotless. Between the time I left my room and then returned after breakfast, the room was done up; very quick and efficient. They always left lots of towels and new toiletries (loved the hand cream).", "title": "Noise problems, otherwise okay", "helpfulness": 1, "user": "sjmbm330", "date": "November 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 11025555, "likes": {"liked": "— Clean", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "If I have to give it negative, I'd say that the tub/shower drained slowly. But heck, for and average of $59 per night, with two free buffets, and two for ones at the pub, in a central location, I am not complaining. Will stay there again if the opportunities arises.", "title": "Cheap, clean rooms, but nothing fancy", "helpfulness": 1, "user": "bntzmimi", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 1.0}, "id": 11021318, "likes": {"liked": "— clean, modern rooms", "disliked": "— lackluster"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The location of the hotel was great for the activity we had planned, but we hadn't planned on construction of the City Center right outside our window. So the view - what you could see through the dust covered window was \"different\" and the noise started very early in the morning. The early trash removal started about 6AM. Pairing that with the thin wall and the noisy next door neighbors, we didn't get much sleep. Definitely bring some ear plugs or ask to be placed on the opposite side of the building.", "title": "Monte Carlo Great location on the Strip", "helpfulness": 2, "user": "sandyohio", "date": "November 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 11003498, "likes": {"liked": "— Location and clean the Spa was nicr too!", "disliked": "— Noisy plumbing and thin walls between rooms"}}, {"rating": 5.0, "title": "A great place to stay on the strip", "text": "Stayed here from 12/12/2004 to 12/13/2004. Very impressed! Excellent value for the money. Great location. Room was very clean and well layed out. Bathroom was clean and well stocked. Great food selection and nice on-site brewery. Staff was friendly and helpful.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 13, 2004", "id": 2877457}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Hard to believe that this place was the same price as Luxor (rude staff... See my 8/2004 Luxor review) and Excalibur (which is not as nice).", "title": "Excellent", "helpfulness": 4, "user": "SubaruDriver", "date": "December 8, 2004", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2871922}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "Stayed here in October and had booked a Spa Suite, but were upgraded to a Diamond Suite which was absolutely fabulous. Have stayed here before in March and found that the rooms had been updated since we last travelled here to a great standard.", "title": "Excellent hotel", "helpfulness": 5, "user": "miranda", "date": "December 8, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 2871637}, {"rating": 3.0, "title": "inpersonal factory", "text": "The bathroom is superb. Two people can lay flat side by side in the spa, and the views gave us a look down the strip and let us watch the Bellagio Fountains do their thing every 15 minutes.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 6, 2004", "id": 2865232}, {"rating": 4.0, "title": "Loved the pool", "text": "House keeping was acceptable, and the location of the hotel is fantastic - next to New York New York and opposite MGM Grand with Alladin and Bellagio a short walk away. I found the casino to be a lot more airy compared to others on the strip and a lot less smoky. The hostesses are very quick at getting drinks and deserve their tip!", "helpfulness": 11, "user": "Laurence Zing", "date": "December 4, 2004", "id": 2863251}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Just returned from a three night stay at the Monte Carlo. I have stayed at most of the big hotels on the strip and I think the MC offers the best value for your dollar. The room was nowhere near as nice as Bellagio, Mandalay or Venetian, but it was clean and the maid service was good. We had no problems with noise.", "title": "Great Value", "helpfulness": 10, "user": "vtgambler", "date": "January 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3017792}, {"rating": 5.0, "title": "Very Nice!", "text": "The location of the MC is good. It's a short walk (by Vegas standards) to Bellagio, NYNY, Aladdin and MGM. The layout of the gaming area is pretty much a big rectangle which makes it easier to navigate then many of the others. No problem finding low limit blackjack and craps. They also have a small poker room and an average sportsbook.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 19, 2005", "id": 3016809}, {"rating": 4.0, "title": "A great time had!", "text": "The buffett was average. You can probably do better for your money elsewhere. The Italian restaurant was good and I've eaten at the steakhouse (Blackstone's) in the past and thought it was excellent. Having a food court in the hotel also offers some quick, convenient options.", "helpfulness": 13, "user": "WickedWahine", "date": "January 19, 2005", "id": 3016643}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "Feel free to email me if you have any questions!", "title": "Had a great time", "helpfulness": 18, "user": "Hotdawg", "date": "January 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3003635}, {"rating": 5.0, "title": "Loved the Monte Carlo", "text": "Also, FYI - the monorail was open and we used it once. Our conclusion was that unless you are going all the way out to the LVCC or the Sahara it is waste of time and money. You have to walk all the way through the MGM to get on and then back through another casino to get off and it cost $3 one way.", "helpfulness": 8, "user": "Chi-native", "date": "January 11, 2005", "id": 3000981}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 617, "average": 1554, "very good": 3191, "terrible": 318, "excellent": 2038}, "aka": "Monte Carlo Resort And Casino", "slim_ranking": 0.248148148148, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}