{"user_rating": 4.5, "review_count": 344, "name": "Montage Beverly Hills", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Reservation- ask room close to elevator and high floor, result is 4th floor and far from as possible from elevator", "title": "Bad service", "user": "Oleg1969", "date": "October 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 119774143}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Reception- no uniform, no pen to sign form.", "title": "£10 Bar: The Macallan Moxie at Montage Beverly Hills", "helpfulness": 1, "user": "PassportClub", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 119679552}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Forget flowers in car, ask them bring to room, no result after 1 hour. Let see what else...", "title": "Montage Beverly Hills - What a view", "helpfulness": 2, "user": "TuckerSue", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119386233}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The entrance of the £10 Bar is atop a winding staircase, in the Montage Beverly Hills, where the mezzanine offers a stellar view of Scarpetta's Restaurant below. The £10 Bar is one of the few Macallan Bars in the world, and the only one located in the United States. Seductively hidden away within the Montage Hotel in Beverly Hills, the £10 Bar is a swanky Reservation-Only lounge. Warm colors & lighting envelop guests with an inviting manner.", "title": "Great luxury hotel with kids", "user": "Luxwithkids", "date": "October 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119314530}, {"rating": 1.0, "stay_parameters": "Stayed October 2011", "text": "£10 Bar is dedicated to the Scotches of The Macallan & provides bar service that is almost unparalleled. Cocktails are hand-crafted with a particular table-side service. Perfect spheres of ice, made from imported Macallan Highland water, chill Scotch served in Lalique crystal. Or try a single large ice cube. Either form of ice compliments The Macallan perfectly, as it is sourced from the same Highland water from which the Scotch is created. The menu boasts a vast selection of fine Scotches produced by The Macallan, including rare options for the discerning palette.", "title": "Way over rated", "helpfulness": 3, "user": "travelenroger", "date": "October 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 119238077}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The Montage Beverly Hills is one of the best hotels in the world. The service is superb, location is the most ideal, the decor is so tasteful and the rooms are so luxurious and comfortable.", "title": "One of the Best Hotels In the World", "user": "jgm8888", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121399882}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I have stayed in various hotels all over the world, and the Montage Beverly Hills is truly world class. It is comparable to the grand hotels of Europe, and this hotel is the one grand hotel of Beverly Hills.", "title": "THanksgiving Weekend", "user": "Cocopops12", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121211533}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My wife and I just returned home from our best Thanksgiving weekend ever.", "title": "Best Experience in a Hotel", "user": "Bill R", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121142201}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We stayed at the new Montage Hotel in Beverly Hills, and it was fantastic!", "title": "Beautiful hotel in the heart of Beverly Hills", "helpfulness": 1, "user": "kak531", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120938186}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Our Thanksgiving day feast in their Grand Ballroom was absolutely out of this world. Food, service and decor were all five star.", "title": "Not the history of its neighbors, but a great modern hotel at a great location.", "user": "skiwestus", "date": "November 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120013116}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "As an anniversary treat I was surprised and indulged at this elegant hotel. We were in a suite designed to give each guest both a luxurious and comfortable experience. Every detail was designed in the best taste, and I mean every detail, from the mattress, down to the bathroom mirrors; I am sure that very few locations think this through. The space, the colors, the materials, the views all made returning home complicated. That is to say, it was hard to leave and at the same time we went home with some ideas for home improvement. Kudos to the designer, and to each of the staff, who struck exactly the right tone in each of our interactions. The Montage makes we glad that we will be celebrating more anniversaries.", "title": "Elegant, Sophisticated Pleasure", "user": "newyorkscreen", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123858973}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The location is excellent right in the middle of a shopping addicts dream. The concierge was very helpful. The service was 5 star as was the gym. The rooms and bathrooms are lovely as was the pool area. I had two problems that just didn't sit well with me. We had a breakfast credit for each morning for about 60.00. On Saturday we had an expensive breakfast but just what you would expect at this caliber of hotel. Sunday we went down and we were told there was a buffet. Luckily I asked the price and it was 70.00 (I get it but I don't want to eat and drink like that at 10 am, so give me a choice) and the other dining room was closed hence the breakfast credit was a wasted. I asked if we could use this credit for lunch and they agreed after a bit of prodding (at 500/night, I should not have to beg) and at checkout this was a problem, though resolved. There is a car service the hotel provides (5 star)but they were about 30 minutes late to pick us up (not 5 star).", "title": "Very lovely but not quite 5 star", "user": "donnafil", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123763358}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I have stayed at all the 5 star hotels in Beverly Hills and found the Montage to be equal to but not better the other hotels in its class.", "title": "Good hotel with some serious shortcomings", "helpfulness": 4, "user": "Taniquan", "date": "January 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123617145}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The primary feature of this hotel which separates it from most of the other five star hotels is its location. It is right in the center of everything. You walk out of the hotel and all the shopping and restaurants are staring you in the face. The same is true about the Beverly Wiltshire but not the other 5 star hotels which are set off in residential areas a mile or more away.", "title": "Exceptional.", "user": "Joseph D", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123177124}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My room was up to 5 star quality but its location was less than optimal. It was on the inside of “L” shape of the hotel building so immediately adjacent to the windows were the windows of the next room facing 90 degrees into my windows. As a result the two rooms had a clear view into each other. I had to keep my blackout window shades drawn to assure my privacy both day and night. Both the Four Seasons and L’Hermatige are flat buildings so you never encounter this problem.", "title": "Oasis in LA", "user": "NC R", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122994099}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We have traveled to Los Angeles on both business and pleasure for 14 years. We used to stay at the Hotel Bel Air until it closed for two years for renovations. At that time we switched to The Montage and have never looked back althought he Hotel Bel Air recently reopened. The service is impeccable, the staff are amazing, the restaurant and pool area is wonderful and the rooms are immaculate and very large. It is well located in Bev Hills and all shopping (worth doing) is within walking distance as are some of the best restaurants and cupcake shops!", "title": "Such a Gem!!", "helpfulness": 2, "user": "JBHAtlanta", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122982128}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The Spa and Workout facilities are large and very well appointed. Even the shop in the spa has some surprisingly nice things!", "title": "People come in your room with red light on! Beware.", "user": "A A", "date": "January 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 122749539}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A Must in Bev Hills!", "title": "Outstanding New Year's get-away", "helpfulness": 1, "user": "steve l", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122487588}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Maids come in with red light on! Connecting Door to other room where there was no guest staying was open half way open when we woke up, just enough for a person to sneak through to come in between 2am and 7am. Guess they didn't want to shut the door because it would wake us up. creepy! Reported it to security of course never heard back. Had allergic reaction to sheets and they started to wash it in a different soap but then gave me the hives back by bringing the wrong sheets up again right after it cleared up. Caught them 4 other times bringing the wrong sheets how many times do you have to remind maid service on the phone (oh wait they know because you are calling from your room ) then check again when they actually bring up the sheets an hour later). Had mornings where the electric was off with no notice. Told several mangers about all issues there were more but don't feel like going on and on. i didn't like their attitude they seemed to just want to sweep it under the rug. Make sure you check your bill, Front desk daytime charges random stuff to your room that is some other guests.Rooms Very dusty! Carpet pretty gross.Front desk daytime asks personal questions that seems odd for someone you don not know to constantly pump you for information on your private life and then gossip about to to other front desk daytime random work people. If front desk daytime has issues with people having money and it obviously annoys you the don't work in Beverly Hills!!", "title": "Great Location. Excellent Service. Great Suite.", "user": "SCTO42", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122096459}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "My wife and I decided to ring in the New Year by sneaking off to the Montage and joining them for their spectacular party in the ballroom. It was a WONDERFUL decision.", "title": "Best getaway in the USA", "user": "LeslieBaumann", "date": "December 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122086867}], "location": {"country": "United States", "city": "Beverly Hills"}, "stars": 5, "variance": {"poor": 3, "average": 13, "very good": 47, "terrible": 10, "excellent": 271}, "aka": "Montage Beverly Hills Hotel", "slim_ranking": 0.285714285714, "description": "Steps from Rodeo Drive, the luxurious Montage Beverly Hills features 201 guestrooms, inclusive of 55 suites; two restaurants, including renowned chef Scott Conant’s Scarpetta; the 20,000-square-foot, two-story Spa Montage; and a rooftop pool with breathtaking views of the Hollywood Hills."}