{"user_rating": 3.5, "review_count": 77, "name": "Monteverde Country Lodge", "reviews": [{"rating": 2.0, "title": "Accommodating staff, limited \"rustic\" comfort", "text": "This hotel complex out of Santa Elena and close to the Cloud Forest is expanding its series of \"wings\". The rooms are basic and too crowded for the double beds but the staff will bring the missing chairs. You can squeeze them in or use them on the small balconies. The beds are good, getting hot water (or too hot/too cold/limited pressure) is a challenge. The floors are less than clean -- we tracked dirt from the shower to the bath mat on bare feet. Breakfasts are the usual Costa Rica country fare and the rest of the restaurant menu is limited but we heard good comments about the food. A great bet is across the road at Delucia, a fine dining restaurant with excellent food and good service.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 14, 2012", "id": 124578311}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The rooms were clean with two queen-size beds, which were a little too firm for us. We were very aware of those above us walking around their room. Size wise, the room was adequate with only the two beds, 2 nightstands with lamps, and combination TV stand, shelves and half-length closet. There was not a chair, microwave or refrigerator, alarm clock, face cloths or hair dryer but there was a safe. I noticed some of the upstairs rooms had a chair out on the balcony. There was also, no heat or air conditioning but with the wind blowing constantly, we didn’t need either. The large walk-in shower was a little iffy in regards to hot water and in some cases; little or no water at all.", "title": "Monteverde Country Lodge", "user": "GreenMtTraveler", "date": "February 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 124357117}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I saw a few determined souls walking to and from the nearest town of Santa Elena. Going down didn’t look too bad unless you were having problems with your knees but the climb back was steep. I would think most would need a rental car or taxi.", "title": "Bait and Switch - Good but Not Good", "user": "Vincent R", "date": "February 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 124220642}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I only ate at the restaurant’s breakfast buffet twice. Each time the menu was basically the same: fresh fruit, dry cereal, sausage (more like a polish sausage), scrambled eggs and the mandatory rice & beans. One day they had pre-made toast and the second, pancakes. The coffee was hot and served with hot milk.", "title": "Lovely hotel out of town in a quite location", "user": "damselflyspotter", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123745376}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Well we were sent here on a bait and switch by Cala Lodge. They made up some baloney about having building problems and sending us to their sister lodge. Anyways we ended up staying here cause we didn't really have any choice.", "title": "Nice budget lodge, but not for couples", "helpfulness": 2, "user": "MarkVitelli", "date": "July 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 4.0, "service": 4.0}, "id": 115617474}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I've been taking travel groups to Costa Rica for 7 years, and this hotel is by far the nicest I've found in Monteverde. The location is convenient for all of the activities in the area, the rooms are clean and newly remodeled, the staff is friendly, and the food in the restaurant is great! If I had to list a drawback, it might be that there's no air conditioning. But since Monteverde is in the mountains, it isn't really an issue. I've stayed at many, many hotels throughout Costa Rica over the years, and I've seen the range of quality available, and for those who understand value, this hotel is perfect!", "title": "Great place to stay in Monteverde", "user": "RIS_Travel", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132192374}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We stayed at Monteverde Country Lodge with couple friends and had an amazing experience. It is a very affordable place with great, clean rooms, comfortable beds, very good service and yummy breakfast. Its conveniently located near three restaurants but at the same time, nature is just steps away. Highly recommend this place to anyone looking to stay in Santa Elena. I would definitely come back again.", "title": "Great stay!", "user": "Lena T", "date": "June 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132017657}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "The hotel is perfect until the local fair starts. They talk about how tranquil their property is. I didn't get that. I asked them when the music would let up and they said it usually stops at around 2 am. I wish they would have mentioned that. I would have chosen another hotel.", "title": "Make sure there isn't a fair in town", "user": "Smartiann", "date": "May 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 129433461}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Agree with all the previous posts. Suggest that one ask for the second floor of wing that runs parallel to Lucia's restaurant. Hot water was good, rooms had high ceilings, beds comfortable. This is a damp part of the world, so second floor rooms are best for folks with arthritis. Area is inconvenient for most things, except for three excellent restaurants - Olivio, Sofia's, and Lucia's. Breakfast was as mentioned by others, except juice was the fake stuff.... when all over CR there is fresh juice of all kinds.....", "title": "Adequate and comfortable with decent service", "helpfulness": 1, "user": "joelmari", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124936859}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I was a little uncertain when booking this hotel based on recent reviews I had read. The staff was very friendly upon our arrival and the room was incredibly neat and clean. The staff booked two great tours for us when we checked in and recommended one of them, which far exceeded our expectations. For the price, cleanliness and quality, well worth the stay.", "title": "Clean rooms, helpful staff, but a little hard to find.", "user": "CycloneGirl00", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 124925341}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "As our third hotel on a package tour (EF) this hotel was very nice. The rooms without A/C were very comfortable as the high-up windows could be left open. Lighting was pretty dim but I find that a problem in US hotels as well.", "title": "Comfy and relaxing", "user": "CSturgeo", "date": "July 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133442769}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The setting is very nice and the surroundings provide some pleasant walks. Our group would gather in the evening in a very nice common room and the set meals were very good.", "title": "My favorite hotel in Costa Rica", "user": "Schoolsout12", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132744394}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed in 3 hotels, in 3 different areas of Costa Rica, and this was my favorite. The website doesn't do it justice. Excellent accommodations, very clean and comfortable. The grounds were well maintained and spread out. The food was delicious and plentiful. The staff was very friendly, helpful, and kind to our large group of 60 people. There wasn't a pool, but I didn't think we needed one. There was plenty of room for kids to get their energy out. You can walk to town, or get a taxi. They staff did our laundry for a small fee. I would definitely come back.", "title": "nice place", "user": "MizzouLizard", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132488277}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Most of the rooms are fairly new, and the landscaping is really nice. We had a good bathroom, and it was best shower we had in Costa Rica. The restaurant was nice with good food and even some musicians. On the negative side, they have a serious bug issue in the rooms, and the bed spread looked old. There was no pool or A/C, but it may be too cool much of the year for either one.", "title": "Wonderful experience!", "user": "Sandy L", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132197084}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Excellent accommodations! We stayed in one of the rooms on the second floor away from the restaurant, and found it to be spacious, clean, and comfortable. Absolutely enjoyed sitting out on the spacious verandah in the early morning, and absorbing the peace and tranquility.", "title": "Amazing!", "user": "Tamar G", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132195370}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3, "variance": {"poor": 9, "average": 19, "very good": 31, "terrible": 3, "excellent": 15}, "aka": "Monteverde Country Lodge Costa Rica - Santa Elena", "slim_ranking": 0.782608695652, "description": "Monteverde Country LodgeMonteverde Country Lodge is Hotel & Spa Poco a Poco´s fully renovated sister property. It compresses the philosophy, experience and desire to create a new lodging option where tradition and personalized service are the most appealing features. Monteverde Country Lodge offers the comforts of modern establishments with the rusticity, warmth and tradition of the Monteverde from 1980´s. Starting Jan 1st, 2014; Monteverde Country Lodge will offer two different room categories, based upon amenities, area and construction materials. 36 wooden, warm and comfortable Classic or Standard rooms. Guarded by front corridors on both, lower and higher levels, with gardens and neat open areas. Room’s amenities are: Cable tv, telephone, safe, and private bathroom with hot water shower. Classic rooms offer: 1 or 2 double beds, 1 single and 1 double bed and 2 double beds and 1 single. Maximum occupancy: 5 people.24 Superior rooms. Newer and more modern, with more space; more comfortable bathrooms, corridors, balconies and great views of sunsets and surroundings. Cable tv, telephone, safe, wireless internet access, hair dryer and coffee maker available. Superior rooms offer: 1 king size bed, 2 queen size beds or 2 queen beds and 1 single. Maximum occupancy: 5 people.All hotel rooms are surrounded by patios, fountains and gardens which provide the ideal location for relaxation and enjoyment. Wireless internet access, laptops and a fully equipped meeting room are also available for guests and visitors. Children will enjoy a great time at the playground and open areas. Construction materials, techniques; and regular operation procedures are compatible with the environmentally friendly practices of our times, as well as accessibility, security and new standards of comfort, quality and service. Monteverde Country Lodge was granted by the Costa Rican Tourism Board with 3 levels on the Sustainable Tourism Certification. Ecological Blue Flag and Green Flag Accreditations have been awarded to Monteverde Country Lodge by two consecutive periods. Our well trained personnel cater for the satisfaction of our guests at all times. Clients interact with dedicated, informative, capable hotel representatives willing to assist and provide the best service possible. Whether at Front Desk; at the restaurant, where quality, homemade style and fresh ingredients are combined or at the bar, with a friendly, familiar atmosphere where our guests can enjoy our warm hospitality and amenities.Music: For over a year now, Monteverde Country Lodge has embraced music as a new, fulfilling way to reach to guests and provide them with special experiences. Live music at Front Desk, during meals at restaurant, recitals on the gardens, serenades and more is available for the guest’s enjoyment. Monteverde Country Lodge: a great lodging option in Monteverde!!!"}