{"user_rating": 4.5, "review_count": 8405, "name": "Moon Palace Golf & Spa Resort", "reviews": [{"rating": 5.0, "title": "Some clarifications-", "text": "The Moon Palace is a wonderful resort...don't let the negative reviews fool you-", "user": "cancundude", "date": "June 8, 2004", "id": 2172279}, {"rating": 5.0, "title": "Great wedding trip!", "text": "First of all, you can't even stay at the Moon without going all inclusive. So some recent reviews stating the contrary obviously drank too much and don't have any idea where they actually stayed. That might explain why they didn't enjoy it (since they didn't even stay at the Moon!).", "helpfulness": 3, "user": "workingforgrub", "date": "June 8, 2004", "id": 2170937}, {"rating": 5.0, "title": "14 great nights", "text": "Also, as far as europeans being treated differently than US travelers, I've never seen any of that. Sure, the different colored arm bands mean different things- but getting the included spa packages and tours has nothing to do with what country you're from, it has to do with who you booked with.", "user": "A TripAdvisor user", "date": "June 8, 2004", "id": 2170779}, {"rating": 5.0, "title": "the moon palace is paradise", "text": "Timeshare members (such as myself) are able to book packages with these items included. You want room service? You need to book a Presidential suite...access to these exclusive suites was the sole reason I purchased my membership. The Presidentials are simply stunning.", "user": "miacat", "date": "June 8, 2004", "id": 2170754}, {"rating": 2.0, "title": "Nothing special", "text": "As far as the Moon Palace, the only negative I can give it is the color of the water at the beach. If you're hoping for that beautiful water, you won't find it here. The beach itself, however, is great, very expansive, plenty of space. Another plus is that you don't have the plague of \"beach vendors\" hassling you while you relax- they can't get on the property. Something you can't say about the beaches in the hotel zone.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 5, 2004", "id": 2155055}, {"rating": 2.0, "title": "Moon Palace - Oh Dear...Be Warned.......", "text": "I just returned from the Moon Palace on 2/6/2004 and was not impressed. This was my 4th visit to Cancun but my 1st and last visit to a Palace Resort. In fact - this place has put me off ever returning to Cancun again. Here is my summary:", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 3, 2004", "id": 2150390}, {"rating": 5.0, "title": "Second trip to Moon even better than the first!", "text": "1) Be warned - none of the brochures or adverts tell you that the moon palace actually consists of 2 hotels. When you get there - they say its just got 2 lobbys...... this is not true - its 2 hotels on the same huge site. The Nizuc and the Sunrise. Although both cost the same the Nizuc is a 3* standard and Sunrise is 5*. So if you do book - make sure you get a confirmation its on the sunrise side. What the brochure doesn't say is that although you can use the facilities in both hotels - the sunrise is far superior. For example - you get plastic cups in the noisy lobby bar in Nizuc, and only local drinks. In Sunrise you get proper glasses, and real booze with proper labels and the bar is not like a zoo. Nizuc rooms are old and shabby and smell of damp. The balcony is virtually non existant in Nuzuc rooms - not worth using . In sunrise you get a proper balcony.", "helpfulness": 1, "user": "dreammy", "date": "June 3, 2004", "id": 2148815}, {"rating": 5.0, "title": "I only wish we could of stayed longer ... We loved it", "text": "2) Salesman!! Another warning are the pushy salesman in all Palace Resorts. Basically they try their best to sell you their version of a timeshare that apparently doesn't cost you anything in the long run. Don't waste your time. It may be worth it for a Yank getting cheap flights and returning there 20 times in 1 year, but for a Brit... don't be fooled.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 2, 2004", "id": 2144392}, {"rating": 4.0, "title": "different world", "text": "3) Cleaning of rooms was sub standard. Again I'm only commenting on the Nizuc side, but our room was never cleaned until 4pm. Thats when I normally return to my room for a nap before dinner... so it was annoying to wait for the room to be cleaned. The towels although in funny animal shapes were rough and never looked entirely clean. There was no nightly turn down servcie which you would expect at those prices and in any 5* hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 1, 2004", "id": 2143311}, {"rating": 5.0, "title": "Absolutely Awesome !!", "text": "4) No room service... have you heard of a 5* hotel with no room service?.... its not something I use much on holiday - but at those prices its something I expect.", "user": "A TripAdvisor user", "date": "June 1, 2004", "id": 2142527}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed at the Moon Palace Grand for a week in June and I am gutted to be back. I’ve been to all-inclusive hotels in Spain and Egypt, albeit much cheaper, and have always found them to be slightly more stress then they’re worth because of only being able to go to particular bars at certain times for drinks and only having local spirits etc. etc. This hotel was so different and an absolute dream.", "title": "Fantastic", "helpfulness": 4, "user": "kathrynjc", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165311217}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We booked this hotel as part of a group as some friends were getting married here and I’m not going to lie, it’s a bit pricey compared to other places in Cancun. However, from start to finish our experience was excellent. The hotel is beautiful, the grounds are kept well and are clean, and there were no shortage of pools or loungers – an absolute requirement for me. The joy alone of being able to find comfortable loungers in a good spot any time of day made the holiday.", "title": "Love The Moon Palace", "helpfulness": 2, "user": "shooters1", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165291362}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Our room was huge and came with a hot tub. This was a bit troublesome because, for us anyway, the instructions weren’t clear and we got water everywhere more than once. Having said that, it is a really nice feature and having such a big room felt luxurious. There’s plenty of storage, flat screen TV, excellently appointed bathroom with toiletries, and a safe. The best part however was the fact that there was a fully stocked mini bar with full-size spirits on optics. Fabulous!", "title": "1st time to Cancun.....and moon palace", "helpfulness": 3, "user": "khchiu88", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165268842}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "There are apparently 15 cafes and restaurants across all three hotels at the resort, of which Grand is one hotel, and we tried a fair few. The Caribbean restaurant nearest the Grand was lovely for breakfast and lunch, which were both buffet style, and became a la carte for dinner. There was a little too much pineapple on the menu for my liking but the food was excellent and the restaurant has a lovely ambience. All of the snack bars do similar food (burgers, chips, hotdogs) although the small one called Los Tacos, also at the Grand, served Mexican snacks instead. The food there was excellent too and the whole space was much more quiet and peaceful than the other restaurants.", "title": "Moon Palace Grand 2013", "helpfulness": 1, "user": "Phyllis L", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165256252}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The other two buffet restaurants at Nizuc and Sunrise hotels were great but the Brazilian restaurant at Nizuc was amazing. This restaurant was self-service for your salad and sides but the waiters bring a variety of meats to your table and carve them for you. The meat was unbelievably good and we would have gone again if we had been staying longer. The Mexican restaurant at Nizuc is also a la carte and very good. Bear in mind that men have to wear long trousers for this restaurant and it’s best to get there early as it gets very busy. In short, we ate A LOT and it was all good.", "title": "Honeymoon mr and mrs woods", "helpfulness": 1, "user": "joelean i", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165233738}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Excellent Hotel with tons of food and drink options included! Moon Palace is not located in the hotel zone, which is mostly a good thing, except the beach is not the white sand and clear blue water you'd expect in Cancun. However, there is cheap and easy transportation over to the other palace resorts located in the hotel zone for a beautiful day at the beach. I highly recommend staying at Moon Palace and just visiting the others. The Moon Grand section is much quieter than the other sections and better for a couples vacation with no kids. We did have to ask to have our room cleaned a few times, but other than that service was really excellent. The resort credits are not really the deal we expected them to be and we only used about half of the $1500 finding that paying the tax on the limited options wasn't worth it. Also, the deep tissue massages at the spa were removed from the resort credit options, which was very disappointing. Other than those few little things, however, our trip to Moon Palace was really outstanding and I would definitely want to stay there again if/when I go back to Cancun.", "title": "Highly Recommend", "helpfulness": 1, "user": "Jebrodsky", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 184053956}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Althought I was there on business, The Moon Palace is a beautiful resort and growing. Construction was going on but it did NOT interefere with our stay. The staff was friendly and accommodating. The restaurants were wonderful and plentiful. I did not have a renovated room but you couldn't tell the difference as my room was wonderful with a large jacuzzi. Although I prefer a smaller resort, the Moon Palace was wonderful. I feel confident in recommending this hotel to all.", "title": "GREAT STAY", "helpfulness": 1, "user": "Junebug2411", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184049963}, {"rating": 5.0, "title": "Unbelievable All Inclusive!!!", "text": "Woah!! What a fantastic hotel in every way!", "helpfulness": 2, "user": "Lara81", "date": "November 8, 2013", "id": 184044659}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The Service!!", "title": "Moon Palace Golf & Spa Resort", "helpfulness": 2, "user": "1963shirley", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183954435}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The Food!!", "title": "We will be back ;-) Perfect in every way", "helpfulness": 1, "user": "NickWish", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183911592}, {"rating": 1.0, "title": "Absolutely horrible beach - forget it", "text": "Despite the fact that the accomodations are nice, the beach is choked with seaweed. Why go to the Mexican coast and not be able to swim? I was terribly disappointed - and one day, went in anyway. I got big welts on my legs, and gave up. There was loud music playing at the pools all day - didn't we all hear \"Stayin' Alive\" enough in the 70's? Want to hear it all day long, with lots of other obnoxious music, and periodically, Dee Jay's screaming in the mike?", "helpfulness": 1, "user": "Maryjudy", "date": "February 12, 2003", "id": 855953}, {"rating": 5.0, "title": "Great Honeymoon", "text": "If you are going here for your Honeymoon make sure that you tell them when it is reserved or when you check in. Since it was our Honeymoon they turned our bed down the first night and provided us with a chilled bottle of champagne. The Moon Palace is more secluded than the other Palace resorts in the hotel district. The hotel staff were very friendly and always said hello. You really get pampered at Moon Palace. Word of caution: If guest services wants to give you a tour of the hotel, it is a sales pitch to become a member of the Palace Resorts. 200 weeks at $69,000 and you pay $540 per week for 4 people. Hah ! I almost spit my marguaritta over our lovely guest service (sales woman) employee, Sandra. The whole pitch took about 90 minutes. They give you free gift for taking the tour. We both took the 50 minute massage, which was very good. If we paid for the massage it would have been $120.00 usd. The food at Moon Palace was excellent and the drinks were very good also. Just be sure to pick a bartender to be your bud and tip him a 10 or 20 pesos now and then. As far as tips are concerned, none of the staff expects tips and they never pressure you into a tip. But they do work their *** off for you so I did tip when they did an outstanding job. The beach at Moon Palace is ok. When you come from sub-zero weather the beach was paradise until you compare it to the beach at Cancu Palace. This is the most beautiful beach and the water is a bright tourquise blue. Great waves for body boarding. Our next trip to Cancun will be at the Cancun Palace because of the beach and a bit more lively activity. Xpu-ha Palace is another Palace resort that we will stay at also. Great snorkeling here and a very relaxing and quiet location. Great beach here also. The beach at Moon Palace is still a beautiful beach but don't walk the coast south of Moon Palace. The beach south of Moon Palace is a testament to how dirty man can be. I have never seen a beach so littered with trash, plastic bottles, shoes and other items. It was absolutely horrible. I'm not sure if the Palce resort owns this beach or not but someone needs to clean this up. Make sure you go and see one of the Mayan ruins. We went to Tulum which is on the coast and has fantastic view of the ocean. We can't wait to return to Cancun and will probably stay at Cancun Palace this time for a bit more activity. If you want a relaxing vacation, this is the place to go.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 5, 2003", "id": 853279}, {"rating": 5.0, "title": "Wonderful - Highly Recommended!", "text": "Read the reviews on Moon Palace prior to your trip -- we did before we left (2nd week of Jan. 2003) and found them helpful and fairly accurate.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 28, 2003", "id": 848333}, {"rating": 5.0, "title": "Moon Palace was WONDERFUL!!", "text": "If possible, STAY at Sunrise part of resort, not Nizuc - it's newer and fancier. But EAT at Nizuc - food is better and has nicer presentation - especially Los Caporales, the Spanish Restaurant. Free lobby-to-lobby shuttles leave every few minutes in front of main entrances. Barracuda's (at Sunrise) near the pool has better food, too, though long lines at lunchtime. Otherwise, don't expect really fancy fare, just a huge variety of good, fresh buffet food with absolutely fantastic service!", "helpfulness": 3, "user": "MERRICK6917", "date": "January 26, 2003", "id": 847501}, {"rating": 5.0, "title": "Loved the Moon Palace", "text": "Definitely make use of free hotel shuttles to Cancun Palace and Beach Palace. The turquoise water there is so much prettier than beach at Moon Palace, which is a bit murky due to the seaweed. If you do, from there take the town bus (60 cents) up the hotel strip to one of the flea markets. Great deals can be found with a little bargaining...", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 21, 2003", "id": 841458}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Superb complex and the best all inclusive I have ever stayed in. Book this resort & enjoy. Its a huge with resort with 3 main areas. Each area has a selection of pools, bars and restaurants. Buggies and mini buses take you around the resort. Plenty to do in the day but evening entertainment limited.", "title": "Simply the best", "user": "ceeking", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183892649}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Great resort! I was recommended this resort by a friend. I decided I was going to really research before making my final decision. After going back and forth, I finally settled on this resort in the end. I LOVED that this resort was not in \"down town\" Cancun. This means the beach was practically empty and was seculded. However, its not too far from the city and you can take the free shuttle to the other resorts in down town. The food, services, cleaniness, and friendliness was more then expected. Better than any other all inclusive package I have ever done! and better then the all inclusive cruises! I was blow away by the quality in regards to the \"all inclusive\". HIGHLY recommend! only downside was too much to-do in too little of time! (5 nights). already planning my return trip!", "title": "beyond expectations!", "helpfulness": 3, "user": "Jennifer C", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 183830030}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We are just back from our 6th visit to Moon Palace resort and spa, had a great time again however this was the first time we have experienced a rotten smell from the beach although I wouldn't let this put me off returning next year. The hotel has gone through extensive renovation since we were there last where there has been a lot of positive features added, flow rider, dolphin experience, and the rooms have been nicely upgraded too, but the echo from the hallway by guests late in the evening does waken you , there should be signs in corridors to be courteous of other guests.", "title": "Return visit", "helpfulness": 2, "user": "joan o", "date": "November 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 183806249}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We find the staff very pleasant and welcoming this being one of the reasons we keep returning,the food and service in the restaurants is very good,always plenty of choice and especially Jesus who made my egg every morning without having ask him.", "title": "Perfect Holiday", "helpfulness": 2, "user": "RJBrid", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183751198}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "The entertainment team during the day are fab and would like to thank", "title": "We have travelled all over and this has been one of our favorite trips.", "helpfulness": 2, "user": "Peterokelly", "date": "November 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 183741057}, {"rating": 4.0, "title": "Excellent and Relaxing vacation", "text": "My girlfriend and I stayed at the Moon Palace Nizuc from May 22nd to May 29th. We had a great room overlooking the pool and a short walk from the lobby. It looked exactly like the room on the virtual tour on the internet. Everything was perfect the entire time we were there. After reading some reviews, I could understand people being upset at being placed in a far away room, but we were lucky to get a good one. Our mini fridge was stocked perfectly (leave a rinsed out empty of your favorite can/bottle on top of the fridge so they know which you like the most). The tours were great, and Xpu Ha was so magnificent that we have decided to stay there next time. Coming from the east coast where I have my pick of gourmet dining, I can understand the frustration when reading about the food, and people were right, the food was gross, but I don't go to Mexico for food, I go for snorkeling and diving, I can eat at home or in NYC if I want something fantastic! While we were there there was this Arctic Cat Convention and of the 2000 rooms available ALL WERE Booked solid! But the service did not suffer and I NEVER waited on line to eat. I guess if you eat at prime time you would, but on vacation I eat when I am hungry, not at any given time. We did get some ants in our room (like 10 or so) but they came IMMEDIATELY and we never saw them again. I would definitely go back, but for 10 nights instead of 7. The beach was awful, but Xpu Ha was a short trip away.", "helpfulness": 1, "user": "muzebiz", "date": "June 13, 2004", "id": 2186296}, {"rating": 5.0, "title": "A perfect vacation!", "text": "I just returned from a week long stay at Moon Palace. This resort was absolutley top of the line! The food was wonderful! The staff was very friendly! The two pools at this resort were huge! With 10 restaurants and 2 dance clubs you really don't even need to leave the resort to have fun at night! There were plenty of activities provided by the resort. My favorite was casino night!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 12, 2004", "id": 2185294}, {"rating": 3.0, "title": "Moon Palace - Not great, not bad", "text": "The rooms were terrific! They had a 2 person hot tub and a stocked mini-bar! Scuba diving, waverunner rentals, and para-sailing are just some of the amenities that are offered right from the beach!", "user": "A TripAdvisor user", "date": "June 12, 2004", "id": 2185180}, {"rating": 4.0, "title": "Nice place with average rooms", "text": "Without a doubt, I will be returning to Moon Palace for my next vacation!", "user": "A TripAdvisor user", "date": "June 10, 2004", "id": 2181005}, {"rating": 5.0, "title": "Loved Moon Palace", "text": "Before booking my stay at the Moon Palace, I read several of the reviews and decided that the positives seemed to outweigh the negatives, so I decided to stay there. I'd never been to Cancun nor done an all-inclusive so the idea was exciting to me. Being a single mom with 3 children, one of whom is adopted, I must tell you that the amount of documentation I had to bring was insane, but fortunately, I was well prepared in that department. By the way, I was told false information by the Mexican consulates office regarding what documentation was necessary. Glad I didn't listen to them.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 10, 2004", "id": 2180816}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Ive reviewed Moon before and want to briefly review my wedding experience. We have been to the Moon Palace several times and decided to have our destination wedding there since there is so much for everyone to do and the service is amazing. In dealing with the wedding reservation staff, I found it at times frustrating. We reserved a year in advance and was initially promised a 4pm wedding, then POOF-that time was gone. Same thing happened when trying to book restaurants, etc. Turns out part of the resort was closed for renovations. Now-thats fine, but the wedding department kept saying they didnt know that, or that things were open anyway-when they werent. Luckily-I was on a facebook forum that was spot on up-to-date. I ended up filling in my wedding coordinator and knowing more than she did. So my advice when booking a wedding is do your homework and keep in touch with those in the know.", "title": "Our Wonderful Wedding at Moon Palace", "helpfulness": 4, "user": "awayIgo6", "date": "November 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 183696579}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Once we arrived there were also a few snaffus.1st, there was a stench the minute we got out of the taxi. Turns out there was a tropical storm that added a lot of seaweed and the cleanup caused a smell. It was gone in a day (luckily!) They also didnt know we were guests of members and put us (the bride and groom) in a 1st floor room with a view of some plants. Turns out ALL of our guests had 3rd floor garden/ocean view rooms. We luckily were able to move to an Oceanfront room in the section that was being renovated. So it was a great view, quieter with less foot traffic and NO construction noise. Coincidentally-the gazebo and terrace we booked for the wedding was just outside of our room. Perfect locale!!", "title": "Very Good for all ages", "helpfulness": 5, "user": "rttusky", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183695498}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Once all that was handled-the onsite coordinator was fabulous!! Very professional. The time was (well look at that-)able to be moved to 4pm and changed from the beach to a shaded gazebo due to the seaweed. However-thrilled to have shade because it is HOT in October!! Still in the upper 80s but the sun was a welcomed sight! We had a welcome dinner in the Caribeno restaurant that was great with amazing service. The salon did my hair which looked great but didnt quite stay in place despite 30 bobby pins. They also did my make up which was a little havy for my liking but after I took a bit off, it was great. I got the horse drawn carriage that the guests seemed to love. The photographer was also amazing and I used the onsite photo staff. Our book looks great!", "title": "MUY BUENO", "helpfulness": 2, "user": "Bryan B", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183691506}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We had a GREAT time at the reception. They provided a buffet due to the number of guests. Also, we hired a cigar roller and that was a hit with our guests! I totally recommend the Tres Leches Cake-even if they try to talk you out of it due to heat. It held up great and was amazing!", "title": "Wonderful", "helpfulness": 3, "user": "maupet", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183687619}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "Despite the hiccups, Moon has made some amazing updates, and continues to do so. We had a fab time and so did our guests. Kudos to Josaline the coordinator!!", "title": "This is a beautiful resort destination with one problem; the beach is covered with seaweed!", "helpfulness": 1, "user": "tomamo", "date": "November 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 183686172}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This was our first visit to an all-inclusive and will definitely not be our last. We loved that we were not nickel-and-dimed for everything.", "title": "Coming back in 2015!", "helpfulness": 2, "user": "my3guys", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165124910}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Pros:", "title": "A great time at Moon Palace - June 14 to 21, 2013", "user": "adrere", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165108429}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "-staff was friendly and most were accommodating", "title": "Excellent Resort to vacation", "helpfulness": 2, "user": "Roger B", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165068098}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "-grounds were beautiful and well maintained", "title": "Paradise at its best", "helpfulness": 2, "user": "jean t", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165067429}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "-Flowrider was enjoyed by my kids, especially the hubs - my biggest kid", "title": "Special Time away with Great Results", "helpfulness": 4, "user": "Cindy S", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165048034}, {"rating": 4.0, "title": "Love it with Kids", "text": "We stayed at the Moon Palace Feb 10-14. There was time share sales, but if we had the money we would have done it! We visited the hotels on the strip with the gorgeous beaches, the Cancun Palace, Beach Palace and the Sun Palace. The pools at these places were nice but nothing in comparison to the pool at the Moon Palace! The beach at the Moon palace did have sea weed but we were not inadated with sales men selling everything from jewelry to beach wraps. I much rather give up a little scenery for privacy! Oh by the way our kids had no problem building sand castles on the beach at Moon Palace. The staff was truely wonderful and accomadating. We plan on going back in Feb 2004.", "helpfulness": 1, "user": "KellysTravels", "date": "February 23, 2003", "id": 860383}, {"rating": 3.0, "title": "Moon Palace: slightly better than middle of the road", "text": "We (my wife and I, 15 year old daughter, 9 year old son) recently returned from a week at the Moon Palace resort in Cancun. Traveling during the school break (Feb) we were prepared for large crowds, long lines, etc. and were pleasantly suprised to find the hotel and staff gracious and competent handling the large crowds. Our room, the standard jacuzzi suite, was smaller than we expected, but still okay for a family of four. As for the ocean view, yes it was there, but I had to stand on a chair to catch a glimpse. Everyone told us the pool was incredible and it was, it seemed to go on forever. Word to the wise, if your planning on sitting anywhere near the pool, have a member of your party up by 5:00am, yes, 5:00am, to secure your spot with a towel. Any later and your def not sitting poolside. A word about the food, we found the food at the moon palace okay, not great, but okay. Almost everything is buffet style which we found acceptable for breakfast and lunch, but somewhat lacking for dinner. They do have two restaurants with wait staff, a steakhouse where we had our worst meal and a oriental themed which we enjoyed very much. Oh, and don't worry about drinks, there seems to be a bar around every corner and the drinks are pretty good (only one kind of beer, draft, what up with that?) And all the other reviews about the beach being terrible, they are true, it is. We didn't go to any of the other Palace resorts on the strip, although you can if you want to swim in the ocean. Overall, we would rate this vacation a big OKAY. Not sorry we went, probably won't ever go back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 23, 2003", "id": 860360}, {"rating": 2.0, "title": "Wouldn't go back", "text": "Stayed at Moon Palace with husband, parents and 3 boys, 4,5 and 7. Love Mexico, own timeshare in Cabo, vacation frequently. Would not return to MP, not worth the $$. I go to Cancun for the beautiful beach and water. had to stay poolside due to murky water and seaweed. Also kids club was a good 15 minute walk from our room. I felt uneasy leaving kids that far from me. And their planned activites changed so when i went to check on my children, they were not where they should have been. Spent another 20 minutes searching huge resort to find them. Also inconvenienced by taking shuttle to other Palace on the strip just to go swimming. Lots of stuff to pack up when you have 3 kids and your room is at another hotel. Just a giant hassle. Who needs it when you are on vacation. Will try fieta americana next time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 22, 2003", "id": 860221}, {"rating": 5.0, "title": "We Loved it !! And we bought in... and my husbands an accountant.", "text": "We love it and bought 100 weeks in the members program. Just hope we live long enough to use all of them. If not our children will. We love the food, the staff, the rooms, and the pools. We have traveled all over and found our dream in the Moon Palace.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 16, 2003", "id": 857981}, {"rating": 2.0, "title": "Better to go to Jamaica", "text": "Stayed at the Moon Palace, Cancun in August 2002 for 1 week. I would not reccomend this hotel to anyone. 1st thing they do when you arrive at the hotel is put the sales pressure on to buy into a time share. They show you a luxury suite that you can get for cheaper than the $300 a nite you have already paid if you sign up for the timeshare. I would recomend to stay near downtown Cancun if you really want to go there. You can get a room for 1/3 of the price of the Moon Palace. Actually, I would reccomend Hualtulco Mexico in Oaxoca, or Hedonism resorts in Jamaica for a much more relaxing time. Tim", "user": "A TripAdvisor user", "date": "February 12, 2003", "id": 856406}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Stayed here 2 weeks in Jan 07, Oh my god i thought when we walked trough the front lobby, Welcomed with a glass of champagne on arrival which was a great start to a truly amazing holiday, Kids club was fantastic all well organised and the staff were excellent ( Our own hospitality work force over here should take note) Offered drinks every 10 minutes! no matter where you were!staff and facilities could not be beat anywhere!! already cant wait to return next year.", "title": "Best hotel ever!!!", "helpfulness": 3, "user": "Distillery", "date": "February 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6737795, "likes": {"liked": "— Staff , facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Would recommend to anyone wanting a relaxing holiday with or with out kids. Only left the hotel once to go on jungle tour also recommended.", "title": "An Enjoyable Week", "helpfulness": 13, "user": "zoniePhoenix", "date": "February 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 6732610, "likes": {"liked": "— range of activities, all-inclusive", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I spent a week (Jan.9-16) at the Moon Palace. Here are some of our observations:", "title": "Fabulous!!", "helpfulness": 10, "user": "AttorneyGirl", "date": "February 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6725908, "likes": {"liked": "— The service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "1) Because the resort is so large you do a lot of walking; helps you walk off the food. The grounds are well-maintained.", "title": "truly is a palace!", "helpfulness": 15, "user": "Let'sgoMexico!", "date": "February 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6720820, "likes": {"liked": "— everything!", "disliked": "— having to leave!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "2) The food, while not gourmet, is good and it's plentiful. We felt the two best restaurants were Los Corporales (in the Nizuc side) and the Trattoria (in the Spa/Golf Clubhouse).", "title": "Top Shelf", "helpfulness": 13, "user": "limespider", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6716602, "likes": {"liked": "— staff/pool/clean", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Christmas week 2002-2--3 stay", "text": "My wife and I stayed here from Dec 26, 2002-Jan 2, 2003. The place is nice and the food is very good, but I cannot recommend it for families without children as it is very busy and noisy. We also received numerous conflicting instructions from staff members regarding New Year's Eve party, restaurant policies, shuttle times, etc. It is also necessary (at least on that busy week) to get up very early to reserve chairs by the pools. I DO NOT want to have to set my alarm on vacation just to ensure that I will get a pool side seat. For families with teenage children it should be pretty nice. For people without children or those wishing for a relaxing vacation I cannot recommend it. We will not go back.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 2, 2003", "id": 906690}, {"rating": 4.0, "title": "Truly beautiful and secluded", "text": "7 of us (fam of 5 & grandparents) each thoroughly enjoyed the grounds, tours and staff. Restaurants were varied enough to keep mealtimes enjoyable. The pools were gorgeous and relaxing. Occasional games at the pool were somewhat obnoxious, but the pool is long and meandering enough to find solace. The pool bars were well stocked and bartenders were very attentive. The concierge was helpful in finding/booking numerous tours. We recommend Chichen Itza and Isla Mujeras. Also, Tulum. One week is not enough to see all. Unfortunately, we experienced theft from our room, and the hotel manager was \"unable\" to help us recover our things. We loved Moon Palace, but next time we will try a different resort.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 25, 2003", "id": 860959}, {"rating": 5.0, "title": "Moon is paradise", "text": "The Moon is great, we stayed on the Nizuc side in February on 2003 and it was really layed back and relaxing. The restaurants are great as is the pool. The ocean is a little full of seaweed but we used the free shuttle to the palace resorts on the strip to play in the ocean. The rooms are very nice and the service is top notch. We had NO pressure from time share reps at all. I guess all you have to say is NO to them and they get the hint. This was a dream holiday. We took 3 tours while in Cancun and enjoyed all of the greatly. The staff if unbelievable, we wanted to take one home with us. We are planning on going to Cancun every winter and will be staying at the Palace resorts each time. Please write me with any questions.", "helpfulness": 6, "user": "ocean_bums", "date": "February 25, 2003", "id": 860958}, {"rating": 4.0, "title": "Very nice", "text": "We traveled with a company group so we weren't even approached about the time share aspect. Overall, it's a beautiful place. The beach isn't the best due to the seaweed but still very pretty. The pool setting is great. Food was generally very good. The service personnel - waiters, bellmen, maids, etc. were all great - friendly and efficient. The front desk personnel seems somewhat indifferent and a bit snooty (surly?) and when we went to settle our final bill it was like pulling hair to get change (we paid cash.) We recommend using a credit card! The excursion to Tulum was very nice - the tour guides were very helpful, knowledgeable and polite. They do stop you about halfway there and have you wander through a shop where the employees pressure you to buy their overpriced goods, though. We'll go back if we can!", "helpfulness": 3, "user": "TravelerfromWichita", "date": "February 25, 2003", "id": 860827}, {"rating": 1.0, "title": "Run, quick", "text": "The Moon Palace had all the makings of a wonderful trip. Beautiful location, seclusion, great looking beach (on the brochure and web site). Ahhhhh then you get there. The place is very nice but has faults large enough that you should certainly steer clear and find other amenities and a better hotel for your price. The food (90% buffets) is as you would expect. Soft, mushy buffet food. You can pull off most breakfasts like that but lunch's and dinner's were atrocious. Momonohana was a decent alternative but still not a great place to eat (can we say fair to middlin?). The rooms are not very big and the hottub in the room takes up most of the space. Minimal drawer space is left for clothing (I suppose its ok if you are only there for one night). The closet is quite small, we asked for a new comforter twice (who knows what laws govern when they wash things down there). This was the 3rd trip there and I would say the worst I have ever taken by far. Think about your money and how you want it spent. Bad food? A terrible beach? Perhaps a sulfur stench most of the time as you walk around? Maybe the 30 minute \"free\" shuttle service (very limited times, and very limited seating) to the hotel district and downtown? There are much better options for the same or a better price. Take any of them. RUN, QUICK.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 24, 2003", "id": 860627}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I have just spent a week at the Moon Palace and it is an amazing place. It is very well maintained, the rooms are of a very high standard and all of the staff were incredibly friendly and helpful. A special mention must got to ALFONSO in Guest Services, who we knicknamed Harry Potter as he managed to \"work his magic\" whatever the request was.", "title": "The facilities at the resort are only surpassed by the levels of service", "helpfulness": 2, "user": "Jonathan F", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165034441}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We have visited Moon Palace 15 times and now stay at the Moon Grand side of the complex which is excellently staffed wonderful pools and garden areas and the most beautiful beach, the Caribbean restaurant serves the most wonderful food Breakfast, lunch and Dinner.", "title": "Dream Holiday", "helpfulness": 2, "user": "Alan1318", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165007860}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Certainly if you want a holiday to remember then this is the place and new attractions are being added every year so go an experience it for yourself you will not be disappointed", "title": "Great Family Trip To The Moon Palace", "helpfulness": 1, "user": "K Scott W", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164961326}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We just got back from a week at the Moon Palace and will definitely be back. Staff could not have been friendlier and the food was great. Lots of things to do and my six year old son loved the flow rider( wants one for our house but that is not going to happen). Golf course looked great and I will definitely bring my clubs next time. Tried the spa for a massage and it was excellent. Our only complaint involves the teen lounge where about half of the video games were out of order during our entire trip. Not a huge deal as there was plenty of other things to do but my son was disappointed that he could not play some of the games. Our room was great too- very luxurious and the pools were fantastic. Overall, we had a great time!", "title": "Awesome, amazing resort!", "helpfulness": 2, "user": "Tracy C", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164961280}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We stayed at moon palace to celebrate an anniversary. This was our first time in Cancun and oir first stay at Moon Palace. We stayed here on recommendation of friends & our daughter & son in law. We stayed at the Grand and the rooms were amazing!! We had access to all the restaurants & pools at all three hotels on the property and they were all easily accessible with the on site transportation. The service was impeccable due to the friendly staff. There always seemed to be someone close by if we needed anything. I loved the little touches like the evening turn down service which included chocolates on the pillow as well as an evening snack delivered nightly to our room. The room service was prompt & always delicious. Even the bath products were top of the line fro Chi, including a salon quality Chi hair dryer & straightener!! There are too many things we loved about this resort to mention so will just say it was great & we will be back!!", "title": "AMAZINGLY FUN YET RELAXING", "helpfulness": 1, "user": "DJ_ChRiSPiX", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164952057}, {"rating": 2.0, "title": "Not five star not even close", "text": "Ok this place is not what they make it out to be the food while free is about one step above your local diner. pool could be cleaner (pieces of childrens diapers in pool) and service is poor unless you have a 100.00 pesos in your hand And on my last day despite many promises about times, the bell man never picked up my bags from the room and 9 bags by my self,just made flight Also the ventilation is poor -- even though we were in the presidential suite, you could smell anything that was in the next rooms, and while this is not their fault, the beach is almost unuseable due to the six or eight feet of seaweed you have to wade through, so I don't know where they got the picture of the pristine beach on the brochure", "helpfulness": 2, "user": "Timwestcreek", "date": "March 8, 2003", "id": 909915}, {"rating": 5.0, "title": "The Moon Palace was so nice! March 03", "text": "We went to a company conference at the Moon Palace and loved it! It's big, and they run a golf cart shuttle every few minutes if you get tired of walking/or a little too lit. We enjoyed everything, good food and drinks, and were treated very well. The jacuzzi in the room, made for two, was wonderful and enjoyed with the patio doors open since the rooms are angled toward the ocean instead of facing each other. There is quite a bit of seaweed on the beach, but the pools are really nice and we prefer them over ocean swimming anyway. We did take long walks on the beach and the seaweed didn't matter so much. Beaches are nicer in the hotel district, which is a shuttle away; however, the shuttles are very limited and taxis are very expensive. We preferred the seclusion of the Moon Palace over the congestion typical of any hotel district. And Most Importantly: the Gift Shop at the Moon Palace is really where you will find the best shopping prices!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 8, 2003", "id": 909911}, {"rating": 3.0, "title": "Nice resort, but...", "text": "I expected the Moon Palace to be some great place do to the fact it was a gold six apple. I would only rate it a 5 apple. The hotel was beautiful, very large, well kept, the rooms were nice, the jacuzzi was great. There was no room for clothes due to limited drawers, I believe there were only 4.The beds were rock hard. The pools were beautiful, very large and always enough room to sit in a great spot.The food was average. One great steak restaurant located at the other side of the resort. The nizuc side. Sunrise section very busy and alot of walking. If you are disabled or elderly this is definately not the place for you. Though they do have wheel chair access everywhere.The drinks were also average. The staff seemed very busy and not too attentative. Compared to other resorts I've stayed in. Don't get me wrong there were some who tryed very hard to please.Though all-inclusive, everyone working there did expect tips. The worst part of the resort is the beach, the beach is horrible due to seaweed. You could take a transfer into Cancun at other resorts which the beach was awesome. (Cancun Palace).The ride took about 35 minutes. When I go to Mexico next year I will not stay at the moon Palace. I would not recommend it. We did have fun, after all it was Mexico and we were on vacation. But you could chose a better resort for your money. I could recommend one to you if you like. If you have any questions you can email me.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 7, 2003", "id": 909705}, {"rating": 5.0, "title": "If I could have only stayed longer...", "text": "We were there Feb 27-Mar 2, had an excellent time. Eat, drink and be happy was our motto going down and we were not disappointed. Would definitely go back again. The grounds are beautiful and the staff couldn't do enough for you.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 5, 2003", "id": 908088}, {"rating": 5.0, "title": "No other vacation can compare", "text": "We visited last year on a conference and loved it so much, this year we're taking my son and his girlfriend. Excellent service, great food and laid back atomsphere. Much better than staying in the crowded city. If you wake up early enough, you can see the dolphins playing. I highly recommend the drink Miami Vice. We even added the link on our web site. The ruins are quite far, 90 mins to 2 hour drives, be prepared for that.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 3, 2003", "id": 907249}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We had bought a timeshare at Moon Palace -Sunrise in 2000 and have used the resort only twice since then.Friends and family have used our membership and raved about the resort.We decided to go back and returned home from a week's visit today.", "title": "Moon Grand", "helpfulness": 2, "user": "BritRN", "date": "November 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 184199147}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Since 2004 and our last visit, The Moon Grand has been built and this is where we stayed. We were happy to be at this end of the resort as Sunrise has been renovated and now is a lot busier with all the night clubs,bars, flow rider by the pool etc. So the Grand suited us better. We walked nightly the 1 mile along the beach to the Sunrise for restaurants but there is a bus that runs every 10 mins to both Sunrise and Nizuc (which re-opened this past week) . We liked the Gondola restaurant, the Mexican buffet and the Japanese in particular. One major concern for us though , was the temperature of the meals. The meals were only tepid and not even warm. I like my food hot when it is served as this reflects that the food has just been cooked and is fresh. With only tepid food served in every restaurant we went to, we felt like it was being prepared well in advance and then sitting out under hot plates and this system was not working well for us. So food that had good flavor and presentation was let down by the temperature. Not 5 star cuisine due to this at all.", "title": "Can do better", "helpfulness": 3, "user": "peter l", "date": "November 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184173014}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Also,we noticed corners had been cut since 2004 in that fruity drinks had no fruit in it e.g no pineapple in pina coladas, no fruit in sangria. Desserts used to all be made with real cream and now were fake cream and felt very gelatinous and the quality of desserts , although appealing to the eye, disappointed the taste buds and lacked taste!", "title": "Nice Stay!", "helpfulness": 1, "user": "lizcuccaro", "date": "November 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 184168257}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We were happy to see that Palace resorts is investing the money from their sales pitch back into the property but they could improve the quality of the food by these suggestions noted above.", "title": "Excellence", "helpfulness": 1, "user": "JAMConstruccion", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184092598}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The pools of course are fantastic. They have added more evening entertainment which was lacking. Previously after dinner, there was nothing to do but now there are singers in the bar , a night club, a pianist in the Carribean restaurant and shows on the stage. The pool staff during the day are great and very engaging. We particularly liked the staff at the Grand Pool.", "title": "October '13", "helpfulness": 3, "user": "Ryan M", "date": "November 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 184076756}, {"rating": 5.0, "title": "Moon Palace is Paradice", "text": "I was on my honeymoon for this trip May 16th-May22nd of 2004. I had read horrible reviews about this place before we went so I was scared. However when we went there it was AMAZING!. The rooms are huge, the drings are strong, and the food is to die for. It seems like all we did while we were there was eat. The resort itself is beautiful and all of the waitors are so nice and willing to do anything for you. We spent a week in heaven there and were so sad to have to leave. We are all ready planning to go back for our year anniversary. The room was so big and nice with the hot tub in the middle. We did two tours, one to Isla Mujeras and the other to Tulum and Xup-Ha. They were so much fun. I highly reccomend both! So don't listen to the bad rewies this place was GREAT! It exceded both of our expectations.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 10, 2004", "id": 2179914}, {"rating": 5.0, "title": "Fantastic", "text": "I have just returned from two weeks in Paradise.My partner and I stayed at this resort and we stayed in the sunrise side. Wow what a difference in size to the Nizuc side..The tour company rep was fantastic..nothing was ever too much trouble for the staff. I particularly liked the turn down service at night time which was given without being requested and the fact that the housekeeping side of things was exceptional.I was disappointed on arrival at the airport to be told enroute that I was staying in the sunrise section of the resort and not the nizuc but we took some meals in the nizuc and in comparison the sunrise side is bigger and better...The oriental restaurant is ok if you like cold food that is th only thing that I can complain about but the spanish restuarant in the nizuc side is cosy and romantic very nice...if i was to have a wedding abroad this would be the perfect location . All in all a beautoful resort grounds well kept and staff brilliant Rooms spotless not once did we see any bugs whereas some of the hotels in cancun that I have stayed in you see them often... One more thing that I must gripe about is the lack of control that american parents have over their children at 07:30 in the morning..even the parents joined in one morning running up and down in the corridor and kicking the ball up the wall of our room...So please if any american parents read this and are taking their little ones on holiday to this resort please spare a thought for other holiday makers and do not let the children run through the corridors as if they are in a school playground. I will just add that we appreciate that the majority of children are well behaved there is always the minority that spoils it and gives bad press to the few that are well behaved...", "helpfulness": 1, "user": "theresa_2", "date": "June 10, 2004", "id": 2176867}, {"rating": 5.0, "title": "fantastic!!!", "text": "Went to Moon Palace for honeymoon May 23-27. First of all the length of time we stayed was not long enough. We wanted to extend our trip a day, but airfare charged too much.", "helpfulness": 1, "user": "beaus22", "date": "June 9, 2004", "id": 2174021}, {"rating": 3.0, "stay_parameters": "Stayed June 2004", "text": "The airport when you arrive in Cancun takes a long time so be prepared with that. We found the shuttle to Moon Palace with no problem, and it took about 10 minutes to get there. While we were checking in, they brought us glasses of champagne. This is where their \"tour\" people grab you to set up a time for a tour the next morning for free massages or $100 in palace money. They say they are not time share, but it pretty much is their type of timeshare. They take up too much of your time the next morning with their \"tour\". Do not recommend this!....ok that was the only glitch.", "title": "Nice hotel, but horrible beach & location", "helpfulness": 1, "user": "vancutie", "date": "June 8, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 2173228}, {"rating": 4.0, "title": "Good Resort", "text": "Well, we got to our room on the nizuc side and we just loved the view of the palm trees and water outside our window. It was perfect! Since we had been traveling all day, we wanted to try out the jacuzzi. Make sure you fill it all the way up to the line before you turn the jets on! Overall we loved the room.", "user": "A TripAdvisor user", "date": "June 8, 2004", "id": 2172463}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Very expensive, food repetitive in all restaurants... most very dissapointing, esp the mexican? whats going on there? LOL", "title": "Go to The Royal Cancun instead!", "helpfulness": 1, "user": "Bigguns1979", "date": "June 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 165222806}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Dont bother with the free show its the biggest pile of cabbage you will ever see, we stood outside getting bitten for an hour, why take valued guests that early to a show off site to sweat our nuts off and force us to use even more mosquito infested porta loos just to take a few extra pesos make us buy warm beer and crappy food at inflated prices.", "title": "Amazing resort- BUT NO BEACH", "helpfulness": 2, "user": "Knadochka", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 165197698}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Rooms were clean to be fair and service was ok..the more you tipped the quicker you were served.", "title": "Too many 1 Stars!", "helpfulness": 1, "user": "Lisa M", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165191388}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "For similar money go to the royal, its much better!", "title": "Paradise with World Class Service!!", "helpfulness": 1, "user": "GreggRTy", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165131613}, {"rating": 5.0, "title": "Great Vacation!", "text": "All of the good reviews above are absolutely true. So I won't say how amazing food and service is! They truly are impeccable !!", "user": "JohnnyTravelsAlot", "date": "June 24, 2013", "id": 165129296}, {"rating": 2.0, "stay_parameters": "Stayed July 2005, traveled with friends", "text": "Four of us stayed at the Moon Palace in July 2005 for 2 weeks all inclusive. The rooms were a good size, with the jazzcui in the living room looking out of the window onto a green - depending on your room location it could be the sea view! To be honest, although this was nice, we only used it a couple of times so don't base your decision to go on this. The optics in the room were tequilla, barcardi and one other drink which none of us liked! The mini bar was refilled on a daily basis with beer, water and cans of fizzy drinks. Our rooms were located on the older part of the development, but you can easily walk down to the newer part and enjoy the facilities down there i.e. night club and chinese restaurant (this was always busy and we never got to eat there). The restaurants on our site were OK, you may have to wait for around 10-30 mins depending on peak time, but you can have a drink at the bar. We did meet a very nice bar tender, who always got our drinks ready when he saw us coming.", "title": "Disappointed in the Moon Palace", "helpfulness": 3, "user": "mangojuice", "date": "January 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 3.0, "cleanliness": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6715230, "likes": {"liked": "— On the beach", "disliked": "— Too big and busy"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We booked our tours in the hotel foyer - make sure you meet up with the hotel representative as he gave us a book about the hotel and vouchers entitling us to two free trips as part of all inclusive - we went to Chichen Itza which was an excellent day out and would recommend it. The other was to Isla Mujeres, but after getting up very early i.e 6 a.m., we were told that there'd be no water sports available & that we weren't allowed in the sea. So we didn't go as we wanted to snorkel. We also went on the jungle tour and that was good, so I'd recommend that. Two of us booked to swim with the dolphins, but at the end of our first week, we were hit by a hurricane which completely ruined the holiday for us. The beach was completely trashed for our last week, alot of the tours had been cancelled, luckily we did get to swim with the dolphins the day before we came home. Alot of people were moved into our hotel, so it became very overcrowded and the service went down hill, alot of mess built up around the pool area.", "title": "Beautiful Hotel and wonderful service", "helpfulness": 12, "user": "nymisc", "date": "January 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6704449, "likes": {"liked": "— The food, the pools and the spa", "disliked": "— Sales people and Mexican transportation"}}, {"rating": 5.0, "title": "very good but!", "text": "Our partners played golf twice at the resort, very expensive i.e. $200 per round, and with shoe, bag and buggy hire it was another $50 on top. I think they enjoyed both rounds though.", "helpfulness": 7, "user": "jock1staffs", "date": "January 27, 2007", "id": 6704392}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We counted on a daily basis around 8 weddings, it was a running joke all holiday - until the hurricane came and then you were shoved upstairs above the foyer - which we could hear sitting having a drink. Now if you intend on going here for your honeymoon, think twice. I couldn't think of anywhere worse you would want to be. It is such a big and busy hotel. Also the Americans are so loud and disrespectful, they'd be in the pool with drinks, either spilling them or tipping the whole lot in the pool and some didn't have a care for anyone else.", "title": "crappy sevice", "helpfulness": 9, "user": "lunoPei", "date": "January 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6687339, "likes": {"liked": "— the sun", "disliked": "— the crappy service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We only stayed in the Moon for two days but we loved it. I read several of the reviews and I did not encounter any of the problems other than the sales people-which you will get anywhere in Cancun. Also, everyone I spoke to other than maid staff spoke english.", "title": "Awesome New Years Trip!", "helpfulness": 24, "user": "tvt", "date": "January 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6641551, "likes": {"liked": "— The pool and our amazing golf villa!", "disliked": "— Seaweed on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My husband and I went to the Moon Palace on January 21st until the 28th for our honeymoon. After reading all of the reviews we really had no idea what to expect, but found out as soon as we got there that apparently some people can't be pleased because from the moment we got there we were totally amazed witht the place. The only thing we found wrong with the entire trip is that we were there for too few days and there was so much more to enjoy.", "title": "The Best Trip Ever", "helpfulness": 12, "user": "NewYorkFrogLover", "date": "February 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6774720, "likes": {"liked": "— Pools, Bars, Food, and it was very easy to do any of the extra excursions we wanted to do."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The restaurants at the resort were amazing, the Brazilian was our favorite ( if you like meat), we did try the Italian at the Golf Course one night and found that it wasn't the Italian that we're used to, eventhough the food was still good. The food was great at every restaurant we went to along with the service. Everyone was happy and eger to please.", "title": "luxury at Moon Palace", "helpfulness": 16, "user": "ShannonReid", "date": "February 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6749761, "likes": {"liked": "— The 5 star feeling - you know you are in a place that knows what they are doing", "disliked": "— If you are travelling with 3 kids, they can't accomdate you. You have to get 2 rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed on the Nizuc side and found it to be great. Some people had said that the Sunrise side was better, but I think we enjoyed the pools, bars and restaurants on our side much more. Actually we never even used the pools on the Sunrise side. The staff seemed much more pleasant and really seemed to love their jobs. The one thing that we did find better on the Sunrise side was the gift shop and jewelry store. The casino was fun, only spent a little time there.", "title": "excellent all-inclusive", "helpfulness": 9, "user": "beachbumtimestwo", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6748663, "likes": {"liked": "— jacuzzi room", "disliked": "— distance to cancun beaches"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We spent our days at the swim up bar outside our lobby where we meant a great bartender, Fransisco. He was a lot of fun. Met a lot of neat people at the swim up bar. At night we we either enjoyed one of the dance shows they held every night which were great if you like that sort of thing, which my husband doesn't so he'd go to the Jungle Bar where they'd have a band every night, I think they had Kareoke one night. It was a lot of fun.", "title": "fantastic resort", "helpfulness": 7, "user": "smehrain", "date": "February 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6745256, "likes": {"liked": "— jacuzzi"}}, {"rating": 5.0, "title": "What a place", "text": "I would deffinately recomend this hotel to anyone!!! It's beautiful. One thing I did learn is that the Sunrise side is highly over-rated. I never saw a room on that side, but ours was great and who actually spends that much time in their room when there's all that beautiful sunshine out there.", "helpfulness": 19, "user": "burrcor", "date": "February 4, 2007", "id": 6745041}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Stayed in Moon Palace in early Feb (unfortunately only 3 nights). Didnt try everything they have but here are a few of my comments:", "title": "It's a great place.", "helpfulness": 4, "user": "jodcha", "date": "February 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6786152, "likes": {"liked": "— A-class Services", "disliked": "— Food, they are all the same."}}, {"rating": 5.0, "title": "Fantastic!!!!", "text": "I stayed at the Sunrise side.", "helpfulness": 17, "user": "Laura_57", "date": "February 13, 2007", "id": 6785505}, {"rating": 1.0, "title": "money stolen at Moon Palace", "text": "Rooms:", "helpfulness": 15, "user": "grillgirl", "date": "February 12, 2007", "id": 6783558}, {"rating": 5.0, "title": "First Class All Inclusive would go back to any Palace Resorts", "text": "Fabulous! Nice decorations, Bed very comfy, great TV, great balcony overlooking the ocean. Fridge full of drinks ready for you. But they have no snacks, which would be great if they have some.", "helpfulness": 9, "user": "Mikeonatrip", "date": "February 11, 2007", "id": 6780725}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Room Service:", "title": "Ready to be Royalty", "helpfulness": 16, "user": "webelong", "date": "February 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6776865, "likes": {"liked": "— EVERYTHING", "disliked": "— Time share sales people"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 401, "average": 645, "very good": 1825, "terrible": 284, "excellent": 5250}, "aka": "Moon Palace", "slim_ranking": 0.104046242775, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located on Cancun's tranquil south shore, this resort offers 2,433 accommodations with double Jacuzzi, 24 hr. room service and balconies. The excitement begins with two large lagoon-style pools with Jacuzzis and swim-up bars. The state-of-the-art Spa and Jack Nicklaus Signature Golf Course, located by the Golf Club House, offer a perfect getaway for guest. This all-inclusive resort has something for everyone, including a kid's club, disco, 13 restaurants, 12 bars and water sports."}