{"user_rating": 4.5, "review_count": 122, "name": "Moon Dance Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We just got back from a 10 day vacation at Moon Dance Villas. We stayed at the 2 bedroom villa 'Satin Sunrise from April 9 to April 19th 2009.\"", "title": "Moon Dance Villas is the Real Deal", "user": "daytripper82974", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28794295}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "We were reluctant to write a review becuase we fear that this hidden gem will no longer remain so hidden. All that said, we feel compelled to let others know what a first class vacation we had in Jamaica, and particularily, our stay at Moon Dance Villas.", "title": "Great place shame about the exchange rate", "helpfulness": 1, "user": "FredoTO", "date": "February 16, 2009", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24637343, "likes": {"liked": "— accomodaqtions were beautiful", "disliked": "— Exchange rate charged"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "The accomodations are just as they appear on the website - if not better. The Villas are well maintained and kept super clean by the resorts top notch cleaning staff.", "title": "My Brother and best friend's wedding", "user": "BondGirl6_9", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24042497, "likes": {"liked": "— One step to the beach", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "In addition to great villas, the location of Moon Dance is equally spectacular. The Villas are literallyl situated right on the beach, The beach experience at Moon Dance is just as one would imagine as you are sitting in your chair at work, dreaming of the next vacation. White sand, indiginous trees for shade, hammocks, beach toys and yes, the all important bartender bringing you very strong blender drinks.", "title": "Perfect!", "user": "theboogs", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23764731, "likes": {"liked": "— The service and the food", "disliked": "— Kind of a noisy location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Much can be said about the physical ammenities, but what truly made our trip was the house \"staff\" - although, we would prefer to call them our vacation friends - because that is what they turned out to be. We had Glenn as our bartender and Robert as our cook extroadinaire. These two guys were the greatest representation of Jamaican hospitality and kindness. Sure, they were at work, but they truly enjoyed sharing their stories of growing up in Jamaica and had a genuine interest in making our stay there the very best it could be. Glenn - thanks for your stiff drinks and kind heart - we hope to see you again. Robert - we are suffering from jerk withdrawal - my personal cooking also just doesn't taste the same anymore! Big thanks to both of you.", "title": "Beautiful!", "user": "641michele", "date": "January 13, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23527400, "likes": {"liked": "— The Sunsets", "disliked": "— Front Gate lady was very rude"}}, {"rating": 4.0, "title": "moondance villas", "text": "if anyone wants to visit jamaica, this is the place to stay at. Service is excellent- food is good- drinks keep coming wherver youre at on the property. I went for my friends wedding-the package and party they put together was astounding. Security is also extremely tight- it has to be- thats the only drawback. The locals are a liitle aggresive in the peddling of their wares but a simple and polite no thank you will usually suffice. Dont walk on the beach alone at night. Jimmy Buffets is right next door and is a lot of fun. Chew the vendors down on anything you wish to buy-they start out at a 200% markup to see where you stand with cash. The pools at all of the villas at moondance are incredible in design everything very private with beach access. Winslow will provide the non-motor water sports tip him good. I would go back on the on season when the locals are doing better and not so aggressive", "helpfulness": 5, "user": "scallawag540", "date": "November 27, 2007", "id": 11094687}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Our family of 12 stayed at Ginger Breeze for a week and were extremely pleased with everything about the resort.", "title": "As good as it gets", "helpfulness": 3, "user": "tf403", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11084956, "likes": {"liked": "— Beach front setting", "disliked": "— Mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This was our second stay at Moon Dance Villas. This time we occupied the 4 bedroom Azure Sky Villa.", "title": "Even better the second time", "helpfulness": 1, "user": "Bgiants", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75844381}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Booking - Excellent communication with Kim who handled all of our requests from her Chicago office. Very professional and thorough in making sure there were no surprises.", "title": "A Wedding Come True", "user": "Starlet070", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74992012}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Transportation - 1.5 hour drive to the resort with a cooler full of Red Stripes and other beverages....could not have been better.", "title": "Beyond all expectations", "helpfulness": 1, "user": "Liberty394", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 73594834}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Arrival - Greeted by Oneika and our staff for the week as we exited our vehicle. Cold wash cloth and rum punch....an excellent start. They all escorted us to our villa and welcomed us like we were family.", "title": "Awesome", "helpfulness": 2, "user": "deanclarkeweddings", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72489532}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Villa - Our villa was immaculate. All rooms were exceptionally clean and well decorated. As we toured each room our bags were brought to our bedrooms. All bedrooms are very large with large bathrooms. The living area is huge and the bar well stocked. This villa had a pool table and swimming pool directly on the beach which gave us activities to do when we were done on the beach. The grounds were well kept. Every morning staff was out sweeping the patio, pruning and making sure everything was well kept. The pool was cleaned every day. The furniture was in excellent shape and a high speed computer allowed us to keep up with family at home.", "title": "Very Relaxing Family Vacation", "helpfulness": 1, "user": "mrkpaint", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66748987}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "I have been to Jamaica many times, as it is my parents country, but this particular time has been very lovely. Not only was the location great ( a stone's throw to the beach) but the staff was just awesome.", "title": "Unbelievable service, Outstanding locations", "helpfulness": 2, "user": "kalehia", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23059424, "likes": {"liked": "— the food, service and scenery", "disliked": "— I wish I could have stayed longer"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "They were very friendly and made us real right at home. There was no request too big or small. The villa was cleaned promptly and very spacious and comfortable. The cooking staff was out of site, our group requested several traditional foods each day and each meal was better than the last. All service was accentuated with a smile. I was not able to drink on this trip ( 8 months pregnant) but the staff made special virgin drinks for me with. And everyone else enjoyed drinks from a long list on a drink menu. I can go on and on. But I most of all want to impress upon the wonderful service we got. I would go again again and again. One more thing the car service to the the various locations was excellent. I felt very safe and the drivers were friendly and knowledgeable.", "title": "Paradise is an Understatement", "helpfulness": 1, "user": "hlp132", "date": "December 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22879211, "likes": {"liked": "— EVERYTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "We arrived at Moondance villas and were greeted with smiles and rum punch (i would say that is a great start!) Our party stayed at Satin Sunrise and Ginger Breeze and had an amazing time from 12/10 - 12/15", "title": "I am spoiled!!", "user": "JennyEsq", "date": "December 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22809508, "likes": {"liked": "— The food", "disliked": "— Nothing...it was fabulous"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The VILLAS are emaculate with huge bedrooms, bathrooms and private jacuzzis.", "title": "I am so sad to be back!!! I loved Moondance!!!", "user": "hotgirls1127", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22761529, "likes": {"liked": "— The service!", "disliked": "— Leaving!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The FOOD was amazing. Anything you request from JERK burger to Curry Shrimp to Seafood Fettucini is 5 star quality I ate a lot I MEAN A LOT and everythink was good", "title": "Ginger Breeze/Moon Dance Villas – Perfection Personified", "helpfulness": 4, "user": "HomerRiggins", "date": "August 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19278571, "likes": {"liked": "— Service, Location, Beach, Food", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "After researching locations online for my destination wedding, I decided that the offerings of Moon Dance Villas were too good to pass by. We booked Bay Whisper, one of the 5-bedroom villas, for our party of 10 which included friends and family members. From the get-go everyone associated with MDV from the reservations agent (Miriam) to the wedding/events coordinator (Oneika) was so kind and accommodating. Every request was \"no problem\" and we had a fantastic vacation and dream wedding.", "title": "Perfect", "helpfulness": 1, "user": "RSOHara", "date": "May 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64844544}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The bus that was sent to pick us up had complimentary beer and water, and upon arrival we were greeted with smiling faces and rum punch for all. The accommodations themselves are spectacular. Our 5000sq ft villa was a dream home, with everything we could have needed and more. I cannot say enough about the MDV staff, who really make this place so incredible. Our chef, Robert, created incredible meals to suit all tastes; our bartender/server extraordinaire was Wendy, who always had a smile on her face and we all took to her instantly. I was really impressed with the fact that we had the same staff members for the duration of our weeklong stay, as we were able to get to know each of them better and feel very comfortable having them around. Truly lovely people.", "title": "This was the place for our dream honeymoon!!", "helpfulness": 1, "user": "mdcuite", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53054244}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We booked all outings and activities through MDV, and were not disappointed. The snorkeling, shopping trips, and sunset catamaran cruise were all so much fun, and we always felt very safe and at ease. We really spent a lot of time on the beach, so it was great to have on-site security at all times to help keep vendors at bay without feeling like we were being guarded at all.", "title": "Beautiful wedding, just watch the bugs!", "helpfulness": 3, "user": "Redline5004", "date": "July 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35013779}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I worked with Oneika for months in advance of our trip via e-mail to ensure that our wedding was totally personalized. I really cannot express what a wonderful job she does - our big day was absolute perfection because of her. The decorations, the atmosphere, the food, etc... everything was beyond what I had hoped for. The additional costs for things like a hand-made arch and covered chairs were very reasonable, and ended up being even less than anticipated.", "title": "Fairy Tale Wedding for our daughter & new son in law", "helpfulness": 2, "user": "sjaRochester_NY", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34524439}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "One thing that I would recommend to most is to opt-out of the all-inclusive package (unless you really eat and drink a LOT)... we ate 3 full meals a day and had several drinks each daily and at the end of the week we each only paid about $45 per day for food and drinks! They base the cost of meals/drinks on the actual cost of the groceries needed to make the food, and we couldn't believe how inexpensive it was.", "title": "The Perfect spot for the Perfect Wedding", "helpfulness": 2, "user": "jplumb1221", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31248607}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My family of 4 just returned from staying in the 3 bedroom villa “Dream Walk”. The entire experience from booking directly with Moondance to the final send off from the resort was FIRST CLASS.", "title": "A Families Dream Vacation", "helpfulness": 2, "user": "Bgiants", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17266882, "likes": {"liked": "— Staff, Accomodations, Food, Beach", "disliked": "— We had to go home."}}, {"rating": 5.0, "title": "Loved Moondance Villas", "text": "There was exceptional email correspondence leading up to the trip and they took all of our requests and turned this into a dream vacation. Our staff in the villa was exceptional and we now feel like we have extended family in Jamaica – more on this later.", "helpfulness": 5, "user": "ocm", "date": "April 25, 2008", "id": 15364356}, {"rating": 5.0, "title": "FANTASTIC SERVICE!!!", "text": "Booking – booking was easy through their quick responding staff of Miriam and Kim. Every email was answered and all questions that they could not directly answer was researched and answered quickly.", "helpfulness": 3, "user": "amy-mcquillen", "date": "April 11, 2008", "id": 14955537}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Transport – A private transfer outside of the airport was arranged for us. Our flight arrived 10 minutes early and we could not find our driver. There are many taxi’s and transfers waiting outside with signs for each resort. We did not see the Moondance driver. I called Moondance directly and spoke with Gary who immediately called the driver who was just turning into the airport at that time. Talk about communication! We were so impressed and put at ease as Dean our driver pulled up in front of us. We acknowledged being early and he was apologetic as he did not foresee this. One of our requests was to have cold beverages available in the van and Dean set us up with plenty. The ride to Negril was smooth, comfortable and Dean answered all of our questions with courtesy and true interest – if the transfer was this good, we couldn’t wait for the resort.", "title": "Perfect for an Extended Family Getaway", "helpfulness": 6, "user": "kimkru", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13153669, "likes": {"liked": "— Feeling Like I'm Living THE High Life!!!", "disliked": "— Sand Fleas"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "First impressions – We were greeted by 4 staff members as we exited the van. Oneika and Gary welcomed us along with a porter and a staff member with smooth tropical punch drinks and a cool cloth. They escorted us to our villa and informed us we would be complementary upgraded to the 3 bedroom villa from the 2 bedroom villa for the week as it was available. You could not believe the warm welcome and true vibes being sent out by the staff. The staff gave a tour of the villa and explained to us that our only job was to relax and enjoy.", "title": "one of the best places we ever stayed in", "helpfulness": 6, "user": "robertford", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12454251, "likes": {"liked": "— Everything - the chef and housekeeper made everything so easy", "disliked": "— Having to go home to winter weather!"}}, {"rating": 5.0, "title": "Go To Aquamoon!", "text": "It all started with a scenic ocean-side drive through from MoBay to Negril with Sparrow, our driver (who supplied us with just enough Red Stripes for our ride). We were greeted at the Aquamoon Villa by the beautiful smile of Isis, the hotel supervisor, upon arrival. We took the option to take care of business first (yes, there was an option). Isis showed us to our Ocean View Suite and we were pleasantly surprised! Besides the awesome view from our balcony, a king-sized bed, air-conditioner that worked wonderfully, double sinks in the bathroom, double showerheads (no dancing around eachother in a small shower!) and a safe - for no extra charge. After getting situated, we peeled off our clothes, jumped into our bathing suits, grabbed an ice-cold Red Stripe at the Lounge @ Aquamoon (tiki-type bar right on the private beach of Aquamoon) and ran (yes, ran) into the picture-perfect water of Jamaica. After that, each day blended together into the perfect, most relaxing, week.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 3, 2006", "id": 4831944}], "location": {"country": "Caribbean"}, "variance": {"poor": 1, "average": 2, "very good": 13, "terrible": 3, "excellent": 103}, "aka": "Moon Dance Villas Hotel Negril", "slim_ranking": 0.0857142857143, "description": "Moon Dance Villas invites you to experience the finest rental accommodations in all of Negril, Jamaica. Beautifully situated on Negril's spectacular 7-Mile Beach, Moon Dance Villas is actually six elegant and incredibly comfortable beach homes. Each offers you the services of its own devoted and delightfully attentive staff: chef, bartender, and housekeeper- all committed to making your Jamaican getaway a truly pleasurable adventure in paradise!"}