{"user_rating": 4.0, "review_count": 667, "name": "Moore Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "We looked for a long time to try and find a reasonably-priced hotel for the 4 nights we would be staying downtown. As you might imagine it is very expensive to stay downtown Seattle. In fact the West Coast has a much higher cost-of-living than Milwaukee. We checked out chain hotels, discount travel sites, and bed-and-breakfasts — but ultimately it was a travel guide (Frommer’s 2005) that suggested The Moore Hotel. It’s 2 blocks from the Public Market and sits on a main street (2nd ave) 1 mile from the train station. It’s 3 blocks southeast to the West Lake bus tunnel and there are literally dozens of cafes / clubs / and shops in every direction. We walked from the Amtrak station to the Hotel with our luggage when we arrived; and we walked from the Hotel to the bus station when we left - ideally situated for use of public transportation.", "title": "...Great value, great location!...", "user": "DanielBakerMKE", "date": "November 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6133661, "likes": {"liked": "— location, value, interesting building", "disliked": "— n/a"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "We opted for the $55/night room which has no bathroom (’european style’). This was half the rate we found even at most ‘discount’ chains. The bathroom was about 10′ from our room and we had our own key - so even though it was not a ‘private’ bathroom, it was never inconvenient. The picture on the Moore website is not one of the european style rooms - ours was much smaller.", "title": "Between Moore or Less, Less...", "user": "roadtripphene", "date": "November 12, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 6111643, "likes": {"liked": "— the location & the kindness of the older front desk clerks", "disliked": "— convenience of amenities, lack of convenient parking, room dreariness, difficult room temperature, sparse furnishings"}}, {"rating": 4.0, "title": "Even Better The Second Time", "text": "The hotel was built around the turn of the [20th] century so there’s a lot of historic details that make it an exciting place to stay - tall ceilings, lots of windows, exposed woodwork, wide hallways. And most (if not all) of the 7 story hotel has been refurbished with new carpeting, fresh paint and retiled floors. In fact, the room we were in had brand new lamps, bed and TV. There is also a phone in each room (dial ‘9′ to get out) and basic cable. The only negative observations about our room were that the sink (all rooms have sinks) had no hot water pressure and Harmonie thought there should have been a full-length mirror and there was no clock.", "user": "HeyAllie", "date": "October 26, 2006", "id": 6014799}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We were on the 7th floor - room 711 to be exact - and were afforded a great view of the Puget Sound and downtown Seattle. I’ll upload some movies when I have some extra time so you can get a feel for the layout. I would highly, highly recommend staying here if you’re ever in Seattle - and ask specifically for room 711 as some of rooms are in-facing (there’s a kind of a ‘courtyard’ space running up the center of the hotel so that in-facing rooms can open to the fresh air… but it’s not a pretty view) and some of the south-facing rooms are on an alley.", "title": "Not Bad For The Price", "user": "JohnandSandy", "date": "October 25, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6012436, "likes": {"liked": "— Location and good value.", "disliked": "— Simple and basic rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "There is also 1 public-use internet terminal and wireless access in the lobby. The workers were very helpful with suggestions and they provide a big rack of literature for tourist-y things-to-do. The clientele seems quite mixed, with a lot of younger / international travelers as well as some older. I didn’t see any families. There is no pool or arcade, but there is an adjoining lounge/bar and theatre (which was, unfortunately, playing ‘Annie’ while we were there) which gets touring bands every now-and-then. Also there’s no breakfast or coffee. There is also an elevator for those that don’t like walking up seven flights of old-timey stairs.", "title": "A Seattle Gem", "user": "alaskacb", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5814218, "likes": {"liked": "— location", "disliked": "— parking"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Great hotel. Clean and reasonably priced with friendly, helpful staff who made good recommendations for bars, restaurants, etc. Amazing location for market and waterfront, and very atmospheric. If you want something well-located, well-priced, and characterful as a base to explore Seattle, I'd recommend it wholeheartedly.", "title": "Great hotel", "helpfulness": 2, "user": "cornwallchar", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150122307}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I used to live in downtown Seattle for about 8 years and lived in WA state for a total of 30 years. I've since moved and wanted to find a hotel in a good location that was \"cheap\" for Seattle as I come back at least once a year or more to visit friends and family. I found this hotel and the very first time my hubby and I stayed there, we loved it! So close to everything and so cheap. Well, with each time we stayed there again, the service went from \"decent\", at best, to horrible and downright rude. The last time around, my hubby called down to the front desk at 8:30am on a Saturday for some help as our toilet wouldn't flush. He was immediately told that we can't expect service at the crack of dawn! I think they forgot that they are in the hospitality business. They basically told us to use the toilet down the hall and someone would handle it when \"they get here\".", "title": "Bad service for the last time", "helpfulness": 4, "user": "exseattlelite", "date": "January 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 149765046}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Beyond that, my hubby went to open the curtains and one side of the rod came completely off in his hand which he proceeded to fix himself since, god forbid, we expect them to do it for us. Then the batteries were dead in our TV remote and when I stopped at the front desk, the lady was hesitant to give me new ones because I couldn't tell her the exact remote control we had in our room from memory (color of remote and layout of buttons plus TV make/model). Why would that even matter?", "title": "Great staffs extremely friendly", "user": "Sxc14a89", "date": "January 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149623157}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I found myself wondering why we continue to book rooms there when there is an equally good hotel in the Queen Anne area for the same price but much, much nicer with really friendly staff? That stay was our last. Adios Moore Hotel! Hopefully you don't have to close your doors in the future in such a great \"Seattle institution\" due to your utterly awful customer service.", "title": "Great hotel..", "helpfulness": 1, "user": "joytotravel1", "date": "December 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147382816}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Everyone who works in this hotel is so nice especially the guy who works at the front desk this place is extremely clean and u get more than what u pay for. U won't regret it. I highly recommend this place and if I ever comes back to Seattle this is the place for me to stay again", "title": "A great hotel. Right on the 50 yard line of downtown Seattle", "helpfulness": 4, "user": "canadianvisitor99", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146777033}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We studied other reviews before booking this hotel. And we felt it would be a small gamble. It was not a gamble at all. This was a great hotel, especially considering the price.", "title": "Great price, friendly staff, close to attractions", "user": "Brianne E", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146027360}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We had traveled for 12 hours by the time we got to the hotel and it was only 1pm. We knew they would store our luggage so we could enjoy the sites. But I was so exhausted, I asked if we could check in early (3 hours early) and they accommodated us on the spot. Wow, this has never happened at any other hotel I have asked. Maybe we just looked that exhausted and they felt bad for us. Either way, I was delighted.", "title": "Good location, decent price", "user": "caramlefloat", "date": "November 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145618298}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The hotel room was plenty big and they turned on the heat in the evenings (thank goodness). The hotel is less than 5 minutes walking from Pike's Place. We walked there every morning and it was easy to get to all the attractions from here. It was a safe neighborhood. Although, I must say I am not used to seeing pedestrians light up joints right in front of me, but I didn't mind it too much and it didn't make me feel unsafe.", "title": "Absolutely great value; decent accommodation", "helpfulness": 1, "user": "readerwalker", "date": "November 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145441332}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Overall, great hotel. I didn't feel like they skimped on anything especially considering the price.", "title": "I really wanted to like it.", "helpfulness": 4, "user": "sleevesend", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 144762007}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location of the Moore Hotel is pretty good, and my primary reason for choosing this hotel over others. It is a short walk to the Westlake station for the Light Link as well as other bus routes. It is only a two blocks walk to Pike Place Market and about 4 blocks to the waterfront for seafood and ferry rides.", "title": "Moore for less...", "user": "Alex W", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144751122}, {"rating": 4.0, "title": "The Moore - location, location, location....", "text": "The Moore Hotel is an older building, yet scrupulously cleaned and maintained. The staff were very helpful and courteous. The prices were great. However, its chief advantage is its location. At the corner of 2nd St. and Virgininia, it is only two blocks from Pike Place Mkt! It is also within easy walking distance of the Convention Center area. One block either way puts you on major city bus lines to connect to the stadiums to the south, or the Space Needle to the north. Airport transportation via the Shuttle Express vans drops you off/picks you up at the door of the moore for a great price. Two cruise lines dock at the waterfront directly below the Moore, but HAL and RCL dock closer to the Pioneer Square area. We stayed two nights pre-cruise, and two nights post-cruise at the Moore and felt it was a bargain. I would advist to request the upper floors, as street noise was noticeable in our room on the fourth floor. Also be aware that there is no air conditioning, but this was not a problem at all during our stay in August, 2006. If you want luxury and pampering this is not the place for you. However, for a clean room at a great price and in a great location, the Moore is the place. I would definitely stay there again.", "helpfulness": 3, "user": "HazeGray", "date": "August 18, 2006", "id": 5623382}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed here for 1 night in August and it was a good deal. We saved money staying in one of their shared bath suites. Convieniently, the room had its own sink. The room was clean but bare of any decoration.", "title": "Good value", "helpfulness": 4, "user": "Kleeart", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5607485, "likes": {"liked": "— Location", "disliked": "— Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The shared bath was a little uncomfortable to use. You had to walk up a tiled step before getting into the tub and there were no bath matts. There was no space near the tub to hang a towel.", "title": "No-frills, but you can't do better for the money! Loved it.", "helpfulness": 6, "user": "sourpuss", "date": "August 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5589917, "likes": {"liked": "— Proximity to EVERYTHING.", "disliked": "— Shared bathroom option."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "We shut the window in the evening because of the noise from the street but when we turned on the fan it was even louder and I had to sleep with earplugs. This was actually not too big of a deal.", "title": "Quirky and Friendly Place to Stay", "helpfulness": 6, "user": "Musictraveller", "date": "August 4, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 5560470, "likes": {"liked": "— Location", "disliked": "— Disorganized Check-in"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The staff was very nice and helpful. They recommended a nearby grocery store for late night sweets.", "title": "Wow!!!", "helpfulness": 6, "user": "GretchenDeFlorio", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5508003, "likes": {"liked": "— room size, location, price", "disliked": "— get a suite"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "Is it spartan and dated: charmingly yes! So for the traveler who appreciates a clean, classic hotel in a prime, downtown Seattle location, this is for you. We've twice chosen the Moore for a pre-cruise stay with our kids in a suite of two conjoined rooms seperated by the bathroom.", "title": "Don't overlook the Moore", "user": "gitchigammi", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5811391}, {"rating": 1.0, "title": "The rudest people ever - dont stay!!!!!!", "text": "It's right downtown, so there is typical noise from trucks/sirens; but the beds were comfortable and showed no sign of bugs as others claimed. My only caution is to use the same ordinary caution outside as you would in any urban area after dark. The staff is incredibly cool, accomodating and provide free internet access in the lobby to check email, etc.", "user": "hudbug", "date": "September 17, 2006", "id": 5811189}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I have recommended this hotel to like minded frugal friends and look forward to the next time we visit Seattle for another stay at the Moore.", "title": "Bed Bugs!", "user": "steeny123", "date": "September 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5778939, "likes": {"liked": "— location", "disliked": "— bed bugs"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "Despite the fact that this could be a very cool hotel, the place sucks. The front desk, one of the nights we were there, was run by one of the rudest people I have ever met. I will not name him, but when we had a problem with our room, he was extremely rude and would not hear our issue. Very, very dissapointed.", "title": "Can't beat the price if you like to rough it.", "user": "lynnpr", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5724517, "likes": {"liked": "— location", "disliked": "— The hallways, the room, the location all beat up. No screen on window, no air (I knew this before)"}}, {"rating": 4.0, "title": "budget place with character", "text": "My boyfriend and I stayed here from Sept 2-5. We usually stay at the Springhill Suites Marriott, but decided to go the budget route. A co-worker recommended this hotel knowing I wouldn't mind the lack of amenities (bring your own soap etc.), or the poor shape it's in. I have to say I wish I'd stretched the budget.", "user": "wrldtrvlr2", "date": "August 22, 2006", "id": 5700717}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I thank previous reviewers for their helpful comments. Below I will just add my two-cents worth after a week's stay there recently.", "title": "Good, but not for everyone.", "helpfulness": 15, "user": "AGTraveller", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150969450}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "1. The location is fantastic. Pike's Place is truly a short walk away. (Friendly advice for the non-athletic: walk a few blocks on 2nd avenue and go down to the market on Pike Avenue to avoid the steep downhill walk on Virginia or Stewart). By the way, the aquarium and Elliot's Oyster House can be gotten to through Pike's Place, via an elevator.", "title": "Not bad, not great", "helpfulness": 5, "user": "Radmen", "date": "January 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 150803379}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "2. There is a City Target on Pike Avenue and 3rd, where you can get daily supplies such as paper goods and lotions -- at big city price, unfortunately.", "title": "anniversary", "user": "Jessica T", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150543509}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "3. Pay a little extra and book ahead for a suite. The unit that we stayed in was like a little apartment, with two refrigerators, a coffee maker, a microwave and even two small electric stove ranges (that heat up SLOWLY).", "title": "location only", "helpfulness": 2, "user": "will f", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 150436482}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "4. With a suite, you get a private bath. Here is one of the big minuses: there is a claw-foot bathtub in the bathroom, but nothing to stop the water with, so it seems to be set up for a shower. But the tub is only partially enclosed with flimsy shower curtains. On the cold days when we were there, I had to use only the hot water tap (and nothing from the cold water tap) for the temperature that I can stand, and the water flow was, as a result, minimal.", "title": "Perfect for concert lodging or pub crawl.", "user": "firewalkwithmelissa", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150214706}, {"rating": 3.0, "title": "Moore is just okay", "text": "The next morning we saw another bed bug crawling around on the wall next to the bed we just slept in. We took our dead bed bugs downstairs and spoke with Mike (the manager). He was apologetic and claimed this was the first he'd heard of bed bugs in the Moore. We were booked to stay a third night, but were planning on going elsewhere. Mike said he'd help us out with the bill and find us another room so we decided to stay.", "helpfulness": 3, "user": "denvernicole", "date": "August 21, 2006", "id": 5661558}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We really enjoyed out stay in the Moore Hotel. The staff is so friendly and helpful. It was so close to all the tourist attractions that we could walk. The beds were comfortable and the room was quiet. I will stay there again.", "title": "Friendly and unique", "user": "Joy N", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144603182}, {"rating": 4.0, "title": "Clean, good value and location.", "text": "We stayed in 718 and were quite happy. Very clean and nicely decorated. Staff was friendly and helpful. We walked everywhere from here. Coffee at the \"Moore Coffee\" was excellent. Happy hour nachos & steak tacos next door at the \"Nitelite\" were good. I'd stay here again.", "user": "Bobbie B", "date": "October 29, 2012", "id": 144035965}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I have stayed at the Moore Hotel three times now and it has always been a great experience. Its location is great if you are in town for shopping or just seeing the sights. Only a few blocks from Pike Place Market and a few more to Alaskan Way. Go east a few blocks and you are at Macy's and the downtown mall area.", "title": "Always my first choice in Seattle", "helpfulness": 2, "user": "DragonKaty", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143739088}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Moore is a budget hotel, but not too budget-y (if you get me). The furnishings are dated, television only has a few channels and elevator is slow and tiny, still the bed is nicely firm and bedding clean and well taken care of. Some of the rooms have a toilet and shower, while others are shared (only stayed in one of those once; either get up early or sleep in as it is hard to in the shower right on time).", "title": "Value for Location", "user": "Terri T", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143578643}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There is a little bar downstairs where you can get food, but I would suggest you head over to Virginia st. and eat at the wonderful Argentinian steak house (tango demonstrations on the weekend). They recently added a coffee bar too (this IS Seattle after all), and that I do highly recommend. Amazing lattes and the pastries are wonderful.", "title": "Worth the money", "user": "Moonbaer", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143221609}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Felt like a weekend away from the wife and kids (more wife than kids to be honest- I know she wont read this !!) Chose Seattle to do this, as its within easy reach of my hometown Vancouver.", "title": "Noisy but good value", "user": "Soutie", "date": "May 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7552782, "likes": {"liked": "— location", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Decided on the Moore Hotel,downtown as I'm both thrifty and poor and on reading previous reviews, seemed to suit my budget. Also as I was staying only one night-how bad could it be.", "title": "quirky, great value", "user": "LeftcoastCanadian", "date": "May 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7552776, "likes": {"liked": "— location", "disliked": "— controlling heat in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "On first look at the place from the outside ,I knew it wasnt going to be Buckingham Palace.The lobby is pretty spartan,the desk clerk on duty pretty friendly-one guy in front of me at check in", "title": "Good value", "helpfulness": 7, "user": "Shirley_Lincicum", "date": "February 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6800830, "likes": {"liked": "— Price", "disliked": "— Water pressure and temperature regulation in shower"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "was turned away as place was full-so book ahead.", "title": "Not pleased.", "helpfulness": 3, "user": "EntourageMember", "date": "December 5, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 6333093, "likes": {"liked": "— Location", "disliked": "— Horrendous customer service on the part of one staff member"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "This is a fantastic value for the money! I hesitated before trying it because of the negative reviews, but in my experience a 3.5 average TripAdvisor works for me, so I went for it. The only way one could be disappointed with this place is by having unrealistic expectations.", "title": "Great value, no frills but no surprises either", "user": "starstar73", "date": "May 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7670228, "likes": {"liked": "— Value for $, location, cleanliness, sunny lobby w/internet access", "disliked": "— The ugly decor and poor TV reception, which I don't care about but I'm sure other people do"}}], "location": {"country": "United States", "city": "Seattle"}, "variance": {"poor": 30, "average": 105, "very good": 322, "terrible": 25, "excellent": 185}, "aka": "Moore Hotel Seattle", "slim_ranking": 0.52688172043, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}