{"user_rating": 4.5, "review_count": 902, "name": "Moorea Pearl Resort & Spa", "reviews": [{"rating": 5.0, "title": "nice middle of the road hotel at delux prices", "text": "We recently stayed at the Moorea Pearl and found it to be a nice property but no where in the same league as the properties in Bora Bora. We had an over the water bungaloo which was very nice. The food at the hotel was good. Overall, it seemed like it was probably the nicest hotel on Moorea with the exception of the Intercontinental which was a much larger more plush resort although we did not see the rooms there. The island itself of Moorea is much more plush and interesting than Bora Bora and you could probably do much better on purchases such as pearls since it is only a ferry ride from tahiti. Had fairly consistently poor service from many of the local reastruants who seemed to cater much more to the French nationals which proved to be very annoying. But overall, nice hotel on a beautiful island, possibly the most beautiful in the world.", "user": "scottsdaletraveler", "date": "March 30, 2005", "id": 3312022}, {"rating": 4.0, "title": "Very nice hotel, great bungalow", "text": "We stayed at the Pearl on Moorea for 4 nights. It was a very nice hotel and the overwater bungalow was beautiful. The staff could have been nicer, they didn't speak good english and it would have been nice if the restaurant help smiled occasionally. But that seemed to be the general attitude of most of the people on this island. One exception was Yves who managed the restaurant and bar - he was very friendly with a wonderful smile. The food was very good. After Moorea we went to Bora Bora which is much more beautiful and the people are much nicer. But I would recommend the Pearl if you are staying on Moorea.", "user": "megandg", "date": "February 21, 2005", "id": 3214894}, {"rating": 4.0, "title": "Pearl of Moorea", "text": "Moorea was a beautiful island, and we thoroughly enjoyed our week long stay for our honeymoon at the Pearl last June.", "user": "Jolie", "date": "February 12, 2005", "id": 3181851}, {"rating": 5.0, "title": "Our favorite", "text": "We arrived rather hot and flustered from Papeete having waited for the catamaran for ages at the ferry dock before it arrived so the orange juice was a welcome. However we were told at the reception that our Garden bungalow was not ready, and we can either wait at the bar or walk down to the village about 5 minutes away. This was at one in the afternoon, and our room was still not ready?", "user": "A TripAdvisor user", "date": "November 5, 2004", "id": 2807336}, {"rating": 4.0, "title": "Nice Snorkelling and Good Breakfast", "text": "The hotel receptionist then gave us a copy of the map, and walk around showing us where everything was. We decided then to take a walk to the village and have our lunch. It's rather expensive for a cheeseburger but we have expected this from Tahiti.", "user": "Seneca21", "date": "October 24, 2004", "id": 2782897}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 31, "average": 76, "very good": 296, "terrible": 19, "excellent": 480}, "aka": "Moorea Pearl Hotel Maharepa", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Moorea Pearl Resort & Spa nestles on the island shore, just by the village of Maharepa in an ideal location, between the majestic Cook’s Bay and the Gulf of Moorea. It’s very convenient, at just 10 minutes from the airport and 15 minutes from the ferry terminal, and with boutiques, restaurants and a small shopping center close at hand. The style of the resort is a tasteful combination of the traditional and the contemporary with a powerful sense of Polynesia. There are 28 over-water bungalows built over the lagoon on piles, 8 more bungalows on the beach and 28 spread through the beautiful grounds with their own private pools and little gardens. The remaining 22 rooms and 8 duplexes of this 94-unit resort are in a small building. Whichever accommodation you choose, you will have air-conditioned comfort (the bungalows also have ceiling fans), an outside terrace, mini-bar, hairdryer, safe, flat-screen television and DVD player, I-pod dock and WiFi. From your hotel base we will be happy to arrange a full range of exciting excursions and activities and of course you can relax at the resort where you’ll enjoy one of the largest infinity pools of the island. Each bungalow has a sunny outside terrace with comfortable loungers. From the over-water ones, there is direct access to the lagoon. The premium over-water bungalows are especially well situated, close to the coral reef ledge so you can immediately swim off and discover a fascinating world of colored fish and exotic corals. Near the over-water bungalows, we have developed our own coral nursery- To’A Nui - a coral regeneration project and part of our commitment to protecting the fragile environment that surrounds us. This site encourages the proliferation of marine life whose beauty is so easily enjoyed with simple snorkeling equipment. You will find a luxurious and convivial resort on a human scale, offering a warm welcome to honeymooners,romantic couples, families, nature lovers and scuba-divers. We have two restaurants - The Mahanai - and the acclaimed gourmet restaurant - The Matiehani. The Autera’a is a perfect terrace bar for sipping your favorite beverage. Other facilities include a bar, two meeting rooms, a boutique and a full range of activities and excursions both on land and on the water. We also have a dive center, a Polynesian tattoo facility and a spa. The Manea Spa specializes in massages and treatments using traditional Polynesian methods and 100% natural products from the island’s flowers and plants, including the famous monoi oils from the coconut palm. Thespa has a hammam, Jacuzzi and the «Rumi Ãvai» where you can discover the pleasures of our unique aquatic massages."}