{"user_rating": 4.5, "review_count": 1094, "name": "Morgans New York Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Within easy walking distance of Grand Central, this place was perfect for us. Our room was small but well laid out. I have never had such quiet room in NYC. But the breakfast was the best -- in a beautiful penthouse w a spectacular view of the Empire State Building, with luscious croissants, granola, faje yogurt. In good weather you can eat outside. Midtown isn't the best location for all visits, but it was ideal for us this time and we were delighted w Morgans.", "title": "Convenient, friendly and a great b'fast!", "user": "buster77", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150352533}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This was our first time in New York we came for the new year. We were so lucky to find this hotel, it was amazing. All of the staff were extremely helpful and friendly. The rooms were spotless and the beds were very comfortable (just what you need after walking around NYC all day). Breakfast was basic pastries and the best blueberry muffins!!! Tea and coffee was available all day and the view from the penthouse (where breakfast is served) is fantastic. We were disturbed one night due to people being loud in another room. We informed the staff and this was resolved immediately, we also received a bottle of wine from Morgan's to apologise which was a lovely gesture thank you. The location is fantastic, very central. Overall a fantastic stay I have already recommended this hotel to friend planning a trip to New York for October. We'll definitely be back!", "title": "Fantastic Hotel", "helpfulness": 2, "user": "lmcc87", "date": "January 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150024677}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This was out fourth trip to NYC and hands down Morgans wins - previous hotels were Hotel Chandler, Dream, W Times Square.", "title": "Best Hotel in NYC!", "helpfulness": 1, "user": "1983Sarah", "date": "January 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 149816670}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The biggest thing first up is the amazing service in particular Rob the manager who helped us no end when we first arrived and throughout with restaurant recommendations and bookings. Also Scott who was the best hotel doorman I've ever met - helpful, friendly and genuinely interested in us", "title": "New York for Christmas", "user": "decdeasy", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149793412}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had a slight mix up with rooms upon arriving but were upgraded to a suite for our stay which given it was both out birthdays whilst we were away was an absolutely brilliant treat.", "title": "I will be back ...", "user": "PolarLawyer", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149769486}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Scenario: Blizzard in NY and need to get to three appointments in one day. The Morgan was perfect in regards to location, staff, service and style. The front desk is effortless and professional whereby booking another night was a breeze and kept the same rate. The rest of the staff is friendly and courteous. The Hotel is quiet and peaceful and my standard room was perfect in that it had aire of calmness and tranquility in its grey hues. On a high floor I had large amount of natural light and the room was spotless. The bar is being renovated but the penthouse was opened for breakfast and evening a drink which is sublime with patios and view of the city. The Morgan is a classic and hope never changes.", "title": "NYC Classic still my number one", "helpfulness": 1, "user": "sastudio", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152066679}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was our second stay at Morgan's and it was every bit as good as the first. Now that the lobby is again the reception area, there are helpful staff members to answer questions and help with the heavy exterior doors. Our room was to the back as before, and quieter than ever. The room is well-appointed and we upgraded to the next larger size room for more space. The bed is comfortable and housekeeping is very quiet in the morning. The breakfast is delightful and we are so glad they turned off CNN to better appreciate the ambiance. This won't be our last stay at Morgan's. It's our new go-to hotel in NYC.", "title": "Keeps getting better", "user": "Tripfantastic", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151988727}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Where to begin??? On the positive end, the hotels is in a great location,most of the staff were very personable and friendly.", "title": "our worst experience in recent memory!!!", "helpfulness": 1, "user": "lisa3", "date": "February 12, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 151973323}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Negatives...we found the beds/ pillows to be uncomfortable/ and the quality of the linens used not very good... we asked 3 days in a row to have the clock in our room, that didn't work, to be replaced/changed...we finally brought it to the front desk ourselves...we had an issue with incorrect credit card charges that we are still dealing with (i.e.we had overcharges on our cards and refunds put on credit card that was not ours),we got locked out of our room on New Years Eve...when we went to the front desk to have the room key cards reset there was no apology or \"sorry for the mistake\" from the woman on duty...", "title": "Un petit bijou: Comfortable, douillet et central", "user": "Jean R", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151931978}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "also, the hotel general manager was never there or available during our stay...would not return or recommend this hotel", "title": "Fantastic boutique hotel in midtown", "user": "Susan L", "date": "February 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151836278}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Having lost power in CT, I arrived in NY way ahead of schedule for the opening night of an art show. The staff welcomed me and arranged for me to wait in the Penthouse while they found me an available room. Within the hour I was in my room. During the stay the staff was extremely helpful with dinner suggestions. I was always addressed by name each time I entered the lobby and was made to feel like a valued client. Always a treat to get a reservation at this boutique hotel.", "title": "Modest price for luxurious digs", "user": "Artbrut", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151766324}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We booked Morgan's for a trip to New York for site seeing and shopping and boy were we glad we did!", "title": "A piece of heaven on Madison", "helpfulness": 1, "user": "Shane B", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151750317}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "From the moment we checked in it was a great experience. The room was modern and clean with a lovely view of Madison/ the Empire State. It also had thoughtful touches such as a worldwide travel adaptor and an iPod docking station. The room was only standard, but was quiet spacious for New York standards.", "title": "Friendly service / top roof breakfast room / Convenient location", "user": "vesnaileto", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 151434562}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The living room was also open to all guests and had complementary wifi. Breakfast was also complementary and was served in the penthouse with stunning views of the Empire State Building and downtown manhattan.", "title": "A well placed Hotel - Where nothing is too much Trouble.", "helpfulness": 1, "user": "JackieH061", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151081211}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The staff were very friendly and we were always greeted with a warm welcome when we returned and the door was also opened for us. We were also allowed to keep our suitcases in the hotel for the day after we checked out. We were also told we could make use of the bathroom in the living room to freshen up should we need to. Something we both felt was a lovely touch.", "title": "Truly great hotel in New York", "helpfulness": 1, "user": "Matteo B", "date": "January 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151050223}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have returned from 4 days in NYC and a great stay at this hotel. I was worried when I booked this hotel that it would be out of the way but having stayed on Times square on a previous visit it was worth the 15min walk to experience the lower half of the city. On arrival you are met with a small area housing the reception and staff. I had a problem with the room I had booked but the wonderful staff-Todd and I'm sorry I can't remember the lady's name were brilliant in moving us to another room which meant we didn't need to move hotels. The bed was one of the most comfortable we have stayed in I have never slept straight away but here we did helped by the Egyptian cotton bed linen. The Superior Queen room was a perfect size. I really don't understand what some people expect when they complain about the breakfast. NEWS PEOPLE!! NYC doesn't normally provide this so don't book this hotel then complain that it isn't a full English. It states quite clearly that it is bagles/toast/yoghurt/juice/pastries. If you don't want this go somewhere else we loved early mornings having breakfast looking at the Empire State building-plus free wi-fi for booking seats and printing boarding cards.The only reason this hasn't had 5 stars is down to renovations going on and the tired looking carpet in the halls. Congrats to all the staff who made our stay so special nothing was too much trouble and a BIG THANKS TO TODD for making my husbands birthday such a memorable one. Well done everyone.", "title": "Wonderful staff but stop complaining about the breakfast !", "helpfulness": 4, "user": "booklady58", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150947238}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have just returned from an amazing 1 weeks stay at Morgans and it was fabulous. Everything from the hotel to the staff to the facilities made it perfect. It was my first visit to New York (hubby had been before), definitely want to go back and really want to stay at Morgans again. We took a cab from the airport and after reading reviews had told the driver there was not a hotel sign but to look out for the number and he found it fine.", "title": "Absolutely perfect!", "helpfulness": 4, "user": "JojaTheGreek", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150927952}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Check-in was quick and smooth, the staff were very friendly and explained how to get onto the hotel’s free wifi (very handy), breakfast times, the penthouse lounge etc and also explained we had been given a complimentary upgrade which was super, thanks very much and very greatly appreciated! The porter assisted us with our luggage and was also very friendly. I also liked the fact that he (and actually all staff at the hotel) was completely unexpectant of a tip and was leaving the room straight away, ie. not hinting or waiting expectantly for a tip. We did stop him to tip him, but it was very refreshing that at the hotel a tip was not “pressured” or “expected” or “hinted at”.", "title": "A forgettable hotel but memorable for the wrong reasons", "helpfulness": 3, "user": "shadeseeker83", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150485058}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The room was fantastic and very large and spacious. We could just about see the Empire State building from the room which was amazing! There was lots of cupboard space, 2 sofas in the window area and a super comfortable bed. I also love that there were lovely bath robes and an umbrella in the wardrobe for use while we were staying there. There was also a docking station to play music from an iPod but we didn’t use it. I loved the bathroom décor with the black and white tiles and the chrome sink and the toiletries provided were really nice. The shower was fab, nice and big with great water pressure and the choice of 2 different shower heads. The room was spotless and was cleaned well throughout our stay and toiletries replaced daily.", "title": "Very comfortable stay! Great Hotel!", "helpfulness": 1, "user": "str8foward", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150396241}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Something that made the hotel very special was being able to use the penthouse lounge. The view was stunning and having breakfast there or chilling out with a hot drink in the evenings admiring the city and the Empire State building was brilliant. Breakfast was really nice, lots of different pastries (really great muffins), bagels, bread, cereals, yogurt and jams. It was really convenient (and cost saving) to have breakfast at the hotel and really kept us going well for all the sightseeing and shopping before lunch (hotel location is perfect as not right in the middle of everything so nice and quiet but close enough to walk everywhere). It was also nice to have hot drinks and water available in the lounge after breakfast too, us Europeans do like to drink a lot of tea and was so nice to be able to come back and have a cuppa or two in the evenings.", "title": "Delightfully unique and genuine!", "helpfulness": 2, "user": "emmalouklues", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150368823}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 29, "average": 79, "very good": 325, "terrible": 7, "excellent": 654}, "aka": "Morgans Hotel New York City", "slim_ranking": 0.155756207675, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Boutique hotel housed in elegant columned building dating from 1926 - 3 blocks to Empire State Building. Morgans offers complimentary wireless internet access to every hotel guest."}