{"user_rating": 4.0, "review_count": 105, "name": "Motel 6 York North", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We have used this hotel various times. The staff is always friendly and the rooms clean.", "title": "Nice place to stay when in York.", "helpfulness": 2, "user": "rav4mom", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124499192}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "York, Pennsylvania is an interesting American town. Home to a Harley Davidson factory AND to several model railroad shows every year. We did the pleasant drive up I-83 for one of these shows. Although only a couple of hours from home, we stayed overnight in this reasonably priced.pet-friendly Red Roof Inn.", "title": "Staying Overnight in York and need a Pet Friendly Motel? THIS is it!", "helpfulness": 3, "user": "aky13", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123449487}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We had requested and were given a room with a king-size bed. I was little apprehensive, because the room faced U.S. Route 30 (Arsenal Road on that stretch). This is a MAJOR route across Southern Pennsylvania. I was allowed to check out the room before we moved into it. The road noise was only barely discernible and did NOT disturb either of us. The room was spotless, spacious and comfortable with free Wi-Fi and cable TV (although we did not watch much TV) including several premium movie channels. The bed was comfortable.", "title": "excellent value for the price", "helpfulness": 2, "user": "Jerry T", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 122434246}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "This motel is extremely well located, just off the Route 30/Arsenal Road exit of I-83. It is perhaps 10-12 minutes away from the York Expo Center; close to the Wolfgang Chocolate Factory, that - I believe - gives free tours. We did NOT go this time. Next time we will.", "title": "Good room, poor sleep!", "helpfulness": 3, "user": "2seniorcitizens", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122326048}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The motel is pet friendly and does NOT charge extra for your furry friend. There are a couple of grassy areas, notably behind the motel, for walking purposes.", "title": "Clean and well maintain", "helpfulness": 2, "user": "kwilli12", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122262600}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have never stayed at Red Roof Inns and decided to give this one a try based on the great reviews here. This was a wonderful surprise. In my mind, Red Roof Inn is a low-end, shabby chain, but this particular hotel was fantastic. The room we got (Room 318) was extremely clean, spacious, and looked recently updated. Check-in was a breeze, with a very pleasant front desk lady that was also really sweet to our puppy. The bathroom, though small, had a great shower with good water pressure. We paid around $70 for the king room -- what an amazing bargain! Wish all hotels were all this great.", "title": "Clean, great value hotel", "helpfulness": 3, "user": "absolute_alex", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115738912}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have never r seriously considered staying at a Red Roof Inn as I thought they were sort of run down and dirty. Clearly, at least when it comes to this Red Roof and the one Wilkes Barre I was wrong. Both hotels were clean, nicely appointed, quiet and had very great service.", "title": "Nicely Surprised", "helpfulness": 3, "user": "djo100", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115736517}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I agree wholeheartedly with the positive reviews for this hotel. Considering the price (less than $50 Senior Rate), it is a huge bargain for the quality received, Convenient to I-83 and 5 minutes by car to Downtown York for those attending a York Revolution baseball game as I was. No breakfast, but there is a Hardee's next door and other restaurants within a few blocks. For the room price, I am willing to pay a few dollars for an off site breakfast,", "title": "Good Hotel, Great Price", "helpfulness": 4, "user": "jwpColorado", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 115263580}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "When I called to make a reservation, I was told they served breakfast. I don't feel a coffee/cocoa/tea machine in a corner of the lobby and a small basket of no-name granola bars and cheese crackers qualify as \"breakfast\". . . . . There is a McDs within sight; but that's an added expense and inconvenience.", "title": "Plan on Breakfast at the McDs", "helpfulness": 3, "user": "Travelers-R-US-246", "date": "June 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 114748003}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Be prepared to encounter four-legged guests. There was a dog competition in town the weekend we were there. One, sometimes, two, dogs rode in the elevator every time I used it., and it was a very small elevator. Then there were the barking dogs inside, and outside; with their owners trying to shush them. Guess a word to the wise -- ask if there is any dog competition going on.", "title": "nice surprise", "helpfulness": 4, "user": "maxnana", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101271769}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Like other reviewers, I would not ordinarily stay in a Red Roof Inn, but since the reviews were so positive and the rate was great, my husband and I stayed there. The room was large and clean, and the staff very friendly and helpful.", "title": "I recommend this one", "helpfulness": 2, "user": "Connie R", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118586529}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "They do allow pets there, and when the air conditioner was not on and the room got a bit humid, both my husband and I detected a very slight smell of dog urine.", "title": "Very reasonable rate and nice room.", "user": "JEMPAM", "date": "September 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 118249376}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I was mid-shower when it dawned on me that I hadn't seen a hair dryer in the room. Sure enough, no hair dryer or iron, but you can borrow both from the desk. The ironing board that we borrowed was a table-top size, which is awkward to use.", "title": "Great value", "helpfulness": 3, "user": "Demy181", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117835885}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "They did not have breakfast, but even with going out to breakfast, the rate was less than other hotels in the area.", "title": "Just what we needed", "helpfulness": 2, "user": "andigger", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 117762960}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Lobby smelled of body odor. Late night desk clerk was inattentive. Other than that, our room was very clean and comfortable. Would stay again.", "title": "Great hotel, great price", "helpfulness": 3, "user": "dragracingfan", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115764783}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Red Roof Inn York for two nights (Friday and Saturday) in a non-smoking room (no smell of smoke anywhere). The room is small but it was very clean. The room had a microwave and a small refrigerator. The check in process was quick and easy. The hotel is near many different restaurants (Hardee’s, Denny’s, Olive Garden, Taco Bell, McDonald’s, Arby’s and a diner just to name a few) and also some shopping (CVS, Old Navy, Michael’s Crafts, Weis Grocery Store and a liquor store). It is about 10 minutes from Spring Grove, PA – which is where we were meeting some friends. Beautiful area. Also, very close to Gettysburg, Lancaster and Hershey so the RRI was the perfect location. Just in case, if you need a blow dryer for your hair or a iron/ironing board – bring your own. The room doesn’t have it.", "title": "RRI - York -- More Bang for your Buck!!!", "helpfulness": 2, "user": "seattlelover317", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119957381}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I stayed at the Red Roof Inn York for one night (a Tuesday). I was traveling with two small dogs and had reserved a room with two full beds. I was surprised to find it had a frig and a microwave, which are both really helpful when you are traveling with pets. The room was clean and the bed was very comfortable for a budget hotel. I had a non-smoking room and there was no smoke odor in the room. Check in was quick and easy. There is a free coffee machine in the lobby and you can make tea, too; there are also some vending machines. The hotel has a large grassy area on two sides (it isn't surrounded by parking lots), so even though it is next to an interstate it has a good place to walk your dogs, and has an outside trash can for disposing of poo (you do need to bring your own bags). Bring a flashlight as it is dark in that area at night. Access is a little tricky - if you are coming south on I-83, get off at the exit before Arsenal Road (George Street) - you will have to make a U turn to enter the hotel using the driveway by the Hardees. If you take the next exit onto Arsenal you can only go east, and can't make a legal U turn as easily, but once you turn and are heading west again, the hotel is on the right just past the interstate.", "title": "Good choice in this price range (budget)", "helpfulness": 2, "user": "Calisto18", "date": "October 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119519212}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We needed a place to stay for a last minute weekend trip. We decided to go to Lancaster and Gettysburg, so York was the perfect place. The hotel was great, clean and most importantly cheap. The staff was very nice and the location is perfect!", "title": "Great place to stay at a great price", "helpfulness": 1, "user": "alison k", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119163345}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "we spent 2 nights at the red roof in in york, pa and i will say that it really wasnt too bad for a no frills hotel/motel. the room was clean, bed was comfy, had a frig and microwave. the water pressure in the shower was good too. all in all no complaints for this hotel. dont normally stay here but had smokers in our group so we had to find a place with smoking rooms.", "title": "red roof inn", "helpfulness": 1, "user": "sandycc12", "date": "October 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119154925}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The Red Roof Inn might be easy for a tired traveler to pass by - it is located along a major arterial, adjacent to an interstate, and the building is surrounded by asphalt. The good news is that this place provides solid value for the dollar, especially on stays longer than one night. The interior appears to have been refinished recently, giving the RRI-York a bit of boutique ambience. Don't expect miracles, and you will be satisfied. Clean rooms, decent beds, solid wi-fi, and a reasonably attentive staff. Easy access from I-83 and Route 30/Arsenal Road. State St, provides better in/out access to the property, but requires a U-turn on N. George St. Several restaurants nearby. (Downsides: mild street noise on south side of property, some stains on hallway carpets, \"pet friendly\" dog noise, hit or miss coffee machine in lobby.) Head down N. George St. to the Central Diner for some topnotch southern PA home cookin;.", "title": "Good value for the budget traveler", "helpfulness": 1, "user": "Will N", "date": "October 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 118947649}], "location": {"country": "United States", "city": "York"}, "variance": {"poor": 9, "average": 16, "very good": 39, "terrible": 4, "excellent": 37}, "aka": "Red Roof Inn York Hotel York", "slim_ranking": 0.478260869565, "description": "Motel 6 York North is located off of I-83 at Arsenal Rd/US 30. Restaurants and shops are nearby. Visit the Harley Davidson Plant Museum 1 mile, or York College and PA State University less than 3 miles. Enjoy our free Wi-Fi and truck parking."}