{"user_rating": 4.5, "review_count": 55, "name": "Motel Canadien", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Like most of the other recent reviewers, we were quite concerned when we pulled into the parking lot. The motel is definitely lacking in \"curb appeal\". It didn't help that it was a cold, bleak January day and there were no cars in the lot. However, we were very pleasantly surprised when we saw our room: newly renovated and painted, very clean, electric fireplace, good Wifi, comfortable beds, spotless bathroom - it was perfect for our needs! For $75 (3 people), you can't go wrong! The breakfast room was nice and cozy with good, fresh food. The owners were very friendly and you could tell that they put alot of work into their business. Would definitely recommend this motel.", "title": "Very Pleasant Surprise!", "helpfulness": 7, "user": "sensfan12", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123494155}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "At first glance, this motel had us concerned. The rate was so low ($85 for our family of 5), and it looked like a very old roadside motel, except for the flower boxes under the window sills that gave me some hope that some care had gone into the place. As soon as we entered the reception area in the main building, we could see that great care had gone into redecorating this old motel.", "title": "Don't judge a book by its cover - Bright, Colourful Rooms/Great Value", "helpfulness": 5, "user": "minivanride", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117601556}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The colours were vibrant and something about the decor gave it an air of a tropical resort. The motel room was also nicely painted and the beds had bright, tasteful bedspreads. The bathroom was small, but functional. As the motel is located next to the river, the bugs are quite bad at night, and getting in and out of the room without letting them all in can be problematic. Perhaps this was what a heavy curtain was for that was hung behind the door to the room, but it also kept the door from being opened, so we never quite figured that out.", "title": "Cosy motel", "helpfulness": 3, "user": "ValeriaS_Roma", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117397370}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Service was hard to grade, as we barely saw anyone. In order to get registered, you have to ring a bell to get someone to come to the desk. (I believe they live in the main house) Though friendly, the lady we spoke to knew very little English, and disappeared as soon as we had our key. The next day, at breakfast, another lady popped in, checked on the food situation, said \"Bonjour\", and left.", "title": "Don't judge this book by its cover !", "helpfulness": 3, "user": "Deb B", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116614357}], "location": {"country": "Canada", "city": "Trois-Rivieres"}, "variance": {"poor": 0, "average": 5, "very good": 17, "terrible": 1, "excellent": 32}, "aka": "Motel Canadien Trois-Rivieres, Quebec", "slim_ranking": 0.133333333333}