{"user_rating": 3.5, "review_count": 184, "name": "Motel 6 San Diego Downtown", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2004", "text": "OK place to stay if you want an inexpensive room, but I would not stay again. Actually, we checked-out within 20 mins of arrival because a pipe had ruptured and the water was going to be off until late in the evening. (This was Memorial Day weekend 2004 and we had been on the road since 4:00 am) The room we were in was extremly small and the window's screen was torn along the bottom and half way up each side, and TV only had sound no picture, and I did not see any places to eat close by. Again, if you are on a tight budget or just want a place to sleep this is a fair place to stay.", "title": "Below average Motel 6", "helpfulness": 3, "user": "Catlover4", "date": "June 4, 2004", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 2153089}, {"rating": 4.0, "title": "Great hotel", "text": "We lived here for two nights and it is great. Great location and nice room. Especially it is close to SD zoo and Seaworld.", "helpfulness": 4, "user": "San_Franciscan_101", "date": "April 28, 2004", "id": 1844265}, {"rating": 4.0, "title": "worth consideration", "text": "Stayed here for two midweek nights recently and was completely satisfied. Parking on-site is free and there are two small parking areas adjacent to the property that can be used, however one of them can be pretty tight to navigate when the lot is full... the other lot is set up a little better with regards to that.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 29, 2004", "id": 1750245}, {"rating": 4.0, "title": "Small room, but still good", "text": "Rooms clean and functional. Nice little store next to the motel's front door... within walking distance of gaslamp and such.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 10, 2004", "id": 1545340}], "location": {"country": "United States"}, "variance": {"poor": 18, "average": 45, "very good": 88, "terrible": 11, "excellent": 22}, "aka": "Motel 6 San Diego Downtown Hotel San Diego", "slim_ranking": 0.640740740741}