{"user_rating": 2.0, "review_count": 20, "name": "Motel 6 Woodland", "reviews": [{"rating": 2.0, "title": "Well...", "text": "I often stay with Motel 6, but after booking in this one, I saw a number of bad reviews. I was determined to prove them wrong and write a review after I stayed in this particular Motel 6. The price was good and the phone service was excellent. Check in was fine. When I got to the first room I was assigned, the overhead light didn't work. No big deal. But the toilet would not flush. So I got another room (next door). In this room the toilet flushed but the bathroom smelled horrible. The TV remote feel apart in my hand and the TV would not tune in the stations that the one next door did! So, I slept in one and used the bathroom in the other. It worked but it wasn't great.", "user": "SFGroveland", "date": "December 27, 2008", "id": 23023642}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "When you first pull up it looks like every single other motel 6 that you would see. The office even has a free wifi banner hanging above it in order to get you to come in. Once you get to your room you realize you made a mistake. The room smells somewhat like smoke even though they told you it is a nonsmoking room, but yet there is an ashtray in your room turned upside down with a no smoking sticker on the back. The bed is definitely pushed up against the heater/air conditioner. There is only free wifi in SOME of the rooms. And my TV made horrible clicking sounds while it was on. I also had two big spiders in my bathroom and proceeded to get two bug bites while in my room. I wanted to leave yet my family in another room talked my husband and i into staying. What a mistake. At about 5:00 in the morning while lying awake I heard somebody try to get into my parents room, but I thought it was one of them. Then I heard somebody at my door put in a key and try to open the door, and I thought it might be my mom. Then I realized they had moved down to the next room to do the same. We were too scared to look out the window so we decided it was time to get up and get out. My parents thought it might be the newspaper they drop off by your door in the morning, but no my husband even heard them trying to open the door. The sound of a key going into your key slot and somebody trying to push open the door is very distinct. You could not pay me a million dollars to stay here again and I thank my lucky stars my two little girls were still asleep.", "title": "Very Afraid!", "helpfulness": 1, "user": "Familyvacayer", "date": "April 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 14980222, "likes": {"liked": "— Next to the interstate", "disliked": "— everything else"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Very scary place, People milling around our room and car all night. We did not sleep at all! Rooms are very tiny, bed pushed up against a heater...not clean - scary!", "title": "Scary", "helpfulness": 1, "user": "Tinkerbell3233", "date": "March 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 14622805, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 1.0, "title": "horrible!", "text": "I stayed in this motel 6 and was followed around by a drug addict ( I was alone with my son) and when we got in the room the bed was damp wiht fresh pee, it stunk to the highest heavens. I was scared to go to sleep because of the drug addict that kept folling me around. The following morning, I woke up unable to swallow and got very sick. I lost my voice for a week, ran a high fever, had to go to a doctor and he told me I got a bacterial infection from how dirty the room was. I did call the motel's manager and was told I would be compensated and still have not been commpensated. I also got skin sores. I was pretty sick. What really made me mad was the manager told me they had a record of a couple of people checking in then back out in 18 minutes and they knew these people had trashed the room yet no one did anything to clean the room. The shower was so gross I would not use it. Don't stay at this motel 6!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5436448}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We stayed here one night because every place else in the area was more than we wanted to spend on a single night. ( I am not sure why the area is so expensive--seems to be mostly truckers at all the hotel/motels we tried.) I stayed at Motel 6's while I was in college a few times, and this one is better than I remember them being. That said, there was some real grime in the carpet--wear flip flops or something. There was the usual serious wear and tear covered by paint, holes in blankets. We're budget travelers, so we managed okay. For one night. There is a microwave and fridge. No breakfast. Like the clerk said to me, \"It's Motel 6.\"", "title": "It's Motel 6", "user": "MaggieP6789", "date": "March 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 100913260}, {"rating": 2.0, "title": "Avoid, go to Williams", "text": "All Motel 6’s are not alike. Case in point: this one, and the one just up I-5 in Williams. Nothing horrible here in Woodland, but poor in every respect. Marginal maintenance, musty smell, swaybacked bed, and after completing the check-in I discover that there is no Internet available because they are out of the access cards! Motel 6 in Williams is far better across the board, and the price is exactly the same. (I stayed here this time because of proximity to Sacramento airport, but next time I’ll get up earlier and drive the extra 40 miles!)", "user": "Brewsbee", "date": "July 6, 2010", "id": 69908225}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed one night during a road trip with family. Check in was fast. The room was small and clean, Wi Fi for $2.99 (free would have been better) Mattresses were firm. Plenty of restaurants within walking distance and motel is right off of the interstate. The only complaint was that one of the beds in our room was right next to the air conditioning. Also there is only a bar of soap in the bathroom and when I asked for shampoo I was told they don't offer it but that I could buy it out of the vending machine in the lobby.", "title": "Great for the price", "user": "rjburchett", "date": "June 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 33424436}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Had to stay there a week while waiting for my apartment, seemed clean but when I had to go to the bathroom in the middle of the night, (of course the last night of my five day stay), I saw four cockroaches in the bathroom, I was totally discussed. I have always stayed in Motel 6 because you know what to expect. This was the first time I encountered roaches.", "title": "cockroaches", "user": "sh0rtgirl", "date": "April 25, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 28759387}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I visited on April 16, 2009. Was actually given a senior discount, which pleased me immensely. The front office check-in staff (Amit and Meghan) were very professional. At 12 noon check in time, I had to wait less than 10 minutes for my room to be ready. a surprisingly pleasant experience. Will definitely visit again.", "title": "Very Satisfied.", "user": "jayantaw", "date": "April 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 28360465}], "location": {"country": "United States", "city": "Woodland"}, "variance": {"poor": 5, "average": 5, "very good": 0, "terrible": 9, "excellent": 1}, "aka": "Woodland Motel Six", "slim_ranking": 0.909090909091}