{"user_rating": 5.0, "review_count": 71, "name": "Moulin De Vigonac", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed here for 7 nights and found both the hotel owners and the staff very friendly and helpful. The hotel setting and accommodation were outstanding and the food superb.", "title": "Simply Perfect", "helpfulness": 1, "user": "Joanna W", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139570100}, {"rating": 5.0, "title": "Brantome & Moulin de Vigonac", "text": "We would highly recommend this hotel and indeed hope to return ourselves sometime in the near future.", "user": "Josef22", "date": "August 25, 2012", "id": 138300016}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for two nights in mid-August and it was the highlight of a long trip around the South West of France. It's a beautiful setting, close to the fantastic village of Brantome and the lady who runs the place and her son could not have been more helpful and relaxed. We ate in the resturant on the Friday night and it was a lovely experience, the food was top quality and the staff v friendly. I have already recommended the Moulin to all my friends, and we will definitely go back - highly, highly recommended.", "title": "Hotel with Wonderful Garden and Restaurant", "helpfulness": 2, "user": "Johnmorganpowell", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131325977}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We arrived quite late in Brantome, quite tired and we initially found the hotel hard to locate as the tourist signs in the town seem to stop at the second bridge and actually you need to continue for quite a bit further to a roundabout and then down the track that leads to the hotel - so do your research in advance - look at the little map on the website. When we did find it we were really delighted and our welcome was perfect - thank you Oliver and the Alexeline famille. Our room was lovely, clean, spacious and bright with a little balcony to sit on and near all the facilities including the pool and garden. This room was Camille. The car was parked just outside so very handy if like us you have lots of luggage and bits and pieces in the car. Initially I was concerned about the walk to the town - but there's no need to worry at all - it's not far and quite a pleasant off-road green route you follow to end up in the centre by the river. I would recommend staying there in the evening as this has to be one of the most enjoyable meals I had in our two weeks in France. The level of cooking and presentation was fantastic for the money and included a whole lobster for my starter - which was a special - but if it's on the menu do not hesitate for a moment! The gardens and park were really fantastic and very calm and quiet. And I almost forgot to mention it - I think also the best breakfast too. Thank you - John & Martine", "title": "A Wonderful, Gracious Establishment", "helpfulness": 2, "user": "JandM613", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131208229}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is a real gem. From the gracious welcome to the beautiful room to the outstanding breakfast, the Moulin de Vignonac is one of the very best BandBs we have ever stayed at. Don't look any further!!", "title": "An Island of Beauty and Considerattion", "helpfulness": 1, "user": "basa12savta3", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130152814}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stumbled upon this restaurant by accident as we were early for dinner and were walking along the riverside. The setting and ambiance are to die for.", "title": "Amazing setting, food and service", "user": "foodlover98London", "date": "March 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "service": 5.0}, "id": 154243081}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Staff kindly let us sit down anyway and enjoy a drink by the river before the restaurant started service. The food and wine were excellent - a little pricey - but when on Holiday......", "title": "Highlight of our French vacation", "helpfulness": 3, "user": "Mike B", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147452368}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My wife and I spent two weeks vacationing in France and our three days at Moulin de Vigonac was the highlight.", "title": "Picturesque & Fantastic Food", "helpfulness": 1, "user": "Coco_Kitt", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143385799}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The staff was great. We enjoyed the warm welcome, pleasant conversations, ideas for touring in the area, and some history of the hotel and region.", "title": "Incredible food and a lovely setting", "helpfulness": 1, "user": "DHD91", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142736389}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The restaurant was amazing. We arrived planning to eat there one night and then go and explore further. the chef had excellent recommendations our first night. David our waiter had great wine recommendations from local, regional, and more distant sources. The ambience was perfect ... We ate there all three evenings and breakfasts. The food was some of the best we had during our vacation.", "title": "Lovely, quite and pacefull", "user": "camiceblu", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141389060}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Everything about Moulin de Vigonac is 100% magic. The ambiance, the bedroom (Cassandra) the hosts, the gardens and the food are without fault. It is not cheap to stay there but 'you get what you pay for' which in this case is excellence.", "title": "Magic", "helpfulness": 1, "user": "Sauvarin", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166515840}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "It is an easy 20 minute walk into Brantome, either along the road, with pavements, or by a green path. Can recommend this.", "title": "Charming hotel with a very warm welcome", "user": "57sallyb", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166184633}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We will certainly return to this Hotel and it now joins our personal list of favourite places to stay in the World.", "title": "First Rate", "user": "Nevaldo", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166011542}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed only one night and would definitely return. The hotel is beautiful, set in large gardens on the river just outside Brantome. Unfortunately the restaurant was closed that night, but we enjoyed a delicious breakfast on the terrace. Our room, Joannah, was beautifully decorated and furnished with a large bathroom and outside terrace overlooking the pool. The sun shone and it was perfect! The owners are very welcoming and friendly and make this a very special place.", "title": "Good, but one big disappointment", "helpfulness": 1, "user": "piquet47", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165765522}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed her for three nights (from 19 June) in the Alexandra room.", "title": "Great Hotel Great Setting", "helpfulness": 1, "user": "jakath", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164679966}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed in this cosy, tranquil, family-run hotel with our baby daughter. The level of service (e.g., each member of staff knew our name throughout our stay, a cot was ready and waiting for us on arrival, on our late-night return from a nearby wedding one evening we were met by one of the team with a torch who guided us back to our room, we were helped by three separate family members with our onward travel plans) was befitting of places we have stayed at the very top end of the luxury scale. The restaurant serves exceptional, French food in refreshingly copious portion sizes. The waiter was immaculately trained and made every meal a thoroughly special occasion. We felt extremely welcome by this outstanding family team who even presented my wife with a gift on departure. Truly fabulous and not to be missed!", "title": "Service worthy of ultra-luxury accommodation", "user": "Ed and Lindsey W", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162974680}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "What was outstanding here was the personal individual attention from the owners from the instant we arrived, to the parting gift of chocolates when we left after only one night. On arrival, as the hotel was not busy, we were offered an upgrade for our comfort room to a grand comfort room at the same price. We gratefully accepted this and enjoyed the small balcony overlooking the mill wheel and the sun through our windows. Both rooms were delightful and spacious. Dinner in the evening offered a choice of menus at 45 euros or 65 euros, but we chose from the a la carte and chose lobster salad followed by a plate of assorted cheeses. The lobster was a whole lobster each and was prepared beautifully, making it so easy to eat every morsel. It cost 32 euros but surpassed anything we had experienced elsewhere. Our menu choice was excellent as we were served complimentary canapés, an amuse bouche and petit fours desserts in addition to our lobster and cheese. It would be fair to say that the wine was, we believe, overpriced with the cheapest bottle at 35 euros, but for this we had a lovely Chablis.", "title": "Something special", "user": "firstcuckoo", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161891883}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Breakfast was also lovely. Everything you could wish for, croissants. Pan au chocolate, yoghurt, fresh fruit salad, crepes and eggs if you wished. In particular, what was so nice was that with all the dining everything was of the highest standard, the beautiful crockery, heavy cutlery and table settings.", "title": "Maybe our best stay anywhere anytime", "user": "Keith063", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161857249}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The decor of our spacious room was lovely and although it was an expensive overnight stay, it really was faultless and something special. The grounds and setting were beautiful, a little way out of Brantome but having browsed Brantome you would not want to leave here.", "title": "Wonderful hotel run by wonderful people", "helpfulness": 2, "user": "PB11Jersey_CI", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157039392}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A very unique and wonderful place where we spent 7 nights in May. The very personal hospitality of Michel, Giselle and Oliver, ably supported by David, is fabulous. Michel is an outstanding chef who consulted on our dinner menus each day - he gave personal tuition in the kitchen one day to our ladies on how to make a perfect foie gras mi-cuit. In the restaurant we were given flawless high class service by David. Oliver (the son of Michel and Giselle) went to great lengths to provide information and recommendations for our daily itineraries. The rooms and setting had so much character. No question we will be going back.", "title": "Outstanding!", "helpfulness": 2, "user": "Smith_in_gabon", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156765534}], "location": {"country": "France", "region": "Aquitaine", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 1, "very good": 4, "terrible": 0, "excellent": 65}, "slim_ranking": 0.142857142857, "description": "HOTEL 4 stars **** This 16th century watermill nestles in an idyllic location a few steps from Brantôme, “the Venice of Perigord”. Cradled by the river Dronne, the grounds and its little islands are a celebration of nature. Stimulation of the senses, a warm welcome and authentic cuisine will add to the pleasure of your stay.Located in the heart of the Perigord Vert, you will be charmed by this hotel’s natural and peaceful setting."}