{"user_rating": 4.5, "review_count": 128, "name": "Moulin de Connelles", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Le Moulin de Connelles is old world luxury located beside the Seine and surrounded by some truly picturesque French countryside.", "title": "Excellent, 5 Star All the Way", "user": "mgirishrover", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47301858}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We only had the pleasure of spending 2 days in this beautiful old house. From start to finish this was a 5 star experience. On arrival, we were greeted by the proprietor Karine, who was without doubt, the most helpful and inviting host we have ever encountered in France. This lady was busy greeting all guests on arrival yet she also juggled her duties and managed to serve drinks and nibbles to the guests who were relaxing on the decking overlooking the beautiful river which flows under the house. Again, her effortless warmth when serving guests was as flawless as her welcoming skills.", "title": "Fab Hotel, Lovely Setting, Super Staff", "user": "Jilbo", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43375932}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The house has many facilities including swimming pools, tennis courts, a barbeque area, row boats to sail up and down the river, to name but a few. Most of all it was a haven for relaxation, most guests took to the decking area with their books to unwind. The house is also very close to Giverny, Claude Monet’s home, which is certainly worth a visit.", "title": "A perfect weekend", "user": "Decadentgirl", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41398460}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Our package included breakfast and dinner, both which were delicious. The wine list catered for all budgets and the service was superb. The bedrooms were certainly in keeping with the rest of house, there was no modern touch to them which I was grateful for as it would certainly have taken from the feel of the old world luxury which is created so well throughout the common areas of the hotel. The bathrooms were well equipped with toiletries, the bed was extremely comfortable. The house was blissfully silent at night which was fantastic for getting a good nights sleep!", "title": "wonderful meals in a beautiful location", "user": "JulianLeicester", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37287973}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We genuinely loved this hotel and hope some day to return. It was a bit of effort trying to get there but it was worth the trouble!", "title": "Great overnight trip from Paris", "user": "RobReno", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30960890}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We wanted some luxury on our trip so found this hotel and got a deal incl breakfast and evening meal. In a beatiful position over the seine it was a pity that it rained most of the time we were there. However, the staff were brilliant and very helpful and forgiving of my poor french. We went for a basic room and it was a little disappointing in terms of style and modernity, and one of the bedside tables hadnt been dusted properly, however it was still comfortable and had good views. We had a table in the restaurant overlooking the river and the amazing views were bettered by the quality of the food and the attentive service. Having had a sneaky look into a couple of the suites I think we would definitely upgrade on our next visit as they looked incredible.", "title": "Great food, location and service", "user": "sjgazzard", "date": "May 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 30840742}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Amongst fields of poppies and the gently flowing river beside it, Moulin de Connelles is a vision worth treasuring. Service and food were excellent, even down to the tiny french biscuits served with tea. If you want to visit Claude Monet's village, it is quite close and easily accessible from this small hotel. I will return to Connelles another holiday in the future.", "title": "Ten years later...", "user": "Aussiegirl49", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27193642}, {"rating": 5.0, "title": "Fantastic way to start a holiday!", "text": "We stayed at Le Moulin de Connelles at the start of a touring holiday and our only regret was that we were staying for one night not two! The hotel setting is beautiful and worth a visit in itself. Our room was outstanding; we had booked a suite on the 1st floor with a river view and double Jacuzzi (which also turned out to be a wet room with two very large showers). The staff were very courteous and the service throughout the hotel and restaurant was excellent. Dinner, which was included in the package, was very good and the wines reasonably priced. We had our small dog with us and he was treated very well too! This hotel is definitely on my “re-visit” list!", "user": "ManchesterClifton", "date": "July 25, 2008", "id": 18230252}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "An exquisite hotel in a perfect setting. We stayed two nights in two different suites - Room 7 and the big panoramic suite with it's balcony over the river. Fab rooms and the best ever bathrooms. Big separate showers and jacuzzi baths, windows opening onto the spectacular view.", "title": "Absolute Heaven", "user": "jj555", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17536830, "likes": {"liked": "— Luxury in beautful setting", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The 33 euro three course dinner is included in the price, but we chose two courses from the a la carte instead and weren't charged the extra 10 euros on either night, we just paid for our wine which was 26 euros.", "title": "Haute Cuisine on the Seinne", "helpfulness": 2, "user": "grumpyguts", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16513699, "likes": {"liked": "— Serene location, great staff and fantastic food.", "disliked": "— Leaving it!"}}, {"rating": 4.0, "title": "Loved everything about this charming hotel nestling on the banks of the Seine", "text": "This lovely hotel sits on the banks of the Seine. Relatively easy to find without navigation, although a good map is essential. We stopped here for one night en route from the West Coast of France to the Channel Ports. The hotel was a welcoming respite after 6 hours of driving. Hostess and staff were very attentive and friendly. Nothing was too much trouble. We had a lovely meal in the restaurant in the evening - service was exemplary and food to match! Our room was very comfortable. We had a small double room on the first floor, overlooking the water, where we could watch guests rowing up and down under the hotel in their boats. We did not use the swimming pool as the weather was too cold and it was raining, but we did venture out for a short walk into the village of Connelles. Not much else to do there, but ideal if you are visiting the area and Giverny/Rouen.", "helpfulness": 4, "user": "kester", "date": "May 31, 2007", "id": 7725332}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "We have just come back from a four day stay at the Moulin de Connelles, and I cannot recommend this lovely hotel enough for its absolutely idyllic location, romantic architecture, superlative personnalised service and delicious food. A very special place indeed to get away from it all and enjoy some gracious living in an area of much interest. Perfection!", "title": "A real find!", "helpfulness": 1, "user": "MHBath", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7379283, "likes": {"liked": "— the romantic setting", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Le Moulin is a former mill spanning a small branch of the Seine, approx 70 miles northwest of Paris and 20 miles from Giverney. The setting is beautiful and the restaurant is glorious. We stayed in Room #1 and it was amazing! Comfortable bed, elegant furnishings, beautifully renovated bath and shower -- directly ABOVE the Seine! We have vacationed in many countries and would rate Le Moulin de Connelles right at the top of memorable places to stay. We checked out the pool (a bit too chilly in October) and had it been summer-time it would have been marvelous! Understandably, making a reservation somewhere you have never been can make one a bit nervous, but Le Moulin is a slam-dunk winner. The current owners are on-site and HIGHLY friendly. In all respects, this beautiful inn is a must-stay and well worth the short distance if one is visiting the Giverney area. Paul & Susan Warner, HInsdale, Illinois.", "title": "Very, Very Special!", "helpfulness": 6, "user": "Greatnews", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6183305, "likes": {"liked": "— Location, history, appearance, romance", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "A devine place to stay", "text": "uly 2006: I should have done this before now, as we are now one year later, but suffice to say that we had a wonderful stay here at the hotel last summer. We even took the little rowing boat up the river one morning and giggled and laughed our way through that! Our room straddled the river, and we had al little balcony to just sit and view and listen, and also welcome the calm and relaxation of it all after the drive et al. We would certainly recommend this hotel to anyone wishing to go to this area. We are planning our trip to France right now for this September 06 and if at all possible I would wish to stay here again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5471975}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "It is so nice to stay in a family run establishment - they were sooooooo nice.......especially the owner, MISS how might now be MRS..........since we met her lovely fiancee...........", "title": "Great Location", "helpfulness": 3, "user": "EJ999", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 5423281}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "An historic former mill in a beautiful location on the Seine. All the staff were very professional, especially the lady who runs the reception. She couldn't be more polite and helpful, and thoughfully upgraded us to a nicer room on arrival. Our half board rate included dinner in the cosy restaurant with a covered terrace overlooking the river, which was executed by a competent kitchen at reasonable prices (3-course menus start at 33 euros). They did seafood very well, evidenced by an unexpectedly tasty entree of warm oysters in a light camembert sauce. Wine list is 95% french with some interesting options, and we chose a Chateau Fonbel from St Emilion (same owner as the first growth Chateau Ausone) from 2000 for 49 euros. We took a look at several other rooms - all were tastefully decorated, with recently refurbished, modern and spotless bathrooms, including some with jacuzzi baths. Rooms on the first floor have tall ceilings and feel more spacious, while rooms on the second floor feel more cosy. The continental breakfast which was brought to our room had freshly squeezed orange juice, a large thermos pot of coffee, hot frothy milk, and toasty butter croissants and pains au chocolat. The hotel shares the facilities of its 3-hectare island with a neighbouring holiday apartment complex, including 2 small outdoor swimming pools (not yet opened as of early May), a children's playground, a tennis court and a boathouse. With the high summer season not yet in full bloom, our stay was quiet and relaxing. We would gladly come back again.", "title": "Lovely stay", "helpfulness": 2, "user": "I_love_Buenos_Aires", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15721195, "likes": {"liked": "— Thoughtful and professional service", "disliked": "— No wifi. Patchy mobile telephone reception."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Awsome, simply perfect.", "title": "A special place to stay.", "helpfulness": 3, "user": "Richie-mo", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8661853}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "What a fantastic place. Close to calais on the hoon back to the boat and too close to monet's gardens that it's rude not to visit!", "title": "Idyllic surroundings, friendly staff and great food", "helpfulness": 2, "user": "wanderlust2007Paris", "date": "August 23, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 8484862}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "As our last night's stay of our hoeymoon it was perfect. With very friendly, english speaking staff and possibly the best meal out of the 16 we had.", "title": "A beautiful peaceful haven", "helpfulness": 1, "user": "NaomiBrisbane", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8054849, "likes": {"liked": "— Warmth of the people, great location", "disliked": "— Breakfast"}}, {"rating": 3.0, "title": "Pretty riverside location but high price for a stopover", "text": "To the people who say it's not cheap I would agree, it isnt. But over-priced it is most definately NOT! Quality dosnt come cheap but it ain't mega bucks.", "helpfulness": 2, "user": "habblet", "date": "June 19, 2007", "id": 7937208}], "location": {"country": "France", "region": "Normandy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 6, "very good": 33, "terrible": 3, "excellent": 79}, "aka": "Moulin De Connelles Hotel Connelles", "slim_ranking": 1.0}