{"user_rating": 4.5, "review_count": 41, "name": "Mountain View Retreat", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Me and my partner have just returned from a one week stay in the Yangshuo Mountain View Retreat and we can't praise it enough.", "title": "Beautiful resort hotel in stunning location", "helpfulness": 3, "user": "AndyMillman99", "date": "November 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120937935}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The resort is made up of a small number of beautifully decorated self contained apartments. Ours had a four poster bed, jacuzzi bath, laminate flooring, flat screen TV... but better than all of those was the first soft mattress I've encountered in all my Chinese traveling experience! This, along with the fact that the hotel is located away from the hustle and bustle of Yangshuo, meant that we slept well every night.", "title": "Friendly family run, Fantastic rooms and a good location", "helpfulness": 2, "user": "Anthony J", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120255042}], "location": {"country": "China", "continent": "Asia", "city": "Yangshuo County"}, "variance": {"poor": 0, "average": 4, "very good": 8, "terrible": 2, "excellent": 27}, "slim_ranking": 0.0783582089552, "description": "Mountain View Retreat is a newly opened, family run retreat. Situated in the beautiful countryside amongst the amazing Karst peaks of Yangshuo. We have 24 luxury villas all decorated in Chinese style but to high western standards.Our adjoining farms provide produce for our organic restaurant where you can enjoy both Chinese and Western food. You can venture into our strawberry fields and pick strawberries to enjoy with chilled champagne in your private whirlpool bath. Or take advantage of the passion fruit vines overhanging our restaurant.We have extensive travel services and local knowledge, bike rental and a pool and table tennis table. If you're looking to escape from city life, Yangshuo Mountain View Retreat is the perfect getaway. Perched near the Moon Hill Park and surrounded by towering limestone peaks, you'll experience views that have inspired poets and artists for millennia. Built with great considerations for feng-shui, here you can enjoy the beauty of nature, tradition and local culture in harmony. We can help you organize activities like cycling, hiking, rock climbing, bamboo rafting, Chinese cooking lessons, kung fu and Tai Chi lessons, and lots of other excursions. Our staff can arrange taxis, tickets to the Sound and Light Show, as well as train, bus and plane tickets.No matter how small the detail might be, we are here to make your experience at Mountain View Retreat one that you will want to come back to and to tell your friends about."}