{"user_rating": 5.0, "review_count": 7, "name": "Mount Brioni", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "This two bed (one double bedroom and 1 single with twin beds) was perfect for me and my two friends. The location was about 3 minutes walk to the beach and had a seperate patioed area for barbecues.The view from our first floor apartment with balcony looked out to the sea, whilst the back bedroom had a view of the lush green hills. The apartment had all the relevant equipment for your stay (self catering).They had adequate information about the sourrounding area in the apartment as well as leaflets near the office.The apartment had a seperate shower as well as the bath and everything was very clean. They even provided binoculars for the views. There is a bus stop about 5 minutes away(takes you to turnpoint -so you can get the ferry to portsmouth) but the friendly small buses are not that frequent.", "title": "Clean, spacious and brilliant view", "helpfulness": 1, "user": "betshean", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179092994}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We have just returned from a lovely time at Mount Brioni. The accomodation was clean and generally very well presented, modern just a little tierd in the decor, but, perhaps that was the end of season. The view from our terrace was unrivalled views accross the sea-beatiful. We felt we would have benefited from two pillows each on the beds, also some salad servers, scissors and a large salad bowl would have been useful, also a non stick frying pan!! I/We would not hesitate to recommend this venue on to others.", "title": "Unbeatable Location", "helpfulness": 1, "user": "B b", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178531697}, {"rating": 5.0, "title": "Fabulous spot!", "text": "My husband and I have just come home from a weeks holiday and we did not want to leave! We stayed in a ground floor apartment which was immaculately presented and as promised the views were just fabulous! I would not hesitate in recommending to family and friends and hope that we will be able to go back in the not so distant future. The location was great, a hop skip and a jump and you're on the beach and within walking distance of a lovely beachside cafe, a bistro/restaurant and a pub. Perfect!", "helpfulness": 1, "user": "Sarah S", "date": "September 13, 2013", "id": 177031864}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We spent a week in no 21 Mount Brioni in early September. The accommodation was well equipped, modern, clean and comfortable. The best feature was the beautiful view which made it quite tempting never to venture away from the apartment!", "title": "Luxury by the sea", "helpfulness": 1, "user": "Britishclaire", "date": "September 10, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 4.0}, "id": 176607427}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The terrace is a real suntrap and if we'd sat out all week anyone would think we'd been to St Tropez!", "title": "Paradise", "helpfulness": 1, "user": "Shazzawalt", "date": "September 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 176043195}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 6}, "aka": "Mount Brioni Seaton, Cornwall", "slim_ranking": 1.0}