{"user_rating": 4.5, "review_count": 293, "name": "Mountain Thunder Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "I wish we could have stayed longer! On our summer trip through the Rockie Mountains we spent one delightful night in Breckenridge at Mountain Thunder Lodge. The lodge is everything you would expect to find in the mountains. The rooms were cozy and well-equiped. Everything was clean and the bathrooms were absolutely huge!! plenty of room for all of us. The staff was very helpful and welcoming to their small town. This is not a large town so getting around from the lodge is easy. It was summer so our time was spent at the Alpine Slide. I could see ski runs but am not sure what the access is for winter from the lodge. I cannot wait to return for another mountain visit.", "title": "Summer or Winter Cozy Delights", "helpfulness": 2, "user": "JulesfromIowa", "date": "January 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6623945, "likes": {"liked": "— Size and value of the rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed in a one bedroom condo for 6 nights at Mountain Thunder Lodge and had a fantastic stay. The Lodge is centrally located and super clean. Daily maid service was a huge plus! The view from our balcony was very nice, and the fireplace was a nice touch. There's a gondola being constructed across the street which will make the Lodge ever better! We skiied right into the side of the Lodge which was excellent! Reception was warm and very friendly...The underground parking was super convenient. Will definitely stay here again!", "title": "A Great Lodge", "helpfulness": 3, "user": "cane92", "date": "December 15, 2006", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 6446749}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed here for 5 days over Thanksgiving and we loved it! We have a 2 bedroom condo with 2 teens and we had ample space. The condo was really lovely with great views. The staff was terrific, beds were very comfortable and we were well taken care of during our stay. The location is perfect and it is extremely convenient to everything you will need during your stay!", "title": "Great Experience", "helpfulness": 2, "user": "ECanitano", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6183045, "likes": {"liked": "— Comfortable condo and location", "disliked": "— nothing...it was terrific!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "We stayed at the Mountain Thunder in September for a business retreat. We stayed in a two-room condo, and were generally happy with the accomodations and layout. Very spacious and comfortable with nice design touches. The entire resort is very nice and cozy and on the higher end.", "title": "Very nice rooms and facilities, pretty good location.", "helpfulness": 1, "user": "EveAndGreg", "date": "November 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6152432}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I don't think there is a restaurant here, however, and there is no room service available. It is close enough to walk (10 minutes) to downtown Breckenridge, and they do have a number of constant van shuttles that will take you anywhere in town you want to go without charge. Its location is, depending on what you want, probably the only downside. It's not quite close enough for some to the restaurants, and it's not slopeside either. But that makes it a little quieter probably, and it is certainly only a couple minutes drive to town or the mountain. The walls are also surprisingly thin.", "title": "Great place to stay", "helpfulness": 1, "user": "doggiebus", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6149907, "likes": {"liked": "— Location, Employee Service, Parking", "disliked": "— Drawer and closet space"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "My family and I stayed at Mountain Thunder Lodge in Breckenridge in January. The hotel was great with a very nice staff and great accomodations. The Lodge is located right across the street from new Gondola, and also right on a bus stop, so there was easy access to the slopes. The front desk attendants were very helpful and full of local knowledge, they also suggested a ski rental delivery service call Black Tie Ski Rentals. They delivered all of our equipment which was some of the best we have ever rented, and their staff was very knowledgeable, I definitely reccommend them to anyone who stays here or anywhere else in Breckenridge. Mountain Thunder was top notch and I reccomend them to anyone staying in Breckenridge.", "title": "Great Place to Stay", "helpfulness": 3, "user": "burghskiier", "date": "March 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7007843, "likes": {"liked": "— Friendly staff with great recommendations", "disliked": "— Not really ski-in, ski-out"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "An absolutely faultless stay. We stayed in a one bed condo in the main building. It was spotlessly clean and very well equipped, there was constant hot water, clean towels and the heating was easily adjustable.", "title": "Faultless Stay", "helpfulness": 2, "user": "N0rf0lkGirl", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6906128, "likes": {"liked": "— The friendly and helpful staff", "disliked": "— Not having a restaurant on site"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The staff on the front desk and the shuttle bus drivers were unfaillingly helpful and polite and nothing seemed too much trouble. It was such a bonus to be able to have the shuttle take us to Peak 8 or Peak 9 without having to walk over to the gondola in ski boots. We loved being able to ski back to the condo at lunch or the end of the day.", "title": "Good Facility, Poor Service", "user": "Travel_Mgmt_Advisor", "date": "February 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 6802894, "likes": {"liked": "— Location", "disliked": "— Front Desk Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We didn't use the pool or the hot tub, but they looked clean and well maintained.", "title": "Very Conscientious", "helpfulness": 2, "user": "floridaorbust", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6750216, "likes": {"liked": "— the staff", "disliked": "— rooms were too stuffy"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "If we had to pick one thing to be negative about it would be that there is no restaurant on site. It is not far to walk or ride the shuttle to Main Street but on our last day when it was snowing heavily and very cold, we would have liked to have had breakfast on site. The hotel do serve free Starbucks coffee in the lobby.", "title": "Great choice!!!", "helpfulness": 2, "user": "Bev2007", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6716226, "likes": {"liked": "— Very friendly staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I stayed here during our annual \"trip without our precious children.\" We had an incredible time. We rented a one bedroom condo and it had a full bath, living room and kitchen. The place was incredibly clean and fresh. The kitchen was well equiped. Mary, at the front desk, went above and beyond to make sure we had everything we needed...from great restaurant recommendations, to help with bike rentals, kayaking and river rafting. We will for sure stay here again and would highly recommend to anyone. It is just a short walk over to the main street where everything happens.", "title": "What a fantastic experience!", "helpfulness": 1, "user": "sdl99", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8139154}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Our stay was April 8-15th at Mountain Thunder Lodge and we really had a great time. The one bedroomed condo had plenty of space for the three of us. It was comfortable, clean, well decorated and supplied with some basic household provisions. The staff were friendly and helpful- the shuttle bus was very convenient and the snow conditions were so good that we were able to ski back to the condo at the end of the day. We did suffer from altitude sickness for about the first 36 hours unfortunately, and spent a whole day in our beds (even tho' we'd taken all the advice to drink lots of water and took it easy...).", "title": "Great condo, fantastic skiing!!", "helpfulness": 1, "user": "Englishskier", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7393496, "likes": {"liked": "— the cleanliness", "disliked": "— heating couldn't be turned down-had to open windows"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Anyway, I'd certainly stay there again- it was great!", "title": "Lovely place", "helpfulness": 6, "user": "MissRuby", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7375438, "likes": {"liked": "— The cleanliness and top quality of the furniture and decor."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We stayed at a Mountain Thunder Lodge townhome during Easter week with 5 members of our family. Our place had the finest decor and the set up was perfect. There were three bedrooms and three baths with heated hardwood floors throughout. The distance to the lifts was very close and the walk to Historic Main Street took only about 5 minutes. The hotel service was great. There is not one thing to complain about. Each of us were equally impressed.", "title": "Really Nice Place", "helpfulness": 3, "user": "TravelTrio", "date": "March 12, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 7148923, "likes": {"liked": "— Location, Look & Feel", "disliked": "— Van Service to the Lifts"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We stayed 7 nights at MTL in Building 5 on the second floor. We rented a one bedroom condo. The condo was really nice. Plenty of space, fireplace, large kitchen, pullout bed in the living room, very large bathroom, balcony. The furniture was very up to date. The overall building was very nice. You can take 4 O'Clock trail right to the back of Building 1, which is about a 3 minute walk to Building 5. You can also walk to the gondola in about 5 minutes, there is an under road tunnel you take. The only negatives are 1) Van service during peak pick up times are often slow. So between 8am-10am things can be slow, but you can walk to the gondola instead. 2) The rooms are very warm. We actually had the heat off the entire time, except for turning on the gas fireplace once in a while. Very strange, we could figure out where the heat was coming from. So we just opened our window once in a while.", "title": "Thought the Facility was the Best!", "helpfulness": 6, "user": "aesgreen", "date": "March 11, 2007", "detail_rating": {"business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7013460, "likes": {"liked": "— New, spacious units/facilities and shuttle service", "disliked": "— Too far from gondola and not a great winter pool facility"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We spent 3 nights in a one bedroom condo at Mountain Thunder Lodge in early October, 2006. The condo was very nice, clean, new and well laid out. We especially liked having a lobby and bell desk with an attendant who was friendly, helpful and interested in our having a good time. She made terrific recommendations for restaurants and activities and was interested in giving us just as much information as we wanted. The room was quiet, even though we had neighbors on all sides, with great views of the mountains, hiking opportunities in the immediate area and a very large corner balcony.", "title": "Mt. Thunder a great place to stay", "helpfulness": 3, "user": "j2945", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5944180, "likes": {"liked": "— The ambience and nice new accommodations that met every need.", "disliked": "— only one elevator in our end of the building - wasn't a problem for us at all and the lodge was pretty full, but we wondered if that would be an issue during ski season"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The parking was easy and underground. Service was uniformly excellent. We will definitely go back to Mountain Thunder Lodge again.", "title": "Great experience!", "helpfulness": 2, "user": "Gavin39", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5789517, "likes": {"liked": "— Front Desk Staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We recently stayed at MTL with our father that was visiting from out of state and we had a wonderful experience. The first night we stayed there, we were hearing a lot of the construction noise from across the street, so the next morning we inquired about moving to another room. Not only did Mary at the front desk immediately give us two other possible rooms to move to, but she apologized and in no way made us feel bad about our request. The room we chose was beautiful, on the top floor, with a great view of the mountains and far away from any noise. When I mentioned to Mary that we were in Breckenridge to go fishing and it was a shame that the weather was bad, she immediately offered us a late check out the next day because the weather was suppose to be better. This was by far the best experience that we've had in all of our travels and we highly recommend Mountain Thunder Lodge.", "title": "Best in Breck!", "helpfulness": 5, "user": "westender", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5539831, "likes": {"liked": "— clean, modern, great location.", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My Wife and I spent two weeks at MTL during January'05. .From the moment we checked-in we were impressed at how professional the staff were. The room (essentially a condo) was excellent with a huge bedroom, nicely designed bathroom, living room with all the toys(log-fire)and first rate self-catering facilities. The hotel also has a bus that will take you to the ski field on demand. It's a five minute trip!", "title": "We loved Mountain Thunder Lodge", "helpfulness": 4, "user": "Beebow", "date": "July 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5520659}, {"rating": 1.0, "title": "Bad experience", "text": "Every local that we talked to said that The Mountain Thunder Lodge was considered the best property in Breckenridge. This wasn't just to be polite, we had two weeks to see all of the town and we can say hand on heart that the hotel can't be beaten. WE ummed and aahed for weeks as we trawled through Tripadvisor (as you do!!) trying to make sure that our ski trip would be perfect. It was. Travelling all the way from London we had to make sure that we got it spot on. We did!", "helpfulness": 13, "user": "Chitownjo", "date": "July 13, 2006", "id": 5461750}], "location": {"country": "United States", "city": "Breckenridge"}, "stars": 3.5, "variance": {"poor": 10, "average": 10, "very good": 50, "terrible": 3, "excellent": 220}, "aka": "Mountain Thunder Hotel", "slim_ranking": 0.130434782609, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}