{"user_rating": 4.5, "review_count": 611, "name": "Mount Nelson Hotel by Orient-Express", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My wife and I stayed at the Mount Nelson Hotel recently at the beginning of our first stay in South Africa. It truly ranks among the finest hotels in the world. The service is excellent, the rooms unusually spacious, and the facilities in tip-top shape. Don't miss high tea, which is served every afternoon. The setting and the menu will remind you of every episode of \"Upstairs Downstairs\" you ever saw. One hint: the hotel provides free shuttle service to the downtown area. For other destinations, they can arrange for their own car service or a metered taxi. The hotel car costs a bit more than the taxi and, from what we observed, there is no appreciable difference in the service. Also be aware that if you arrange for a guided tour through the hotel travel desk, the cost will be about 30% more than if you make your own arrangements. We used both the hotels guide and another that we arranged privately. While the hotel guide was fine, the private guide was exceptional. We highly recommend her: Contact Julie Clarke, Cape Splendour Tours. You can make all the arrangements by email (julie@capesplendour.co.za) in advance of your arrival. She tailored our trip to the Cape of Good Hope to include points that interested us, such as Kirstenbosch Gardens and the penguins at Boulder Beach. (Don't miss either.)", "title": "Old World Elegance", "helpfulness": 1, "user": "Dick M", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121288677}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "You really can ‘drink with the Stars’ if you swan into the Planet Bar at the Mount Nelson Hotel, Gardens - Cape Town. Here you will find the cognoscenti, consenting sybarites, the International A-list and the smart set spilling out onto the terrace and into the manicured gardens around a Victorian fountain. Much of this Orient-Express-owned pile is Victorian, but then so are many of the hot-spots of Europe: adding a dimension impossible to re-create. Drinks come not only with a twist of lemon but with a twist of elegant sophistication that cannot be surpassed in all of South Africa. This is 5-star splendour that offers it all: from the stylish architecture and décor to the beautiful gardens - and the extensive cocktail menu accompanied by the Planet menu (served till late).", "title": "Walk with the Stars", "helpfulness": 3, "user": "Relais-Reviewer", "date": "November 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 121257499}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Glasses sparkle, people sparkle and celeb-spotting is the name of the game. Definitely the ‘must-be-seen-in’ spot.", "title": "Check-In: Mount Nelson Hotel, Cape Town, South Africa", "helpfulness": 2, "user": "Flight965", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121197719}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "It’s always good to cross the equator when the weather gets chillier up here, however, there are few destinations that cater to all ones travel needs like South Africa. Only in Cape Town can you find a place to stay like Mount Nelson Hotel. An imperial formerly business-minded hotel turned into a boutique hotel without compromising its original design or aura. The hotel is colonial at it’s least ironic. It’s lavish gate entrance could hail back memories of early-century aristocracy, but it has been revamped to attain some of its old glory with modern-day touches.", "title": "Wonderful hotel with terrific customer services", "helpfulness": 1, "user": "Barbara H", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121150281}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel feels like a paradise of solstice in the middle of one of the most bustling cities south of the equator overlooking the incomparable Table Mountain. The gardens are well landscaped and the drive to the hotel lobby offers seclusion not available in many city hotels. Although it’s central, it has suburban charm with domestic hospitality. it’s pool is one of the best in the nation and the tennis courts are open for everyone, and as if that wasn’t enough, they’ve thrown in training lessons for free just to make you feel more at home. It’s colonial past haven’t completely disappeared as it still retains High Tea with a lavish buffet of sweets often adorned with old china and local socialites who will quip and gossip throughout the daily event, which is one of the hardest things to find a reservation for in the city. Also, it’s important to note that the hotel’s Planet Champagne Bar is one of the hot spots of the city, attracting younger clientele with a knack for well-mixed cocktails.", "title": "Excellence", "helpfulness": 3, "user": "grahamggm", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121141227}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I wobbled before choosing this place: was it here or Cape Grace? Don't know of course about the latter but I thought the 'Pink Lady' was a gas.", "title": "A gas", "user": "JeffStranks", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124405224}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Super comfortable room (didn't get mountain view but so what?), great pool, excellent service everywhere, high tea with cucumber sandwiches (!), film wallies to watch all over the place and laugh about, nooks and crannies to sit in while you sip whatever, just fun.", "title": "Paradise undone and redone", "user": "skfitzp", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123849037}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Would totally recommend. Planet restaurant bit of a let-down though.", "title": "Fabulous end to a wonderful trip", "user": "Wilkdz", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123829881}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "A trulygreathotel visit spoiled by equipment failures in our room. General manager and chiel concierge showed great concern and ameliorated situation. Still lovethehotel but saddenedbytheexperience because our memories put it on a pedestal. Still recommend but hope management takes dramatic action to ensure roomsareperfectbeforeguestmoves in. The site and service make the hotel one of the finest in the world. I do not hesitate to steer friends to stay.", "title": "Sunny Garden of Eden", "user": "LouisSaintCalbre", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123493427}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "It is almost a year ago now since we stayed at the Mount Nelson, I still think about this place often!", "title": "Best hotel experience ever ....", "helpfulness": 2, "user": "JonathanSupaTravelle", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123100037}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I have stayed here many times for both business and leisure. Thre old-world charm that harks back to a bygone era has become increasingly difficult to encounter no matter where in the world you find yourself. Properly trained staff, excellent cuisine and spectacular afternoon teas are a given. The rooms and suites are typically large, usually with extremely generous bathrooms. Although breakfast is not what it used to be, it is still very good. the main heated pool and gardens are stunning and really, everything is as it should be for a hotel of this calibre. Unfortunately, it is not near the sea, but the mountain views offer some compensation. Even if you're a guest, you still need to book for the afternoon tea [have at least one during your stay] and the sunday lunch. If you prefer a highly modern hotel with crisp lines and loads of glass, stay at the Westin or Radisson instead. But they won't remember your name and make you feel nearly as welcome as The Nellie.", "title": "All that a five star hotel should be", "helpfulness": 3, "user": "TravelHHF", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123026108}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This hotel is more than a place to stay when in Cape Town - it is actually a destination in itself, one that's well worth a lengthy journey. I'm fully with Winston Churchill, who liked to relax here after the sea voyage.", "title": "A slice of history, served modern well-done", "user": "Yvonne W", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123014703}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Things I loved:", "title": "Old Nellie", "user": "KateALondon", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122660952}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "- the tranquil spa with its secluded dipping pool and heavenly jet-stream shower", "title": "Darrel Lee Tour Guide", "helpfulness": 2, "user": "MSWilliamson", "date": "January 5, 2012", "detail_rating": {"service": 5.0}, "id": 122605482}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "- the flower scent of the garden at night", "title": "Timeless elegance in a world class city", "helpfulness": 1, "user": "dannuCapeTown", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122564801}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Without question, it's the best hotel in Cape Town. You are made to feel special from day one. Literally everything about the hotel is wonderful! I've travelled a great deal and stayed at many of the best hotels in the world and The Mount Nelson far exceeded my expectations and really impressed me. I am now altering my plans, so that I can return again later this year.", "title": "Simply Fantastic in every way!", "helpfulness": 1, "user": "Fieldview730", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122515387}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "Don't trust your reservations at this hotel! We had reservations confirmed in August for a Dec. 28 reservation and they cancelled the day before we were due to check in. Outrageous and unforgivable!", "title": "Don't trust your reservation at this hotel, even if it's been confirmed for four months !", "helpfulness": 2, "user": "Medievalmeg", "date": "January 2, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 122405552}, {"rating": 5.0, "title": "Sunday jazz buffet brunch", "text": "We enjoyed a wonderful Sunday jazz buffet brunch at the Oasis Restaurant next to the swimming pool. There was a vast amount of food to choose from, ranging from breakfast and egg options, to traditional Sunday roast meats, chicken, fish and vegetarian dishes. Fruit, smoked salmon, oysters, cold meats, cheese, many salad and deli options, soup, desserts, etc. all fresh, well prepared and delicious. Excellent welcome from the restaurant manager Jason le Fleur, very friendly and accommodation. A really lovely way to spend a Sunday afternoon, whether you are staying at the Mount Nelson or not.", "user": "Bld211", "date": "December 30, 2011", "id": 122292520}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "It has been 11 years since I last went to the Mount nelson hotel . It was a moment of fond memories to go back and experience the high tea of the Mount Nelson hotel.", "title": "old englsh charm with a touch of vavavoom", "helpfulness": 2, "user": "Vernon G", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122155173}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I was most impressed to recognise some of the waitering staff who used to serve me . my favourite champagne was served without asking by the same gentleman who used to serve me everyday pink champagne. We were a group of 8 people who travelled from bermuda and this experience was well worth every penny.", "title": "Again simply first class", "helpfulness": 2, "user": "Gwils32", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121519589}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 5, "variance": {"poor": 9, "average": 27, "very good": 66, "terrible": 8, "excellent": 501}, "aka": "Mount Nelson Cape Town", "slim_ranking": 0.116666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 4.5}, "description": "Set in the vibrant heart of Cape Town, Mount Nelson Hotel offers easy access to all that’s happening in this dynamic city. Enjoying a superb location at the foot of Table Mountain, and just a short stroll from downtown, Mount Nelson Hotel offers the perfect combination of leafy tranquillity and contemporary buzz.Whether dining on exotic Cape cuisine, soaking up the sun on any of the stunning beaches nearby or getting ready to stroll down fashionable Kloof Street, guests have the ideal central base from which to discover this exhilarating city."}