{"user_rating": 4.0, "review_count": 344, "name": "Mt. McKinley Princess Wilderness Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed for one night in the Princess McKinley Lodge at Mount McKinley and totally agree with previous reviewers that they really do not want to know you if you are not part of a cruise package. We had booked this as a way to go into Denali by train and so booked from Anchorage up to the lodge, stayed 1 night and travelled on the next day by train to Fairbanks. The Princess people sent our suitcases to their other lodge in Denali and so we ended up not being able to do anything for the night we were there due to the weather being very rainy and no clothes to change into. They did find out suitcases later in the evening and also gave us a $50 voucher, but the stopover was ruined. The following morning we were due to get their coach to the rail station in Talkeetna for our onward journey. It was due to leave at 0900 and we were duly in the lobby for our transfer. Only one coach pulled up and we asked the driver if he was going to the station - the answer was a very resounding no! We again waited. No other coaches came. I went inside the lodge to enquire where we got the coach. We were told to get on the one outside. Went again to the driver so he could again,very rudely, tell us he was not going to the train station. A person came out of the lodge to tell the driver to take us to the station on his way to Talkeetna - literally 3 minutes from Talkeetna. Just got to the station in time for our train to Fairbanks. Seriously bad service! Everything is based around the full coach/cruise tours and if you're not part of them they don't want to know.", "title": "Mass market, very expensive, nothing special - except for the view!", "helpfulness": 1, "user": "Something-Different!", "date": "September 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 78538651}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "The rooms were clean and fairly large. As they are in large blocks dotted around the area you can be some distance away from the main lodge with the restaurant and bar. This in itself would be okay if the weather was good but as it rains most of the time you can get pretty wet just walking around the property. I'm sure the view of McKinley would be spectacular as you are only about 40 miles away, but we were not lucky with the weather. Wouldn't recommend unless you are on a full Princess Cruise Tour.", "title": "Great views of McKinley.", "user": "Okpeople", "date": "September 6, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 78455167}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Great staff, decent food and worth the stay for a night or two. Not much to do at the lodge with exception of couple short hiking trails. The lodge does cater to cruise groups. The Mahays jet boat tour up the rapids and K2 flight tours are a must in Talkeetna!!", "title": "awesome view of Mt McKinley", "helpfulness": 1, "user": "rasna10", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77913624}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Awesome..views..the lodge is very well located and has beautiful decks for lookouts..it also has grill restaurant for late night dinners and have a good restaurant for lunch as well.The lodge is big and the parking is not really right near the bldgs..so be prepared to walk..and no elevators in the building..so have to haul the luggage yourself...but the room was cozy and comfy..definitely recommend it for the view and amenities...", "title": "Good Rooms. Great View!", "helpfulness": 1, "user": "MissEuro", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77843695}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I was a little sceptical after reading the reviews on trip advisor but the hotel turned out to be a good choice. Sure it is not located within the National Park but we found ourselves liking the State Park much better anyway. From the hotel property (and the window spots in the restaurants) we had a great view of Mt. McKinely. This view alone was worth the stay. The room was clean and spacious. The restaurants were decent and had enough choices (although there was a negative experience with reindeer sausage). Nearby is Byer Lake which was great for a tranquil kayaking trip. We were the ONLY people on the entire lake. The drive to the National Park entrance is about 2 hours. Seems a lot but there are plenty of hiking trails in the State Park as well. Also, the weather was much nicer where we stayed!", "title": "Wonderful away from it all lodge", "user": "jra3", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 77343861}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "We stayed 2 nights here. Dismayed when we pulled back the quilt to see unironed sheets.", "title": "Didn't live up to expectations.", "user": "gingk0", "date": "August 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75943723}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Also room still not made up until well into the afternoon. I finally had to ask at reception.", "title": "Great View and Great Value!", "user": "KCCAC", "date": "August 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75851176}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Went to lecture and paid $8 for a film of the northern lights. All the lectures we heard in Alaska seemed to be aimed at children. Fair enough, why not say so.", "title": "We were booked for a room with two double...", "user": "peppermintpatties", "date": "August 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 74383528}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Went to 20/80 restaurant.Good decor and food. Excellent service. Also went to restaurant in the main lodge where the food was good.", "title": "Great Location - Good Price", "user": "y2kman", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74196988}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "It was raining heavily so we were forced to hang around the 'games room' and were shocked to see how dilapidated the furniture was. No doubt it is heavily used, but can't imagine how long it is since it has been refurbished. Really shabby.", "title": "I would not go there again\"", "helpfulness": 1, "user": "nishendu", "date": "August 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 73826175}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This is a wonderful and relaxing lodge with wonderful views and common areas. The room are in separate buildings and are uphill, although there is a shuttle bus to lessen the hike uphill. The staff and atmosphere was wonderful and the clouds parted during the evening to provide a view of Mt. McKinley. The only negative was the Internet access. If closer, we would love to stay again.", "title": "Wish we'd stayed longer", "helpfulness": 1, "user": "MimiMom68", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71283601}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Full disclosure: We were on a Princess Cruise/Land Tour so this lodge was included; therefore, we cannot really comment on the price. The room was beautifully decorated, but lacked some amenities which is a small complaint, but pretty surprising with the Princess brand. The Lodge has many different buildings and the grounds are beautifully maintained and lovely along with some wonderful trails. There are laundry facilities and vending located at several of the buildings, which was very convenient. The main lodge is a gorgeous building with fantastic views. Even if McKinley is not \"out,\" the views to the river are very beautiful. The lobby area is very well done and the gift shop and restaurants are well run and friendly. We had food in the \"pub\" and it was average. Jason was our waiter and did an outstanding job. My husband had breakfast in the main dining room and said his pancakes were ok. There are several spaces for relaxation at the Lodge and also an internet area set up along one wall of one of these rooms. A large fireplace in the main lobby area is a great place to relax with a book. My favorite part of this lodge was the coffee bar. After our cruise, we had taken the McKinley Express to a coach taking us to the Princess McKinley Lodge, so after so many of the Princess' (very delicious) breakfast buffets, it was such a great treat for me to enjoy a fantastic coffee drink and some of their delicious pastries (and the friendliest service on our entire land tour). After the cruise and train, Princess McKinley Lodge was just the perfect spot to STOP and really get a good night's sleep. I know there have been travelers who have been bored at this Lodge. I think part of it is if Mt. McKinley is not \"out,\" then they feel like they have wasted their time. There are activities and the hotel will help you arrange these for the hours you are there (but, of course, there is a cost to all of this :) ). There is also a fitness center and a hot tub (if you are brave enough in some cold temps). Also, for those on a Cruise/Land Package, one has to check out of the room by 11 a.m. and then just wait until it is time to take the coach to the next stop, which can be frustrating. It is true that if you are interested in really exploring all that Denali has to offer, you would be happier if you stayed at Denali (the Princess Denali Wilderness Lodge comes to mind). Personally, I just loved the opportunity to sleep in (in a very comfortable bed BTW), have a relaxing morning in the coffee bar, photograph the views from the gorgeous veranda (and Mt. McKinley was all clouded over), and then kick back with a book next to the fireplace and have a chat or two with other travelers. Then I felt really ready for the next part of the trip.", "title": "If you need some really good REST - this is for you", "helpfulness": 3, "user": "ninjaqueen", "date": "July 8, 2010", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 70151799}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We were very disappointed by its remoteness. Princess found a great location for viewing Mt. McKinley, but there is absolutely nothing to do once you get there. If you want to go to Talkeetna, you have to take a shuttle in 50 miles. If you want to dine some place other than at the Lodge, you have to take the shuttle to Talkeetna. The trails around the hotel are short. The room was generic at best with stark white walls.", "title": "Not fit for a Princess", "user": "Linnbada", "date": "July 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 69377208}, {"rating": 3.0, "title": "Nice & relaxing ...but very remote", "text": "My husband and I stayed here as part of our Princess cruise tour for our honeymoon. It was our last stop before heading back home - which for us worked out well as we stayed relaxing. There is not much to do here other than sit down on the deck looking out at Mt McKinley (if you're lucky enough to see it), go for a walk on one of the nature trails, shop in the souvenir shop, eat at one of the restaurants, work out abit on the few exercise machines available or enjoy the views from the outdoor hot tubs. Other than that.... you're isolated. If you don't have a car, they do offer a bus service that takes you into town (I believe it takes about 45 mins). However, again....not much to do in town unless you're booking some excursion such as flightseeing or some boat trip. Other than that its just souvenir shops and restaurants again.", "helpfulness": 1, "user": "oRi_5", "date": "February 27, 2010", "id": 57227345}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We enjoyed our stay at Talkeetna simply because as previously mentioned, it was our last stop after a 2 week cruise tour around Alaska. So for us, we made the most of it and just stayed in the resort. We were lucky enough to have nice, warm sunshine and excellent views of the Great One when we were there. So we just spent our time sipping cocktails on the terrace, enjoying walks on some of the trails and relaxing in the hot tubs (great for romance!!! ;) ).", "title": "Breathtaking View, Good Food, and Relaxing Atmosphere", "user": "VideoByV", "date": "February 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 56811979}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Stayed here at the end of a Princess cruisetour and what a wonderful experience. It is indeed remote, but was part of what we loved. The whole lodge complex is very well kept and our room was very clean and comfortable. We appreciated the lodgely decor and it fit very well with the surroundings. The main lodge has free wi-fi and we enjoyed playing some of the board games available and table air hockey. There is a nice but small gift shop in the main lodge, and they were very helpful in mailing our packages home. We ate a both restaurants and the food was good at both places. The best part was sitting outside & enjoying a drink while watching for \"peek-a-boo\" mountain (Denali) to come out. There are outside hot tubs available, but we never made it up to them. We hiked the trails on the property and just thoroughly enjoyed our whole stay. If you are the type that needs a lot of shopping, touristy attractions, then you will be disappointed here. If you love nature, beautiful views and just relaxing...then you will love it here.", "title": "Wonderful, Clean and Relaxing", "helpfulness": 2, "user": "Ozarkstravelover", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73740646}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This hotel is very nice, again like previous reviewers have stated it caters to cruise passengers on a land tour. However, we were treated very well during our stay here. We were put up in the farthest building from the lodge. The front desk employees were more than willing to explain that the reason for this is they try and keep tour passengers together and closer to the lodge for transportation and accountability reasons. Our building was beautifully decorated and very quiet. Parking was down the hill about 400 yards away but there is a shuttle that is provided free of charge that will take you anywhere on the grounds. This shuttle seemed to come around once every 10 minutes or so. The staff was very polite and friendly. There is not much to do at this lodge other than a few trails. If you are staying here it is about 100 miles South of Denali National Park and about 50 miles North of Talkeetna. The tour desk was more than helpful in finding activities for us to do even though we were not with one of their tours.", "title": "Beautiful", "user": "12112012c", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 73493560}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Very remote place, so you'll need to keep that in mind! But oh so lovely! Rooms were very comfy and the staff exceptionally friendly! Free internet. We stay in a building a short distance from the main lodge, but there was a free shuttle and the walkways were well maintained. Food was a bit pricey, but that is the usual for Alaska. Wonderful viewing deck and lots of quiet areas to read and just enjoy. Lodge fireplace was a nice plus for this Florida girl! Mt McKinley viewing was a myth when we were there, but heard it was all out in its glory a few days earlier. Not a big social center, which was just what we wanted!", "title": "True lodge experience!", "helpfulness": 1, "user": "Samsrobin", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73321492}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Spent 2 nights here ,comfortable base for sightseeing in Alaska,many tours and excursions available ,both through the lodge and independent .", "title": "beautiful lodge", "user": "gardener46", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72647968}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "A beautifully situated lodge with outstanding views of Mt. McKinley - weather permitting. The grounds were clean and well maintained. We were part of the first group staying at the lodge this season so there were a few minor glitches but the staff worked hard on them and everything turned out fine. Rooms were clean and comfortable.", "title": "Outstanding views of Mt. McKinley", "user": "TCFLongIsland_NY", "date": "July 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71796989}], "location": {"country": "United States", "city": "Trapper Creek"}, "stars": 4, "variance": {"poor": 21, "average": 66, "very good": 145, "terrible": 9, "excellent": 103}, "aka": "Mt. Mckinley Princess Wilderness Hotel", "slim_ranking": 0.25}