{"user_rating": 4.5, "review_count": 58, "name": "Mt Liberty Lodging", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011", "text": "I think your reaction to this hotel all depends on what you're used to and what you're expectations are. For me it was just a little too basic, but according to other reviews it was just right.", "title": "Depends on what you're used to", "helpfulness": 3, "user": "cool_teacher590", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 115451054}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Positives:", "title": "Been coming here for years", "user": "davila16", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115181957}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "1. It was clean. Nothing was dirty or grimy, which was really impressive.", "title": "Not so great - very old and run down - not worth the price.", "helpfulness": 4, "user": "minggirl1", "date": "July 4, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 115019149}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "2. There were some new fixtures. All the flooring looked new, especially the bathroom.", "title": "Home away from home", "user": "mamadukesek", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83310811}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "3. The Pemi River ran right behind the hotel. My kids had a great time wading and playing in it.", "title": "great value- really nice people", "user": "DARUT", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82532914}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We sifted through many hotels, motels, lodges and cabins via the Internet and wanting something on the water we decided to go with Mt. Liberty. All arrangements were made through e-mail and went off without a hitch. Without giving away which cabin we stayed in (we would like it to be available next time we want to book it) we got what we wanted. If you fell off the cabin's rear deck you would just miss landing in the river. The river's rapids are so loud that, although the other cabins are close by, we had a pleasent sense of isolation and privacy. Lincoln, NH itself is a very nice town with plenty of stores, gas stations, restaurants and nice people. This may not seem impotant but we have stayed at lodges in NH that were a minimum of 20 minutes from the nearest anything. The next time we are in the White Mountains area would we stay at the Mt. Liberty Motel and Cabins? Absolutely.", "title": "Exactly As Advertised.", "user": "cosmicbull", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81367521}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This place was very lovely, exactly what I expected. We got a two-bedroom room for a really low price because it was off-season (leaf peeping starts in late September). The two-bedroom room was comfortable for two people, might have been a bit too small for four. there were two stove burners, a small fridge, microwave and pots/pans/dishes. It was perfect for fixing a quick breakfast before going out hiking to Franconian Gorge (less than a 10min drive away) and the other sites. Lincoln and Woodstock downtowns are right around the corner, maybe a 7 minute drive to restaurants/bars. The place was quaint, the owners very friendly. We had the cabin without the river view (#2 I think) but we could still see the river from the bathroom and kitchen and hear it (the other cabins were literally right alongside of the river). Only a few cons: we were right next to the highway, though it didn’t feel like it (didn’t hear cars; this is also a pro since it was easy to get where we wanted to go and easy to find the place). Also the beds are not the most comfortable though for sensitive sleepers, and there is no dvd player. Internet was a little shaky since we were set farther away but all in all this was a great spot for getting away for the weekend and enjoying nature!", "title": "peaceful, cute, convenient, good for enjoying nature", "user": "k0gee", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 80700513}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We have been visiting Mt. Liberty Motel & Cabins for several years. Every time, our visit has been a positive experience. The cabins are clean. The owners are friendly and welcoming.", "title": "Mt Libery Motel & Cabins are family friendly and are close to numerous family adventures.", "user": "mjr1027", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78053827}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It is a great place for family. Conveniently located, Whales Tales, Story Land, Clarks Bears and other family fun locations are close by. The motel/cabins are adjacent to the river. It is fun to head down to the river, climb the rocks and explore. There is a small swing set, a pool and a fire pit for roasting marshmellows.", "title": "Relaxing......", "user": "TheMaxims", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74910361}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We always have fun here and are never disappointed!", "title": "Very cute and charming!", "user": "TCM2303", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 73517681}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Darlene and Tom couldn't be nicer or more accomodating! Cabin was clean, cozy and had all the basics we needed (improvised on a cookie sheets). There was no musty smells like some cabins can have. If you don't operate well in small quarters, this isn't for you. It was fine for us! Great little porch to relax on. We were thrilled to have the cold river to soak our feet in post hiking. ahhhhh. It also provided great white noise for sleeping. We believe the places were all booked, but the noise level was wonderfully quiet. We plan to go back again!", "title": "Clean, cozy, refreshing!", "helpfulness": 1, "user": "eyesoutside", "date": "August 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117153967}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is a great place to stay if your going to the Franconia Notch area. The cabins are great. My husband and I stay here every year in the same cabin and can't imagine staying anywhere else. The cabins are clean and comfortable, with small fridge microwave, and two burner hot plate. There is also a coffee maker and toaster and all the pots, plates cups, utensils. There is also a charcole grill in front of every cabin. Tom and Darlene are great. They take such good care of the property and rooms. They are full of information about the things going on and places to see. Very nice people! You are so close to all kinds of fun. From taking a walk through the Basin, to real hiker hikes at the trailheads, to all the bike paths, Loon or Cannon Mountains to Lost River or Clarks Trading Post. Mount Liberty is positioned just right. This is the place to stay, with friendly people, clean rooms and the perfect atmosphere! There is a motel here also that we have never stayed in, but I figure that if the cabins are clean and neat then it must be the same in the motel. Good value.", "title": "Great place!!!", "helpfulness": 1, "user": "Susan R", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117024852}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We had been to Lincoln last winter and loved it so much we decided to come back this summer. I looked for the cheapest lodging that I could find, but also wanted a place that was clean and not creepy. With a room for $81.25 per night for four nights (that includes the tax) the Mt. Liberty Motel fit the bill.", "title": "Adequate place to stay for a summer vacation", "helpfulness": 3, "user": "RogerAnthony", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 116933675}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The rooms, as previous reviewers have said were very clean. The location is perfect as it is on the banks of the Pemigewasset River. We loved swimming in the river! It is also right near all attractions in Lincoln. Motel management was very friendly.", "title": "Cabins are great!", "helpfulness": 1, "user": "VERMONTCOUPLE", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116274437}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "In terms of the room, we got what we paid for. It was clean, but small. There were many minolr maintenance issues with the room such as a cracked front window, a non-functional dead bolt, a missing bathroom door lock, and a shower that has trouble keeping a constant temperature.", "title": "Friendly, Cozy, Quiet and WAY MORE!!!", "helpfulness": 1, "user": "angelnut26", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115974941}, {"rating": 3.0, "title": "Compliments for a place we didn't even stay at", "text": "Due to confusion with our GPS and a myriad of other very amusing coincidences, we wound up checking in at this hotel, even though our reservation was down the road at a similarly named hotel. We wound up leaving, in order to honor our reservation. So while we didn't actually spend the night here, I can tell you that the owners are very nice and professional, the rooms are clean, and the setting is amazing. Also, the price is right. Sure, it is not super modern, and the bathrooms are probably the most rustic features (kind of the Home Depot DIY shower install with plastic walls and a shower liner for a door), but are you here to shower, or to go exploring?", "user": "Gemutlichkeit", "date": "May 19, 2012", "id": 130212390}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The owners are awesome. They cranked our heat for our late arrival and cleaned up every day. I don't even make my bed at home but they made it for us. Will be returning next year, we hope!!", "title": "We loved it", "helpfulness": 1, "user": "kaybe341533", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119293202}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My family and I initially stayed at the EconoLodge down the street, but the room was stuffy, had a funny smell to it and the beds were just downright uncomfortable. So, we left not really knowing where we were going to stay because we didn't make reservations ahead of time. So, not having a specific plan, we set out to find somewhere the was reasonably priced, comfortable, family friendly and not too far from the main road. We remembered a place that we stayed at about 10 years ago, but we were without kids at that time, so our options were more flexible. We ended up at Mt. Liberty, where Tom and Darlene greeted us with a warm smile...the kind you get from a relative that you haven't seen in a few years. We talked about options, rooms, cottages, prices....and local fishing spots!! My son, going on 13 years old, absolutely loves to fish, but not being locals, we had no idea where to start. Tom was great in helping us out. In addition to helping us out with fishing, he put us in a cottage that was perfect for us...not too big, but enough room to move around without bumping into each other! Plus, the 'enclosed' back porch was amazing, especially in the morning with a fresh cup of coffee!! We had such a nice time with them that we stayed an extra nite and even when we finally did have to leave, we talked about staying 'one more nite' just to enjoy the area. So, if you're ever in the Lincoln, NH area, I would HIGHLY recommend staying with them. They make you feel right at home and will do almost anything to make your stay an enjoyable one!! Thank you, Tom and Darlene! You made it all worth staying!", "title": "VERY CLEAN, INCREDIBLY WELCOMING PEOPLE!!!", "helpfulness": 2, "user": "kd11980", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118173715}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "~Karen (and Family)", "title": "Down home lodging", "helpfulness": 2, "user": "B Bob C", "date": "September 14, 2011", "detail_rating": {"location": 5.0, "value": 4.0, "rooms": 3.0}, "id": 118125614}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "You will enjoy the Mt. Liberty Motel and cabins if you do not have high expectations and enjoy vintage \"Mom and Pop\" lodging. The location is wonderful as the property is directly on the Pemigawasset river. Our rooms were in the strip hotel toward the front of the property and road noise could be heard, although it was not particularly bothersome. The motel rooms have a very curious layout, with a very small \"living room\" barely large enough for a couple of chairs and a TV. Adjacent to that is a tiny bedroom with only walking space around the bed and no other furniture in the room. The bathroom is also tiny and the shower would be a squeeze for larger individuals. Topping it all off is a very compact screened porch with room for two chairs.", "title": "Great Family feel, will definitely be back again!!", "helpfulness": 2, "user": "Jessica D", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117192631}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 9, "very good": 8, "terrible": 1, "excellent": 40}, "aka": "Mt Liberty Lodging Lincoln, NH - White Mountains", "slim_ranking": 0.2, "description": "Located off RT 3 along the Pemi River in the heart of the White Mountains, 14 one and two BR non-smoking motel units w/CCTV, AC & coffeemakers w/ complementary coffee & tea. 8 - one and two BR cottages that sleep 2 to 6 guests - with 6 right on the river w/ kitchenettes, gas grills and beautiful views of the river. Amemities - free wireless internet, 20x40 inground pool, swingset with large play area for children and a firepit for toasting marshmallows, fishing, hiking trails & many actvities nearby."}