{"user_rating": 5.0, "review_count": 153, "name": "Munden House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed here recently for a couple of nights, very impressed. Colin and Annie are the perfect hosts, the rooms are very comfortable and spotlessly clean. We elected to have dinner, bed and breakfast, and all meals were better than restaurant standard – I especially loved Annie’s homemade toffee sauce served with my porridge!", "title": "Superb", "user": "Lapchien", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152971909}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I can’t fault this place at all, it’s probably the best B&B in Dorset!", "title": "A little bit of Heaven.", "user": "Patricia D", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147661161}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "What a Lovely spot.! Wonderfully peaceful and comfortable. Annie & Colin were the perfect hosts and Annie is a great cook !!", "title": "A great place to stay", "user": "didigabi", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145663339}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our room was very comfortable and looked out on to the garden which I imagine in spring is a riot of flowers.", "title": "A lovely place to stay in a quiet location", "user": "528Syd", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145069388}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The nearest town is Sherborne and is what you hope a town will be - independent shops (with no empty ones!)", "title": "Quality Accommodation and Hospitality", "user": "AlibongoLondon", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144936908}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Very welcoming couple running the B&B, arrived at around 8pm and needed to get something to eat, they were happy to reccomend a couple of places in the nearby village and gave me advice to avoid some others. Room was large and comfortable with free wi-fi. Very accomodating regarding breakfast request and food was of a good standard. Probably the best B&B I've stayed in and far preferrable to the usual premier inns I end up in as part of my business travel.", "title": "Nice B&B", "user": "Lee1977Leeds", "date": "November 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 144760286}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed overnight in the Garden Cottage, which is like a one bed house, including an extensive kitchen, comfortable sitting room, beautifully appointed bedroom with ultra-comfy bed and sumptious bedding, and a magnificent power shower in the large shower of the ensuite. With everything thought of, including a good selection of refreshments and fresh milk provided, lovely toiletries, interesting and varied choice of books, free WiFi, flat screen TV and, through the french doors, a secluded private patio overlooking the landscaped garden, which would be wonderful for a quiet sundowner drink in summer. Breakfast is taken in the main house, which also has B&B rooms, a very welcoming guest lounge and a calm, elegant, exceptionally well-catered for dining-room. Breakfast features a wide selection, including fruit and cereals, cook-to-order English breakfast with locally sourced ingredients, with fresh laid eggs courtesy of the on-site chickens. Colin, Annie and the breakfast waitress were charming, friendly, helpful and did everything they could to make our stay enjoyable and memorable. It was bliss.", "title": "Quality accommodation, everything thought of, wonderful breakfast", "user": "aurora1962", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144541604}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Our first stopping visit to the area, we were enchanted by the region and discussed buying a holiday home. On reflection, why bother? It's easier and more cost effective to book here and indulge ourselves in this lovely accommodation and exquisite service. I'm looking forward to returning, and am confident the second experience will be as good as the first.", "title": "A bit of paradise", "user": "Ken P", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144112856}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "A very beautiful property situated in a rural setting but close to the town centre. The owners Colin and Ann could not have been nicer and the breakfast was excellent.If you are looking for a quiet place to stay in one of the loveliest parts of England with top quality accomodation and great food you will find it here.", "title": "a perfect birthday weekend for all the family", "user": "Simon W", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144002957}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Returning to Munden House was like coming home - this time with all the family (12 of us). As a venue for a special birthday celebration it was ideal and Annie and Colin were so warm and welcoming that everyone felt instantly relaxed. The 'Middle East Feast' on the Friday was perfect and the breakfasts delicious. With the beautiful Dorset scenery (sadly a little wet at times) all around this is a great place for a short break and we are already planning another return trip.", "title": "\"Fabulous for a wonderful weekend\"", "user": "luvmytripsCheltenham", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142630992}, {"rating": 5.0, "title": "Top Rate Hospitality", "text": "We can only concur with previous glowing reviews of this charming B&B. We particularly enjoyed a home cooked dinner of very high quality and the warm and attentive service throughout our stay. This is a great place to stay to explore this attractive corner of Dorset", "helpfulness": 1, "user": "Carpetman", "date": "September 4, 2012", "id": 139377468}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We wanted somewhere comfortable and lovely for us and our immediate family to stay for two nights for our nearby wedding in Sherborne. We booked all 7 rooms in this gorgeous B&B, and we could not have made a better choice than to stay at Munden House. Our family were all so excited with their rooms, and secretly telling us 'I think we've got the best room!'. As bride and groom, WE obviously did get the best room! We stayed in the Summer House, where the 'shed with a chandelier' (as described by Colin, the owner, when I first phoned!) was a gorgeous self-contained holiday house, but also a dressing room for the bride and bidesmaid and gave our photographer a beautiful backdrop for some gorgeous images. Our stay was just wonderful, and we wished we could have stay longer!", "title": "Wonderful!", "helpfulness": 2, "user": "MrAndMrsLauder", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139087584}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Annie prepared beautiful breakfasts for us all, and gave us, the Bride and Groom, a breakfast on our private decking the morning after our Big Day. Delicious! Annie was so helpful with offers of a home cooked dinner, recommendations for restaurants in town and taxis. As hosts, they were warm and welcoming. Anyone lucky enough to find this B&B will be in for a treat! We had the most amazing wedding day, and no doubt our stay at Munden House started and finished it off perfectly.", "title": "Wonderful, warm and welcoming", "helpfulness": 1, "user": "HazLondon", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138001921}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Excellent place to stay!", "title": "Perfection", "helpfulness": 1, "user": "hoteljunkieBrighton", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137346164}, {"rating": 5.0, "title": "Outstanding", "text": "We hired the whole place out for a weekend while hosting a wedding nearby. Annie and Colin went out of their way to help in any way possible and are great hosts. The rooms are clean, bright/light and airy, have all comforts needed and the beds are cosy.", "user": "Jenny G", "date": "August 5, 2012", "id": 136273702}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Munden House is a true benchmark for how a Boutique Hotel, Country Inn or B&B should be run. Colin and Annie are charming hosts who made us feel at home the moment we set foot in the front door. Our room was well appointed with all we needed for a comfortable stay. Annie cooked us a lovely three course meal washed down with a Prosecco from a small but interesting list of Italian wines. If you want a place to chill out Munden House is a perfect venue and there is a lovely easy walk into Sherborne and then a taxi back for a fiver !! Great stay, thank you Colin and Annie we loved it.", "title": "Best in Class by Far !!", "helpfulness": 2, "user": "Bakkies53", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140977384}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I wanted to book a surprise family weekend away for my husband who had just retired and spent ages looking around and reading reviews and stumbled across Munden House, so decided to book. If you're looking to stay somewhere really special this is the place. Everything was perfect and Annie and Colin the owners went out of their way to make the weekend brilliant. We stayed in the Summer House which is truly beautiful. There is nothing corporate or standard about Munden House. The meal Annie prepared for us on the saturday evening was delicious. None of us wanted to leave, and we will definitely be back. There are lots of lots of places to choose to stay but if you choose Munden House - you will not be disappointed. Magical.", "title": "Fantastic place to stay", "user": "milfordboys", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140856636}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Nice place, all the reviews are accurate, however this is still a B&B so for $150 per night you would expect it to be hotel standard.", "title": "Very nice but pricey", "user": "dani162", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140541430}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "It's situated in the country a bit out of Sherbourne which means you need to a car to get to the main town because it is too far to walk.", "title": "Top class accommodation,food & hosts", "user": "Smbcdw", "date": "September 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140475248}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The best b&b I have ever stayed at. Owners are welcoming & very attentive. Rooms are immaculate with really comfortable beds with that extre special touch. Beautiful views of the countryside from the dining room. The breakfast was of good quality and very tasty. Would deffinately stay here again.", "title": "Garden shed with a chandelier!", "helpfulness": 1, "user": "gazinho", "date": "September 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 140199126}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 1, "average": 0, "very good": 9, "terrible": 1, "excellent": 142}, "slim_ranking": 1.0}