{"user_rating": 4.5, "review_count": 77, "name": "Mungo Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "What a wonderful experience we had at Mungo Lodge! This is true outback homestead style with an unexpected French touch via the wonderful hosts Catherine and Jacques. The whole lodge was rebuilt four years ago, so everything is new and beautifully maintained. The main lodge houses the enormous restaurant and bar, complete with a huge open fire and another wood fire and a TV/lounge area, plus lots of undercover and open decks for enjoying a late afternoon drink. The rooms are cabin style - ours had a king bed, a sitting area and a front and rear undercover deck. The perfect place to stretch out after a day of exploring Mungo National Park. We made full use of the restaurant - we had a simple but filling continental breakfast each morning, enjoyed a picnic lunch one day (quiche, salad, fruit, fruit cake) and had dinner there on both nights. The means are very hearty - and yes, Catherine's lamb shanks are melt-in-the-mouth good. But leave room for her creme brulee - it is a silken masterpiece with a perfectly cracking top. We visited in September and the weather was superb - crisp mornings, warm days, fabulous sunsets and great birdwatching. And the stars at night are amazing! If camping is not you, then this is THE perfect option for your Mungo experience. You really need two nights to get the most out of the lodge and the National Park. Loved it all! Be warned - there is no mobile phone reception at Mungo. There is wifi at Mungo Lodge but only in the main part of the lodge. To be perfectly honest, I enjoyed being out of range for a few days.", "title": "Made our Mungo experience incredibly memorable", "helpfulness": 1, "user": "jmlparis", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140140420}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "As many other reviewers have said this a really good stop in a rather remote part of Australia. The rooms are very comfortable and we also found Catherine's evening meal to be excellent. The scotch fillet was excellent as was the lamb shank. There is also a good value wine list.", "title": "Standards Continue be high", "user": "wyego", "date": "August 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138302116}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Bottom line is that Jacques and Catherine are keeing up the good work", "title": "Lesley, Melbourne", "user": "firenzehen", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129483769}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We have just returned from spending 4 nights at Mungo Lodge. It was a wonderful experience with comfortable clean rooms. Friendly welcoming staff and a great lounge area with a roaring open fire to greet you.", "title": "Birds , sunsets, lovely hosts.", "user": "SandypHobart", "date": "April 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128202890}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "An short drive onto Mungo National Park and visitors centre.", "title": "Joyful isolation", "user": "tony_mo", "date": "October 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119052190}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This place is a wonderful modern (as of 2011) property right on the border of Mungo NP. The rooms are cosy, but very clean with modern furnishings. The managers were very warm and helpful and made you feel most welcome. You get a real sense of being in the outback as the property has been built to meld into its surroundings. I have only rated the property 4 stars for 2 reasons. 1) the property is remote and there is no access to shops, so you need to be willing to pay a high price for breakfast and lunch (there should have been at least some inclusion of either in the price); and 2) the property is not absolute luxury – you get everything you want but do not get the sense of being spoilt. The highlight of the stay was eating a Lodge prepared dinner which was as good as any top restaurant I have eaten at.", "title": "Great clean accommodation with wonderful hosts", "helpfulness": 1, "user": "Alex M", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118948595}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I felt a bit guilty booking this luxurious accommodation in such a remote area. The lodge has a number of 2 person and 4 person cabins and, for the region, the standard is quite high. Our cabin had a large flat screen TV, airconditioning to every room and a fully equipped kitchen.", "title": "Perfect spot to base yourself to explore Mungo if you don't want to rough it", "user": "MrShhh", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118922155}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The cabins also have a great verandah which would be a great place to chill out with drinks after a big day exploring.", "title": "Peace, confort and warm welcome", "user": "nosvoyages", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116294757}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Jacques and Catherine are the managers of the resort and do a great job making you feel welcomed and in particular Jacques' recommendations were valuable to us as we had some pretty variable weather on our stay. The Mungo self-guided track can be closed at short notice in bad weather.", "title": "Simply Superb - we Will be back", "user": "landth", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116159077}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The restaurant is quite a stand out- I can still recall the tenderness of the steaks and shanks- HIGHLY recommended!! The dinners are great but the menu is understandably a bit more limited at breakfast and lunch.", "title": "Relax in style in the outback", "helpfulness": 1, "user": "canadianexpat035", "date": "May 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106323441}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed in one of the cabins set around the lodge. Well designed rooms with full mod cons were a pleasant surprise out in the middle of the saltbush.", "title": "Wonderful spot to explore Mungo National Park from", "user": "omelettecottage", "date": "April 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 105561208}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The only negative point was the quality of food in the restaurant which didn't match the excellent quality of the rest of the stay.", "title": "A piece of uncommon outback luxury", "helpfulness": 3, "user": "Bruce_Nason", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 85236560}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Let get this out of the way - it's expensive. But given the remote location it is worth it. Big stylish rooms with awesome king beds (it's a long dirty drive to get there), air con, great verandahs with private views of the outback bush, TV and all that you would expect from a 4 star stay. The restaurant is the best for 300km - with first class deserts (try the creme brulee) and a good wine selection :-)", "title": "A truly lovely place to stay in an awesome location", "helpfulness": 3, "user": "peder182", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82024722}, {"rating": 4.0, "title": "Immaculately presented", "text": "Mungo NP exceeds expectations and is only a 10 min drive away - beyond the significant archaeological record of the place - we thoroughly recommend the 70 km self guided tour drive (takes 2-3 hrs) which you can do in a normal car (our car was a Prius so ground clearance LOW but no problems) - recommend getting out of the car at any of the stops along this drive and doing the walks - stop for a few minutes and the outback wildlife will come to you. Just great! Bruce & Nason", "user": "TazzieDevils", "date": "August 31, 2010", "id": 77631898}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This is a really great place to stay to explore Mungo National Park. The hotel had everything you would want despite being located in the middle of the outback. The cabins are very well equipped and tastefully furnished and have all you need for a great stay. Bed was very comfortable and room was immaculately clean. The bathroom, and the quality of the shower was really very good. Outback there is a private seating area with great views of kangaroos, birds and other wildlife.", "title": "Fabulous & comfortable place to stay in the outback", "user": "Dorie", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60866818}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "A serene experience... service was friendly and helpful.", "title": "Perfect", "user": "Delvinorth", "date": "January 22, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54130145}, {"rating": 4.0, "title": "Friendly Eco Resort in the desert", "text": "Perfect accommodation, relaxing atmosphere - a great base to explore Mungo National Park.", "user": "NZMade", "date": "January 17, 2010", "id": 53723048}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Overall we had a very pleasant stay at Mungo Lodge , which is somewhat of an oasis in an otherwise deserted and isolated part of Australia. Compared to other accommodation offered in the region, the cabins are luxurious and very modern. The restaurant meals were delicious and substantial, however the restaurant hours are limited and you don’t want to miss meal times as there are no other food outlets within 100km. The downsides (slightly scratchy sheets & a squeaky bathroom door) were easy to overlook in what is a well run and unique accommodation in the desert.", "title": "A bit of luxury in the middle of the outback", "user": "Matthew99s", "date": "January 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53435222}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Buronga"}, "variance": {"poor": 3, "average": 2, "very good": 13, "terrible": 1, "excellent": 58}, "slim_ranking": 0.666666666667}