{"user_rating": 4.5, "review_count": 190, "name": "Muri Beachcomber", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Chose the Beachcomber having scrutinised Trip Advisor.", "title": "Lovely accommodation in a beautiful accommodation", "helpfulness": 1, "user": "Swansonian", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 43557489}, {"rating": 3.0, "title": "Good location and reasonable options", "text": "There are definitely a lot of positives to pass on.", "user": "ashida_alain", "date": "August 29, 2009", "id": 39131413}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The location is superb, on a lovely beach with good swimming would choose the beachfront accommodation if possible). The flower scatterd throghout are a lovely touch.", "title": "Great Hotel and Location would definately stay again", "helpfulness": 2, "user": "MKEL09", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37760586}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The rooms/apartments are top class and spotless. There is a pool and the staff are very efficient, helpful and nice. The bus stop and bike hire facilities nearby are extremely convenient.", "title": "Absoloutley Awesome!", "helpfulness": 1, "user": "naughtysera", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37034905}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We were very lucky on our multi-stop South Pacific tour in that nothing at all went wrong and all of our accommodation was acceptable at the very least.", "title": "a nice friendly resort........", "helpfulness": 1, "user": "BritintheOrient", "date": "July 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 36267852}, {"rating": 4.0, "title": "Great location, Fairly quiet, Well-run property.", "text": "Great location on Muri Beach lagoon. Comfortable one-bedroom unit with air conditioning in the bedroom only. Free loan of sea kayaks and fins & masks. Helpful staff and small pool on-site. Close to car rental, burger joint, small stores and bus stop. Nice property, well-maintained, clean room. Rarotonga is beautiful and relaxing -- we'll be back. Bring extra sunscreen, camera batteries, Starbucks coffee, tins of food as everything is mucho expensive here. (My sunscreen cost three times as much as in Canada). The only complaint we have is the stereo blaring at the sailing club on race competition days. This is not the hotel's fault but the loud boom-boom-boom of the music was a complete turn-off to all the tourists on the beach and could even be heard while we were snorkeling far away. We would stay here again and hope to come back soon.", "user": "WBinBC", "date": "April 27, 2010", "id": 62547970}, {"rating": 5.0, "title": "Perfect - beautiful place and great owners", "text": "Myself and partner stayed here as a treat at the end of a 6-month trip and it was just what we wanted. The bungalow apartments are spacious and spotlessly clean, with self-catering facilities if wanted. The owners John & Debbie were so lovely and best of all so laid back about everything - in line with the whole feel of the island! It's about a 10-second stroll across the lawn right outside your door to one of the best beaches on the island. Kayaks and snorkelling equipment is there to use for free and there was always plenty of kayaks to go round.", "user": "Cat81England", "date": "April 2, 2010", "id": 60216785}, {"rating": 4.0, "title": "Nice Place, Friendly Staff, Beautifully Maintained Garden", "text": "If we are ever lucky enough to go back we will definitely stay here again, thanks John & Debbie.", "user": "alibuto", "date": "March 9, 2010", "id": 58160270}, {"rating": 5.0, "title": "A little piece of paradise.....", "text": "We were already on Rarotonga for a few days and were looking around for somewhere to stay for a few additional nights. We viewed a few places around Muri Beach and found Muri Beachcomber to be a great place.", "user": "Ali W", "date": "February 14, 2010", "id": 55920583}, {"rating": 5.0, "title": "The Best holiday ever!!!", "text": "The staff are friendly and helpful, the grounds are well kept and the beach frontage is beautiful. They are self-contained units, which means you prepare your own meals and drinks, but they do start you off with a litre of milk, a litre of juice, a loaf of bread, cereals, butter, tea, coffee and sugar so if you arrived late at least you could make yourself a breakfast in the morning.", "user": "WizzaWellington", "date": "January 28, 2010", "id": 54622669}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We spent 6 nights at Muri Beachcomber which is located right in the middle of Muri Beach. The rooms are clean and spacious with separate airconditioned bedrooms and well equipped kitchenettes. There are some great decks out the front that look over the lagoon and are perfect for a pre-dinner drink or two!", "title": "Wonderful location!", "helpfulness": 3, "user": "Angelco", "date": "July 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8066715, "likes": {"liked": "— Location is tops!", "disliked": "— Could do with a little more modernisation."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed for 10 days. Perfect place as it is not a \"full on\" resort, so less people. With kitchen facilities, complimentary kayaks, snorkelling gear. Everything you need within walking distance (dairy, butcher, chemist, restaurants) 20 mins scooter ride to town. Lovely friendly service.", "title": "Just what we needed", "helpfulness": 3, "user": "Karini", "date": "June 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8003091, "likes": {"liked": "— Location & facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Thank you for reading our review. We are a couple in our early 20's. We stayed at Muri Beachcomber for 14 nights as part of our Honeymoon. We got married at The Rarotongan Beach resort and Spa and stayed there for 7 nights, .", "title": "Very Cosy!", "helpfulness": 10, "user": "TravelBunnies29", "date": "June 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7969183, "likes": {"liked": "— The Unit and Staff", "disliked": "— The Beach"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We also stayed at The Aitutaki Lagoon Resort and Spa for 7 nights and and Muri Beach Club for 1 night.We were in the Cook Islands for a month.", "title": "Super place, Great value, gorgeous beach", "helpfulness": 3, "user": "CardiffBeachbums", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7873436, "likes": {"liked": "— On the beach", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "Not a great place", "text": "We will keep the writing brief as 'a picture tells a thousand words' , but we have outlined some Great and Not So Great features below:", "helpfulness": 2, "user": "rosebudAshburtonNZ", "date": "March 7, 2007", "id": 6928034}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "When we arrived our rooms was decorated with flowers.", "title": "Good place", "helpfulness": 2, "user": "MagnarMolde_Norway", "date": "April 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4939076}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Short way to the beach.", "title": "A good resort at a great location", "helpfulness": 12, "user": "SuzieRUk", "date": "January 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 4368303}, {"rating": 5.0, "title": "It doesn't get any better than this!", "text": "Island night in the hotel nearby.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "November 21, 2004", "id": 2838247}, {"rating": 3.0, "title": "great location but fairly basic accommodation", "text": "Stayed here on way back home from extended trip to Australia/NZ. Wonderful location on a paradise lagoon. The accommodation we stayed in was pretty basic (wooden hut in grounds near to beach), although I do understand that some more upmarket accommodation was available. Don't expect luxury otherwise. The staff at reception were very pleasant. For us though the main negative about the place was the number of cockroaches infesting our hut, despite our best attempts to keep them down with insecticide sprays. When we mentioned this to the staff on departure I got the impression that this was a known problem, but they proceeded to make light of it with comments such as \"oh, they fly in from elsewhere at this time of the year\". If the truth be told I expect that cockroaches are endemic on the island and other places may be not a lot better. Perhaps it was a one off, who knows? I hope so.", "user": "chemistatlarge", "date": "July 28, 2009", "id": 36015164}, {"rating": 5.0, "title": "Absolute paradise!", "text": "Another problem was the transportation back to the airport which had been booked for a certain number, but when it arrived a family of 5 extra plus an amazing amount of their luggage was waiting to be accommodated on the same bus. The driver tried to contact base for a bigger bus but in the end decided to pack us all in on his minibus. This was dangerously overloaded and luggage kept falling on to us whenever the driver braked. I am just grateful that we returned in the early hours of the morning when no traffic was around.", "user": "Helzibob", "date": "June 25, 2009", "id": 33144362}, {"rating": 5.0, "title": "Good location, clean & friendly atmosphere", "text": "I'd certainly love to go back to Muri Beach as a location but I think I'll try a different hotel next time.", "user": "DuggJ", "date": "June 2, 2009", "id": 31445112}, {"rating": 5.0, "title": "Best Holiday Location Ever", "text": "I spent 6 nights at the Muri Beachcomber but wished it was 6 months. The hotel is in the most beautiful location and the staff and friendly and helpful. The only down point is that the Cook Islands are on the other side of the world from me!", "user": "1986DL", "date": "May 8, 2009", "id": 29572025}, {"rating": 4.0, "title": "Great Place, will return..", "text": "Try the hokey pokey muffins from the shop down the road, they are gorgeous.", "user": "MelbourneStresshead", "date": "April 18, 2009", "id": 28296963}, {"rating": 4.0, "title": "Nice place for snorkelling... great value", "text": "My wife and I stayed here for 3 nights in Nov 2006. The resort has about 20 self-contained units (bedroom + bath + kitchen/living area) arranged roughly into three groups. Two of the groups of units are very close to the beach (you just walk down some stairs to get to the water), while the other group (the 'garden-view') is built around a nice pond. We stayed in a garden-view unit, and these actually looked nicer than the others (they were newer anyway). Our unit had an air-conditioned bedroom with nice bed (king-size, I think), a living/kitchen area with a small TV and DVD player and a bathroom. The units also had a nice porch with a gas grill.", "helpfulness": 10, "user": "grouchyincoach", "date": "January 27, 2007", "id": 6705484}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The resort is on Muri Lagoon, which is a large, shallow lagoon protected from the ocean by a barrier reef. The lagoon is so shallow in places that you can walk from the shore to one of the small islands several hundrer meters away. There's plenty to see while snorkelling around and it's also a good place to try out windsurfing. When we were there it seemed to be some kind of breeding season for the picasso triggers and they were pretty aggressive - some other snorkellers said they'd gotten nipped by one. The resort provides free snorkelling gear and kayaks - I'm not sure if the windsurfing equipment is free or not.", "title": "Muri Beachcomber a wondeful restful Holiday", "helpfulness": 10, "user": "Relick", "date": "October 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5924565, "likes": {"liked": "— Location and Cleanleness", "disliked": "— Roosters Crowing in the early hours of the morning and then all day long"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "A light breakfast is provided - basically a caraffe of juice, 4 slices of white bread (there is a toaster), some butter, jam and a 'Rarotonga pumpkin' - sort of a not-so-sweet papaya. Beyond that, things are a little slim food-wise. There are a couple of free-standing restaurants within walking distance in addition to one or two resorts with restaurants that are open to the public. There are also several small convenience-type stores around, but we didn't find these to be very helpful. We ended up taking the bus into town a couple of times and brought back some food from one of the larger markets. Most people just rent a scooter to get around (you can rent them right at the resort).", "title": "Muri Beachcomber is fantastic", "helpfulness": 23, "user": "Tipper2", "date": "August 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5612411}, {"rating": 4.0, "title": "Highly recommend it", "text": "There was a dive shop a short walk down the road. This wasn't a very fancy operation, but they had an adequate boat and decent gear. The staff was friendly and helpful and the trip was a great value at around $100US for a two-tank dive (including gear).", "helpfulness": 14, "user": "Gerryb48", "date": "June 26, 2006", "id": 5383186}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "There's a phone in the room that can be used to make free local calls. There is a PC with DSL-type internet access in the office that can be used for a fee, but there is no internet access in the rooms.", "title": "Great self-contained accommodation and location", "helpfulness": 27, "user": "Peaches8", "date": "May 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5204870}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "This was my third trip to the Cook Islands, my first stay at Muri Beachcomber. The rooms were clean, air-conditioned and fully equipped with kitchen facilities. Snorkelling equipment and kayaks were supplied. There was free local phone use, lines to hang washing, and internet was cheaper here than in town. No kids in the front bungalows, no noise after 11 pm. The rooms were serviced daily. The office staff were delightful. I really liked young children were restricted to a separate part of the property. Muri lagoon is beautiful. I would gladly stay here again.", "title": "laid back paradise", "helpfulness": 2, "user": "langleytraveller", "date": "January 26, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54464699}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We just spent one week here at the Muri Beachcomber and it was FANTASTIC!! The service, the people, the seaview unit and best of all the location. Central to everything and the view was awesome.", "title": "perfect place in perfect location", "helpfulness": 1, "user": "cel065", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50385666}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "This place is what Cook islands is all about. Maybe not the most luxurious of resorts but certainly not too shabby either. Even though it doesn't have a restaurant or bar here, there are so many around-just go for a walk along the beach and 200m there is one!!", "title": "Great location at an affordable price", "helpfulness": 1, "user": "keriman", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48726956}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Already planning our next trip..", "title": "Fantastic Location", "helpfulness": 1, "user": "aotearoanz", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46509111}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Great location and at an affordable price. Well located in Muri for restaurants, hire bikes, cafes and a great fresh bread shop just down the road. Very helpful staff who go out of their way to be friendly. Would stay again for sure.", "title": "Much more then I expected!!", "helpfulness": 2, "user": "kguerra", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 44514168}], "location": {"country": "Cook Islands", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 3, "average": 12, "very good": 47, "terrible": 0, "excellent": 128}, "aka": "Muri Beachcomber Hotel Muri", "slim_ranking": 0.294117647059, "description": "Prime position on beautiful Muri Lagoon with 16 Seaview units, 2 Garden Units, a 2 bedroom Family Garden unit and 3 luxury Watergarden Villas. All are fully self-contained with separate air-conditioned bedrooms, living/dining area, well-equipped kitchen and bathroom with shower. Facilities on-site include a swimming pool, barbecues, petanque court (bocce ball), guest laundry, motorbike hire, tour desk, snorkeling equipment, kayaks, stand up paddle boards and guest lounge with Sky TV.Shops and restaurants are adjacent with more within easy walking distance."}