{"user_rating": 3.0, "review_count": 98, "name": "My My Arthouse", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This place has a lot going for it: cheaper than most other places in Saigons backpacker area; cheaper tours than any other hotels; super-friendly and helpful staff; very clean modern rooms and AC; and a big cheap breakfast. It’s also away from the main roads so although at first you may feel like you’re in a rabbit warren you’ll soon be glad as it’s pretty hectic around the main roads (and not that attractive either).", "title": "Ideal for Backpackers", "user": "Iammmattdoran", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134508100}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We arrived early in the morning arriving on a sleeper bus. Our room in the hotel wouldn’t be ready until the previous guests checked out at 12. Alternatively, the friendly lady offered us a room in an affiliated building for the same price that was ready now. This was great as it was in a smaller quiet building only a couple of minutes away.", "title": "Handy location and nice rooms", "user": "kiwirish01", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132527539}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Just a word of advice about the tours. Yes, they are very cheap but the organization can seem a bit shambolic (on the part of the tour company rather than the hotel). And it would appear that paying more doesn’t guarantee you’ll be with a better tour company as there were lots of people on the same tours as us that had paid more by booking through their own hotels. My advice is just take the tour and go with it, they always seem to manage to get you to where you want to go somehow even if it doesn’t appear very straightforward!!", "title": "Nice spot at good rate", "user": "PaulTeam1", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129801178}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "We were in My My House 2. It was down the alleys not to far from main building but that ws no bother. The building was very secure. There was someone there 24/7 on the front door and at night a big heavy roller door is used fro extra security. (we never felt unsafe at any time in Saigon it was a great city)", "title": "Good location, value for money", "user": "jimattraveller", "date": "April 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 128794965}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "We booked the Cu Chi tunnel trip through the hostel which was great value and the guide was really good. The bus dropped us off at the war museum on the way back as well and we could continue walking the city from there.", "title": "Wish I'd Gone Elsewhere!", "user": "PuffinRTW", "date": "March 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 126425531}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "MyMy Arthouse was an excellent choice in Ho Chi Minh. The alley you have to walk down to get to it isn’t that bad and there are quite a few other hotels in the same alley so we never felt threatened and walked down the alley at 3am most nights / mornings to get back. The location is perfect if you want to be in the heart of the action and we never needed to take a taxi anywhere, all of the main party street, Bui Vien, is accessed by the lane that leads off the one that the guesthouse is situated on so no more than a 2 minute walk and even if you want to walk out onto Pham Ngu Lao and around the block it’ll only take 10 minutes to do the whole loop and there are plenty of places to eat, drink and party on the way round. It took us 20 minutes to walk to the War Remnants Museum and Reunification Place and it’s such an interesting walk.", "title": "Great wee place...", "user": "charlenedj", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147643923}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "The guesthouse has several trips on offer and all at a very reasonable price which means you don’t have to bother shopping around the various travel agents there are in the area. We did the temple and the tunnel tour. I wouldn’t bother with the temple if I were you as it takes about 2 hours to get there and you’re only there for about 45 mins, just do the tunnel tour.", "title": "Good service but the staff is too confused..", "user": "Kasper-Hz", "date": "December 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 147028511}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We booked the private double room which was more than adequate, the bed was comfortable, the air conditioning was good and the free wifi worked fine. The breakfast is only served from 7-9am and you have to pay extra as it’s not included in the room rate. Not to worry though as there is an amazing little bakery just by the alley entrance on Pham Ngu Lao called ABC Bakery. They amazing food that costs next to nothing so you’ll no doubt eat breakfast there every morning.", "title": "Good hostel", "user": "Andrew B", "date": "December 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146916856}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "If I returned to this hotel I’d definitely stay at MyMy Arthouse again.", "title": "Great location, really friendly guy, overall you get what you pay for", "user": "1hel2dan3ig4hosk", "date": "November 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 145525901}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "When I checked in they spent a lot of time writing down in a smal book - passport detailed etc. The reception is a mess ofd backpacks, keys everywhere which makes it kind of insecure to leave your passport and stuff.", "title": "Perfect", "user": "John M", "date": "November 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145354018}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I stayed here 2 weeks at the 6th floor, and the stairs up to the top floor is a long walk. Make sure to book a room / dorm at the lower floors if you are not fit because there's no elevator. Friendly staff, decent breakfast included and cheap dorms which are cleaned every day. Wifi and computers available with internet access. My My Arthouse is located in the middle of the backpackers area in a small silent ally. AC, refrigerator, fan, and TV in the dorm I stayed in.", "title": "Cheap and clean dorms, helpful & friendly staff", "user": "Son D", "date": "September 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140694773}, {"rating": 3.0, "title": "Cheap and almost cheerful", "text": "Overall very happy with my stay there.", "helpfulness": 1, "user": "TravellerTH", "date": "September 9, 2012", "id": 139790365}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We stayed here for our first 2 nights in Vietnam. It's right in the middle of the backpacker area and is hidden away off a side street. We booked online via Lonely Planet and it turns out we paid over the odds, people who just turned up got a better deal. There is a mix of dorm rooms and single/doubles. For a budget hostel it's not bad, breakfast is included and the manager helped us sort out some travel plans and trips. If you book before you go they will email you asking if you want a transport from the airport. We used this service twice before we realised we were paying double what a normal airport taxi would charge. This place takes advantage of the fact you are new to Vietnam so watch out. If you are worried by not having fire escapes and rats then this place isn't for you. That said, decent rooms with air con.", "title": "Bad manager let my group down big time", "helpfulness": 2, "user": "Dark616star", "date": "August 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 137181937}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I took out a School expedition to Vietnam - four weeks in length with our final couple of days being spent at the My My Arthouse prior to flying back into the UK. We booked our rooms three months in advance (the rooms were checked out by our agent) and confirmed those bookings with full payment three days before arrival. However - when our group turned up we found that the manager had that very day given our rooms to other people! This manager was to say the least very unhelpful - he used every possible excuse including claiming we did not even book in the first place. When faced with printed copies of the booking and proof of payment he backtracked and admitted that he wanted to make money by fitting in more people at the expense of my group. In the end we had to take a mixture of rooms spread over the two My My Arthouses - with a school group this is a serious issue but at that point we did not have a choice. Some of the rooms were adequate but others rather dirty.", "title": "Cheap and Cheerful", "user": "Ausblu", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135404121}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "I travel a lot and can honestly say this rates as one of the worst places I have ever used, under no circumstances would I recommend anyone taking a school group there.", "title": "Friendly Staff", "user": "nicolajane24", "date": "July 20, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 134894469}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Pretty basic hostel- loads of cockroaches. Guy running the place seemed nice at first but we witnessed him pushing a fellow guest when she refused to pay full price for the terrible job they had done on the laundry (her stuff came back soaking, smelly and with marks all over it) he refused to appologise or accept what she was offering (half the amount) and when she tried to leave he grabbed her and pushed her against the wall in front until she threatened to call the police and was helped by another guest. Never witnessed anything like it in a guesthouse before!", "title": "Violent owner", "user": "Sean M", "date": "November 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 145288279}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We did not make any reservation, just walk in and luckily we got a twin room for USD18. I like the design of the hostel and we have a very nice room. Only thing is the bed is too hard and is too noisy even at night time. Also, they do not clean our room, only replace the towel and that's it. But I do like the owner, he is super friendly and helped us to book a taxi to airport. We had a very early flight to catch up in the morning and thanks for his help on taxi booking and early check out.", "title": "I like the owner and unique design of the hostel", "user": "karmen4728", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 142078942}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We booked this guesthouse on the recommendations of the reviews but we were a bit gutted at what we got for our money. This is about the 7th hostel/guesthouse we have stayed in, in South East Asia and only the 2nd one we wouldn’t recommend. No hot water, very noisy with water pipes/washing machine, no international calling (although it was advertised) really unreliable internet, dirty shower and very abrupt checkout experience. At 11.55am we were knocked, phoned and shouted out of the room…not what we have come to expect from a, so far, very hospitable SEA. At £6 a night, it didn’t break the bank and the location, although intimidating and confusing to find at first, was perfect for the back-packing scene. Breakfast is extra which wasn’t explained to us as we waited for about 15 mins on food that didn’t arrive. Fortunately there was a lovely bakery just on the main road where you can get lovely breads and pastries for about 40p. Have a Pho at Quynh’s Pho place, which is near the guesthouse, just further along the main road on the corner. I would return to Saigon for sure – it is a really interesting place with lots to offer, but I wouldn’t stay at My My Arthouse.", "title": "Bit disappointed…", "user": "tracy m", "date": "October 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 141708246}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Very grateful for letting us check in at 7am and as our room wasn't ready we received a \"free upgrade\". The proprietor known as Mama took almost an hour checking us in, before we departed on a mountain expedition of stairs with hobbit height head clearance. Our \"upgraded\" room was far from superior; cramped, dated, and dark. The air con unit unexpectedly turned into a water feature, resulting in a room change to the floor below. The only natural light that came into both rooms was through a window on the inside of the tower block above Mama's kitchen supplying the room with a constant unique cooking aroma. Also a note for the girls - the entrance to the guesthouse is down a couple of alleys, sure it's perfectly safe but just a consideration for coming back late.", "title": "My My Arthouse", "helpfulness": 1, "user": "David G", "date": "September 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 141491836}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Stayed here for two nighst during the summer. We stayed in My My 2 as they had overbooked which unfortunately meant that all 5 of us weren't in the same dorm, even though we had booked it like that. Didn't matter too much and My My 2 was nice enough with clean and comfortable rooms with aircon and fan. The rooms were however, absolutely tiny (or cosy whatever way you look at it!). No space for backpacks and the only floorspace equated to the width and length of a bunkbed. Fine for two nights and when staying with only friends but it would get a bit annoying maybe after a few nights! Location is great although it is located somewhere in a maze of residential alleyways and we did have to ask for directions and even the Vietnamese person we asked took a while to figure it out with a map! Staff were friendly, although one member had a tendency to just open our room door without knocking and stroll in, most often to check the mini bar.", "title": "Cheap and clean hostel", "helpfulness": 1, "user": "OMurphy_91", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141239041}], "location": {"country": "Vietnam", "continent": "Asia"}, "variance": {"poor": 12, "average": 19, "very good": 28, "terrible": 20, "excellent": 19}, "aka": "My My Arthouse Hotel", "slim_ranking": 0.165784832451}