{"user_rating": 4.0, "review_count": 381, "name": "myhotel Bloomsbury", "reviews": [{"rating": 2.0, "title": "bland", "text": "its ok. Just ok. But god at that price Id want more than ok. Bland central. The staff were fine - but I wouldnt go crazy about it. For this price you can stay at the Milestone hotel - and their staff are good.", "user": "wipeout75", "date": "January 24, 2007", "id": 6654452}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "the location of MyHotel Bloomsbury is definately good, but comparing the price and quality it should be hovering above oxford circus to be considered reasonably priced.", "title": "ridicilously overpriced", "helpfulness": 2, "user": "theshoemaker", "date": "January 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 6574295, "likes": {"liked": "— price"}}, {"rating": 1.0, "title": "Appalling....but the pigeons love it", "text": "We stayed at the hotel for a week and overall had no major problems with our stay. the room, a deluxe sized one, was small but decent for London. some setbacks included a squeaky floor, which made loud noices everytime I walked over certain parts of it. the room door had quite a gap underneath it and was poorly sealed, making even small sounds form the hallway hearable inside the room - probably the other way around too. service was ok but not special in any way, breakfast was good. considering the location, it would be a good deal for half the price.", "helpfulness": 1, "user": "Alexg2005", "date": "December 15, 2006", "id": 6445092}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "recently I stayed at Radisson Sussex, which is located a block or so from selfridges - actually a better location in my opinion. price was almost half of this one, and considering the fact that hotels share even a rather similar style, I very much prefered the Radisson.", "title": "Awful", "helpfulness": 3, "user": "TechnoProf", "date": "November 28, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6231245, "likes": {"liked": "— See review", "disliked": "— See review - too much to list here"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "For the money, this is my favorite hotel in London. I stayed there last weekend for the third time in the past few years and was not disappointed.", "title": "My favorite for the money", "helpfulness": 2, "user": "neuchcat", "date": "October 24, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4047728}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 21, "average": 66, "very good": 120, "terrible": 27, "excellent": 147}, "aka": "Myhotel Bloomsbury Hotel", "slim_ranking": 0.217674418605, "description": "We know that creative minds respond well to stimulating surroundings. So, we created myhotel Bloomsbury, as an inspired space where your ideas flow, the senses are delighted, you'll feel relaxed and right at home.Whether you need a contemporary space to meet and eat, fun and engaging event spaces that inspire or simply, an incredibly tranquil room to think and sleep. At this Bloomsbury hotel in London you will find just this... With hip interior design from Conran & Partners.\"When it opened in 1999, myhotel Bloomsbury's minimalist white walls and feng shui philosophy were the talk of the town. Now, as the pendulum swings ever closer to maximalism, flashes of bright colour and softer textures have been introduced to temper the monasticism. Its four-star rooms are tasteful, tranquil and bright.\" Hg2 London"}