{"user_rating": 4.5, "review_count": 109, "name": "Myne Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here for two nights and we definitely made the right choice as the resort is beautiful. The chalets were all tucked away along the river and were rustic and charming. I would only advise people to be careful if youre a bit of a wuss like myself as at night all kinds of bugs and animals came out - though thankfully, our room remained bug free throughout our entire stay :) We did have a snake on the walkway one night on route to dinner which was very scary, especially as it was hovered in the air (we later found out it was a paradise snake, which can jump!)", "title": "A great adventure.", "user": "backtoback", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78334904}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The restaurant area was always kept very clean and the meals were great! We had a la carte one night and then the next day our meals were buffet style as the resort was much busier. Drinks were reasonably priced too.", "title": "Didn't meet our expectations for a wildlife experience on the river for £", "helpfulness": 1, "user": "HelsBells_9", "date": "August 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 77318485}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The boat trips were the highlight of our trip, as our guide and captain were extremely knowledgable and eagle eyed! We saw many elephants, birds, macaques, proboscis monkeys and even 2 wild orangutans.", "title": "Hidden gem at Kinabatangan River", "helpfulness": 1, "user": "ArskaEspooFinland", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72258082}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We would only recommend that the staff here cleaned rooms during the stay. We stayed two nights and it would have be nice for them to change our towels and replace the bottled water, especially after trekking, boat rides in the heat etc.", "title": "Myne resort - peace and quiet on the Kinabatangan", "helpfulness": 1, "user": "KGB_4", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71208503}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "All in all, we really enjoyed it here and found Cynthia to be a great hostess :)", "title": "Personal, cheerful quirky lodge-- go before they know...", "helpfulness": 5, "user": "octopusmessiah", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 67822866}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Our group of 3 couples stayed at the Myne Resort for 1 night at the beginning of May. We thoroughly enjoyed our brief stay and loved the river cruises, looking for various wildlife. This part of the Kinabantangan River was very quiet and peaceful and we had a wonderful view from our chalet. All meals were included in the tariff and were very tasty and enjoyable. We had arranged our visit with Megah Travel Services in Sandakan and can recommend their professional and well priced service in arranging this leg of our trip. Thanks to Patrick (our tour guide) for his great knowledge of all things Sabah, including his wildlife 'spotting' along the banks of the river. We were the only guests staying at the resort, which made the experience even more special. The staff are genuinely warm and gratious. This part of our trip was a wonderful highlight.", "title": "A special place on the Kinabatangan River", "user": "Buddee58", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65858480}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Our family of five stayed at the Myne Resort for 3 nights end April. In total we spent 35 days in Borneo and the three nights at the Myne were the best of the entire trip. Here's why:", "title": "Fabulous resort on the Kinabatangan River", "helpfulness": 3, "user": "DeeElle", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63748756}, {"rating": 5.0, "title": "Really enjoyable.", "text": "We were picked up from Sandakan in an airconditioned bus and taken to Gomantong Caves on the way to the Resort. The guide was absolutely fantastic; he knew the area well and provided us with exceptional information on the caves, Kinabatangan and surrounding area.", "user": "Snapper50", "date": "May 4, 2010", "id": 63182959}, {"rating": 5.0, "title": "Wonderful resort to enjoy wildlife!", "text": "The resort staff were warm and welcoming and couldn't do enough for us during our stay", "user": "climbergirlLA", "date": "April 21, 2010", "id": 62091367}, {"rating": 4.0, "title": "Great for people keen on adventure", "text": "The food was absolutely fabulous; fresh, plentiful and of very good quality. We were told they have recently employed an Executive Chef to manage the hotel which shows as the food was great.", "user": "AlanandRobyn", "date": "April 16, 2010", "id": 61643299}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "new , comfortable, resort. and sure the promotion price will goes north.", "title": "sukau", "user": "oyang5151", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39527961}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "There are a number of lodges to choose from along the Kinabantangan River in Sabah, Borneo near Sukau, and we had the good fortune of landing at the Myne Resort. The lodge is located at the end of an 8 km dirt road, which meanders through a palm plantation and a small village or two. The lodge itself is on the River bank, and is an excellent embarkation point for discovering the wildlife in this fascinating reserve area.", "title": "Great comfort in the jungle", "helpfulness": 2, "user": "voyageur à paris", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 39472704}], "location": {"country": "Malaysia", "continent": "Asia"}, "variance": {"poor": 2, "average": 5, "very good": 32, "terrible": 1, "excellent": 69}, "aka": "Myne Hotel", "slim_ranking": 0.0555555555556}