{"user_rating": 4.0, "review_count": 190, "name": "Namsan Guest House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I stayed in Namsan 2 which is only few steps to the metro.. great location.", "title": "Great location... but room - need improvement", "user": "tofudon", "date": "December 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 90443547}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "The room I stayed was Twin B (55,000W) on the 2nd floor, the room was really small and look not good as the picture shown, and although it's new.. the wall edge has some black dot (mold) already so that we need to move the mattress away of that. and always have smell (becasue too wet in the room i think)", "title": "Good Value, Good Location", "helpfulness": 1, "user": "1step_1kmilejourney", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 89393946}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "The worst was the bathroom, ventilation is poor... water drops on the ceiling all the day, and when you go toilet.. water dropped on your head....", "title": "Central location, great price", "helpfulness": 2, "user": "Pinefresh", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 85624851}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Anyway, the guest house is well-designed and with fully equipped kitchen and helpful staff.. with valuable price, and offers bread, noodles, coffee and tea for breakfast... and free wifi in the room.", "title": "Good Stay in Namsan Guesthouse", "helpfulness": 4, "user": "sklee", "date": "September 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79844795}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Recommend only for budget stay in great location, and easy going traveller who would not care too much...", "title": "Cheap, But....", "helpfulness": 3, "user": "Thampi_60", "date": "June 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 67179338}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We stayed at Namsan Guest House for 6 days. The guest house is located near the cable car leading to N Seoul Tower. The nearest subway station is Myeong-dong station. Myeong-dong serves as a hip shopping area with many shops that open till around 10pm.", "title": "Convenient location, but room are a tad small", "helpfulness": 1, "user": "Hillie_H", "date": "May 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 64964952}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The guest house is located on top of a slope. Going up and slope after a long day of sight-seeing is a daunting task. Nonethess, it was comfortable to stay there, although the room was a tad small.", "title": "Perfect for the low maintenance traveler", "helpfulness": 1, "user": "SimieMom", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28476635}, {"rating": 4.0, "stay_parameters": "Stayed April 2009", "text": "Great place to stay, but be prepared for the potentially small rooms and the effort needed to climb the slop!", "title": "Great Value, comfortable.", "user": "MeiJ", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27979833}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "My husband and I enjoyed our stay at the Namsan Gusthouse. It is a couple of blocks from the subway and taxi stand, albeit at the top of a steep hill. The small reception is open 24 hours or until all the residents are in for the night. Our hosts were very helpful in deciding how to map out our sightseeing and answering questions. The rooms are tiny, but clean and there was a fan, A/C unit and TV in ours. There was no closet and only 2 small drawers in the bedside table. There were hooks on the wall that we used for our jackets. A simple breakfast is served every morning and coffee, toast and hot water are available 24 hours. They also have WIFi and two computers available for use in the small common area. Location is very central and taxis are cheap. Across the main avenue is hotspot of nightlife, shopping and dining. Would definitely stay there again! (Ask for rooms on the second floor. First floor rooms are next to reception and common rooom.)", "title": "Feels like home", "helpfulness": 1, "user": "fairiesclub", "date": "December 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 22736769, "likes": {"liked": "— Good location - near to subway, tourist attractions and restaurants.", "disliked": "— Noisy toilet flash."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Stayed one of the VIP rooms for 3 nights and the twin room for another 3.", "title": "Pretty good~!", "helpfulness": 1, "user": "iTravel4FunDot", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21888533, "likes": {"liked": "— The price and they have all the facilities that I need.", "disliked": "— The noise level. Because the first floor rooms are near to where people usually chill at. The second floor rooms can hear noises from the kitchen I guess."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "After having read the reviews on Trip Advisor and seeing that the Namsan Guesthouse was ranked quite highly, we decided to go ahead and book the room VIP3 at Namsan 1 for a total of 17 days. We had read up on how it was located on top of a hill, and that it was not all that steep, and quite reasonable.", "title": "Very dirty room.", "helpfulness": 2, "user": "mland031", "date": "July 8, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 5.0}, "id": 115164192}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "Hence, we arrived in Korea and at the Namsan 2 for registration. The first thing we noticed: We have to pay before seeing the room. We went ahead and did that, considering it seemed to have a good rep on Trip advisor. Second thing we noticed: The hill. WHAT A HILL. it was very steep and quite tiring, specially after a day of sightseeing in Seoul (for those of you who are unaware, taking the subway and walking around Seoul is quite a feat: hundreds of hills and stairs.....) or after arriving from the airport. When we finally make it to the top of the hill with our bagages, and are faced with the third revelation: The room. The room itself is quite horrible... The walls are extremely dirty (see pictures), there are ant problems in the washroom (on the sink), a lot of mould and mildew in the room and the washroom, not to mention the shower curtain incrusted with mold. The bed sheets were dirty (blood stains, among other stains), and the walls are filled with bug juice (spots of old bug blood). The smell of the room itself is quite extraordinary when mixed with the overall smell of the Myeongdong neighborhood and its sewer system. We almost forgot to mention the view: our room was adorned with a beautiful view of an old brick wall, only inches away from the window. Lovely.", "title": "It is a nice guest house ,good location ,kind-hearted master.", "user": "Contrail521", "date": "June 10, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 112597482}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Still, the front desk staff located down the hill at Namsan 2 were extremely friendly, and went out of their way to help us out whenever we wanted to have information or make reservations at events. The location itself is also very good, as it is very close to downtown Seoul and the Namsan Cable cars, as well as the subway station. However, we cannot stress enough how steep the hill to the Namsan 1 complex is, so if possible, book at Namsan 2, or 3. We also got free instant noodle cups and bread every day, along with jam, coffee and filtered water. There was also a washing machine (but no dryer) made available to clients. In fact, those items were the reason why we managed to cope with the room for the first seven days of our trip. After that, we went ahead and booked at another location, even though we had already paid for this room.", "title": "Good Value & Good Location [Namsan 2]", "user": "s0kutatsu", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98994231}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "So, overall, our two points go to the staff at Namsan Guesthouse and the amenities (which were quite useful at times). However, we found that our trip was much more enjoyable at other locations, even with different amenities and locations. Hence, this was a great learning experience for us: look for pictures before booking, don't expect everybody to be silent and respectful at all times in the common room (kitchen and entrance) when booking in a guesthouse, and more importantly, don't pay upfront, but ask to be shown the room first.... *_*", "title": "a better namsan - namsan 2", "helpfulness": 2, "user": "threesloth", "date": "January 27, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 94605579}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "I went to Seoul on 5th June 2011,we we already booked this guest house on website before we came to Korea.But due to the urgent trip,we didn't change any money when we get to there.But luckily,the master let us stay there ,and confirm we can pay for it when we check out.Ha ha,it is impossible to meet such things in China.You never dream of it.We stay at here for two night,the room is very clean,also have free lunch and wifi.Everyone in this Guest House is very warmly.It is not a guest house but my home in Seoul.Next time when we cone Seoul,we will choose this place again.", "title": "A Cost-friendly Place with a Great Location", "helpfulness": 1, "user": "Wonhee_Choi", "date": "January 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 93508399}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Stayed for 7 nights from 27th Aug. to 2 Sept 2011, the first night we stayed in Namsan 1 (the oldest one with just fine room and private toilet- well, that's fair with the rate we paid).", "title": "pleasant place for budget travellers", "user": "Zu Y", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117656185}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "we stayed in namsan 2 for 1 nights, its much better, or i should say its good at the rate we paid- bright room with private toilet and comfortable environment.", "title": "Friendly staff and amazing location", "helpfulness": 1, "user": "Ayu_lovestravelling", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117262967}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "later, we moved to namsan 3 for 3 nights, its the best among the 3- brand new room with elevator, bright and clean.", "title": "Pleasure stay", "helpfulness": 1, "user": "Sherry_Tam1978", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116659582}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "the last, we moved to VIP2 for 2 night, its a room for 5 people so quite big for us (3)- the buiding itself was old, but just like Namsan 1, its fair at the fare we paid.", "title": "We loved it & definitely will be back again...", "helpfulness": 2, "user": "Jocosalicious", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116367798}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I would say, if you are a budget traveller, Namsan guest house is a great place to stay since they got free internet (wifi in room), free skype phone offered at lobby, free cable TV in room, private toilet.....and the most important- friendly staff.", "title": "Great location with great rooms", "user": "Fly_ar0und_the_W0rld", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115247731}], "location": {"country": "South Korea", "continent": "Asia"}, "variance": {"poor": 6, "average": 42, "very good": 87, "terrible": 3, "excellent": 52}, "aka": "Namsan Guest House Hotel Seoul", "slim_ranking": 0.10447761194, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "We offer affordable and quality accommodation in the most relaxed and comfortable place. We are in the fantastic location for travelling and shopping. we are located just 150 M from Myeongdong Subway station which is the center of Seoul and the best shopping area.Namsan Guest House is convenient for transportation, so you can go to Korea’s famous places easily such as Namdaemun, Dongdaemun, City hall, Cheonggaecheon, Insadong, and old palace.We do our best to satisfy our guest by supporting travel information, free Seoul map, and taking care 24 hours like your home.We offer many different facilities that will suit all guests and cater for all your needs when travelling; this is the perfect location for you to stay when you visit the beautiful Seoul."}