{"user_rating": 4.5, "review_count": 1661, "name": "Napoleon Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The friendly helpful staff we're amazing. We loved Roberto at concierge, he was so helpful with everything, from transportation info & tickets, to planning the day out to keep the kids entertained and engaged. Friendly and funny too! We were lucky enough be able to attend the wine tasting evening and really enjoyed meeting the hotel manager, another Roberto. He was very charming. We caught the metro to everywhere we wanted to go, except we walked to the colosseum,so it was so handy to have it right outside the door. We found the location of the hotel was perfect for us. We walked around with the children at night and felt as safe as you can in a strange new big city! Our rooms were huge and so was our bathroom. We would stay here again for sure ( if we ever make it back to Rome!! )", "title": "Home away from home when in Rome!", "user": "sher-dl", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179838174}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This is a great hotel in the Victoria Emmanuel Piazza near the train station. The location is the best for traveling on the metro (stop right outside the door) and for walking to all the tourist sites. The staff were very helpful and friendly. The breakfast was plentiful and very tasty. The rooms were clean and quite spacious, by European standards. Would definitely recommend to friends and family!", "title": "Great location and friendly staff", "user": "dgat2", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179584230}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This hotel is ideal for walking to most of the sights and about 20mins from the Colosseum. The Metro entrance is directly outside, allowing very easy travel to the Vatican etc. The Hotel is a nice family run hotel with fresh decor inside. The staff were especially helpful, making our stay more enjoyable. breakfast was fab and if you have the opportunity the wine tasting evening is recommended.", "title": "Great Hotel, ideal location", "user": "GerryBruce", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179475343}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Have stayed at Napoleon once a year over the last 6-7- years - we really enjoy it. The staff at the reception is SO helpfull. recommend, make reservations showing places on map etc. Also the breakfast is really great. Lot of bread, scrambled eggs and bacon and the best cold cuts we have ever had in Italy AND on top of that a nice glass of FRESH orange juice. If you stay on a Friday night do not miss the winetasting. Here you will meet other guests, the manager and other members of the staff and share a glass or more of wine and a snack. The location 20 meters to the entrance to the Metro is also very convienient. No, it is not in the middle of \"old Rome\" but the price allows you to take a taxi (appr. 10 - 12 EUR) to go home from Pantheon etc.", "title": "The staff make the difference", "user": "Hanne N", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179198422}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Well, you might not stay here if you were expecting a swank 5-star experience. There are other hotels that do that. But the Napoleon Hotel is an EXCELLENT choice if you are wanting to stay in a clean room, in a safe, busy area that allows for easy access to most of the city. My wife and I stayed here for 4 nights in May, and we were initially concerned about the reviews which mentioned \"bad neighborhood\". After getting there, I kept wondering what the heck those people were talking about. This hotel is located on a square near Termini, nestled in among restaurants and storefronts. The interior of the hotel is spacious, with a very nice common area on the second floor and the guest rooms above it. The room we stayed in was probably the largest of all our hotel rooms in Italy, and easily the most modern. We really weren't there to spend time in the room, but it absolutely served its purpose.", "title": "Why wouldn't you stay here?", "user": "Thermocaster", "date": "September 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178771815}, {"rating": 3.0, "title": "Neighborhood Issues - think \"Garment District \"", "text": "The only thing I can compare this area to would be a \"Garment District\". But instead of fabric, they sell beads and cheap baubbles. We found ourselves not wanting to explore the area as there were many suspicious male youths outside the hotel, hanging around the train steps at all hours on their cell phones. \"Seedy\" is really the only appropriate description. We opted for cabs for all excursions.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 18, 2012", "id": 145699201}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "In terms of the hotel itself, we found it disappointing in the paper-thin wall department (I could hear my neighbor's television for hours- word for word-ridiculous) as well as the miniature size of our room and furniture provided. I had a similar children's size desk and matching nightstands growing up in the seventies. Grown-up furniture would definitely not fit in the room. Get a superior room if you can. But I must say, the bathroom was sparkling clean and modern. The beds were especially low and hard, making it difficult to get up and out for two tall people. Rolling out of bed here means landing on the floor. Please note: if you are sensitive to the room and carpet deodorizers some hotels use, don't stay here. Because of the language barrier with the maid, it was impossible to avoid having it sprayed yet again the next day. It was so strong it took our breath away. Our friends complained about this also.", "title": "A pleasant stay & easy walk to Colosseum, Palatine Hill & Forum.", "user": "OandL", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145518895}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Aside from that, the front staff were very friendly. I highlight front staff, because the older man at the back desk seemed annoyed by questions or requests. When you are in the hospitality business, attitude toward guests is everything - or it should be from what I've heard.", "title": "A comfortable stay near the colosseum", "user": "Sashay23", "date": "November 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 145497494}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We loved the breakfast - the fresh Cappucinos were great. You could order them from room service - who knew? I only found out later. The assortment of fresh goodies and hot scrambled eggs was great. The breakfast room itself was very large and very pretty and the staff was soft-spoken and helpful. A real treat. The apricot jam filled croissants were super. Everything was fresh.", "title": "Hotel Napoleon very helpful for first time visitors to Rome", "user": "Darlynn F", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145384572}, {"rating": 4.0, "title": "Great location", "text": "We had two fabulous meals at the hotel's restaurant. The Americiana pasta dish was the best. The eggplant with Mozzarella and pesto as an appetizer was huge and delicious. Every dish was a winner. Our friends loved the veal Marsala. The prices were incredibly reasonable and the happy hour prices were shockingly low. Needless to say, we enjoyed the Proseco and it flowed for the entire meal.", "user": "Rolandme1", "date": "November 12, 2012", "id": 145278358}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The hotel staff takes customer service very seriously, probably one of the most responsive groups encountered worldwide. That said, this is a 3 star hotel in an old building which has had some remodeling and updating. The rooms are adequate in size, furnishings and clean. There is a very large and comfortable lounge area on the second floor, including a small bar and restaurant. Breakfast was the usual European buffet and adequate. Complimentary Wi-Fi was available in the rooms and lobby. The Metro stop is close and the hotel has a limo driver on staff or the bellman will hail a cab for you. The surrounding neighborhood is not wealthy and on weekends, when nearby shops are closed, street people congregate near the front of the hotel, giving it a less than desirable ambiance. For Rome the price was reasonable, service excellent, accommodations adequate.", "title": "just the facts, ma'am", "user": "notnecessary", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 180483378}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "I've been staying at the Napoleon for about 10 years, and I keep coming back. First, it is officially a 4* hotel, it's probably a 3*, so lets get the stars out of the way first. The rooms could use a refurbishing, only because they look old and dated - welcome to my beloved Italy. It is very, very clean, and just as important, the rooms are VERY, VERY quiet. I mean REALLY quiet. Reception might be a tad on the cool side, especially if you don't speak Italian, but only on the first day. So bear with me, please. Once you go to their (complementary) wine tasting, enjoy a glass, then enjoy the second glass, and then become very, very Italian, and smooze with the boss who in variably is there to greet you, the other guests, and have a wonderful time. I love this place. No, it is not a 5* establishment, no it does not have a spa and swimming pool, no, you can't call for a massage (well, maybe you can, but I'm not going there), no, I can't recall ever getting a chocolate under my pillow. What you DO get, consistently, is a wonderful welcome back, and you are truly meant to feel at home, in an ITALIAN home. They serve an excellent Italian breakfast. (Okay, the espresso or cappuchino around the corner might be a bit better, but you don't have to schlepp to get it). The gel soap in the shower alone is probably worth the trip. In fact, I'm running out of my little bottles, and I think of this place every time I go to the gym to work out. The location is great - walking distance from Termini, the metropolitana exits in front of the hotel. There are pick pockets in the immediate area, so watch your wallet, VERY important. But they are everywhere in Rome. This is an absolutely wonderful establishment, it is not a chain, and it is not perfect. But I can afford to stay at the Danielli in Venice, or anywhere else in Rome. And I keep coming back here. Ben venuto in Italia, a Roma, and just enjoy this wonderful hidden gem.", "title": "Stayed There Several Times, Have Just Rebooked", "user": "DrH", "date": "October 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180388351}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "My daughter and I recently spent several days in Rome. We stayed at the Hotel Napoleon. We arrived early one morning and was greeted by very friendly staff. Although we were in a different country and do not speak Italian, we felt at home right away. They greeted us with a smile each morning as we were leaving and inquired about our day as we returned in the evening. They were very informative, helpful, friendly, and funny. They booked our tours and made sure we were safe at all times. The bar area is an enjoyable place to sit and have a glass of wine or a coke. It provides a good atmosphere to speak with other guest or the staff who frequently stop by your table. Breakfast was a great way to start the day with a large variety of foods to select from and the cappuccino is delicious. Our room was large and comfortable. We had everything we needed. I can honestly say if we had not stayed at this hotel our trip would not have been as great as it was. When we left my daughter and I both felt as if we were leaving family. If you are traveling to Rome there is only one place to stay it is the Hotel Napoleon. We will definitely be returning. Thank you to our new friends at the Hotel Napoleon you were great!!", "title": "The Perfect Place to Stay", "user": "Robin M", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180346287}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "There were mixed reviews about this location. We enjoyed our stay and the staff went out of their way to accommodate us. Room was average with the only view being the window in the bathroom. We arrived on Friday and check in was easy. Had free wine. We ate at the hotel one night and the food was great. The breakfast was typical but very good. We had to leave early several mornings for day trips and they opened early for us to get a great breakfast box for our trips. The best advantage is the metro entrance is right outside the hotel and this makes it great as the metro gets you anywhere. We found that there were times that you didn't want to be on the metro as you will get run over getting on the cars. We learned quickly to be Italian and push like the rest. One night we wanted somewhere close to eat and the Concierge Roberto (?} recommended a restaurant that was two blocks away. He called and made reservations for us. We will be back in two years and plan to stay here again. Hope to get a room with a better view but overall they made our stay memorable.", "title": "Great location", "user": "jerry h", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 179915149}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We arrived in Rome by train and wanted a hotel close by. Hotel Napoleon did not disappoint. The room was generous in size, comfortably furnished and very well kept on a daily basis. We were at the hotel for three nights and were very pleased with the staff that was well trained, informative and responsive to our needs. In addition they recommended some great dining in the immediate vicinity. The Metro is practically out the front door and the Coloseum/Palatine Hill/Forum are all within easy walking distance. A special recognition should go to the staff in the breakfast room, which was efficient, friendly and determined to start everyone off in a pleasant mood for the rest of their day. The food was excellent.", "title": "Hotel Staff and location make this a great choice", "user": "annerose321", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179845821}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The Napoleon is a lovely hotel. If you want an ultra-modern, flashy, impersonal hotel it is probably not for you, but if you enjoy a sense of history and 'old fashioned' friendliness and courtesy then this is the place to stay. From our first email requesting an airport transfer from Fiumcino, to our early morning departure clutching a picnic breakfast, the staff could not have been more helpful.", "title": "A special hotel with 'old fashioned' values!", "helpfulness": 1, "user": "Snow-Wight", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145030296}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We were visiting with our teenage grand-daughter for her first visit to Rome and requested a triple room. We were given a lovely room with a curtained area giving her some privacy. It was great to be able to open the windows.", "title": "Fantastic hotel, great staff, great location, great breakfast.", "user": "michael_bulman", "date": "November 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145016637}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The hotel has an elegant lounge on the first floor with very comfortable armchairs and 2 computer stations for the use of the guests, as well as Wifi in the bedrooms. The bar drinks are very reasonably priced.", "title": "Good for the $$$", "user": "Lang0", "date": "November 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145010393}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The wine tasting evening was a great opportunity to meet other guests and the staff. Roberto, the manager, is very knowledgeable on Italian wines. The following day was our grand-daughter's birthday and all the staff wished her a Happy Birthday as we passed through reception. In the evening there was a knock on the door and a member of staff stood there with a tray holding 3 glasses and a complimentary bottle of sparkling wine in an ice bucket. It was a lovely touch and I am sure a memory that will stay with her, even though her grandparents had to drink most of the wine!", "title": "Comfy bed", "user": "Ruth D", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 144895697}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The staff also gave us some great recommendations for reasonably priced restaurants in the immediate area. The Colosseum was only 10 minutes walk. We actually walked to all the sights from the hotel apart from the Vatican. We used the Metro which is literally outside the hotel and were able to buy a ticket from hotel reception saving us from holding up the queues at the ticket machines.", "title": "Staff couldn't do more to make you feel welcome.", "user": "Sabre44", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144783333}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I chose this hotel because of its proximity to the train station as I arrived by train and had to leave the next day. It's a bit further to the station than I was expecting and not an easy walk on the narrow streets in the gritty station area. The room was a very size for Rome though and although the hotel waas a bit dated it was clean and comfortable. The metro station is literally at the front door and it's an easy walk to the Coleseum.", "title": "Good size rooms", "user": "Brett C", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144728589}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I have mixed feelings about recommending this hotel and staying here again although it is just steps away from the Metro which we used often. The hotel is in dire need of a renovation and seems old and tattered in many areas but it is clean and comfortable. My first impression was dissapointment when I arrived because it looks alot better in the photos on the website. The area is a little seedy especially at night. Breakfast coffee was terrible as stated by another reviewer but the variety was pretty good. The hotel staff was great especially the young man who works the night shift but I will probably look for another hotel when I return to Rome.", "title": "Close to Metro but Overpriced", "user": "patklandry", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 144505322}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I booked the Napoleon on the basis of all the other positive reviews by previous visitors, and I have to say I was not disappointed whatsoever. I have to say that Franco (head concierge) was an absolute treasure. A credit to the hotel and very clear that this gentleman loves his job and keeping customers happy. The hotel is 1 stop away from the Termini station (Metro entrance being literally outside the main doors) or less than 10 minute walk away; so this is great to get to all the other main attractions such as the Trevi fountain, Spanish Steps and Colosseum. Although the surrounding area is I guess is 'China Town' it doesn't take away from the 'Rome feeling' as the Santa Maria Maggiore is around the corner as well and immediately you are humbled at the beauty of this city.", "title": "First experience of Rome...glad I picked Napoleon Hotel!", "user": "63ND", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144497302}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel itself isn't a contemporary, modern type of hotel with ultra modern fixtures and fittings, however this doesn't take away from the quaintness and comfort that it does have. As 3 people sharing a room, we were very pleased with the space (3 separate beds, when in reality all 3 could have fit in the one! Very spacious) Bathroom was immaculately clean, plenty of toiletries on hand, and the shower was beautifully hot and powerful (a dream to come back to after a long day of sightseeing). Breakfast was complimentary and we were more than happy with what was on offer. Wifi available in bedrooms as well, which is rare as its usually just the lobby areas.", "title": "Nice staff, convenient location, but not clean!!!", "user": "Mirna T", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144225362}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The staff go out of their way in this hotel and I would say that that to me was very important. The head concierge helped me greatly, with making a booking for a hotel in Venice.. When I thought I'd be having to cancel my plans, he was very reassuring and did all the hard work and research for me; I couldn't be more grateful to him. Great advice and tips on places to eat, directions and general politeness went above and beyond. I would definitely recommend the Napoleon to others and wouldn't think twice about staying here again. Made my experience very pleasant!", "title": "Helpful and personalized, but a bit worn out", "user": "HeidiCroc", "date": "October 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 144131272}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed here for two nights while in Italy for 8 days. The location is great for sight seeing. There is a Subway stop right outside the Hotel door so you can very easily get to all tourist spots.", "title": "Friendly Staff and excellent location close to subway", "user": "davebirl", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145236356}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff are very friendly and do their best to help out in anyway they can. Its a Hotel with a very personal / family feel to it.", "title": "WOW......OUTSTANDING Hotel", "helpfulness": 1, "user": "gardnercdc", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145180175}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Our room had a King Size bed and was spotless clean. The bathroom was also spotless clean. No complaints there.", "title": "Friendly Staff", "user": "Omaima", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 145142816}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My only gripe was with the poor breakfast selection and the extra charge for real orange juice. I took this compaint to the Manager and he ensured me that he is now providing real orange juice free of charge to all customers at breakfast. He is also striving to improve the breakfast buffet.", "title": "Excellent hotel", "user": "D_Byrne186605", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145073011}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "It was good to get a personal email from him to say things were improving. I would certainly stay here again the next time I visit Rome.", "title": "Charming quirky hotel, comme Opera Buffa multo bene.", "helpfulness": 5, "user": "PeterADH", "date": "November 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145062053}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a great stay in this hotel and even met the Owner Roberto over drinks in the bar.The hotel has been in his family for 70 years or so.", "title": "What a surprise!", "user": "Alison S", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177453730}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "A modest exterior and foyer leads to a tiny lift but go up one floor and you will be astounded bya beautiful lounge area leading to a bar and restaurant area. Take another lift to your accommodation floor. Our room was so nice. Separate lounge area leading to bedroom, walk in robe and nice bathroom with all that you need. Mattress toppers would provide more comfort on bed. It was quiet at night so no sleep disturbance.", "title": "Lovely stay in Rome", "user": "Louagi", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177189839}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wonderful service, great Concierge...", "title": "Bonaparte would be proud!", "user": "Anthony K", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177157410}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Good location with heaps of restaurants nearby.", "title": "A very satisfied customer", "user": "Live2CdWorld", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177152967}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Will stay again", "title": "First Trip to Rome Ever", "user": "Advis0r12013", "date": "September 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 176663232}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Don't get fooled by the front door, great hotel, gracious and attentive personnel, spacious and quiet rooms, good location, all things considered a little gem.", "title": "Hidden gem", "user": "Liane S", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 178689449}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "P.s. I had left my wallet in the room safe which was returned to Roberto (a great concierge) and kept in a safe place until it was returned...wow!", "title": "A hotel close to Termini", "user": "Writers_dk", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 178607369}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I stayed two nights at this hotel in connection with a business trip. I selected the hotel to a very high degree based on the very good reviews on Tripadvisor. I have used reviews for many hotels around the world, but I must admit, that this is probably the first time that I have disagreed with the majority of the reviews. This is an average hotel, relatively small rooms, probably the smallest shower room that I have ever seen, relatively hard beds, an air-condition that did not work well and was noisy, and a neighborhood that is not very nice. One good thing to say about the hotel is the friendly staff.", "title": "Absolutely Outstanding!! The staff are incredible!", "helpfulness": 1, "user": "Ryan L", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178207619}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Well, I have just returned from a week in Rome, staying at the Napoleon Hotel, and what can I say but what an absolute delight. I booked mainly because of TripAdvisor Ratings - but also for some key features such as less crowded neighbourhood, proximity to the Metro, and free Wifi! I was not disappointed in any way! The most delightful aspect of the Hotel (and there are many) is the group of staff. From Franco and his team at the Concierge desk who are incredibly helpful, knowledgable, and speak fantastic English - right through to the breakfast staff, the housekeeping staff, and Roberto the Owner/Manager, everyone in the hotel was an absolute delight to meet and interact with. I thought the location was fantastic, about a 15 minute walk to the Colosseum, and just mere 15 paces to the Metro! Rome is an easily walkable city and this hotel was perfectly placed for making it the epicentre of several walkabouts! As with most European boutique hotels, the room was small (the shower even smaller) BUT was perfect for me as a solo traveller. The bed was ridiculously comfortable!! The service, food, and decor were all great, and I felt incredibly comfortable using the hotel as my home base for the week. Though I had one minor incident involving some banging in the room next door (on the one morning of the trip I decided to sleep in - there were some emergency repairs required in the washroom of the room next door) it was rectified immediately and the staff were incredibly apologetic! They stopped working immediately and waited until I was awake again to re-start. The cocktail hour was a surprise and great chance to meet Roberto, and although I was invited to the wine tasting on Friday (I could not attend due to a previous engagement) I was pleased with the invitation nonetheless. If you are used to travelling in Europe - this hotel will be a an absolute delight. If you are used to North American chain hotels, you need to adjust your expectations prior to going to Europe!! This hotel was an incredible value for Europe and provided me with everything I needed for a week in Rome - a clean room, comfortable bed, TV with CNN, free WiFi, close to the metro, quick and efficient service, VERY helpful staff, and above all a welcoming environment where everyone remembered my name!!! Franco (Concierge) even helped me out when I was lost in an area I did not know and managed to send me a taxi after calling him in the wee hours of the morning!!!! I cannot say enough about how great the Napoleon was, and I will absolutely stay there again and recommend it to others!!!", "title": "Value, central, easy, well appointed, friendly.", "user": "mortsubites", "date": "September 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 177806979}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Booked sight unseen from Australia. No unpleasant surprises. Friendly staff. Central to Rome's attractions and metro a stones throw fron central station interchange. Staff arranged some tour options at short notice with no problems.", "title": "The people make this hotel", "helpfulness": 2, "user": "Stump64", "date": "September 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177785007}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 35, "average": 149, "very good": 536, "terrible": 18, "excellent": 923}, "aka": "Napoleon Hotel Rome", "slim_ranking": 0.0567823343849, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Hotel Napoleon is a family run 4 star hotel in Rome centre.Charming and very quiet, the hotel is ideal for both family holidays and business trips."}