{"user_rating": 5.0, "review_count": 34, "name": "Nautical Nights", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and I (in our late 20s) just returned from a weekend stay over labor day. I was getting discouraged trying to book any weekend in Sept or Oct then I was referred to Nautical Nights. After checking out the website we decided to have out first bed and breakfast experience here. We didn't really know what to expect from a B&B being that we usually always stay in large well-known hotels. The pictures and description on the website were right. We were only a few feet from Seneca Lake. The atmosphere was so nice and relaxing. Michelle and Tori greeted us and made us feel right at home. We stayed in the tiny bubbles room and enjoyed the jacuzzi and the view very much. The room was clean and neat. The breakfast was also very fresh and delicious. I just wish there was more of it. The other review was correct that it does get very bight from the sun in the morining, but we didn't mind because we were up in time for breakfast and ready to start our day. Also there is a steep dirt road leading to the B&B. We were glad we brought the SUV. There was also a computer with internet, canoe and chimena available. We enjoyed ourselves very much.", "title": "very nice B&B", "helpfulness": 2, "user": "steph44w", "date": "September 4, 2007", "detail_rating": {"business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8654984, "likes": {"liked": "— great view", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the bungalow which is just off the deck from the main house and just a few feet from Seneca Lake. We had wonderful views of the sunrise and the lake. The bungalow is a cozy room with a queen size bed, AC, refrigerator, microwave, coffee maker, iron & ironing board, tv with DVD, shower, small closet, sliding glass door into the deck.", "title": "Beautiful View & Romantic Inn", "helpfulness": 3, "user": "Luv2Travel35", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8268586, "likes": {"liked": "— Wonderful views of the lake", "disliked": "— Hard pillows"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Machelle was so helpful, friendly and attentive, she paid special attention to all details. She provides a wide range of amenities, including wi-fi, a computer is available to those who didn’t bring a lap top, chimena, BBQ, table & chairs, canoe, etc.", "title": "Beautiful Lakeside Retreat", "helpfulness": 5, "user": "Luv2Travel247", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 5771424}, {"rating": 5.0, "title": "An Enchanting Slice of Heaven!!!!!", "text": "After a day at the wineries, we lit the chimena and opened a bottle of wine and looked out into the lake. It was truly a relaxing, beautiful and romantic weekend.", "helpfulness": 4, "user": "relic10", "date": "July 23, 2006", "id": 5501091}, {"rating": 4.0, "title": "Positives and negatives, but overall very enjoyable", "text": "We are looking to return in the very near future and spend more time. The views are awesome and breakfast was superb. We highly recommend anyone to this wonderful inn.", "helpfulness": 3, "user": "11222", "date": "July 18, 2006", "id": 5479640}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 1, "very good": 3, "terrible": 0, "excellent": 30}, "slim_ranking": 0.363636363636}