{"user_rating": 4.5, "review_count": 528, "name": "Negril Tree House Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Treehouse was a great place to stay. Big rooms & very clean, the staff was friendly & willing to help out with what ever they can. My girfriend lost her I-Pod at the resort & one of the workers found it & turned it into security. We thought we'd never see it again but a big thank you to the honest worker who gave it to security.", "title": "Great place to stay !!", "user": "budpan", "date": "February 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96655845}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "We had the pleasure of meeting the owner who was very nice & friendly. Gail, it was very nice meeting you. Thank you for a perfect & memorable vacation.", "title": "A great Negril home base.", "helpfulness": 1, "user": "sunmandan", "date": "February 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 96389356}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "We will be staying at the Treehouse again.", "title": "Excellent - What a find! Booking my trip back immediately!", "helpfulness": 1, "user": "mmtrip", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 95780824}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Buddy & Bobbi from Pittsburgh", "title": "The Tree House is the best way to enjoy your experience in Negril.", "helpfulness": 1, "user": "calvinsnonnie", "date": "January 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94044916}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Just got back from Negril and I miss it already. My girlfriend and I stayed at the tree house and it was all you could ask for. Free breakfast in the morning. Eggs your way, Jamaican dishes to try, toast, banana bread, fruit and all the juice and coffee you can handle. I would slurp my last sip of juice and it would be filled for me again in seconds. Great service.", "title": "Heaven", "helpfulness": 1, "user": "classyjdp", "date": "January 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92920139}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This hotel is not worth it despite the central location! Sometimes a family owned business shows its lack of resources in little ways and these little ways add up when you are trying to enjoy yourself on a vacation.", "title": "Don't even bother... I never write reviews and staying here prompted me to", "helpfulness": 11, "user": "brooklincutie", "date": "February 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 98127678}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "1) Food- The best thing about this place is the food. The menu and food was really good.... That is, when they had it. The goat was on the menu but they didn't have it- I asked for it 3 days in a row. Same for crab cakes, jerk chicken (at certain times) and the pork. It got to the point where I just asked the waitress, \"Ok, just tell me what you DO have.\"", "title": "Not For Us", "helpfulness": 5, "user": "Caught2010", "date": "February 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 97998932}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "2) Room Problems: The toilet was broken and no one came to fix it until after the 3rd phone call and until we got upset with the staff about the problem. The sheets and blankets had holes. The television was too dark to see (we had to play with the color and tint to see news and weather!). Power went out in our entire building and we had to sit in the dark until they got it back up. WE SHARED AN IRONING BOARD which was cracked/ broken and ripped into my clothing. We had to call for the board to be delivered to us and had to wait for it.", "title": "good hotel in a wonderful part of the 7 miles beach", "user": "ikravtso", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 97589315}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "3) Unpleasant staff: The front desk hostesses were just unpleasant and curt when checking us in! There was only one person who went out of his way to say hello, smile and be friendly. Many other staff members were very somber and unfriendly. A few were just straight rude.", "title": "Can't wait to wake up here again!", "user": "Bobarino", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97233950}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "4) Beach: The beach area here is a joke. It is a small strip compared to other hotels. There are NEVER enough beach chairs and many of the chairs are broken. There were random broken armed chairs just sitting on the beach.", "title": "plesantly surprized", "user": "dopelo", "date": "February 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 96890270}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Stayed in room # 2 ,it's the hallway for employees to hangout and a walk thur. always nisise going on can't sleep . The food is terrible ,mostly the morning ,but the evening mean really is not any better and it's very over priced . The Jerk chicken shack is descent and should be given the chance if , it's your first trip to Jamaica .", "title": "Don't waste your time :(", "helpfulness": 6, "user": "Kim37625", "date": "March 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 99096249}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "OK my girlfriend and I stayed 3 nights at the Tree house in Negril. As some others have said the front desk staff can seem very unfriendly at times, I don't know if it's a Jamaican thing. We were shown our room after waiting about half an hour for its preparation. I do like the fact that there are swings outside the rooms along with deck chairs and a small table. The room was somewhat small and TV was just not playing correctly, I'm a patient person as long as things are not really bad and we didn't make a big deal of it since we hardly planned on staying in the room.", "title": "Not the best, not the worst", "helpfulness": 1, "user": "B1ggs", "date": "March 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 98725726}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The sheets on the bed appeared to be really old and had holes in it also after a day we realized the toilet would not flush properly. The front desk decided to move us into another room which was much better and larger . The food at their beach restaurant and bar is good and the jerk chicken is awesome even though it is only on the lunch menu. The drinks were good but as another poster said beach chairs leave alot to be desired and are hard to come by if your not quick. After staying in Rooms on the Beach for 2 nights I had another hotel to compare this one to so i can say it may not be the best in its class but it does make up with things such as the breakfast that's served until about 10 am. Another great thing is that they have a cab service right in the lobby with prices on display to various areas, the prices are only about $1 higher than the cabs on the street.", "title": "Size Matters, and in This Case, Smaller Wins!", "helpfulness": 2, "user": "lovetotravelanddo", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98720038}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I must say to all those traveling to get shuttle service before you even get to the island, I paid $60 for a roundtrip service to the airport and on the way to the hotel we were the only ones in the van and shared a ride with 1 family on the way home.", "title": "The Best in Negril!", "user": "MikeNYC13", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98265623}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "As a travel professional and avid leisure traveler, I have stayed in (no) to four star properties and having stayed multiple times at Negril Tree House it has always been a delight from: the food, to the rooms, to the beach (appropriately relative to the size of the establishment), to the staff.", "title": "very nice place, great staff/serive great locatin on the beach", "user": "gborabora2travler", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98221330}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "My cousin had been talking about this place for years and years. I finally visited during another family members wedding and I see why she loved it. The staff was wonderful, everyone was very nice, and treated you like they had known you forever. The complimentary breakfast was great, and the room was perfect. I have no complaints at all. I had other family members that stayed at another ritzy hotel in Negril, they payed a significantly higher price and were no where near as pleased as we were with the service we recieved. I would", "title": "Negril Tree House is the ONLY place to stay in Negril", "helpfulness": 2, "user": "drake1ad", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101817695}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Had great stay at Negril Tree house for a quick weekend trip to Negril. We got room 5 which i think has the best beach view on property. Room was a little small but we were hardly in it anyway just for sleep, shower and change clothes. Only problem is if you have loud talking early morning neighbors lol. Ours woke me up at 6am every morning and getting to bed at 4 or 5am is no bueno. Walls are thin and without windows you get all the surrounding sounds.", "title": "Great stay", "user": "Jdub1026", "date": "March 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 101257928}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "We also took advantage of the free breakfast 2 of the 4 days there and it was cool. Beach area is nice but one cant really go wrong on long bay. So all in all good quick trip.", "title": "Satisfied with our stay", "user": "fru_sorteravn", "date": "March 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 100659730}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "We spent a week at Negril Tree House and this was our first visit to Jamaica. We had a a great time, the location on the beach is wonderful, have no idea why anyone would complain that the beach near the hotel is narrow or whatever as you can walk along the beach and find another spot. The beach is lined with other hotels and bars so you can move about as you wish and always be near to amenities.", "title": "Great location on 7 mile beach!!", "user": "ormangoff", "date": "March 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 100560353}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The breakfast was really great, there was callaloo and fried dumplings served with a different meat dish every day eg ackee and saltfish, brown chicken stew, porridge type dish flavoured with cinnamon & sugar, banana bread, fruits, cereals, egg station, toast, very good strong coffee and orange juice, They refilled the juice and coffee regularly. The view from the breakfast restaurant was lovely first thing in the morning when the sea was very calm. We didn't eat any other meals at the hotel as it was quite expensive.", "title": "I definitely want to share my experience at Negril Tree House with you.", "helpfulness": 2, "user": "DetroitGuest", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100146196}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 8, "average": 37, "very good": 153, "terrible": 4, "excellent": 326}, "aka": "Negril Tree House Hotel", "slim_ranking": 0.129032258065, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Laid-back family friendly property. Fabulous breakfast is included."}