{"user_rating": 4.5, "review_count": 1219, "name": "Nemacolin Woodlands Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I spent 5 nights recently (July 7-12) at Nemacolin. It was our third trip to the resort. We booked a suite in the Chateau. Our rooms were very spacious with an oversized luxurious bathroom - but I knew they would be from our previous visits. There is plenty of drawer and closet space and the turn down service every night was the best we had ever had. Not only do you get chocolate, but they replace used towels and take out your trash!!", "title": "Outstanding Resort", "helpfulness": 4, "user": "Lillytoo", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8138856, "likes": {"liked": "— Great service and beautiful grounds."}}, {"rating": 2.0, "title": "Nemacolin Woodlands a two-star adventure at the five-star price", "text": "There are so many things to do at this resort. There are many activities and areas (beach, zoo) to explore! Paradise Pool is aptly named and I had another great massage at the Spa. My husband used the work out room and I took the cardio mix class which were free. We took our laptop and received Wi-Fi at no charge.", "helpfulness": 4, "user": "palmbeach33480", "date": "July 14, 2007", "id": 8116499}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Although they offer a shuttle service as the resort is spread out, we walked to The Caddy Shack twice to eat and rode bikes to The Gazebo - but it is hilly. We saw lots of shuttles and people seemed to have little or no wait times.", "title": "Nice, pretty and relaxing but not amazing", "helpfulness": 5, "user": "ELM2426", "date": "July 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8103777, "likes": {"liked": "— The friendly service", "disliked": "— That the resort needs updating and more excitement in the air"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Falling Rock is a beautiful place. Make sure you go there to visit or eat if you do not stay there. We had a romantic dinner one evening outside on the patio.", "title": "Nice But Pricey", "helpfulness": 3, "user": "SassyTraveler26", "date": "July 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 8086185, "likes": {"liked": "— Beautiful property", "disliked": "— Overpriced"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Food prices are somewhat high but not out of line for a 4 star resort. Drink prices are high as well, but after paying $14 for a drink in St. Kitts in April and the same amount last summer in San Francisco, I was okay with paying $10 at Nemacolin. You can also ask for a frig and bring in your own wine or cocktails.", "title": "Fantastic resort", "helpfulness": 2, "user": "BezManchester", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8070705}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Where to begin? Nemacolin is a beautiful property with ambiance rarely seen in this area. We visited there in 2006, children in tow for a golf outing. We stayed at the Chateau in a lovely suite with amazingly comfortable beds & pillows. The washcloth was much like a strong cotton loofah, which was a nice surprise. The bath products, towels & pillows were available for purchase & yes, I did bring a few home.", "title": "Very nice, upscale resort!", "helpfulness": 3, "user": "PittsburghChris", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8028012, "likes": {"liked": "— Beautiful hotel", "disliked": "— Lack of respect for the children of guests."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The children weren't as impressed with the cigar shop, restaurant, shopping, artwork or surroundings lol. The pool was nice but other than golf, wall climb & watching the hummer there wasn't a lot for them to occupy themselves. The resort did offer a child check in which was cute for the wee set but my children are a bit older.", "title": "Treat yourself to this place", "helpfulness": 7, "user": "Ohio Traveller", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7941375, "likes": {"liked": "— The huge jacuzzi tub in the bathroom"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "There is an sweet indoor kids pool but on our visit this pool was unsupervised. This pool is isolated from the other pool & out of view unless you are directly in that room. Between us I couldn't get over the parents that let their little ones go to this pool without even bothering to check if there was a guard. This is not an ankle deep pool folks!! :(", "title": "Disappointing Spa", "helpfulness": 7, "user": "TNConstanttraveler", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 7495268, "likes": {"liked": "— bathroom", "disliked": "— small, cramped room with tiny window"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Food: The restaurants at Nemacolin were surprisingly reasonable. Only one restaurant on our visit was not child friendly so I guess that's their loss. Indeed, how are well behaved children supposed to learn proper etiquette if they are not allowed to attend an opportunity?", "title": "Very nice.", "helpfulness": 2, "user": "carlybaby1", "date": "April 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7406716, "likes": {"liked": "— Liked everything but especially the location.", "disliked": "— Nothing. It was very nice."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Room: Above average with exceptionally comfortable bedding. Our room with a view was better drapes drawn.", "title": "Fabulous Winter Weekend", "helpfulness": 5, "user": "pwalker101", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6819772, "likes": {"liked": "— The Woodlands Spa."}}, {"rating": 1.0, "title": "Nemacolin? FORGET IT !", "text": "My wife suggested we take a weekend at Nemacolin to workout, dine, spa & relax.", "helpfulness": 5, "user": "aeromedicstat", "date": "February 20, 2007", "id": 6815745}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Never Happened.", "title": "so so so so so so so disappointed", "helpfulness": 10, "user": "laurcas", "date": "February 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 6813885}, {"rating": 5.0, "title": "Spring Break with our 11 & 13 year olds", "text": "Cold marble flooring in the bath only added to general discomfort of our chilly room in the \"Château”. We eventually had to call for an electric space heater. The following morning we were informed that \"a problem with the gas company\" was to blame for the lack of hot water. After waiting several hours in vain for a shower we checked out.", "helpfulness": 11, "user": "okobojiman", "date": "December 17, 2006", "id": 6453984}, {"rating": 2.0, "stay_parameters": "Stayed September 2006", "text": "Let the nouveau riche squander their time at this pathetic excuse for a resort.... Wish I could have said it reminded me of more of \"Faulty Towers\" than a very expensive gulag.", "title": "A Poor Value", "helpfulness": 9, "user": "cjzd", "date": "October 4, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 5908313, "likes": {"liked": "— the grounds", "disliked": "— expensive"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I have been going to Nemacolin since the early 80's - when there was nothing but 18 holes, and the Lodge and the townhouses (which are universally described by others as \"tired\" - I didn't see them this visit). Since our 3 day \"honeymoon\" there in 1993. Before, and just as, Joe Hardy and his daughter turned it into the travesty it has become.", "title": "Too expensive by 1/3, but a pleasant stay", "helpfulness": 9, "user": "siouxknox", "date": "September 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5819478, "likes": {"liked": "— lots to do", "disliked": "— expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Nemacolin is a expansive resort in the middle of small Pennsylvania towns. We stayed there for 3 nights and found it to be quite a nice place to go for a short get away. There are plenty of paths to walk, interesting animals to see, enough activities for a short visit. We found all the help to especially friendly, we were always greeted whenever we passed anyone who worked at hotel. Our room was very nice, very clean, and exceptionally large.", "title": "a very nice resort", "helpfulness": 3, "user": "kyamin", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8718406, "likes": {"liked": "— property", "disliked": "— pool"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The grounds are huge and well kept, there are shuttles that drive the property and take you where ever you want to go. The golf courses are beautiful, the restaurant are very nice but quite expensive. We went off property for dinner one night. You do have to pay for most activities, but I have found that at most resorts. My complaint would be with the pool. When we were there the hotel was full, the only place you noticed this was at the pool. It was very crowded, a lot of children, which is fine, but there was no place to sit and relax. In fact I couldn't not find a chair and had to leave. i would really recommend that they build another pool, and maybe an adult pool. I like to swim laps, which I think a lot of adults do, and that was not possible.", "title": "Beautiful place, but....", "helpfulness": 2, "user": "lavagirl", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8655627}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Overall I would say this is a very interesting place to visit. There is plenty of art work, sculptures, and interesting rooms around the resort to explore.", "title": "Three star resort at five star prices", "user": "DubUSA", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8535397, "likes": {"liked": "— Ropes Course", "disliked": "— The price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My family and I recently stayed at Nemacolin and thought it was beautiful. We also loved how the view outside our townhouse window had horses and zebras running about (yes, I said zebras!) The animals on the resort are amazing. My one gripe, and I have read this in other reviews of the resort, is that they charge you for every little thing, and consider anything other than your room charge (and at over $400 a night, you might expect a little something) an \"extra.\" I mean, down to using the computer in their business center...they charge $20 per half an hour, after I had to walk to the front desk and back (a 10 minute walk each way) and was charged to get the key. We even did the steak fry safari, which was great for the kids, although the previous day we had already gone to the wilderness area, and got roped into the animal tour for $30 per person. Yes, $30 even for kids. And the steak fry dinner was about $150 for my family of four, and you had to pay extra for soda. I mean, c'mon. Not to mention a less than 10 minute pony ride for each of my kids that ended up being $50 with tip. Or the rock climbing wall which was over $20 per person, or the mini golf..... EVERYTHING is extra. I could go on and on. Its too bad, because the resort is beautiful, and the staff is absolutely wonderful, and very welcoming. Its just the annoyance of every thing extra that really started to get on my nerves by the end of the trip. That being said, if you go into it with fair warning, you will enjoy the resort and the beauty of the area.", "title": "Perfect, Perfect Perfect Honeymoon", "helpfulness": 4, "user": "JJB7WashingtonD_C_", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8233915, "likes": {"liked": "— Everything", "disliked": "— not enough time"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Bottom line: We enjoyed our stay, and Nemacolin is a nice resort, but WAY overpriced.", "title": "Overrated", "helpfulness": 6, "user": "Sheeny", "date": "July 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8181833, "likes": {"liked": "— Food", "disliked": "— Tackiness"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Wonderful destination for a family getaway, whether you want to be active, or just relax. We stayed in one of the townhomes, which was quiet and peaceful, and perfect for a family of four (also more affordable than the hotels). Off road driving lessons and outstanding golfing facilities kept our adult sons entertained, and we all enjoyed cycling through the lovely grounds. We had a superb meal in Aqueous, with an equally enjoyable second in Autumn. Not cheap, but worth the expense in every way.", "title": "Wonderful getaway", "user": "Brian D", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134418237}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Everything about Nemacolin is wonderful. My husband and I spent one night for our anniversary, the associates all made us feel incredibly special. Well worth the price. This was our third time and we will be back.", "title": "Perfect experience!", "helpfulness": 1, "user": "Mfaris_12", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134416549}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Nemacolin surpassed my expectations with respect to hotel decor, artwork on display and room appointments. The food and staff were exceptional. The varied number of activities can easily keep any age group happy or family member engaged in making for a memorable visit.", "title": "Unique property with outstanding activities", "user": "PIEKAR", "date": "July 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 134364916}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "A few years ago, I was in need of a relaxing spa treat that I could accomplish in a long weekend and could drive to from the Washington, D.C. area. I had heard of Nemacolin and decided to check it out. My stay was lovely, quiet, and filled with wonderful spa treatments! The spa staff was very attentive and excellent. I was instantly relaxed and fell in love the great tea that is readily available in all of the waiting areas in the spa! The gym was great and I love swimming in the pools! The best part of this was the great Sunday brunch offered at the main restaurant. I recommend many work-outs to prepare for this Sunday brunch feast! As a single person, I could have used a little more nightlife, though, and the resort has little to offer there. I recommend bringing a friend or lover and that problem will be solved! Check it out and be ready to splurge on spa treatments; they are well worth it!", "title": "Delightful Getaway!", "user": "wdcnative", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134236992}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at the Lodge. I commend the resort for offering an excellent military rate of $119/night. Our room was very nice.", "title": "Nice getaway, but won't be going back.", "helpfulness": 1, "user": "PMFan", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134233891}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We recently spent 4 days at Nemacolin with our 14 year old. It is paradise for kids and fantastic for adults as well. Our son played miniature golf, bowling, climbed 40 feet and did the ropes course, zip lined over a 1000 feet, climbed a 50 foot climbing wall, fed lions and tigers and bears, played two different types of paint ball games and sat in a car while a 17 year old did the off road jeep trips through the woods. There were also traditional activities like swimming pools and tennis courts. Apparently, there is a gymnasium as well that we did not go to. For adults, there are fabulous restaurants, shopping, a 5 star spa, work out facilities, work out classes, golf courses and at least 3 entertainment locations on site and lounges. We tried to take advantage of everything they had to offer. We stayed in the Chateau where every room has an exquisite chandelier. The main lobby is elegant and classy, also with many chandeliers. The staff were outstanding and we never had a bad meal at any of the restaurants. We never left the hotel the entire time even though the famous Frank Lloyd Wright Falling Waters home is less than a 1/2 away. The only negative is that Nemacolin is 1 3/4 hours from Pittsburgh airport. If you live in DC or nearby, it is a beautiful 3 hour drive into the Mountains. We live on the West Coast, so it is not so easy for us to get to. We do have family in Ohio and were only a few hours away from Cleveland.", "title": "As good as Disneyland for kids", "user": "wunderful", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134988215}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Nemacolin has something for everyone!", "title": "A Wonderful Time!", "user": "Jim S", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134949568}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The nine members of our party ranged in age from 60-somethings down to a two-year-old, and we all had a great time. The golfers were challenged, although their burden at Mystic Rock was eased considerably by an excellent forecaddie. The spa goers were pampered and relaxed, while those so inclined were thrilled riding the zip line. And the little guys were busy ... exploring the grounds, learning to swim, playing minature golf with Daddy and PopPop, taking their first pony rides, and more.", "title": "climb 2 flights to get to your room?", "helpfulness": 1, "user": "teeitupwithfrank", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 134937158}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Our rooms were spacious and immaculate.", "title": "Wow, spectacular in many ways", "user": "sfulton", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134913039}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Our dining options were many and the service was excellent throughout. We had an early breakfast at the Gazebo on the golf course ... and we saw a bear. The next day, the little guys were treated to a breakfast of room service pancakes. We enjoyed a couple of meals in the Tavern. The dining coup, however, came during a 21st birthday dinner celebration at Autumn. The food and service were simply awesome! And to top it off, the Chef took time to visit our table to cut the birthday cake.", "title": "Beautiful corporate retreat", "user": "middyj2005", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134827492}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "If you have yet to experience the Falling Rock Lodge at Nemacolin Woodlands resort in Farmington, PA, put it on your priority list. The luxurious accommodations, complete with Butler Service, a world class spa, a Pete Dye Golf Course which once hosted a PGA Tour event, and many other first class amenities would make Robin Leech proud. In fact, I've seen pictures, Robin Leech has actually vacationed at Nemacolin himself. It's the lifestyles of the rich and famous personalized to your own taste. Imagine a romantic dinner at a five-star restaurant followed by a soothing bubble bath drawn by your own personal butler. It's an amazing place!!! You owe it to yourself to experience Nemacolin.", "title": "Escape to Nemacolin", "user": "Bruce P", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134180430}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "This resort deserves the five star rating they have achieved. You will not be disappointed in your stay.", "title": "This resort is absolutely beautiful and there are so many things to do for all ages.", "user": "Krmiller414", "date": "July 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134177482}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I find Nemacolin Woodlands charming and fun! There are some funky elements that make it even more fun than some stuffy resorts. The Spa is wonderful, there is a good variety of restaurants and snacking places, the pool is great and there is a wide variety of activities. Six members of my family gathered there with ages from mid 70s through mid 40s to preteen and we all had a good time!", "title": "Great Family Vacation", "helpfulness": 2, "user": "Barbara A", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134065129}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed at Falling Rock. Well worth the extra price. Fantastic butler service, lots of room in hotel room, shuttle service around resort, great amenities, golf, spa, pool uncrowded, great pool-side and restauant service, unlimited pampering all the way around.", "title": "Pampering Deluxe", "helpfulness": 2, "user": "MySable", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134053834}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My spouse and I spent three days at Nemacolin Woodlands Resort & Spa. This was our second stay. During both visits we were impressed with the guest-centric attitude of the staff. We felt as though we were the only guests on the property. We stayed at the Lodge in a spacious room with a small balcony. We found that from here we could reach any of the other facilities on the property in minutes via the shuttle.", "title": "Nemacolin Woodlands", "user": "FenderjazzBaltimore", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134007154}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "First class visit. Great combination of class at the resort and quality people who work there. Every minute there we felt welcomed. Dinner at Autumns was wonderful.", "title": "Wonderful stay", "helpfulness": 1, "user": "Doug C", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134809877}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "So many things to do including zipline, ropes course, archery, hiking just to name a few. The scenery is beautiful and a relaxing place to get away.", "title": "Amazing resort!", "user": "Linda T", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134674049}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Nemacolin has really been going down hill. We have been staying here from the begining. Now it is as if they don't care anymore. I also have run into some rude and crazy help. As far as the Wooflands I had some good experience the first few times I left my dogs there but the last time something was really different about my dogs and the one lady her name is Penny is just plain horrible. I will not be taking my dogs back there again....... I will say though Kelly is a wonderful groomer...", "title": "Sad to see Nemacolin and the Wooflands going down hill....", "helpfulness": 3, "user": "Jill S", "date": "July 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134552712}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Nemacolin is a wonderful resort in an unexpected place--it rises out of \"rural\" Pennsylvania into a world of its own. There really is something for everyone. For us, it was the golf and fine dining in a beautiful setting with lovely accommodations. For a future trip with children, there were many interesting activities for all ages. We certainly hope to return many times again!", "title": "Something for everyone!", "user": "onthego17Virginia", "date": "July 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134471987}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "It is inconceivable that a first rate facility such as Nemacolin could serve the kind of food we experienced. The Tavern the first night was abysmal and we couldn't eat some of the appetizers. When we finished our round at Mystic Rock, the only place serving lunch there had an Asian Menu. No chef's salads, tuna or chicken salads or a decent hamburger (the ones we got on that awful ciabatta roll were dreadful). Then we had dinner at the restaurant at Mystic Rock. Other than running out of the specials, not having the vodka we drank, and the unbelievibly slow service, we suffered through another extremely poor meal. We couldn't send the steaks back as we had been there over an hour just getting our salads. Upon leaving the next afternoon, we asked one of the bellmen where we could have a nice lunch and he suggested a place on the highway. Obviously he had tasted the food at Nemacolin.", "title": "You Need Some Restaurant People", "helpfulness": 2, "user": "Pacy O", "date": "July 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134435008}], "location": {"country": "United States", "city": "Farmington"}, "stars": 4, "variance": {"poor": 43, "average": 95, "very good": 236, "terrible": 28, "excellent": 817}, "aka": "Nemacolin Woodlands Hotel Farmington", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Situated on 2,000 acres in the Laurel Highlands of Western Pennsylvania and just 70 miles southeast of Pittsburgh, Nemacolin Woodlands Resort is consistently recognized in the travel and hospitality industry for superior service, luxurious accommodations, large selection of amenities and as a first-class meeting destination. Nemacolin is one of only 11 Resorts in the world to feature both Forbes Five-Star and AAA Five-Diamond lodging and dining. With activities and amenities galore you can expect the unexpected at Nemacolin Woodlands Resort."}