{"user_rating": 4.0, "review_count": 133, "name": "Nesima Resort and Dive Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I liked this hotel, It's quaint, very central and if you enjoy diving has a very good dive center attached to it. Yes the room was fairly small, but perfectly functional and air-conditioned and the bathroom wasn't huge either, but again entirely suitable to it's purpose. Having said that, I'm one of those that doesn't spend a lot of time in either. I'm on holiday, I can spend time in my own room at home, no need to travel all that way for that! The reception staff we're helpful and friendly as we're the staff that looked after the rooms. There is free wi-fi which worked well enough for the emails from my phone and an ATM (Bank machine) right outside the hotels entrance. It has a very nice pool with a bar on the one side and a great view out over the sea. The breakfast were quite plain, but there was plenty to eat and the quality of the food good. If asked whether I would stay there again; definitely yes.", "title": "A lovely hotel", "helpfulness": 1, "user": "Jehnim", "date": "July 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134720426}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I travelled to Dahab during Christmas with my husband and my visiting friend. We were surprised the rooms were very small but I enjoyed the architecture.", "title": "Pleasant stay. Would return", "helpfulness": 1, "user": "Kristin E", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134340329}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The hotel itself is very well kept. The staff is friendly and the food is tasty (definitely caters to western tastes).", "title": "Pleasant family resort", "user": "J0hnSweet", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 133980892}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I like how they had safe boxes in the lobby to keep your valuables because there were no screens on the windows in the rooms.", "title": "Nice down-to-earth and relaxed hotel", "helpfulness": 2, "user": "Rudgr", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131952472}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Great for the price and location! I would definitely stay again.", "title": "Great Dive Centre, Basic but Comfortable Hotel", "user": "Ann C", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131505914}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "The hotel is clean and comfortable and the staff are all very friendly and helpful. The pool is lovely and overlooking the sea. The whole place has a very calm and relaxing feel to it. Rooms are not the biggest but are very clean and had everything I needed. The restaurant and roof lounge are also very nice and a nice place to relax after a days diving. I would have given it 5 stars, but as some other reviewers have said the breakfast was a bit limited. Please don't let that put you off, there is a good selection of bread, cereals, cheese etc, but just I don't feel it deserves 5 stars and honesty is the best policy I think!", "title": "5 Star diving experience and a very relaxing break", "helpfulness": 1, "user": "FayeW", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140895593}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The dive centre however is outstanding. The staff were so friendly and helpful and really couldn't do enough for you. The set up is excellent. You have your own private locker to lock and store things away, as well as fresh water rinse tanks and a drying room which is also locked at night. Each person gets a locker, 2 hangers for wetsuits, a hanger for bcd and pegs to hang your boots on for drying, all numbered the same.", "title": "to live in harmony with nature", "helpfulness": 1, "user": "Ulrike S", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139918550}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Tariq and Diana welcomed me as I arrived and asked what I would like to do for the week. Boat trips can be arranged and as I was due to fly on the date of the next one, they were able to group together with another resort to share the boat and go on another day so that I didn't miss Gabr el Bint (recommend this trip!). Excellent customer service and true dedication to making sure guests get to see everything they want to. The boats used for the day trips are large and spacious and the crew on board very helpful.", "title": "Excellent Dive Centre and Hotel", "user": "Joanna N", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139785860}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "The shore dives are by truck / jeep and you get a shaded area to leave your stuff and relax between dives as well as order food and drinks. Our guide for the week was Nubi, who I can't rate highly enough. He is professional, friendly and genuinely seems to love showing guests the delights of Dahab's dive sites. He is very experienced and has an impressive eye for spotting sea horses! If you are into your photography I would recommend asking for him as he seems to have super vision for the small stuff!", "title": "Friendly, clean and great diving/snorkelling centre", "helpfulness": 1, "user": "Emmita A", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139648058}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There are cats and dogs around, but Nesima staff are doing their best to help the animals and get them neutered to help control the population and ensure the animals are healthier and not begging for food. I really admire their efforts.", "title": "Excellent hotel and Dive Centre but avoid the breakfast", "helpfulness": 1, "user": "Discovered", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139254116}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Yes the rooms are quite small, but if you are going to stay in your room then stay at home. The staff at the hotel were great with us, very friendly and happy to help. I thought there was a good selection on the menu for dinner, breakfast was a bit basic but there are plenty of places that you can eat nearby.The dive centre was first class, run well and supported by friendly guides, they would help you with anything where to shop or eat and would dive any time you wanted weather it be early starts or night dives. If you don't enjoy yourself here you only have yourself to blame. If you ask they will make it happen. They even found a guide from within Dahab to come and do a speciality for me, that their guides/instructors couldn't cover. I can't praise these Guys enough.", "title": "Great People", "helpfulness": 1, "user": "Terry D", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130877170}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Stayed here in May 2012 for the second time. Stayed as a couple but part of a larger group.", "title": "Basic Hotel, Nice people", "user": "JXB1", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130414878}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The rooms are very small and basic but clean and well kept by the staff. They provided mosquito repellent plug ins but we took our own anyway for extra good measure and this was a definite must, plus mosquito repellent with deet in. Fortunately it was quite windy but our co-travelers were suffering with the bugs.", "title": "Basic, but sufficient", "helpfulness": 1, "user": "JelleDeceuninck", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 127910071}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Just a word of warning that the beds are hard! Unfortunately we couldn't really find a solution to this. The staff are very helpful and could not do enough for you. On one particular day we had come back from diving before the pool bar was open for lunch, and the bar manager arranged for us to have our meal choiced brought to us from the main restaurant.", "title": "Friendly and relaxed atmosphere.", "helpfulness": 2, "user": "KBCGoudriaan", "date": "February 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124795059}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The pool bar does shut at 7pm in favour of the guests using the main hotel bar next door, which caught us out on the first couple of nights.", "title": "Friendly, relaxing and simple", "helpfulness": 1, "user": "Tamsinhoare", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122821372}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I feel very lucky that we chose to come to this resort to learn to dive. Myself and my daughter completed our open water referral here and discovered a whole new world! Our instructor Nubi was wonderful. Professional, knowledgable and relaxed. The perfect combination for nervous new divers! All the staff at the dive centre were helpful and efficient and the centre itself was well organised and clean. Nothing was too much trouble. We mentioned that we wanted to ride a camel and our dive guide was really helpful in organising a trip for us. We rode up into the mountains to watch the sunset. The beauty and silence were breathtaking. Our Bedouin guide made us tea over a camp fire and then we walked back under the star light. It was a truly marvellous and memorable experience.", "title": "Highly recommended", "helpfulness": 1, "user": "Linda K", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138648449}, {"rating": 3.0, "title": "Central, nice diving, could improve service", "text": "The hotel was also excellent. The rooms were of adequate size, clean and comfortable, and the towel sculptures on our beds were a treat! The pool is lovely, as are the grounds and all the staff were friendly and helpful.", "helpfulness": 1, "user": "angelovanzyl", "date": "August 16, 2012", "id": 137327032}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The location is perfect, you can float in the pool and look out to the sea only a few metres away, or across to the stunning mountain backdrop, and there a loads of restaurants and shops to choose from. We went in to a different restaurant every night and they were all good, and great value for money.", "title": "Relaxing hotel, great location", "user": "00Jim", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136502603}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had no problem whatsover with mosquitos, we didn't see a single one and neither of us got bitten at all - a first for us on holidays abroad!", "title": "fantastic food", "user": "rosecol1958", "date": "August 3, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 136148236}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The only slight irritation was the cats. There are lots of dogs and cats wandering around Dahab. The dogs are no problem, very quiet and docile, but the cats can be pests when you are eating. Some of the restaurants provided us with water in a spray bottle to use if they got too close! However on one occassion when we chose to sit on the floor to eat, a cat leapt over my shoulder and made off with 2 slices of my tuna pizza before I could blink!", "title": "Great diving centre", "helpfulness": 1, "user": "wookie-taff", "date": "July 23, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 135155921}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa"}, "stars": 4, "variance": {"poor": 4, "average": 15, "very good": 60, "terrible": 4, "excellent": 50}, "aka": "New Nesima Resort And Dive Hotel", "slim_ranking": 0.43137254902}