{"user_rating": 4.0, "review_count": 651, "name": "New World Makati Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I have never been to a better hotel in regards to the treatment the staff gave us. The staff was outstanding, they were polite, happy and extremely helpful. We had the club level room on the 23rd floor which included breakfast. The breakfast buffet is outstanding with everything you could possible want and enough to last u all day. Every single person I dealt with in the hotel was absolutely outstanding. I highly recommend the hotel and would always stay there when in Manila. The location to shops and restaurants is also very good. Just a great stay.......", "title": "Greatest Hotel, Best staff ever", "helpfulness": 1, "user": "fsdfs", "date": "January 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93998851}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I was in Manila on a business trip last July and I stayed at the New World Hotel for the entire 3 weeks of my visit. I am scheduled to return to Manila later this year and I will definitely be staying there again!!", "title": "Excellent service with a smile in an ideal business location", "helpfulness": 2, "user": "alphieblack", "date": "January 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92862886}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "THE ROOMS", "title": "Relaxing", "helpfulness": 1, "user": "Thegangs", "date": "January 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92737011}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I had a deluxe room during my stay and found it more than adequate to the needs of a business traveller. The room was spacious and had floor-to-ceiling windows looking over the city and towards the Greenbelt mall complex. The furnishings were tasteful and in good repair, consisting of: a king-size bed, a large settee, an armchair, a coffee table, two end-tables on either side of the bed, a writing desk and a TV cabinet. The floor was carpeted in the bedroom area, with a tiled entrance way and tiled bathroom. There were two large built-in wardrobes and a third cupboard containing a iron, ironing board, kettle, mini-fridge (fully stocked, with price list), and safe. I kept my passport and extra pesos in the safe during my stay and had no problems.", "title": "Great location across from Greenbelt 3 Mall", "helpfulness": 2, "user": "Trojan4Life", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 92350824}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The bed was very comfortable, and there were plenty of pillows and some extra blankets in the wardrobes. (There were also two plush bathrobes, some slippers and a hotel umbrella.) The writing desk was fairly large and the Ethernet socket was immediately behind it, making it a useful place to plug in my laptop. Some hotel stationery was provided in the desk drawers, along with the room-service menus, laundry prices and a brief guide to the hotel's amenities. The outlets in the room were configured to accept both American and UK plugs, and I did not require an adaptor to plug in my computer.", "title": "Reception Woes and Busted Shower Light", "helpfulness": 1, "user": "GreatGramo", "date": "January 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 91493999}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed here for 3 nights for a business trip. Was not impressed with their service. I was dead tired after a long day of traveling and was enraged when I found out that my room faced a club located at the Greenbelt Mall (across the street) and another mall that had construction going on at 12:30 am. It was really loud, like beeping sounds of trucks and cement being drilled. My room was also 11 floors above the club in the hotel so I could people talking loudly as they were leaving. I called the front desk to request a room change and they put me on hold. Called again and they said someone would call me back. After 20 minutes of this back and forth I finally packed up my things and hauled my suitcase to the lobby wearing my pj's. It was ridiculous that I even had to do this to get a room change. The staff is so clueless and slow. Finally they gave me a different room that faced the back of the building and I could get some much needed sleep.", "title": "Good location, slow service, rooms need to be updated.", "user": "orange_crush6", "date": "December 26, 2011", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 122097109}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Room- these need to be updated. The furniture is old and shabby.", "title": "Pleasant setting, close proximity to Shopping Mall and some quirks", "helpfulness": 3, "user": "Pascaleh", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121998896}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Club level- nice view, wifi access in this area only (only cable access in rooms), food assortment is ok, cocktails service was good.", "title": "Great Location with Class", "helpfulness": 2, "user": "ThakurG", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121913693}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Location- across the street from the Greenbelt Mall. There is a huge assortment of restaurants and shopping.", "title": "Great Location but Needs Updating", "helpfulness": 1, "user": "zore01", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 121787430}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I would not choose to stay here again.", "title": "Good Location", "helpfulness": 3, "user": "reenz1818", "date": "December 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121758265}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed at this hotel last week and the location was great! Hotel has a very 'posh feel' to it. Right opposite greenbelt 3, it was easy to get a taxi and a very secure hotel with security guards all around to assist with any issues or help with directions or getting a cab. Staff was very helpful in the hotel.", "title": "High class and great location", "user": "ronzz", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121756595}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "First impressions are great, with a large and airy lobby. A little outdated, but luxurious and welcoming. Service was excellent. The room was large with marble bathroom with a separate shower and bath. I had a good view back towards central Manila.", "title": "Good quality international hotel in excellent location", "helpfulness": 2, "user": "Brocko25", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121642602}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Booked an airport transfer with the hotel, but the driver wasnt waiting for me at arrivals so that was a bit of a challenge after flying from London via Singapore. After walking back and forth through the stifling crowds (the airport is a nightmare, worst I have ever been to), a friendly security guard helped me and showed me where to go to meet the car.", "title": "One of the best hotels I have stayed in", "user": "shivkumarn", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121608349}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The Greenbelt mall across the road is perfect with all the services you could want. The only criticism was the hotel price was very expensive - around US$250 for the night. I'd have to say it isnt worth that....", "title": "Disappointed", "user": "Echo924", "date": "December 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 121488347}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "This hotel has everything going for it. Fantastic location, friendly and helpful staff, excellent rooms, the best mall in Manila, great breakfast, excellent sofa/chairs, comfortable bed, great bathrooms, adjustable lighting, controllable aircon (yes, really). Also great restaurants near the hotel in walking distance.", "title": "Well Worth It!", "user": "Anthony H", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121470415}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Was in Manila on a business trip. Hotel was good. Had the privilege to breakfast on the 23rd floor with view of the surrounding buildings. Room was rather large, bed comfortable, everything worked, coffe maker, but only one sachet of coffee, regulary replenished, no ironing board, laundry rather expensive, but within one day, noise from streets on both sides of the hotel, no garden or pool, but it is a city hotel, just oppoiste the green belt, that is a kind of artificial miniature park, anyhow, staff really very friendly and helpfull. what surprised me most was the high water pressure in the bath tub and shower.", "title": "Central and pleasant location", "helpfulness": 1, "user": "Frequentvoyager", "date": "March 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100179499}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "My name is Elizabeth Sonnier, President of Water Oak International, an international trade brokerage firm based in Houston, Texas. On February 12-21, 2011, my niece, Cecille Zarra, and I stayed at New World Hotel in Makati, Manila.", "title": "Professional representation of the entire staff, a reflection of the management.", "helpfulness": 2, "user": "esonnieratglobal2020", "date": "March 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100082778}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "In our business of global trading we travel to every corner of the world. And while many of the hotels we have seen have great service, it is very rare to find a one where 100% of the staff would have such professional representation to equal that of a five-star hotel. And it is with great pleasure that we commend New World Hotel for the hospitality that the entire staff had shown us during our nine-day stay. From the Director of Front Desk, Glescy Reyes, the Chief of Security, Cj, Accounts Staff, Ms. Aquino, bellman, Jet, restaurant attendants, housekeeping, door persons, front desk personnel, the doctor and the nurse who attended to my medical needs when I had food poisoning, and to the rest of security, they all gave us such a special treatment.", "title": "Service 10/10", "helpfulness": 1, "user": "AltyDave", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99909002}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I would like to also commend their restaurants and all the waiting staff. They were so attentive, making sure that they provided us with everything that we needed and more. In addition to serving the freshest variety of authentic Filipino and international foods, they also taste like home made meals.", "title": "great stay", "helpfulness": 1, "user": "beachlover0099", "date": "March 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99704553}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "All these are reflections of the type of management that New World Hotel maintains. Water Oak International, who is in the business of international trading and brokering have now begun highly recommending New World Hotel as the best place to stay when in Manila.", "title": "they know what you expect", "helpfulness": 1, "user": "TTDao", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98312627}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I've never been to the Philippines before, so the first thing you do at 'nicer' places in manila is go through a metal detector. They had these everywhere in this area, so I was a bit shocked at first, but you get used to it.", "title": "it was lovely", "helpfulness": 1, "user": "Travel_Silly77", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 89971932}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "I can't really comment on location because we didn't do that much sigh seeing. We went to manila for a wedding, so we only stayed at the hotel for 3 nights. There is a big mall across the street, and additional shopping in the area. There's good food around, but food in the greenbelt mall is expensive. so is the shopping.", "title": "A terrific hotel in a terrific location", "helpfulness": 2, "user": "JoshAustralia", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89543663}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The service at the hotel was amazing, everyone is always super nice! We got the package that includes breakfast, and it's totally worth it! One couple out of our group opted out of the breakfast and they only saved 50 peso's a day per person, and the hotel charges around 2000 pesos for the breakfast, so TOTALLY WORTH IT and there's tons of stuff to chose from.", "title": "Good area to stay at when in Manila", "helpfulness": 1, "user": "bs_cb", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89426049}, {"rating": 4.0, "title": "Still a good choice", "text": "As for the room, the mattress was too soft for my liking... and the room and bathroom needs more lighting (i like rooms to be bright). All in all it was a lovely stay.", "helpfulness": 1, "user": "rayu66", "date": "December 6, 2010", "id": 89155176}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I stayed her twice in November and could have stayed a year. Along with Traders in Kuala Lumpur, this is the best value 5* accommodation I have experienced.", "title": "Excellent location - would stay again wihout hesitation", "helpfulness": 1, "user": "CliffDC", "date": "November 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88499511}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The hotel is 15 minutes from the airport, tell the driver to take the toll road otherwise it's 40 minutes. The reception and staff are excellent, cheek-in was quick and painless. I was reassured by the security at the hotel which is very professional without being over bearing. The rooms are large and fitted out to a very high standard. It is one of the best hotels I have stayed in for a long time for fit out, cleanliness and staff. The beds are amazing, the best night's sleep I have had in a while. There are a few nice restaurants and bars in the hotels but there are many locations to choose nearby. It's located opposite the two largest malls in Manila with hundreds of shops, bars and restaurants to choose from. We travelled a bit and visited some of the other hotels and this one is centrally located and would be the pick of hotels in Manila.", "title": "Excellent hotel in great location", "user": "MBarr", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122634094}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The New World Hotel is located right next to the Greenbelt, which is very convenient when you need to get out for a bite to eat, a drink or some shopping. On the outside, the hotel looks quite sleek but once inside it is apparent it is getting a bit dated. The rooms are more than comfortable if you're not looking for anything to high end; clean, air conditioned and spacious enough.", "title": "Good location, not quite a 5* but not 5* prices either", "user": "aka.seth", "date": "January 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122581916}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Ate in the restaurant and the food was tasty enough but the service was pretty amateur. It took a ridiculous amount of time just to get a coffee (came after I'd finished all my food even though it was the first thing I ordered) and when it did finally arrive it went to the wrong table. Their attempt at friendly but forced customer chit chat was amusing at first but then quickly just annoying.", "title": "Near Malls, church, and comfy beds", "user": "alias34", "date": "January 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122453394}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The hotel is not anywhere close to as sleek as the other better known 5* hotels but then again you won't be paying those sorts of prices so it is good value and does a pretty decent job of it. Working girls hanging out in the lobby didn't do its image any favour.", "title": "Great value in Makati", "user": "billharley", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122340623}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Don't think there was free wi fi, which for a hotel that should be catering for business travelers given its location, is a bit annoying.", "title": "\"Nice Hotel at a Great Location\"", "user": "Donnie1115", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122306713}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We spent the frist three nights of our Philippines holiday at the New World Hotel Makati and it exceeded all of our expectations. We booked a club room and were located on the 24th floor which had a great view out over the city (good view to watch the fireworks). The service we received was extremely personal by every staff member we dealt with (especially Law in the club lounge - he was lovely!). We were greated by ours names at all times and were really made to feel special. The brekky in the club room was really nice, cold buffet with hot meals off the Al a Cart menu. Evening finger food & drinks were also included, was a great spot to have a few nibbles & wine before heading accross to Greenbelt for dinner. The hotel pool was lovely, 25m with plenty of loungers and the gym was possibly the best I have ever seen in a hotel - quality equipment and plenty of it. Lastly, the location of the hotel could not be better, Greenbelt is literally straight across the road, we felt extremely safe at all times and the dinning options were endless. We would definitely recommend this hotel and when we return to Manila this will always be our first choice.", "title": "Impossible to Fault, Fabulous Stay", "helpfulness": 1, "user": "AussieTravelAddict8", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97518758}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This hotel is 5*.", "title": "Best hotel we have ever stayed in.", "helpfulness": 1, "user": "alexballantine", "date": "February 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96670533}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The hotel has a great location for the greenbelt and it's nice restaurants and shops.", "title": "Clean, spacious, comfortable rooms with excellent staff and service", "helpfulness": 1, "user": "newapfan", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94860920}, {"rating": 4.0, "stay_parameters": "Stayed January 2011", "text": "The room was large enough and the bathroom was very nice.", "title": "Pretty good for the price", "helpfulness": 1, "user": "Joe S", "date": "January 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 94086999}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "The breakfast was the best i have ever had in a hotel and the executive lounge makes it well worth paying slightly more for the top end rooms.", "title": "Pleasantly surprised", "helpfulness": 1, "user": "FawazMadhi", "date": "January 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 94018631}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The staff at this hotel are some of the most friendly I have met. There is always plenty of people on hand, and at one stage i noticed more staff in the lobby area than guests.", "title": "Very friendly staff, great location", "helpfulness": 2, "user": "travellingrat", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 121353781}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The Room: Nice and spacious, unfortunately I had to have a room with two single beds, and there were no more queen rooms available. I had a nice view from my room down onto the swimming pool, and across to the Greenbelt. The bathroom was a good size and very clean. Seperate bath and shower was nice.", "title": "Would stay again for location but....", "helpfulness": 2, "user": "KiwiinBrighton", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121265944}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Food: Only ate breakfast there, which was very nice. Plenty of places to eat in the Greenbelt which is just across the road. These were all very reasonably priced, and its great to sit there and have a drink while watching the comings and goings.", "title": "Very pleased with our stay", "helpfulness": 2, "user": "lake_merritt", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121179687}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The Staff: As mentioned already there is heaps of staff on duty, and always opening doors with a smile and friendly greeting.", "title": "Elegant yet functional hotel in the center of shopping & eating", "helpfulness": 3, "user": "fireblazer", "date": "November 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121053225}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Security at the hotel is good, bags are searched on entry, as are vehicles pulling up to the front of the hotel. I arranged transport back to the airport through the hotel, and although pricey compared to a taxi, it was very efficient, the car was in great condition and clean. Water was provided for the trip.", "title": "An OK business hotel in a great spot", "helpfulness": 2, "user": "GrantNewy78", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121035475}], "location": {"country": "Philippines", "continent": "Asia"}, "stars": 4, "variance": {"poor": 40, "average": 88, "very good": 282, "terrible": 6, "excellent": 235}, "aka": "Renaissance Makati", "slim_ranking": 0.131147540984, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "A luxury retreat and destination in the heart of the city, New World Makati Hotel is in the heart of “The Wall Street of the Philippines” -- the financial district of Makati City. Right across the street from the smart Greenbelt area of Ayala Center, the 595 stylishly appointed guestrooms and suites combine stunning city views with comfort."}