{"user_rating": 4.5, "review_count": 267, "name": "New Star Beach Resort", "reviews": [{"rating": 5.0, "title": "Paradise in Samui", "text": "We stayed one week end of sept. -08 in this hotel with my husband. We enjoyed this week as much as possible, and we thought that this hotel was as close haven as possible. We hardly noticed any contstracions. The beach was beautiful, and empty and pool was perfect. Staff were very friendly and helpful. My husband had 50`birthday there, and in the evening two members of staff knocked to the door, sang happy birthday to you and brought a choclate cake! What a nice suprise! The hotel is little far away from shops and restaurants, that´s why I woudn´t recomened that for family with teenagers (I woundn´t book that for my whole family), but hotel has free transformation to center of Chawng once a day. But that is same time a good thing; hotel is peaceful.", "user": "rinsessa", "date": "January 9, 2009", "id": 23407073}, {"rating": 1.0, "title": "Horrible - Don't waste your money!", "text": "It is true, that prices are quite high in hotel´s restaurants, but you can eat somewhere else. Breakfast was exelent!", "user": "SwissTom", "date": "November 18, 2008", "id": 21982189}, {"rating": 5.0, "title": "Dream come true.", "text": "Based on the positive reviews and their brilliant website, we decided to stay at the New Star. However, the stay was a huge disappointment:", "user": "manchesterpogs", "date": "October 20, 2008", "id": 21022578}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed here for a week and honestly we didn't want to leave!! New Star is an excellent place to relax and discover the beauty of Koh Samui. The resort is simply wonderful ( spacious rooms, beautiful beach and swimming pool, excellent spa ) but what we'll never forget is the kindness of the \"always smiling\" staff, everybody was so nice but special compliments to the staff of the Pool Bar (Aew is the best!!) and to the staff of the Spa (try their treatments!!). We highly reccomend this place and we'll surely come back!!!", "title": "The Star of Samui", "helpfulness": 2, "user": "CarloMilano", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39486633}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We really enjoyed this hotel. Our room (Palm Room) was comfortable with a bright, airy contemporary feel. As mentioned, the private but \"outdoor\" showers are really nice. Staff was helpful and accomodating, and assisted us in renting a car for a day. We only had breakfast at the hotel, which was great with lots of variety.", "title": "Very Nice Property - But Don't Go Only for the Beach", "user": "jfh310", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31669552}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Apparently this hotel has one of the nicest beaches on the island. The plus side is, it was usually pretty quiet. It was a small, pretty beach but nothing spectacular - certainly not worth traveling all the way to Thailand for. I've seen much nicer beaches in the U.S. and of course, the Caribbean.", "title": "enjoyed ourselves", "user": "johannes k", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 27782131}], "location": {}, "stars": 4.5, "variance": {"poor": 11, "average": 21, "very good": 69, "terrible": 3, "excellent": 163}, "aka": "New Star Beach Hotel Chaweng", "slim_ranking": 0.112903225806, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}