{"user_rating": 4.0, "review_count": 947, "name": "New York Marriott Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "This is a perfectly adequate business travel hotel with an unbeatable location for visitors to the Financial District. Easily accessible via the West Side Highway, it sits within walking distance not only of Wall Street and the WTC site but of every Manhattan subway line as well. The former is, of course, important for meetings- I much prefer a hotel within walking distance when I'm doing business- while the latter is crucial for the evenings. If you want to go out at night, you'll almost certainly be leaving the area.", "title": "Location, location, location", "helpfulness": 2, "user": "DougCG", "date": "January 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 13150310}, {"rating": 4.0, "title": "Reasonable service, nice lobby", "text": "The hotel itself is not particularly remarkable but perfectly fine. Based on two recent visits, room quality can vary somewhat; on my first visit, I received an oddly-shaped low floor room with a view of a residentially building across the alley, while the second time I received a well-laid out, high-story room with a panoramic view of the WTC site. I understand the hotel is about to undergo renovations; hopefully that will lift this into the 5 of 5 category, but for now, its location coupled with comfortable enough, problem-free rooms makes it a solid 4 of 5.", "user": "shazam99", "date": "January 28, 2008", "id": 13079411}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "Unlike the previous poster, I didn't get chocolates or a view of the harbour...my view was of an apartment building. However, all in all, not a bad experience. Staff was helpful when I had a couple of questions on different occasions, but I wouldn't describe them as particularly friendly (with the possible exception of the doormen). Beds were okay and the bathroom was spacious. A few of the same experiences as previous poster -- no kidding, my room did not have a closet...as a guy travelling alone, this was no big deal -- but I thought was very strange. Whatever they have been doing with elevators, they are still doing it...was a pile of stuff at landing the the 6th floor, anyway.", "title": "A real 'pretty woman' hotel! Gorgeous!", "user": "QueenRabbit", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13044201, "likes": {"liked": "— The whole package - it was an amazing experience in itself", "disliked": "— fancy french food in Roy's restaurant - I came here to sample american delights, not european cuisine! But it was good food all the same."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This was the first of two hotels I stayed in whilst on my 30th birthday celebratory trip to New York. What an amazing feeling I got walking into the lobby of this hotel! From the bell staff to the receptionists, everyone greeted me with a big smile and such professional personal service - I was made to feel like the most important VIP in the world! An illusion of course, but what a wonderful fairytale! I don't know how they do it, but they make you feel like the only person in the hotel! Even when I called down for a wake up call, the lady on the other end said \"by the way - happy birthday!\" I spent the first three days of my holiday in New York in a daydream (then I moved to a hotel in midtown manhattan to be close to fifth avenue, I'd planned this in advance). The secret of this hotel is all in the attention to details... the box of chocolates handed to me as a gift to mark my 30th birthday upon check-in, the complimentary cheese and wine plateau delivered to my room on my last evening with a handwritten card thanking me for staying in the hotel, and wishing me a great rest of the holiday (I thought that was a very special touch, and added to the magic of that eveing!), the housekeeping manager - Larry, who came to check the work of the housekeeping staff when I had a (very small) problem with the bath one day - the response to my phone call was immediate, and he was a very warm, kind character and very proffesional, as were all the housekeeping staff - the room was not just beautifully clean, but they always had a smile for me in the mornings! This really adds the 'feel-good factor' to your day. And everytime I requested something, it was dealt with efficiently (and I am a very demanding guest!) And attention to detail in the rooms was amazing: the beautiful array of quality bath soaps and conditioners (bath and body works) and the gorgeously decorated bathroom, and of course the most gorgeous harbour view imaginable - statue of liberty, ellis island, brooklyn bridge, and if this wasn't enough, since I had been upgraded to a corner room I had a second window looking into downtown Manhattan (see photos - unfortunately, my mobile phone camera didn't do the views justice - the view from the harbour window was panoramic, and one photo couldn't convey anything close to the real beauty of these views). One word of warning though - the bed is sooooooo seriously comfortable, you won't want to leave it... and on the last day, I finally gave in, and I didn't - I stayed in it ALL DAY! Well, it was sunday, and this hotel is perfect for that lazy sunday feeling... And you can pamper yourself until the cows come home in this hotel too, no need to go anywhere else - there's a hotel massage service, a wonderful room service menu, in-room movies service (if the numerous channels aren't enough for you!), an evening turn down service (with two quality boxes of chocolates), a good size swimming pool and luxurious gym (with free ipod loan), free fruit and water all day, and plenty going on in the hotel - it has a magazine and goodies shop, starbucks, and two really friendly bar/restaurants to choose from (I tried out both and had two lovely nights out there, and as a single woman on my own I felt perfectly safe and welcome)... But to be honest, I spent most of my hours spent there lying in bed and watching the massive ships come in and out of harbour, and I nearly cried at the beauty of the most amazing sunsets over the harbour. A truly magical view. And to top it all off, you get the sense that the people that work here really care about their hotel as well. It feels like a grand boutique hotel, not a chain. The guys on the door have been working here for years and have great stories to tell. Dave is great - he's one of the security guards there, and a real New Yorker! He made me feel right at home! Each and every member of staff makes the effort to recognise you and give you a friendly greeting every day - as I say, you feel like a VIP of the hotel rather than just another guest. The breakfast is very good, though expensive, it is worth trying one day just for the hash browns and poached eggs (I'm missing them already!), though I have to say I didn't like the food in the restaurant 'Roys' in the evening very much - it's not bad, just a bit fancy-french style, fussy, and way over-hyped for the price. But the staff in the restaurant were so friendly and professional, I felt like I was paying for the service and ambiance as much as for the food, so I didn't resent paying so much. If you're looking for a special, romantic and memorable break in New York, this hotel is the perfect place! They really look after you - american style (it has to be seen to be believed - I've never experienced anything like it in Europe. Here you feel like a real client, that your custom is valued). It is great used as a base for visiting New York as well - there is not so much to do in the area, although there are beautiful harbour walks to be had, but soho's so close if you take a cab. The subway was too far away for me at night time - even though it felt like a safe place at night, I wouldn't have ventured off on my own anytime after 10pm, if it wasn't in a taxi. But this hotel is full of cinema-type New York fantasy and will bring something very special to any holiday. Yes, it's old, as some people have mentionned in their reviews, and is currently undergoing a make over, but the 'oldness' gave my room charm and history and was more 'antique' than 'worn', more 'elegant eldery gentleman' than 'tired old man', and certainly more 'nineteen fifties New York' than 'big modern and pretentiously flashy', and its age only adds to its grandeur, in my opinion. And I never had to wait for the lifts (and I was on the 34th floor!) All this, and I paid less than 200 usd per night (it's cheaper at weekends and at this time of year, and I booked early and got a pre-paid rate on the marriott website - but still, what a bargain)! I wanted to make my 30th birthday treat really special, and I certainly got what I came for! I have very fond memories of my stay in this hotel, and will treasure them fondly for many years to come. A truly magical experience in a wonderful hotel with staff that really care.", "title": "New Year in New York!", "helpfulness": 1, "user": "CatFarrell01", "date": "January 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12894867, "likes": {"liked": "— Location and service", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "This hotel was great for what we wanted it for - location. We didn't want to spend a fortune and just wanted a comfortable, clean base which would be situated in a good place so that we could explore New York. I have been to NYC before just before Christmas and I must say that on this occassion we came just before New Year and it was more enjoyable! The christmas shopping was not so hectic this time and although it was still busy the atmosphere was great. I would definitely suggest missing the christmas shopping and instead coming for the sales!! We did visit some of the tourists sites which were very busy but the hotel staff were great in recommending the best deals and the best ways to avoid the queues (special offers, different combo tickets etc). New Years Eve itself was amazing and there was nothing quite like being in Times Square when the ball drops!!! We got engaged which made it extra special but it was special enough just being there! The hotel was clean, service from the staff was good and we had no complaints. All in all a very pleasant & enjoyable stay.", "title": "It's alright", "helpfulness": 1, "user": "YellowOne", "date": "January 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 12712255, "likes": {"liked": "— Bed was comfy/ Bellstaff was amazing!", "disliked": "— Peeling wallpaper"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "All I can say is outstanding in EVERY way.", "title": "Perfect!", "user": "sugbug", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15154218, "likes": {"liked": "— Everthing", "disliked": "— Not one thing!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I am a, very, very fussy traveler but was incredibly impressed with The Marriot Downtown", "title": "Very Nice Marriott, Good Service, Location Just Okay", "user": "JAXTRVLR", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 2.0}, "id": 15050490, "likes": {"liked": "— Very Nice Room", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "They went out of their way to make our stay perfect. Absolutely fantastic customer service.", "title": "Fantastic!!!", "user": "Jaid96", "date": "April 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14974414, "likes": {"liked": "— Location, comfy beds and price", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I was very impressed by this Marriott. The rooms are newly renovated and the hotel is very nice. There's a Starbucks and Roy's in the lobby. The service was very accommodating and there's a nice workout facility (with an indoor pool). My only real complaint was the location. With all the construction at the WTC site, it was difficult to get around. If you have business in the financial district, this is a perfect location. If you're in NYC as a visitor to see the sites, it's a little cumbersome. All in all, I was very happy with the hotel -- it was probably the nicest Marriott that I've stayed at.", "title": "Nice Stay", "user": "Caitie02", "date": "April 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 14924323, "likes": {"liked": "— The Pool", "disliked": "— Couldn't get with a view of the statue"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "For my 30th birthday a few girlfriends and I went to New York City for an all girls weekend and stayed at the Marriott Downtown (formerly the called Marriott Financial Center).", "title": "Nice Hotel, Wonderful Staff", "user": "zuzuspetals_NY", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14505262, "likes": {"liked": "— Forgot to mention - Very big and clean pool and fitness center. A definite PLUS."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Stayed here with family for a week. Hotel is very clean and nice. Hotel staff was very hospitable and helpful. Would highly recommend.", "title": "Very nice hotel in financial district.", "user": "ROD25", "date": "December 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121401332}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "Stayed here for a business trip. It is right next to the temporary entrance to the 9/11 memorial. That is about the only thing it is close to (unless you want to be exclusively in the financial area). About a 30 minute cab or subway trip to Times Square. Can be hard to get cabs because it is not a popular tourist area. We found that if you go a few blocks behind the hotel it is easier to hail a cab.", "title": "Near 9/11 memorial", "user": "flroches", "date": "December 4, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 121379092}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Room was average. We were on the 7th floor with a view of West St. Not the best and noisy. Would request a higher floor if available. Faucet leaked a bit in the sink. TV had some quirks but we weren't in the room much.", "title": "Thanksgiving", "helpfulness": 1, "user": "mamaaa", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121363651}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "So, overall ok hotel for NYC prices, just be aware of the location.", "title": "Good location with statue of liberty glimpses", "helpfulness": 1, "user": "Seat62A", "date": "December 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121304791}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "We travel globally and we are native New Yorkers we were hesistant to stay here because it did not seem kid friendly--but we were wrong!! Upon checking the staff gave my child a stuffed anmal and cookies > The front desk, valet and bell man were all superior in service. We will recommend this property to everyone.", "title": "quite", "user": "Barbara G", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120999268}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I booked this hotel with my airmiles and it was certainly worth it. The hotel is positioned well for sightseeing Battery Park,( ferries to Statue of Liberty , Statern Island ) South Street Sea Port, Ground Zero etc but a way to go for Times Square and Central Park. All was very clean, the beds were heavenly and there was enough room for all 4 adults. We had an amazing view just missing the Statue of Liberty. The bar served very nice cocktails and you had a choice of a restaurant or Starbucks inside the hotel if you wanted breakfast there. Otherwise there were lots of cafes and bars around about. We used the swimming pool which was clean, warm and a reasonable size. What really made the hotel however was their service- everyone wanted to help and they were all very pleasant. They were having problems with the lifts when we left and the bottled water was expensive in the room which is why I have given this 4 and not 5.", "title": "NIce stay", "user": "sal.gram", "date": "August 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19010272, "likes": {"liked": "— Service was excellent", "disliked": "— Lifts were not workiing well when we left"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We have stayed in this property many times and on two occasions this summer. The location is downtown and the bike and walking paths with river views run for miles along the Hudson and begin in this area. It is a perfect spot to bond with the Statue of Liberty! We like the downtown area because it is quite and has a neighborhood feel. The hotel is close to Tribeca, the Meat Packing district and Soho. There is a large movie theatre just blocks away and many wonderful restaurants and the rest of NYC is only a cab ride or a subway ride away. The hotel has come a long way since it began it's renovation. The rooms are fully up to speed, but the elevators are a different story. They are being refurbished and in the mean time are extremely slow. The concierge was okay at best ( we live in Northern New Jersey and are in the city all the time, so for us it did not matter much). Hotel staff were just going through the motions and security did not seem to be around ( which on our last stay over a year ago very much was). The concierge lounge was very nice and breakfast was fine there. It was nice having a Starbucks inthe lobby. We would stay here again for the views and because we like the general area, but would like to see hotel management instill a \"can-do\" attitude with it's employees. We will wait until the elevator refurbishment is complete!", "title": "Great location for neighborhood vibe", "user": "travelingmom526", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18937658, "likes": {"liked": "— views", "disliked": "— elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We booked this hotel as a last-minute thing for one night (extended trip for one day, stayed at the Millenium Hilton the other two nights). We paid for $299+tax/fee from the hotel's website, for a King regular room. It was running a special that the room rate includes a $50 Exxon gas card (1 per stay) which was very nice. We enjoyed our stay very much and will definitely go back.", "title": "Fair price for a great Manhattan hotel!", "helpfulness": 2, "user": "LoveCity", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 18930576, "likes": {"liked": "— Price, room, service", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "> LOCATION – not that close to a lot of tourist spots, but is convenient for taxi and close to subways. Chinatown/SoHo are all within walk-able distance.", "title": "Great hotel, affordable luxury.", "user": "Shaggyrob", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 17868757, "likes": {"liked": "— Great facilities, helpful staff", "disliked": "— no minibar"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "> CHECK-IN – very smooth, polite and professional. We waited in line for ~3min and check-in took ~2min.", "title": "great", "user": "KC1512", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17853689, "likes": {"liked": "— It ws in the city and close to subway", "disliked": "— In"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here in mid-December, which is a busy time to come to NYC. I do enjoy the value of this Marriott compared with mid-town. The location is still convenient being right next to the 1 Metro Line and a 10 minute walk to the 2-3 Metro Lines. As a Platinum Member, we were placed in a standard room on one of the higher floors next to the corner junior suite. While this was good to eliminate elevator noise, it became terrible for next door neighbor noise. The corner suites have hard wood floors at the entrance and for whatever reason, out neighbors really enjoyed jumping up and down on the floors at all hours of the day and night. This interrupted our sleep both when we were trying to take a nap and when we were actually sleeping. Fortunately, after we complained to the front desk manager, she upgraded us to a top floor junior suite. We slept like babies for the rest of our stay and also found out about the hard wood floors in the suites.", "title": "From bad to wonderful all in a single stay", "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122710004}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were using Marriott points during the christmas holidays so we thought the free part of the deal would be the best thing: in fact, the overall experience was fine with a good-sized room with a view of the 9/11 memorial being built. Kind of eerie, but beautiful at the same time. The staff was friendly and accommodating and the sports bar was just right after traveling in. They even gave us free appetizers for using our points - nice extra.", "title": "Very good experience at downtown Marriott", "helpfulness": 1, "user": "Tess K", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 122605072}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "It's definitely about 20 plus minutes to get to anything in midtown or beyond, so prepare for a bit of a ride. One thing to keep in mind: the construction of the 9/11 memorial is ongoing - so that noise you hear at 6am on a Saturday is the contruction. But considering what they're working on, that's okay too.", "title": "Nice Hotel", "user": "peekaboo305", "date": "January 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122601093}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This was our second time staying at this hotel. It is a nice hotel (nothing fancy) for me, my husband and 10 year old. It is clean and quiet for the most part. Two issues: the elevators are ridiculously slow. We were on the 21st floor both times and you wait about 10 minutes for an elevator and then when it finally came, it was full. The other thing is that it is not necessarily close to any of the Christmas attractions. We are very adept at taking the subway, so it wasn't much of a problem, but you have to add about 20 minutes to every trip for transportation. Otherwise, nice place to stay.l", "title": "Not what I expected from Marriott", "user": "BootsPlus4NVa", "date": "January 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 122595324}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Just visited the NY Marriott Downtown with my daughters over the Christmas holiday. The hotel lobby was decorated nicely for the holidays. However, the cleanliness of the rooms and hotel hallways is in need of a little tender care. For example, I found several toenail clippings on the floor in my hotel room; totally YUCK! Obviously, the room was not vacuumed after the prior guest’s departure. In addition, the hotel shower looked like it was being overtaken by mold. Not sure if I would visit this Marriot property again despite its close proximity to Ground Zero.", "title": "Could have been better", "user": "Jean L", "date": "January 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122363689}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I just stayed 2 nights at the Marriott Downtown for our anniversary. The check-in was smooth and friendly. My wife's parents sent us a large vase of flowers that was waiting for us at the front desk. I'm sure if we ASKED, they would've brought it up to our room for us (our hands were full with luggage). But, they could've offered.", "title": "Mixed review", "helpfulness": 1, "user": "brifos", "date": "May 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 15630794, "likes": {"liked": "— The hotel was clean.", "disliked": "— The bed was uncomfortable."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The room was a decent size - everything was clean and looked like it had been updated recently (nice flat screen TV, good bed linens). But, I found the bed VERY uncomfortable. It didn't bother my wife as much as it did me, but we both agreed it was beat-up and lumpy.", "title": "Awesome", "user": "svleah06", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15614132}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Now, I don't hold this next complaint against the Marriott, but its worth mentioning. Our room was on the 15th (out of 35+) floor located on the West St/front side of the building, We had a late night Thursday, and come 6:30am Friday there was a cop blowing a whistle (directing traffic) right outside the hotel. That went on until 8:30-9am. From the 15th floor it was more annoying than loud. Paired with the bad mattress it was a bad night/morning for me.", "title": "A very good choice", "user": "HappyDeeSalemMA", "date": "April 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15346829, "likes": {"liked": "— friendliness of the staff, location"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We had the breakfast buffet at Roy's (hotel restuarant). They had a little of everything. Great selection of fresh fruit. I wouldn't say the food was exceptionally good, but it was ok. Expensive ($25) but ok. We also had a quick bite at the 85th St. Cafe (also in the hotel). The food was pretty good, but the acoustic duo playing that night was painfully loud...and bad.", "title": "Disgusting. Enema Package in Drawer! Never Staying Here Again", "helpfulness": 1, "user": "srod2", "date": "April 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 15231530}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The hotel is very close to the 1 subway line (about 3 small blocks). The R, W is one block further. And the 4, 5 isn't too far past that. The South St Seaport is about a 25 minute walk away.", "title": "Very Nice Hotel - Slightly Out of the Way", "user": "BrlDsguise", "date": "April 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15188517, "likes": {"liked": "— Nice Decor and Views", "disliked": "— Several Blocks from Closest Subway"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We all know that the location of this hotel meant it suffered in extremis on Sept 11 and the committment of the staff to keep the hotel operational in those dark days was deeply impressive.", "title": "Marriott \"Downtrodden\"", "user": "The_Deacons", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 17811198, "likes": {"liked": "— Staff", "disliked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "However, 7 years on, this Marriott is showing its age. The public areas are good with a cosy \"Cheers\" style bar and a good restaurant. However, the rooms are simply no longer good enough and need total rennovation.", "title": "View of Lady Liberty on the 4th of July!", "helpfulness": 1, "user": "JudyOq", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 17749295, "likes": {"liked": "— location and friendly staff", "disliked": "— expensive parking, but then again, its NYC"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Given that it's not particulalry cheap, it will need to up its game substantially if it is to compete in the years ahead.", "title": "Easy location for all of Manhattan - Allowed 4 adults in room", "user": "ACMC75", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17560871, "likes": {"liked": "— Location and comfort", "disliked": "— Construction across the street"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008", "text": "Thankfully, there is a programme to renovate the rooms and you are strongly advised to check beforehand.", "title": "Bittersweet stay at NY Downtown Marriott", "user": "Sufi101", "date": "June 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 17108882, "likes": {"liked": "— pool and location", "disliked": "— customer service non-responsive to some concerns"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The proximity to the WTC site is also unfortunate due to the construction and can be upsetting. It's also a long way from the cut and thrust of the city (even the financial district is a brisk walk) and one is heavily dependent on the west side highway. That said, we stayed there to demonstrate our committment to help regenerate that part of Manhattan.", "title": "Wonderful Birthday Celebration!", "helpfulness": 1, "user": "massrainy", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16974024, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I needed to go to NYC for business on a Friday and wanted to extend my trip through the weekend. Unfortunately, the second weekend in December in NYC is not only a high holiday shopping/sightseeing/theatre time, it was also the weekend of SantaCon! For those unfamiliar with this newish tradition, thousands people dressed as Santas, Santa's helpers and elves swarm through the city on a bar-crawl, starting early Saturday morning (we saw a group chugging beers outside our hotel at 9:30am!) through the wee hours of Sunday morning. So the pressure on hotel rooms forced me to stay MUCH further downtown than I wanted. I also needed 2 double beds, to accomodate a friend joining me on Sat/Sun, which eliminated many boutique hotel choices.", "title": "Not the most convenient or appealing!", "user": "pete827", "date": "December 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 122257202}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "To make a long story short, this location, while good for visiting Ground Zero or taking a ferry for sightseeing, is very far from mid-town and uptown locations. This means waiting in line for a cab (time and expense are also a factor) or taking the subway. The proximity of two different subway lines is one of the few good things about the location.", "title": "Family friendly & Close to subway", "user": "Amy L", "date": "December 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121949392}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Because of the holiday crowd, the wait to ask questions at the front desk was long, the carpets very dirty and there was no luggage/handicapped ramp at the front entrance (access through a back street entrance was possible) The lobby itself was basically a passage-way and a small one at that. There was a Starbucks in the rear of the lobby, which had apparently been moved from a storefront area near the front door, which was unattractively vacant.", "title": "Standard Business Hotel", "helpfulness": 1, "user": "zeeshm", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121527214}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Located in a business district, there are few restaurant and shopping options open on nights/weekends. The hotel sports bar was loud and the menu limited and unappealing. Luckily, the W Hotel just behind the Marriott had much better late-night selection and a nice bar ambience.", "title": "Couldn't have been in a better place, with better value for money!", "user": "Ellie D", "date": "December 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121477049}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The rooms were fine and the beds were comfortable - so probably a B even B+ rating for that. But we were awakened both mornings by hallway noise from a family with children at about 7:30am. There seemed to be no sound-proofing around the door. You could hear every word.", "title": "Great Customer Service!", "helpfulness": 1, "user": "Alla S", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121474732}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Overall, I was impressed with this property. Bell man and front desk extremely helpful as far as activities to do in New York. Good location in the financial district. Only a block or so to the train that you can get anywhere on. My room had a great view, was on the end so had two full windows looking out with a slight view of the river. Great meeting rooms and wonderful food. Staff did everything they needed to make it a more pleasant stay, and the housekeeper was great!!", "title": "Enjoyed the stay", "helpfulness": 1, "user": "jp560", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14226036, "likes": {"liked": "— Location, cleanliness", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We arrived at the hotel about 7pm at night, the lobby was full, but check-in only took about 5 mins. Check-in staff were welcoming and friendly.", "title": "Good hotel close to all transport links!", "helpfulness": 1, "user": "darrylpmatthews", "date": "March 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14214519, "likes": {"liked": "— Rooms were a good size", "disliked": "— Seems to be full of groups of kids all the time, who don't respect anybody else in the hotel!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We then went to the lifts.....and waited 10mins for one of the 3 lifts that went to floors 17+ to appear. There were another 15+ people waiting for these lifts.", "title": "Poor", "user": "mesinspector", "date": "February 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 13583554, "likes": {"liked": "— Hotel breakfast buffet", "disliked": "— Customer Service, Or Lack There Of"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This occured throughtout the 4 night stay. The lifts are a joke!", "title": "Get a new staff!", "user": "DCchick05", "date": "February 13, 2008", "detail_rating": {"front_desk": 1.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 5.0}, "id": 13529891}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "(it must be noted that the whole hotel is being renovated - including the lifts, scheduled completion date \"Spring\").", "title": "Smelly rooms and poor costumer service", "helpfulness": 3, "user": "JORGE MIAMI", "date": "February 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 1.0}, "id": 13270819, "likes": {"liked": "— nothing", "disliked": "— rooms, cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed at the Marriott from June 5th to June 9th, we got a wknd special 289 per night excellent value. Paid for a city view room and requested a harbour view if available, We got room 3613 full hudson river room view of ellis island and new jersey beautiful night view, rooms were newly renovated and very clean, housekeeping was excellent, check in staff excellent, front door man was excellent. ok elevators sucked they only had 4 working and at peek times was a bit of a wait, some people may not like location but seriously the subway station was around the corner and off you went to anywhere and anytime. will definately stay again.", "title": "Great Hotel great location great view", "helpfulness": 1, "user": "skylady", "date": "June 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 16837054, "likes": {"liked": "— renovated rooms and price", "disliked": "— elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Stayed two nights on a weekend at a reasonable rate for NYC. The rooms have been recently updated and have nice furnishings. It was a good size and clean. Our corner room had a great view of the Statue of Liberty and the Hudson River. The hotel is about 2 1/2 blocks from a subway to midtown. The staff was friendly and very helpful. Only two of the elevators were operating, so you had to wait a few minutes. However, that was the only negative regarding the hotel.", "title": "Fabulous view", "user": "cdeast", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 16037102, "likes": {"liked": "— The great view.", "disliked": "— Elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We arrived at around noon and were greeted by Anna the front desk manager. She checked us in right away despite being so early (their check in time is 4 pm). She gave us a room with a view of the harbour and the Statue of Liberty. I know this is a room they can charge extra for, but she gave it to us anyway.", "title": "Excellent Service and Rooms", "user": "AmaroneMan", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16022320, "likes": {"liked": "— Service, room quality", "disliked": "— elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The room was great and the view tremendous. They even have a Starbucks! They are in the midst of an elevator upfit, so the elevators were slow.", "title": "Great visit!", "user": "CarolinaTiger", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15966265, "likes": {"liked": "— The staff and the rooms", "disliked": "— elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The hotel is located at the southern tip of Manhattan where three major subway lines converge (1/2/3, 4/5/6 & N/R/W). You therefore have have access to the east side, west side and central midtown within a short walk from the hotel.", "title": "Staff is top notch!!", "user": "Kazakie", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 15939154, "likes": {"liked": "— Great room & staff", "disliked": "— distance to subway"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed here as part of a package for international runners during the marathon. I believe they did a great job considering the flow of people constantly and our room was waiting for us. Take earplugs for the building noise, but considering it is from rebuilding the ground zero are, no human with a heart could complain at this. The only down point is that in my tired state on checking out i left my MP3 charging in the room. I called to see if it had been handed in but it was no where to be found. Yes I left it charging, so I cant complain but a part of me expected it to be handed in.", "title": "Take the lift to the 38th to see the views", "user": "Solekka", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 120877613}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Traveled back home to NYC for a business meeting held at the Marriot Downtown. Very clean room with extremely comfortable bed. heating/ac unit worked quietly and walls thick enough not to hear neighbors (room on 16th floor). Outside traffic noise was minimal. Located in the heart of the financial district, the Marriot is two blocks away from the WTC and Zucotti Park (Occupy Wall Street). Four block away from the ferry to Statue of LIberty and Ellis Island (both worth seeing). The closest subway (Rector Street) is three blocks away which allows for easy access to midtown shopping, theater district and 5th Ave. Marriots Front Desk is well staffed and very helpful. We ate an excellent breakfast at the hotel. There is plenty to do in the Financial District as it has become one of Manhattans hot spots and the Marriot Hotel is in the thick of it all. Transportation to LaGuardia Airport was easy. Took taxi going into the city and car service leaving. Approx 40$ each way.", "title": "Very Good Experience", "helpfulness": 1, "user": "nycnative1919", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120863905}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I have stayed at this Marriott three times before my most current visit. I was in town to run the NYC Marathon and this hotel is a short walk from the Staten Island Ferry. As a Marriott Elite gold card member, I was surprised that the only upgrade I received was \"free internet\" in my room. Really? I travel so much for business and I enjoy being part of a loyalty program because most times the perks are so good. It was after 4pm and my room still was not ready. I was told I would receive a call when it was - never happened. There are so many places to stay in Manhattan and while the location is great if you have things to do downtown or want to see the 9/11 Memorial, the service left a lot to be desired.", "title": "Questionable service", "helpfulness": 1, "user": "givthks", "date": "November 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120433411}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The good: We had a very nice time. It's a clean hotel in a good location, right near ground zero and battery park. The beds are comfortable. The breakfast here is really good as well. This was a weekend family trip for my grandparents anniversary so we had 14 people-7 rooms. My parents have stayed here many other times without any problems.", "title": "Nice stay", "user": "MrsEggs2010", "date": "November 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120285534}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The bad: We booked the room block 4 months ahead and the hotel was not able to check everybody into their rooms when we got there. With a lot of bags and all of us wanting to explore the city, this was not good news. All of our luggage had to be put in the only 2 rooms that we were able to check into.", "title": "Two Stays, Both Excellent", "user": "VAPrgal", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120192372}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed for 2 nights over a weekend at the end of August.", "title": "Wonderful hotel, great views", "helpfulness": 3, "user": "fraire", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20172906, "likes": {"liked": "— Comfy room + great views", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The room rate was incredibly good, given the standard of this hotel: $219 a night for 2 adults plus 2 kids in a double queen room, pre-paid rate!", "title": "very nice place", "helpfulness": 1, "user": "coloradoferns", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 20141225, "likes": {"liked": "— Very near Subway stops"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I had requested a room on a higher floor, which , to my surprise and pleasure, we got.", "title": "More Than I Expected!", "user": "andiamo", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19930705}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "The room was amazingly clean and comfortable with ample space for the 4 of us.", "title": "Fantastic", "user": "Pabs1981", "date": "August 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19527915, "likes": {"liked": "— The extremely comfortable beds.", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Probably the best thing was the view - or should I say views- right over to the Statue of Liberty. Plus, from the second window, my architect husband was equally thrilled to be able to follow the buidling site under construction just opposite (without the noise, of course, great soundproofing).", "title": "Great place to stay.", "user": "DontMissTheBoat", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 19400815, "likes": {"liked": "— Location, view, friendly employees.", "disliked": "— A bit of a wait for the elevator."}}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 34, "average": 116, "very good": 396, "terrible": 15, "excellent": 386}, "aka": "New York Marriott Downtown Hotel New York City", "slim_ranking": 0.388261851016, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Ensconced in polished stone in a contemporary design, the lobby of our downtown Manhattan hotel is simply breathtaking."}