{"user_rating": 4.5, "review_count": 289, "name": "Newpark Resort & Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My wife and I were celebrating our first wedding anniversary and were traveling across the United States through Park City. We decided Park City was a quaint stop and it worked out being only 8.5 hours from Denver, CO. The morning of our departure, I took a look online for open hotels and saw the Newpark Resort. I was surprised to see the opening at this Resort as the pictures and area seem very high class and a little out of our price range as a young newly married couple. However, when I saw the price and also the willingness of the staff member on the phone to get us a great room for our stay I began to see that the Newpark Resort & Hotel was great place for us. Upon arrival, we were given a room on the top floor (fourth floor) and boy were we blown away! Spacious! Lots of amenities! Great View! Big Bath Tub! King Size Bed! Super Stylish! and I had a A Happy Wife! All for less than $200 a night! All I can say was the Newpark Resort and Hotel was a great place for my wife and I to spend our first wedding anniversary. The service was excellent, the proximity to shops and restaurants was great, and the quaintness of the city gave us a nice break from the road, reminding of us of what this day was about: our commitment to each other. We would recommend this to any couple, especially, those who just married, or newly married traveling to or through Park City, UT. Thank you!", "title": "Great First Wedding Anniversary at Newpark Resort & Hotel", "user": "Logan D", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162783178}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Newpark is the perfect place for a getaway or ski trip. It is part of a newer development designed with a cozy village style atmosphere. There are restaurants and shops within walking distance. It is not right in Park City but close enough and very easy to get to. Be sure and book more than one night because you will want to stay and enjoy the ambiance. Be sure to get a room with a private hot tub. The furnishings are top notch and you even have a kitchenette with everything you would need to prepare your own food.", "title": "A GREAT PLACE TO STAY WHEN VISITING PARK CITY", "helpfulness": 1, "user": "Jeremy S", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161916281}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Last minute trip to Park City for Sundance 2013. Most better hotels were booked, and middle range hotels with availability were at exorbitant prices, which was to be expected. When I first saw a listing for this hotel, it struck me as attractive by reason of it looking relatively new from the pictures, but I was concerned that it was rather remote from most of the festival venues (the hotel is just off the interstate). Pricing was unexpectedly reasonable, so we booked. The property was in fact relatively new, and it was nice to stay in a ski town hotel that was not over used and abused. The pictures do the hotel justice. Yes, you are surrounded by shopping malls, but there is excellent proximity (walking distance) to decent restaurants in the little mall adjacent to the hotel and in the shopping center across the street, as well as a Whole Foods and conventional grocery right there. The festival shuttle ran to the hotel, but it needed to run an hour or so later in the evenings to make it back from evening shows. The town bus filled the gap. While the ride was long, the buses came right up to the hotel. Plenty of free parking at the hotel, but we did not have reason to use the car but once when we had to line up for an early morning show. We did not have time to check out hotel amenities such as the pool, as we were always on the go. Pleasant lobby. Staff was friendly. No real service to speak of. The room we had was a standard hotel room-sized lock-out with a comfortable queen bed and pull-out couch. With the couch pulled out, there was nowhere to sit or go but to lay in bed, which suited us as we did not spend much time in the room. The room was very clean; housekeeping kept it orderly. Ski-lodge furniture was in good shape. Bathroom large. Good shower. Plenty of towels and decent toiletries. Coffee bar and min-fridge, but coffee-maker was not working. Room was quiet, even though we were near the elevator. In years past when skiing, we would pick a hotel in town and drive or take buses to whichever of the three resorts we would want to ski that day; although furthest away from Deer Valley, Newpark would make an excellent base for that. All in all, a pleasant stay at unexpectedly good value during festival time.", "title": "A Newer Property: Clean, Comfortable and Reasonably Priced", "user": "6101FCD", "date": "May 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 161753234}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Awesome place to stay!!! Front desk are very helpful. Our room is very nice and cozy. Very close to the skiing resort and restaurants are just walking distance. I definitely come back. Highly recommended.", "title": "Good experience", "user": "mia s", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161544346}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Came up here after a meeting in Provo. After a beautiful ride through Provo Canyon we arrived at the hotel. Easy to find and, for us, in a great location. Loved the fact that we could walk to restaurants, Full House Asian Bistro...awesome, and shopping, including a great TJ Maxx. Since our two bedroom suite came with a full kitchen, stocked up on breakfast items at the Whole Foods. There is a Kneaders Bakery that provides room service, as well.", "title": "Great stay", "user": "joanf", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161073832}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had a wonderful, relaxing stay at the Newpark. We were there for 5 nights and enjoyed the pool, the many dining options downstairs and our extremely clean and quiet room! Can't recommend this hotel highly enough! It was a great experience!", "title": "Wonderful stay at this wonderful hotel!", "user": "3sweetpeasmom", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166688873}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Stayed in Park City for a one-night stopover on our road trip and very happy with the Newpark. Our room was small but it had a cool factor -- lodge feel, nice linens, nice leather couch, great shower. A few minutes drive from the main street in Park City, but perfect to come back for a swim, hot tub and cozy room. Glad we didn't pay more (double) for an upscale hotel or lodge.", "title": "Great little hotel at a reasonable price", "user": "rachel6086", "date": "July 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 166225592}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I booked this room for an overnight stay in Park City after my husband ran in the Ragnar. I primarily booked this room because it had a private hot tub on the deck that I thought my husband would appreciate after 2 long days of running, but this room turned out to be SO MUCH MORE! Very roomy for our family of 6 with a King bed, a Queen bed and two sleeper sofas. Large Tv's with cable television was an extra bonus! The kitchen (although without a stove) had a full size fridge and everything else you would need including dishes, toaster, blender, pans, etc. The indoor/outdoor pool was fabulous with a wading pool at one end that was awesome for my 4-year-old who has physical disabilities. We can't usually get him in a pool, but the fact that he could stand up and play by himself made him want to get in! There are also dry & wet saunas and an exercise room. This hotel, although not right in the heart of Park City, is close to everything. Tons of shopping in the area and a variety of places to eat right below the hotel. I would most definitely return to this place when visiting Park City.", "title": "Perfect overnight stay with amazing views!", "user": "cd5150", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166056871}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I selected this primarily because it was close to a festival I was visiting in Park City. Newpark Resort is a great location, close to highway and Utah Olympic Park, only 5 miles from the center of Park City. I stayed for 4 nights and loved the room - spacious, very, very clean with great amenities in the room. The bathroom was amazing, the bed was very comfortable and the kitchen area was well appointed. I was on the fourth floor and had a hot tub on my balcony which I enjoyed. Adjacent to a shopping center, plenty of restaurants and movie theatre if you wish, but also just a quick drive from the main part of Park City for entertainment as well.", "title": "Lovely resort, fabulous room!", "user": "dav55", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165459133}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Only detractions - some of the front desk staff were fairly unfriendly; some of the traffic noise and trucks/trash pick up at 4:30 am (hearing the beep beep beep from backing up) was annoying. But I would DEFINITELY stay there again.", "title": "Everything you want in a hotel/resort", "helpfulness": 1, "user": "learn16", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165119317}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had a wonderful two night stay here. The room was very spacious and clean. TK was at the desk when we came in looking for a place to stay and he was very helpful. The location was perfect and beautiful with quick access to many amenities. The balcony faced the parking lot but you could see the mountains so the view wasn't perfect but was still very nice. The room was big enough to accommodate families.", "title": "Great get away", "user": "Missy B", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165094434}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stay at the Newpark Resort each year during Father's Day weekend for a large lacrosse tournament in Park City. Each and every year we arrive with many other out of state travellers to this resort and find the check in to be fast, the service is friendly and the rooms are always ready! This year we even noticed that our lacrosse club was welcomed with signage in the elevators which made our players feel pretty special.", "title": "Lacrosse Tournament", "user": "boisestategirl", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164630826}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Thank you to the staff of Newpark for making our trip so relaxing each year. You accomodate many, many people due to the amount of sports tournaments in your town and you have nailed it!", "title": "Newpark Great, but Front Desk Staff Needs Some Coaching", "user": "flipperUsa", "date": "June 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164002638}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I have stayed several times at the Newpark Hotel for business and love its location. The sales folks were very helpful with getting my room situated. Rooms and the entire place are very clean and well kept. Internet access is included and fast, unlike a lot of other hotels. With a pool, sauna, steam room, private hot tubs and fireplaces, the amenities are wonderful. My only complaint is the front desk staff. Staff at the front desk simply are not that friendly. Each time I've stayed there (3 times now) I have been surprised at just how unwelcoming the first face of the hotel is. This needs to be addressed, especially in a town where everyone is so friendly, it just seems so unfortunate and out of place.", "title": "Newpark is our newplace to stay in Park City", "user": "Modeerf", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163517769}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "It was a chance reservation for a quick weekend away and it turned into our new favorite place to stay in Park City. No its not in the middle of the hussle of park city, its not part of the big resort complexes. Instead its right off the freeway, convenient to some fun activities and great attractions and close enough to everything you want to do in Park City that you never notice you aren't in the middle of it all..", "title": "very nice, quiet condo hotel", "user": "David D", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163134959}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Comfortable room. Very relaxing. Even stayed an extra night! Definitely going back! Great staff. Not our first time to stay. Restaurants within walking distance. Great weather, too. Neat to visit the old town Park City, but too crowded to enjoy. Newpark is far enough away from the crowds to enjoy.", "title": "Loved it!", "user": "brmidd", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161007542}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here for the first night of our honeymoon. We were quite happy with the resort. The room was pretty big, and the hot tub on the deck was nice. The only complaints I'd have are pretty minor - the hot tub was a bit too hot for our likes. I realize most resorts of this type don't offer breakfast, but it would have been very nice to have some sort of continental breakfast or something available at the resort itself. Overall though it was a great place to stay, good sized rooms for the money, private hot tub, and fireplace were nice features.", "title": "Honeymoon stay", "user": "TripReviewer333", "date": "May 15, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "value": 5.0}, "id": 160800479}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I've just spent 3 wonderful days in Park City for Mother's Day weekend. Our rooms were absolutely beautiful. They were very clean. We had a hot tub on our balcony which is above the restaurants. We could only hear people when we walked out to the balcony. It is far enough from the freeway that you can't hear it but it only takes about 3 minutes to get there. Several shops and restaurants within walking distance. Plenty of paths close to run, walk, bike.", "title": "Loved it!", "user": "brmidd", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160691857}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The staff was very professional, kind and helpful.", "title": "Newpark Hotel", "user": "Tim H", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160364407}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I didn't review a breakfast because I don't think there is one available to guests but Kneaders is in the same building.", "title": "Lodgetastic", "user": "Steven S", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160322140}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 10, "average": 19, "very good": 65, "terrible": 3, "excellent": 192}, "aka": "Newpark Hotel", "slim_ranking": 0.16393442623, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}