{"user_rating": 3.5, "review_count": 345, "name": "Ngorongoro Wildlife Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Arrived at this lodge about 1900 after a full day in the crater, too late to see the view. Reception was a crowded and a little chaotic so took a while to get room keys. Arrived in room which was a little on the small and crowded side, the room was a little run down and the shower did not work well. Beds were hard and not very comfortable and the room was totally dark in the night with no electricity which was dangerous. The restaurant was buffet style and noisy, food was OK but not a huge choice for the evening meal or breakfast. Unfortunatly the weather was cloudy in the morning and drizzly, we left at 0800 so didnt see the view of the crater. Had I seen the grounds and the views I may have had a more favourable impression, without that I would rate the lodge as average which may be unfair.", "title": "OK lodge, but rooms not good", "user": "Maddog186460", "date": "October 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 143721547}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Being one of the oldest hotels in Ngorongoro and Serengeti, run by the State, then privatized, all three Wildlife Lodges - Seronera, Lobo and Ngorongoro - have the same feeling of the architecture. Maybe Lobo and Seronera are nicer because these are nicely composed in the kopje hills, with huge boulders incorporated into the structure, but Ngorongoro compensated the lack of boulders with a stunning view from the terrace and some of the rooms.", "title": "Prime location to view the Crater", "user": "WojciechAK", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143656252}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When I visited there with my Dad and a friend, they were surprised to see fog and water dripping trees in the morning, with temps 6-8 Centigrades! They were freezing! No wonder with this altitude of 2100 meters asl. Then going down to Nabii Hill Gate on our way to Serengeti and Kiabakari, Musoma - it was scorching heat for the change.", "title": "Tanzanian Safari", "user": "Graham B", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142970588}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The quality of rooms, establishment and service is not at the same level as other modern hotels. Surely, Wildlife Lodges under new management need serious investment to improve in all areas. But one thing these lodges have in their advantage - as they were government hotels before - they have prime location as their trump card.", "title": "View is uncomparable, but....", "user": "Maxsalut", "date": "October 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142448395}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This review covers our recent safari in Tanzania covering Ngorongoro Crater, Serengeti, Lake Manyara and Tarangire, all of which are the prime areas for spotting game. Whilst each area is good in its own way, the Serengeti, some 16000 sq kms. of plains and forests is a paradise for animals..... it is no wonder that these places are referred to as the Garden of Eden; it is no exaggeration.", "title": "A bit disappointed, but WOW, what a view", "helpfulness": 1, "user": "he_how_is_he", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142372749}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "no electriciy or hot water before this hour, and after long-showerless days in the serengeti all you want is a hot shower and to charge your phone.", "title": "Don't get to the hotel before 5 pm", "user": "InbalOrtal", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 141637912}, {"rating": 3.0, "title": "Unmatched Views", "text": "we stayed 2 nights, both arrivals were at 15:30-16:30, and we felt a bit annoyed.", "helpfulness": 1, "user": "Tanushree D", "date": "September 29, 2012", "id": 141578900}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The view is amazing, i can recommend not to stay in a room close to the entrance, we stayed at the very end of the corridor, room 65 if i remember correctly, and it was quiet and nice.", "title": "Good option for 1 night, but bring warm clothes.", "helpfulness": 1, "user": "Litzy", "date": "September 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 141349531}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The balcony is amazing, bring some long sleeves shirts, something warmer than usual, the high altitude make a big temp difference.", "title": "AMAZING VIEW", "user": "pcat4mjt", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141218628}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "nice fireplace, really good food. amazing comparing to other kinds of things we ate on our trip.", "title": "A little over the top, but what a view!", "helpfulness": 2, "user": "alisa t", "date": "September 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139788808}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This lodge was tops. Rooms were nice. Food was very good...alot of choices on the buffet. The employees were more than helpful. The outside deck overlooking the crater was awesome. I highly recommend this lodge !! Did not use room service or pool.", "title": "Absolutely beautiful-better than expected", "helpfulness": 2, "user": "shell43", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148973615}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The lodge is in a fantastic location with stunning views. It is an impressive hotel. What is less impressive is the food. The restaurant has no ambience, and the food is not so good. There also seems to be a problem with the plumbing. All night long the pipes in the wall of our room were clanging, and the doors are thin so any noise in the hall carries. This could be a four or even five star place with better management. And why can't you put drinks on your room tab?", "title": "Great location, not so good food", "user": "BN_CH_US", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 148770973}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed at the Wildlife Lodge in August 2012 - it was our first night of a 9 day safari with EastCo (fantastic company!). The lodge is sat right on the crater rim, with the benefit of spectacular views across the crater - particularly at dawn.", "title": "Fantastic view", "user": "Will_W82", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148485132}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms are well furnished and with hot water and mains electricity (except through the night). The food was served buffet-style in the restaurant and had a wide range so there should be something for everyone.", "title": "Not good", "user": "looseendsmakeknots", "date": "December 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 147976985}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The downsides are that it is very busy (but it was peak season) and also noisy. We had a room on the ground floor, and whenever someone flushed a toilet the pressure-hammer in the pipes sounded like a gunshot!", "title": "What a view!!", "helpfulness": 1, "user": "jakaz", "date": "November 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145786111}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Kind on line with the other reviews, this lodge has a fantastic view of the Ngorongoro Crater. The rooms are confortable and the food without being excellent is fairly good. The electrrater.icity like most lodges on this area, is shut down at 12 PM until about 6 AM. Although they say that they have internet, this is not the case. I asked about it and they said that they did not know when they would have it working again. The staff are for the most part very friendly, but very slow with service. Overall, an average property with unmatched views of the c", "title": "It is Ok", "user": "Juan V", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145655472}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Generally I don't have complains about this lodge. The observing corridor is great and I took many nice photos there. Food is good and there were performance in the dinner time. The lodge was packed when I was there and the waiter were too busy to forget my drinks twice, anyway it's acceptable.", "title": "Good place to stay", "user": "Jiji Z", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 145359613}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "If I go back and stop by Ngorongoro, I will definitely stay there again.", "title": "Great Location Disappointed Rooms!!", "user": "Mohit S", "date": "November 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144319385}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed for a night during over group trip in Sep 2012....if we leave aside the location, there is not much to be boast of this property. Chaotic check in, far away n scary rooms, electricity problem, poor service. Restaurant was good especially their open area facing crater. Food was ok. Have not checked more lodges in the area but if given a better option, would definitely want to skip check-in. USP of the lodge is that it is strategically located on the rim of the crater which allows you to have a great view of the landscape. SKIP if u have a better OPTION!!", "title": "Great Views", "user": "traveljonser", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144187779}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Overall, I was quite satisfied with this lodge. The service was very good. We stayed here one night after a safari drive in the crater and again on our final night in Tanzania. During our first stay, my friend left a shirt behind in the closet. When we returned, the staff went out of there way to locate the shirt for him (this was 3 days later). The food was good but not excellent. I felt the menu catered most to the tourists traditional diets when I found the more traditional Tanzanian cuisine to be better food overall. The rooms were clean and sufficient. The number one reason to stay at this lodge is hands down the AMAZING views into the crater.", "title": "Expensive but astonishing views", "user": "Jorge6880", "date": "October 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 143987602}], "location": {"country": "Tanzania", "region": "Arusha Region", "continent": "Africa"}, "stars": 2, "variance": {"poor": 32, "average": 94, "very good": 139, "terrible": 24, "excellent": 56}, "aka": "Ngorongoro Wildlife Hotel Ngorongoro Conservation Area", "slim_ranking": 1.0, "description": "Ngorongoro Wildlife Lodge is dramatically perched on the rim of Africa’s Eden, affording unbelievable views plunging down over the crater floor, 7,500 feet above the sea level. The Lodge is elegantly built mainly from natural stone and local wood and timber, harmoniously merging with its natural surroundings, and it is provided with panoramic windows that encompass superb views of the crater’s great bowl."}