{"user_rating": 4.0, "review_count": 978, "name": "NH Barcelona Centro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "I can't remember the TA rating # of this hotel now but in my estimation should be in the top 10 places to stay in Barcelona. Great location, friendly staff, clean comfortable rooms and competitive price justify this recommendation. I hope to return to Barcelona one day soon as we spent just 2 nights there and will definitely stay at the NH.", "title": "Vastly exceeded expectations", "helpfulness": 1, "user": "WorldTraveler1945", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16143525}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Spent 3 nights at the NH Duc in Barcelona before leaving on a cruise, and would recommend it to anyone!", "title": "Great hotel!", "helpfulness": 1, "user": "Allison85", "date": "May 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16097099, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The location was right around the corner from Las Ramblas, close to the main areas and touristy spots. We were a little wary of staying so close to Las Ramblas because there were quite a few comments on tripadvisor about the noise when you book a hotel in this area, however the NH Duc is about 1-2 blocks off of the main street, and we were never bothered from the noise at all.", "title": "Agree, it has a good location", "user": "lmn2", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15459286, "likes": {"liked": "— location", "disliked": "— limited services, room size"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The room was very clean, and spacious. We had a superior room with a king sized bed, and found the room and the washroom to be a nice size, and recently renovated. While it wasnt a bargain to stay here, at approx $250 US per night, it was definitely a nice place.", "title": "Great choice and location...", "helpfulness": 2, "user": "NIStrach", "date": "April 24, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 15329020, "likes": {"liked": "— location", "disliked": "— The size of the twin room we were offered"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "If you are looking to see a lot of sites within a couple of days, I would definitely recommend purchasing the 'hop on hop off' double decker bus tickets, we were able to see so much of Barcelona in a short time, and it was very easy and stree free. Narrated explanations of all the sites in a variety of languages make it very tourist-friendly. The main pick-up/drop-off area for these buses were only a couple blocks away.", "title": "Great location at a affordable price", "helpfulness": 1, "user": "joanacm", "date": "April 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15254407, "likes": {"liked": "— location", "disliked": "— The views"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stepped it up and booked a superior room. Well worth it! Dark hardwood floors, corner unit, huge comfortable bed. Our bathroom was huge for a hotel bathroom, with very modern touches. Spacious room with coffee, tea, and a tv. Nice balcony as well.", "title": "Amazing!!!", "helpfulness": 1, "user": "DBL_M_CANADA", "date": "August 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19237099, "likes": {"liked": "— Modern Style", "disliked": "— Only stayed for 4 nights!!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The staff was terrific. They spoke english well and were very helpful...Ordering a taxi directly to the hotel lobby. YES CARS ARE ALLOWED!!", "title": "Perfect location", "helpfulness": 1, "user": "Midlifecouple", "date": "August 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19035884, "likes": {"liked": "— combination of location and nice hotel room", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The location is amazing! Close to La Ramblas, which is a very neat and safe spot. About a 15 mins walk to the beach.", "title": "Exceeded expections- brilliant", "helpfulness": 1, "user": "EssexNatalie", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18674951, "likes": {"liked": "— the rooms and central location", "disliked": "— no bar"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "This was one of the best spots during our stay in Europe!", "title": "Great Location", "helpfulness": 1, "user": "jenny8", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18393539, "likes": {"liked": "— Location of the hotel and breakfast was great!", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Stayed here for 4 nights beginning August. Hotel is on a pedestrian street and conveniently located : close to Ramblas - Placa Catalunya - Barri Gotic - Passeig de Gracia - all withing walking distance. Nice hotel room, though bathroom was relatively small. Friendly & helpful staff. Good price/quality. Excellent breakfast.", "title": "Nice Hotel", "helpfulness": 1, "user": "bax52", "date": "July 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 18305247, "likes": {"liked": "— Breakfast", "disliked": "— Paying for Internet"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "After reading other reviews gave this a go on Sunday 1st May. Flew into Girona and this place is just comfortable 15 min walk from the Estacio De Nord bus station on arrival. Tried to get the 5th floor but was offered a 3rd floor room with two balconies..v.nice! Lovely clean modern airy room in which it's easy to feel at home straight away. Large bathroom with must-keep-these toiletries! It was twin beds pushed together for a double..but we didn't mind. Some street noise on a Sunday (when the bin men come round) but a minor quibble. Reminded me of Apex Hotel in Edinburgh (also rated).", "title": "Perfect Old Town Location..", "helpfulness": 4, "user": "plane2train", "date": "May 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3476744}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The bagel shop (mentioned elsewhere) is essential..1 min walk away. Turn right out of hotel and right again. Yellow frontage. Great for breakfast. Was dispappointed with Cafe Zurich (cheap watery wine) but there's a tapas bar near the cathedral I'd highly recommend on way back to hotel. It was called Bilbao something (sorry). Atmosphere was buzzing and they serve large Torres 10 brandies at 4 euro each..You can buy tapas by the cocktail stick..and wished we'd eaten there. Sunday not a good night for eating out..others may disagree! Had bad paella in a restaurant the other side of the cathedral square in orange-themed place..not recommended!", "title": "Thankyou TripAdvisor Members", "helpfulness": 6, "user": "crouchhill", "date": "May 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3471601}, {"rating": 5.0, "title": "great silence", "text": "My cousin and I stayed at this hotel in June for several nights. It was clean, comfortable and QUIET. The breakfasts were wonderful: fruit, eggs, meat, cereal, etc and champagne! It is not a place where people fawn over you (which is good in my opinion) and it has a little lobby BUT it is in the gothic quarter and close to las ramblas and away from the noise. Amazingly quiet. Recommend without reservation!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 4, 2006", "id": 5425001}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Much as others have said, this is a nice dependable hotel in a great location. The rooms are relatively large, very clean, well air conditioned (we actually needed blankets at night), and with very comfortable beds. As two females staying here we were quite happy with the location- just a minute or two walk from La Rambla so no winding down dark side streets, but very quiet at night. The front desk staff spoke wonderful English (not necessary, but helpful!) and were very friendly. It's also easily accesible to several Metro stops, including the Placa de Catalunya with several different lines. For walking it was easy to walk to both the ocean and to several of the Gaudi houses. Overall very pleased!", "title": "nice and great location!", "helpfulness": 5, "user": "chicagoot", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5424808}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "This is a good three/four star hotel in a great location. It is clean and functional. It is rather modern. The location is excellent -- being close to old Barcelona area.", "title": "Dependable hotel", "helpfulness": 2, "user": "Mash1224", "date": "June 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5379348}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "There are other hotels in the area that offer comparable value.", "title": "Really Like This Hotel", "helpfulness": 9, "user": "tmccaleb", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5332495}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We really do like this hotel. We stayed here for 3 days in May 2005, for 3 days again in May 2006, and for 3 days in June 2006. We wouldn't keep coming back if we didn't love Barcelona and this hotel. The exterior of the building is old, but the interior is all new. We have had 3 different rooms: two were small by American standards but average or better by European standards, each with a queen-sized bed. The third room was large by European standards with 2 twin beds. In each case, the bathrooms were larger than average, and adequate for 2 people to operate in at the same time. The rooms are very nicely appointed: all tile in baths, wood floors and furniture in bedrooms. Beds are very comfortable; I like a very firm bed, my wife likes a soft bed, we sleep on the same bed in this hotel and neither of us complains. The location is exceptional: in the Barri Gotic, 3 blocks to Placa Catalunya, 2 blocks to the Ramblas, on a narrow quiet street. If you have wheeled luggage, you can easily walk from the Aerobus stop at Placa Catalunya to the hotel (5 minutes, maybe). We have only eaten breakfast there once; the buffet was large with lots of variety and very tasty, although perhaps a bit pricey (13 euros per person). We have paid varying rates for different days, but the rates run approximately 125-150 euros per night--not a bargain, but good value for the money. The front desk staff is helpful, housekeeping is excellent. When we return to Barcelona, this will be our first choice among hotels.", "title": "good location", "helpfulness": 8, "user": "jessica1", "date": "June 5, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 3.0}, "id": 5313089}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Efficent friendly staff, clean modern rooms, great location. A good hotel to explore Barcelona from.", "title": "Recomended", "helpfulness": 1, "user": "BobHadden", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20721732, "likes": {"liked": "— Clean & modern", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Over-rated or over-priced? It’s one or the other. NH is the Spanish equivalent to Hilton Hotels. They’re relatively modern in terms of amenities and pretty standard relative to each other. They generally have a modern aesthetic, which helps them appear clean. We booked this hotel for the central location (which really is great) and presumptive 4-star quality. It was perfectly fine – no real frills – but the room was TINY and the price was not. When I saw the quoted price (over $500 USD / night) I told my travel companion that it needed to be among the 5 best hotels I’d ever stayed at to justify the price. Of course, it was not.", "title": "Over-rated", "helpfulness": 2, "user": "thehotelgirl", "date": "September 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 20128820}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We checked in late and were shown to a room that was so small there was nowhere to open luggage (we had ordered an extra bed). We tried to upgrade to a larger room, but were told we would have to do it in the morning when they had the staff to move the extra bed. We made the room work by rearranging most of the furniture, but it was certainly the most cramped room we stayed in while in Spain. Another bummer was that the bathroom did not have a vent. Overall, it was perfectly fine – just nowhere near worth the price. We would have been better off looking for simpler accommodations.", "title": "We were very happy here", "helpfulness": 1, "user": "felicia-toronto", "date": "September 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19954725, "likes": {"liked": "— The location was great.", "disliked": "— I have nothing to criticize."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This hotel had all the necessary qulifications for a very pleasant stay. It was in an amazing location, clean, quiet, well decorated, roomy, and had helpful and friendly staff. Need I say more?", "title": "Great Hotel with great location near La Ramblas", "helpfulness": 2, "user": "Anne Wright", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19909919, "likes": {"liked": "— The rooms were quiet at night so no trouble sleeping", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This hotel is excellent value for money. It is clean and modern and is situated very close to La Ramblas, so you are near everything but it is a quiet hotel so you do not have to be worried about noise at night. The breakfast buffet is superb. The staff are extremely helpful. I cannot fault this hotel at all and would stay there again if I was visiting Barcelona.", "title": "Location, location, location", "helpfulness": 3, "user": "undome", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 19572674, "likes": {"liked": "— Location, quietness, overall atmosphere", "disliked": "— Price of breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "As already flagged by others, the main plus is the excellent location: close to the Ramblas but far from the noise. Rooms ok and nice bathroom but mine was a bit dark. Smart and relatively new furnishings.", "title": "Good 3* hotel - nothing more", "helpfulness": 6, "user": "Gastronauta", "date": "April 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5016144}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Breakfast room: I gave up as it was so crowded but seemed average. Non-existent common areas (cost of location I suppose) and front desk seemed pretty surly to me. Overall, OK hotel but nothing special. Worth it if under €150 only.", "title": "Great Location", "helpfulness": 12, "user": "etz5", "date": "April 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4997100}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "My wife and I stayed here during a recent swing through Barcelona. The location was great, as it was just off La Rambla, (about a block away), and within easy walking distance to all the sights, and the subway. It should be noted, that you'll want to stay OFF La Rambla, because it will be quieter.", "title": "Ok...........but overrated.", "helpfulness": 7, "user": "swissclive", "date": "April 11, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4964254}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "As far as the room goes, I'd say it was pretty average. Neat, clean, and with no real view.", "title": "Classy hotel in fantastic location!", "helpfulness": 9, "user": "lh6938", "date": "April 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4954395}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The service was okay. The front desk staff was kind, although they didn't speak English too well, and we didn't speak Spanish too well, so we had problems communicating with them.", "title": "Convenient, loved this hotel", "helpfulness": 3, "user": "conguero", "date": "March 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4726033}, {"rating": 4.0, "title": "Great for shopping, eating, and drinking!", "text": "After spending some European city breaks in some rather small, tatty rooms in the past, this was a refreshing change. The hotel is quite new and has been designed in a contemporary style. The room we stayed in had plenty of storage/hanging space, laminate flooring, a very comfortable bed (without chintzy bedspread), a desk (and a large TV that we didn't use), and a decent size bathroom with shower, bath, toilet, sink and bidet. They provide toothbrushes, combs, razors, shampoo, shower gel and soap from their own range of products which smell of grapefruit! The rooms were clean and tidy and were kept to that standard during our stay.", "helpfulness": 10, "user": "agentbeige", "date": "March 21, 2006", "id": 4722020}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We didn't have much contact with the staff as we didn't eat here at all, but most of them seemed fairly friendly. The woman that checked us in wasn't exactly all smiles, but she wasn't what I would describe as rude either.", "title": "Superb hotel, great location", "helpfulness": 13, "user": "jonathan020", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4628100}, {"rating": 5.0, "title": "Faultless", "text": "The hotel is, as other members have mentioned, in an excellent location for traversing the city, but it is also right next to some busy shopping streets, and is joined to other residential/business properties, so don't expect to be in a quiet area if you book this hotel. On the Friday night that we were here, I heard a party going on through the walls (but this city has a busy nightlife so you can't really come here and then complain about noise!). Apart from that, the location is perfect for shopping and eating. There are many restaurants, bars and shops that you will come across if you simply wander around the narrow streets near the hotel, or on La Rambla. However, as with many cities, the busy areas can also be the dirtier parts to the city. The streets in this area are a bit grubbier than the historic parts of the city, so don't be surprised if you see rubbish, dog poo or men weeing in allyways! If you want a more luxury area, you may want to try another part of the city.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4569546}, {"rating": 4.0, "title": "An excellent choice hotel", "text": "The Gaudi sights such as Park Guell, Casa Mila and the Sagrada Familia are not within walking distance, but we took a tube to Park Guell which was only a few stops away, and managed to see the other two sights on the way back in the same morning, so nothing is too far away. The tube service offers the equivalent of a London tube one-day travelcard for zone 1, which covers all major sites(and it's cheaper than London).", "helpfulness": 13, "user": "Danny Boy 123", "date": "February 28, 2006", "id": 4560684}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We enjoyed the area near the Picasso museum most of all. The area has cobbled streets and is very well kept. The food we ate in a cafe called 'Origen' served great local cuisine, but many other places looked equally nice. This area was also easy to get to from the hotel.", "title": "excellent value for money", "helpfulness": 13, "user": "Bristol_UKGuy", "date": "February 16, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 4.0, "value": 5.0}, "id": 4463655}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Minus side - No coffee/tea facilities in room, no bar, restaurant closed at weekends, building work going on outside, bell ringing going on from dawn, bathroom supplies not restocked each day when used, had to walk from lLa Ramblas with our luggage as vehicles cannot access tthe hotel.", "title": "Really disappointed", "helpfulness": 2, "user": "AnnaBelfast", "date": "July 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 18143148, "likes": {"liked": "— Cleanliness", "disliked": "— No coffee/tea making facilities in room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Plus side - Room was nice, breakfast was nice, staff were ok, La Ramblas within walking distance,", "title": "Fantastic location", "helpfulness": 1, "user": "suttysid", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17793075, "likes": {"liked": "— Location and quality"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Love coffee in my hotel room but we couldn't even buy from the hotel restaurant as it was closed! Took ages finding a shop which does takeaway coffee as they couldn't understand us.", "title": "Great location", "helpfulness": 1, "user": "Aussie013", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17039220, "likes": {"liked": "— Comfortable beds and coffee facilities in the room", "disliked": "— Breakfast too expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This hotel is in a great location, in a quiet street near la Rambla but when you come out of the hotel and turn the corner there are loads of great little shops and cafes and within 2 minutes you can get to the Cathedral or the shopping area or Gothic Quarter.", "title": "Great location, quiet, good value", "helpfulness": 1, "user": "Marlin1", "date": "May 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16522790, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The standard of the hotel was excellent too- very clean with comfortable beds and helpful staff. Only thing they do not do is include breakfast in the price, but it was cheaper to find a cafe and to be honest there were lots nearby anyway. I would definitely stay here again.", "title": "Near perfection.", "helpfulness": 2, "user": "Adventurebuzz", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16446290}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I agree with the previous comments is that this hotel is in an excellent location. Only 2 mins away from Las Ramblas and Place de Catelunya but without the noise and crowds. The room was clean but on the smallish side and the service was average.", "title": "Good location; average but clean rooms", "user": "jim6irl", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5531385, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "This was a fantastic hotel with an amazing location. Las Ramblas is literally a 2 minute walk. The parc de catalunya is again 2 minutes away where you will find loads of taxis (the taxis are very reasonable).", "title": "Great hotel But be wary of Spanish taxes", "helpfulness": 7, "user": "snoopy79", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5513753, "likes": {"liked": "— location", "disliked": "— nothing really - could do with a hotel bar!"}}, {"rating": 4.0, "title": "Great central hotel", "text": "The rooms are not a bad size, huge bed, desk, tv and a fridge (very handy! Even the mini bar prices were reasonable). The air conditioning was excellent and the bathroom was clean and the free products were excellent. Also, the hotel was either very quiet or the walls very thick - we were quite near the elevators and heard nothing!", "helpfulness": 5, "user": "NessW", "date": "July 25, 2006", "id": 5510052}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "The staff were very helpful and most of them spoke perfect English (the others were near perfect!). We didn't try out the restaurant but we did notice the room service was quite reasonably priced and served until midnight.", "title": "Perfectly located", "helpfulness": 2, "user": "kbriffa", "date": "July 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5505203, "likes": {"liked": "— The room", "disliked": "— The reception staff"}}, {"rating": 5.0, "title": "A Lovely Hotel", "text": "Just be wary of two things in Barcelona:", "helpfulness": 4, "user": "Mandy645", "date": "July 17, 2006", "id": 5476376}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 15, "average": 99, "very good": 476, "terrible": 9, "excellent": 379}, "aka": "Nh Duc De La Victoria Hotel", "slim_ranking": 0.200381679389, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Nh Barcelona Centro (formerly called NH Duc de la Victoria) is a 3 stars Hotel ideally located in the middle of Barcelona Gothic Quarter, the oldest and most historical area, right in the center of the city. The Hotel is sourrounded by a pedestrian area very close to the main shopping streets, Portal del Angel and Portaferrissa. This perfect location makes NH Barcelona Centro the ideal starting point to discover the charming of the art at the street while walking among the Ramblas, only some meters away from the hotel. Also not far from there we can find the majesty of the gothic Cathedral and other master pieces like La Pedrera or Casa Batlló from Gaudi. The rest of this fascinating city is easily reachable by public transportation: train, metro, touristic bus, air bus, all of them with station at Plaça Catalunya only a walk away from the hotel. NH Barcelona Centro welcomes all guests with a warm and cozy decoration that in union with the high quality service provided by the professional staff guarantees a perfect stay. All our 156 rooms benefit from natural daylight and soudproof windows and are fully equiped with all the commodities. The Hotel area is really quiet at night which guarantees a perfect rest, the traffic is restricted from 11 to 15 h and from 17 - 20:30 h. At the first floor we serve the Breakfast Buffet that is really appreciated by our clients, with a big variety of colorfull, fresh products and welcomming staff. The hotel also has two meeting rooms and offers all the tecnologic equipment you may need. For clients travelling by car we have arrenged some spaces in a nearby public parking (SABA Catedral)placed in the Cathedral's square at a very convenient rate."}