{"user_rating": 4.0, "review_count": 1130, "name": "NH City Centre Amsterdam", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "My heart sank as I walked up the filthy threadbare red carpet of the stairs to the main door of the NH Amsterdam City Centre, because I knew this would set the tone for my two night stay here. And it did.", "title": "The threadbare filthy red carpet sets the tone for this hotel", "helpfulness": 3, "user": "theinspectorcalls", "date": "July 19, 2011", "detail_rating": {"service": 1.0}, "id": 115534245}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The good - it’s a great location, in a reasonable area and within a few minutes walk of the Joordan area (very nice), the 9 streets (quaint), the Red Light area (overpriced), and of course loads of lovely canals and bridges.", "title": "Good location, high prices, standard service", "user": "NickSimper", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115521142}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Late check out which was agreed at checkin until 3pm without extra charge is excellent.", "title": "Very good hotel for family", "user": "krishadv", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115414802}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "They have a very convenient car park under the hotel but beware it’s small and can hold only a few cars and costs €40 per night.", "title": "good location, dirty hotel.", "helpfulness": 1, "user": "JudgeTravel", "date": "July 16, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 115408101}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Free WiFi in the lobby is good.", "title": "great location in downtown Amsterdam", "user": "Stoks", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114894604}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The staff at the reception definitively need some hospitality training. They are NOT guest oriented at all! We had a problem with a reservation, non off the staff could help or at least apologies for the inconvenience... never seen this badly before!", "title": "Absolutely no good service", "user": "Markv4", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 1.0}, "id": 114875462}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "The hotel is centrally located. It is within walking distance to all the major sights. The Spui tram station is right around the corner. The rooms are very small but was sufficient. The bathrooms were clean and hot water was plentiful. The wi-fi signal was very weak in the rooms so we had to go to the lobby to get a better signal. Definitely try the Indonesian restaurant Kantjil & de Tijger down the street. We went on our very last night and wished we had gone on all the previous nights.", "title": "Tiny room in a great location", "helpfulness": 1, "user": "Richard H", "date": "June 18, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 114124936}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "NH City Centre couldn't be in a more ideal location: just off the madness of the Dam Square, but close enough to walk to all the sights (and the lovelier, quieter Jordaan area).", "title": "Pro: Location, Con: pver-priced ammenities", "user": "whereshouldilive", "date": "June 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 113872185}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "For a business traveler: not bad because it is so central to all the areas and main train station. However, be aware that you must pay for wifi in your room. There is \"free\" wifi in the lobby - but only for 30 minutes (really, 20 minutes by the time you get connected -- very slow). Skip paying for breakfast - very generic, hotel food!! There's a lovely patisserie at the corner.", "title": "The staff neesd to take a course in \"service-minded\"", "helpfulness": 2, "user": "boborta", "date": "June 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 112021521}, {"rating": 4.0, "title": "Very pleasing!", "text": "For a tourist: a standard, chain hotel. Why not stay at another smaller 3-star? Sure smaller rooms, but you get the nice Euro experience and better breakfast and free, fast wifi!", "user": "Robin2008", "date": "June 6, 2011", "id": 111863771}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "RECOMMENDED. This is a fine choice despite my 3* ranking. I travel a great deal and faithfully write Tripadvisor reviews. The problems are all rather minor.", "title": "A few misses, but otherwise fine", "helpfulness": 1, "user": "roadwarrior30", "date": "February 21, 2008", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "business": 3.0, "rooms": 4.0}, "id": 13734551}, {"rating": 5.0, "title": "Great Hotel and Staff", "text": "This hotel is located on a relatively low quiet street with numerous restaurants & pubs. It's is 20 min walk from the main station and Trams 1, 2, & 5 stop less than 1 block away with little waiting. The hotel is in a semi-tourist area with a nice mix. You're an easy walk to anything.", "user": "AbbyTravelAgent", "date": "February 15, 2008", "id": 13579585, "likes": {"liked": "— Great staff and rooms were very nice", "disliked": "— We didnt stay longer"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Check-in was a tad slow. The property was well maintained. Likes most thirty Dutch, the use of low wattage lighting makes things rather dim. Rooms had wooden floors, which while nice, made the room a little cold. Bedding was excellent and bathroom very nicely done with plenty of hot water. Room to room noise was a problem, very thin walls and noise from the hallway also came into the room. Room size was quite large by normal Amsterdam standards.", "title": "lacked atmosphere", "helpfulness": 1, "user": "marieIreland", "date": "February 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13515988, "likes": {"liked": "— location and price with otel.com", "disliked": "— no atmosphere and bar and restaurant useless"}}, {"rating": 3.0, "title": "Good location; would recommend", "text": "This is a great choice, I'm giving 3*, 4* in terms of value for money.", "helpfulness": 1, "user": "Helpful_tipper", "date": "February 11, 2008", "id": 13448280}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "There are 2 NH Amsterdam hotels- one is CITY CENTER and we stayed at the one that is just NH Amsterdam Center next to the Marriot is the easiest way to explain it to cab drivers. It is within walking distance to a square with many restaurants and bars. We walked everywhere. Close to Red Light District. Canal cruises are 1 block away. The rooms at this hotel are newly decorated, very clean and accomodating. We upgraded to a deluxe room. All have stocked mini refridgerators at a cost, coffee and tea. Comfy beds and pillows. Breakfast is included with some room types and it is well worth it. Very nice. The lounge is modern and quaint. The staff is over the top! Great concierge to help you find the best restuarants. The people gernerally in AMS are very kind and polite. We found that everywhere. The bellman has a great sense of humor so did the bartender. It was wonderful. Wi Fi is available for a fee of between 17 and 22 EUR a day. The NH is 1/2 hour approx. from the airport , cab fare is about 40EUR. This hotel isnt huge which is nice but has ammenities of a large hotel. The staff were like friends at the end of our stay . Great for vacation and excellent for business and also business conferences.", "title": "Great Hotel", "helpfulness": 1, "user": "fatboy40", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13261263, "likes": {"liked": "— Cleanliness", "disliked": "— only one english speaking newspaper in foyer (no big deal)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Close to everything - and right by the canal. Rooms modern and clean", "title": "Great location - nice room", "user": "travelviking", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116484421}, {"rating": 5.0, "title": "Great Staff, Great Location, Great Value", "text": "The wife and I stayed here for a couple of days on a trip to Amsterdam to celebrate our wedding anniversary. I booked the hotel before reading the tripadvisor reviews and it was a good job I did because, had I read all the negative reviews, I probably wouldn't have booked and would therefore have missed out on a cracking hotel. I advised the hotel in advance that this was a special stay for us and they not only upgraded us to a bigger, canal side room, but we arrived back to the room on the second day to find a card wishing us a happy anniversary along with some sweets and a souvenir fridge magnet. The hotel is in a great location, very central and it seems only a 10 minute walk from wherever you want to be, the rooms and public areas of the hotel are clean, tidy and very well appointed, the staff are very friendly and helpful, i wouldn't think twice about booking this hotel again in the future.", "helpfulness": 1, "user": "richieedwards1", "date": "August 7, 2011", "id": 116388757}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I won this hotel for a fair price on Priceline, and overall I was satisfied. It is right off a tram stop, but removed from the Dam. Whenever I am in Amsterdam, I like to be closer to the nightlife and festive atmosphere closer to the Central Station. I did walk back here one night, and another took the tram to the hotel. They offer free internet, but you need to log on with vouchers that are only good for about 13 minutes. The room and hallways don't have the truly sparkling shine of some other hotels, but the front desk staff are very helpful. The air conditioning did not work and was very hard to figure out. Overall, if I won it again for a good price, I would be okay, but I rather try a hotel with a better location.", "title": "Nice enough, but location could be better", "helpfulness": 1, "user": "boddicker52", "date": "August 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 116319911}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Hotel was very easy to find from train station, it was about a 10 minute walk from train station and fairly easy to find. Location was great, very close to main square and fabulous restaurants and pubs on the street. There was 4 girls on our trip and we felt very safe in the hotel and the locality. Staff were lovely and were able to provide us with a room even though we arrived at 11:30 am and check in was not until 3pm. The rooms were clean and standard in size. I would highly recommend this hotel for people to stay in . Breakfast was not included in our very reasonable price but there were so many restaurants literally beside us that we did not go hungry.", "title": "GREAT LOCATION", "user": "eimear33", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116301841}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I agree with some other reviewers that the hotel does not look much from the outside, but in this case it does apply that the inside is what counts. Our room was a good size one, when compared to European hotel rooms. Large flat TV screen. Really comfortable beds where we could rest, and heavy drapes of the kind that tempt you to oversleep. But the BEST two things were: 1. PERFECT LOCATION - in a nice but not overcrowded area, next to cozy coffees and restaurants, and within easy walking distance from all the main attractions. 2. GREAT SERVICE from the staff. We had a problem with the room safe that wouldn't open one night before departing, and were very worried because our passports were inside. We called reception and within 10 minutes the hotel manager was in our room, in a very friendly mood although it was late at night; a master key, and opened it for us. We were really grateful, as we had witnessed a horror story of a friend that once had the same problem in other country (a so called good hotel chain as well), but it took them 3 days to get the safe open.", "title": "Perfect location. GREAT staff. I'd definitely be back.", "user": "Tahiri1321", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116100558}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We arrived very late at the hotel, part of a Trafalgar Tour so didn’t have time to take photos, sorry. The room was basic and we had twin beds (mother and daughter traveling together) which were really comfortable. The room had a safe, mini bar and flat screen tv but no airconditioning or alarm clock. The bathroom was reasonably sized with the shower over a very high bath. There were loads of restaurants around the hotel with a lovely café behind the hotel named Berts and many cafes on the same street as the hotel. Breakfast was wonderful with lots of cheeses and meats available. Sorry this review is short but we did only have a one night stay.", "title": "Nice Hotel", "user": "Toujo", "date": "May 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16270676, "likes": {"liked": "— Central location", "disliked": "— Basic room but we were on a Trafalgar Tour so were given whichever room we were allocated."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My boyfriend (aged 24) and me (aged 21), both from Scotland, are not long back from a city break together in Amsterdam (first timers). Had a great time staying at the NH Amsterdam City Centre. Rooms were spacious, especially for Amsterdam, and heating was excellent - it was absolutely freezing and snowed for 3 of the 5 days we were in the Dam. Hotel is situated very close to the city centre and transport links are excellent.", "title": "Smashing!!", "helpfulness": 1, "user": "lilprincesshez", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 15598313, "likes": {"liked": "— Central location", "disliked": "— expensive breakfasts, city tax"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "From Schipol airport, we got the train directly to Centraal Station (costs approx £4 each). Jumped on a tram at centraal station (i'm sure its 1, 2, and 5) and got of at the Spui, which is just round the corner from the hotel. We had priced the transfers through the hotel out of interest on our return and were quoted 20 euros, so go it alone! Its a good way to find your way about as well.", "title": "Hotel Review", "user": "DOHDublin", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14858378, "likes": {"liked": "— Location", "disliked": "— Internet Charges"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Our room looked out on a street - Spuistraat. From what i have gathered from others, it is easy enough to get the room switched for a canal view though if you want to. To be honest, we were not fussed. We spent most of our days and nights out and about, and we only really slept in the room. The rooms are spacious though, the bathroom was a good size (a shower big enough for two anyways) and the beds are really comfy.", "title": "Great Hotel", "user": "Doire", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14614238, "likes": {"liked": "— Location", "disliked": "— Price of breakfast!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We were up early twice during the stay, to go on trips, and had breakfast in the hotel. At 18 euros per person (buffet style), its a bit steep, but they had everything you could have possibly wanted from crepes, cereal, bacon, sausages, croissants, etc. The other mornings we headed down to the main centre and found something there, which was a lot better priced.", "title": "Great Hotel", "user": "Doire", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14559045, "likes": {"liked": "— Location", "disliked": "— Price of breakfast!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed just 3 days at this hotel and although the room was really small, it was nice and clean. I was not expecting such a small room but the view of the canal with all those beautiful houses was really nice. It was my first time in Amsterdam and one advantage is that the hotel is near square Dam where you can go to Madame Tussaud`s museum and there are lots of restaurants and even a big supermarket around. You can have your breakfast around the hotel without any difficulties (it will be cheaper). When I arrived there I didn´t see the canal like the picture where I booked the hotel (that´s because it´s not the main entrance of the hotel, so when you arrive you´ll see the canal at the back, don´t worry). The only inconvenience I found was that at night going out nearby was not so safe ( it was only an impression, nothing happened at all). This was just at night, during the day it was perfect. Another important thing is that the internet conexion (Wi-fi) is very slow . It will be better only if you use at the lobby (free), so don´t pay to use it in your room if you have a computer.", "title": "Beautiful view !", "user": "CMPP", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116011527}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I lived in Amsterdam and was actually back to visit friends. I was really unwell and unfortunately had to still make sure I met up with all my friends. I even had a friend coming in from Belgium for what I thought would be the day but she stayed overnight with her BF in a separate room--which is how I know I got lucky! My room was a corner room. I honestly would spend most of my day in the room. I was too sick to go out and my friends were working during the day and having lived there I had no need to go explore, I mainly had dinner dates with friends. My room was very large for Amsterdam and I worked in an industry that had used almost every hotel in Amsterdam for events and seen the insides of most hotels. NH City Centre was where I felt was best for me. As stated, the room was huge and nice and had a very comfortable bed, ample desk, closet space and a nice bathroom. I thought the staff were great too, very international and I speak a lot of languages so I would go from Italian to Spanish to Dutch etc and they liked me a lot--I think coming in and speaking to two of them in their native languages (one Dutch) and asking for a good room helped. Now to tell you why I know I got lucky my friend and her boyfriend came and they came together and after a day of walking through the city (he is from Belgium) we went back to their room--WOW WHAT A DIFFERENCE! They had a tiny white boxy room. My room looks just like the room in the photos but I learnt those are the corner rooms ONLY.", "title": "Practical-Great Location But I Got Lucky", "user": "Lex59", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115992823}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "They also have parking BUT charge a lot for it according to my friend. I showed them my room and they were shocked to see the difference.", "title": "A small space, but all amenities were in place", "user": "aliveandfreelondon", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 4.0}, "id": 115965609}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "As for dining-it is overpriced and small portions but decent in taste. Rooms Service, which I did need at the beginning when I was really not well, was ok but not great and it too was overpriced and came very basic-like if you order a salmon expect JUST the salmon not anything with it, you will have to request vegetables or something separately.", "title": "Quiet and convenient!", "user": "Mukhiyaistravelling", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 115917858}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The staff were really nice but I think that could be because I spoke to them in their languages respectively and they appreciated that-this is something the Dutch specifically love because they are very unaccustomed to having anyone speak Dutch and knowing I came with a non-Dutch passport but spoke Dutch impressed them a lot. BUT regardless they do go out of their way to help you.", "title": "Great stay", "user": "zijadana", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115567661}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Just back from a great four night stay in Amsterdam. Had a double room with breakfast from otel.com for £90 a night. Small room but clean and perfectly adequate.Rooms are allocated on arrival so make sure you ask for a room with a canal view. We had to forgo a no smoking room to get this but it was well worth it and the room was fine, not smoky at all and at no extra cost. Breakfast was good.", "title": "Good hotel for a short stay", "user": "KernowTraveller9", "date": "March 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14410822, "likes": {"liked": "— Positionand canal view", "disliked": "— Size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The great thing about this hotel is the position. You could walk to most places easily, or get the tram from the next street across. There were plenty of good bars and restaurants around but it was not noisy. Don't miss the little bar called Gollem in the alley just round the corner. Great atmosphere and an amazing selection of beers.", "title": "Unexpectedly great!", "helpfulness": 1, "user": "everfair", "date": "March 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14270151, "likes": {"liked": "— Clean comfortable room, convenient location, great breakfast buffet", "disliked": "— We were still charged for a local call"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "My fiance and I just returned from a 4 night visit to Amsterdam. We stayed at the NH City Centre, which was booked in conjunction with airfare in a package from covacations.com.", "title": "Lovely hotel, friendly staff - out the way abit", "user": "CaseyCoventry", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 14116636, "likes": {"liked": "— How modern and comfy it was", "disliked": "— The location"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We liked the location. A little alleyway over were the tram stops, which, once we figured out how to take them, was very convenient. From the tram stop, it's only about two or three stops away from Leidsplein, a fun area with more restaurants and shops. The hotel is very close to the Spui Square, which had a few bars, coffeeshops, and restaurants nearby. The street the hotel itself is on has great restaurants: of note, an Indonesian restaurant across the street called Kantjil (definitely try the Rijstaftel) and a Dutch restaurant directly across the way (can't remember the name) that had delicious traditional Dutch food. In terms of things to do, Dam Square is about a 5 minute walk, with several shopping streets close as well. Magna Plaza is a nice shopping center to check out. When we travel, we love to check out the supermarket, so stop by an Albert Heijns store!", "title": "a fine place for a short stay", "user": "BayWalkerScotland", "date": "March 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13953479, "likes": {"liked": "— Central location", "disliked": "— Lifts (elevators)"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The room itself was simply furnished with a modern color scheme. We had room 503 which was sort of awkwardly wedged in a corner, but the room itself was not cramped. There were tea making ammenities, a bottle each of still and sparkling water for purchase, along with a minifridge (no minibar in there for us though!). The bed was really comfortable. We never checked out their \"pillow menu\" but thought it interesting that it was an option.", "title": "Fabulous", "user": "JakeCon", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13941876, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "NH City Centre Amsterdam is a modern business style hotel.", "title": "Modern hotel, good location", "helpfulness": 2, "user": "Riesling", "date": "July 29, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 18390369, "likes": {"liked": "— Modern, clean, good location and decent value.", "disliked": "— Nothing - all expectations were met or exceeded"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "BOOKING AND CHECK IN", "title": "Not a great value--by a long shot", "user": "mklein818", "date": "July 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 18373620, "likes": {"liked": "— Canalside view was impressive", "disliked": "— Price, rip-off room upgrades, commercial aggressiveness of the property"}}, {"rating": 5.0, "title": "I'll Be Back!", "text": "Booking online was simple via the hotel's website and a confirmation email received. Check in was quick and polite (though it was late on a Thursday night). Reception staff spoke perfect English (as does everyone in Amsterdam). Don't be confused with NH Hotel Amsterdam Centre - a different hotel. The photos on the website are accurate.", "user": "Grisly", "date": "July 27, 2008", "id": 18323749}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "ROOM AND BATHROOM", "title": "Quaint Hotel", "user": "ManilaGlobetrotter30", "date": "June 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17118013, "likes": {"liked": "— location, location!", "disliked": "— small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We booked a superior room @ 140 euro per night room only. It was reasonably spacious - approx 20 feet x 15 feet. I requested a top floor room online as I thought there might be traffic noise and received one. No traffic noise and great view across rooftops and the canal. 3 large windows letting in plenty of light, but with thick curtains and blinds to block out early morning sun. Modern minimalist decor in whites/creams/browns, white duvet cover. Large bed, at least a queen size. Tea and coffee tray. Fake wood floors. TV which worked fine. Phone which we didn't use. We didn't attempt any wi-fi/internet. Room service available but we didn't use it. In room electronic safe which worked fine. Range of lighting including reading lights on each side of the bed. Daytime temperature was around 18-19 celsius during our trip and the room was comfortable - I didn't notice it being either too hot or cold and can't recall using the air-con controls as a result.", "title": "Fantastic location!", "user": "TomandRascal", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16360647, "likes": {"liked": "— location", "disliked": "— breakfast"}}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 3, "variance": {"poor": 81, "average": 244, "very good": 552, "terrible": 33, "excellent": 220}, "aka": "Nh Amsterdam City Centre Hotel", "slim_ranking": 0.420588235294, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Modern, Comfortable Hotel housed in five Art Deco-style buildings dating from 1920."}