{"user_rating": 4.0, "review_count": 242, "name": "NH Latino", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "Stayed four to five nights at the NH Latino, in between trips to other parts of Argentina and Uruguay.", "title": "Be careful with the location", "helpfulness": 7, "user": "alpha_anonymous", "date": "January 23, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4372324}, {"rating": 5.0, "title": "An Outstanding Hotel", "text": "Picked this hotel on the basis of the reviews, but decided to find a different hotel for the 8 last days of our stay in Buenos Aires. This was mainly due to the location, which is far too nosy and plagued by very heavy and polluting traffic. The hotel is very central for Microcentro, but be careful as this is definitely NOT the most charming area in BA. The hotel is located on the corner of a very busy intersection and all rooms face the street. The streets next to the hotel are mostly narrow and experience very heavy traffic with old buses and cars polluting profusely. We could not avoid coming back to the hotel room with a headache after walking through the hot and noisy, polluted streets and met many others who felt the same.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 21, 2006", "id": 4367493}, {"rating": 4.0, "title": "What a view!", "text": "Plusses are good sized rooms and the best buffet breakfast of our 3 week stay in the country. There are also 2 computers with free internet access in the lobby, although these are often very busy.", "helpfulness": 3, "user": "andrawatkins", "date": "December 6, 2005", "id": 4216883}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My Partner and I stayed at the NH Latino for a week in Buenos Aires. We were extremely pleased with the hotel, and we would highly recommend it to anyone. The central location of the NH Latino worked very well for us. It was in a business district called Microcentro, and it was a step away from the subway. People who are looking for a more residential, side- street feel may want to stay at the NH Jousten in the Recoletta. Our room was great. The room had a wonderfully comfy king size bed and the decor was tastefully done in a modern style. The only drawbacks to the room were the lack of a view and traffic noise during the day (at night, though, it was very quiet.) The service was great; everyone at the front desk was very helpful and friendly. The breakfasts in the morning were unbelievably good - complete with fresh squeezed juices, tortilla espanola, fresh fruit, delicious chocolate goodies, and much much more. The NH Latino also had a nice gym on the top floor and internet access in the lobby, which we found very helpful during our stay. To top it all off, we got a superb price at this hotel on the internet - $85 a night with breakfast included. If you should decide to stay here, you won't be disappointed.", "title": "Great hotel, great value -- lovely rooms", "helpfulness": 7, "user": "brian_washdc", "date": "November 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4138171}, {"rating": 5.0, "title": "Simply the best", "text": "Our last night in Argentina was spent sleeping at the NH Latino. Our room was a huge half-circle overlooking the obelisk - and for about $100 US dollars! The room was amazing, and the staff was efficient and helpful. The neighborhood is a bit busy outside, so try the Jousten if that's not your thing.", "helpfulness": 10, "user": "jetsetgypsy", "date": "November 10, 2005", "id": 4103306}, {"rating": 4.0, "title": "Great hotel at a great price!", "text": "My partner and I arrived at the NH Latino hotel on the morning of September 3rd. We had requested an early check-in, but were told that this could not be guaranteed, so we were ready to leave our bags at the desk until 4PM. We were very happy when we were able to check-in right away to our 6th floor room. The room was spotless and nicely decorated. The mattress was very comfortable, as were the long pillows. The bathroom was well-stocked and featured a bidet and really powerful water pressure. The television had an extensive channel selection with many in English. The room was very quiet -- despite the hotel being situated on a very busy corner. The hotel staff was particularly friendly and helpful and were always available to call a taxi or exchange bills for smaller denominations. The hotel is a few blocks from the obelisk and Florida Street, and is next to two subway entrances -- but when we didn't walk, we took taxis everywhere because they were inexpensive and readily available. Our room rate included breakfast, which was extensive (and delicious) -- featuring many fruits, cheeses, pastries, eggs, potatoes, cereal, yogurt, juices and coffee. Everything was fresh. I highly recommend this hotel for both the business and pleasure traveler.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 13, 2005", "id": 3899407}, {"rating": 4.0, "title": "Great value", "text": "We stayed at the NH Latino for 6 nights. The hotel is in the center of the city so it is a very busy area and it can be noisy outside - inside you won't hear the noise. The hotel is great - the rooms are spacious and clean with hardwood floors, the staff is friendly and helpful, and the breakfast room and breakfast are quite nice. At night, you have to be careful of the direction in which you walk because the hotel is close to some transitional neighborhoods - but the staff will guide you and offer suggestions (such as when it is advisable to take a cab). The location is really good if you like being in the heart of the city. I would definitely return to this hotel -it was really good for the price.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 10, 2005", "id": 3891779}, {"rating": 5.0, "title": "Great Stay at the NH Latino", "text": "Excellent hotel... the location is convenient to Puerto Madero, Plaza de Mayo, Corrientes, Florida/Lavalle streets and is an easy walk to San Telmo and Retiro. Taxi rides to Recoleta via a radio taxi are no more than $2 - $3 USD. The staff is considerate and will go out of their way to be of service. The rooms are nice and big, maid service is efficient and the buffet breakfast is excellent. While it may cater to business travelers, you can't go wrong with the hotel.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 31, 2005", "id": 3513321}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "One note - I saw that many people recommended the Jousten. I understand it is a nice hotel but the location, if you like to walk, did not seem as convenient. Either way, you can't go wrong with an NH hotel.", "title": "NH Latino - Great Location", "helpfulness": 10, "user": "Bonjacas", "date": "January 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3027720}, {"rating": 5.0, "title": "I Loved It", "text": "You will love Buenos Aires!!!", "helpfulness": 18, "user": "nwalesguy", "date": "July 23, 2004", "id": 2317244}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I had no previous experience with the NH chain of hotels, and I was impressed. While the NH Latino is probably more business oriented than anything, it is in a great location (walking distance from many different \"must sees\"), and as a tourist I had a very nice stay. The rooms are spacious, comfortable, and modern, and the bathrooms are nice (great toiletries!). The staff is fairly friendly and helpful, and the included breakfast is one of the best I've seen in South America. I also stayed at the NH City at another point in my trip, which is a bigger and fancier, but I was happy at both places and would return to either of them.", "title": "Good hotel", "helpfulness": 3, "user": "noscreennameswork", "date": "October 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5949055}, {"rating": 5.0, "title": "Convenient Location", "text": "My wife, my 22 year-old daughter, and I stayed at the NH Latino in July. They gave us three single beds. Everything was very clean.", "helpfulness": 7, "user": "HamRadioTraveller", "date": "July 31, 2006", "id": 5532088}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The bathroom toiletries were more generous than usual, and included a razor/shaving cream, plus a toothbrush/toothpaste.", "title": "A great find in a busy city", "helpfulness": 8, "user": "travelagent2005", "date": "March 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4735284}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The breakfast was very pleasant, and in a very quiet dining room. Staff was attentive and smiling.", "title": "great value, great rooms, great breakfast, great staff!", "helpfulness": 8, "user": "psychtobe", "date": "March 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4614901}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Internet access was by two machines in the lobby, with a sign limiting usage to 20 minutes. But useage was free, and there were plenty of times when no one was waiting.", "title": "great hotel at a great price", "helpfulness": 4, "user": "lucky-we-live-Hawaii", "date": "January 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4399344}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 4, "variance": {"poor": 8, "average": 33, "very good": 110, "terrible": 2, "excellent": 89}, "aka": "Nh Latino Hotel Buenos Aires", "slim_ranking": 0.259090909091, "description": "This newly built hotel in the heart of the financial district is just a short walk from Calle Florida and the best shopping malls."}