{"user_rating": 4.0, "review_count": 85, "name": "NH Santa Fe", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed in this hotel as I was going to be a speaker in a conference we were having there. The hotel is nice, steps away from the Santa Fe Mall and with plenty of good restaurants in the area (one, the Xanto, before Paxia, right in the building, is one o the best mexican restaurants in town, and I mean Mexico DF). The rooms are fine, clean and good sized-", "title": "Nice hotel, but some flaws", "helpfulness": 1, "user": "ARUANO", "date": "November 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145577750}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "They have free wifi (only for a device at a time, what is a bit of a nuisance, as you have to exit the connection in your ipad if you want to use your laptop, etc.) You can purchase, at a steep price, more \"devices\". The bad thing is the we lost the wifi for almost one day in the hotel, what affected our seminar and the possibility of working in the room (what I needed to do). Things like those happen, but you can manage it better or worse. In this occasion, they chose worse. No matter I called many times and they told me they will tell me when it was working, they never did. Nor the explained the situation or gave any excuses.", "title": "Satisfactory Business Hotel - not soundproof", "user": "Maximilliano2", "date": "October 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142719340}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "One colleague of mine took one of their excursions to visit the Guadalupe church and Tehotihuacan pyramids, only to discover, when he was in the bus, that the church has been yet visited and only the pyramids were left. It took several visits to the reception to get part of his money back (as some of the people in the tour has only taken the pyramids and it was cheaper). At the end, they reimburse the money corresponding to the church but, again, no excuses, no complimentary something (and it was the hotel fault).", "title": "Rude staff, policies matter more than you", "helpfulness": 2, "user": "kontiki7", "date": "June 3, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 131230986}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Apart from these things, that give the idea that the people managing the hotel need to take service more seriously, it is a good option in Santa Fe.", "title": "Friendly and Helpful", "user": "Larryontheroad", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128169568}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "All in all I have had a pleasant stay at the NH Santa Fe. The hotel is rather new and therefore quite up to date. The room is comfortable. I have two negative remarks. It is quite easy to hear noise from the corridor and other rooms. Silence and darkness is important to me when changing time zones to get over the jet lag quickly. As I had the unpleasant experience of staying next to a group of men who sang from 2AM until 6AM when I got up, this particular inconvenience was rather noticed. Secondly I noticed that the breakfeast area was very poorly lit. The first morning I sat in the dark and was lucky enough to get to breakfeast early enough on the second day to sit under a lamp.", "title": "Nice Hotel", "user": "twebst", "date": "February 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125409569}, {"rating": 2.0, "title": "Light Sleepers Beware", "text": "Ultra modern and sleek hotel; but walls ultra-thin. If you are a light sleeper avoid this hotel at all costs. Guy next door on his Sprint/Nextel 2 way and cell phone until midnight; only to be awakened by the guest upstairs shower and playing of the television at 4 am. Oh, and cell phone guy begins whistling and talking on the telephone at 6 am.", "helpfulness": 2, "user": "Hexte", "date": "November 19, 2008", "id": 21997777}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I had the need to stay one night in this hotel. Though very new and modern rooms. Service left me taken aback....Breakfast was completely cold...I spoke with management and they quickly removed the charge from my bill....Would I stay there again...perhaps in a pinch, yes.", "title": "upscale rooms", "helpfulness": 1, "user": "hseofbel", "date": "February 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 124466678}, {"rating": 2.0, "stay_parameters": "Stayed January 2012", "text": "NH Should be a good hotel but has too many limits! Let's start from wi-fi: you need to pay for it and you can only log one device (and nobody tells you this). Do you want to LG another device (even not at the same time)? Desk told me to buy another card! Of course I worked around (bridging).", "title": "Should be a good hotel but has too many limits!", "helpfulness": 1, "user": "Luca M", "date": "January 13, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 123014360}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Breakfart area is a construction area with too few seats.", "title": "excellent mid-range business hotel", "user": "travelduesouth", "date": "September 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118710950}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Reception is not so welcoming and they are not proficient in English.", "title": "Hotel well located for Business Traveler on west side of Mexico City", "user": "TxLonestar", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115402778}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Room are cold and noisy. Bathroom is not properly clean. If you want to have a design room, then you need to keep it shining..", "title": "Ideal for business travellers to Mexico, Santa Fe business district", "user": "reissu-erkki01", "date": "February 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 55754911}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast", "city": "Mexico City"}, "stars": 3, "variance": {"poor": 6, "average": 11, "very good": 31, "terrible": 2, "excellent": 35}, "aka": "NH Santa Fe Mexico City", "slim_ranking": 0.10447761194, "description": "For business or pleasure, NH Santa Fe offers quality, excellent service to make your stay unforgettable. For it location to the west of the city you will have a quick access to the most important national and international corporation of the cityNH Santa Fe has spacious rooms with spectacular view of Santa Fe, all rooms have air conditioning and heating. free wifi for all our guest, restaurant with the best and most complete Antiox breakfast, rooms for meetings and events, large parking and the best service Welcome to NH Santa Fe"}