{"user_rating": 3.5, "review_count": 204, "name": "Nichols Village Hotel & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "My boyfriend and I booked the inn through priceline. For what we paid, the in was alright. It was clean. There were little things that were wrong--Peeling wallpaper, cracked mirror on the wall, sheets that were too small for the bed...Little things, but not a 3 star experience.", "title": "Acceptable for what i paid", "helpfulness": 1, "user": "melissamccrink", "date": "November 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 10919320, "likes": {"liked": "— that I got it through priceline--Didnt pay full price...the pool was nice", "disliked": "— location on busy 4 lane street--view of rte. 476 and rte.11"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I paid about $55/night which I got through priceline. My room was in a building not attached to the main building. I was told that this building was in the process of being SOLD and would soon not be part of the hotel. I can understand why as the rooms in this building were NOT 3 star rooms, basically more like a motor lodge. A friend was staying in the main building and his room was much nicer. Also, his room had wifi, where as mine did not. My room was VERY CLEAN, which is always nice. The staff was somewhat deficient. The first key they gave me didn't work. They forgot to call my friend with his morning wake-up call. The desk staff spent more time chatting and gossiping with each other and to my amazement wouldn't stop until I INTERRUPTED THEM. Normally when a guest approaches the desk, the staff stops on their own accord and turn and address the GUEST...but not here. The night time desk staffer seemed to be doing paper work and seemed annoyed that I dare interrupt him to ask a question.", "title": "Good for what I paid, but NOT a 3 star hotel! Staff needs training!", "helpfulness": 1, "user": "Al-Burj", "date": "November 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10508747, "likes": {"liked": "— It was clean and a good location IF YOU HAVE A CAR, otherwise it is a bad location.", "disliked": "— Room was only o.k., nothing special. Desk staff was not that good."}}, {"rating": 5.0, "title": "Good place to stay in Scranton", "text": "Sorry, normally I take pictures but as the building is being sold didn't see the point in that this time.", "user": "cmitch8", "date": "October 28, 2007", "id": 10408241}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "In closing, FOR WHAT I PAID, it was good, but not a bargain as Priceline claims they give. If I had paid any more for what I got I would have been very disappointed.", "title": "Ok but not a 3 star", "helpfulness": 1, "user": "Sabreepc", "date": "October 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 10207240, "likes": {"liked": "— Cleanliness", "disliked": "— dated furniture, small room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed here as an alternative to the big chain hotels. The room was clean, the pool was large and well maintained and the grill associated with the hotel had an excellent breakfast. Would stay here again.", "title": "I thought it was very nice", "helpfulness": 1, "user": "toomyw", "date": "October 9, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 10058162}, {"rating": 2.0, "stay_parameters": "Stayed July 2007", "text": "Stayed here for a wedding in 07/2007. I've stayed in worse hotels, but this stay was not good.", "title": "Weekend at the Inn", "user": "gregstrick9", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 8108062}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Our bathroom had a foul sewer smell that just wouldn't go away. I thought it was just our room, but the guests across the hall complained that their room smelled of urine. I guess we were lucky?", "title": "staying at the Inn at Nichols Village is a family tradition", "helpfulness": 1, "user": "summertravler03", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8093077, "likes": {"liked": "— we have stopped here for years and it is always reliable", "disliked": "— nothing -- wish they had kids cable stations, activities."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Though the place was well updated and not \"junky,\" it was quite filthy. The carpet is ready for replacement/steam cleaning as it was a little sticky. I wouldn't walk on it without shoes. The shower had a bit more mildew than I was comfortable with, which was not surprising considering the rest of the issues we had.", "title": "Great experience!", "user": "CedarTopbeachgal", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8085345, "likes": {"liked": "— Cleanliness of hotel, and in walkiing distance to restaurants, banks, shopping"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "There have to be better hotels in the area...find one.", "title": "Great Hotel/Great Service", "user": "vcl227", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8085126}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "This hotel is in the same category as a Sheraton or Hilton. The rooms are nice, well thought out, and pleasantly decorated. While the staff is a bit disorganized, they're no more disorganized than any other hotel in a small town. The grounds are pretty, the hotel well laid out, and the restaurant very good, and looks recently remodeled. The pool is big and indoor. It was closed for 5 hours for a wedding reception while we stayed there. Both of our rooms were clean. We did have some problems with our bill when we checked out, but were assured that it would be taken care of.", "title": "Nice hotel - good location", "user": "DavidDC", "date": "October 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10057980}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "What a mess. I called the hotel directly to book, since I couldn't get a AAA discount booking at their website. I was quoted a great rate for their 'bed & breakfast' package, but was charged over 10% more when I got there. The staff argued with me all weekend, insisting they'd never quote a rate so low, and refused to honor the quoted rate. Beware: the confirmation # given at booking did NOT show the quoted rate. After all that, I now have a credit card statement showing they charged me twice, and the on-staff manager can't find the charges. So, I have to wait t til their accountant returns on Monday to have him check the credit card records. Amenities: While the room was probably luscious in the late 80s or early 90s, it's now quite dated. However, these are the largest rooms I've seen, with high ceilings & an oversized bathroom, as well. The cobwebs along the ceilings freaked me out a bit, but the room was pretty clean elsewhere. The pool is pretty, if you can use it - It might be unavailable due to a party booked there. Fitness room is okay, if you can find it, though I've seen better. And, this is no longer a honeymoon hotel (used to be known as such by the locals) - loud children ran the halls during my stay. The accountant will need to make me very happy on Monday to get me to stay here again.", "title": "Misquoted rates & double charged credit cards!", "helpfulness": 1, "user": "butrfly", "date": "August 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 8349861, "likes": {"liked": "— large room & bath", "disliked": "— misquoted rates, double-charged credit card, cobwebs in room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I booked this on priceline as a mid point stop heading to Cleveland. I read other reviews and a few days before our stay requested to be placed in the Applewood building and was was told that since were booked via Priceline that was not possible. From what I can gather, Applewood could be 3-star, the Evergreen building we were given upon check in was not -- at the most a 2-star. Rooms could use some upgrades, carpet worn, bathroom clean but not \"hotel\" clean. small TV with poor reception, traffic sounds all night, etc.", "title": "beware not a 3-star at all in the Evergreen building", "user": "brucelegs", "date": "July 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 8253412, "likes": {"liked": "— the price I got via priceline", "disliked": "— location and inability to upgrade to better room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "the Evergreen building is more like a \"motor inn\" type of place. For what I paid on Priceline it was just OK, not at all what I expected for what they called a 3-star.", "title": "Great Hotel", "user": "TashaTasha", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8218776}, {"rating": 2.0, "title": "Poor customer service", "text": "Needed an overnight stay for the Steamtown Historic Site in Scranton and this Inn was the perfect spot. Easy to find off of the turnpike or I-81 and very modern and clean and upscale. Quiet , spacious room with very nice amenities.", "user": "trav098", "date": "July 14, 2007", "id": 8117035}], "location": {"country": "United States", "city": "Clarks Summit"}, "stars": 3, "variance": {"poor": 37, "average": 37, "very good": 70, "terrible": 13, "excellent": 47}, "aka": "Nichols Village Hotel And Spa, Scranton Pa", "slim_ranking": 0.571428571429, "description": "Our beautifully renovated boutique-style hotel, nestled in the foothills between the Endless and Pocono Mountains just outside the city of Scranton, is off Exit 194 on Interstate 81 and Exit 131 of the PA Turnpike. An exquisite blend of modern luxury and established service delivery, our award-winning staff adds a personal touch to our hospitality. Our stylishly appointed guestrooms feature a fresh modern look amidst the charm of our campus footprint. Our unique design offers something for everyone, with a variety of room types and features to suit your style and preference."}