{"user_rating": 4.0, "review_count": 172, "name": "Nicolaas Witsen Hotel", "reviews": [{"rating": 4.0, "title": "Totally fine", "text": "My fiancee and I spent two days there in March 2004. It was perfectly fine. Nothing special, but no faults either. The room was clean and verged on attractive, really. The breakfast that was included was more than we could eat. The location is fine. It's really not far to anything from there.", "helpfulness": 6, "user": "melvinPickles", "date": "April 7, 2004", "id": 1767148}, {"rating": 4.0, "title": "Loved the Location", "text": "We have just returned from a 4 night stay at this hotel. We found it to be in the best possible location : close enough to the night life without being intrusive and near to many museums and other such places of interest. The room was small but very clean and the staff were helpful and friendly. However.......if you are not keen on lifts, beware of the stairs! We will definitely return.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 5, 2004", "id": 1709828}, {"rating": 4.0, "title": "going back again", "text": "Clean, good staff, nice location close to museums. We stayed here after three nights in the Piet Hein, and by comparison, our room at the Nicolaas Witsen was gigantic.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 11, 2004", "id": 1645391}, {"rating": 3.0, "title": "OK if you're not in your room very much!", "text": "Just booked three nights again, if that says anything", "helpfulness": 5, "user": "dustyroad52", "date": "January 7, 2004", "id": 1541370}, {"rating": 5.0, "title": "hotel", "text": "The Nicolaas Witsen was not bad ... It's kind of modern and not in a bad location. Perhaps I just enjoy a different type of hotel (more cosy and smaller too). The staff were friendly and the breakfast was very good. So - there was nothing wrong with it, for the money it was good value.If you're not in your room overmuch it's not bad, it's just very small and rather plain, that's not a criticism per se just the facts.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 26, 2003", "id": 1530887}, {"rating": 4.0, "title": "clean and comfortable", "text": "we stayed here in december 2003 it was clean and comfortable.it is in a quiet location but the main attractions are easily reached either by foot or tram.the staff are very friendly and helpful .", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 5, 2003", "id": 1508103}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 3, "variance": {"poor": 12, "average": 31, "very good": 80, "terrible": 3, "excellent": 46}, "aka": "Hotel Nicolaas Witsen", "slim_ranking": 0.294117647059, "description": "Hotel Nicolaas Witsen is a recently renovated hotel in a quiet street in the city centre of Amsterdam. Most of Amsterdam attractions/ sightseeings are within walking distance from our hotel. All rooms and public area's have free WiFi.We are ready to welcome you and promise you a wonderfull stay!"}