{"user_rating": 5.0, "review_count": 70, "name": "No Worries - Barcelona", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed only one night after flying into Barcelona prior to traveling north into Spain. We arrived by car, but the train would be easier if you were staying in Barcelona. We did not have a gps and were very tired, so we struggled finding the exact location for awhile. Paul was super flexible with our arrangements and sleeping situation as we had our two kids and gramma. He welcomed us around 1100am, Thijs fed us breakfast, and we took a siesta before going downtown. I think they receive more young travelers and couples, but they prepared a really quiet place for us to rest and sleep and we really appreciated that. The house is really perfect for their business and has ample room to spread out and take in the views. The atmosphere is totally relaxing as is their honor system for beer and wine. It was a refreshing way to start our vacation. I had to catch an early train to meet some friends back at the airport and Paul got up to make me coffee after I told him not to worry about it. He and Thijs are classy, quality people. They were not set up for credit payments when we left so he told us to pay via paypal after we returned to the state a week later. If I find myself in Barcelona again, I will definitely stay again to see my friends at No Worries!", "title": "Reliable, Courteous, and Easy Going", "user": "flyingscottsman", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 104489847}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "These guys really know how to take care of their guests and make everyone feel at home. We have actually been up to the villa a few times, and have enjoyed ourselves on every trip. Great food, great hosts and great company, really makes for an enjoyable weekend.", "title": "Great Weekend Away with Friends and Made Some New Ones Too!", "user": "therealtiktok", "date": "April 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 102878495}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We travelled here as a group (family and friends) to celebrate a 21st birthday. The villa was an amazing place to relax with plenty to keep everyone happy. Paul and Thijs made us very welcome and looked after us well. The scooter tour of Barcelona was a great way to see the city ..... so much fun and not to be missed!", "title": "An amazing place to stay!", "user": "1sunshinegirl", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102553264}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "This was a birthday celebration we will never forget and we will definitely be back...", "title": "Best place to stay in the whole of Europe!!!", "user": "kirkshores", "date": "February 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 96470631}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "P.S. We still have to sample your paella Thijs... can't wait!", "title": "No worries is Family!", "user": "someoneusa", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95731205}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I'm a digital nomad, a traveling freelancer who works on the road while travels. I have been planning a 2 month return to Barcelona because it is my favorite city in the world after having some time there a few years ago. I needed to rent an apartment or a share in the city to quietly do my work during afternoon and evenings and have some leisure activities at night. After having my apartment sorted and arriving in Barcelona - it fell through last minute as the owner turned out to be unprofessional and decided to take someone else's higher bid last minute for a bigger personal gain.", "title": "Living Hollywood on a backpacker budget", "user": "wiz0rd", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95706636}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Being stranded, I logged onto Craigslist Barcelona and found this 'villa', contacted one of the crew and asked if I could stay there for 4 days (for a fee of course) while I looked for a new place. I got a quick and welcoming response, got on the train and arrived in Montmelo (a short 30 min ride from the centre of the city on a regional train). I was picked up from the station in a van and brought to the place. It was 9pm and I have just arrived after being on the road for more than 48 hrs. I was highly exhausted and just wanted to sleep. They proceeded to greet me with a beer and invited me to the BBQ in the garden. After meeting some of the crew and guests and having a good night, I went to bed.", "title": "Great place to stay", "user": "Girli84", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95697384}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Next morning I woke up, looked out of the window of my private room and was in awe. I was in Hollywood. Swimming pool, tennis court, ample amount of space. I immediately knew this was the place for me. The only thing I needed to test out was the speed of the internet connection to ensure I was able to do my freelance work for my clients - that was great.", "title": "AMAZING AMAZING AMAZING!!!!!!!!!!", "user": "camidavies", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95677927}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "I came up to the owner and requested the private room for a month with an option to extend.", "title": "yeeahooooo :)", "user": "jumpymoonshine", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 92225225}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Let me tell you - I have never had this much fun in my life. The space provided me with enough privacy to do my work in the afternoons. Mornings were spent quietly reading books by the pool, playing tennis or chilling with whatever guests were there at the time.", "title": "Best vacation ever :)", "user": "Tessa85", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92182079}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Great relaxed place to stay. The villa is beautiful and staff is amazing. The price was reasonable and one of the greatest parts of our stay were the evening dinners, delicious and an awesome way to meet fellow travelers from around the world. I also strongly suggest the scooter tour, a great way to see Barcelona.", "title": "Relaxed and worry free", "helpfulness": 1, "user": "Breann82", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110709094}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I'm not too sure where to begin with the No Worries Villa.", "title": "Perfect", "helpfulness": 3, "user": "LilleLake", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110059154}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I've travelled a lot to many countries, stayed in a wide range of places from small hostels down to luxury hotels but this place is now 100% my favourite. I had seen the photos and heard all about it from friends who were already staying at the villa but once I had arrived the place was ten times better than what I had initially expected. You have to see it to believe it. It’s a real hidden gem.", "title": "Location & Relaxation in Barcelona", "user": "Paul1963Canterbury", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109951290}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The location is in Montcada, just outside of central Barcelona but the train station is only a 5 minute walk from the villa and from there it's only 10-15 minutes right in to the heart of the city.", "title": "Nice and friendly", "helpfulness": 2, "user": "rishin11", "date": "May 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 109006521}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I arrived at about 11pm and Paul (one of the guys who own the villa) came to pick me up from the station and help with my bags. On arrival I was greeted by a large group of people from all over the world who were relaxing by the pool. I can be quite a shy person at times but I was made to feel very welcome and comfortable. From the word go I was in my element and having a fantastic time. I didn't even bother to unpack, I just wanted to go back down to where everyone was and join in the fun!", "title": "If I hadn´t been there I couldn´t believe it...", "helpfulness": 2, "user": "screengems", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108308966}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Unfortunately for the reader, No Worries Barcelona is in the middle of moving from their current ideal location at Montcada i Reixac right outside of Barcelona. No Worries is on a mansion overlooking the town with a beach volleyball court, swimming pool, basketball area, and even table tennis. Our host, Thijs, bent over backwards to make our stay perfect. He picked us up from the train station (even though we went to the wrong one!), allowed us to make phone calls from the premise due to a misplaced credit card, let us use his laptop for internet, and even invited us to celebrate New Years with his friends; all without charge! All in all we had a superb time at No Worries and we look forward to seeing No Worries at its next location.", "title": "Wonderful Stay at No Worries", "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122711423}, {"rating": 5.0, "title": "Went twice and more to come!!!", "text": "We did our wedding party at the Vila!", "helpfulness": 1, "user": "Dror M", "date": "November 21, 2011", "id": 120848843}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "everybody had a great time, the food, the drinks, the stuff.", "title": "The best hostel I have stayed in!!!", "user": "cprincm", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119855126}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Thanks guys!", "title": "The true Dutch quality amid the lazy Spain", "user": "assbanger", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116934114}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "After traveling around the globe staying in hostels for almost a year I thought I had experienced the best hostels the world had to offer. Although none compare to No Worries.", "title": "Paradise on Earth", "helpfulness": 2, "user": "JuJuTrosh", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116422746}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "variance": {"poor": 1, "average": 0, "very good": 6, "terrible": 1, "excellent": 62}, "aka": "No Worries - Barcelona Hotel Barcelona", "slim_ranking": 0.0651340996169, "description": "The No Worries villa is a wonderful place with lots of friendly people and a homely vibe. Great for people who like to be active during their holiday, but who can also enjoy a relaxed time by the pool."}