{"user_rating": 4.0, "review_count": 601, "name": "Nob Hill Motor Inn", "reviews": [{"rating": 3.0, "title": "Ok -But Disappointed", "text": "We ended our first tour of America with 4 nights in San Francisco.", "helpfulness": 4, "user": "Ferriby", "date": "September 1, 2005", "id": 3837169}, {"rating": 5.0, "title": "Wonderful Inn", "text": "Our hotels had all lived up to our expectations except this one.", "helpfulness": 7, "user": "suki49", "date": "August 23, 2005", "id": 3801925}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We had stayed in a superb hotel in New York for the same price and so expected the same standard at Nob Hill.", "title": "Great Value-Priced Hotel", "helpfulness": 5, "user": "G-Union", "date": "August 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3755230}, {"rating": 5.0, "title": "Great location", "text": "Plus points; the owners are friendly, good location, many restuarants nearby, the' Lemongrass' Thai Cuisine- Polk Street - (5min walk) was excellent and for a special meal the' Ristorante Milano' was wonderful.", "helpfulness": 4, "user": "coolroe", "date": "August 11, 2005", "id": 3754048}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We had a 1 room suite with 2 queen beds, table, microwave, small fridge. Our first impressions were that there was a damp smell and later found evidence of mould on the wallpaper on the outside wall.", "title": "Wonderful Hotel und nice owners", "helpfulness": 4, "user": "Luxembourg1", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3730263}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Stayed at this Motel for a few days while in town for The Fancy Food Show.", "title": "Great Place to Stay--Highly Recommended", "helpfulness": 1, "user": "Toothfairy79", "date": "January 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6700589, "likes": {"liked": "— friendly staff", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "This was my first time to San Francisco and booked this reservation from the reviews I read on TripAdvisor and I was not disappointed at all.", "title": "Reviews are true - this is a find!!", "helpfulness": 7, "user": "Ducati40", "date": "January 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6612257, "likes": {"liked": "— Location, beds and cleaniness.", "disliked": "— -"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The Nob Hill Motor Inn is a small Motel run by a husband and wife team. We had a great experience staying here because we felt like we were at home. The rooms were very spacious and very clean although the decor is slightly outdated but who cares! Each room has a microwave and mini fridge, full size ironing board and iron, a binder with very helpful info about area attractions/places to eat etc.., they also provide free wireless internet access, and complimentary continental breakfast . We were greeted by Frank (owner) who patiently explained all the things we needed to know about the area--he even gave us a map and wrote down areas that were unsafe, as well as must-see attractions. The day after we arrived the Motel was being run by Naresh and his wife--who were taking over while Frank and Judy were on holidays--they were also extremely helpful and went out of their way to make sure we had everything we needed--they also gave me some great tips on how to make great tea!!", "title": "Great location, comfortable room, friendly service", "helpfulness": 2, "user": "carol55", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0}, "id": 6569260, "likes": {"liked": "— friendly staff", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "There is a Starbucks within a few blocks, as well as some other restaurants--we arrived on a Saturday night and were very disappointed to find that most restaurants around our Motel closed at 9 or 10pm which we found very inconvenient and strange--if you go to North Beach area (little Italy) apparenlty the Cafe's and restaurants are open very late and are quite busy.", "title": "We keep coming back!!", "helpfulness": 2, "user": "Collegeprof", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6555939, "likes": {"liked": "— Location & Management", "disliked": "— Boarding Passes have to be printed at Kinkos."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Overall, we had a great experience at the Nob Hill Motor Inn and would definitely return.", "title": "Liars- Bait and Switch Operation", "helpfulness": 8, "user": "JEFNOLA", "date": "December 27, 2006", "detail_rating": {"value": 1.0}, "id": 6503887, "likes": {"liked": "— Be wary and call to confirm your reservation before you arrive."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "After reading numerous reviews about this motel I expected too much. Sure the rooms are clean enough but they are small. And it is a great feature that it is a \"non-smoking\" property. But that's where the positives end. The motel is comprised of two floors- the second and third- and the bottom floor is where you park your vehicle if you drive. However, therein lies the problem, on a cool evening or morning, it is just too noisy - especially when you want to open your windows for some fresh air. Too noisy with all the car noise below filtering up to your room: the constant opening and closing of car doors and motors starting. Would be more of an enjoyable motel if the cars were somehow situated differently than directly below the rooms. The location however, close to Pacific and Polk Ave is ok - with walking distance not too bad for most locals: Fisherman's Wharf, China Town etc.", "title": "Ok but over-rated", "helpfulness": 7, "user": "Timotheus1", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3659218}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We stayed 4 nights in mid-June in a standard room with 2 queen beds on the second floor. We were 4 adults. The room was clean & the beds comfortable. We chose the hotel for its location & were not disappointed. It's in a nice neighborhood, with several restaurants close by. Although they have free parking, we opted to pick up our rental car on departure day as we really did not need it. A 3 day pass on public transportation was all we needed. Two cable car lines are within walking distance & several bus lines are even closer. Although the hotel offers take-out muffins, croissants & pastries in the morning, we preferred a more substantial breakfast which was available close by. The inner courtyard where the cars are parked can be noisy in the morning when guests are departing early as voices are amplified, but it wasn't a problem for us as we were early risers. Taking price & location into consideration this hotel is rated above average. We would certainly consider staying there again.", "title": "Great location", "helpfulness": 7, "user": "Barto", "date": "July 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3654892}, {"rating": 5.0, "title": "Best Stay in San Francisco", "text": "We just returned from vacation with the first stop in San Francisco. We stayed at the Nob Hill Motor Inn and absolutely loved it!", "helpfulness": 8, "user": "Bob G", "date": "July 1, 2005", "id": 3628411}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "We are a family of 5 and stayed in one of the 2 bedroom suites. The accomodations were great! The suite was spacious, rooms were neat and clean.", "title": "Great location but tiny room", "helpfulness": 5, "user": "Hod1", "date": "June 25, 2005", "detail_rating": {"rooms": 3.0}, "id": 3610530}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Hosts Frank and Judy were very helpful in answering all of our questions on the ins and outs of getting around the city. The hotel is in a very nice location, just a couple of blocks away from the cable car stop. Ir's very easy to access the city from here by foot, car or public transportation.", "title": "The reviews are correct, an excellent place to stay", "helpfulness": 2, "user": "GiftgrubCork_Ireland", "date": "June 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3545032}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This is a great hotel in the charming Nob Hill neighborhood! It is located close to a number of restaurants, small shops and public transportation. The room was extremely nice and spacious, with a bathroom that appeared to be newly renovated. We loved the owner's \"S.F. 101\" speech about what to do and what areas to avoid! We had a minivan, and parking in the covered spots was no problem, although it was a bit tight... We will recommend this place to our friends and stay here again during our next getaway to the Bay Area!", "title": "Wonderful Experience!", "user": "cowlumbus", "date": "October 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10026093, "likes": {"liked": "— Location, free parking"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Great place to use as a base to explore some of San Francisco - far better than the overpriced and tatty Fisherman's Wharf Marriott I stayed in last year. Friendly staff, clean rooms with plenty of space and easy walking distance from Fisherman's Wharf and Chinatown. I didn't find the parking a problem - it may depend on the size of your car! No surprise that it's on a fairly decent hill but that's half the fun of San Francisco! I'll definitely be back again and the Nob Hill Motor Inn is my new recommendation for anyone asking about places to stay in San Francisco.", "title": "Great base in SF", "user": "viralto", "date": "September 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10003028}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My husband and I stayed at the Nob Hill Motor Inn in June 2007. This was the first hotel we stayed at on our 4 week holiday in the USA. We did think the room was quite small but we weren’t sure what to expect from hotels in the USA. In reflection though it was a tiny room, but nevertheless it was very comfortable and adequate for a few days stay. The location was good for a first timer in San Francisco because it is half way between Fisherman's Wharf and Union Square area. We ended up spending most of our time in the FW area so next time I might stay somewhere closer to FW. The free parking was great too. San Francisco was such an awesome city! I loved every minute of my time there and I’m looking forward to going back one day and seeing much more of the beautiful city!", "title": "Happy with the Nob Hill Motor Inn", "helpfulness": 2, "user": "Lee008", "date": "September 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8829193}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Twelve of us stayed here in three rooms for two nights during the start of our touring holiday. The hotel is quite small and is run by the owner who made us very welcome and gave us all hints and tips about the best places to visit during our two days in San Francisco. We had two standard rooms with two queens and a junior suite with an extra bed. The rooms were all spotlessly clean, quite large and well equipped with fridge and microwave. All rooms are located off of a two story internal courtyard so there was no traffic noise at all.", "title": "Great Little Hotel", "helpfulness": 3, "user": "AndrewT39", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8379112, "likes": {"liked": "— Friendly, clean, good price, great location.", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The hotel is located about 30 minutes walk from pier 33 to Alcatraz (excellent place to visit) and Fisherman's Wharf (awful tourist trap). The area around the hotel has many restaurants which seem to be used by locals which was good. The cable car lines are less than 5 minutes walk away. The parking at the hotel was free although fairly limited - first come first served - but its a walking city so get the car space and leave it there! A free breakfast of coffee, fruit and danish was available in reception each morning which was a nice touch. In summary, an excellent, small, well located and friendly hotel where we'd definitley stay again.", "title": "A good choice", "helpfulness": 2, "user": "instoreman", "date": "August 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 8356962, "likes": {"liked": "— good location, value for money"}}, {"rating": 3.0, "title": "Standard motel in beautiful San Francisco", "text": "Our family of 4 stayed at the Nob Hill Motor Inn for 4 nights in July 2006. While this is indeed decent value for the money if you are on a tight budget, there is nothing else special about it. For the 1st time in years of relying on Tripadvisor users, we were a bit surprised with so much hype. Our room was large and particularly clean but there were: 1) no phone for the 4 days (the technician never came), 2) sliding closet doors that were already off the rails, 3) TV that did not work the 1st night (remote needed some programming?), 4) strobing light in the tired bathroom. Complimentary breakfast was minimalist and needed to be complemented with our own purchase of cereal, fruits and bread. You get it from a tiny office corner, where it gets replenished in small loads making us feel bad to take more, and bring it to your room. One morning, there was hardly anything left and it was not late. The managing couple are indeed welcoming, calm and patient but they looked tired and we did not see enthusiasm in dealing with customers. The rooms get partial day light, you get no view and no sense you are in S-F. The walls and floors seem thin so we could hear our neighbours and stomping from the people upstairs. Location is fine although not that central. We unfortunately can't say we would return. The city otherwise if fabulous. We recommend you should \"bike\" the Golden Gate bridge like we did (any novice can do it): we dealt with \"Blazing Saddles\" bike rental near Fisherman's wharf, took the trails to the bridge, crossed the bridge admiring the breathtaking views, ended up in upscale and charming Saussalito for lunch and shopping and came back by ferry through the bay (part of the package from the bike rental). Definitely one of the highlights of our 15 day trip through California!", "helpfulness": 5, "user": "RobCh", "date": "August 12, 2006", "id": 5602560}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We spent three days in the Nob Hill in July . We had a 5-people suite, which is actually a huge bedroom plus an area with a sink, mini-fridge and microwave and also a table with two chairs .", "title": "Very nice place", "helpfulness": 5, "user": "anne2606", "date": "August 9, 2006", "detail_rating": {"value": 5.0}, "id": 5581665}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "There was more than enough space for the five of us plus our five suitcases opened on the floor, although the table with two chairs made breakfasts a bit difficult .", "title": "loved it at the nob hill!!!!", "helpfulness": 4, "user": "wow holidays!", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5575051, "likes": {"liked": "— Everything,no complaints at all!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Breakfast must be picked at the hotel lobby and brought back to the bedrooms because the lobby is too small to eat in it . The choice is quite limited (they should add some milk for the kids) but the pastries which aren't packaged are obviously fresh from the shop and very good .", "title": "Excellent accomodation and location", "helpfulness": 4, "user": "datz70", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5558193}, {"rating": 5.0, "title": "A Hidden Treasure in SF...", "text": "The parking spaces were big enough for our minivan .", "helpfulness": 3, "user": "jff_salvatore12", "date": "August 3, 2006", "id": 5549616}, {"rating": 5.0, "title": "ABSOLUTELY THE BEST!", "text": "If you're looking for something fancy schmancy with a swimming pool and fitness center, forget the Nob Hill Motel on Pacific Ave. But, if you're looking for sparkling rooms in a great neighborhood, AAA approved, reasonable, quiet, safe, free parking, continental breakfast, fantastic owners that were extremely helpful, free pick up for tours, three blocks from cable cars, one block from buses, great restaurants in three block area, Shanghai Kelly's bar, etc., then this is for you!! We stayed there 7 nights and would stay there again, without a doubt. By the way, while visiting SF, MAKE SURE you see Beach Blanket Babylon (see their website) and get tix in advance. Also bike the Golden Gate Bridge into Sausalito, take the early \"EVENING\" tour of Alcatraz and purchase a MUNI pass (good on cable cars, buses, trolleys); don't miss visiting Fortune Cookie Factory in Chinatown, DeYoung Museum in GG Park, Muir Woods/Wine Country tour, and spend hours enjoying the sea lions at Fisherman's Wharf. What a great city --wear comfortable shoes!!!", "helpfulness": 14, "user": "BeachnGolf123", "date": "April 18, 2006", "id": 4984933}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "What started out as a huge disaster from another hotel turned out for the better for us since we were able to stay at Nob Hill! The front desk was wonderful and very helpful. The room we stayed in was recently refurbished, large and very clean. I would recommend this hotel to everyone. Public transportation was very easy to access and close to the motel. We enjoyed our stay in SF and will definately be back to Nob Hill.", "title": "Great place to stay!", "helpfulness": 7, "user": "luv2cruisegirl", "date": "April 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4975616}, {"rating": 5.0, "title": "Wonderfulplace to stay", "text": "I picked the Nob Hill Motor Inn from reading other peoples reviews of the place and the place was even better than expected. The rooms were wonderful, the bed was comfortable, nice pressure in the shower, and the wonderful couple in the office couldn't of been more helpful with directions and places to go and places to eat. We definitely plan on staying here every time we come to San Francisco.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 7, 2006", "id": 4948862}, {"rating": 4.0, "title": "Good value at the Nob Hill", "text": "This was the first stop on our journey from SF down Highway 1 to Santa Barbara. All the hotels we booked were on the basis of reviews on this web site - see subsequent reviews from me.", "helpfulness": 9, "user": "tashy50uk", "date": "April 5, 2006", "id": 4939560}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Stayed 4 nights. Room was fine. Breafast in lobby OK with a few pastries, fruit plus juice tea and coffee.", "title": "Thanks again Tripadvisor!!", "helpfulness": 11, "user": "Tabby1", "date": "March 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4774421}, {"rating": 4.0, "title": "Great find in SFO!", "text": "The Nob Hill Motor Inn is a nice find in this busy city. Well maintained, and family run, the property is very reasonably priced. Rooms are spacious and have been refurbished with care. Fridge was a nice bonus. Free parking! Easy access from the highway via Van Ness, and to Lombard street for both the Golden Gate Bridge and the \"crookedest street\" which is only about 5 blocks away. Cable cars are 2 blocks, and buses only 1/2 block. Rooms are quiet, but it is an outside hallway so folks do walk past your room window. The owners were very knowledgable and helpful about suggesting attractions, routes, discount passes for the cable cars/buses, and local restaurants. San Francisco has lots of wonderful restaurants, but the little Thai restaurant around the corner was excellent - reasonably priced and great food- exactly what we needed after a full day of walking! We would definitely stay here again.", "helpfulness": 5, "user": "M4", "date": "July 29, 2005", "id": 3718590}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed here for four nights in July 2005. We were given a warm welcome such as we have not experienced in nine years of travel in the U.S.A. by Frank and Judy. They could not have been more helpful with advice about all aspects of the city. It was a large clean room with microwave and fridge. The motel is in an ideal location. Yes, the parking spaces are cramped but once you are parked forget your car and use public transport. We cannot understand somebody's comment about car park noise which we did not experience whatsoever. We would highly recommend this motel to anybody for value, convenience and friendliness. Once you have found this place stop looking further.", "title": "wonderful welcome", "helpfulness": 2, "user": "UK_Manchester", "date": "July 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3711557}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I've stayed in the city many times always paying more. This motel is a find. It is CLEAN, CLEAN, CLEAN. Great value for the money. No, it's not the Westin (stayed there several times), or Hyatt, but is a third of the cost. Good location, easy walk for shopping and eating out. I found the room to be in good shape, clean and quiet. Free parking is a plus if you have a rental.", "title": "A great stay!", "helpfulness": 4, "user": "seethemoon", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3705555}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "The only con is the spaces are small. Very TIGHT parking! If you have anything bigger than a midsize, be prepared to crawl out the window or the back to get out once you've parked.", "title": "Great Price, Great Location, Great Owners", "helpfulness": 7, "user": "Dija78", "date": "July 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3699860}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I'll stay here again next time, with or without a car.", "title": "Perfect motel", "helpfulness": 5, "user": "Robin620", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3660128}, {"rating": 3.0, "title": "The pros and cons", "text": "I was initnally disappointed probably because I had just checked out of nicer hotel in Carmel that morning. I also wasn't so sure of the neighborhood, until I got to know the city, then it seemed not so bad. We got a lower level room at the end near the street, the room had only a small window which made it dark, most have large windows. It did have A/C. The office was very small and dated, but very clean. The parking was very cramped, but clean, covered and free ( most hotels charge $35 yo $65 ).", "helpfulness": 15, "user": "jetzoom99", "date": "May 30, 2006", "id": 5233656}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "They served coffee, cocoa and donuts every morning at the office. The husband/wife managers were friendly, helpful and likeable. We could hear the people in the room above stomp when the came in and got ready to leave in the mornings. We occasionally heard traffic pass. The room had the feel of an older Best Western road side motel, with shower only and dated decor. More important to me was the cleansiness of the room. It was spotless and odor free. The wireless internet was free and worked great with my laptop. There were no drifters in the area like I saw in the snazzy warf and union square areas. There are older shops and cafes in walking distance, If you need your clothing laundered or dry cleaned, I recommend Cameo Cleaners at Washington and Polk a couple of blocks away, Note there is a Starbucks, Walgreens and Guitar Center in walking distance. Trolley and bus passes for sale at the Holiday Inn on California street a few blocks down from this motel. The trolly cars bring you to Union Square, Warf/Pier attractions, China Town and all in between.", "title": "San Francisco rocks", "helpfulness": 4, "user": "Redjazz68", "date": "May 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5232624}, {"rating": 4.0, "title": "Great Price and Location", "text": "It was a bargin, I really spent little time there and I could park free plus it has an elevator. I would consider staying there again but would request an upper room with large window.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5232313}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Loved San Francisco. Stayed from 23 to 26 May 2006 and chose Nob Hill Motor Inn on advice from Trip Advisor reviews. The location is SUPERB. Easy access to buses, cables cars and Polk Street restaurants. Swensens Ice Cream on Hyde Street is an absolute MUST. Biked across the bridge and down to Sausalito. It was very windy and we needed to walk the bikes at times but it was by no means a tough ride. Sausalito is a beautiful little village, a must see. The Nob Hill Motor Inn itself is nothing out of the ordinary, in fact it is very ordinary. It is an old style motel and the rooms are a good size. They are a little outdated but very clean and very comfortable beds which to me is more important than a fashionable look. One tip, ask for a room on the second level as we felt we had a herd of elephants running around in the room above us. Breakfast consists of fruit, muffins and pre-packed danishs with juice and coffee. It is over by 9am so if you want a sleep in forget it. But it is free so make the most of it. Staff were friendly and helpful but no more so than anywhere else we stayed in the US. Overall I would recommend the Nob Hill Motor Inn but be prepared for what to expect.", "title": "Loved the Nob Hill Motor Inn", "helpfulness": 4, "user": "CSP0712", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5203682}, {"rating": 3.0, "title": "Fine, but you can do better", "text": "My wife and I had been on a Mexican Cruise and wanted to stay a few days in San Francisco. I found the Nob Hill Motor Inn on tripadvisor and everything I read about the Inn was accurate.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 14, 2006", "id": 5068229}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed here with my in-laws and my 14 mo old son in a family suite. It was very spacious and the refrig and micro were great to have. The free continental breakfast was enough for all of us.(Donuts, crossants, danishes, muffins, bananas, and apples.) The parking is tight but doable. We had a room on the top floor and found it very quiet. The owners were very friendly. I have stayed at high end hotels and the only difference is you pay for a beautiful lobby. I don't care about a lobby. Some of the rooms in expensive hotels are more outdated and worn than the rooms here. I found them to be very clean and up to date. I can't find one thing wrong with this hotel. The location is good, but a 20-25 minute walk or so to Fisherman's Wharf. I would stay here again, especially when traveling with family or kids. Call directly for best pricing and for Sr. and AAA discount.", "title": "Great Value and Very clean", "helpfulness": 4, "user": "braysmom", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5837009, "likes": {"liked": "— roominess, free parking and continental breakfast", "disliked": "— 20-25 minute walk to Fishermans wharf"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "After a 12 hours flight from Europe we just loved their beds!", "title": "Convenient, great accomodation for travellers", "helpfulness": 1, "user": "MaurizioEleonora", "date": "September 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5836529, "likes": {"liked": "— Position, price, cleanliness", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Clean, silent and comfortable accomodation at absolutely good price. Some excellent restaurant at walking distance.", "title": "Just Right", "helpfulness": 4, "user": "JustWright", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5815750, "likes": {"liked": "— The location", "disliked": "— Polkers is a great place to eat, right around the corner."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Staff friendly and helpful , lot of information for tourists .", "title": "Great Find", "helpfulness": 10, "user": "Jooolz", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5800380, "likes": {"liked": "— Helpful Staff", "disliked": "— Mapquest gets the directions wrong - use the hotel directions. Hotel staff say this is a common problem!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "Free parking. Cable car and bus at 5 min .", "title": "Need to Keep This One a Secret", "helpfulness": 16, "user": "cfkeiko54", "date": "September 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5794062, "likes": {"liked": "— Great price, free parking, clean, quiet comfortable rooms, courteous staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "We stayed at this property for three nights and were suitably impressed. Other reviewers have made comments about the property and we would agree with those made and the ratings given. Accommodation in San Francisco can be expensive and this Hotel is great value. Some tips though for first time tourists to San Francisco. There are many homeless people in San Francisco, and this area (Nob Hill) is no different. Expect to be accosted and asked for money. Most are harmless, we did encounter one scary character in the next street to the Hotel who was erratic in behaviour and threatened an innocent passer-by. The owners of the hotel will point out \"No Go\" areas for tourists. There are many eateries in Polk Street which runs along the next street. Would also recommend a top level room as lower levels can get noisy if upstairs guests move around a lot.", "title": "Good Value in view of Location", "helpfulness": 2, "user": "Biddleonia", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7285944}, {"rating": 4.0, "title": "Dreary Frisco weather, but fun time anyway", "text": "We picked this motel, because the Tripadvisor ratings were very high and the price was reasonable, especially the free parking. When we arrived, I was a bit disappointed as I'm used to staying in nicer hotels, and I was worried the noise would bother me, but once we were settled in, it was a very nice experience. The owners were extremely helpful and nice to offer directions, etc.", "user": "pasadenababy", "date": "April 3, 2007", "id": 7277750}, {"rating": 4.0, "title": "This hotel was a gem!", "text": "They also let friends visiting park in the lot for free which was great. The room was fine, very clean, with a nice little kitchen area incl a fridge and microwave. My only complaint would be the walls and ceiling are thin, so if you are on the first floor, you can hear people walking around above. Might want to ask for a second floor room. Otherwise, it's a nicer motel in a beautiful and fun city with lots to see and visit in walking distance.", "user": "Kat72895", "date": "March 31, 2007", "id": 7260949}, {"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "Let me start by saying that the couple that run the hotel are charming, helpful and welcoming. Free parking in San Francisco and a super neighborhood full of great shops and eateries. The room was superb. I will surely stay again.", "title": "Friendly staff and good rooms", "helpfulness": 1, "user": "WorldTraveller002", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7199720}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I expected something different from a motor inn, but this place was great. The rooms were very good and the staff very pleasant. For a budget priced inn it was excellent and was well placed in the city.", "title": "Nob Hill - Nice", "helpfulness": 1, "user": "RIKris", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7190047, "likes": {"liked": "— Price and cleanliness. Owners were very friendly and helpful", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Both Mona and the other woman manager made our long-anticipated family trip so much nicer. Both ladies went out of their way to provide helpful and practical suggestions from places to do laundry, to getting a transportation pass, to helping with directions and restaurant suggestions. Their suggestion of a local Italian place for my daughters 16th birthday ended up being the best meal we had the entire trip. The hotel was quiet, clean, very comfortable beds and spacious rooms. We wouldn't consider staying anyplace else on our next trip to San Francisco and have recommended it to friends already. While the hotel really is a great find with the free parking, access to nearly everything, it was the managers that made it special.", "title": "Best Hotel Managers", "helpfulness": 2, "user": "VABeekeeper", "date": "August 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5731427, "likes": {"liked": "— Friendliness and helpfulness of managers", "disliked": "— tight parking accomodations"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My family of 3 stayed at the Nob Hill motor inn for 2 nights ($119 per night, booked 6 months prior). The motel is very reasonable especially with parking included. I found this motel from excellent reviews I read here on Trip Advisors. The motel is very clean and if you can stay on the second floor, you will not hear the cars parking under the first floor rooms. Around the block is the 47 bus which is less than a 10 min ride to and from the wharf. The bus is $1.50 per adult and .50 per child. That amounts to a $7.00 round trip. That beats the cost of parking down at the wharf. Lombard street is also nearby. The people who work at the motel will great you with a smile and do all they can to direct you in any direction you wish to go. Anytime my travel plans take me to San Francisco I will stay at this wonderful motel. Thanks to all who made our stay extra special.", "title": "A terrific motel", "helpfulness": 1, "user": "arckac", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5728480, "likes": {"liked": "— Clean and safe location with parking included", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This place is the best! Great people who work at the hotel, they could not have been friendlier or more helpful. Not only did they help with places to go, how to get there, etc... they were very pleasant to talk with and they were interested in hearing about our experiences to share with other guests. The hotel is small and intimate and the suite we had was great for a family. Lots of room and privacy. Each of my teenage boys had their own queen size bed and a TV in their room. The rooms were clean and neat. The Continental breakfast had the greatest donuts we have ever had. The neighborhood was a great location. Lot's of places to eat near by, cafe's, shops, markets, and all the charm of SF. Free hotel parking as well. I would go back in a minute without even looking for an alternative. Thanks for a great time!", "title": "The Best", "helpfulness": 4, "user": "Proboscus", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5719009, "likes": {"liked": "— Friendly and helpful"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Nob Hill Motor Lodge is located on Pacific Avenue, just off Van Ness (one of the main streets). It's a small hotel with a courtyard inside. The rooms are located on the second and third floors and the parking is under the rooms, on the street level. The rooms were large, nicely furnished, and very clean. The location was perfect. The bus to downtown and Chinatown runs right down Pacific, and the bus to the wharf runs on Van Ness. Be sure to get a transfer and you're \"good to go\" for several hours. It was a quiet neighborhood. There was an expensive restaurant on the corner and a BMW repair shop across the street. The parking is included in the price of the room; parking spaces are a bit small, but okay. They have Coffee/juice/hot chocolate and sweet rolls or muffins for breakfast. There is also a fridge and microwave in the room. One thing I found odd was that the outlet in the bathroom was connected to the lightswitch, so a nitelight wouldn't work. Also the shower water temperature was \"set\" to warm and you couldn't adjust it. I would have preferred it a bit warmer, but it was okay. We would definately go there again if we were in the area.", "title": "A very nice place to stay", "helpfulness": 4, "user": "Saxeygirl", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5709662, "likes": {"liked": "— Large, clean room, good location, good price, quiet", "disliked": "— The just warm shower water and the bathroom outlet that was connected to the light switch"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "A good spot for our family of 4 including 2 teenagers. We had very a large room (large kitchen area with table, bedroom area with 2 queens and a sofa bed) at the back of the motel on the top floor - which unlike the previous reviewers room had a panoramic view over the city (not the courtyard) we could even see the top of the Golden Gate bridge though I believe we had the only room with this view. The decor was perhaps a little dated but all was clean. No problems with TV or phone and free wireless Internet was huge bonus for daughter who wanted to catch up with her friends back home. We found the location excellent for us, walking distance to most things and SF public transport is excellent. We avoided breakfast at the hotel completely and went to Polkers on Polk Street (as recommended by the staff) for superb breakfasts (pancakes, waffles etc etc etc you name it they do it), we also had an evening meal there which was also excellent and very good value.", "title": "Pleasant place to stay and a good location", "helpfulness": 4, "user": "yirg", "date": "August 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5617068, "likes": {"liked": "— Location, size, FREE wireless internet, FREE parking", "disliked": "— Parking spaces a bit tight if you have anything larger than minivan but parking is FREE!"}}, {"rating": 5.0, "title": "must stay here", "text": "This place was so great! The location was amazing and the free parking makes it even better. If you are looking for a nice place to stay for a really good price than look no farther. The people running the place act somewhat nice, they can be rude. It seems like they get asked the same questions over and over again and they have an attitude about it- who cares just don't rely on them. I suggest getting a muni pass before you come to SF b/c the inn will not help you get one. They will point you in the direction and if you ask them to repeat the directions then expect an attitude. Turn out of the inn and walk a few blocks to Hyde st. a trolley will take you down to the Wharf or up to chinatown/union sq. We used the trolley cars a lot. Be careful- they can get packed during certain times and will not have room for you. I felt like I had to write this review b/c I wanted everyone visiting SF to love it as much as we did. The location were we stayed I think had a lot to do with it. Tip- bring a coat, SF can get hot / cold throughout the day. Also, eat at Neptunes @ the wharf. SO GOOD!! Alcatraz is fun too!! There is a great pub down the road from the inn too. Friendly locals. major tip-- wear comfortable shoes!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 7, 2005", "id": 3447430}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Great price ($100), great location, free parking, clean room. If you do not expect more than a clean motel in the heart of SFO, then this is for you. If you want luxury and want to pay, stay somewhere else. One warning, walls are thin and people upstairs were loud getting ready in the morning. stay on the top floor if possible.", "title": "Good hotel in great location", "helpfulness": 4, "user": "ejsnyc", "date": "May 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3435948}, {"rating": 5.0, "title": "Great Location, Excellent Stay", "text": "This is a great motel, right on Polk St this is a fantastic location. I arrived somewhat jet lagged from an 11 hour flight from London, upon arrival my reservation was already expected and they quickly booked us in. I had been to SF before but we were given a brief overview of the city on a handy map, where to go and not to go.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 30, 2005", "id": 3427498}, {"rating": 5.0, "title": "Great bargain, great location", "text": "This was really handy, as I stayed on Geary St last time in the Tenderloin and as I remember its a bit shady down there, so it was cool to be told we could freely wander around the area with no worries.", "helpfulness": 8, "user": "dschick", "date": "April 26, 2005", "id": 3417321}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The Motor Inn is just on the corner of Polk & Pacific and has access to loads of great bars and restaurants within a few mins walk, the 19 bus takes you to the Wharf and you can pick up a cable car one block over on Jackson.", "title": "I nice comfy hotel in a good location at a great price.", "helpfulness": 7, "user": "Pradeepster", "date": "April 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3400088}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We found the staff at Nob Hill were very welcoming and friendly (despite having to wait up late for us due to a cancelled flight) They were extremely helpful giving us lots of local info, places to see (areas to avoid) etc.", "title": "The best hotel In San Francisco", "helpfulness": 3, "user": "Michelle_Branch", "date": "August 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5604787, "likes": {"liked": "— The friendly staff and the location"}}, {"rating": 5.0, "title": "\"I left my heart at the Nob Hill Motor Inn\"", "text": "Frank Sinatra wasn't kidding when he sang \"I left my heart in San Francisco.\" The city was beautiful and packed with countless places to visit, dine and shop -- it felt great to catch up on sleep after a busy day in the comforts of a well furnished and spacious room in a nice, central part of San Francisco. The Nob Hill Motor Inn was an excellent place to stay. The continental breakfast in the morning provided just enough to start the day off right. The FREE parking put my mind at ease when-- I kid you not-- I witnessed one meter maid hand out four tickets in the span of ten minutes. Parking is a hassle in San Francisco, even at hotels. Most places charge an arm and a leg for this seemingly simple amenity. It was nice knowing that I could spend the thirty to fifty dollars I saved on parking for dinner, souvenirs, etc. The free wireless internet was a wonderful little extra. As many before have said, the best part of this Inn is the superb service. As I parked my car and decided to tour San Francisco on foot and by way of public transport, Frank and Judy, the couple at the front desk, were more then helpful in helping me map out my day. In the end, I would definitely come here again and would advise other out-of-towners looking to truly enjoy all that San Francisco has to offer to do the same.", "helpfulness": 4, "user": "Katiebntn", "date": "August 2, 2006", "id": 5544060}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Stayed in the Nob Hill Motor Inn mid July for 3 nights. We loved this place. The owners are what make this place so special. When we checked in we were given a map of San Francisco and given advise on where the sights were, how to get about and where not to go (safety wise)! This was great for getting our bearings as we had never been to San Francisco before.", "title": "A little Gem.", "helpfulness": 2, "user": "Elainos", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5535710, "likes": {"liked": "— Owners", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Nob Hill Motor Inn is the place to stay when in San Francisco", "text": "Our room was most likely one of the smallest in the complex but was adequate for what we needed it for which was just to get our heads down at night cause there is so much to do in San Francisco.", "helpfulness": 3, "user": "gingabora", "date": "July 31, 2006", "id": 5530703}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "We had that room with the fridge and microwave in the bathroom but it didn't particulaly bother us. The room was a little dated but it was spotlessly clean and had all we needed in it with a comfy bed.", "title": "Perfect Location, Great Staff, Clean Rooms", "helpfulness": 5, "user": "Tlheimer13", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5513021, "likes": {"liked": "— Location, Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Thanks for your reviews", "text": "I just wanted to thank everyone who wrote reviews for the Nob Hill Motor Inn. It was exactly as other vistors had described, it was cheap, clean and above all good value in a town where that is hard to find. The room was small but clean, with a working tv and air conditioning. We had a room with a micro & fridge both of which allowed us to make our own breakfasts. The staff were friendly and helpful - above all it was good value and exactly what I expected. Thanks to Frank and Judy for the warm welcome and for all the precious advice about all the aspect of the city!", "user": "A TripAdvisor user", "date": "August 2, 2005", "id": 3730055}, {"rating": 5.0, "title": "Great deal for San Fran", "text": "The free parking it is a plus! Thanks everyone", "user": "cindyintexas", "date": "August 1, 2005", "id": 3728502}, {"rating": 5.0, "title": "Great choice", "text": "We found this hotel on tripadvisor, and the great reviews are correct.", "user": "MrFrump", "date": "August 1, 2005", "id": 3727118}, {"rating": 5.0, "title": "San Francisco's Best", "text": "The hotel is clean, the rooms are spacious, and the staff is so very helpful.", "user": "truax78", "date": "July 30, 2005", "id": 3722825}, {"rating": 4.0, "title": "Great Place", "text": "It is in a great location and you can easily walk to the bus stop or trolley.", "user": "GUJJJ", "date": "July 29, 2005", "id": 3721603}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Well, first off, i would like to thank all the previous tripadvisor reviewers. I booked this place for 2 nights based on all the positive reviews from this site. We were very satisfied. Upon check in, we were greated by a very friendly and helpful receptionist. She immediately gave us a map of the city and told us where to and not to go. She also booked us a City Tour trip of the city for the following morning. The rooms were nothing fancy, but very clean and adequate. Another plus is the free parking, inside and under cover. That definately made us feel more comfortable there. The location of the hotel is actually on Russian Hill, right off Polk St. There is a wide variety of restaurants, bars, clubs, stores and businesses very close and within walking distance of the hotel. We actually walked all over the place, its a very nice city. Fisherman's Wharf is a nice little walk downhill. During the weekdays, they offer coffee and pastries in the front office. If you need internet access, they do offer it, but since i didn't have a pc with me, there was a Kinko's about a block down the street where you can get very inexpensive Internet access, if you need to check your email, make a reservation or print out your flight boarding passes... All in all, a wonderful clean and convenient little place to stay in a nice part of town. If we come back to San Fran in the future, we will definately stay here again plus I will mention it to others!!!", "title": "Very Clean & Convenient", "helpfulness": 3, "user": "mainetoday", "date": "September 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5892678, "likes": {"liked": "— Helpfulness of Staff, Clean, Convenient Location, Great Price", "disliked": "— Book Well In Advance, They Tend To Book Up Really Quickly!!!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Location is good - central to the tourist areas in San Fran and easy to get to Bus and Cable Car service. We stayed March 15-18 2007.", "title": "Very Nice, Nothing Overly SPECIAL though", "helpfulness": 2, "user": "larrysing", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7189763, "likes": {"liked": "— location and was clean", "disliked": "— noise from upstairs guests"}}, {"rating": 5.0, "title": "good place to stay", "text": "If you book a stay - DO NOT STAY ON THE FIRST FLOOR. Take my advice and ask for a second floor room. As other travelers have warned about, the noise from the second floor guests above you is VERY LOUD and annoying. Sounds, literally, like a herd of elephants. We lost sleep because of the noise. Do not make this mistake or you will regret it.", "helpfulness": 1, "user": "pepper3989", "date": "March 16, 2007", "id": 7172848}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The rooms are not cavernous as some guests indicated - they are slightly above average; at least the double queen room we had was.", "title": "As advertised here - Clean, Comfortable, Good Location Feb 23-25", "user": "TorontoLLB", "date": "March 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 7147882, "likes": {"liked": "— Location, value, clean comfortable room", "disliked": "— Thin walls, not a large luxury hotel (but that was not the advertisement to be fair)"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "If you want the benefits of staying at a nice pampering Hotel, with amenities like a pool and sauna, live music and a restaurant, then this is not the choice. If you just want a clean place to park your luggage and sleep, then this is a nice selection.", "title": "Loved the Nob Hill Motor Inn", "helpfulness": 5, "user": "dstratt3", "date": "March 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6940647, "likes": {"liked": "— Great accomodations for the price!", "disliked": "— Parking was really tight as our rental vehicle was a large SUV and parking was difficult."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This is nice, clean, centrally located, and the free parking is great. But it's not a 3-star Hotel - maybe a medium 2-star at best.", "title": "Great find!", "helpfulness": 2, "user": "Rengrrl", "date": "March 2, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 6901174, "likes": {"liked": "— Location, price.", "disliked": "— No complaints."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My daughter and I visited San Francisco for her 18th Birthday/high school graduation. We were very pleased when we checked in with managers Judy & Frank. They truly make you feel special and a part of their family. We had lots of fun talking with them and they gave us excellent directions, good places to eat and where NOT to go. We felt very comfortable and safe at this hotel. They give you a map and tell you everything you need to know. I also loved the idea of parking without having to pay an exuberant fee...what a plus!!! I think one and all would feel comfortable staying at this hotel. Transportation is no further than 3 blocks away for the Cable Cars!!!", "title": "Fantastic", "helpfulness": 6, "user": "heat0614", "date": "June 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5405696}, {"rating": 4.0, "title": "Hidden Gem!!!!", "text": "Our two-night stay in San Francisco could not have been better. The Nob Hill Motor Inn is", "helpfulness": 11, "user": "fleur11", "date": "June 25, 2006", "id": 5381287}, {"rating": 4.0, "title": "Value for money", "text": "not a big chain hotel like the Hilton or Hyatt, but rather a quiet little inn with a family-run atmosphere. Our room was clean, up-to-date. Staff was unendingly helpful in assisting us with our itinerary in seeing the city. And don't overlook the free parking-- other hotels charge $40-50/day-- this was a bargain!!!! If you don't mind walking a short distance to catching public transport or just walking period, this is a great place to stay. Highly recommend!!!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 23, 2006", "id": 5375987}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We arrived at the Nob Hill Motor Inn after a ten and a half hour flight, a one hour wait at immigration and a one hour wait to collect our car - we were pretty darned tired!! Upon arrival (and it was really easy to find), the managers of the place were very friendly and efficient. They provided us with a map of San Francisco and blocked off the \"no go\" areas so we wouldn't stumble into trouble.", "title": "Great Base for tourists", "helpfulness": 8, "user": "Meryl H", "date": "June 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5359790}, {"rating": 5.0, "title": "Excellent - Wonderful Customer Service", "text": "Our room was fairly large but very dark and a little dated. The rooms have a \"kitchen area\" with a microwave, basin and refrigerator which was great.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5279718}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Spent three nights at the Nob Hill Motor Inn and was very pleased.", "title": "Glad I stayed at nob hill", "helpfulness": 9, "user": "jpgNewYork_NY", "date": "March 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4733213}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The price and free parking cant be beat. The hotel was very clean, quiet, comfortable and located in a safe neighborhood.", "title": "Listen to Trip Advisor!!!!", "helpfulness": 8, "user": "ynotvolley", "date": "March 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4732888}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Had no problem getting around. Bought a three-day Muni pass and was able to travel as much as we wanted. The hotel is close to a cable car stop and several bus-stops.", "title": "Best Deal", "helpfulness": 11, "user": "Mom L", "date": "March 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4690221}, {"rating": 5.0, "title": "Gets Top Marks from us", "text": "The inn-keepers are friendly and helpful. They provide guests with a map of places to go and not to go. Our one complaint was a dinner recommendation. After requesting an idea for dinner at the Wharf, we were told to try a restaurant called 9 Fisherman's Grotto. We're sorry we took the advice. It was absolutely horrendous... possibly the worst meal we've ever had.", "helpfulness": 13, "user": "EireMan66", "date": "March 17, 2006", "id": 4628837}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Other than that, a very pleasant stay. It's not five-star... but it's clean, safe and affordable. Would stay there again.", "title": "awesome find.....thanks tripadvisor", "helpfulness": 22, "user": "loveSFO", "date": "March 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4599598}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at the Nob Hill Motor Inn for 8 days, and were very pleased with the accommodation and services, and the location. We were in room 224 on the top floor -- the northeast corner -- and found it comfortable, spacious and quiet; we didn't encounter any of the mould issues reported in other reviews, nor were we troubled by noise from the street or elsewhere in the property. The bed was comfortable, the daily cleaning thoroughly adequate if not stellar (there were cobwebs in a couple corners of the room, but the bathroom was spotless every day), and the fridge and microwave were very convenient. One of the huge strengths of this property (note that the signage reads \"Nob Hill Motel\") is its location: it's extremely convenient to Van Ness Avenue and boutitque-y Polk Street, and to the California Street cable car terminus. It's situated in a primarily residential area -- we felt as though we were living in a neighbourhood rather than \"hotel row\" or a business district, which was a huge plus and gave us a much better feel for the city. We found plenty of nearby places to eat cheaply (check out Nick's Crispy Tacos, Polk @ Broadway, and The Crepe House, Polk @ Washington). No question, we'd stay here again.", "title": "Would return in a second!", "helpfulness": 8, "user": "alphabetkid", "date": "September 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3900232}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We spent 7 days here during our visit to San Francisco for our 25th wedding anniversary vacation. Tucked away from the hustle and bustle of the tourist spots yet minutes to anywhere you want to go, the Nob Hill Motor Inn is THE place to stay in SF. 1/2 block to Van Ness Blvd where the buses run to everywhere and 1 block to Hyde for cable cars, this Inn is a great choice. Clean rooms, quiet (even though you hear the noise of the road but that is hard to avoid in the city), basic housekeeping every day, nice hot shower, fridge and cofee maker, FREE parking if you rent a car which we did for 2 days. What else can we say? A/C and Heat work fine and comfy bed. FREE wireless internet too! Thanks to Nob Hill Motor Inn for making our stay hastle free and great! Highly recommended! AAA+", "title": "25th Anniversary stay! Great Location and room!", "helpfulness": 5, "user": "Kipkay", "date": "September 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3895291}, {"rating": 5.0, "title": "Very clean and affordable", "text": "We stayed in this hotel over Labor day weekend and I have to say it was the cleanest, quietest hotel I've ever been in! We were very impressed. They have good coffee in the rooms and hot water/tea in the lobby. The only slight issue we had was that they should not advertise a contenental breakfast....it really is just coffee and tea. However, there are so many great restaurants around, you don't need breakfast at the hotel. For the great price, I would definitely stay there again.", "helpfulness": 2, "user": "banina", "date": "September 7, 2005", "id": 3880058}, {"rating": 3.0, "title": "Clean room, good value", "text": "Other reviewers raved about this place especially for the value so I booked 4 nights here. It is a good value I must admit, but I also wasn't in my hotel room a whole lot. My room looked like it was just recently renovated. It was nice and clean. Like the previous reviewer, it was very damp. The owners told me they had some water damage and they actually had to re-carpet my room while I was there. It proved to be a minor inconvenience. Also, the place is fairly noisy. There is free parking, but the all the cars park below the rooms. So, you can hear families, kids, doors slamming, and even cars starting in your room. The walls proved to be pretty thin too. The free wireless internet worked well and the room has all major amenities. Management was nice and pleasant. The location is good. Close to California 1 bus-line and the Cable Car. Close to Polk St. shops and restaraunts. If you're looking for basically a clean room and a bed to crash while travelling in SF this a decent choice. I'd probably stay here again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 3, 2005", "id": 3840400}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Our family stayed her for 2 nights and found the accomodations quite spacious for a motor inn. The room was very clean and the area was ideal for visiting San Francisco. The free parking is an added plus, if somewhat a bit tight. The breakfast was served in the reception area-no tables but you could take it to your room or on the road. The standard donuts, muffins,etc. No tea, but there was coffee and hot cocoa. All in all, we were pleased with our stay here.", "title": "A Perfect Spot!", "helpfulness": 6, "user": "PepperNewJersey", "date": "September 2, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "value": 5.0}, "id": 3839008}, {"rating": 5.0, "title": "Great location, service, parking", "text": "Frank and Judy were extremely helpful with maps and directions and were available if we had any questions.", "helpfulness": 13, "user": "Hjordes", "date": "September 10, 2006", "id": 5787911}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "If you are a traveler who expects the type of accommodations offered by a 5 star hotel, you should not stay here. This is a place that is appreciated for it's moderate price, comfortable, clean rooms and really nice staff. When you are visiting San Francisco as a tourist or even visiting family, you're certainly NOT spending much time in your room anyway! The parking may be tight, but the price is certainly right!", "title": "Countless Positives", "helpfulness": 12, "user": "JaredL", "date": "September 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5777161}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "I would definitely stay here again.", "title": "Walkers best friend", "helpfulness": 6, "user": "DerLo", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5772445}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I expected less from a hotel in the city, and was pleasantly surprised. The room was quiet enough to actually get some sleep! The free parking is a bargain - no in/out charges, though I suggest a compact car as the spaces are tight. The room was clean & comfortable, with plenty of storage & drawer space. The microwave & small refrigerator worked well.", "title": "Great location but disappointed with accommodation", "helpfulness": 6, "user": "tourist_102", "date": "September 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5766017, "likes": {"liked": "— Location ie close to Fisherman's Wharf, etc", "disliked": "— quality of room, beds and set up ie rooms over the parking area"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "After much searching and planning on where to stay in San Francisco, we decided to try the Nob Hill Motor Inn. What a lovely surprise. The owners are delightful, and quite eager to make sure you have a great stay. We got an incredible internet price of $60 per night (unheard of in SF), including parking, mini-fridge in the room for all our leftovers, and doughnuts and juice in the morning. Starbucks and Peets Coffee are down the block, a great Chinese restaurant is right around the corner, as well as a wine and cheese store for a snack in the room. Yes, the rooms are a bit outdated, and the pillows very uncomfortable (huge), but we would definitely stay there again.", "title": "Great spot to stay", "helpfulness": 3, "user": "cin1754", "date": "February 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6833110}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I stayed with my partner at the Nob Hill Motor Inn for 9 days. It is a great place where to stay for vacation: it's near the cable car and the bus stop, in a quite area (even during the night). Our room was big and clean, with a microwave and a fridge. The breakfast is not fantastic but it's a good beginning for the day and near the motel you can find a lot of places for drinking a good coffee. The staff (Frank and his wife) is very helpfull and very kind. I would reccomend this motel for sure also for its price. Enjoy the city!", "title": "Great experience", "helpfulness": 4, "user": "MC78", "date": "February 13, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 6784683}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My husband and I stayed in the Nob Hill Motor Inn for four nights in June 2006. The location was perfect, with a cable car stop right up the street. The rooms were large, and it was very quiet at night. The only problem with the room was the shower...it was the worst water pressure. The people at the front desk were extremely nice and helpful, the gave me directions to almost everywhere! They even helped us find an alternative route to our next stop, Yosemite, when we found out that a rockslide closed a major entrance into the Park. I will stay here again. I highly recommend it!!", "title": "Wonderful place to stay", "helpfulness": 4, "user": "JennM874", "date": "February 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6757302}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I got this hotel through Hotwire.com and the surprise couldn't be any better. we payed 54 USD plus taxes for a very spacious and comfortable room.", "title": "Excellent choice !", "helpfulness": 2, "user": "plexon", "date": "February 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6731142, "likes": {"liked": "— size and cleanliness of rooms", "disliked": "— coffee"}}, {"rating": 5.0, "title": "Excellent Location", "text": "The location is really very good, the staff very friendly.", "helpfulness": 3, "user": "Kladybug", "date": "January 29, 2007", "id": 6713419}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "A continental breakfast was available in the morning. and the kids really enjoyed the hot chocalate! Free parking was a big plus as well.", "title": "Wonderful hotel would thoroughly recommend! ", "helpfulness": 3, "user": "SueG1", "date": "June 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3529113}, {"rating": 5.0, "title": "Nice place, friendly staff, free parking", "text": "The Nob Hill Motor Inn is a wonderful place to stay and a great value as well. We coudn't have had a better start to our vacation!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 3, 2005", "id": 3523550}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We stayed here for 3 nights in October 2006.", "title": "Great place in San Francisco", "helpfulness": 3, "user": "stummy", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6180708, "likes": {"liked": "— The location", "disliked": "— The limited space for breakfast!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This hotel is located between Pacific and Van Ness. A small hotel with 2 floors and has free parking. Good value for money. Close to Fisherman's Wharf and China Town", "title": "value for money - couple from Galway, Ireland", "helpfulness": 2, "user": "jgoldenoldie", "date": "November 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6153289, "likes": {"liked": "— value for money", "disliked": "— very small foyer area"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Friendly staff. Sangita with the helpful tips on places to go, eat. and shop. This made our stay in San Francisco a lot easier.", "title": "Nightmare experience", "helpfulness": 13, "user": "renee610", "date": "November 19, 2006", "detail_rating": {"value": 1.0}, "id": 6152673}, {"rating": 5.0, "title": "Nob Hill exceeds expectations!", "text": "The room includes a basic breakfast of tea/cofee, danish pastries, fruit (apple and banana) and juice.", "helpfulness": 3, "user": "wsflyer", "date": "November 16, 2006", "id": 6137957}, {"rating": 5.0, "title": "Fantastic, great motel, nice neighbourhood. Perfect and a bargain price too", "text": "They also have free wireless internet connection.", "user": "Bearable1", "date": "November 13, 2006", "id": 6122467}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Stayed at this hotel after reading the good reviews on this board. I was particularly attracted to the hotel because of the free parking since we'd have a rented vehicle.", "title": "A Great Find", "helpfulness": 4, "user": "Richland34", "date": "June 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7990296, "likes": {"liked": "— Location, cleanliness", "disliked": "— Tight parking"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel was indeed spotlessly clean and was within reasonable walking distance of some attractions. We walked to Chinatown for dinner (about 45 minutes) and also to Fisherman's Wharf (about 30 minutes). Neither walk was overwhelming, but a bit hilly.", "title": "Not worth the money!", "helpfulness": 5, "user": "aus23", "date": "June 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 7859449, "likes": {"liked": "— Nothing", "disliked": "— Security and noise"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "As other readers have noted there are numerous places to eat very close to the hotel. We enjoyed the Italian restaurant (Milano, I think) where they make homemade pasta daily. I also visited the Indian restaurant where they have a tasty buffet for lunch and dinner at a VERY reasonable $8.95.", "title": "Great location! Wonderful motel!", "user": "delia6110", "date": "June 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7845083, "likes": {"liked": "— great rooms!", "disliked": "— tight parking spaces, but free!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Breakfast was simple but as expected. Overall, no complaints and would stay at Nob HIll again.", "title": "Great motel in excellent neighbourhood", "helpfulness": 3, "user": "AmsterdamBokkie", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7720166, "likes": {"liked": "— location, friendly owners, price", "disliked": "— size room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The picture of the room on booking websites as compared to what you get are very misleading. The actual room is pretty small and doesn't have couches. We booked a Superior King but I'm not sure if thats what we got. We stayed there 3 nights and after the first night had to move rooms for reasons unkown. The first night we were on the bottom floor and the noise from above was terrible. Every footstep upstairs could be clearly heard and made sleeping difficult. Especially since the people up there decided 5am was a good time to start stomping around. Moving rooms was very inconvenient.", "title": "Spotless & honest mom-and-pop motor inn in a classic central neighbourhood", "helpfulness": 3, "user": "NW_Raven", "date": "May 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7693485, "likes": {"liked": "— Location, security, value", "disliked": "— Noisy air con unit"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed 3 nights at this motel. Huge room with very comfortable bed and lovely bathroom. Very clean. Owners couldn't have been more helpful with info on where to go and not to go. Breakfast included with lots of fruit as well as pastries, orange juice, chocolate and coffee. Safe parking too. Central location made it easy to visit all the sites but it was quiet at night. Would definitely recommend and go back.", "title": "Great motel", "helpfulness": 3, "user": "peacefulhols", "date": "May 15, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 7624745, "likes": {"liked": "— location, parking", "disliked": "— No views not that we needed them"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "WOW, looks plain on the outside but when you get inside this place is great. Large comfortable very clean rooms, great bed, and free secure parking. Easy access to public transportation, which was good enough we didn't move the car for three days. The wife and I spent three nights here seeing the sights in San Francisco and this was the perfect place. Staff was more than helpful, sort of like staying in a B&B. All the great reviews are true!", "title": "Great Place, Great location", "helpfulness": 3, "user": "Moonhole", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7607738, "likes": {"liked": "— Great bed and free parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The Nob Hill motor inn was an excellent place to stay for the price paid.", "title": "Great value for money", "helpfulness": 1, "user": "loopylady", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7581153, "likes": {"liked": "— Free internet, big room, comfortable bed", "disliked": "— Traffic noise"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We had 5 nights in Feb 2007 and we were so glad of the spacious room (217) because it rained solidly for the whole time we visited SF! It meant that we had a good base to return to when the rain was at its worst.", "title": "OK hotel in good location", "helpfulness": 6, "user": "AussieDingo", "date": "May 4, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 7544505, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Nice Hotel, Great City", "text": "We found that our room was clean and well maintained with a very comfortable king bed and kitchenette, small dining table and large TV.", "helpfulness": 1, "user": "jamesyp1976", "date": "May 1, 2007", "id": 7489180}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "compared to the worn-down places in lombard st., this is a good pick worth the money. i will definitely come back!", "title": "Real value for money", "helpfulness": 5, "user": "Dave C", "date": "June 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3516478}, {"rating": 5.0, "title": "Helpful, clean, and a place to park", "text": "We stayed here for 3 nights in May and can highly recommend this motel to people who want a central base from which to explore SF. Okay - so this motel doesn't have all the fancy amenities of a posh hotel - but who cares. The rooms have been recently refurbished and were comfortable and clean. The 2 owners were particularly helpful, including giving us clear instructions on which areas of SF were safe and which were not, providing us with a map and showing us which places to see during our time in SF. Breakfast was just pastries and coffee which we skipped and instead found ample places on Polk Street instead. The other reviews talk about how conveniently located this motel is - believe them it really is. We bought a 3 day muni pass at SF International Airport and really got our money's worth. Not only do the no. 12 and no. 19 buses run from outside the hotel, but also the no. 47 and 49 run on Van Ness which we used to get to and from Fisherman's Wharf. The cable car is literally a block and a half away. SF's public transport system is excellent and we didn't take the car out of the garage for the 3 days we were there. Parking is tight but not impossible if you have a large car. A real gem of a motel in the heart of SF.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 1, 2005", "id": 3515731}, {"rating": 5.0, "title": "Great hotel , very fine managers , lovely area: a gem in San Fran", "text": "We checked several sites for a place to stay in San Francisco for our one-year anniversary and the Nob Hill Motor Inn was rated pretty high. We were not disappointed.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 27, 2005", "id": 3503672}, {"rating": 4.0, "title": "Unbeatable Value, Great Neighborhood", "text": "We had a rental car, so the parking was a definite bonus. The spaces are a bit small, but so are the spaces on the streets of San Francisco. Close to the bus line, cable car line and easy to get from place to place.", "helpfulness": 3, "user": "saturnfreedom", "date": "May 24, 2005", "id": 3497838}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Rooms are very nice and clean.", "title": "Cute Hotel, Spacious Rooms, Safe Area, Inexpensive", "helpfulness": 10, "user": "Truman18", "date": "May 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3475800}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I cannot believe some of the reviews I just read. I will agree that the Nob Hill Motor Inn had very clean rooms and was located in a safe neighborhood, but I found the owner to be the most unfriendly person in the entire world. When my husband asked him for directions, he replied, \"Didn't I give you a map of the city?\" When we checked out, there was no \"thank you\", \"did you enjoy your stay\", or \"come back again\". Nothing!! The parking spaces are EXTREMELY tiny, and we had a problem pulling in and out everyday. The cars are parked so close together that we had trouble just getting out of the car after parking it. What a hassle. The room was very dark, plus our microwave & refrigerator were located in the bathroom. Very strange. The complimentary \"continental breakfast\" is the absolutely the worst I have ever seen. Everyday there were the same donuts, muffins, and packaged danish pastries. Instant coffee, oj, and hot water for tea/hot chocolate were our beverage choices. Nothing else. Plus, they advertise that they are in walking distance to SF attractions. Well, that is completely untrue. They are in walking distance to bus stops and one cable car stop that takes you to the attractions. There are no attractions anywhere near the Nob Hill Motor Inn. I guess you get what you pay for. I was \"penny wise and dollar foolish\".", "title": "I must have been in a different motel.", "helpfulness": 4, "user": "Judee512", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 5495255, "likes": {"liked": "— cleanliness", "disliked": "— poor attitude of owner"}}, {"rating": 4.0, "title": "great place to stay", "text": "My wife and I stayed here for 3 nights 7th to 9th July. The hotel is easy to find, great location, super rooms, great free continental breakfast, and Frank & Judy (the owners) & the new girl(can't remember her name..sorry) were tremendously helpful. They put us right for public transport (buy a 3 day pass) restaurants, tours, areas best avoided at night etc.They could not have been more helpful! We chose this hotel by using trip advisor and it was worth the research. I would recomend this hotel to anyone.", "helpfulness": 5, "user": "wrensnestred", "date": "July 19, 2006", "id": 5487529}, {"rating": 4.0, "title": "Great Location!", "text": "My husband & I visited San Francisco for the first time June 24-28th. I picked Nob Hill Motor Inn due to the great reviews from this site. I also like the idea of free parking. We had no problems checking in with Frank. He gave us a map of San Francisco & marked off the areas to stay away from. We would visit him daily for directions outside the city or to grab the appropriate bus line.", "helpfulness": 5, "user": "k_hunter23", "date": "July 9, 2006", "id": 5441938}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The hotel isn't fancy by any means. But...the rooms are large & very clean. The mini fridge is a plus too! The only fuss we had about the hotel was the showers. It would either freeze us out or the water would be way too hot. Everything else about this hotel was wonderful! It is in a great location. There are several places to eat along Polk street, which is a block away. It's about a 20 minute walk to Chinatown.", "title": "Great Location & Great Staff!", "helpfulness": 9, "user": "Lissete", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5435066}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "A couple of tips...Bring comfortable shoes and buy a Muni pass to take public transportation. We rented a car for our trips outside San Francisco, like Muir Woods (highly recommend this!) and Sonoma. The car stayed parked the rest of the time while we took the Muni. Don't let your trip go by without visiting Alcatraz. We used the Blue & Gold Fleet tours, which let us on the island. Some of the other tours just boat around the island. Go to a Giant's game! The ballpark is beautiful.", "title": "Great Location", "helpfulness": 9, "user": "Blind-Willie", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5412388}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We like many others were attracted by the free parking. We have a Toyota Sienna, and did not find parking too tight. The hosts are fantastic - very personable and helpful. This is a great location, close to bus routes, attractions and cable cars. The bathroom had an odd odor, but I suspect this is because the building is quite old. The rooms are very clean and have a very small microwave and fridge. There are donuts & coffee in the office - find breakfast elsewhere or make your own. There is a little market a couple of blocks away and a deli on the corner.", "title": "What a Find!", "helpfulness": 2, "user": "katie61", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8268657, "likes": {"liked": "— Clean, free parking, location", "disliked": "— Musty bathroom smell"}}, {"rating": 5.0, "title": "Great Place, Great Hosts", "text": "This is a great little motel with very helpful, personable hosts in the office. They tirelessly help guest after guest find their way in the city, doling out advice, marking good spots on the map, showing where NOT to go after dark, insider tips (like where to get 3 day transit passes to save $), and generally helping out any way they can.", "helpfulness": 2, "user": "ConnecticutMrK", "date": "July 28, 2007", "id": 8249928}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The rooms are clean and above average. And the free parking in the courtyard on the first floor is very convenient for those driving or renting a car. It's also relatively quiet as city hotels go.", "title": "Good place if you like hard beds", "helpfulness": 2, "user": "BucketAustin", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8249157, "likes": {"liked": "— Free parking", "disliked": "— The bed"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "We can't recommend it highly enough. Loved our stay and would come back.", "title": "Do Not Stay Here!! These People Only Care About Your Money!!!", "helpfulness": 7, "user": "BushwoodGopher", "date": "July 20, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 8205669, "likes": {"liked": "— Absolutely nothing", "disliked": "— The fact that I was left out in the cold like a homeless person."}}, {"rating": 5.0, "title": "Great Place/Great Hosts", "text": "We stayed here after reading tripadvisor reviews. We liked the idea of free parking, didn't want to be near Union Square, and didn't want to spend a lot of money. The location is good, just off Van Ness, with busses close by, and cable cars within a few blocks. Everything was indeed very clean. Parking was tight, so we rented a very small car and had no problems. Don't depend on the continental breakfast - it was just a few rolls in plastic. The room was outdated, but would have been OK, except for the bed. Rock hard. Now, we knew we weren't staying in a luxury hotel, so our expectations weren't high, but there is really no excuse for a bad bed. The room was noisy, as people mention - try to get on the 2nd floor - we had one of those heavy walkers above us. I might stay here again, if I was renting a car, because other hotels charge 38-40 a day, but only if I knew they had upgraded the beds. A backache isn't worth it.", "helpfulness": 2, "user": "mitravelerMichigan", "date": "July 1, 2007", "id": 8035952}, {"rating": 4.0, "title": "A great little hotel", "text": "We stayed at the Nob Hill Motel for three days at the beginning of October 06, It was a well presented and very clean hotel set in a very good location, this enabled easy access to all the sites you would usually visit in San Fransisco, They have free covered Parking beneath the rooms which is watched by close circuit TV so your car will be safe whilst you stay. The Hotel is run by a very friendly couple who will give you all the advise you need to enjoy a perfect stay which will include where the best places to eat and drink are located, how to safely get to all the tourist destinations and will even tell you where to avoid to stay safe, they really are friendly hosts and nothing is to much trouble for them.", "helpfulness": 2, "user": "m0z", "date": "October 18, 2006", "id": 5968640}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The room we stayed in was well equiped and spottlessly clean but was a little cramped when you need to be living out of two suitcases as we were when we toured california, although they do have larger rooms and I would recommend reserving one of these if you are to stop longer than one night.", "title": "Quite a Find!", "helpfulness": 3, "user": "VE1LUV", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5967863, "likes": {"liked": "— Location and cleanliness", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I would not hesitate to return to the Nob Hill Hotel if I was to return to San fransisco.", "title": "Bait and Switch, terrible breakfast, thin walls, good location", "helpfulness": 5, "user": "PkDut", "date": "October 16, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5960751, "likes": {"liked": "— Location", "disliked": "— Bold Faced Lies"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "My husband and I just recently returned from a 7 night stay at the Nob Hill Motor Inn. We read all the reviews on Tripadvisor and still were a little nervous as to our choice.", "title": "Great family hotel", "helpfulness": 3, "user": "AussieNSW", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5959461}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "We needn't have been. What a terrific place to stay! We had a room with king size bed, microwave, frig, coffee maker - it was perfect. Very clean. The hotel is within walking distance of the cable cars and the MUNI, which we used as our mode of transportation because we didn't rent a car. (We bought 7 day MUNI passes which I highly recommend - what a bargain.)", "title": "Great Location", "user": "angliss", "date": "October 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5954881, "likes": {"liked": "— location", "disliked": "— open walkways to rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My husband and I stayed at this hotel for 2 nights having read the great reviews on this website. We were certainly not disappointed. On arrival we were checked in efficiently by the husband and wife team who run the hotel - there was an instant friendly atmosphere to the hotel. We were given a detailed map of the area with commentary of where to go and where not to go. We were given tips on how to get around the city - all this helped us to make the most of the 2 days that we had in the city. The room was basic, clean and the bed was really comfortable. The hotel was centrally located to easily get on the cable cars which could take you to the main shopping, eating and sightseeing areas within about 10 minutes.", "title": "Amazingly helpful owners....", "helpfulness": 2, "user": "iloveholidaylots", "date": "December 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6321539, "likes": {"liked": "— The service from the owners", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "There was a self serve breakfast each morning with muffins, fruit, cake, juice, coffee etc which could be taken to room or eaten on the go.", "title": "Great Stay", "helpfulness": 6, "user": "KiwiPilot", "date": "December 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6316581, "likes": {"liked": "— location, price, friendly service, parking, internet service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "On our final day we had trouble with our satallite navigation system and the owners of the hotel were SO helpful, even going to the extent of lending us their laptop so we could get it working. We were in their reception area for a couple of hours and never once felt that we were in the way. A massive thank you to them for their help.", "title": "Thanksgiving", "helpfulness": 1, "user": "coffeemonster", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6314206, "likes": {"liked": "— value and service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Nob Hill Motor Inn is in a great location.", "title": "Great friendly place to stay", "helpfulness": 3, "user": "traveller1079", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6308711}, {"rating": 5.0, "title": "what a find", "text": "Only 2 minutes walk to Van Ness Avenue bus stops, it is handy for the #47 Muni bus, which takes you to Fisherman's Wharf, Market Street, or the City, as well as linking you other major transport routes.", "helpfulness": 1, "user": "garythestokefan", "date": "November 28, 2006", "id": 6185835}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Just came back from a week long trip to California, spent the first three nights at the Nob Hill. If there's any better value in the city someone needs to let the world know. We checked in very late (early morning) no problem there was someone waiting for us. The rooms are clean, large albeit the walls are a bit thin but who cares we were so tired from walking and riding the cable cars. The owners took the time to point out the places to go and more importantly the places and times where not to go. The hotel is close to restaurants, Pete's for breakfast every morning, the cable cars are a short walk away or you could take a leisurely stroll downhill to the waterfront like we did the first day. Take the boat ride out under the Golden Gate and around Alcatraz best $10 we spent. We had a great time, loved the city and can't wait to go back and I know where we'll be staying.", "title": "perfect spot", "helpfulness": 5, "user": "visitorToronto", "date": "May 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5042387}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The owners are wonderfully helpful - giving us a cheery check-in along with very helpful hints of where to go/what to do in San Fran.", "title": "Friendly hotel in a friendly neighbourhood", "helpfulness": 3, "user": "DeeBee007", "date": "May 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5035337}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Our room was large, well equipped and very, very clean. We had a room at the front and as a result there was a little noise from the street (a minor complaint that in no way detracted from the stay). easily remedied as next time I will ask for a room away from the front.", "title": "Friendly, helpful management", "helpfulness": 3, "user": "JEM11", "date": "April 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5017909}, {"rating": 5.0, "title": "The Only Place to Stay in San Francisco", "text": "I've stayed in SF a few times before and always booked hotels downtown (around Union Sq.). Never again - this location has it all - except the menacing feel at night. The neighbourhood is great - vibrant local community with good choice of shops, bars and restaurants. Well served by bus routes and close to trams - which really opens up the whole city.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 26, 2006", "id": 5012136}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Overall a well run, wonderfully manitained hotel in a superb location.", "title": "Loved the Nob Hill", "helpfulness": 7, "user": "TripGal27", "date": "April 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4996090}, {"rating": 5.0, "title": "Loved the Motor Inn", "text": "Stayed at the Nob Hill Motor Inn at 1630 Pacific. It was perfect, free parking there at the hotel. If you drive you can park your car right there, off the street, lighted, SAFE. the owners are always there. They will help you get around as soon as you get there. they gave me a map. They will help you with anything you can think of. They told me what bus to catch and where. refrigerators in rooms and microwave. Request a third floor the noise travels through the floors. I could hear the people above me, but that was the only thing I would change. I will stay here again my next visit.", "user": "tungstennc", "date": "November 13, 2006", "id": 6120960}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "After having a great hotel stay in Puerto Rico based on what I read on TripAdvisor.com, I decided to find a hotel in San Francisco based on customer reviews. This hotel lived up to its great reviews! My boyfriend and I call it \"A hidden treasure\" in San Francisco - Nob Hill. The room was spacious and clean. The bed was comfortable. The parking was a little tight, but it was free and secure. The staff was very friendly and helpful. The location was great and close to the sites! The rate was very reasonable. We were able to park our car and walk and/or take public transportation to the sites. It was quiet too! I would definitely stay here again.", "title": "I loved my stay at Nob Hill Motor Inn", "helpfulness": 2, "user": "amannva", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6106638, "likes": {"liked": "— The location, the room, the free parking", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We started our trip in San Francisco, and after reading good reviews we went for it and booked it before we went. The good part of this hotel is the parking. We left our car there for the entire 3 days we were there. It is central, so good for most things. Easy walking to cable cars, buses, etc. so you can get to everywhere from here. The people who run it were so friendly, giving us advice where to go and, more importantly, where not to go! The room was clean, comfortable and quiet. It had everything in it you needed. Tea/Coffee, TV, fridge and even a Microwave. Information in the guest book was really good too. Buy the MUNI passes, which save you money as a trip on the cable cars are $5 each way. There's a good wine shop called Jugs on the next street, opposite a very nice delicatessen.", "title": "Brilliant Hotel, quiet, convenient, friendly", "helpfulness": 1, "user": "T.Read", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6033563, "likes": {"liked": "— Location, Friendliness, parking", "disliked": "— Not much really."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As we were ending our trip a couple of weeks later back in San Francisco, we liked the motel so much we booked for our final night before we flew back to England. So I can say it was an ideal hotel for us.", "title": "Would Stay There Again In A Heart Beat", "user": "gracie59", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 6024568, "likes": {"liked": "— the great room with free parking", "disliked": "— no onsite eating establishment"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed here this Labor Day weekend. (2006) We drove in from Illinois. It was such a joy to park the car - with no parking fees - and just use the city transportation.", "title": "Not bad at all", "user": "Ernest7", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6022450, "likes": {"liked": "— The people and the location"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2, "variance": {"poor": 30, "average": 64, "very good": 240, "terrible": 27, "excellent": 240}, "aka": "Nob Hill Motor Hotel", "slim_ranking": 0.527659574468, "description": "The Nob Hill Motor Inn is a wonderful hotel in the trendy and popular Nob Hill neighborhood of San Francisco. Our hotel is located in the heart of San Francisco, within walking distance of Fisherman's Wharf, the Cable Cars, \"Crookedest Street,\" Chinatown, and a number of fine restaurants and shops. FREE PARKING is available for all of our guests. Each room is spacious, newly renovated and appointed with convenient amenities such as mini-refrigerator and microwave, cable TV with HBO, and complimentary in-room coffee. All of our rooms and hallways are 100% non-smoking.The Nob Hill Motor Inn's newly renovated rooms include: FREE covered parking, 2 room family suites available, In-room microwave and fridge, FREE wireless Internet, FREE continental breakfast, 100% non-smoking rooms, Elevator access to all floors, Cable TV with HBO, Direct dial phones with dataport, Complimentary in-room coffee, Free tour pickup, Complimentary coffee, tea, juice and hot chocolate served all day in our lobby. The Nob Hill Motor Inn is an award winning member of AAA and the San Francisco Convention and Visitor's Bureau."}