{"user_rating": 4.0, "review_count": 499, "name": "Nora Beach Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed at the Nora Beach Resort for 10 nights in December and found it wonderful. When we first arrived, it was just after Bangkok airport reopened so the hotel was very quiet, only 40 people staying there when normally there would be 250 but we liked this, it was very peaceful. We stayed in a nora villa which was lovely, we liked the little courtyard with the outdoor shower. The room was always clean except we did have to be careful about leaving food or drinks on the bedside tables as it would create an ant problem (on the last day of our holiday they were doing a big bug spray). The pool was fantastic and the pool bar staff were extremely friendly. We didn't eat in the restaurant, instead going into cheweng or down the road for some cheaper food. There are only a couple of restaurants sort of down the road from the Nora but if you're after cheap Thai food then they're the places to go. The free shuttle into cheweng runs at 10:30 and 3, if you want to go in at night it costs 50 baht per person and runs at 5, 6 and 7 and i think maybe theres a later one. Speaking of costs into cheweng, most taxi drivers want 200 baht but you can get them down to 100, sometimes you have to give in and pay 150 but the trip really isnt that long, we walked it a couple of times. Just a word of warning, don't try and walk from Cheweng beach to the nora beach unless you're willing to get wet and walk on rocks, we thought it would be a pleasant walk but changed our minds just as we were nearing home, oh well it was worth the laugh!", "title": "Loved it! Didn't want to leave it!", "helpfulness": 1, "user": "Jacwi87", "date": "January 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23164447, "likes": {"liked": "— The pool and the pool staff, actually all of the staff!", "disliked": "— prices of food and drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "A bit off topic from the hotel, for first time visitors like us to Koh Samui, if you're trying to find cheweng beach, walk straight through from where the nora shuttle drops you off. That might sound silly but it took us 2 days to figure out how to actually get on to the beach, we met another couple who had been there 6 days and still couldnt find it. It really is a beautiful beach. Also, i can recommend the funny day safari tour, somewhere between thinking i was going to die driving through the mountain on an ex military jeep to having to buy things just to use a toilet at the big buddha, it was the funniest day of my life. The Ang thong marine park tour was a let down, probably due to a boatful of sea sick passengers (including myself) but the view was spectacular. Also, check out the lady boy cabaret show near the Combi van bar (you'll see the ladyboys promoting it), it's free you just have to buy you're drinks and it is the funniest thing, especially when they get guys from the audience up on stage, but i wont ruin it for you. it's starts around 10pm in Cheweng.", "title": "A must stay!!", "helpfulness": 1, "user": "amdonley", "date": "December 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22897704, "likes": {"liked": "— Beautiful room, great beach, pool, and food.", "disliked": "— we loved everything!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "My only critism of Nora would have to be the prices of food and drinks. Cocktails were 180-190 baht, 50% off in happy hour but you still had to pay the 17% service charge of the normal price so they ended up being about 115 Baht in happy hour (2-3pm at the pool bar, 6-7pm at the beach bar). Food was also very expensive, 250 Baht for light meals at the pool bar, for us that was about $12 as the exhange rate was so low. However, every day they had a lunch special by the pool which would cost 190 Baht, we had it once and it was very nice. One more thing, try hiring the kayak from the hotel and paddle out to the island you can see just off shore, take some baht with you because they have beers and drinks and stuff to sell, it's only a little shack but the people that run it live on the island and are goat farmers, it's a really nice little beach to relax on.", "title": "really is paradise", "helpfulness": 1, "user": "terrortots", "date": "November 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 22097650}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We visited here for our anniversary. The staff was very pleasant, always helpful, and so very polite. We had a villa with a private pool, but always found ourselves at the beach! The room was always spotlessly clean, and just beautiful. We liked that the beach was a short ride to town (5 minutes)- it seemed to be quieter for those who don't visit the clubs as frequently. The pool was also very clean, and the grounds were amazing. The staff also assisted us in booking a private car to tour the island for a full day, and recommended great restaurants in town (go to the Library!!!). The private car was the BEST way to see all of Koh Samui, and only cost about $60. We will most definitely go back to Nora Beach the next chance we get!!", "title": "Amazing - Perfect in Every way", "helpfulness": 5, "user": "mlhiscock", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21023222}, {"rating": 4.0, "title": "chill out zone", "text": "what a gorgeous resort, we had an ocean villa and it was beautiful and spacious the bathroom was bigger than most hotel rooms. your own private shower outside and a bath overlooking your little front garden was great. the view was superb. we had friends stay in the normal hotel buildings and these were very lovely as well. the ocean pool villas were magical, but with two young kids decided to stick with the ocean villa as pool had no fence and plus they were little on the beach.", "user": "ploughoxford", "date": "October 18, 2008", "id": 20977539}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We've stayed in this resort for 2 wonderful weeks in august 2008.", "title": "Charming resort, friendly staff, great restaurant by the sea", "helpfulness": 1, "user": "puishor", "date": "April 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27643725}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "It's located about 10 minutes walk from the Chaweng center, which is great, because it's quieter. Also the beach area is much nicer, as the main Chaweng beaches remained muddy when the sea retreated.", "title": "Absolutely loved every minute of it!!!", "user": "BudPepSoo", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27265087}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "If you don't feel like walking all the way to Chaweng, taxis are waiting in front of the hotel, but they are quite expensive. A cheaper solution would be taking one of the tuk-tuks that keep on passing by the hotel, or renting a car.", "title": "Lovely resort", "user": "Dmango", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27179982}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The room had everything we needed, was quite large, had a nice balcony.", "title": "exceptional service..", "user": "pye72", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27152716}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The staff was great, very helpful, cleaning service impeccable, room service a bit expensive. Security guards everywhere so you have nothing to worry about.", "title": "Best resort!!!", "helpfulness": 1, "user": "VancouverCanuk", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26598517}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Stayed a wonderful 9 nights at the Nora Beach and cannot wait to visit again.", "title": "Superb hotel, friendly staff and wonderful wedding", "user": "richt28", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25656344}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "A group of 10 of us stayed at the hotel for our wedding which was arranged by the wedding planner at the Nora Beach, Lloyd.", "title": "Wedding of my dreams", "helpfulness": 1, "user": "Spilks", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25400299}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel was wonderful. From the time we arrived we were made welcome from the very friendly staff and management. The reception area is a wonderful entrance to the hotel giving a real tropical feel to the hotel.", "title": "Very nice hotel", "user": "Alsidk", "date": "February 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24708424}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The rooms were all excellent, very well set out and furnished with all the facilities you would expect. If you needed something extra, like an iron and ironing board, they would quickly bring one to your room.", "title": "Best Location - Worst Evening Meals", "helpfulness": 3, "user": "dom07", "date": "January 13, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 23519539, "likes": {"liked": "— Nice Room and Gardens", "disliked": "— Food, chambermaids/managers laziness"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The grounds were very welcoming with trees and plant life everywhere with butterflies and birds regular visitors around the rooms and dragonflies around the pool.", "title": "Stay Somewhere Else!", "helpfulness": 2, "user": "VTDC", "date": "January 12, 2009", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 23497467, "likes": {"liked": "— Pool", "disliked": "— Everything else!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Spent the last week of September at this resort and found it to be an excellent place for a relaxing holiday. Unlike some previous reviews our room was cleaned promptly each day, the staff at the pool were ever friendly and obliging and the accommodation was clean, comfortable and met our needs. ( We regularly stay at 5 star resorts and on a value basis for the money we paid to stay here the value was very good). On our last trip to Thailand we stayed at the Sheraton La Grande at Phuket and although we were happy with that resort we were just as happy with Nora Resort at a lot less cost.", "title": "Very happy with Nora Resort", "helpfulness": 1, "user": "daisycutter", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20718055, "likes": {"liked": "— Great view from our verandah over the sea", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I agree that for dinner the restaurant is poorly attended and although the food is adequate it could be improved. Breakfast was very good and we found the breakfast staff quick (and happy) to respond to any requests.", "title": "Disappointing...", "user": "JoshesBoy", "date": "October 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20626548, "likes": {"liked": "— Breakfasts by the ocean", "disliked": "— Room size"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "We did not find the taxis expensive costing us 200 baht into town (around $7.50 AUD) at the time we were there. Where we live on the Sunshine Coast in Queensland a similar journey is $15.00 AUD. So I am puzzled by a previous reviewers reference that the Samui taxis were dearer than Australian taxis.", "title": "Lovely, relaxing stay at Nora", "helpfulness": 1, "user": "HeatherHongKong", "date": "September 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20266163}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Foot massage an hour for 200 baht is also a bargain as are the restuarant prices. Rice Restaurant was the standout for us. Try their lemon sorbet with vodka and prosecco for a dessert like no other.", "title": "Like a dream come true...", "user": "BBALCI", "date": "August 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19455699, "likes": {"liked": "— The service and the private pool:)", "disliked": "— The restaurant"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We loved Samui and will definitely be back again", "title": "Moved out after two days", "user": "MrsC59", "date": "August 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 19032635, "likes": {"liked": "— The front desk were helpful", "disliked": "— The room"}}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 23, "average": 51, "very good": 151, "terrible": 16, "excellent": 258}, "aka": "Nora Beach Hotel Chaweng", "slim_ranking": 0.209677419355, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}