{"user_rating": 4.0, "review_count": 358, "name": "Norfolk Waterside Marriott", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "The property is in the Waterside area of downtown Norfolk. There are a ton of restaurants, bars, and shops within walking distance of the hotel. Skip the touristy schlock of Waterside and walk over to Granby Street. Macarthur Center, a really nice shopping mall, is a few blocks away. Very convenient parking.", "title": "Nice hotel in great location", "user": "Corpuscle", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11405686, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel itself is very nice. The lobby is beautiful, the room was clean and nicely decorated. Nice view of the waterfront. My only complaint was that the toilet ran...had to jiggle the handle, but other than that, no problems. I would definitely stay here again.", "title": "Clean Rooms, Grand Lobby, Great Location", "helpfulness": 1, "user": "jaysonsmith", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11084899, "likes": {"liked": "— Service & Cleanliness"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I was recently in downtown Norfolk for a wedding and chose to not stay at the Sheraton Waterside across the street (due to its terrible service) and instead stay at the Marriott. The rooms are nicely appointed and have a classier look and feel than the redone Sheraton (and the service is boatloads better). Bathrooms are of good size – and best of all, everything is EXTRA CLEAN. Room service came by promptly during my two night stay and cleaned the room from top to bottom. The property is conveniently located to all area attractions, with Nauticus and the waterfront one block away, and the huge MacArthur Center / mall a short 2 blocks out the front door. Also – to the people who constantly complain. The hefty parking fees are not the hotels fault – they go to the city of Norfolk and you will pay them regardless of where you stay. Thank you Marriott waterside for a great stay!", "title": "Stay somewhere else", "user": "shoemanfoo", "date": "November 24, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 11023513, "likes": {"liked": "— Nice view of the waterfront", "disliked": "— Didn't make us feel safe."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Parking to the hotel was a block away and cost us $14. As I am handicapped and there is no reserved spaces my fiancé and I had difficulty carrying our luggage. Although the parking area was well lit, it was also the entrance to the mall and large groups of teenagers were loitering about. When we first checked in there was a person outside our first room, sitting on the floor in the hall in his underwear and talking loudly on his cell phone. Upon entering our assigned room we found that was occupied by another guest. We opened the door to find towels, suitcases and other items strewn about.", "title": "Mediocre for the $", "helpfulness": 1, "user": "SoloHan", "date": "October 27, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "business": 2.0, "rooms": 3.0}, "id": 10384111}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We returned to the front reception desk and a different receptionist assigned us another room on a different floor. The new room was clean and had a nice view of the waterfront.", "title": "Great property", "helpfulness": 2, "user": "Chem64", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8639246, "likes": {"liked": "— Comfy beds and city views", "disliked": "— Having to pay for parking/internet service"}}, {"rating": 5.0, "title": "Great hotel with perfect location", "text": "We stayed 2 nights at the Marriott Waterside Hotel in Norfolk, Va. (June 8 and 9, 2007). The hotel is clean, our room was good size and very comfortable, the staff are exceptional and the lounge (on the 2nd floor) is a great place to end an evening and just wind down before going back to your room. We stayed on the 14th floor, overlooking the harbour (the Tall Ships were in) and our location was wonderful. The MacArthur Court (mall) and several attractions are located nearby (easy walking distance). We highly recommend dining at Sterling's and Kincaid's!!", "user": "travelexplorer27", "date": "June 13, 2007", "id": 7845375}, {"rating": 4.0, "title": "Wonderful hotel-best in Norfolk", "text": "This hotel was wonderful. It was in a great location on the waterfront. Many restaurants, shops, clubs, bars, and museums nearby.", "user": "daisy47", "date": "June 13, 2007", "id": 7843943}, {"rating": 5.0, "title": "Norfolk Marriott Waterside is a Great Hotel", "text": "The hotel itself was very pretty. The lobby was nice looking and they offered free lemonade and coffee everyday.", "user": "V15", "date": "June 7, 2007", "id": 7802624}, {"rating": 4.0, "title": "Great hotel, great location", "text": "The room was wonderful. The bed was very comfortable, the bathroom was very nice. The toiletries were Bath and Body Works and I liked them very much. We were on the 12th floor and the view was wonderful. We looked out on the waterfront, the Waterside Shops, and the Naticus Museum.", "user": "cyenti", "date": "June 7, 2007", "id": 7801515}, {"rating": 4.0, "title": "Great Hotel, expensive to park", "text": "We did not eat at Shula's (inside the hotel) but we went to Jillian's, Blackfinn, and Sterling's Steakhouse. They were all good but Sterling's was excellent and a very quick walk from the hotel. I highly recommend it. [--]", "user": "JamieAkron", "date": "May 21, 2007", "id": 7669294}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I stayed here the weekend of August 8 for 2 nights. Overall we were satisfied with our stay. It was very crowded that weekend because of a couple of wedding parties staying at the hotel, so we weren't able to try out the pool because it was packed every evening with kids and families.", "title": "ok value, good service, good location", "user": "bohemiantaylor", "date": "August 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 37293623}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The parking is rediculously expensive, meaning $13/day for self-park.", "title": "Nice, although expensive hotel conveniently located to Norfolk Waterside", "user": "tni", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35302513}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I would have really appreciated having a safe in the room, and the tv was old and the reception was quite poor.", "title": "beautiful, well located amazing service BUT uncomfortable beds and paper-thin walls.", "user": "AnnBonney", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 34918449}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "However, our room was big and clean, with no smells. The walls are a little thin, and you could hear toilets flushing all around us, which was quite funny actually.", "title": "a great place to stay!", "helpfulness": 1, "user": "Canucks123", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33419029}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We got a great deal through Priceline, so even with those not-perfect aspects, it was a good value for us.", "title": "The GOOD & the BAD!", "helpfulness": 1, "user": "rtfrey", "date": "May 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 29456587}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I stayed here on a week long business trip. The location was fantastic; it's close to downtown businesses and shopping. I found the staff to be prompt and professional. The Shula's restaurant was fantastic and served excellent food. The room service food was not as good; I had a rather dry, overcooked, and tasteless chicken breast. However, when I brought it to their attention, they were quick to refund the full meal and bring me something else on the house.", "title": "Great stay on business", "helpfulness": 3, "user": "wayward_coyote", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8460017, "likes": {"liked": "— Elegance and cleanliness", "disliked": "— Room service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The room was quiet and immaculate, and the rest of the hotel was very well maintained. There is a nice lounge above the lobby with very friendly staff, good clients, and a grand piano that they will let you play if you ask nicely and don't butcher Chopsticks. It was a good place to \"come home to\" every day during my trip.", "title": "Fun By the Waterside", "helpfulness": 1, "user": "BlueWayTravel", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8421255, "likes": {"liked": "— Pool and Jacuzzi", "disliked": "— They need to put more sugar in the room for coffee."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Would definitely stay here again.", "title": "Nice Hotel, but check those cigarettes at the door.", "user": "ameriphobe", "date": "July 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8259311, "likes": {"liked": "— Location", "disliked": "— Smoking policy, parking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I had a wonderful time at this hotel. It was very clean and the staff was very pleasent. The pool and jacuzzi's were clean and the weight and cardio room was good as well.", "title": "My favorite hotel in Norfolk", "user": "momof3atl", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8253599, "likes": {"liked": "— Overlook of Norfolk waterfront from 6th fl", "disliked": "— Parking is expensive"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I would stay here again.", "title": "Nice Location but Stay Somewhere Else", "helpfulness": 2, "user": "RM6329", "date": "July 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 8236555, "likes": {"liked": "— Location", "disliked": "— poor service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "As a convention planner, I stay and visit alot of hotels. The staff of the Marriott Norfolk is one of the best I have ever worked with---and definitely the most friendly! Any requests were handled professionally, swiftly and with a smile. It is quite unusual to have EVERY staff encounter be so pleasant. This property appears very well-managed even through these tough times. It was well staffed and I was never too far from an employee that was willing to help even if it wasn't her/his department. My room was comfortable and clean. There was a challenge at times with room temperature control, internet access and cell phone dead areas. I would recommend this property not because it's all the unique--but it definitely has a staff worth experiencing. Also nice were Shula's and the hotel's restaurant. Well-equipped and clean fitness room also available. Thanks!", "title": "Accommodating!", "user": "CDJanet", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28096761}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I had an attractive room with a pleasant view, but it took some time to get into the room, and the staff were not paricularly accomodating. When I finally got to the room, it was very cold and the thermostat didn't appear to work.. The \"engineer\" who arrived to adjust the heat set the thermostat at 88o and was admused at my inability to set it. Who sets the thermostat at 88o to achieve a comfortable temperature? Further, the front desk was unaware that a business meeting was being held at their hotel, which resulted in considerable confusion for the meeting participants. All in all, there seems to be an administrative disconnect at this hotel.", "title": "This hotel has some problems", "user": "James-Corin", "date": "February 28, 2009", "detail_rating": {"location": 3.0, "service": 2.0}, "id": 25349627}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I have stayed at this hotel about 10 times over the years. The best thing about this hotel is the location. Located near Granby Street, there are many good options for dinner, bars, nightlife in the area. I highly recomend Todd Jurich's Bistro, Empire Little Bar, and Havanna - all within a few blocks. There is also a Shula's restaurant in the hotel, but I have not eaten there as I like to explore local options rather than chains. I have always had a great time downtown. Thursday thru Saturday are the best nights.", "title": "Great location but needs help", "user": "Spiderquadrifoglio", "date": "February 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 25162494}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The staff here is very friendly and professional. Waterside rooms above the 8th floor have good views of the navy shipyard (its actually more interesting than it sounds. If you like aircraft carriers and battleships - this is your kind of view)", "title": "Great Experience", "user": "ZuniVirginia", "date": "February 16, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24622299, "likes": {"liked": "— The view", "disliked": "— Do the valet parking, it is easier."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "The downside? This hotel exhibits the problem of the Marriott chain - some locations are fantastic. A lot are just so-so but you still pay the Marriott price. This is the latter. Rooms are clean. Bathrooms are small. Furniture is boring and overall decor needs an update. I'm guessing its from the early 90's. TV is a 25\" tube - No HDTV here. Lower level rooms below the eigth floor can have absolutely no view. Some 4th floor rooms stare straight into the back of a roof parapet and all you can see is sky above. Bath product is average. Beds and linens are confortable - but nothing special. No bottled water in room. No ammenities offered (I'm a Gold Marriott rewards member, and still nothing offered).", "title": "Average Hotel in the city center of Norfolk", "user": "dcfreqflyer", "date": "January 8, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 23390164}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Very nice hotel! Great staff, nice room and wonderful location. The cookies at check-in were a plus. Room was good sized and nicely decorated. Internet access in your room will cost $10/day. We used valet parking because of the weather ($26/day), but there are cheaper lots nearby. Shula's steakhouse looked inviting, but we had other plans. Looking forward to coming back!", "title": "Very Nice!", "user": "JohninDC", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56463272}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I've stayed at this hotel twice this year for business meetings/conferences. Overall, the hotel is very nice and clean...highly recommended! The housekeeping staff were not very friendly and many of them ignored us as we passed them by in the hallway. The front desk staff were very friendly though and made sure we had everything we needed. My only concern was SAFETY. On the first night I arrived, the bell hop/valet was \"running off\" 4 young females from the front lobby who looked as though they were ready to offer \"a good time\" to someone. They yelled and cursed at the bell hop as they left the property. He called them \"----\" and told them to \"go back to the projects where they belong\". He then yelled at them, telling them not to come back or he would call the police. The other problem during my stay was that a housekeeper let a mentally handicapped girl into my colleague's hotel room while we were in a meeting downstairs. My colleague returned to her room to find the girl laying in her bed, eating her snacks and watching TV. My colleague immediately called the front desk, only to learn that this girl was lost and her caregiver (and the police) had been searching for her for 2 hours! The scary thing is that the housekeeper let this girl into my colleague's room without asking any questions. It was obvious the girl had a mental impairment and she was lost. When she told the housekeeper, \"this is my room\", the housekeeper just let her in... no questions, no ID... nothing... ?! So... beware of your safety... the housekeepers might let someone into your room without any questions asked. The manager was notifed of this incident and he met privately with the housekeeper (not sure if she was fired?). Hopefully the hotel manager will make sure the housekeepers will never let someone into a room without sending them to the front desk for ID verification. This is very concerning and has prompted me to be more cautious at all hotels I stay at!!! One final tip about this hotel... use the valet parking. The valet staff are very friendly and accommodating. It's must easier to let them park your car for you ... and worth the few extra dollars! If you don't mind walking a few blocks, everything you need is within walking distance (I didn't need to move my car at all during my stay).", "title": "Nice place but not safe!!", "helpfulness": 2, "user": "Hotrod_Hammer", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54749538}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My husband and I stayed for two nights, while in Norfolk to see my son off on deployment. It had a great location and comfortable rooms, which we really enjoyed. But, by far, the employees were the most amazing part. Every staff member we met was extremely gracious and helpful. We will return, without a doubt.", "title": "The Best Service Personnel Ever", "user": "saabco", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53883194}, {"rating": 4.0, "title": "Gorgeous views, fabulous service.", "text": "We arrived here with a reservation we inadvertently booked for the wrong date.", "user": "KathyB333", "date": "December 18, 2009", "id": 51462231}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The front desk staff was not only gracious, they calmed our frazzled nerves and booked us a room while we figured out our error.", "title": "beautiful hotel", "user": "ChefHawk", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49887071}, {"rating": 3.0, "title": "Decent but had a major problem!", "text": "My husband and I had a three night stay at this hotel. The breakfast buffet was excellent and the waitresses were friendly and quick. The bed was very comfy but I found the room to be small. Our rate was $119 a night and $26 a day for valet. We were there with 400 others for a national meeting. The elevators were extremly slow (during our events) so we often had to ride the elevator up, only to get a ride down to the lobby. Starbucks in the lobby is a nice touch even though there is a Starbucks directly across the street, too. An awful storm caused the satellite to go out so we were without the tv for awhile. During checkout, it took 35 minutes for the bellman to come to the room. Because of the shipyard employees, 5pm traffic is horrible here near the tunnels. But, our major problem with this hotel was the valet driver who drove our vehicle from the garage to the hotel on a flat tire. The tire and rim were ruined, costing over $500 to repair! We contacted hotel management, who then called security and they were wonderful about getting answers on what happened. Photos were taken, paperwork was written and we were reimbursed after getting estimates. Luckily, we had a spare and got home safely with no extra tire in the trunk. Our meeting here was wonderful, so all is forgiven. We are Marriott Silver Rewards members so this incident won't keep us away from using Marriott again.", "user": "Isky", "date": "July 24, 2007", "id": 8226091}, {"rating": 4.0, "title": "nice weekend getaway", "text": "My husband and I stayed at the Marriott Waterside as a weekend getaway without the kids. We were not disappointed. The hotel was close to dining, shopping, and entertainment. We parked our car in the parking deck on Friday(14 dollars a day) and did not have to drive anywhere the entire weekend. The beds were extremely comfortable. We were disappointed that they did not have any king size beds available and I probably would have made a bigger deal of it if the bedding had not been so comfortable (soft duvet with down comforter). The double beds were a bit small for both of us to sleep in one bed but we figured out a way to have our cake and eat it too :-). The hotel staff was friendly and the room was very clean. I have stayed at the Sheraton which is closer to the water than the Marriott, but the Marriott is far superior.", "user": "kweddle", "date": "July 22, 2007", "id": 8218093}, {"rating": 4.0, "title": "Fine Location, Nice Room, Great Fitness Center", "text": "I had read a previous review that mentioned this property included a great fitness center. It did and was packed when I went to run miles on the treadmill and do weights at 5:30 am before heading out to work. Stayed on the concierge level, which included a free evening buffet. The restaurant food on the first floor was okay, but I expected better coming from a Marriott. The food was typical “bar food.” The evening concierge level food included wonderful crab cake h'orderves. The hotel could improve on the concierge breakfast, which included greasy bacon, overcooked eggs and a bunch of bagels, muffins and breads. The toaster did not work properly. For some reason, they did not heave all the food ready at 6:30 am. If you stay on the top floor you're shorted about two feet of space due to the design of the building, which has this platform sticking out from the top floors. I had been in a lower level larger room with a view of the waterfront, but moved since the room had a faint smell of cigarette smoke. The front desk said they would charge the previous guest a $200 cleaning fee for smoking in the room. This is a non-smoking hotel.", "user": "Caraib321", "date": "July 8, 2007", "id": 8077289}, {"rating": 5.0, "title": "The Perfect Location in Norfolk!", "text": "This is the place to stay in Norfolk. It is within 5 minutes walk of Granby St. restaurants (such as the Blue Hippo), MacArthur Center (large mall with a Nordstrom), Nauticus Museum and lots of other entertaining places. If you can choose when to visit, you can find decent rates below $150. a night, such as AAA when it is available.", "user": "bagsalwayspacked", "date": "June 27, 2007", "id": 8016938}, {"rating": 4.0, "title": "Wonderful Hotel and Nice Location", "text": "It is much quieter and fun to stay there when it is not so full...the indoor 6th floor pool and outdoor deck are delightful with a view of the harbor even though it is often very windy on the deck. Shula's deli on the main floor is lovely...try the salad with ahi tuna. The second floor buffet breakfast is usually first class. We stay there almost once a month on business and enjoy the attached garage which is worth the $20. per day because of its convenience just across the 3rd floor footbridge.", "user": "BarbaraWarnerRobins", "date": "June 18, 2007", "id": 7899132}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed here when back in town for a family wedding (as we seem to for all weddings, funerals, etc.). Good room rate for the wedding, but did not include parking or breakfast, so the extras add up. Because we were coming and going continually with two kids, we used the valet service and while it is not cheap, there were always plenty of young men on hand to deal with the cars with no waiting.", "title": "Great location in downtown Norfolk", "user": "CrispyOne", "date": "November 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49174753}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "One of the best things about the location, other than the view of the river, is the short walk to MacArthur Mall, especially when you learn your husband has forgotten his tie. Plenty of better chain dining options there, too, if Waterside doesn't thrill you.", "title": "Great stay, we loved it!", "helpfulness": 1, "user": "ilovechris4eva", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40063046}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Rooms were clean and quiet, everyone we interacted with was polite -- no complaints. There are also washers and dryers available across from the pool (always handy when traveling with kids). The staff will make change and provide detergent. It may be time to freshen up the hotel a bit, though -- hallways sings and the elevator call buttons are looking worn.", "title": "Adequate but overpriced", "user": "beetle64", "date": "August 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 38704171}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My fiancee and I stayed at this hotel and were given a corner room with a king bed on the 9th floor. We though the room was small, but having the two windows, with a beautiful view, really opened it up. The bed was very comfortable and the room also had a flat screen tv. My fiancee also really liked the fresh cookies they served at check in!", "title": "Rude, unpleasant staff", "user": "Kelley1616", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 38533520}, {"rating": 3.0, "title": "Convenient for business", "text": "We thought the hotel was beautiful, the bartender at the piano bar was very friendly and the hotel was in an excellent location, across the street from the harbor. We loved the pool area, there were 3 outdoor hot tubs just off of the pool area, each in its own enclosed area, making it a bit more private.", "user": "Ravenduffer", "date": "August 16, 2009", "id": 37844016}], "location": {"country": "United States", "city": "Norfolk"}, "stars": 3.5, "variance": {"poor": 23, "average": 58, "very good": 149, "terrible": 23, "excellent": 105}, "aka": "Norfolk Waterside Marriott Hotel Norfolk", "slim_ranking": 0.3, "description": "Surround yourself in our newly renovated accommodations seamlessly combined with traditional charm at Norfolk Waterside Marriott, a downtown Norfolk hotel set in the heart of the historic district. Located on the picturesque Elizabeth River waterfront, our Norfolk, Virginia hotel combines stunning river views with marble accents, classic wood styling and eclectic artwork. From its convenient connection to the Waterside Convention Center to the nearby Children's Museum of Virginia, Norfolk Naval Station or the Virginia Zoo, our location is ideal for business or leisure guests. Stay active at our premier Norfolk, VA hotel fitness center complete with personal TVs, or relax after sightseeing at Shula's 347, serving renowned cuisine within this hotel in Norfolk, VA. Plan intimate outdoor gatherings on our sixth-floor Riverview Terrace or execute grand galas in over 60,000 sq ft of premier Norfolk hotel event space. For unrivaled lodging on the vibrant waterfront, look no further than Norfolk Waterside Marriott."}