{"user_rating": 2.5, "review_count": 562, "name": "Normandy Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "It isn't the worst hotel I have ever stayed, but it was for sure one of the worst 4 stars I have ever been. The location is awesome, only few steps from the Louvre. The customer service was horrible, I was expecting it from Paris though. It was my fist time there and they just confirmed their fame. I can't understand how someone can work in the tourism business and be so rude! if you don't like to deal with people (customers) choose another industry!", "title": "Horrible customer service, old Hotel...", "helpfulness": 1, "user": "Gremio", "date": "July 10, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 8096447, "likes": {"liked": "— Location", "disliked": "— Customer Service"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Well, back to the hotel. It was old and needing Restoration. The room was small and old, not too clean as well. The elevator was scary...", "title": "Great Stay!", "user": "deedydiamond", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8031010, "likes": {"liked": "— Location", "disliked": "— Lack of amenities"}}, {"rating": 1.0, "title": "What a dump!", "text": "In summary, if you get a good deal (I got it for USD $95/night) for a room there, it is worth, because of the location, but don't pay more than USD $150.", "helpfulness": 3, "user": "KLGChicago", "date": "June 1, 2007", "id": 7728414}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The location was the best in Paris. The staff was very helpful although don't expect any of the Paris natives to be overly friendly, it's not their style. The room was adequate, only draw back is that it's old and in need of some updating. We had a wonderful stay and the only real complaints we had were simply because we are American and are use to a different type of lodging. Everything you want to do is just outside the door. I would stay there again.", "title": "Perhaps not 4 stars but nothing to worry about", "user": "pnclark27", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7696674, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We had stayed here twenty years ago and found it to be clean, a bit antiquated, but the large rooms and great location made up for any deficits. This no longer holds true. The guest rooms have not been updated in all this time and the dilapidated condition of this hotel makes it unacceptable. The Normandy makes false claims that there is air conditioning, but it is a free-standing floor unit that does not work,. The old wall-mounted hair dryer was not powerful enough to dry our hair. They put small flat-screen TVs in the sitting room (we booked a so-called suite), but the furniture is so old, that it is impossible to comfortably sit on anything to watch the TV. The bathroom tile is falling apart and the grout is moldy. The hallways are disgusting and poorly lit. We would have changed rooms, but our friends, who were staying in a suite similar to ours, said theirs was no better. We stayed for one night and then found another much better hotel for the same money. There is no reason to stay at such a rundown property.", "title": "Don't worry, it's worth a visit.", "helpfulness": 3, "user": "memmsy", "date": "April 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7428252, "likes": {"liked": "— proximity to the louvre and the finest areas of paris", "disliked": "— slightly over attentive maid service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "OK the area is fantastic and you can walk everywhere from this hotel and get the boats all over the place just a short walk away did not need to use the metro once.", "title": "This Hotel is totally Fine if you dont like the modern hotel", "helpfulness": 4, "user": "smiler1977", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7379098, "likes": {"liked": "— Location", "disliked": "— Restaurant no closed"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The hotel", "title": "Ignore the Poor Reviews, Unless You Only Like the Holiday Inn", "helpfulness": 5, "user": "StoneMirror", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7270167, "likes": {"liked": "— A great deal on a perfectly good room in a terrific location", "disliked": "— In-room Internet access could be better"}}, {"rating": 1.0, "title": "Beware!", "text": "The good parts are the location, staff, room size, shower, english tv channels, bar and very clean. What more do you want.", "helpfulness": 2, "user": "mjdm", "date": "February 10, 2007", "id": 6775700}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "out of ten i would rate it as 7 above average.", "title": "Great location but not a 4 star Hotel", "helpfulness": 3, "user": "vitonas", "date": "January 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6709682, "likes": {"liked": "— Loacation", "disliked": "— Rooms - Service"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The bad points, posh Restaurant now closed and only open for lunch but was told by the hotel to eat out as they said its not very good. The hotel has no air con but you do get a portable on in the room. Thats it", "title": "Absolutely Fine: Was worried to death without cause", "helpfulness": 5, "user": "sallyoxford", "date": "January 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6583261, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "I stayed at the Normandy as a single traveler last month about a week before Christmas. I'd read the mixed reviews at Trip Adviser after making my reservation through Expedia, but had a perfectly fine stay. The lobby and reception areas were well maintained, the upstairs hallways somewhat shabby, and the room I was in (second floor rear, interior) somewhat worn but clean, nicely attended to, and quiet. My only serious reservation about the room was that the bath had only a hand-held shower and no curtain.", "title": "Perfectly Acceptable Paris Hotel", "helpfulness": 3, "user": "robertl2", "date": "January 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6538875, "likes": {"liked": "— Location.", "disliked": "— No real shower or bath curtain."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My Expedia reservation didn't include breakfast and I was very happy with the place just across Rue St. Honoré where the waitress knew my order the second day I showed up. The hotel's own breakfast room looked inviting. I never saw it crowded, as others have reported here, but my say was definitely low season. Don't buy Internet time on the hotel's guest-use terminal. Use a cybercafe at half the price. If you don't mind the short walk there's one a couple of blocks away at the Hotel Lion on Rue de la Sourdière.", "title": "A real let down.", "helpfulness": 2, "user": "SuffolkHotelhopper", "date": "January 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6533688, "likes": {"liked": "— Dirty and tired."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "With the Normandy it's all about terrific location, on which basis I'd stay here again and again. Within 2-1/2 blocks from the Louvre pyramid and the Carrousel, it's also just a short walk across Place Colette to the Palais Royale metro station, from which you can go everywhere else. For those who don't need the Georges V, I think it's fine.", "title": "This is a 4 star hotel?", "helpfulness": 3, "user": "gus_aberdeen", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6473111, "likes": {"liked": "— The location", "disliked": "— The overall standard"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I booked this hotel because the pictures on the website looked great. Upon arrival I was pleased as the bar/lounge and lobby area were very pleasant. We arrived early and asked for some coffee....it never arrived despite repeated requests. When we finally got to our room my heart sank. It was truly awful. It was tired looking, really dirty, has stains all over the carpet, the bed sheets weren't clean, wallpaper was peeling off the wall....I could go on and on. The bathroom was cramped and the shower head was faulty, and the sink taps leaked. I complained and was moved room. The next room was even worse, so I had to ask for my old room back. I found the staff totally unhelpful, and would never ever stay again. I liken the hotel to a one star seaside B and B.", "title": "Hotel Normandy, Comfortable and ideal location.", "helpfulness": 1, "user": "WJBEAVER", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5966551, "likes": {"liked": "— comfort & quiet atmosphere", "disliked": "— all was well."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We are a married ( 1 year ) couple in our thirties. This was our first, very much anticipated visit to Paris. We booked our room at Hotel Normandy on-line on the basis of its location and 4 star rating. We now wish we had read some of the reviews we have since seen on the internet. The hotel is in the perfect location for guests wishing to be in easy reach of most of the major sights, being only 50 meters from the Louvre and within easy walking distance from many of the city's most beautiful and famous landmarks. We were very impressed when we arrived. The hotel entrance and reception area are very well decorated and are obviously, well looked after. The Staff were friendly, well mannered and helpful. Unfortunately, our excitement was soon quelled when we took the extremely small lift to our 5th floor room. Small, spartan and in serious need of renovation. The furniture was typically french, very quaint, but looked very old. The carpets were worn and stained. The ceiling lights were hanging loose and damaged, the woodwork was damaged and in some places looked rotten and many of the bathroom floor tiles were chipped. There were no tea/coffee making facilities either.", "title": "Outdated, dirty and poor service", "helpfulness": 3, "user": "BBBB01", "date": "October 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 5957712, "likes": {"liked": "— It has some outdated character; foregone glory", "disliked": "— restaurant room and rooms"}}, {"rating": 1.0, "title": "Beware!!!", "text": "I made the mistake of booking into this hotel through its website without investigating in advance. A month or so later, I read in the newspaper that one booking a hotel in Europe should always check out Trip Advisor to guard against disappointment. The author would get both the Pulitzer and Nobel Prizes if I could vote! I checked this place out on Trip Advisor and did not like what I saw. Fortunately, their website had a booking contract which I had printed, which allowed me to cancel up to 15 days beforehand with a loss of only 5 euros. The standard website doesn't have a cancellation option, and I had to call Paris to get the secret website which does, but I was able to cancel in time. Unfortunately, although my $785 deposit was to be returned within 30 days, it was almost 120 days before I got my money back, and only because I filed a fraud claim with my credit card company. Not all the theives in Paris are in the Metro underground.", "helpfulness": 3, "user": "DevotedBrewersFan", "date": "September 27, 2006", "id": 5881252}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It is an old French hotel, not very cheap, € 760 for 4 nights for a double room.", "title": "great for fast eaters !", "helpfulness": 4, "user": "maroe", "date": "September 21, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 5822729, "likes": {"liked": "— location", "disliked": "— overpriced"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Old fashioned lifts, narrow, dark corridors and very patterned wallpaper in rooms.", "title": "Great for the price", "user": "Moveable_Snarf", "date": "September 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5784954, "likes": {"liked": "— Price", "disliked": "— Small room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Staff not over friendly and not very helpful. You don't have to take taxies to the airport, there are buses, Mr. concierge!", "title": "Seedy and scary", "helpfulness": 5, "user": "ALFIEDAISY", "date": "August 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5692053, "likes": {"liked": "— location", "disliked": "— everything!"}}, {"rating": 4.0, "title": "A fair bit better than I expected", "text": "At breakfast you are hovered over and tables are cleaned before", "helpfulness": 9, "user": "andyk123", "date": "July 25, 2006", "id": 5507169}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 128, "average": 109, "very good": 111, "terrible": 185, "excellent": 29}, "aka": "Normandy Hotel Paris", "slim_ranking": 0.867261572783, "detail_rating": {"service": 2.5, "cleanliness": 2.5, "value": 2.5, "sleep": 2.5, "rooms": 2.0, "location": 4.5}}