{"user_rating": 4.5, "review_count": 351, "name": "Northern Light Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Set next to the geothermal power station it is ideally located to visit the blue lagoon. Views are of the power station not the \"lagoon\" but the restaurant does good food (at least the veggy option was good) and looks stunning (see their website). Breakfast is pretty terrible for an aspiring hotel including brown apple slices and bags of sliced bread. Fireside lounge area is very nice too - and decor outside the rooms is thoughtfully chosen. Rooms are pretty basic - bring your own shampoo! Beds very comfortable. When we were there they dug up the parking area outside and we had to walk across a building site with all our luggage... hmmm. Can highly recommend the blue lagoon though (just don't look at the cost).", "title": "Amazing but slightly strange", "user": "Kirkm", "date": "April 9, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 14918925, "likes": {"liked": "— location", "disliked": "— view of power station"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My wife and I booked a short stopover in Iceland on our way to Norway and Latvia. We picked the Northern Lights Inn, in Grindavik because of its proximity to the airport and the Blue Lagoon.", "title": "Fantastic!", "user": "Buster_O", "date": "March 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 14309211, "likes": {"liked": "— Service", "disliked": "— Distance from city center"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The owner picked us up at the airport at 5:30 am local time and was cheerful and welcoming. (Don't discount the value of the pick up, Iceland's public transportation system isn't so regularly scheduled or cheap). We checked into our room and were offered breakfast. The Inn is lovely, and the rooms are comfortable. Don't expect luxury accommodations, but for the ruggedness of Iceland, the Inn is perfect.", "title": "Try and beat this hotel!", "user": "chickonhertravels", "date": "March 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14162981, "likes": {"liked": "— The staff", "disliked": "— The smell of eggs (sulpher from the nearby power station)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "One important tip, be certain to close the window at night. The breeze may bring some of the sulfur odor from the geothermal stations nearby. It dissipates quickly, but turn off the heat rather than leave the window open at night.", "title": "Wonderful location", "user": "angie23", "date": "February 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13724302, "likes": {"liked": "— location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Our host recommended dinner at the Salt Fish House in a nearby town. It was the best meal we had in Iceland.", "title": "Amazing Service!", "helpfulness": 1, "user": "ajmAustin_Texas", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12914579, "likes": {"liked": "— Staff", "disliked": "— Showers"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "We stayed two nights after arriving by the MV Apollo ferry. Apart from a small bed, the room was nice and we received a nice welcome from the receptionist who doubled as the gift shop manager. The attached restaurant was very handy.", "title": "Nice hotel, not fancy", "user": "rnathan", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 180263364}, {"rating": 4.0, "title": "Northern Lights Inn", "text": "Rooms adequate, clean. Restaurant has good food and good service. Good location for exploring the south shore drive. Ferry ride can be wild or calm. Staff friendly. Nice gift shop with handwoven goods.", "user": "Janet W", "date": "September 29, 2013", "id": 179021028}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "As others have indicated, there are few choices for lodging in the area. Rooms in the rear of the hotel appear to be in a newer addition. This is where my room was located. The room was spacious, with modern, up-to-date furnishings. Compared with rooms at other motels on the Viking trail which were clean but very basic, this room compares well with the mid-range chain motels found in more populated areas. Room was spotless and quiet. Window opens. Room A/C unit had digital temperature controls. Furnishings included 2 sofa chairs and desk. Lighting was excellent, with reading lamp over the bed. Alcove had the basin and open closet. Toilet and bath in a separate room. Restaurant and bar are in the front of the hotel, so rooms in the rear are distant from the public areas of the hotel.", "title": "Newer rooms are modern, comfortable", "user": "mountainoutin", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178348874}, {"rating": 1.0, "title": "Terrible experience - stay somewhere else", "text": "Our second of two nights was one of the worst hotel experiences I've ever had. The hotel held a large wedding upstairs of our room which proceeded to blast music so loud that that the bass line caused vibrations in our room until 4 am. This was during a night in which I had to get up at 5:30 to catch the ferry. We spent a night with wedding guests dancing, running and jumping above our heads. Some were also shouting, laughing and smoking (so it smelled anyways) in the hallways. This also meant the parking lot was full so that, when we came in from dinner, we had to park down the highway and walk back on the shoulder of the highway in the dark to reach the hotel.", "user": "rlennon1", "date": "September 1, 2013", "id": 175171716}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The hotel has paper-thin walls, so the front desk should have at least let us know about the wedding when we made the booking or checked in, but they didn't bother. This is outrageously disrespectful. When I complained to the front desk, the receptionist just grinned and gave me a weak \"sorry\" before telling me how much I owed in full for the two nights.", "title": "in need of some serious updating!", "user": "nhammerv", "date": "June 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 165744168}, {"rating": 3.0, "stay_parameters": "Stayed May 2008", "text": "This is a decent enough place, provided you're going to the Blue Lagoon. It's in the middle of a lava field next to a geothermal power station, and apart from the Blue Lagoon there's nothing else for miles around. That should be seen as a bonus - it's easy to find and very quiet - just don't turn up needing supplies of any sort.", "title": "Fine place, but needs renovation", "user": "Chenky", "date": "June 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 16713561}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The power station isn't a problem. It's hardly attractive, but it's silent and you won't notice it unless you go outside. It seems to get by on virtually no staff and we never saw a soul about in our 1 day stay. The smell of sulphur does occasionally blow over the hotel, as it does all over the geo-active areas of Iceland. Don't be put off by the idea of it.", "title": "Great for a night or two", "user": "quails", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16519995, "likes": {"liked": "— Food - amazing", "disliked": "— Plastic bathrooms"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The rooms are small and bland, and like everywhere else in Iceland a double bed is made up by pushing two (very soft) singles together. The lounge area is nice and breakfast was fine, albeit the exact same as you get everywhere else: cereal, toast, meat, tomatoes, cheese and fish.", "title": "Building Site,Sulphur Pond And Power Stations.", "user": "TelnNick", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 16438575, "likes": {"liked": "— Blue Lagoon", "disliked": "— Building work"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My only real complaint about the hotel is the state of the decor. It's literally falling apart. I tried to plug in a charger unit for my camera and the socket fell out of the wall. I tried another socket and that did the exact same thing. When my girlfriend stepped into the bathroom a large tile fell of the wall (just missing her foot!). When I tried to close the shower unit door it came off in my hand. The bathroom, BTW, is horrible - one of those all-in-one plastic units. Small, cheap and tacky. It does the job, though, when it's not falling apart.", "title": "Amazing food in the restaurant", "user": "SportRehab", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 16435470, "likes": {"liked": "— Convenience of being picked up from the airport", "disliked": "— the building work on site"}}, {"rating": 3.0, "title": "No problems", "text": "The place is average value by Iceland standards. It costs the same as a decent hotel room in London, which makes your eyes water when you think about what you're getting for your money. It's no worse than just about everywhere else in the country.", "user": "Grux", "date": "May 24, 2008", "id": 16374421}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Really shabby looking on the outside, but nice inside. Staff good but difficult to find when you need them.", "title": "OK, nothing special.", "user": "woodymark2", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 31215185}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Had a series of earthquakes when we were there, it would have been nice if the staff had made the effort to reassure guests that everything was OK. As most of the guests had little or no experience of earthquakes and didn't not know whether there was any cause for concern or not.", "title": "Unique location, family friendliness,excellent food,warm and cosy", "user": "Holidayman003", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25658002}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Breakfast was OK, rooms were large, common areas were really nice. Nothing to do in the area but go to the blue Lagoon, so I would not recommend staying more than one night..", "title": "Comfortable, warm stay at Northern Light Inn", "helpfulness": 2, "user": "Crepes4Suzette", "date": "December 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 23079189, "likes": {"liked": "— comfort, views, expansiveness, thoughtfulness of staff", "disliked": "— that they couldn't command the aurora borealis appear:0))"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Two of our party of four were celebating their 50th birthdays and I wanted a three day break that would stand out from all our other holidays. Hence the choice of Iceland and the choice of this particular hotel for the whole break rather than a stop-over to or from the airport. When we first arrived I wondered if I had made the right choice. I was not prepared how barren the lava fields are, how remote the hotel initially seemed and how really close the Geo-thermal power station actually was. The doubts were soon dispelled. We quickly came to love the barren beauty of the lava fields, the hotel is only five minutes by car to the nearest town and just over half an hour to Rejkjavik, and to our great surprise within twenty four hours the Geo-thermal plant seemed as if it should be there.", "title": "Close to the airport", "user": "duellema", "date": "September 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19673525, "likes": {"liked": "— location and the resident dog", "disliked": "— small kinks, but they are still finishing up building"}}, {"rating": 5.0, "title": "spacious, relacing, and lovely (and yes, in the middle of nowhere)", "text": "All the building work mentioned in earlier reviews is finished and we stayed in the new wing in which the rooms were spacious warm, with lovely comfortable beds. The walk in shower was almost worth the trip on its own! We ate in for dinner every evening and the food was really excellent. The staff were so friendly and nothing was too much trouble.", "helpfulness": 2, "user": "michelefrie", "date": "June 13, 2008", "id": 16912229}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My husband and I chose this based in large part on the positive reviews it received here as well as the location away from Reykjavik. Let this be a cautionary tale.", "title": "Mixed Experience--read Carefully!", "helpfulness": 2, "user": "prof", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 12618065, "likes": {"liked": "— the restaurant--hands down", "disliked": "— construction, water problems"}}, {"rating": 3.0, "title": "doesnt look much from outside but inside is better", "text": "The hotel (not more than 20 rooms) is located in a very isolated stretch of the Rekyanes Peninsula. It is REALLY, right next door to the power plant (the same one that feeds the Blue Lagoon). In fact, the dining room looks out onto the power plant, as did our room. The common areas of the hotel were a big plus--enough space for multiple guests to find a corner and curl up with a book, play cards, enjoy the complimentary coffee. The individual rooms however were not what I expected. Our room was threadbare (except for the excellent beddings) and really not inviting. It is clear that there is a moisture problem, as the wooden windows were deteriorating. The bathroom was smallish with inconsistent water temperature and pressure (our last day we had only enough hot water for 1 shower, and the pressure was almost inadequate to rinse my hair). Be sure to bring your own shampoo and conditioner. Additionally, the hotel is undergoing a serious expansion, such that on our last morning we were greeted with electric saws outside our room at 7:15 a.m. This project seems to be just beginning, so I would expect this construction to continue for some time.", "user": "KateSkate", "date": "December 6, 2007", "id": 11285353}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The staff's willingness to drive their guests to the airport, Grindavik, the Blue Lagoon is truly admirable--particularly given the fact that renting a car is something I wouldn't recommend to a non-icelander. (Snow covers the few road signs, and many roads are not labeled helpfully. ) Whenever we wanted to go somewhere, we simply needed to ask and we were escorted there without complaint. I sincerely appreciated this--and consider it to be a selling point for the hotel.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "smitr2002", "date": "November 1, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 10507920, "likes": {"liked": "— It was next to the Blue Lagoon and close to the airport.", "disliked": "— The sound of the power plant next door."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "However the greatest selling point was the restaurant. This honestly was the BEST food I ate in Iceland. Yes, it was expensive, but everything is. And rather than \"save\" money spending $15 on a hot dog for dinner in Grindavik, you should save up and eat here. We ate here three nights and were utterly charmed by the preparation, quality and portions of the food. The BBQ'd lamb tenderloin will change your life and the fish of the day was excellent multiple days. But for goodness sake, if you only eat one meal here, let it be the Sunday dinner. You must let them know a day ahead of time--and have either 2 or 4 people getting it. You will be presented with a succulent leg of lamb, plentiful bowls of veggies and potatoes, and gravy from the gods.", "title": "great stay", "helpfulness": 1, "user": "plateaugal80", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 3.0}, "id": 8841057, "likes": {"liked": "— remote location", "disliked": "— remote location!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "So, would I stay here again--probably not. But I would make a point--even go out of my way--to eat here the next time I am in Iceland. I'd make arrangements to catch dinner on the way back from the Blue Lagoon.", "title": "Right next to Blue Lagoon", "user": "ckreiter", "date": "September 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8697272}], "location": {"country": "Iceland", "region": "Southern Peninsula", "continent": "Europe", "city": "Grindavik"}, "stars": 3, "variance": {"poor": 5, "average": 32, "very good": 137, "terrible": 0, "excellent": 177}, "aka": "Northern Light Hotel Grindavik", "slim_ranking": 1.0, "description": "32 cozy rooms, family hospitality, delicious foods –and Max – await you, 20 minutes from KEF Keflavik International Airport.Complimentary International Airport and Blue Lagoon transfers areavailable anytime. Wi-Fi internet access is free throughout the hotel.We are 5 minutes from the fishing village Grindavik, the heart of the majestic Reykjanes Peninsula, southwestern Iceland."}