{"review_count": 29, "slim_ranking": 1.0, "name": "North Eastern Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Visited January 2013", "text": "Ate here last night, great service on arrival, quickly read the menu, and decided on the excellent specials. They realised I was alone, and offered, great seating on the couch or anywhere, I opted for outside as a beautiful night.", "title": "Excellent food & value", "user": "JosephineClarey", "date": "January 30, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 150985948}, {"rating": 5.0, "stay_parameters": "Visited January 2013", "text": "Was delivered food promptly, and didn't want for anything more. No additional seasonings required, food was just perfect.", "title": "The place to eat at!", "user": "Leswant", "date": "January 17, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 149847227}, {"rating": 5.0, "stay_parameters": "Visited December 2012", "text": "I normally go to a different place each nigh to try them all, but decided, I'm back tonight to try something from the menu, maybe depending on the specials.", "title": "Excellent restaurant food and service", "user": "porcupinegirl", "date": "December 30, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 148328973}, {"rating": 5.0, "title": "Delicious and classy", "text": "Nice outdoor area, and the dining room looked lovely also.", "user": "Phase_02", "date": "December 28, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 148179568}, {"rating": 5.0, "title": "Worth seeking out when in Benalla", "text": "Staff and owners were great.", "user": "Easyriders1369", "date": "December 21, 2012", "id": 147839268}, {"rating": 5.0, "stay_parameters": "Visited November 2012", "text": "When overnighting in Benalla recently we were looking for a quality meal. We sure found it a the North Eastern Hotel. From the moment we walked into the lounge area, complete with open fires and cosy couches we were impressed. A wine list which included many local wines as well as a well planned menu that supported local producers. The food was excellent and presented beautifully. To round things out the staff, including our young waiter, were charming and attentive. This is a hotel not to be missed.", "title": "\"Ambience,wonderful food and excellent service\"", "user": "400Mary", "date": "November 7, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 144892894}, {"rating": 5.0, "title": "Quality food, friendly service", "text": "Benalla may not be loaded with fine dining options but the North Eastern Hotel would be a leading venue in any town or city.", "user": "VoiceOfReason73", "date": "September 18, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 140639503}, {"rating": 1.0, "title": "Unwelcome.", "text": "The food was very very good - interesting and flavoursome, filling in size but not excessive. And the service was warm and friendly. It's a small restaurant so they can take their time with each diner. The ambience is also very pleasant, especially on a cool winter evening.", "user": "RobChez", "date": "August 3, 2012", "id": 136173242}, {"rating": 5.0, "title": "Surprising to find such great food in an out of the way location", "text": "It's not cheap but it's good value for what you get.", "user": "Chenglim", "date": "July 19, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 134785506}, {"rating": 5.0, "title": "Beautiful meals - highly recommend!", "text": "70th birthday almost ruined because of managers intransience.", "helpfulness": 1, "user": "lmax228", "date": "January 17, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 123235586}, {"rating": 4.0, "title": "Not your average pub experience!", "text": "Found this place on trip ad. And I would totally agree wirh the last two reviewers. Great service, the young waiter was friendly and the owners very comfortable to chat to. Food was exceptional, my mum had king fish, dad eye fillet with a talagio cheese parcel \"superb\". The duck was the slightest bit over cooked, but I thoroughly enjoyed it all the same.", "helpfulness": 1, "user": "Linbaird", "date": "November 11, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 120453675}, {"rating": 5.0, "stay_parameters": "Visited September 2011", "text": "We were reminded that we were dining in a pub when four very drunk blokes walked in to slobber and slump on the bar. When our publican politely refused them drinks things started to escalate. Two bouncers arrived, one strong man and a very small girl who must have got her courage from the land of Oz! The drunks were eventually pushed out the door and into the arms of the police! We were impressed with the way the staff dealt with the situation and were not in a hurry to let it spoil our night!", "title": "This is no ordinary pub!!!", "helpfulness": 1, "user": "golfsem", "date": "September 11, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 117930526}, {"rating": 5.0, "stay_parameters": "Visited June 2011", "text": "We stayed for a good coffee and one of the best pannacottas I have had! Thank you to all of the team at The Norto, we will be back!", "title": "Outstanding Dining Experience with Exceptional Atmosphere", "helpfulness": 3, "user": "LouLouLouSyd", "date": "June 23, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 114665113}, {"rating": 5.0, "stay_parameters": "Visited February 2013", "text": "Was in Benalla for a week and had tried 2 different restuarants before being recommended this restuarant by a colleague. As one of the earlier reviewers commented you can't judge this place by the exterior. Inside is very well laid out, clean and more importantly the food was excellent. So much so that I came back the next night.", "title": "Surprising", "helpfulness": 1, "user": "Australians_Abroad", "date": "March 23, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 155452708}, {"rating": 4.0, "title": "Very Good Hotel Food", "text": "Hospitality was also very good and I would highly recommend this establishment.", "user": "Paddy O", "date": "March 7, 2013", "id": 153981012}, {"rating": 5.0, "title": "One of our local haunts", "text": "The ambience is excellent and the food of restaurant quality. Prices reflect the fact that the hotel is more than a bistro and the staff are professional in manner", "helpfulness": 1, "user": "AmandaJT17", "date": "March 1, 2013", "id": 153481713}, {"rating": 5.0, "stay_parameters": "Visited February 2013", "text": "Fantastic, quality food, Classic decor. Great outdoor area. Always great service. One of our regular spots to eat.", "title": "Never judge a place by its outside.", "helpfulness": 1, "user": "generaljo", "date": "February 25, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 153137942}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "The outside looks like any old style country pub, but step inside and you see a different side. We dined on a busy Friday night. From the moment we walked in, we were warmly welcomed, all the staff were tentative, knowledgeable and friendly. My elderly mother was catered for with a half serve of the \"James Squire\" beer battered fish n chips and stated it was the best she had eaten in her 85 yrs of life !!!!!!! All the other meals ordered from the menu were superb to say the least and could not find fault with any meal. The only down side was that we though the bar prices for drinks was on the higher side, other than that a fantastic meal was had by all.", "title": "A great suprize", "helpfulness": 1, "user": "Atlas86", "date": "February 9, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 151708562}], "location": {}, "variance": {"poor": 2, "average": 0, "very good": 4, "terrible": 1, "excellent": 22}}