{"user_rating": 4.0, "review_count": 119, "name": "Nouveau Caddy Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Great location on the market square. Staff very friendly and helpful and speak good english. Hotel is fairly basic but more than adequate and good value.", "title": "Friendly and Great Location", "user": "travel12Uk", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18886770, "likes": {"liked": "— Location", "disliked": "— Small Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Stayed here on a 4-day golf break with two mates, and it couldn't have been more perfect! Although the hotel itself is fairly basic - as you'd expect for a 2* - the welcome, atmosphere and service make it one of the best places to stay in Le Touquet. It's perfectly placed for the excellent market (3 days a week), and there's usually easy parking nearby. It's a 5 minute walk from either the beach or the town's lovely centre, and the owner was more than happy to recommend which restaurants to visit (and which to avoid!). All the recommendations were excellent, too (especially Chez Philippe). The golf in this area is superb (Belle Dune was our favourite course), and as the name suggests the hotel caters for a lot of golf visitors - so much so that the owner knows all the local courses, and will ring to book tee times (or book restaurants) at no extra charge. Don't think it's a hotel only for golfers though - the owner told us that at this time of year (July), there are more French families stay, and the golf fraternity mainly come in Spring and Autumn. Like the rooms, breakfast was simple but just what we needed, and the bar was always welcoming. All in all, we had an excellent time and wouldn't hesitate to return to the hotel, or the area. Highly recommended.", "title": "Absolutely outstanding!", "user": "johnnyboy1959", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 18462050, "likes": {"liked": "— The welcome", "disliked": "— Nothing"}}], "location": {"country": "France", "region": "Nord-Pas-de-Calais", "continent": "Europe"}, "stars": 2, "variance": {"poor": 5, "average": 10, "very good": 45, "terrible": 4, "excellent": 55}, "aka": "Hotel Nouveau Caddy", "slim_ranking": 0.0769230769231}