{"user_rating": 4.0, "review_count": 994, "name": "Novotel London ExCeL", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This was my third time staying here and is was as excellent as always. I am always surprised at the level of service and how the staff seem to go one step further to make you stay as enjoyable as possible. We received a room upgrade during our stay and the staff moved all our things while we were out. The rooms are large and bright and the bathrooms well equipped, the beds are comfy and the sheets crisp and cool. We enjoyed a bottle of wine on the terrace each evening. The meals are great but if you fancy a change try the Japanese restaraunt just a few doors down on the quayside. Great location for transport as is just across the road from DLR station, this has an automated ticket machine that takes cash and cards...we got daily tickets and travelled to city centre, Greenwich and Kew Gardens. We flew into London City Airport which is less than 5 minutes away by taxi and the airport is located very close to the runway, I loved watching the planes takeoff but the soundproofing is excellent and I was never woken by noise.", "title": "Quality stay", "user": "TracyHI", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139221972}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I did find that the reception desk gets quite busy in he mornings when many people are checking out together. To avoid waiting around and possibly keeping a taxi waiting we check out and get bill sorted after breakfast, order our taxi and then go and pack and just drop off keys when we are leaving.", "title": "Olympic stay for Excel", "user": "UkSlickjdip", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139197706}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Fast checkin, friendly service. Ideal for the Excel.", "title": "4* hotel with 4*+ service", "user": "R129", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139142034}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My only criticism is that there was no breakfast included in the price, however the airline cafe oppsite the hotel did tremendous bacon butties for £2.95.", "title": "Excellent location, very clean and tidy hotel.", "user": "ChristopherHarrington", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 138648502}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This was not my first stay at this hotel, I have stayed there whilst in London for business and for personal breaks. The rooms are the higher end of standard Novotel rooms, if you have stayed in Novotel before you will understand what I mean. The service at this hotel makes it stand out amongst 4* hotels and closer to what is expected in a 5*, all staff in all departments are professional and very pleasant, even the housekeeping staff will greet you if you make eye contact in the corridor, and as in a 5* you never meet them in your room but your room is always done, We stayed on a very busy week-end and at check in the reception staff appologised that they couldn't offer a room upgrade but could move us to a suite after the weekend for the second half of our stay, As an Accor favourite guest I am entitled to upgrades when possible, you normally have to ask for this, here the staff automatically offer it if you are entitled to it. We had some technical problems with door locks during our stay, a phone call to reception resulted in a maintenance person with necessary tools appearing in under 5 mns after profuse appologies from reception, if you have had the opportunity to call for maintenance in other hotels you will understand why this impressed me.", "title": "Excellent Location For London", "user": "Leebe1978uk", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138402301}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Managed to get a deal and stayed at a reduced price for one night. While the reception, waiting rooms, bar and breakfast are nicely decorated and maintained I wouldn't have said the bedroom was worth paying full price for. The room was particularly small and the bathroom incredibly compact. The separate toilet had stains up the walls and the bin was filthy. Other things made me want to give the room a good scrub. Aside from that breakfast was lovely and the staff were friendly and helpful. The location is a bit out of the way but that was no secret.", "title": "Wouldn't have paid full price.", "user": "georgespiggott", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 76758103}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I traveled down from Sheffield for a 2 night stay with my wife and daughter.", "title": "Nice hotel, good location.", "user": "jostwi", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75061664}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed in a single room with double bed and pull out sofa bed.", "title": "Solid hotel, just a little out of the way", "user": "yyousef", "date": "August 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 74455209}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The room was clean had air conditioning, TV, iron, ironing board, hairdryer, safe (free), minibar, seperate toilet, Bathroom with seperate shower cubicle and bath as well as the usual towles and shower/bath soaps and gels.", "title": "Nice but ..", "user": "bindiboo70", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 73651469}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I called ahead to confirm the hotel had received my booking via superbreaks which was a good job as they hadn't got down that my daughter would be in the room. I don't think this was down to the hotel but probably down to the communication between superbreak and the hotel.", "title": "Lovely hotel - beautiful location on the docks", "user": "giggs46", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73248633}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I've stayed at this hotel a number of times over the past few years and enjoy the location (for access to work) and the atmosphere. Everything is there for the traveller, be it pleasure or work.", "title": "An enjoyable hotel", "user": "Pen66", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79308752}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The only down side can be the room position and the London city airport. You know at a certain time the planes will come in or leave and that is usually 6.30 in the morning.", "title": "Always a pleasure", "user": "StratfordAde", "date": "September 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 79101789}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Putting that aside I would still stay again.", "title": "Below average, not 4 star in my opinion", "user": "wheretostaythistime", "date": "September 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 79013660}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I always enjoy stays at this Novotel. The staff are invariably charming, welcoming, attentive and intelligent. I wonder if the fact that Novotel always employs staff from continental Europe rather than native Brits is the reason? European staff have impressive language skills which I suspect are harder to find in locals, and it's often an effort to get a smile out of English hotel receptionists.", "title": "What a nice hotel", "user": "RojandPea", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78981619}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Breakfast buffet is excellent. Plenty of choice and constantly replenished. The evening buffet also makes hotel eating a real option rather than the unimaginative one. Rooms are pretty spacious but bathrooms are highlight with a real luxury feel.", "title": "Glad we didn't pay full price", "user": "banana36", "date": "September 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 78362179}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We have stayed here twice before getting the Eurostar over to Paris and Brussels - and although it is not convenient for St Pancras it is much cheaper and nicer - and the DLR and tube make it easy to get into the centre.", "title": "Excellent stopover hotel", "user": "vicki1978", "date": "October 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81699093}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Location is good - right next door to the Excel centre and there is plently going on nearby, however it is also quiet at night which you don't often get in London.", "title": "It was great - But take care with the price", "user": "CasalViajante", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 80931213}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "Rooms are clean, comfortable and well equipped, but the best thing about this hotel is the excellent breakfast on offer!!", "title": "Great hotel, awful pillows!", "user": "BAMaracas", "date": "September 23, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 80741193}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We had a good price because we had had a promotional.", "title": "Nice hotel in quiet location.", "user": "melvaz", "date": "September 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79595280}, {"rating": 4.0, "title": "Great hotel to explore London.", "text": "The breakfast is expensive if you compare with the Ibis in the same block, and you need to pay for internet.", "user": "Tabbycat1976", "date": "September 14, 2010", "id": 79492814}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I have to say I was very impressed with this hotel. On previous stays in London, I have always been amazed at how noisy it is 24/7 (normally sirens) even though we might be 8 or 9 floors up. This hotel was so peaceful it was lovely.", "title": "Great hotel - Highly recommended", "user": "RiskyRich", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72355793}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Having not been to London Docklands before, I was very impressed. It was incredibly clean, stylish and I love that they have kept all the old cranes to show the areas heritage. The hotel itself is right next to Excel exhibition centre and DLR station and there is also a great green space directly next to the hotel where we were able to play with a boomerang we had bought.", "title": "Very well managed hotel with modern rooms", "user": "HotelRoomBuyer", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71541653}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed here to visit the Science and Natural History museums and to do a sight seeing break with our kids (aged 9 & 7). It takes about 45 minutes in total to get to the centre of London using the DLR and underground, but it is all very easy and amazing value. Get a travel card for zones 1-3 for £6.30 per adult and this takes you everywhere you will want to go all day.", "title": "Excellent hotel, clean comfortable, easy access to central London", "user": "SandieBDerby", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 71539882}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The quality of service at this hotel was super, the room was very comfortable and the breakfast was possible the best I have ever had in any hotel. The view from the restaurant overlooking the dock was lovely and if the weather is warm, you can sit outside on the balcony.", "title": "Nothing amazing", "user": "Pakotini", "date": "July 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 71364334}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I couldn't recommend this hotel more. Thanks for a wonderful stay.", "title": "Decent, a little out of the way", "user": "MrWah", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 71360551}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We have stayed at the Novotel ExCeL twice now. The rooms are good quality and the views from the upper floors are fantastic. The new cable car is easily accessible for a speedy visit to shows at the O2 Dome. The DLR Station is within a few minutes walk and the ExCeL centre is literally next to the hotel. Tip - Good deals for this hotel with lastminute.com. We booked our second stay through their Secret Room service as reading the description of the hotel, it was clear what one we were booking.", "title": "Handy for the O2 and Central London", "user": "PhilandLilKent", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137099093}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Talk about great service! Michael and his team made our two week to one month stay, for some, more than enjoyable with amazing service, attention to detail, plenty of laughter and good will. Very centrally located for all people from different cultures and languages to get around in London. Fantastic accommodation!", "title": "An Olympic experience!", "user": "Moira L", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137094832}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Good place to stay, could have stayed at least 5 nights to fully enjoy everything during the Olympic fever. No welcome drinks unlike in Holiday Inn Heathrow with even daily still and sparkling water provided in the room, cotton buds, kids soap, shampoo, shower gel and towels. I would have to ask for extra towels etc. Prompt and polite service when I asked for more pillows as there were only 3 pillows (thin ones) for the 4 members staying. The staff provided nappies when my girl needed one for an unpredicted situation. Everything in The upper deck bar was great! Crowne Plaza was very kind to accommodate our car to park with just a residents parking fee. Appreciated the separate shower and bath and toilet. Thanks so much!", "title": "Great location for an idyllic summer stay during Olympics.", "user": "Championusa", "date": "August 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137070030}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "From the start checking in they had the dates wrong, i had to reactivate my card at reception every time i left the room. There is no free wifi and when i paid for it the signal was so poor i could not use it. Of course the hotel say its nothing to do with them. The bar advertise tv schedules like football matches on posters in the hotel but actually show what the majority ask for. I was watching a match which was advertised as been shown in the bar and with 30 mins to go in the match i was told it had to be changed. Total disrespect to a paying customer. Overall not a pleasant experience", "title": "Poor poor service, poor hotel worst ive been in.", "user": "rodgey6", "date": "August 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 136623208}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Pros: got a great hotwire deal so it was reasonable price. Food was excellent in the restaurant (albeit expensive). Room and hotel was clean. Close to the DLR - pretty easy access to Central London. Late buses stop at Canning Town which is not a far walk to hotel. Several restaurants in area (didn't try them however) but they looked decent. Two grocery stores within 100 meters open late.", "title": "Not a 4 star hotel", "user": "iu_denden", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 136459297}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Very nice hotel in a great location with friendly, helpful staff and good rooms. Breakfast plentiful and delicious with lots of choice, you can even opt to eat out on the terrace overlooking the river (if the weather permits).", "title": "Enjoyable stay", "user": "Rebecca B", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138207102}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Maybe a little out of the way for central London but great for the O2 with the new cable car at the end of the road. Very clean rooms, and polite staff. Only issue was the breakfast service wasn't so great, had to ask for teas and coffee, and had to ask reception for the bins to be emptied, not impressive. Otherwise very pleasant.", "title": "clean and comfortable hotel.", "user": "Lg-1991", "date": "August 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 138050610}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Grabbed a few days away having found B&B online for £42... fantastic deal! A clean, tidy and superbly staffed hotel. The guys on reception were extremely friendly and even stored our bags for free after checkout. The DLR is right next door so it is easy to get to all parts of the city. Breakfast is great and includes a huge array of choices, the full English was superb. Room facilities were great and the shower was superb. Great for a stop over and plenty of space in the room.", "title": "Great hotel at a great price...", "user": "Marcus S", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137992148}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I booked into this hotel on one of those \"secret hotel\" deals where you don't know exactly what the hotel is until you've paid. It's based in London's docklands on the DLR (Docklands Light Railway) and is right beside the Excel centre which was used for the London 2012 Olympics. It is part of a chain of medium to high class hotels; in this case it's really a 4.5 star hotel because the staff are ultra courteous and friendly and the surroundings are immaculate. The breakfast was superb; one of the very generous continental buffet/smorgasbord type offerings which had loads of cold and hot foods plus beverages to match. It's hard to find fault with it. The rooms are large, well stocked out and the equipment is new and of a high quality. The only disadvantage would be that it is not in London city-centre and so there aren't a lot of sights and sounds nearby and you have to travel out to it but the DLR is new and efficient. Novotel Excel seems to be aimed at upper end business travellers but if you can get a reasonably priced room, which was the case here, it's execptional value for money. It would be a good base for a family or a business person. One very small quibble, if you like warm rooms this hotel is for you. The hotel has a very particular type of ventilation and air conditioning system which I found, even on a slightly cold London summer's day, to be quite warm and which caused me to open the window. Small point but if they could sort that out it'd be even better, which would be hard.", "title": "Warm people, warm hotel.", "user": "TouristVisitor01", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137923677}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at the Novotel London ExCel this weekend after the Olympic closing Ceremony and were pleased with the quality for money. Yes, it was slightly shabby in places - walls could do with a paint job, a triple room strangely only came with coffee mugs and towels for 2 and the toilet being in a separate room entirely from the shower (and without a sink seemed a little unhygienic) all seemed a little strange. But the location is awesome, overlooking the ExCel and the river. Although we were on the flightpath for City airport, the noise levels were fine with the window shut and flights seemed to be within very limited hours. Toiletries were very good and bottles of water were free in the mini-bar. The mattress was a little thin for my liking though, particularly so on the sofa bed.", "title": "Not luxurious - but serves its purpose well", "user": "Michelle S", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137102283}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed as a family to watch the Paralympics, including one day at Excel, so geographical location was excellent. With the sofa folded down to a bed, there wasn't much free room, but it was comfortable, clean and well equipped.", "title": "Good hotel - good restaurant!", "helpfulness": 1, "user": "The3holidaymakers", "date": "September 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139878966}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The breakfast was good, but we agree with previous review about the eggs being soggy (though we asked for fried eggs instead) and the rest of the food being delicious. We were pleasantly surprised by the dinner in the hotel restaurant: one of the best hotel dinners we've had for a while - we chose to dine there all three nights.", "title": "Excel hotel", "user": "Excelyourself", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139515720}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I would highly recommend this hotel for anyone wanting to stay in this area of London - fantastically located for the Excel centre and very close to the DLR, with a lovely view from the dining area of Victoria Dock. Particularly impressed by provision of a mini play area in the downstairs lounge for children within sight of the dining room - well planned, whilst still providing stylish accommodation for the adults. The staff were friendly and efficient. Only slight quibble was soggy eggs and tough bacon at breakfast - the rest of the buffet was delicious though. We were two adults and two children and the Executive Queen suite we got had a double bed and a fold out double sofa bed, both of which were very comfortable and there was still plenty of space in the room to move around - I would recommend this room as a great economical way to have a family hotel weekend if you have young children.", "title": "I night stay for Paralympics", "user": "mandkhols", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 139390368}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Public areas were pleasing and contemporary. Reception staff were efficient. Breakfast was good with a great view form the dining area and waiting staff were attentive. However as soon as we arrived on floor 2 it felt like we had stepped back 10 years in decor etc. Room was not as well appointed as Holiday Inn Express or Premier Inn rooms that we have experienced recently. Disappointing for 4 star but acceptable 3 star.", "title": "Friendly", "user": "Fitfall", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139240596}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 45, "average": 139, "very good": 488, "terrible": 9, "excellent": 313}, "aka": "Novotel London Excel Hotel", "slim_ranking": 0.235348837209, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "A contemporary waterfront hotel located 150 metres from the ExCeL London & ICC (Exhibition Centre)and near the O2 Arena, Canary Wharf, Stratford, London City Airport (LCY) and historic Greenwich. The hotel is ideally located in the capital’s dynamic eastside and close to Westfield Stratford City shopping centre, which is only 10 minutes away. Novotel London ExCeL is a 5 minute walk from Custom House D.L.R. station. All Novation rooms have en-suite bathrooms with a bath and separate shower unit, as well as pivoting desk for working or dining, high speed internet, Wi-Fi access and satellite TV. The Upper Deck Restaurant offers panoramic views in a relaxed environment overlooking Royal Victoria Dock. Open from 6am to 10.00pm the Upper Deck also offers 24-hour room service. Paid car parking available."}