{"user_rating": 4.0, "review_count": 1021, "name": "Novotel Athenes", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Dont know where to start i have a a-club gold membership and always trust accor so booked for 1 night on transit at athens was surprised from the time i took taxi they told me this is dangerous area and since i have young children i should not step out with out taxi .I called a friend he had worse reviews to say .I reached hotel it was deserted look i checked in came back in evening there was not one person on the street my children were scared we had dinner in the room when ever i came down in the lobby look was of Haunted house .trust me the hotels not worth staying", "title": "Haunted House", "user": "shakungifts", "date": "June 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 163666087}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "the hotel it self was fine, going half board was a let down as the food wasn't great. Breakfast was cold most days and very repetitive. Drinks are expensive so a bit of advice is to go to the supermarket opposite. Not a safe place to go off walking, a man was stabbed at the cash point. the city is like a ghetto not what you'd expect from a capital city in europe", "title": "ok hotel", "user": "steve20121966", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 163594982}, {"rating": 4.0, "title": "Very Good!", "text": "Hotel was very good. Room was clean, comfortable, and modern. The roof garden had a nice view to the Acropolis. Breakfast buffet was very good. Yes, the neighborhood is not the greatest, but it's not horrible either. A taxi cab cost five euros to take you to the center which it's not expensive at all. The staff was friendly and helpful.", "user": "ElChingonn", "date": "June 8, 2013", "id": 163363602}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I visited this hotel in Jun 2013 while on a very hectic and tiring business trip. Also, I was having a severe back pain too. Thus I was not in a good humor, when I reached this place. However, wonderful service by all the guys here turned that trip into a delightful experience. They did a fabulous job! I never felt away from home. Room which I got was very clean, spacious and had a fridge, comfy, bed, wi-fi access and lovely bathroom. Food was yummy and breakfast was sufficient. I will love to recommend it.", "title": "Awesome Stay", "user": "Sarunas J", "date": "June 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163253090}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We needed a convenient place in Athens for one nigt before pursuing our trip to the Ionian (sailing week), the Novotel ticks (nearly) all the boxes: good 3* comfort, great value for money, even by Greek standards, free secure parking, free buffet breakfast (a must before our long drive to the Ionian) and, cherry on the cake, roof top restaurant & pool with view on the Acropolis. The location may not be glamourous, it is still quite convenient by car. Only small minus, the rooms are rather small.", "title": "Convenient stopover in Athens", "user": "SirEricFox", "date": "June 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 162772861}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed at this hotel for three nights before heading south in June 2013. The staff were friendly and helpful - the front desk was always happy to book taxis, restaurants etc.. The room was clean and functional. The roof top restaurant was reasonable albeit a little expensive but the views were stunning. The breakfast offering were slightly disappointing. The hotels location was not what we were expecting as was a little worrying at times.", "title": "Good place to stay for a business trip", "user": "Traveller000011", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 164644248}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "Have stayed there for two nights on business trip. I am a frequent traveller but never experiences such low quality and selection of food in any 4* hotel. Avoid breakfast here if you can.", "title": "Poor service, worse breakfast", "user": "kispal73", "date": "June 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 164579942}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Otherwise OK to stay there.", "title": "Perfect hotel in Athens for one night...", "helpfulness": 2, "user": "JorgeRK", "date": "June 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 164373827}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We decided to stay in the Novotel Athens for one night prior to our Azamara cruise... we had two rooms (one single and one double) for me and my husband and one for my sister... The rooms were comfortable, good isolation and comfy bed (loved the pillows...). Breakfast was included in the price and was very good, a lot of variety and options in a nice setting... the roof top pool/restaurant/terrace is AMAZING... a very nice view of the Acropolis, food was OK and the drinks cold... the pool is not so big but it is OK, it has space for sun lovers to lay down in some comfortable sun beds around the pool...", "title": "Friendly and helpful staff", "helpfulness": 1, "user": "StevAus", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 164111901}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We can definitely repeat our stay at this hotel...", "title": "Sublime view and wonderful food", "user": "MacLancashire", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 163809115}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Contrary to other Novotel hotels staff is extremely friendly and pleasant. Also restaurant meals are adequate and much bigger comparing to the Italian and French Novotel hotels. Garage and internet (admittedly limited to 256Kbit/s) are free of charge. Definitely good value for the price.", "title": "Good value for the price", "user": "Wdyfmwsn", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162128211}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "After staying mostly in private run hotels for our Europe tour, it felt luxurious to come to this place.", "title": "A Lovely Break", "helpfulness": 1, "user": "AlyssaSaturley", "date": "May 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 161896679}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The lobby was gorgeous. The roof top pool was smaller but very modern and beautiful. Our room was modern, well appointed and immaculate. The gift shop was great and I bought lots of souvenirs there - good prices.", "title": "Confortable room", "user": "es-travler", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 161848492}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "We didn't go for the breakfast package here just because the place was already a bit of a splurge for us, but the restaurant looked really good. Lots of after-work traffic from polished young professionals for the lounge and dinner, which I take as a good sign.", "title": "Novotel Athens", "helpfulness": 1, "user": "Pablo V", "date": "May 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 161777943}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The neighbourhood was really great for finding the things you need. We ate at an inexpensive little restaurant (Greek food) a few blocks away that seemed to be very popular with the locals - they were selling lots of take-out. It was delicious food. There's a pharmacie, book store and small grocery store all nearby also.", "title": "Weekend Break in the sun", "helpfulness": 1, "user": "277MaryK51", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161720159}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I was attending a conference at AUEB and stayed here for 6 nights. Front desk staff and housekeeping were friendly and responsive. 15 mins walk to AUEB, 10 mins to the National Archaeological Museum and Omonia Sq, hence it is central. The hotel is in the middle of an ethnic area, but is not unsafe. Rooftop restaurant was closed due to 1 day employee strike (not uncommon in Greece), so we ate at the buffet restaurant downstairs. Food was ok, and you can definitely do better outside but we were too tired with evening arrival. Good spread at breakfast but it does get tiring after 6 days. It's very busy on certain mornings with tour groups, and dining room staff were very, very, very, very slow in turning the tables around. The rooftop pool and bar was excellent, if you can find a spot. Small pool/area, and the loungers get populated very quickly. Note: vacationing families and their kids don't move out after they settle in by the pool for the day.", "title": "Great start with hotel breakfast", "helpfulness": 1, "user": "Edster1971", "date": "July 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166142262}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Just another Novotel ..... my daughter commented that even the amenities in the room are exactly the same as any other Novotels we stayed in Europe. The only difference, and our gripe -- no facial tissue provided, but there were paper towels provided instead. The location is also not too ideal.", "title": "A typical Novotel", "user": "Peggy222", "date": "June 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 165729655}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We were initially apprehensive about staying here as some reviews mentioned the not-so-appealing character of the neighbourhood. However, we can now say that we would stay at the same hotel given the opportunity to travel to Athens again. The hotel appears new with great amenities including free wifi and everything works well. There is a rooftop restaurant with a good menu, a scenic view of Athens at night and a swimming pool. The staff were friendly, helpful and efficient. Although we arrived several hours ahead of check in, our room was already ready for occupation. The hotel is near enough to all the major tourist attractions and within walking distances of two metros. It is true that the neighbourhood around the hotel has seen better days but at no time did we feel unsafe, albeit we did make it a point not to return too late by foot. And yes, the breakfast is great too! Overall, great value for money.", "title": "Great hotel worth re-visiting", "helpfulness": 1, "user": "cky2011", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 165407848}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We arrived very early in the morning and they were there to welcome us with a smile. It is very hard to get things outside business hours as housekeeping and room service shuts down, not good if you need a coffee etc. rooms are newly renovated and very clean. We had a sofa bed which was also very comfortable. We stayed 2 nits. Breakfast had good variety and was very affordable as was the hotel. Metro station is a 5 minute walk from the front of the hotel. Would definitely consider again.", "title": "Good location", "helpfulness": 2, "user": "Belle J", "date": "June 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164864946}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed for 2 nights in Novotel Athens in may 2013. It's at Larissa station, a few stops away from Syntagma. The hotel is a good 10 minutes walk from the mrt and not very easy to find. During our stay we did not see any notorious elements in the neighborhood ( we did not venture out post sunset).But I have to say this is not a neighborhood that would make you feel very safe as well.", "title": "Awesome rooftop bar!", "helpfulness": 1, "user": "RemyaI", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 164858012}], "location": {"country": "Greece", "region": "Attica", "continent": "Europe", "city": "Athens"}, "stars": 4, "variance": {"poor": 46, "average": 203, "very good": 536, "terrible": 18, "excellent": 218}, "aka": "Novotel Athenes Hotel Athens", "slim_ranking": 0.198581560284, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "description": "For a family holiday or a business trip, the Novotel Athens is designed for natural living. This 4 star hotel in the centre of Athens is close to Omonia Square, Larissis station and the National Museum and features spacious, ergonomic rooms for your comfort and well being. Get down to business with internet access and meeting rooms. Relax in our modern, open plan bar and restaurant with well balanced Mediterranean cuisine or at the rooftop bar and restaurant beside the pool. Free onsite parking. FREE wi-fi."}