{"user_rating": 4.0, "review_count": 917, "name": "Novotel Birmingham Airport", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Stayed here on business for two nights whilst working at the NEC. Would have preferred the Metropole but it was full. Room was OK, but not worth the money. I have stayed all over the world in hundreds of hotels and it's fair to say that I do notice the little things. This is what I would consider to be a highly priced 'no-frills'. OK, you get drink-making facilities in the room...with the cheapest biscuits imaginable; you get broadband.....if you don't mind paying £20 for 24 hours' worth, when it should in my opinion be free; you get to park close by......if you're OK with paying £20 a day; but worst of all is the service. Begrudging, unfriendly, can't-do attitude. I wanted a little bit of fresh milk (can't stand the UHT milk/cream they leave you in the room), and asked downstairs. The flustered receptionist made a phone call (why?) and then told me someone could arrange to bring some up for a £3 room charge! - In spite of me being stood there. So instead, I asked a nicer person in the restaurant just next to reception, who of course gave me a small jug of milk: no charge. On check-out, the woman didn't even look at me. She barked something incomprehensible at me, which on repetition turned out to be, 'Did you use the mini-bar?'. After hearing my 'No', she just pushed my bill at me: not what you expect for £175 a night! So, if you've got spare money, or if you're spending someone else's, and don't mind a bunch of staff who seem to think they're there just to get money off you and to ensure that you don't make any demands on them, this is the place for you.", "title": "Got money to burn? Not bothered about customer service?", "user": "Paul U", "date": "September 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 118731993}, {"rating": 2.0, "title": "unhelpfull service", "text": "having an early new york fight i often stay at one of the hotels at the airport but on this occasion my room smelt of smoke and i asked to be moved but got told this was not possible. having paid 139 pounds and having to put up with someone else smoke and then been given the cold shoulder at reception was a very poor start to my trip", "user": "A TripAdvisor user", "date": "September 23, 2011", "id": 118484557}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "i used to avoid this hotel as i thought it was a complete dump when i last stayed. the rooms have been refreshed and i will stay again. i stayed in an executive room and it was worth the extra money .hotel location simply cannot be beat . staff very friendly and breakfast was very good. overall worthy of its 4 stars.", "title": "much improved", "user": "armagh222", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118380033}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Good hotel, clean friendly and modern. The only downside is we paid £15 each for a breakfast! I would recommend going to one of the airport restaurants for breakfast for the same meal but cheaper. Dinner was lovely and the staff are very friendly and helpful.", "title": "Good hotel enjoyable stay", "user": "Thefunkylibrarian", "date": "September 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118363796}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stayed overnight here for an early morning flight. The hotel is nice and modern and clean.", "title": "Modern and Clean but poor breakfast", "helpfulness": 1, "user": "Monty222", "date": "October 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118989942}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Checkin was slightly slow but I understand a new computer system had been installed that day so didn't mind waiting. In the evening I had a nice meal at the bar before retiring to bed.", "title": "The food's better than you expect and the people are pleasant", "user": "Bagster", "date": "October 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118953765}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "As I had an early morning flight I was glad to see that breakfast opened from 5am however I had to wait for 10 mins for a cup of coffee and fruit juice as neither of these were available to pour ourselves. They also didn't have any orange juice.", "title": "Airport Hotel", "user": "Vic1056", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118862992}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Overall a good experience but 16 pounds for a breakfast without free flowing coffee and no orange juice...!?", "title": "Good overnight stop for early morning flight", "user": "Mazzy9", "date": "October 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118858075}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed here the night before our early morning flight back to the states. I thought it was a little expensive for the location and it didn't include breakfast. The room service menu was ok. We ordered an evening snack and didn't love it. The staff is friendly. The beds are fine. It was super convenient to wake up and walk across to the airport to catch our flight.", "title": "Good Location for Early International Flight out of Birmingham", "user": "LizzChicago", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120065646}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have had the misfortune of staying in this hotel twice and will not be repeating the experience again. Where do I start, the rooms were dirty, the service in the restaurant was very poor and the quality of the food the same, to top that off they tried to add an additional charge onto the bill the following morning for food we did not have in the restaurant! The service all over left an awful lot to be desired including reception where they tried to overcharge us not only with the restaurant bill but also for breakfast which we did not have. Overall I would not recommend anyone to stay at this hotel.", "title": "Very Poor Hotel", "user": "LisaCoKerry_Ireland", "date": "November 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 120007873}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We used this hotel for an overnight stay between flights. it is very close to the terminal yet with the excellent window glazing we could not hear any airplane or other noise. You would not guess you were at an airport. The rooms were fine for us with good beds for the children, one a teenager, the other trying to be, but not there yet! They were able to share our room and that entitled them to a free brea\\kfast. We had a late night snack and breakfast. The quality of the food is excellent as is the service. The only down side was the temperature of the room at night, it was too warm for us.", "title": "Good position", "user": "Jolly2011", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119802132}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "stayed at the Novotel Birmingham airport a few days ago on return from a late night flight.", "title": "good airport hotel", "helpfulness": 1, "user": "Oceangirl007", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 119601604}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "The hotel is very close to the terminals which is excellent, the staff is friendly and the checking in process very swift. The rooms are adequate, they have a decent bathroom with a seperate toilet which is ok. The bed is fairly comfortable. There is also a sofa in the room but our room was quite small and it seemed a bit swamped with all the furniture. Although thought has been put into soundproofing, you are still aware of planes landing and taking off if you are a light slepper. There can also be a lot of noise early in the morning from other guests who may have an early flight to catch. There is a mini bar but dont use anything unless you are prepared to pay.", "title": "Great location for the airport", "helpfulness": 1, "user": "furgus", "date": "October 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119522851}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "My husband and 16 year old daughter and her friend stayed here while attending a concert in the LG arena.He said that was the most comfortable bed he had ever slept in, the girls agreed.Even though the arrived early, they had to wait till 2pm before they could check in, even though the booking form said 12 noon.", "title": "best sleep i`ve had in years!!", "user": "parrot85", "date": "October 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119519565}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The hotel has a good hot shower and was cleaned to a high standard.", "title": "beats all the other birmingham airport hotel's hands down!", "user": "AgelikiADDICTION", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119398410}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "It is situated in a excellent position for the airport, train station and the NEC.(all attached to each other). Parking was pricey at over £20 for 24 hours!!! (with a voucher)", "title": "Thin Walls and no Alarm clocks", "user": "dynachem", "date": "October 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 119364731}, {"rating": 4.0, "title": "Great hotel for those early flights", "text": "Myself and my Mum stayed at the Novotel Birmingham Airport for one night, before flying out to Portugal in early September on an early flight, and the Novotel turned out to be better than our hotel in Portugal! We checked in quite late, and were greeted by very friendly, smart staff. The hotel was stunning, with a overpriced, but classy restaurant to the right hand-side. We were in room 206, and the room was absolutely 100% clean, with a huge bed, an iPod docking station, and a television with an excellent signal! We did pre-book a Superior suite online a few months before, but for the same price as a normal room as it was on offer. The bathroom was packed full of complimentary moisturisers, shampoo's and shower gels, as was the minifridge which was packed full of chocolate, bottled waters, crisps and all sorts of snacks and wines.", "user": "A TripAdvisor user", "date": "October 10, 2011", "id": 119137354}, {"rating": 5.0, "title": "Excellent", "text": "Overall, I actually have nothing to complain about, for once!", "user": "A TripAdvisor user", "date": "October 8, 2011", "id": 119068820}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 43, "average": 168, "very good": 390, "terrible": 29, "excellent": 287}, "aka": "Novotel Birmingham Airport Hotel", "slim_ranking": 0.239130434783, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Novotel Birmingham Airport is located at Birmingham International Airport, opposite Terminal 1, 20 minutes drive from the centre of Birmingham. Adjacent to the NEC and offering modern meeting rooms, this hotel is ideal for a business trip. A free SkyRail service every 90 seconds links the hotel with Birmingham International railway station and the NEC. Elements restaurant and bar with 24 hour room service. Fitness and excercise room. NCP multi storey car parks adjacent to hotel (fees apply)."}