{"user_rating": 3.5, "review_count": 976, "name": "Novotel Sydney Brighton Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I shouted a night here for my partners birthday. It is a lovely hotel with very welcoming staff.", "title": "Great stay", "user": "LynneM47", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175174614}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed overnight before going overseas. A balcony room with a very comfortable bed, separate lounge area and large bathroom suited our needs. Furniture was all a bit dated but clean & tidy. Restaurant was booked out but there are many dining choices just around the corner. Breakfast was very busy but staff managed OK.", "title": "Dated but has charm", "user": "wiskey", "date": "September 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 177714895}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "As we stayed on a Saturday night we were able to get a late check out (5.00pm) at no charge which was really great as our flight was not until 9.00 pm.", "title": "A Nice Night Away", "user": "GGiannopoulos", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177372339}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Upon arrival, we were greeted with excellent and friendly service. The room and the view were amazing. Room service was prompt and friendly. Also the location was convenient", "title": "Old Rooms WAYYYYYY over priced....tired....", "helpfulness": 2, "user": "JalanJalan69", "date": "September 15, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 177225048}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We are Accor members but as we hadn't stayed at Novotel Brighton before, took advantage of a Scoopon voucher for $149 for our wedding anniversary. This included one night's accommodation in a Bayview Suite, complimentary bottle of wine and late (1pm) checkout. We were greeted by the lovely Tahlia at Reception who gave us a beautiful suite (room 1110) on the 11th floor with an amazing view of the bay. All the staff we dealt with couldn't be more helpful or attentive - a great team. At night from our balcony it looked like fairyland with the lights from across the bay and we could watch the planes landing and taking off from the airport a short distance away. The suite was lovely and the Assistant Manager Mitchell Cole had left us a nice bottle of red with a personalized card in the living room. The bathroom with a separate shower and bath was well appointed with toiletries and a full size hairdryer. There was also a stocked mini-bar and nibblies, 2 large flat screen TV's, large living room, a full size ironing board and iron but surprisingly - no robes or slippers, an extremely comfortable king size bed with extra pillows and large bedroom. The only criticism I would have, and it has nothing to do with this quality hotel, is the street noise on a Saturday night that reverberates into the room (even at that height with the balcony door and drapes shut). They could do with double glazed windows or some form of noise cancellation. The breakfast was a great buffet with plenty of variety and the usual stations you would expect. The hotel lobby also has a wonderful smell generating through it - some type of floral fragrance which is lovely. From the hotel you can access the shopping mall where we got a late night coffee and cake which we took back to our room. The restaurant strip is within minutes of the hotel and there is a bottle shop and supermarket very close by up Bay Street. We would definitely stay at the Novotel Brighton Beach again.", "title": "Novotel Brighton Beach Sydney", "user": "Sue_Coupe", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175058438}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Although only an overnight stay, the Novotel Brighton Beach was an excellent choice of hotels. Having booked my stay some months before travel, I broke my shoulder in the meantime and my partner then had to accompany me. On advising the hotel that my partner will be sharing my room and require breakfast as well, they responded that no additional charges will be required - a very generous offer indeed. Our room was generous in size and had a wonderful view across the bay. The buffet breakfast - well, what can one say except \"spoilt for choice\"! Hotel highly recommended.", "title": "A top stay at Novotel Brighton Beach", "user": "JMG256", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174391615}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I often stay here for business as my company has an agreement with Novotels. I have stayed at over 20 Novotels worldwide and this is by far the worst. The entire hotel is old and rundown and well overdue for a referb. Its ok for an overnight stay especially if you are only sleeping here. The location is ok with plenty of cafes, shops and a Coles supermarket all within 500 meters. One of the biggest disappointments is that this particular Novotel do not recognize my A Club platinum status. If I was paying I would not choose to stay here.", "title": "Not worthy of being called a Novotel.", "user": "Dan_nz100", "date": "August 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 173615873}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here on Sunday night and we arrived early and the desk clerk upgraded us to a lovely bay view room. We were able to freshen up before going for lunch. When we arrived back we sat on the balcony and watched a wedding down on the promenade. The hotel room was very spacious and we had a spa as well which was relaxing. We also watched planes landing in and flying out of Sydney airport which was really cool.", "title": "Birthday Night", "user": "Baznjules", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173409077}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed in july for state of oigin decider. Lovely area, good views, very helpful and friendly staff. Wheelchair access room for family of four was pretty cramped, not ideal for us at $200 night. However the smiling staff are a real plus, good eateries close by.", "title": "novotel brighton le sands", "user": "pixie001Cairns", "date": "September 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176824567}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We only had a one night stay before jumping on a plane early the next morning but the bed was so comfortable. We had an amazing sleep. The shower wasn't all that great but it may be different in other rooms as I think we were placed in a disabled room with a handheld shower head. The staff were very helpful and I would definitely stay there again for the convenience and comfort.", "title": "Supremely comfortable. Great location.", "user": "Alisha N", "date": "September 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176697287}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Attended a conference at Novotel Brighton le Sands. Hotel rooms were spacious and well appointed, great view of the Bay. Staff were very friendly and accommodating and conference meals were very good. Happy to stay again", "title": "Short Stay Great Service", "user": "JohnMu2101", "date": "September 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 175990271}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 73, "average": 242, "very good": 370, "terrible": 51, "excellent": 240}, "aka": "Novotel Sydney Brighton Beach Hotel Brighton Le Sands", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Novotel Sydney Brighton Beach is a 4 star hotel situated opposite Brighton Beach in Sydney. With sweeping views across Botany Bay, this hotel is conveniently located only 15 km from the city centre and 5 minutes from the airport. Perfect for businesstrips and holidays, all 296 rooms boast private balconies. The hotel features a bar and restaurant, plus 11 meeting rooms accommodating up to 500 delegates. Leisure facilities include a swimming pool, fitness centre, spa and steam room.Novotel Brighton Beach offers a variety of facilities including landscaped *outdoor swimming pool, indoor pool, steam room, large modern gymnasium, restaurant and bar, Day Spa and Health Centre and 11 versatile function rooms with an experienced conference and events team to facilitate your next function."}