{"user_rating": 3.5, "review_count": 574, "name": "Novotel Geneve Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This hotel is very centrally located, and you can walk to pretty much all of the major sights. It's also not far from the main railway station.", "title": "Functional and clean, fantastic location", "user": "tflynnuk", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11709622, "likes": {"liked": "— Location", "disliked": "— Being overlooked directly by a block of flats!"}}, {"rating": 2.0, "title": "There must be better options", "text": "It looks to me as if it's an older hotel thats been refurbished, as it looks a little dated from the outside. When you go in though, its all been nicely fitted out. The lobby is stylish, if not a little dark, but creates a good first impression.", "user": "NYC2TLV", "date": "December 10, 2007", "id": 11471379}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I had a room facing the street outside, and literally, directly facing a row of flats/balconies right infront of me. The windows are two-way mirrored, so they could not see in, but I could see out, and one flat did have a party with their mates out on the terrace in the evening - not ideal! Luckily I wasn't in the room for much of the evening so the noise didn't disturb me. Something to consider when booking a room though.", "title": "Location close to everything", "helpfulness": 1, "user": "wareinbelgium", "date": "November 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 10988979, "likes": {"liked": "— Location", "disliked": "— room temperature"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The room was large with a living area, and double sliding doors to the bath/shower room, and a seperate toilet on the other side, near to the actual room door. Unconventional layout, but again something to do with the age of the hotel I assume. Everything was new and clean, and the room was light and airy.", "title": "Highly Recommended for both Value and Experience", "user": "studyabroadhoya", "date": "November 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10870068}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The lifts to access the rooms seem a little tempremental, I had a tour of most of the floors and basement before I arrived at my floor, despite none of the other lift buttons being illuminated!", "title": "Superb 4 stars hotel in Geneva", "helpfulness": 2, "user": "bala68", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10094662}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "great hotel in the lively paquis area of geneva. not far from the train station and very close to the lake. great rooms on the top floors, complimentary internet connection, spa and gym. many will find the two breakfast options overpriced.", "title": "excellent", "user": "marselkuzyakov", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33762540}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The best thing the hotel has going for it is location. the train station is three to five minutes walk away, and it's a short walk to the lake for those lovely afternoon strolls. On the other hand, the hotel is right in the middle of Paquis - Geneva's red light district. I felt uncomfortable returning to the hotel at night as I had to pass by all these women standing at corners.", "title": "Central location, close to train, lake and night life", "user": "maryCapeT", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32867729}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel itself is a regular Novotel chain hotel - nothing spectacular. The service was good, breakfast had a fair selection of items. I especially liked the cheese platter that was available every morning. I thougt the hotel was rather overpriced at 250 euros per night for a double room. But internet access is free both in your room and in the lobby.", "title": "Contemporary, Value, Great Location", "user": "ZenHealer", "date": "May 17, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 30158668, "likes": {"liked": "— Location, value, contemporary", "disliked": "— 6 steps below street level with no ramp for luggage."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "This is a typical Novotel chain hotel, upscale, functional and good value if you can snare one of their online deals. we got a double room for 112 Euros that included breakfast, feee internet, spacious room and bathroom. There was a spanking new spa with free access to the sauna, steam, hammam, gym etc. The breakfast was a typical 4 star chain hotel buffet spread. The hotel is done up in contemporary style. It is a 10 minute walk from the station, and is also a 10 minute walk to the Lake.", "title": "Excellent location in the day time, but not at night", "user": "HKGTravelLover", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 28790184}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This is the first time me & my other 2 friends travelled in Switzerland. Everybody told me that the living cost in Switzerland is super high, so I searched pretty hard to find a decent hotel in Geneva with reasonable price. It was difficult as it was a skiing season & there's motor show. I asked several with rate for a triple room less than 200 CHF but all of them were full. Then I visited Accor website & found Novotel. I booked it with coorperate rate & it costed me 203 CHF excluding tax for a room with 2 queen size bed.", "title": "Excelent hotel", "user": "JavierMadrid", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28277663}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Different choices of rooms, we had a double and a triple room. Good security; need a room key to work the lift for instance.", "title": "Dodgy neighbourhood, good hotel", "user": "Lilja70", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 129304749}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The breakfast was good, many choices (scrambled eggs, bacon, sausages, potatoes, selection of cereals and breads, excellent cheese-plate, fruits and salad-bar, yoghurts etc etc etc.)", "title": "I admit upfront that I have not...", "user": "BigDan133", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 129028341}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The free bus-pass was excellent, worked on busses, the tram, the little yellow boats that cross the lake, and more.", "title": "reasonable hotel in a bad neighborhood", "helpfulness": 1, "user": "Joe A", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 128698193}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very clean hotel, friendly staff that recognized us (in a polite way!) the next morning. A knock on the door occationally to make sure the mini-bar was filled was more of a nuisance really, as they seemed to find me just as I was having a short lay-down, but polite and well-meaning.", "title": "Nice hotel", "user": "Cruiser12345", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 128177625}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Quick and efficient check-in and -out.", "title": "Good location, Nice Hotel", "helpfulness": 1, "user": "eipamay", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128049434}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This hotel is a \"typical\" Novotel that you find everywhere with decent space in the room and clean. The restaurant is limited and breakfast is average; the gym is rather small but fits the purpose. However just in front of this location there are guys selling drugs; do not seem dangerous however feels uncomfortable (at least to me). Avoiding this drug selling scenario I took an alternate street (towards the train station) and to my surprise the red light district starts 50 meters from the hotel. Believe me, the offering in the red light district is 24 hours!", "title": "Novotel Geneva Center - Ok but not nice location", "helpfulness": 1, "user": "Julius S", "date": "May 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 130063342}, {"rating": 4.0, "title": "Convenient for city centre but poor breakfast.", "text": "This hotel is very convenient for the centre of Geneva being a short walk from the station, with easy access to the airport, and the lakeside. Hotel staff were helpful and the room was comfortable and spotlessly clean. Free wifi and city trael are definite bonuses. Don't bother with the breakfast though as it's expensive and not good. In all a typical corporate business hotel but rather clinical.", "user": "Weyward62", "date": "May 12, 2012", "id": 129810879}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Novotel Geneva is well located for shops and lake in Geneva. Only a few minutes walk to the lake. Yes it is in the red light district but that is not a problem and should not put anyone off this hotel. The breakfasts are excellent with a good selection and the staff are very helpful. Good sized rooms. Would I go back to this hotel. Without a doubt.", "title": "City centre", "helpfulness": 1, "user": "Dorothy H", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129539952}, {"rating": 5.0, "title": "5 Blocks to Cornavin Railway Station but Be Careful!", "text": "The Novotel Geneve Centre is nice and clean and had a large bedroom with desk and comfortable king size bed. Good value for the money, although its not a 4 star place by American standards. The lights were strange - be sure to keep the room key in the slot or else they will go off after 5 minutes. The breakfast was wonderful.", "helpfulness": 5, "user": "Penny M", "date": "October 3, 2007", "id": 10037005}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The reason I say be careful is that while walking from the train station, we had our backpack stolen from the luggage cart. A man distracted my husband by saying a bird had pooped on his coat. As he turned around, the backpack was taken. We didn't realize it until after we had checked in and were unpacking. Of course it contained all our important papers, rail passes, money, etc. but the hotel was nice and helpful.", "title": "Modern, centrally located hotel", "helpfulness": 2, "user": "Sarah-louise27", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 10024348, "likes": {"liked": "— Clean, modern room", "disliked": "— allowed smoking in the corridors..."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the Novotel Geneva Center from Friday 28 - Sunday 30 September 2007.", "title": "Geneva", "user": "annvelo", "date": "August 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8458930, "likes": {"liked": "— the cleanliness of the hotel. it was so comfortable", "disliked": "— The underground parking has limited headroom for vehicles with topboxes"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This was our second stay in a Novotel hotel, the first being in New York and we wasn't disappointed.", "title": "Real bargain", "helpfulness": 1, "user": "brigadoon", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8397902, "likes": {"liked": "— Advance booking price."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "For the price, you cannot go wrong.", "title": "Nothing Special, Just a Hotel", "helpfulness": 4, "user": "PlateMan", "date": "August 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 8362310, "likes": {"liked": "— Free Internet, Location", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Yes, the hotel is situated in the \"Red light\" district but the girls standing around just give you a friendly smile and say hello. On the other hand, you have dozens and dozens of restaurants within a few minutes, the lake within 8 minutes and the railroad station within 5 minutes. I got a very friendly reception, fast check-in and a large and quiet room with two queen-sized beds. All very functional and clean, no unnecessary little gadgets. My only complaint would be the very hard mattress, but it is the same as in all Novotel hotels. Excellent breakfast at a reasonable price and large choice of free newspapers. This is a hotel for businessmen, not a romantic place. There is a fitness room and a small spa but the person at the reception made no mention of it - pity. Not cheap, but Geneva hotels are expensive. Would definitely return for its efficiency and location.", "title": "Great location", "user": "blacklab", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49169914}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We chose this hotel as it seemed close to the Lake and town centre, which it was. But it is basically in the Red Light district, so if you have kids with you, they may ask why there are so many ladies standing around on corners! There are also a number of SEX shops in the area. We did not however feel unsafe walking around at night. The hotel is opposite a Night Club and we were wakened with extremely loud music around 3am until 4am. Other nights, taxis would arrive to collect people at the hotel and hoot their horns at all hours. Having said this, the rooms were extremely comfortable. We opted for one with 2 double beds in, so we always know we are getting a slightly bigger room. Bathroom has glass doors and loo down a little corridor. Mini bar and tea and coffeemaking facilities in room. Cleaning of whole hotel to high standard and multi lingual staff on reception and in restaurant were very friendly. Service in the restaurant was dreadfully slow and we had to ask for bread and butter at dinner. We were the only 2 eating there as the prices were so high. Breakfast was very busy indeed and not large area where buffet was served, so had to queue for some things, but food was ok. The bar is very nice but also very expensive. A beer was £8 and not even a whole pint! Room Service was extremely poor value. The portions were very tiny and you expect a good size Swiss cheese platter for the price they were charging, but it was appalling. Car parking in the underground garage was £10 per night, so again, expensive. If you pay in euros you will get change in swiss francs....Checkout was slow, as nearly everyone was quibbling the price of their bill....But we enjoyed our stay.", "title": "The good and the not so good about this hotel", "user": "LIZGREATBRITAIN", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 49044414}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I stayed at this hotel in Oct '09. Here is our take on the hotel:", "title": "Very Basic", "user": "Marwa_M", "date": "October 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 48062104}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Pros", "title": "Location is great", "user": "donbonMontreal", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47331957}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "1- The location is OK, approx. 10 mins away from the main train station which is good if you are planning trips to other cities/towns. It is 20 mins walking distance away from the Lake and the Main City Center. The location had a lot of doggy business going on at night (Red Light District Area).", "title": "Great location - hotel equipment very good - probably not 4 * though", "user": "Teein1", "date": "October 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 47127561}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Quick and friendly check-out. Room was of an adequate size and was very modern with the usual amenities such as minibar and flat screen TV. The hotel also gives out free transport tickets for the duration of the stay in Geneva which comes quite handy when using buses and trams. Breakfast was very good, with loads of cereals, baked goods, etc. The location is very central and close to the train station Cornavin and the red light district, which may put some non-Europeans off. It is however common with most European towns. Never felt unsafe though.", "title": "Good business hotel in great location", "user": "globetrotterboy", "date": "February 14, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 24562028}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My boyfriend and I arrived in Geneva for an overnight trip by train and had not booked anywhere to stay. After a quick search of the net we found that the novotel was a mere 5minute walk away and for a relatively reasonable 160Francs (not including breakfast). Being keen to explore the city we promptly reserved a spot and strolled over to the hotel.", "title": "Exceeded Expectations", "user": "Alisa04", "date": "February 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 24391775, "likes": {"liked": "— Rooms, Staff, Spa, Room Service", "disliked": "— No breakfast included, Location a little dodgy"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The check in was quick and the staff efficient and friendly. Unlike previous reviews, I found their English more than competent and from what I gathered, the man serving us was fluent in German too. (my boyfriend handled the booking and undertook the transaction in his native German). He even handed me a cute plush toy meant for children after overhearing me gushing about a cute picture on the wall!", "title": "Good value for Geneva", "user": "alberto82", "date": "January 20, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23734643, "likes": {"liked": "— The room and the spa"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We wandered about the area which was very ethnic but the weather was horrible and we retreated back to the hotel and our spacious room with two comfortable double beds, free internet access in the room (if you bring your own computer) and clean kitschy bathroom (N.B. there is no view whatsoever to speak of, we kept our curtains firmly shut). We also found the lovely spa (and small gym) downstairs where we ended up relaxing for 3 hours.", "title": "Modern, close to train station.", "helpfulness": 2, "user": "YYZAC", "date": "January 17, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23627540, "likes": {"liked": "— Clean, modern, comfortable room. Great proximity to train station.", "disliked": "— The area around the hotel is a little sketchy, but I felt safe."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2008", "text": "It was only at night when we really got a feel of just how dodgy the area was. there were prostitutes on every corner and groups of rowdy young men running around - however, I still felt relatively safe as there are plenty of artsy/jazzy bars around the area adding to the atmosphere. Not a place I'd come with children though.", "title": "Not suitable for families", "user": "Critical_TravellerUK", "date": "December 20, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 1.0}, "id": 22873481, "likes": {"liked": "— The room", "disliked": "— The location"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The room was very clean and modern. The food in the restaurant is good, however the service was lacking somewhat. Location wise, the hotel is very handy to the main train station however the area immediately around the hotel is not the nicest. A solid bet for a good nights sleep and breakfast.", "title": "Solid Novotel Experience", "user": "TravelEndlessly", "date": "March 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 2.0}, "id": 14661897}, {"rating": 4.0, "title": "Can't go wrong with this one!", "text": "Just spent a night here and was quite impressed. Modern, clean, quiet hotel located optimally in Geneva. Close to the train station and within walking distance of many things in Geneva. If not, you receive a free public transport pass with your check-in anyway so all bases are covered. Further, free wLAN on the reception floor and free ethernet in the room. Large rooms, huge bed, separate toiket and bath, plus bath has both a tub and shower stall. Very nice! One downside is that the place really isn't that attractive from the outside. This is a minor quibble but I guess that's the point of writing a review. There are more historic and modern looking hotels in town. Nevertheless, feel free to go ahead and book this place. Great location.", "user": "Joizee_HD", "date": "March 14, 2008", "id": 14280001}, {"rating": 5.0, "title": "Great hotel", "text": "P.S. I stayed while the Auto Show was going on. Was pleasantly surprised to come to breakfast and have 25 or so \"models\" who were working at the show as a backdrop. This brings bonus points!", "user": "rock_leg_endBelfast", "date": "February 19, 2008", "id": 13675903}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Booked this hotel through novotel website. Got a great Hot Deal price (for 2 adults and 2 children) Children stay and eat breakfast free under 16. Good location close to lake (5mins) and railway station - Gare Cornavin (5 mins). Clean, modern and well equipped rooms. Ask for room overlooking church/garden for a nicer outlook.", "title": "Great location and atmosphere", "helpfulness": 4, "user": "NME32", "date": "January 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 12916152, "likes": {"liked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Quiet location away from very busy streets. Good breakfast - plenty of choice and well presented. Some good restaurants and food shops close by. Well worth a visit", "title": "Neat Hotel!", "helpfulness": 2, "user": "Tats_UK", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 12103036, "likes": {"liked": "— The room, Good access to rail station and tourist attractions, Bar", "disliked": "— Lack of good views from room, external environment"}}, {"rating": 1.0, "title": "Worse 4 star hotel of all time", "text": "Usually when something goes wrong at a hotel I tend to give the establishment the benefit of the doubt. For the Novotel in Geneva, 5 wrongs do not equal a right.", "user": "4567QBC", "date": "October 4, 2009", "id": 45831275}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "1) Person came in while I was sleeping. Knocked on the door, I said wait, the person came in anyway. And this was after 10 pm.", "title": "Good hotel at the right rate", "helpfulness": 1, "user": "JT14", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 39169247}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "2) Room service was weak. Ordered an omlette with mushrooms. Omlette came empty. The lady said that I had to specify the filling when I placed the order. It was a 25 CH egg.", "title": "great experience", "user": "protect", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38606748}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "3) No toothbrush or shaver. This is not a 4 star hotel.", "title": "Nice hotel, good location", "helpfulness": 1, "user": "Irises2", "date": "July 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 35232283}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "4) Issues with iron. Room service brought be 2 busted old irons in a row.", "title": "Good", "user": "Brank0", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 34661410}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We visited as a bunch of 6 guys to see the Geneva Motor Show. The hotel is in a great location for the main train station and that is the main reason we chose it. It was clean, modern and served a good breakfast, helpful friendly staff too. Not sure if I would have stayed here with the family due to its red light location, also it wasn't uncommon for groups of 2 or 3 guys to be loitering on the street corners which could have been a little intimidating if there weren’t 6 of us. Lots of local bars and restaurants on your doorstep. Walking distance to all of Geneva centre.", "title": "Clean and modern, but in red light district", "user": "SunLuvinCriminals", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 128049174}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very well located to the lake, shopping and restaurants. Easy walk to everywhere. I'd stay here again even though the red light district is right out the door. Didn't feel unsafe at any time even in the evening. The gym and spa are great and the staff are helpful. Very comfortable beds and room that had been updated. We didn't eat there but the cafe looks very \"cool\". It's more like a boutique hotel and there are play stations for kids. I'll be back!", "title": "Great Location With Lots of Colour", "user": "Whistler_Realtor", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127524114}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We have stayed at this hotel a few times but think it is going down hill each time we visit. On the plus side in a good location in a lousy neighborhood. Rooms are getting a little worn. TV horrible. Broken cheap cheap plastic glasses. No coffee for the morning, and so it goes.", "title": "going down hill", "user": "riko77", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 127126832}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I booked a very reasonable weekend rate on the hotel website and was pleased with my stay here. The hotel is just a few minutes walk from the train station and thus is convenient to everything else in Geneva, a compact city. There are also numerous trams and buses nearby if you don't feel like walking. The neighborhood is a bit rough around the edges, but did not seem dangerous and there was no trouble with street noise during the night. There are many ethnic restaurants and food shops in the area, which can be fun to explore.", "title": "Good value in an expensive city", "helpfulness": 1, "user": "inkwave17", "date": "July 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8216101, "likes": {"liked": "— spacious rooms", "disliked": "— expensive breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "As for the hotel itself, I had requested a twin room and so was expecting two twin beds, but was pleasantly surprised when the room had two double beds instead. The decor was bright and functional, but not luxurious. The room was very large by European standards (two comfortable double beds, two chairs, desk), had a nice flat screen TV, and the bathroom was spotless and modern. I don't think I would pay the rack rate here, but for the 'sale' rate I received of under $125USD, this was a great deal, providing comfortable, clean, full-service accomodations right in the middle of town.", "title": "Efficient, compact hotel with comfortable, modern rooms in central loc.", "helpfulness": 1, "user": "Drossoulites", "date": "June 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8027216, "likes": {"liked": "— Comfort / style of rooms", "disliked": "— Cramped entrance lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Just spent 5 nights at this Novotel on a biz. trip. I concur with the other posts here. Renovation work now in lobby now finished, bar re-opened. Free internet in room via supplied LAN cable but this stopped working for 2nd half of my stay. The room layout is very comfortable & state of the art - as said earlier separate bath / Shower cubicle but also sep. WC room too.", "title": "Good value and convienent location", "helpfulness": 5, "user": "flyingroo", "date": "June 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7985741, "likes": {"liked": "— The location and cheap rate", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "Breakfast is usual European buffet with limited hot buffet of watery scrambled egg / bacon / sausage etc plus usual fruit options.", "title": "below 4 stars", "helpfulness": 1, "user": "dantudor", "date": "April 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 7363944}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Had dinner in restaurant once with 3 colleagues - menu is good & very good quality food, but slow in the French style with long wait between courses.", "title": "A pleasant surprise", "helpfulness": 6, "user": "Roman1", "date": "February 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6856147, "likes": {"liked": "— Design of the room", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We went to Geneve on a business/pleasure trip so were booked in this hotel by the company. Its a good enough hotel which is nicely decked out, neat and tidy. Modern style. Rooms are spacious and do like the separated toilet / bathroom idea (though could have done with putting a sink in the toilet) and the beds are comfy.", "title": "Good hotel .. a bit overpriced for a red light district!", "user": "TanzanianTam", "date": "April 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127084699}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We travelled with an 8 month old and whilst the hotel catered very well for this, the stairs at the entrance are a bit of a hassle with a pram *and a bunch of luggage whjen you leave/arrive. THere is a small elevator thing but its painfully slow and almost inconvenient.", "title": "Fantastic service from beginning to end", "user": "Swissphile", "date": "March 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126646113}, {"rating": 3.0, "title": "Clean and functional - bad area", "text": "Unfortunately this hotel does sit in the red light district around some dodgy looking bars and there are a few dodgy looking characters around the area so try and not wander around late at night. During the day it is fine.", "user": "NRJ_68", "date": "March 25, 2012", "id": 126634130}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 47, "average": 145, "very good": 279, "terrible": 14, "excellent": 89}, "aka": "Novotel Geneve Centre Hotel Geneva", "slim_ranking": 0.384615384615, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "The Novotel Geneve Centre is a 4 star hotel located in the heart of Geneva, close to Lake Geneva and 15 minutes from the UN headquarters. The hotel features 206 rooms, a restaurant, bar and 6 meeting rooms for conferences and seminars. This 4 star hotel is equally suited to business trips and holidays with your partner or family. In addition to the fitness centre and spa, with relaxation room, hammam, sauna, solarium and massage room, guests enjoy free public transport."}