{"user_rating": 4.0, "review_count": 954, "name": "Novotel Toronto Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We stayed here for two nights recently on my first trip to Canada.", "title": "Great location and hotel", "helpfulness": 1, "user": "seashellseeker", "date": "July 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8068879, "likes": {"liked": "— Fantastic location and cleanliness of rooms", "disliked": "— No terrace and the bar was a bit uninspiring"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The location is great and easily reached on foot from most parts of the city. We personally found that the bars and restaurants near the hotel were the best in the city - lots of live music and diversity. The construction site is still in full flow, but it is just bad luck for the hotel that it is so close. (We found that no work was in progress over the weekend, though.) Staff here were abolutely fine, in our experience, and the restaurant staff were speedy and efficient. We had an excellent twin room, complete with ironing board and safe. Everything was spotless. The only downside is that there is nowhere to sit outside, as it was hot when we were there. However, the bars just up the road all had terraces.....!", "title": "Enjoyed the Novotel", "helpfulness": 2, "user": "NateAlaska", "date": "June 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7990200, "likes": {"liked": "— Clean and Newly Renovated", "disliked": "— Could hear some noise from the hallway"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Would recommend to anyone.", "title": "great stay", "helpfulness": 3, "user": "Amsterdamfamily", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7722787}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My wife and I stayed at the Novotel for three days this April. The lobby and rooms were clean and everything appeared to be newly renovated. They have Wi-Fi in the rooms and the room safes are large enough for laptops. I like to workout when traveling and was impressed with their gym. Normally, hotel gyms are usually an afterthought but they had numerous cardio and weight machines and several TVs. They also have a pool and a hot tub.", "title": "restored my faith in Novotel's!", "helpfulness": 3, "user": "LMouse", "date": "May 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7715905, "likes": {"liked": "— Location", "disliked": "— Lower floors would perhaps be noisy?"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "If you need to park, there's a public garage that is right behind the hotel. St. Lawrence Market is just a block or so away from the hotel - it's a neat market that is a great place to get a cheap breakfast or lunch. There are also a number of bars and restaurants within walking distance of the hotel.", "title": "Good choice", "helpfulness": 4, "user": "HenkEindhoven", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7654739, "likes": {"liked": "— Location"}}, {"rating": 3.0, "title": "Good location but nothing special", "text": "This hotel is centrally located and within walking distance of the major sights. Our room was clean and sufficient. If you expect to see the skyline of Toronto beware, our view was of the parking garage at the rear of the hotel. Speaking of parking, they do add a hefty parking fee (per day) to the room rate. On the plus side of things, if you have concerns for your personal safety...you might like the idea that the elevators can only be operated by inserting your room key. All in all a pleasant experience but nothing special.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3459986}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Stayed here from April 14th for 5 nights. A few minutes walks from Union Station ( and Royal York Hotel ) so getting to / from using the airport bus was no problem. Room clean and tidy , plenty of hot water . Staff attentive and friendly . Only had breakfast once, as location puts it 5 mins from St. Lawrence Mkt which has plenty of eateries. Pool a bit small for proper swimming ( 12 meters I think ) but fine for a bit of a work out swim training. Gym had lots of new eqpt and Tv screens as well. Would definitely stay here again and reccomend to others. More \"downtown\" and close to business district / harbour as opposed to centre and nearer shops but whats a few minutes walk ? A few beggars / pan handlers of an evening in area ( not at hotel but at bars / restaurants across road) but they seemed to be non aggressive .", "title": "Good location , clean and tidy", "helpfulness": 7, "user": "UKperson", "date": "April 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3398010}, {"rating": 2.0, "title": "Needs some renovations", "text": "Hotel is close to everything including Union Station. Parking is expensive however I took the train to Toronto. Room was not very good the carpet was bubbling in many places and I didn't have hot water for 3 of the 4 mornings I stayed. The staff is helpful and friendly. I was staying there for a company regional meeting. I am assuming they got a very good rate.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3369757}, {"rating": 2.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "The Problems:", "title": "Don't Stay Here", "helpfulness": 8, "user": "blindmind", "date": "March 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 3287396}, {"rating": 2.0, "title": "Great location - but nothing special", "text": "- EXTREMELY RUDE employees- ESPECIALLY if you have a web based reservation (they treated me like I was on welfare).", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3280587}, {"rating": 3.0, "title": "Great for the price", "text": "Stayed just 1 night for New Years. We got a great price from expedia. The room was small, but clean. Great location too.", "helpfulness": 3, "user": "iamthespark", "date": "February 17, 2005", "id": 3205812}, {"rating": 3.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "We stayed at this hotel on January 25th and 26th for two nights.", "title": "Average Hotel, Good Price", "helpfulness": 4, "user": "Steve&Reen", "date": "February 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3181157}, {"rating": 3.0, "title": "A fair deal, not amazing", "text": "The hotel is average. The rooms are certainly not comparable to the Cambridge Suites or Marriot, but either is the price. The rooms are a little outdated and in need of some renovations. The washrooms were nice.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 2, 2005", "id": 2970828}, {"rating": 4.0, "title": "Fantastic holiday!!!!", "text": "Make sure you ask for a room facing the Esplanade. Otherwise, you see the concrete from the Gardiner Expressway out your window.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 16, 2004", "id": 2886010}, {"rating": 3.0, "stay_parameters": "Stayed November 2004", "text": "The pool is small and cold. They just finished maintenance, so hopefully it was heating up again.", "title": "Nice service, but the hotel needs some TLC", "helpfulness": 2, "user": "cherylstar", "date": "November 27, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2849851}, {"rating": 4.0, "title": "Shopping before returning to UK", "text": "We were a family of four adults who had been travelling for two weeks across western Canada and had decided to break our journey from Edmonton back to the UK by staying in Toronto to do some shopping. We had booked two rooms for 2 nights and I had chosen the hotel through Expedia for its convenient downtown location.", "helpfulness": 3, "user": "Quickie", "date": "July 18, 2006", "id": 5478199}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "Good points were that the staff were friendly and efficient and that we had two very good interconnecting rooms with big comfy beds and the usual amenities such as coffee maker and big TV with lots of cable channels for our 18 and 22-year old. This was the only hotel in our stay in Canada that charged for water although the coffee was complimentary. The rooms had a mini bar which we used as a fridge. Access to the lifts is by plastic room key so you need a key for each person staying.", "title": "Great staff ....shame about the rooms", "helpfulness": 3, "user": "hannah's grandma", "date": "July 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 2.0, "service": 5.0}, "id": 5476307}, {"rating": 1.0, "title": "RESERVATIONS WORTHLESS", "text": "One negative point was that there was demolition work going on immediately opposite the hotel as part of construction of a new condominium building. I got woken up early by the noise of pneumatic drills and excavators. Might be less of a problem if you stay on one of the higher floors. The rooms have double glazing and the rest of the family did not hear the noise - I am a light sleeper.", "helpfulness": 3, "user": "buffbill54", "date": "July 11, 2006", "id": 5457040}, {"rating": 3.0, "title": "Novotel -- A Mixed Bag", "text": "We did not eat in the hotel, being a family that knows Toronto well from previous visits and prefers to eat out. The restaurant looked pleasant and there are many other great eating places locally.", "helpfulness": 4, "user": "Hard2Pleeze", "date": "July 11, 2006", "id": 5447621}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The big advantage of this hotel for us was its location, close to attractions such as the Eaton Centre for shopping or sights such as the CN Tower and Rogers Arena (aka Skydome). If in Toronto again we would be happy to stay here.", "title": "Lovely Hotel", "helpfulness": 2, "user": "young7898", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5425804}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We stayed for 2 nights at the Novotel Hotel on The Esplanade and we were very pleased with our stay. The hotel staff were very helpful. The rooms were spacious and well equiped. The location is very good for main attractions. Bar staff very cheerful and not too familiar. Breakfast was excellent and a good choice of options. We would recommend this hotel for most types of travellers.", "title": "excellent hotel", "helpfulness": 2, "user": "grancha", "date": "July 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5415158}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "I admit, I was excited when I read a review where the poster was able to check in early. I was hoping we'd be able to do the same. We arrived on a Saturday morning and the only rooms available were smoking or queen. We were offered a non-smoking king, but at an additional $40 a day. They told us to check back around noon. We came back at 1pm and were told the same story, no room. We actually got to see and do more because we didn't end up checking in until after 7pm!", "title": "Great location, spotty service", "helpfulness": 4, "user": "adomatic", "date": "June 29, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 5409583}, {"rating": 5.0, "title": "Great Stay", "text": "The next day, we came back from touring the city around 5:30pm and the maid hadn't made it to our room yet! She was right outside, so we just grabbed some towels from her and hit the indoor pool. The pool seems to be were familes entertain their children, in the pool and in the hot tub. We were surrounded. Not very relaxing, but felt good after pounding the Toronto pavement.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 18, 2006", "id": 5149097}, {"rating": 4.0, "title": "Can recommend it ...", "text": "When we got back to the room, the maid still hadn't finished our room! She eventually emptied the garbage, threw the bedspread on the bed and left! She was very nice and did check back with us later to see if we needed anything. But returning at 5pm, I expect the room clean.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5015159}, {"rating": 5.0, "title": "Excellent", "text": "The concierge is very helpful, when he's on duty. He reserved one dinner for us, and when we went back the next day, he wasn't on duty.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4996509}, {"rating": 1.0, "title": "A 2 Star at best", "text": "I was very dissapointed in this hotel, the photos online are deceiving, The location is good, however the rooms were not very clean and were very dated, very small and esthetically unapealing. There are stains on the hall carpets and the walls are dirty. Not very well kept at all. Could also smell cigarettes in my non-smoking room. Little bedding and uncomfortable bed. Cannot say anything positive. Oh and don't move anything from the sensor pad or you will have to pay (chips etc)", "helpfulness": 1, "user": "nicoleclive", "date": "November 23, 2004", "id": 2844025}, {"rating": 4.0, "title": "Great Location, Highly Recommend", "text": "I would rate this a 2 star at best.", "helpfulness": 2, "user": "Jolysa", "date": "October 1, 2004", "id": 2611918}, {"rating": 4.0, "title": "nice place", "text": "Not a warm and fuzzy place at all.", "helpfulness": 1, "user": "manicmummy", "date": "September 13, 2004", "id": 2569837}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We were extremely pleased with our three night stay at the Novotel. We were greeted with a smile, and check in was very quick and efficient. Security was good - your room key had to be inserted in the lift before it would work (the only hotel that did this, out of six that we stayed in).", "title": "Loved the Novotel", "helpfulness": 7, "user": "Patricia P", "date": "April 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4992908}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We were delighted to find that our rooms were the newly renovated ones (we had only paid for the standard room, so that was a nice surprise) - good size, spotlessly clean and with good bathrooms and comfortable beds.", "title": "Great Location", "helpfulness": 5, "user": "Nickiaj", "date": "April 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4988250}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "The location was excellent too - we walked everywhere (even with teenagers!), with no need for public transport. We had only one evening meal in the restaurant - efficient, friendly staff, and no complaints about the food.", "title": "Great stay, great location.", "helpfulness": 7, "user": "glasg0w_gal", "date": "April 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4830515}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We ate close to the hotel on a couple of occasions - we enjoyed The Old Spaghetti Factory across the road, and the Richtree Market on Yonge Street. Favourite breakfast was at the Over Easy, also on Yonge Street.", "title": "Great Location, Decent Hotel", "helpfulness": 6, "user": "gizm0sm0m", "date": "February 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4468712}, {"rating": 5.0, "title": "Lovely stay in TO", "text": "All in all, an excellent stay - we loved Toronto, and wouldd definitely use the Novotel again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4391454}, {"rating": 5.0, "title": "nice location", "text": "I stayed at the Novotel Toronto Centre for 7 nights in July 2007.", "user": "34isit", "date": "August 9, 2007", "id": 8380997}, {"rating": 4.0, "title": "Great location, would stay there again.", "text": "I enjoyed the stay, no complaints. The room & hotel were clean. The staff provided good service. The hotel has free wireless. The hotel has two computers with internet access available for guest use. I used the one off the lobby a few times. The computer on the 2nd floor was out of order. The room was plain, but very adequate. The bed was comfortable. The view out the window was not very good, looking into a parking garage. However, the room was quiet. A couple of times you could hear dogs were barking in other rooms. The rooms on the front face new construction of a couple of high-rise condos across the street. I didn't notice much noise, but would prefer a room on the back which may be quieter.", "user": "leche71", "date": "August 9, 2007", "id": 8380534}, {"rating": 4.0, "title": "Great hotel, great location!", "text": "The location is pretty good. There are a couple of dozen restaurants in the area, a few with outdoor sidewalk seating. There are 3 or 4 pubs with outdoor seating just across from the hotel. An entrance to the underground PATH network is a couple of blocks away. The main train station is about three blocks away. The neighborhood seemed safe. The main financial district is a few blocks away. The St. Lawrence market is a couple of blocks away. There's a full grocery store and liquor store a couple of blocks away. The disadvantage to this location is that the hotel is in one corner of the downtown area, not in a central location. The subway is nearby, so that isn't that big of an issue. The Distillery district is less than a mile away. The area behind the hotel is bounded by many train tracks and a freeway.", "user": "jojo75", "date": "August 6, 2007", "id": 8361398}, {"rating": 3.0, "title": "Great Location", "text": "I booked thru Hotwire at about $111 a night, including taxes.", "user": "chefDC", "date": "July 31, 2007", "id": 8265199}, {"rating": 2.0, "title": "great Local, great bfast- that's it!", "text": "The location was great, convenient to everything. We walked to the CN Tower, only 10 minutes away. We also took a double decker tour bus ride which picked us up right in front of the hotel, I recommend doing it, its fun and you get to see alot of Toronto and you can decide where you want to get off. We got off and did some shopping and we saw a cool castle and went to a museum, had lunch and then went back to the hotel. The hotel is located right across the street from a restaurant called The Old Spaghetti Factory. I had read that this place was good, but I was totally disappointed, I think people go there to look around because of the cool decorations. The food is only okay. My friend ordered scallops in the hotel restaurant and she said they were delicious. The room was nice. Big, fluffy pillows and the sheets were soft. High speed internet was really fast, $10 a day though. Bathroom was spotless and lots of soaps, lotions, and shampoos. The towels were soft and big too. I liked it alot, I would stay there again.", "user": "jenofa", "date": "July 23, 2007", "id": 8222120}, {"rating": 4.0, "stay_parameters": "Stayed June 2004, traveled on business", "text": "Stayed at the Novotel downtown Toronto for one week, and enjoyed our stay very much. The rooms are large and comfortable. The bathrooms are newly-remodelled, spacious and clean (granite countertops, good lighting, excellent shower and bath). Excellent service from the staff and housekeeping, and the hotel itself is in a good overall location--nice and quiet and safe location. Hotel is across from the \"Old Spaghetti Factory\" restaurant, and there is a convenience store located next door. We were within walking distance to shopping, theatres, CN Tower, Union Station, etc. There is a decent-sized indoor pool with large hot tub, and in addition the gym facilites are the best I've seen in a hotel this size (lots of equipment and free weights in addition to weight machines). There's also a men's and ladies' sauna. Overall, good value for your dollar--safe, clean, modern, and good service. The only minor complaint is that the carpets although fairly new need to be re-stretched. I would definitely recommend this hotel.", "title": "We enjoyed our stay here very much!", "helpfulness": 2, "user": "WBinBC", "date": "June 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3577394}, {"rating": 4.0, "title": "Perfect for Families", "text": "The Novotel is perfect for families going to the Hummingbird (formerly O'Keefe) Centre. It's within a 2 minute walk. The family suite was spacious for our family of four (kids aged 5 and 2). The kids loved the trundle bed. The new bathrooms were huge. The carpet is old and could be replaced. A newspaper was deliver to our door on Saturday (but not Sunday).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 6, 2005", "id": 3533773}, {"rating": 4.0, "title": "An excellent choice", "text": "The breakfast was high quality and free for children (buffet $15). At breakfast the kids were given Dolphi placemats, cups and toys to entertain themselves.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3508312}, {"rating": 3.0, "title": "Average hotel with great breakfast", "text": "The pool is ideal for families but not big enough for those wanting to do laps. The Fitness Room has also been redone to include flat screen tvs at each cardio machine! Unfortunately the two drink machines I tried were empty. But the Gift Shop had reasonably priced snacks and a mini-grocery is next door.", "helpfulness": 3, "user": "Steinera", "date": "May 29, 2005", "id": 3508131}, {"rating": 4.0, "title": "great location", "text": "The parking rate is very reasonable for Toronto ($17) and it permits \"in and out \" privileges. Every staff member we encountered were amicable and accommodating. We would stay at Novotel again if we were planning to attend something nearby (Hockey Hall of Fame, Young Peoples Theatre). Plan now for The Nutcracker!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 22, 2005", "id": 3492541}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We're a family from Scotland and stayed at Novotel in early July. Great location, very handy for sights, restaurants, St.Lawrence Market, etc. Staff were very helpful with fixing hire cars, advice about the subway, etc. Good value-for-money. We stayed two extra days.", "title": "Well worth while", "helpfulness": 3, "user": "GlasgowScotty", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8204855, "likes": {"liked": "— location and price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We used airmiles for this hotel and it was a great place to stay for a couple of nights in Toronto. It is within walking distance of all the main sights. I was concerned about the building work going on opposite the hotel but we couldn't hear it from the room at all and it didn't cause us any inconvenience whatsoever. The rooms are great although we assumed that the water was complimentary and it isn't, so be careful!", "title": "Great place to stay", "helpfulness": 1, "user": "kgrif40", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8203921, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Dirty older hotel. Booked a room there for us and kids. Parking was very expensive.", "title": "Avoid this VERY Dirty hotel", "helpfulness": 4, "user": "David_Mina", "date": "July 16, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 8128619, "likes": {"liked": "— Location", "disliked": "— One of the dirtiest hotels I saw CLEAN IT UP !"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Room was disgusting - small pieces of hair on the floor and on the bathroom baseboards, Even on the pillows", "title": "Superb hotel", "helpfulness": 1, "user": "RinMachen", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8105078, "likes": {"liked": "— Pretty much everything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Towels had yellow stains - horrible !", "title": "Perfect!", "helpfulness": 4, "user": "DisneyBonkers", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8082066, "likes": {"liked": "— The location", "disliked": "— Price of breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The short story: This is a fairly nice hotel.", "title": "Novotel a hotel that is better than decent", "helpfulness": 50, "user": "HSTTraveler", "date": "May 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7640995, "likes": {"liked": "— Well appointed fitness center, clean rooms, free wireless Internet access", "disliked": "— Noise from construction site"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The long story: Everyone can have a different experience staying here I suppose, but based upon mine, I’d give this place 3.5 stars if I could. There wasn’t anything spectacular about the hotel which immediately discounts it from being a 5 star stay for me. Yet it isn’t quite a 4 star hotel either (though it is close). But it certainly isn’t a 2 or 3 star hotel. I’ve stayed at a number of hotels in Toronto and I’d stay here again if the price is right (under $130 US).", "title": "Enjoyable stay made by friendly staff!", "helpfulness": 3, "user": "Charisse", "date": "May 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7587626, "likes": {"liked": "— Friendliness of staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Pros:", "title": "Nice and Friendly", "helpfulness": 3, "user": "Anonam", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7380982, "likes": {"liked": "— Staff!!!", "disliked": "— Views from Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "•Free wireless internet. Great bonus as I was staying at the hotel for work and I know other hotels in Toronto that charge.", "title": "Nice stay, despite one rude hotel employee", "helpfulness": 1, "user": "iheartnewcities", "date": "April 16, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7368761, "likes": {"liked": "— modern decor", "disliked": "— one rude hotel staff member"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "•Location. It is a pretty “decent” location, though there are other hotels (for slightly more and slightly less) that I’ve stayed at in Toronto (Courtyard by Marriott, Marriott on Bloor, Comfort Inn) that are even better situated than the Novotel to the subway. Though if you want access to the Air Canada Centre or the Hockey Hall of Fame, this place is ideal, perhaps the best situated hotel. Also the St. Lawrence Market is exceptionally close as is the Hummingbird Centre. The market is a very cool place to visit on a weekend. The CN Tower and Rogers Centre are also within walking distance. Though for older folks, the walk uphill from the hotel to many of the attractions off of Front Street could be a barrier.", "title": "Overall not impressed", "helpfulness": 3, "user": "Lovewaves", "date": "April 10, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 1.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 7304337, "likes": {"liked": "— Nothing really stands out", "disliked": "— Service at check in/out"}}, {"rating": 5.0, "title": "WOW! what a surprise!", "text": "I visit Toronto regularly and this time I stayed at the Novotel. I was recieved at the desk by a pleasent smile. The room as I was told was their new Novation which was absolutely the comfortable and bright that I have seen in recent years.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 8, 2006", "id": 4332403}, {"rating": 2.0, "title": "yukky surprise!", "text": "It was a very good stay! I would recommend this hotel to anyone in a heartbeat.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 26, 2005", "id": 4299947}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "While our room was great the doggy doo-doo in the halls was not! After once reporting dog feces outside the elevator one night to a staff member, we woke up to it the next morning to find it all over the carpet outside our door. What gives? I again reported it, this time to the front desk, and not even an apology! Totally ruined what would have been an otherwise lovely stay and I'm sure the hotel would have known who on our floor would have had a dog (let's put it this way - not a small dog!)", "title": "lovely new rooms", "helpfulness": 5, "user": "Skevin", "date": "December 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4299883}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "My wife and kids spent christmas eve in Toronto, and chose this hotel due to its central location near all shopping and the Go station.", "title": "Poor service, bad attitude", "helpfulness": 8, "user": "Allydar", "date": "November 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 4119574}, {"rating": 5.0, "title": "Recent stay", "text": "We stayed on the 3rd floor in one of their new rooms, with new beds and duvets. one of the best nights sleep I have had in a long time.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 22, 2005", "id": 4044715}], "location": {"country": "Canada", "city": "Toronto"}, "stars": 3.5, "variance": {"poor": 62, "average": 177, "very good": 446, "terrible": 49, "excellent": 220}, "aka": "Novotel Toronto Centre Hotel Toronto", "slim_ranking": 0.326241134752, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Novotel Toronto is nestled in the historic district of Old Town Toronto. Get a glimpse into Toronto’s past strolling through cobblestone streets, enjoy a wide array of gastronomical international treats at the St. Lawrence Market or savour the flavours from myriad restaurants and pubs. Just steps from the Hockey Hall of Fame, Harbourfront and Union Station, the Novotel is 30 minutes from Pearson International Airport and 5 minutes from Billy Bishop Airport.With a European flavour, whether you are staying for business or pleasure the hotel offers a variety of services to make any stay exceptional."}