{"user_rating": 4.0, "review_count": 343, "name": "Novotel Bern Expo", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The Bern Novotel Expo is easily reached by taking the number 9 tram from the station to the end of the line at Guisanplatz. It takes roughly ten minutes and along the way you see a great deal of the city and many places that are good for stopping and getting supplies, such as co/op. (grocery store)", "title": "Inexpensive by comparision and easy to reach", "helpfulness": 4, "user": "theseatsaretooclose", "date": "August 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5557379, "likes": {"liked": "— price and ease of access to transportation and attractions", "disliked": "— The bed was criminally bad."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "As for the hotel, it is nice enough. The rooms are clean, although we did have some trouble with the maid not coming one day and not leaving us with new hand towels on another. The strange part about this is that we were told to go down to the front desk to get new towels. That was a first. However there laundry service, which is same day went off without a hitch.", "title": "Check out the bathroom sink!", "helpfulness": 5, "user": "Neanne", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5537888}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The TV has a good selection of channels in several languages including English. The rooms were quiet. Combined with a central air system that was somewhat loud, (in a pleasing way) I didn't hear anyone else. The bed, while comfortable to sit up and read in (great headboard) is just about the worst I've come across to sleep on. My back hurt incremently more each morning.", "title": "Ultra clean, chic and comfortable", "helpfulness": 3, "user": "Periphrasis", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4955821}, {"rating": 5.0, "title": "Excellent value.", "text": "The Bathroom, as mentioned before is split into two seperate rooms, with the toilet right behind the entry door, while the sink and shower is next to the bed. (with translucent doors you can close) However, there are seperate tub and shower facilities and the shower, while being quite small (or am I too tall) has excellent water pressure and great temperature control. Not to mention that the tap water is some of the best tasting and coldest around. In Switzerland...go figure.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 27, 2005", "id": 4301194}, {"rating": 5.0, "title": "Excellent", "text": "After staying at quaint and charming Swiss inns, I have to admit it was culture shock stepping into the sleek, modern world of the Novotel Bern Expo. But don't get me wrong, it's a very nice place to stay-- immaculate and beautifully tended as in my somewhat limited experience I've found Swiss hotels to be. Desk personnel is multilingual, patient and helpful. Rooms are sparkling, comfortable and extremely sleek and modern in design-- a bit lacking in storage space, however. Baths, as pointed out in another post, have an usual layout-- toilet in a small room in the entry; tub, sink and stall shower in a separate room around the corner-- or at any rate that was the layout of our room. Our triple was a bit cramped; but we all slept well and the sofa bed-- I was told-- was very comfortable. Kind of a nice security measure this hotel has is that the elevator won't operate unless you have a card key-- just be sure to have a key with you whenever you opt to go out.", "user": "honestopinion4u", "date": "July 1, 2005", "id": 3625003}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The room was very clean and modern. The food in the restaurant is of a high quality. The hotel appears to be away from the action, but the tram right out the front is a quick trip (10 minutes) into the old town. Had a great time and would highly recommend it to family and friends.", "title": "Very Comfortable Stay", "user": "TravelEndlessly", "date": "March 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14661693}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Novotel Bern Expo is located opposite of BEA (Fair gorunds) and quite some distance from the center of Bern.", "title": "Standard Hotel", "helpfulness": 3, "user": "questforbetterhotels", "date": "August 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 8483068, "likes": {"liked": "— breakfast", "disliked": "— room size"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Our choice was primary based on the excellent rate we were quoted from the hotel through its website,168CHF/per night for a family of 4 breakfast included, and its proximity to the Jungfrau region,some 75km of motorway driving.", "title": "good city hotel", "helpfulness": 2, "user": "mendip_7", "date": "August 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8367092}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The hotel is adjoined by the sister hotels, Ibiss and Etap of the Accor group that surely will quote you an even better rate.", "title": "Excellent Experience", "helpfulness": 7, "user": "WStaso", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5905884, "likes": {"liked": "— breakfast", "disliked": "— distance from town"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Parking your car comes at 12CHF and the indoor parking is shared between the 3 hotels.", "title": "Functional but worth considering", "helpfulness": 3, "user": "jonben", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5709782, "likes": {"liked": "— Fine for a short stay", "disliked": "— May be cheaper hotels in the Accor chain, right next door."}}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 48, "very good": 194, "terrible": 5, "excellent": 87}, "aka": "Novotel Bern Expo Hotel", "slim_ranking": 0.181818181818, "description": "The Novotel Bern Expo is a 4 star hotel offering 112 non smoking rooms located opposite the BEA Bern Expo exhibition centre, the ice hockey stadium, the national horse riding centre and 200 m from the Stade de Suisse and the Zentrum Paul Klee. The tram runs from in front of the hotel to the old city in 7 minutes. The hotel features a restaurant, bar, internet corner and six meeting rooms, as well as facilities for guests with limited mobility, private pay parking and a fitness centre."}