{"user_rating": 4.0, "review_count": 2164, "name": "Now Sapphire Riviera Cancun", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at Now Sapphire in late August and experienced some good and some bad.", "title": "Probably wouldn't return", "user": "miaw115", "date": "September 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78096649}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The good- Isreal and the pool bar staff in the preferred area were amazing. You never went without a drink and they were very friendly. The room was clean and the preferred pool was great. It was spacious and quiet even with kids being around. there was plenty of cabanas and chairs to go around and you weren't questioned daily about being a preferred member once they got to know you.", "title": "Great Property/Beachfront and Great Service", "user": "smeza", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78030863}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The bad- The beach always had red flags posted and there was a lot of sea weed laying on the beach. We were told we could snorkel right off the beach by our travel agent but we were warned not to by hotel staff because of jelly fish. Originally we were told snorkeling was free with all inclusive but it isn't. We felt like several of the dining staff expected tips. We noticed that those who were leaving tips were getting quicker and more friendly service. We didn't feel that way about everyone but it made us uncomfortable because we went \"all inclusive\" for a reason. Also if you want lobster or seafood it isn't included unless you are a preferred member eating at the grill (snack bar during the day grill at night) otherwise it is an additional charge to your room. Each night only a few restaurants were open which we were not planning on. The breakfast buffet was the same all week which gets old fast. All of the dining areas closed so if you weren't feeling well you had to grab something or you would be starving at some point during the night. The mini bar was 3 sometimes 2 bottles of vodka and Jack if it got restocked and a small can of pringles.", "title": "Great Hotel - Would Recomend", "helpfulness": 1, "user": "SimonH29", "date": "August 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77747431}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The ugly- The only place that seemed to have AC was our room. The restaurants inside did not seem to have any. It was miserable eating meals unless you were sitting by an open window with a breeze. My husband was sick by the middle of the week so we spent the last couple days in the hotel room.", "title": "Some things good & some things not so good!", "helpfulness": 1, "user": "pafamilyjoekaren", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 77584430}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Most of our frustration came from a poor travel agent and just not getting what we thought we should get with an all inclusive resort. We survived but we wouldn't recoomend this to anyone we know.", "title": "Cool Breezes, Good Value, No Hassles", "helpfulness": 1, "user": "tomscube", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 77418731}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "It was a nice vacation up until I realized that my credit cards got stollen from the security box in the room. Management ignored comlaint and didn't want to call a police. I am happy to be back home!", "title": "Nice, be careful about the staff", "user": "oriet8", "date": "December 29, 2010", "detail_rating": {"value": 4.0, "sleep": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 91021069}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Beautiful facility, beach, pool and grounds. We went in October, though, and would have liked to see more people there. Pampered!", "title": "Dream honeymoon", "user": "marybdowney", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90895819}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Everyone looks for different things in a vacation. For my family, we like seats by the pool near the hot tub or within walking distance to the stairs to stand in the pool. For most hotels, all the seats are conveniently located and hot tubs well spread out, making us very easy to please. However, this hotel is a little different.", "title": "Nice vacation but...", "helpfulness": 2, "user": "balconyview00008", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 90831858}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Before I go on about some of the negatives, let me just say that the service here is phenomenal, the caribbean view is spectacular, and overall the atmosphere is very nice.", "title": "Excellent Value", "helpfulness": 7, "user": "tripdave", "date": "December 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90828510}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "However, the pool is set to sub zero temperatures, and there are probably less than 10 kids in the pool at a time, and only a handful of adults, usually situated at the poolside bar, which you'd think would tell them something. I went for over a week and went in the pool twice, both for less than five minutes, if that.", "title": "Nice but not great", "user": "warnertravel", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 90813211}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "What can I say this place is amazing, i booked a preferred room and upgraded to an ocean view when i got there, couldnt resist the tub on the balcony. Recommend a high floor if you want privacy, the balcony is very overlooked, i had a room on the top floor. The hotel staff are very helpful and friendly. My only complaint would be that they are not very good at publishing which restaurant is closed on which evening and some of the people with children felt it was a pain not to be able to book a time to eat, but that wasnt a concern for me. Antoinio at the preferred pool was a complete star", "title": "Superb vacation", "helpfulness": 1, "user": "TraceyK66", "date": "December 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90751443}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "A word of caution, when you get off the plane dont talk to anyone until you EXIT the airport, where you rep will be waiting, the people in the airport are just trying to sell timeshares!", "title": "carribean paradise", "user": "60795Cancun", "date": "December 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90665654}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "overall its good, but if you are interesting in kids club and childrens activities, better go to Now Jade. It has amazing kids club. Here, at Saphire, staff at kids club are not doing very good job.", "title": "Amazing resort- way above expectations", "helpfulness": 2, "user": "anxd17", "date": "December 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90566193}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The food is also better at Jade.", "title": "This is a good place for the right people", "helpfulness": 1, "user": "tonyruthm", "date": "December 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 90398358}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "As a rule, I do not like to go to the same place twice, and this is one resort where I would make an exception. I had doubts before arrival due to some of the previous reviews, and I can honestly say we had no complaints. We were able to book the preferred garden view for a great price, which was a beautiful room. Some people complained about the bed- we slept better in ours then we do in the one at home. Everyone was greeted at arrival with a glass of bubbly, and we had more drinks served to us at check-in in the preferred lounge, which also has complimentary computers/internet, hors d'ouvres and drinks throughout the day and night. We wanted privacy, so we actually ended up eating there several times. The adults only pool is also great if you want something quiet, romantic & relaxing. As part of the preferred package, we were able to use the spa facilities for free one day, which we did one evening when the weather was bad- again, gorgeous, and definately take advantage if you can.", "title": "Simply Gorgeous", "helpfulness": 1, "user": "mmac004", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 90313775}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We (couple and 2 kids, 7 and 11 yrs.) visited this property from 8/22-8/29/10 and booked our trip online w/Apple Vacations (AV owns the resort in partnership with Amstar).", "title": "Good value for a Family of 4!", "helpfulness": 4, "user": "kitty811", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79283296}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "For around $5k our package included:", "title": "An absolutely gorgeous hotel, but management isn't honest", "user": "JW5", "date": "September 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79168237}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "- Round trip charter flight from Los Angeles, Calif., to Cancun via Alaska Airlines (4.5 hr non-stop was great)", "title": "Wonderful Vacation", "helpfulness": 2, "user": "BeachLover1965", "date": "September 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79154269}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "- RT Shuttle rides to/ from airport to resort (non-stop, air conditioned)", "title": "Loved it but serious flaws.", "user": "Dar52", "date": "September 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79116047}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "- Preferred Club (PC) upgrade (**highly encouraged**)", "title": "Honemoon trip was no fun.", "helpfulness": 1, "user": "mrplopez1972", "date": "September 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 79075500}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at this hotel Aug. 14-21 & it was wonderful. When we arrived we were greeted with warm towels - check in was fast & even though we arrived at 10:45am our room was ready for us! We decided to check in with our Apple rep to arrange our transportation back to the airport before we went to the room this way we wouldn't have to do that later on - on our way we were given champagne which was nice. The apple rep was nice & very informative. After that we hopped on a golf cart & were taken on a drive around the complex & taken to our building (9) - once we got there Manuelo carried all of our luggage up to our room & came in to make sure we were satisfied with the room (we were!) then the housekeeper came in & gave me extra hangers without me even requesting them which was great. There's a lot to cover so I'll break it out:", "title": "Nice Place & Great Service", "helpfulness": 1, "user": "trvllvrpa", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 77415706}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The People - they are so nice & they work very hard. They really go out of their way to make your stay relaxing & wonderful - I was very impressed.", "title": "Worst hotel I have stayed in in Mexico in 12 years.", "user": "johneisele", "date": "August 29, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 77415702}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The Pool - nice & big & the beds in the pool are a huge plus! The only bad thing was that 2 of my bathing suits (white) turned orange & I was not able to get the stains out, definitely a bum out. On the ride to the airport another guest told us that the pool had turned green the night before & that morning, not sure what that was about becuase we didn't see it. Pool bar was great - definitely not stingy with the alcohol.", "title": "Not a 6 Apple by far...HOT insides and out", "helpfulness": 1, "user": "parrottgirl", "date": "August 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 77400397}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Restaurants - I'll break them out below - the thing I loved was that you did NOT need reservations (except Japanese), I Loved that we could go anytime we wanted!! Dress code was not enforced while we were there - saw plenty of people in the specialty restaurants wearing shorts & flip flops, I wouldn't recommend that as I think some of the fun is getting dressed up but to each his own.", "title": "Had a great time but....", "helpfulness": 1, "user": "BennyStamper", "date": "August 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 77202342}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Mexican Restaurant - Wonderful Service & food was good. Depending on where you sit you can have a view of the ocean. It is not air-conditioned so it is very hot in there & a little uncomfortable. This place was a little tricky to find - you go to the buffet restaurant & go to the left then straight.", "title": "Beautiful Location with very lousy service", "helpfulness": 1, "user": "shabdew", "date": "August 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77157373}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I were at Now Sapphire from Aug.29 thru Sept.2. On arrival we were greeted with Mimosas and cold towels. Check in was a breeze. Our room was very large and very clean. No bugs at all. I took mosquito spray due to previous reviews but did not find one mosquito while there.Staff was excellent and restuarants were very good. We especially enjoyed the reef grill and the tequila grill.Beach was beautiful. No jelly fish and staff was cleaning seaweed up at least four times per day. Compared to surrounding resorts, our beach was the cleanest.Drinks were plentiful and strong.We took advantage of hte adventure photo option of having the photographer follow us for about 30 minutes around the resort and the pictures turned out breathtaking. I would recommend anyone to have this done. I would definetly return to this resort again.", "title": "Paradise", "helpfulness": 1, "user": "lilnurse", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78429632}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We just returned from a week's stay (8/28 - 9/4) at Now Sapphire. We're mid-40's and our boys are 9 & 10. This was our 5th trip to Cancun since '99 and our first in Puerto Morelos. We got a good last-minute deal via bookit, so we jumped on it. We upgraded to the PC just because it was only $200 more for the week and after extensive research (we looked at El Cid, Dreams, Now Jade, etc.), my wife decided that the shaded bali beds at the PC pool alone made the upgrade worthwhile and she was correct.", "title": "Not bad, but not great either.", "helpfulness": 1, "user": "annabananava", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78342965}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "The resort itself is very nice. The service was quite good. We rented a car at the airport and made our way down the 307 15 minutes to the resort (easy to find). Check-in at the PC lounge was a breeze. The room (bldg 5) was on the beach, but we did not upgrade to a beachfront room (although I'm a little surprised they didn't automatically upgrade us since the resort appeared to be at well less than 50% occupancy that week). In any event, our room was fine, the beds were hard, the minibar well-stocked, and of course the rooms have NOT yet been updated despite what the web site and property literature state. There are no flat screen TV's (there will be 2 eventually--only 1 tube for now) and the beds, couch, etc. are somewhat dated. In fact, our linens still said \"Paradisus\" on them. No matter--we spent very little time in the room, and when I inquired about switching to Now Jade (because we had expected the rooms to be updated and they were not), they were more than willing to accommodate my request, but we ultimately decided to stay because NJ has a private adults-only pool whereas NS has the private PC pool.", "title": "Great Escape with attentive staff", "user": "therealworld57a", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78247516}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The meals were ok. The buffets were fine. We ate dinner at the Teppanyaki restaurant twice and it was decent (we paid extra for the sushi and it was TERRIBLE--please don't waste your money. The sushi we get from our local Wegmans is 10x better. We ate at the grill once and the lobsters were terrible as well. They had a big mexican dinner/buffet and a caribbean dinner/buffet for two nights while we were there and again it was fine--certainly nothing spectacular. When we partake in all-inclusives, we don't expect great food and in fact in some bizarre way we actually appreciate mediocre food as it encourages us to not over-indulge. Now Sapphire didn't disappoint in this regard. We did not eat at the French restaurant and we didn't want to leave our boys out.", "title": "great value...just need to work out a couple of hiccups", "helpfulness": 2, "user": "melsriver", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 78158612}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The guys at the PC pool (Israel & Miguel) were both very good. For us, the PC was worth it just for the ability to easily get access to bali beds whenever we wanted. As others have stated, the 5 bali beds around the main pool were reserved early. When we walked to breakfast around 830a every morning all 5 were taken, yet there wasn't a soul on any of them at that hour--ridiculous. In contrast, there were 18 bali beds at the PC pool and although we were there during a quiet week as I've previously stated, we never counted more than 12 guests at the PC pool at any one time including the 4 of us! There was no loud music, no pool volleyball, etc. at the PC pool--it was nice and quiet--perfect for us.", "title": "Nice Resort", "user": "gepparker", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 78118616}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We had never been out of the United States and were very nervous about our trip. The minute we arrived at the resort all our fears melted away. We were treated like a king and queen from the minute we arrived until we left. The staff at the resort treated us like old friends. We were amazed at how they remembered your name. The resort went beyond our expectation. It was very clean and beautiful. Even the restrooms were amazing. The food at the resort restaurants was delicious and the service was liking nothing I had ever experienced before (great). We have been to many oceans in the states but this experience spoiled us. Our Beach Concierge even came to see us the morning we left to say goodbye. We will be going back and hopefully soon!! It was an amazing vacation!! I have nothing bad to say about our trip except watch out for the timeshare people at the airport when you arrive.", "title": "A week in Paradise", "helpfulness": 3, "user": "jenjen93", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89450454}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We had stayed here before and thought it was ok but this time the staff Antino, Izreal, Megil, and Irving and all of the resturant staff made our trip the best. This place is very nice and unless you go preferred you will not get an ocean view room so don't think you will. The food and drinks were excellent and the speciality resturants are very classy and the food was great. The pools were a little cool but clean, the enterainment was ok but I go to bed early so that didn't matter to me. I highly recommend this resort. Just remember no matter where you go if you don't have a good time it is your own fault.", "title": "Great time", "helpfulness": 2, "user": "Tony37093", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 89442222}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "First of all, the hotel is absolutely stunning. There are fountains and pools throughout the entire hotel and the landscaping is beautiful. This is a large property so unless you get a close building, be prepared to do some walking! We were in building 10 and it was a pretty good haul back and forth.", "title": "Beautiful resort, excellent staff, but......", "helpfulness": 4, "user": "leDeal", "date": "December 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 89380700}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "The staff in the restaurants and bars go out of their way to make you comfortable and they are very friendly. The swimming pool area is huge and winds around a large area and there are plenty of lounge chairs. The beach was kept very clean and they cleaned/raked it a couple times per day. There is a small amount of seaweed that washes up, but it is not bothersome since they are constantly raking it away. There are also plenty of lounge chairs and straw palapas. We did not have to reserve one or hunt for one at all.", "title": "Beautiful property, wonderful vacation", "helpfulness": 3, "user": "plzgoaway", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89178080}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "FOOD- Better than we expected from the reviews! We ate at the buffet a few times, at the Japanese restaurant one night, the Bluewater Grill another night, Mexican rest. one night and they had a Caribbean dinner show another night. They were all very good with the Japanese being my favorite!", "title": "Need to improve.....big time", "helpfulness": 1, "user": "katarzyna2010", "date": "December 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 88932431}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We arrived December 12. We booked our trip through cheapcarribean.com and the transport from the airport to the resort went very smoothly. We were greeted with champagne and cold towels. Check-in was a breeze. We upgraded to an ocean front room at check in and were SO glad we did. We had an ocean front room with a terrace that was just a few steps from the beautiful beach. We did not meander much from our room, but really didn't need to, either. The staff was more than friendly. We have to commend Fabian and Carlos (Juan) for excellent beach service. They did not let our glasses go less than half-full. The food was okay, we're not picky, and we ate plenty. We were very pleased with all the arrangements from cheapcarribean.com; the rep (Rene) at the resort was not pushy to sell us anything more, and confirmed our flights, arranged the airport transport. We had no worries our entire stay which was exactly our intention-mission accomplished!", "title": "Excellent!!", "user": "SenorBook", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 90307289}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "My husband and I recently got married at this resort in October 2010. We chose the resort without ever visiting, based on reviews and travel agent recommendations, so you can imagine we were a bit nervous bringing 35 of our closest friends and family to Mexico for a wedding to a resort site unseen. The first second the door of our van opened and we stepped foot on the grounds, we were so happy with our choice.", "title": "Wedding @ NSRC - tons of fun, great resort, perfect for groups!", "user": "cmj783", "date": "December 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 90239870}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The resorts is gorgeous - very open with great decoration and feel to it. It’s classy without being too upscale. It was only about a 15 minute ride from the airport. We were greeted with cold towels and champagne, our bags were whisked off and we were welcomed by our wedding coordinator upon arriving. We had an ocean view room, first floor - and it was FANTASTIC. We could walk right out of our porch to the beach, and we were 20 yards from the beach bar. The porch has a jaccuzzi on it (very nice!) and the rooms are great. We didn't have issues with the beds. Plenty of towels, prompt room service.", "title": "Not a 6 Apple/Star as Advertised by Apple Vacation", "user": "MarcusM49441", "date": "December 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 90224097}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The resort was perfect for a group, because it is big without being too big, and its open and has central spots so it was easy to find guests and meet up. The beach is great, we were in the pool and in the ocean many times. They do a lot of activities that you can take part it if you want. They do allow children, but we saw very very in October.", "title": "Already made reservations to go back in June", "helpfulness": 2, "user": "mgkins", "date": "December 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90191376}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Food was good - we mostly ate at the buffet, but went to several of the other restaurants (Japanese/hibachi, grill/seafood). There is something for everyone. Our wedding dinner meal was the best one we had, really really delicious. The bars are good too, generally good service. Not always the best quality of drinks, but our guests loved all you can drink.", "title": "Honeymoon in Paradise", "helpfulness": 1, "user": "akfisher76", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89776457}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 116, "average": 309, "very good": 696, "terrible": 62, "excellent": 981}, "aka": "Now Sapphire Riviera Cancun Hotel Puerto Morelos", "slim_ranking": 0.521739130435, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Now Sapphire Riviera Cancun. A tropical landscape of evergreen trees, sugar white sand, and sparkling azure sea, Now Sapphire Riviera Cancun offers all the exclusive benefits of Unlimited-Luxury®. This collection of amenities, led by unlimited gourmet food and premium beverages in five reservation-free, gourmet restaurants and seven stylish bars and lounges, pool and beach wait service, and 24-hour room and concierge service, comes without the wristband many resorts require. Guests will find 496 airy suites boasting such comforts as daily refreshed mini bar, plush robes and slippers, Jacuzzi for two, and private furnished balcony or terrace. Stepping outside means endless activities including Hobie cats, kayaking, windsurfing and nightly entertainment beginning with theme parties and movies on the beach. Plus, there’s oversized swimming pools, a fitness center and — for an extra fee — deep sea fishing, scuba diving, snorkeling and golf. A 6,800 yard, par 72 dream course: that is Playa Paraíso Golf Club. From tee time to me time, there’s the Spa, offering indigenous treatments ranging from a full body massage to a soothing hydrotherapy. For even more magical moments, the resort has wedding, honeymoon and anniversary packages, where couples enjoy champagne breakfast in bed, special turndown, private beachfront dinner with rose petal path and candlelight, and more. Add in 15,000 square feet of meeting/conference space and the privileges of Preferred Club, including terrace soaking tubs and a 24-hour private concierge, and guests have the best of everything. It’s all of this, and more."}