{"user_rating": 4.0, "review_count": 194, "name": "Nuremore Hotel and Country Club", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I have to say that there is an old world charm and comfort to the Nuremore that is lovely. There is no television in the bar, nor the reception. This makes the place very quiet and a good place for a chat or to do business. Our bedroom was extensive, with nice fixtures and fittings and a view of the golf course and lake. The staff in the bar were a bit frosty, but efficient. The staff in the reception were nicer. We stayed for two nights, Friday and Saturday. The Friday night was lovely and quiet and everything was fine. The bar food was delicious on the first night. There were two problems when we were there on the Saturday night, one the fault of the hotel, the other not theirs. The first problem was the dinner service. We booked for 8.30 but the place was heaving, and we were asked to wait in the bar till our table was ready. At 9.30, my wife and I were seen to - only after my wife had returned to the restaurant demanding to know what was going on. We spoke to another couple who had been waiting from 8pm to 9.30 for a table. They weren't happy either. When the food arrived, it was lovely. However, we found the staff attitude a bit arrogant. One girl told us that despite the hiccups, the staff were \"on top of it. People think we don't know what we're doing, but we do\". Another staff member asked us did we enjoy it and said \"it was worth the wait, wasn't it ?\". There was no real apology for the delay - more a pride in the level of service and food that was being produced. The other problem was that there was a lot of noise in the room adjacent to our own one. Our room was internally separated from the room beside it by a door, and the noise was not blocked out by this. There seemed to be a young crowd in the adjacent room screaming and roaring. It kept me awake till 2am. I was on the verge of ringing reception to complain, but somehow fell asleep. This was not a nice experience, but I can't blame the hotel for the lack of consideration of some of its guests. I found the breakfast service excellent. The white pudding needs to be tried. It's to die for, whatever they put in it ! On the whole, the hotel is nice. We will probably return midweek when it is quiet, as it was good value and the fundamentals were good. The main problems were caused by it being busy", "title": "Comfy but there were a few hiccups", "helpfulness": 1, "user": "BurstYourBubble", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 121114918}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "im just home today from a 3 night stay in this very nice hotel,the staff are excellent,food is excellent and the bedroom was lovely with a wonderful veiw of the lake....loved every minute of it...however,i had a 2hour treatment in the spa/room i wouldn exactly call it a spa...i was treated exceptionaly well by the girl doin my treatments but was def not value for money....tho these things never are!!! when the girl tried to play the typical spa treatment music the cd player wouldnt work so she had to go get another ,this took about 15mins off my time,i thought maybe id get 15mins xtra as thats what was paid 145 euro for...not the case,i found this very unprofesional,these spa's as we no are not cheap....i had to laugh cuz even tho the player was replaced by another the cd kept skipping...i would not recommend the \"SPA\".........if your willing to spend that amount of money go to a reputable spa...", "title": "lovely veiws", "helpfulness": 1, "user": "kimmy433", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121025964}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "I spent two nights here for my fiance's birthday in October. It never stopped raining but we still had a lovely time. From the moment we arrived (dripping wet) we didn't meet a single unfriendly member of staff. We stayed in a suite which was really lovely, spacious and spotlessly clean with a beautiful view of the lake. The food was very good both at breakfast and dinner, the scallops were the best I've had in a long time. There was a wedding in the hotel on the Saturday night but we didn't hear a thing from our room. We also tried the pool which was fairly functional but clean and bright with good staff presence. The only thing that could be better is the entrance area, the carpets are very dated and a quick rearrangement of furniture would do no harm but overall a very enjoyable stay.", "title": "Great service in comfortable surroundings", "user": "jjcb27", "date": "November 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 120618549}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed here the October bank holiday weekend, from Saturday to Monday. It was such a great stay that I really didn't want to leave. Firstly, the room was what I call a family room - when you walked in there was two single beds, two little chairs and table and a tv. When you walked past this area you came into the main bedroom, with a double bed and another single bed, tv etc. It was a real family room, with plenty of space for us all.", "title": "Loved the Nuremore", "user": "Adi1234", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120408119}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Kids Club was great - our kids loved it - plenty to do, not just sitting watching dvds in the playroom. They played tennis, went on a ghost hunt, even took part in a magic show (with a \"real\" magician, not a \"pretend\" one as my kids told me!). We got to have fun with our kids, but also got to have time on our own..huge plus.", "title": "needs a revamp", "helpfulness": 1, "user": "olliemc68", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120382535}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Went for mothers 100th Birthday for 2 nights. Our party of 12 enjoyed ourselves as the staff went out of there way to help us. The service on the Saturday Night in the Restaurant was very slow but that was fully redeamed on the Sunday evening when we had the Birthday dinner, bopth food and service were first class. As the hotel was not busy it was lacked atmosphere at times.", "title": "Excellent food and staff", "user": "NIrelandRoamer", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116531604}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I have attended 3 weddings here and stayed the night for one. The food for all was excellent. The grounds are beautiful. Our bedroom was disappointing. The decor is old worldy but this was not in itself an issue as it is fitting with the feel of the hotel. The room felt jaded and in need of freshening up - not modernising.", "title": "Good Wedding venue", "user": "MissesMoMo", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 4.0}, "id": 116275507}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I booked this hotel as a short break for my partner and I. I had checked the reviews on tripadvisor and there were mixed reviews. However, we are so glad we went ahead and booked this hotel. This is a beautiful hotel in a picturesque setting with views of the local landscape and lake. It is a quiet hotel, as we were midweek guests, the hotel was very quiet. I think the main reason for this is its lack of self promotion. The grounds are so well kept with beautiful views. The staff were outstanding. The reception staff helped us locate the residence of a relative, even calling people they know to find the correct location. The bar staff are very friendly and the bar is kept in immaculate condition. The hotel itself is quaint, if you are looking for a modern experience this is not it, it is traditionally styled, but it is very well kept and very nicely decorated. The room was lovely, very clean and spacious. Again, the views from the room were lovely. I noted that the supply of towels were generous, unlike some hotels I have stayed at before.", "title": "excellent hotel, hidden gem in the country", "user": "deepforest2501", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116245851}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The food served in the restaurant is fantastic. Portions are just enough to enjoy but without being excessive. Presentation is excellent. The breakfasts are not buffet but are served up on order, they are of very high quality. On the last day, we had to depart early for an appointment and the waitress (Jacinta) offered to make up some bacon sandwiches for us to bring with us. Both my partner and I were very impressed.", "title": "Excellent Staff, Beautiful views", "user": "WhereToNextTime", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115862451}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Afternoon tea in the Nuremore was lovely, especially on the patio.", "title": "Loved it!", "user": "Sarah1196", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115547208}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We were a little apprehensive coming here as we had read so many mixed reviews however our worries were soon relieved. Check in is usually 4 pm. We had requested to check in at 1pm and this was no problem. When we arived we were greeted by an extremely friendly member of staff. We had lunch in the bar which was delucious before going to our room. The room was spotless as was the immaculate bathroom . My fiance enjoyed a round of golf whilst i went to the well equipt gym abd enjiyed a massage in the spa. We had a fantastic dining experience where the food was second to none. We really enjoyed our stay here and would definitely come back. We had just two negative points-a terrible view from our room 403 and the expensive drinks.in the bar.", "title": "Great country hotel. Old world charm.", "user": "econno", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117199818}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "it really is not advertised enough, Plenty of extras that are not even mentioned for example ample toiletries and gowns and slippers that you do not even get in some Irish Castles that I have stayed in. Lovely Hotel reception area inside and out. Not dated as I read before going, in fact new buildings and decor. Beautiful Gardens,plants surroundings, nice walks, food superb really good service in restuarant and bar and the Hotel is extravagant in every way to the guest. Gym and pool are fab. Spacious rooms and seated areas. Lovely artwork and paintings all around the Hotel. We would really like to return to this lovely garden of Ireland and do not normally return to the same hotel again. Even the Clubhouse looked so nice that I could have stayed in it!", "title": "Much nicer than advertised", "user": "vaila", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117106748}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed at the Nuremore for 2 nights. Room was larger than average and had a great view of the golf course. Service was extremely good across all areas eg reception, restaurant, bar etc. Restaurant was also impressive - good presentation and quality of food. Only downsides were the decor which needs updating and plumbing which was slow and noisy.", "title": "Great service but needs refurb", "helpfulness": 1, "user": "GH24", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116904014}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed for a long weekend for a family celebration. The hotel staff were so helpful and friendly throughout our stay I cannot give them enough praise.", "title": "Fantastic family celebration weekend", "user": "loopykat", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116751182}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were here with extended family whose ages ranged from 100 to 7 years and the hotel perfectly coped with our diverse needs from family rooms to single disabled rooms. All rooms were large and comfortable - our family room was a big hit as the childrens beds were in a separate area with plenty of space for everybody.", "title": "we will definately go back there", "user": "lysa27", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116673494}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed 2 nights in october", "title": "Excellent Food", "helpfulness": 1, "user": "Cat79Dublin", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 120352729}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "the hotel restaurant is top notch food is fab", "title": "Excellent!", "user": "Marta D", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119252071}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "unfortunately this is were my glowing report ends", "title": "Lovely but a bit tired...", "helpfulness": 1, "user": "ralphhos", "date": "October 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118921942}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This hotel is more suited to an older clientele and needs a good airing", "title": "Great Course & Hotel", "user": "Yogmart", "date": "September 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117875901}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Me and my Boyfriend went to stay in that hotel some time ago. We arrived quite late the receptionist greeted us very nicely, chatting up with us, while checking us in. Room nice and spacious, bed very large comfortable! Never slept better :)", "title": "definitely not child-friendly", "helpfulness": 2, "user": "caileen30", "date": "August 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 1.0, "service": 2.0}, "id": 117373399}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 20, "very good": 57, "terrible": 9, "excellent": 90}, "aka": "Nuremore Hotel And Country", "slim_ranking": 1.0}