{"user_rating": 4.0, "review_count": 31, "name": "NYC-JC Guest Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We stayed in 70 Greene Street for 8 nights. The self catering apartment was clean, tidy, well furnished and equipped. As we were in a corner unit on the 34th floor, there was a fantastic view across to Mid and Lower Manhattan especially at dawn. The concierge was polite and helpful in providing information about the local area. The managing agents were exemplary in dealing with minor issues we had like additional bed-covers, a faulty hairdryer and faulty lamps. They even responded to our email at 11.00pm! A word of warning to smokers. They enforce a strict no smoking policy.", "title": "a bite of the big apple!", "user": "Dunedain", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178544477}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "There is a well equipped gym on the 11th floor with an outdoor pool and recreational area for sunbathing or a barbecue.", "title": "Best stay ever.", "user": "Travelmann28", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178440560}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The locale is quiet and suburban more suited to an escape from the bustle of Manhattan. There are more restaurants about 15 minutes walk away at Grove Street. A block away was the local City Diner which provided good value for money. A few minutes away tare fantastic views of Manhattan by the waterfront at Exchange Place", "title": "lovely stay!", "user": "EmilFaber", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159404542}, {"rating": 2.0, "stay_parameters": "Stayed January 2013", "text": "70 Greene Street is about 2 blocks away from Exchange Place Path station. This links Newark to the World Trade Centre or 33rd Street in Manhattan. Journey times to the WTC was about 7 minutes and 40 minutes or so to 33rd Street.", "title": "Sudden cancellation even though payment was done months ago", "helpfulness": 3, "user": "Kim L", "date": "March 31, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 4.0}, "id": 156180691}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "If arriving from JFK or La Guardia, unless using public transport, be prepared to sit in the notorious New York traffic during the rush hour (not unlike the large parking lot that encircles London!) It took two and a half hours from JFK to get to Jersey City. If arriving from Newark, then it is a short journey to Newark Penn station and catching the Path train to Exchange Place.", "title": "No heat, horrible condescending service", "helpfulness": 1, "user": "sabai_sabai", "date": "March 31, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 156111903}], "location": {"country": "United States", "city": "Jersey City"}, "stars": 3, "variance": {"poor": 2, "average": 1, "very good": 5, "terrible": 5, "excellent": 18}, "slim_ranking": 0.105263157895, "description": "NYC-JC Guest Suites is a luxury guest suites alternative online booking company at affordable prices in New York Metro area. Our New York apartments is also located on the Jersey City waterfront and feature panoramic views of the Manhattan skyline. Select suites feature views of the Statue of Liberty as well. Guests will enjoy the available amenities, such as the fitness center, swimming pool, jogging track, barbecue area, sun decks, movie screening room and club lounge. The units are only two blocks from the PATH train station and one block to the ferry. Path takes only 2 minutes and the ferry takes 5 minutes to Manhattan.All of our units are spacious, fully furnished and newly renovated apartments with full kitchens furnished with pots, pans, china, and glassware. A washer and dryer are included for convenience as well."}