{"user_rating": 4.5, "review_count": 837, "name": "O&B Athens Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I've just returned from a month-long trip to Athens. The 9 of us (2 families with kids aged 11-17) stayed at the O&B for 2 nights upon arriving in Athens from the States, and found it a cool, comfortable and friendly haven from the heat and bustle of Athens. The beds are very comfortable and the showers wonderful - we even had a view of the Parthenon from our shower!", "title": "Our new favorite hotel in Athens", "user": "Googoose25", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115549587}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The hotel is located on a tiny street in the hip, grafitti-decorated neighborhood of Monistiraki - a short walk to the Agora, the Plaka, and all the sights on and around the Acropolis. We walked everywhere, day and night, and really enjoyed all the amazing restaurants and shopping in the neighborhood.", "title": "stylish and well located", "user": "keithuk", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115479372}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The hotel staff were lovely and helpful. We enjoyed the food and cocktails available in the hotel restaurant for several meals: breakfast is superlative, with addictive spanikopitas, tiropitas and Greek yogurt. We liked the O&B so much that we changed our original reservation at a cheaper hotel and returned for another 3 nights in July, as we passed back through Athens on the way home. We love the O&B!", "title": "Location, location and exceltent facilities!!!!!!!", "user": "ElyFare", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115451493}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "In Athens it's best to stay in the central area as the centre is largely pedestrianised, busy and has everything you will want to see. So O&B is ideally located in the flea market district and close to the main tourist areas. From the road and from the roof and some rooms you can see the Acropolis, which is within walking distance (if you're OK with hills!) The agora and main tourist night areas are even closer. This is a good quality stylish boutique hotel, with friendly staff and very comfortable rooms (they are not big rooms but have everything you need and most importantly a very comfortable bed and well fitted bathrooms - in short ideal for a city hotel).", "title": "Are we in Athens?", "user": "pcp0827", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115439921}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I think this is very good value given the location, which is reflected by its popularity with tripadvisor members.", "title": "Perfect location for sightseeing in Athens", "helpfulness": 2, "user": "jpknw", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115191907}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed at O&B twice during our vacation and loved it both times. Room was comfortable, amenities were great --- and the breakfast was the BEST. Great selection of egg dishes, greek yoghurt, fresh fruit and pastries. The staff was always helpful as well --- and even made arrangements for takeaway snacks on the morning of our early flight. Highly recommended.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "traveler74Seattle_WA", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50624910}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Only for 2 days before our cruise -- not enough time to see everything -- enjoy a great complimentary breakfast before walking to all the great shopping in the Plaka or if you are there on Sunday, the fun of the flea market in the Monistriaki -- the service, the food, the rooms are all first class -- intimate yet effective service -- walk to the Parthanon, the Agora and literally a hundred restaurants and tavernas -- forget the big hotels, you'll love this place.", "title": "A Gem", "helpfulness": 2, "user": "RicoFan", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49745195}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Don't be put off by the seemingly seedy neighbourhood, this hotel is a hidden gem! In fact the location is excellent for tourists as it is very safe, within walking distance of 2 (spotless) metro stations (including the one to/from the airport), most of the ancient ruins you would want to visit and both the trendy restaurant/bar areas.The staff and service are the best we have encountered- much better than a big 5* hotel where you are just an anonymous face- here they not only know who you are, they know what you like and they arrange it for you quickly and seamlessly. The food in the restaurant is sensational and very well priced. Yes,the rooms are a bit small but they are very well appointed and if you want to splurge, book the Acropolis suite and have breakfast on your own private terrace looking up at..you guessed it- the Acropolis. What more could you ask for? Everyone always has a smile and is happy to help.We can't wait for an excuse to return!", "title": "Perfect", "helpfulness": 2, "user": "travelingaussie0", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49615082}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The staff were friendly and helpful and the welcoming pastries and drinks were a nice touch.", "title": "Design over function", "user": "John2702", "date": "October 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 47963453}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Although we had the top floor terrace room, which I understand is the largest guest room, it felt small. Hanging space was limited and only 5 clothes hangers were provided for 2 people and two drawers for clothes. A case of design over function.", "title": "Excellent hptel", "helpfulness": 1, "user": "XYZ100", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47889746}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My wife and I spent 5 nights at the O&B. It is a modern, clean and spacious little hotel with an excellent breakfast and all amenities we could ask for, including a very decent room service. It is located in a trendy neighborhood, 5 minutes walk from the Acropolis (but 20 minutes downhill from the Parthenon), 15 minutes from the Parliament, 10 minutes from Gazi (for those who like it) and 2 minutes from the Psiri Metro station where one can take the train to the Piraeus. The neighborhood is a mix of old, ran-down buildings and new, renovated apartments. There are a couple of excellent restaurants nearby where one can experience real Greek cuisine and, after a 5 minutes walk, one can seat at a nice outdoor lounge and look at the Parthenon while seeping a nice frappe.", "title": "Excellent location, wonderful staff", "user": "LuizTrip", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115896681}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The small caveats we found: the bed was a bit too hard for us, the curtains are too short and not large enough so complete darkness is not possible. Some people may find that the wardrobes are too small but that did not bother us. An iron table was not available but they ironed a couple of pieces for us free of charge.", "title": "Lovely Hotel", "helpfulness": 2, "user": "simonbas", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115892581}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "But, apart from the excellent location, confy rooms and decent food, the best asset of this hotel (and of pretty much all Greece) is its staff. From our arrival to our departure, we were always greeted by a friendly, professional, and knowledgeable staff that went the extra mile to make us feel home. During our innumerous trips, we very rarely felt so welcomed. Everything is in the small details: the welcome drink they bring to your room when you arrive, the almost unrestricted availability to answer to whatever question you might have, the concern to bring every single issue to closure, the fact that the waiter knows what type of coffee you drink on your breakfast. I wanted to stay there if only to start and finish my day surrounded by such wonderful staff!", "title": "Cannot praise this Hotel highly ennough", "helpfulness": 2, "user": "Boffinette", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115828058}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We will definitely go back there, even if it is for one night because it will feel like visiting old friends.", "title": "Very modern in a good position-ignore the streets around the hotel.", "user": "vlballem", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115786964}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "There's not much I can say about the O&B that hasn't been said already but I would just like to compliment a couple of the staff. Firstly the guy on reception (don't know his name I'm afraid but he had a goatee sort of a beard) who managed to get up the stairs with our luggage to our room faster than we managed it in the lift! Also Viktoria in the bar who was really friendly and interesting.", "title": "Hands down, best place to stay in Athens", "helpfulness": 2, "user": "MariannaMiamibeach", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115782827}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "After much searching on TAwe chose the O&B hotel. The room was gorgeous and we especially adored the shower. The location was great since we wanted to immediately go to the Acropolis. Everyone was very helpful. The breakfast was delicious and we really enjoyed the area . While we walked to the sites we were right with the shopkeepers!!! We had read about the area not being great but we had noproblems at all. It is safe and actually very quaint to be with all the Greek people!!!!", "title": "We really loved this hotel", "user": "judi5775", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 47446575}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We had a small mix up with our pick up at the hotel but the manager was very accomodating in giving us free passage to our ship because of it.", "title": "Lovely, professional, delicious, knowledgeable, clean...", "helpfulness": 1, "user": "Christineabella", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44401914}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "It was somewhat hard to find for our taxi driver but we finally did find it. The front desk recommended a great restaurant that was close and we loved that too.", "title": "Nice Luxury, Great location, Overpriced", "helpfulness": 1, "user": "mabp16ny", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43421005}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I would defintiely recommend the hotel!!!!", "title": "COMFORTABLE WITH GOOD SERVICE, BUT OVER-PRICED.", "user": "SarahAB", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 43060366}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We arrived late and the staff sent up this lovely plate of cheese, raki, sun dried tomatoes, bread and olives. They were completely prepared for us, led us right to our room and after the delivery of the plate, all was quiet.", "title": "cute, ideally located boutique hotel, with superior service", "user": "BibouFrance", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41039702}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I've stayed at dozens of hotels across Europe, and the O&B in Athens provided one of the best hotel experiences I've ever had. First of all, the location couldn't be better...just a 5-minute walk to the main gates of the Acropolis and centrally located to most of the other important Athens sights. Second, the hotel itself is a perfect mixture of form and function: lots of chic design elements that aren't so over-the-top as to seem impractical or silly. And our room (top floor, with a balcony and amazing Acropolis view) was perfect. We didn't even want to shut the blinds at night because it was so great to lie in bed at looking at a perfectly framed vista of the beautifully lit Acropolis--and waking up to the same view in the morning. (My only quibble with the room was the presence of a counter and sink in the bedroom area, which seemed to take up quite a bit of space unnecessarily, but it barely even qualified as a detraction--and it turned out that the second sink came in handy a few times.) Most important, the service was amazing. Every single member of the staff we encountered was extremeley helpful and friendly. The fellow at the front desk was always warm and accommodating, and the woman who managed the breakfasts (she answered my room service call and delivered breakfast to our room both mornings) was so eager to please and bent over backwards to meet our every need. She even refused to accept a tip the first morning, as though she felt her excellent service were just to be expected rather than something to be rewarded.", "title": "One of my all-time best hotel experiences", "helpfulness": 1, "user": "briguy2006", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115772220}, {"rating": 4.0, "title": "Great Location, Friendly Staff", "text": "I didn't have huge expectations of Athens; everyone I'd talked to before our trip basically said it was a pit that was just a fly-through destination on your way to the islands. However, we left with an incredibly positive perception of the city after being there for three nights and two days, due in no small part to our very pleasant stay at the O&B.", "user": "Wrldtvlr27", "date": "July 24, 2011", "id": 115728693}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Very friendly - helpful staff, great breakfast, we stayed in a superior room, which was pleasant, albeit a bit small. The location was perfect - next to metro station, Agora, and walking distance to Gazi (trendy bars, restaurants) - we would stay there again", "title": "Beautiful boutique hotel, excellent staff and service, great location!!", "helpfulness": 2, "user": "EnchantedTravellers", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115701198}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "What a find! We were looking for a well located, stylish hotel in a safe area in Athens and thanks to Tripadvisor comments we decided to give the O+B a try. We were not disappointed.", "title": "Pleasant hotel in great location", "user": "pra51", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115610895}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Upon our arrival on the day of a general strike, we were warmly welcomed and shown to our room. We were pleasantly surprised to also be greeted with a lovely welcome treat of lemon cake , mastiha liqueur, and other sweet treats. We knew that we had found our home for the week.", "title": "Good value in Athens!", "helpfulness": 2, "user": "woodenni", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115589039}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We originally weren't even going to be in this hotel was it not for my paranoia about staying in our original hotel which was a little too close to Syntagma square given the recent riots. I had certainly looked at this hotel whilst searching through trip advisor originally, and was put of a little by the reviews that said it wasn't a very \"safe\" area. Turns out that's not entirely the case. Truth be told that it's not the nicest street around, but after a few nights, we still have had no feelings of fear for our safety walking down the street at all. Looking out from my ground floor restaurant window now, I see a little junk store, a jewelery store, an electronic store (with a resident German Shepard lying on the pavement) and ok, one, sex DVD store, so really it isn't that bad. Admittedly there's also a fair bit of ugly graffiti, but then where in Athens doesn't? It turns out location-wise it is actually excellent, with the metro station and a stop for the hop on hop off Athens City Sight Seeing Bus just around the corner, many fantastic restaurants nearby (including the fantastic Souvlaki Bar), and within walking distances to Monastraki and the Acropolis.", "title": "Writing this review whilst having breakfast - hopefully not biased. :)", "helpfulness": 1, "user": "TravelDoc23", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115178854}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "The most impressive thing though is the service - it is what a boutique hotel should be. Personalized and very attentive - the front staff knew us by name, knew when we were out and ordered turn down services without request, served coffees/ waters etc at the table (despite it being a buffet style breakfast), and supremely polite. Even the taxi driver that they organized to pick us up at from the airport was friendly (we had discussions about the current Greece crisis, Greek football and the recent betting scandals, and even an impromptu Greek lesson!)...", "title": "Nice hotel/ seedy location", "user": "swa", "date": "July 5, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 4.0, "rooms": 4.0}, "id": 115033664}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Our Supreme double room is quiet, despite a small restaurant/ bar across the road - the glazing on the windows is incredible (it was actually quite loud with the windows partially open). The beds are comfortable, the showers a good pressure. Free reasonably sped wi-fi. Complimentary buffet breakfast (excellent breakfast by the way - just finishing off my apple pie now...) The only real downside was the slightly cheapo showering products provided - but can't have everything right...?", "title": "Great service, location and experience", "user": "colindkavanagh", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114964576}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "So on the whole, very happy with my stay here so far! Highly recommended! (And, no, this is not the breakfast/ coffee talking.)", "title": "Athens best kept secret", "user": "justcruising52", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114961703}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Small stylish hotel with friendly service and a great breakfast. Only issue is the location. The neighborhood is in transition but very few things have transitioned yet! Rooms are very small.", "title": "Loved this hotel. We'll definitely be back !", "helpfulness": 1, "user": "realgreek", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114696078}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Please do not be put off by the location of this hotel - in a small side street . We arrived early morning after a long flight and not knowing Athens was concerned about the location of the hotel. Although our room was not ready we were given a temporary room to relax. When we emerged refreshed we found that the were in the heart of Athens, walking distance to the main sites and the best areas for spending evenings.The staff were excellent, knowledgable and very friendly - they made our stay. A definate find. We will definately be back for a longer stay. If you are there for a night go for the deluxe as they come with a view if longer go for the superior although cheaper they are bigger but with no view. Roy", "title": "Excellent hotel location and service - sold Athens to us", "helpfulness": 4, "user": "Roysiesg", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38605568}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If you arrive in Athens on public transport, you might walk down Leokoriou Street thinking it's a bit \"interesting\", but then you see the hotel. Small but oozing class. Staff were incredibly helpful, decor and rooms are what a boutique hotel should (but often) fail to deliver. Your a stones throw from the ancient Greek sites, area of Plakka, and Psiri is on the door step.", "title": "Excellent", "helpfulness": 2, "user": "DanUK", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37260883}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Can't fault the hotel or rooms, breakfast or service - one of the best I've stayed at.", "title": "Fantastic", "helpfulness": 2, "user": "giordanof2", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36411520}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If your looking for a bar then the other side of the street from the hotel, down a small alley, you'll find something small, simple, a dj and a decent atmosphere. Didn't seem to have a name or much of a sign!", "title": "Fantastic Boutique Hotel - with the best location!", "helpfulness": 2, "user": "Persia-Bellini", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35341828}, {"rating": 5.0, "title": "Wonderful boutique hotel", "text": "The level of service we received at this hotel could not be beat. The staff was incredibly attentive and courteous. They went above and beyond to make sure our stay was pleasant and convenient. The rooms were gorgeous and more importantly, clean. The bathrooms were especially nice. The shower was the best I've ever had. Perfect water pressure and pristine. If I go back to Athens I wouldn't even consider going to another hotel.", "helpfulness": 2, "user": "snownel", "date": "July 17, 2009", "id": 35039158}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My wife and I stayed here for three nights in November. The hotel was a little tricky to find as it is tucked away down a rather unprepossessing side street. That said we were made to feel really welcome by the exceptionally helpful staff from the moment we walked through the door.", "title": "We felt really welcome", "helpfulness": 2, "user": "Simon073", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 54213540}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had a room with a balcony from which you could see the Acropolis. For a 'suite' the room was a little on the small side with little hanging space for clothes but was tastefully decorated and comfortable. The shower was fantastic.", "title": "A warm welcome at the heart of Athens", "helpfulness": 3, "user": "sweatpea", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54124563}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Food in the restaurant was excellent as was the service.", "title": "A gem. Look no further.", "helpfulness": 5, "user": "zurich2010", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 53254833}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Despite my comment above on the street itself the location was good in terms of being albe to get to the main sites around Athens. We walked to pretty much everything.", "title": "Great Boutique Hotel to Explore Athen's Sights", "helpfulness": 4, "user": "AduffOttawa", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51479523}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "In summary we were really pleased to have chosen the hotel and enjoyed a great stay with the terrific staff being the key factor.", "title": "Greatest value you will find in Europe", "helpfulness": 2, "user": "bengrosse", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51364481}], "location": {"country": "Greece", "region": "Attica", "continent": "Europe", "city": "Athens"}, "stars": 4, "variance": {"poor": 2, "average": 16, "very good": 198, "terrible": 4, "excellent": 617}, "aka": "o And b Athens Boutique Hotel", "slim_ranking": 0.0141843971631, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "O&B is a cozy Boutique Hotel, in the centre of Athens, next to the main sights of the city and just one minute walking from Thisio Metro Station. With its Acropolis Suites with view of the Parthenon, its elegant rooms and its Bar Restaurant, O&B Athens Boutique Hotel provokes you to experience the new meaning of hospitality and care, giving a new flavor and meaning to the urban lifestyle."}