{"review_count": 62, "slim_ranking": 95.0, "name": "O'Keefe's Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Visited October 2012", "text": "Great feed at good value for money. Have a lunch menu in addition to a full menu if you want something a bit smaller. I had a steak with pepper sauce and others at the table had roast of the day, seafood basket and someone tackled the mixed grill which they couldn't finish because there was just way too much on the plate (as the menu indicated !!!). Plenty of cold beer and wine is available and the bar staff were always helpful and checking to make sure meals were okay etc. If you genuinely just want an old style counter meal without the added extras (and price), then I thoroughly recommend this venue.", "title": "Good old style counter meals still exist", "helpfulness": 1, "user": "iamborg69", "date": "November 5, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 144517715}, {"rating": 4.0, "title": "It's a pub", "text": "Big good meals, staff are typical bar staff but not overly friendly, not overly rude, toilets are disgusting and outdoors but overall a good feed and good pub if in Launceston", "user": "Traveling_Aussie10", "date": "October 28, 2012", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 143892827}, {"rating": 5.0, "title": "Great food and price", "text": "We dine there every time we visit Launceston, approx 3 times per year. Food excellent particularyly the seafood...and the Guinness cold!!! Just right!!", "helpfulness": 1, "user": "wbj308", "date": "October 25, 2012", "id": 143676114}, {"rating": 4.0, "title": "top meal", "text": "popped in the other night for a few drinks,checked out the menu, and booked for dinner,had the rump steak rolled in pepper cooked to perfection..my wife had the chicken breast with sundried tomato and pesto, she said it was the best she has had in launceston..well done guys,we will come back,cheers", "user": "rohanj1", "date": "October 21, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 143324716}, {"rating": 3.0, "title": "Average food", "text": "Roast roll was average.", "user": "trippentheplanet", "date": "September 2, 2012", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 139117370}, {"rating": 3.0, "title": "Pricey", "text": "After paying $91 for one VB stubby, a bottle of Pinot Grigio and two fish of the day (flathead), my husband and I decided that it was better to pay a little more for a meal in a restaurant.", "user": "2ofusMelb", "date": "August 13, 2012", "id": 137127612}, {"rating": 2.0, "stay_parameters": "Visited August 2012", "text": "O'Keefes was disappointing. The staff were friendly, however $28 for two small pieces of fish plus hard vegetables was a bit over the top. On the last night of our four night stay in Launceston, I had Tasmanian ocean trout which was superb, and only cost me an extra $4. Enough said!", "title": "Very disappointing", "user": "Poetripedla", "date": "August 2, 2012", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 136035814}, {"rating": 4.0, "title": "Great food", "text": "A group of us went to O'Keefe's for a meal because it was advertised as the \"best pub meal in Launceston.\" The service was good from the waitresses. The meals at the rest of my table appeared substantial, padded out well with chips, and I heard few complaints from the group I was with, apart from the fact that for basic pub meals, the prices were fairly expensive. However, I ordered Squid with Greek Salad and was really looking forward to a nice Greek Salad: fetta, olives, tomato, lettuce, onion and cucumber. What could be so difficult about that? When it came it was all lettuce! I paid $20 for lettuce, three olives, a thin slice of cucumber, a quarter of a smallish tomato, about four very very thin onion rings cut in half, and six to eight squid rings. The waitress came up to the table and asked how we enjoyed our meals. Everyone else said okay, good etc as you do; I said that I wasn't happy with my meal as it was a very poor Greek Salad and all lettuce. She wasn't expecting this and obviously did not know what to say. I asked her to pass it on to the chef. I did not ask for my money back. I was not rude about it. When she finally came back to the table to collect our plates, I asked her if there was any response from the chef. She said no, they were too busy..... So then, why do waitresses ask if you like your meal? I ate my husband's leftover chips to compensate for the lack of sustenance.", "user": "larnie1950", "date": "July 2, 2012", "id": 133217030}, {"rating": 3.0, "stay_parameters": "Visited June 2012", "text": "I was very disappointed. All I wanted was an acknowledgement that maybe their Greek Salad was a little skimpy for $20. I won't eat there again, not because of the meal but because of the attitude that the opinions of customers are unimportant.", "title": "Awesome mixed grill", "user": "StuieG", "date": "June 4, 2012", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 131306078}, {"rating": 1.0, "stay_parameters": "Visited May 2012", "text": "O'keefes has great food and friendly staff. fabulous place to dine with friends or alone, you will be treated well!!", "title": "O.M.G!", "helpfulness": 2, "user": "oakie-52", "date": "May 11, 2012", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 129732740}, {"rating": 5.0, "stay_parameters": "Visited November 2012", "text": "We was hunting for a place with roasts & steak for our last nite in Tassie and never regretted trying O'keefe which we keep driving past. Eye fillet was excellent, beer battered fish & chips was heavenly, but roasts was bland (compared to the one we had in Georgetown's Gray's hotel in the afternoon). Would highly recommend this place for good pub food at reasonable price.. do book in advance as we waited for 45mins before we get a place.", "title": "Great pub food at a fair price!", "user": "Toffee12", "date": "November 30, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 146481101}, {"rating": 3.0, "stay_parameters": "Visited October 2012", "text": "Check the bar crowd before sitting down. That will give you a fair idea of the target market. Most of the regular drinkers are a little worse for wear after a hard life on the booze, and the place is a haunt for middle-aged women on the prowl for some younger action. Still, according to the sign outside, it's the place for food in Launceston.", "title": "The food is a bit like the drinkers in the front bar - basic, and getting on in years", "user": "morewine21", "date": "November 26, 2012", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 146187371}, {"rating": 5.0, "title": "Good Pub Tucker", "text": "The food isn't bad - but like most places in Tasmania, pay a few dollars more in a proper restaurant, and the quality jumps exponentially. On our last visit, the steak was ordinary, the fish was little better, but surprisingly, the thai curry was excellent. Perhaps the cook was bored with serving meat and three veg to the (largely) non-discerning customer base?", "helpfulness": 1, "user": "2oldhobartians", "date": "November 25, 2012", "id": 146118218}, {"rating": 4.0, "title": "Good pub grub", "text": "I wouldn't choose O'Keefe's as a first choice, but it's often the only place open in Launceston. On that basis, it deserves patronage. Just don't expect truffled foie gras or anything interesting on the wine list.", "user": "geoffery c", "date": "November 21, 2012", "id": 145932780}, {"rating": 2.0, "title": "Never Again!!", "text": "Lovely small serve of Roast Lamb was only $12, and so much meat !!", "user": "KevAnDee O", "date": "November 19, 2012", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 145779638}, {"rating": 3.0, "title": "Bit disappointed", "text": "In Launceston on business for music festival & staying just up the road. Ate here all week. Was told kitchen closed at 9pm. Long days in this business so not arriving until 8/8.30. Arrived tonight at just after 8.30pm to be told that the kitchen was closed as they were, and I quote, 'hot & cranky in there'. Well, guess what - so were we and now we will not return. Wait staff have been lovely I must say but after patronising the place all week, it wasn't what we expected. Thank goodness for the great little curry place up the road who fitted us in with a smile.", "helpfulness": 1, "user": "DJDHobart_Australia", "date": "March 9, 2013", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 154071323}, {"rating": 5.0, "title": "great place for top music and beer on tap", "text": "Have visited O'Keefe's plenty of times usually after going out for dinner usually really good music untill late and all the usual beers on tap right in the centre of Launceston.", "user": "Nick J", "date": "February 20, 2013", "id": 152596669}, {"rating": 4.0, "stay_parameters": "Visited March 2012", "text": "My three friends and I have dined here every Cup Eve and Night for the last four years and we love it. The steak is great, in fact hard to pass on the menu both for qualilty and value, we have tried the other options, the seafood platter or basket and the fish and chips, No one has been less than full and entirely satisfied, These two nights are possibly the buisiest nights of the year and we have always found the service friendly fast and competent. Have booked again for this year", "title": "Great Pub grub served by nice people", "user": "Tartyone", "date": "February 19, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 152575555}, {"rating": 3.0, "stay_parameters": "Visited January 2013", "text": "Dining room needs work, outdated chairs and cramped room. Not a bad meal - we were staying nearby and wanted to see if their wall was true \"Best food in town\"... Well, it's not the best, but still good enough to go back. I had the parma - which was quite nice but felt a little \"processed\". My fiancé had the small roast of the day (pork) which was nice. We also had some wedges - which to our surprise didn't come with sweet chilli and sour cream! Perhaps that isn't as common in Tas? Anyway, our waiter went and got some, and they charged us for it ($2.50 each, on top of the $6 bowl of wedges). I had a beer, and it tasted like the beer lines needed a really good clean.", "title": "Decent pub grub, but some work needed", "user": "Matt L", "date": "January 13, 2013", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 149610300}, {"rating": 2.0, "stay_parameters": "Visited January 2013", "text": "Walked in off the street it was a hot day and it showed, all staff were tired, took ages for drinks and they got it wrong !! A red! Should have been a white!!! Roast of the day !!! Not much! Lots or rushing no personal service and the room was a bit tired!!! Maybe too picky ! After all the other gorgeous places in Launceston a bit of alert down! For late night requirements of everything from food(gourmet) to wines all top shelf try Davies in IGA not sure of street name but sensational for wine advice and top class food!!!! Petrol and they have myer one for purchases over 50.00 !!! Crazy !!!! Well worth it ....", "title": "Needs an update", "user": "Michelle M", "date": "January 5, 2013", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 148871439}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 6, "average": 15, "very good": 23, "terrible": 5, "excellent": 13}}