{"user_rating": 4.5, "review_count": 191, "name": "Oak Bay Beach Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We just returned from a long weekend at Oak Bay - and we found it uneven. The property is very nice in general but the entire time we noticed a bad smell in the hallways of our floor. There was a water bottle wih some previous guests cigarette butts on the balcony off of our suite. One of the bedside lights was broken, and we had to call to request linens to make up the sofa bed.", "title": "Still working out the kinks", "helpfulness": 2, "user": "lola_loveridge", "date": "April 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 156338112}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My other gripes concern visiting the property with small children. We could tell we weren't the target demo (the property seems to be courting seniors/retirees) -- but at these prices, the hotel should be more accommodating. How about a kids menu - or just a few simple items - on the room service menu (grilled cheese, macaroni and cheese, fruit salad and yogurt). The Snug - the restaurant on the premises with the menu that would have the most kid-appeal (fish and chips, burgers) - does not admit minors. The hotel dining room feels too formal for a meal with kids. And Kate's Cafe - which is the most kid-friendly setting - has cold sandwiches, cold salads, things like meat pies and quiche - not favorites of the under-5 set. To top it off there is apparently only 1 high chair on the premises.", "title": "Easter Brunch", "helpfulness": 3, "user": "carrie808", "date": "April 2, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 156337251}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Now I must say the hotel tried to go all out for Easter, complete with an Easter bunny, egg hunt in the lobby, and a \"kids buffet\" (ah yes - there was the grilled cheese and fries) but it was oddly low to the ground and warmed by face-high piping hot heat lamps (accident waiting to happen). It is as if the staff do not have kids of their own - or any in their extended families. Odd!", "title": "The Best Place In Victoria", "helpfulness": 4, "user": "Sonia W", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156260711}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "EXCELLENT array of choices for brunch. Everything I had was delicious. The service staff were great, the ambiance very appealing, and the live guitarists an extra bonus. My only complaint is that there was no wheat-free option either for the main part of the brunch nor dessert (except plentiful fruit and salads of course).", "title": "We will be back!", "helpfulness": 4, "user": "Jenbear23", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156105480}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We recently stayed at the Oak Bay Beach Hotel and were very impressed. The staff was great (paying attention to privacy requests) and our servers in the restaurant and pub were top notch, as well as the food!. The location is perfect and the view of the ocean from the pool is fantastic. We wish that there was a way to get to the pools without going outside though. The room was lovely, although two of us managed to bruise our legs on the beds (don't really like the height of them). I have to say that after staying at other 5* hotels on the island and at Whistler, The Oak Bay Beach Hotel is #1 in my books. I hope that they keep up their service in the future!", "title": "Friends at the Oak Bay Beach", "helpfulness": 4, "user": "Diana D", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155666345}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Was her for a weekend meeting. Felt very comfortable, excellent services, friendly staff, and the rooms were very well laid out and comfortable. I particularly loves the lay out and design, large bathrooms, and fireplaces. I also really liked the beachfront view. Highly recommend!", "title": "Beautiful and Welcoming", "helpfulness": 7, "user": "AtBCCEO", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152965838}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I recently enjoyed a very pleasant night at the Oak Bay Beach Hotel. It didn't hurt that we were upgraded to an ocean view room (and now can never go back to less). The small kitchenette is perfect and the room is spacious and warm. The bed is very comfortable and with the window open we slept like babies.", "title": "A Real Treat", "helpfulness": 6, "user": "YYJhome", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152738283}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband drinks the occassional scotch and we stumbled across a scotch tasting presentation in the lobby -nothing exotic but a little bonus for him.", "title": "Outstanding & Heartwarming!", "helpfulness": 5, "user": "eau2water", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152400234}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We found the front desk staff to be very pleasant and helpful. Dinner in the pub was good (a bit of a wait in line but it was Saturday night) and in the morning we grabbed coffee and scones to eat while reading the paper in the cafe on premises.", "title": "Wonderful!", "helpfulness": 7, "user": "Shelley K", "date": "February 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152129955}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hotel is a little out of the way for Victoria sightseeing but as we are in Victoria regularly that was fine with us.", "title": "Luxury with a Smile", "helpfulness": 5, "user": "Maggie - Keith G", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151564632}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband and I recently stayed at this hotel. The service was excellent as was our room, we were given an upgrade with an ocean view. We hope to return and would certainly suggest to others that they would have an enjoyable stay. A wonderful night within our own city. The McPhersons , Brentwood Bay BC.", "title": "Recent stay on Feb.16/2013", "helpfulness": 14, "user": "Cathy M", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154208493}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We were in town overnight for a friends birthday party. The hotel far exceeded expectations. The rooms are modern, clean and very well appointed. Dinner at the snug pub with 9 party people was exceptional and surprisingly inexpensive. I've paid far more for far worse in my life. For the money, this is one of the best hotels I've stayed in.", "title": "Great hotel at an amazing price!", "helpfulness": 15, "user": "kevyk", "date": "March 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154186507}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "First stay (but not the last) at the newly re-opened Oak Bay Beach Hotel. They have done an amazing job of re-creating the feel of the original hotel with all the great luxury updates included. We had a garden level ocean view room, walk out to the ocean-side pools and hot tubs.", "title": "Excellent property and outstanding service", "helpfulness": 13, "user": "rafterguide", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153416906}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We will be back!", "title": "My husband's birthday treat", "helpfulness": 10, "user": "Millertime2013", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153339024}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Jim & Darlene", "title": "Perfect Retreat", "helpfulness": 5, "user": "Muriel M", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153305391}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "We live in the Seattle area and joined a friend who lives in Port Townsend to spend a couple of nights at this new property. We usually stay in downtown Victoria so this was a new adventure. After arriving by ferry from Port Angeles, we drove a few scenic miles to the small community of Oak Bay and the resort on the water. The hotel is luxurious and should meet anyone's standard of relaxed elegance. The location, the staff, most everything was delightful. They do need some work in the culinary area, I was unimpressed by the food, but understand that help is on the way.", "title": "Relaxed Elegance on the Water", "helpfulness": 2, "user": "DelGregorio", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155327811}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Our traveling companion enjoyed the spa, and we all enjoyed the surrounding area and the small village of Oak Bay. You're next to the yacht Marina which has a nice restaurant within walking distance of the hotel. I can easily recommend the hotel for a pleasant stay, and visit the small village of Oak Bay while you're there.", "title": "Our new Favourite in Victoria!", "helpfulness": 10, "user": "tofician", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155110565}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We just returned from three nights in a boutique suite and loved everything about it. First class accommodations with all the right touches. The hot mineral pool was a nice bonus and we cant wait to return this summer. They are still working out the kinks in the bar and housekeeping but this is to be expected in a new property. We also found it nice to be away from the noisy harbour and downtown where we usually stay.", "title": "Tom & Jill Our Anniversary Stay At The Oak Bay Beach Hotel", "helpfulness": 19, "user": "Tom W", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154631679}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We had a wonderful stay,the rooms are state of the art yet takes you back to an era of elegance and old charm. We were upgraded to an ocean view garden room ,the views here in Victoria are like no other.We made a full weekend of enjoyment,taking in the Dinner Theatre ,swimming in the large very warm mineral pool overlooking the ocean and had our breakfast in our room which are fully furnished including a four chair dining area.The hotel is so well done,just to walk around and take in the charm of it was outstanding,we will be going back soon.", "title": "Easy getaway", "helpfulness": 11, "user": "Vera-Veronque", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154557678}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We usually stay at the Empress but were curious about the new hotel in Oak Bay. The Hotel staff were great when checking in, even furnished our patio with outdoor tables and chairs- just for the asking. Usually in winter months they had planned to put them away. Great rooms. But I think they should have made the electrical plugs more convenient. (next time I'm packing an extension cord) The pub was too busy (gr...never did get a seat for the entire stay!) so we had our dinner and drinks in the sitting area of the lobby- Very nice and conveniently beside the buffet food. and gorgeous. The exercise room was small but fine enough for my daughter and I ...and all three of us enjoyed the pools. The Pools were nice and warm even on a chilly January day. It's supposed to be a non-smoking hotel - I was sad to see so many cigarette butts in the garden. Nice place for a change but i still love my Empress Hotel- and I can get into the Bengal for a nice drink.", "title": "Recent Stay March 7 & 8 /2013", "helpfulness": 11, "user": "Dianne W", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154291754}], "location": {"country": "Canada"}, "stars": 4.5, "variance": {"poor": 1, "average": 8, "very good": 24, "terrible": 2, "excellent": 156}, "slim_ranking": 0.0526315789474, "description": "The Oak Bay Beach Hotel is a spectacular five-star boutique resort and spa. Enjoy fine dining in The Dining Room, a dinner show or movie in the David Foster Foundation Theatre, hot drinks and housemade treats in Kate's Cafe, pub fare in The Snug (a local legend), or a relaxing soak in one of the three seaside hot mineral pools while watching whales breach offshore. Onsite adventure activities, a sommelier, in-room chefs, catering and conference facilities and event planning also available.Each stay includes: complimentary parking and valet, WiFi, local telephone calls, 24-hour access to our seaside hot mineral pools, steam saunca and fitness studio, turndown service and movie channels."}