{"user_rating": 4.5, "review_count": 56, "name": "Oak and Glass Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Really can't fault Oak & Glass at all. Lovely rooms - spotlessly clean and well furnished, friendly service and great food. Wish we could have stayed longer.", "title": "Perfect", "user": "Richard L", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124447111}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "8 of us enjoyed a meal just before Xmas for a double birthday celebration.", "title": "Enjoyable Birthday Meal", "user": "k r", "date": "January 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 122917739}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "As I am coeliac I called in during the day to check they would be able to cater for me.", "title": "Wedding venue- Fantastic staff & Food", "user": "Poeun", "date": "November 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120154904}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I was shown the menu for that evening, and the waitress kindly checked with the chef to", "title": "Great place to stay!", "user": "Keira M", "date": "October 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119841321}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "confirm that my choice would be gluten free.", "title": "What a perfect place to stay...", "user": "CIngX", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117023429}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Lovely comfortable Bed and beautifully cooked Breakfast. We stayed last night 13 May following a family birthday celebration.Uphill Suite is very spacious and comfortable. We watched a wonderful sunset from the 'lounge' windows. very good and I highly recommend it as a place to stay. Well done Amy and Team.", "title": "The C's", "user": "BevBristol", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129916625}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We have visited Oak and Glass many times over the last 5 years and have always had a fantastic welcome and wonderful food. As a consequence, we recommended it to my brother and his fiancee for their wedding last weekend. It was out of this world! The rooms were all fantastic, spotless and well appointed, the food was beautiful from start to finish (we stayed friday-sunday), the staff were accommodating (as usual), the flowers were stunning and everyone commented on what a fantastic,intimate venue it was for a wedding. We cannot think of a single thing to criticise. Amy,her family and her team are the best, you really know this is a family run business who care about their guests and making sure every detail was perfect. If you are considering coming to W-s-M for a day,night, weekend you have to visit Oak and Glass. We would recommend it to anyone who likes top quality food, beautiful surroundings and a friendly welcome.", "title": "Wedding bliss", "helpfulness": 1, "user": "SJANDJ", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128893592}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My father was a hotelier all his life and I grew up in hotels all over the country. Therefore, I can honestly say that the Oak and Glass was one of the very best I've been to. The service from Amy and the staff and the quality of the rooms (Putting Room) is of the highest standard.", "title": "Easter excellence", "user": "Bill S", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127547127}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Whenever I go to Weston in future the Oak and Glass will be the first place I'll call for a room and dinner.", "title": "Wedding day", "helpfulness": 2, "user": "dmountstephens", "date": "March 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125458269}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Stayed here for our wedding . got married in the conservatory on Feb 29th leap day . the weather was perfect . as for the venue it was fantastic for my self and my wife . Amy and her team did a wonderful job the service with the meal was brilliant and the room set up was great . nothing was too much trouble . the room we stayed in was excellent with fantastic views", "title": "Friendly, warm and very accommodating", "user": "jenfer77", "date": "February 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125392652}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had our wedding reception here a couple of weeks ago after visiting for coffee a few times and loving it. It was wonderful! Amy and co captured exactly what we wanted our wedding reception to be. I think our guests were sceptical as we went for the BBQ menu, but I believe all were very pleasantly suprised by the quality of the food. It was delicious. The rooms are beautifully presented, staff very friendly and happy to accommodate any request, and the B&B rooms upstairs are immaculate and decorated so tastefully. We have had so many of our guests comment on our wedding saying its the best they have ever been to. So many locals never even knew that this place existed and are planning to go back for dinner in the future. I would highly recommend Oak and Glass for food, coffee, B&B or for a private function. Massive thanks to all the staff for making our day so special for us and our guests.", "title": "'Best wedding!'", "user": "clairey20", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140014840}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Just a quick note to say this place is excellent, Food, Room and Service all second to none an all round very enjoyable experience we definitely plan to visit again and recommend to family and friends.", "title": "Excellent", "user": "Paul V", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136501456}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This was our third visit to the oak & glass and those few words speak volumes !! The food from evening dinner right through to and including breakfast is quite without doubt superb.The evening menus choice and flavours are devine the waitress polite / pleasant and v attentive Amy and all involved deserve full marks thank you. p s if staying in the putting room beware the shower controls work in opposite directions !! and the somerset life magazine is at least 3 years out of date ( but still a good read !!) seriously marks for the oak and glass and all who sail in her 10 out of 10 .", "title": "\"third time visit\"", "user": "Linda W", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135080868}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Had the beach room, which had restricted view of the sea.Room lovely, bright, clean,and more than expected.Found the shower room/toilet rather small, and would expect the larger person may find it too small.The staff friendly, and breakfast very good .Excellent position for prom walks, and plenty off off street parking.Would I go again, most certainly, would I recommend it, oh yes.", "title": "One to try.", "user": "geoffx", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134091085}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "I stayed at the Oak & Glass with my husband at the weekend & we were delighted by the excellent service, food & room.", "title": "A real hidden gem", "user": "Whizzo78", "date": "May 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130765466}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed here for two nights in their Uphill suite. Entered into an enormous lounge with sofas, TV, DVDs, books etc. High ceiling and huge sliding wooden doors to huge bedroom and another door leading to the luxurious bathroom! Thick towels, nice toiletries, tea & coffee facilites, balcony and great views. The breakfast, taken in the light & airy conservatory, was made with fantastic quality ingredients and allowed room for the various courses including the full english!", "title": "Stylish, spacious and great value", "user": "kierasneddon", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114839282}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Helpful and welcoming staff - and eat in the restaurant if you're there - you'll kick yourself if you don't (see separate review).", "title": "Loved everything about this establishment and staff were exceptional.", "helpfulness": 1, "user": "meaka", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112591589}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "My husband and I hired this venue for our wedding reception, from the very first meeting the staff were welcoming and could not do enough to meet our expectations. They organised the organic hog roast which was fantastic and had it slow cooked on sight in full view of all the mouth watering guests. They allowed us to use our own decorations purchased elsewhere and even pre-ordered specific alcohol we requested. My organised our flowers and assisted with gift baskets and they have a wide knowledge of wedding contacts for most other needs. They organised breakfast for when we asked instead of a dedicated time frame.", "title": "Simply wonderful - the VERY best B&B in England!!", "user": "ChrisPj31", "date": "May 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109060726}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We hired the Uphill suite, this was absolutely fabulous, spacious with classic features and a wonderful view of Weston Beach. My family hired the other two rooms and they were more then pleased with their views and surroundings.", "title": "Best Sunday lunch out in a long time!", "helpfulness": 2, "user": "AlexBeard80", "date": "May 4, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 106832595}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "During the wedding night the owner Amy continued to oversea the event making sure everything went to plan, I expected to pay more for the service I received and the perfect night I had.", "title": "Still the Best!", "user": "dg20", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106501598}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 7, "terrible": 1, "excellent": 46}, "aka": "Oak And Glass Hotel Weston Super Mare", "slim_ranking": 0.298245614035, "description": "Quickly established itself as one of Weston's most luxurious and special places to stay Oak and Glass has 3 exclusive luxury rooms which fully compliment it's fine dining restaurant experience. They are all finished to a very high standard in our recently restored home on Weston-super-Mare's famous seafront.All our rooms have a king sized bed, are ensuite, all have sea views, tea and coffee facilities and TV and are decorated and furnished with modern detailing that compliments the character of this amazing property. Breakfast is included in your stay and includes various options alongside the traditional English cooked breakfast. A vegetarian breakfast is also available."}