{"user_rating": 4.0, "review_count": 36, "name": "Oakeley Arms Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Had a lovely holiday here, staying in the self-catering cottage. Fantasic house, my mum and children loved it (as did I). Huge kitchen, wanted to take it home! Lovely walks round about. The Ffestiniog Railway was great, both to ride on the train, and to hear its whistle as it went by. Ate in the hotel twice, nice tasty food, not posh, much more homely and pleasant. Owners and staff friendly and approachable.", "title": "Great!", "helpfulness": 2, "user": "LJJ77_", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122821510}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Had a great chill out at the weekend in North Wales.We stayed at the Oakeley and it was just what we needed , real people , real beer , great meals ( thanks Mair) and a beautiful area with great mountains to walk !", "title": "I want to go back !!", "helpfulness": 1, "user": "Toni G", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120901990}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "So refreshing from the pretence that we all live in nowadays.", "title": "Nice people, terrible food", "helpfulness": 1, "user": "cMcJ10", "date": "October 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0}, "id": 119130272}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "We will be back !!", "title": "Lovely place, poor food quality.", "helpfulness": 1, "user": "Aloverboard", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 117521648}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The service was nice but the food was not! Felt like we were eating cafeteria food at a summer camp that was not very good. I would not recommend this if you are visiting the area.", "title": "I liked it", "helpfulness": 1, "user": "Happy_IE", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 117117408}, {"rating": 5.0, "title": "A beautiful building with lots of charicter and fantastic service", "text": "I stayed here with a group of friends following a visit to Snowdon. The Oakeley Arms was recommended to us by a work mate who uses the hotel whenever he is in the area. Having spent the weekend climbing we wanted somewhere that was warm and welcoming and not expencive. We were given a warm welcome by the owner and shown to our rooms. Clenanliness was first class and the room and en-suite facilities were very comfortable. Colour TV and tea/coffee makings were supplied.", "user": "Earl68", "date": "June 9, 2011", "id": 112374132}, {"rating": 4.0, "title": "Decent enough hotel - reasonably priced", "text": "Having taken a well deserved shower we all met in the bar for dinner. There were a good selection of beers and real ales as well as wines and spirits. The food can only be discribed as FANTASTIC! with a good and varied menu. Try the curry, you won't be dissapointed. The staff were both professional and friendly, we even learnt a little Welsh. \"Diolch yn fawr iawn\"", "user": "jhcambridge", "date": "June 6, 2011", "id": 111709740}, {"rating": 5.0, "title": "Superb, friendly, comfortable and value for money", "text": "Following a good nights sleep we met in the dining room for a wonderful cooked breakfast that set us up for our journey home.", "user": "SuWhitlock", "date": "May 31, 2011", "id": 110723646}, {"rating": 5.0, "title": "A wonderful place and difficult to leave", "text": "Would I recomend this hotel to others? Yes, most definatly.", "user": "jamesandnikki", "date": "May 28, 2011", "id": 110218736}, {"rating": 1.0, "title": "Avoid!", "text": "If you are looking for a clean, friendly, good value hotel with fantastic food and plenty of free parking, you need look no further.", "user": "CardiffAvalon", "date": "April 13, 2011", "id": 103892171}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We tried dinner at the oakeley arms as the Brondanw Arms had no tables and were pleasantly surprised. We climbed Snowdon earlier in the day so my wife, children and I were pretty hungry and the portions served were more than enough, we had the steak pies and kid's meals. The service was also very good and the cost was quite reasonable also.", "title": "Dinner at the Oakeley Arms", "user": "Martin F", "date": "September 1, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 139043609}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed in one of the superbly located self-catering cottages for a week, and while it was generally nice, there were enough niggly and unpleasant aspects to it, which mean we won't be recommending it.", "title": "Cottage: Spacious and well-located, but please clean the damp off!", "helpfulness": 1, "user": "Nykohler", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132988377}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The cottage was a good size, with a lovely spacious, well-equipped kitchen/dining room, and comfortable living room. Don't forget your slippers though, as the ground floor is covered with beautiful slate tiles, but no rugs to keep your feet warm! The bedrooms were also good sizes, with very comfortable beds and clean bed linen.", "title": "After eating you leave still feeling hungry", "user": "Saurus1960", "date": "June 11, 2012", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 131738481}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Unfortunately, the moment we walked in the door, we were hit by the smell of damp. That's OK, but when nobody can be bothered to clean the black grouting in the bathroom, the damp muck round the windows, or the mould growing on the blinds in one of the bedrooms, it's particularly disappointing. There was also a strange smell emanating from the toilet - a drain problem? Also the white (mouldy) blinds in what would usually be a child's bedroom were so thin, as to be useless, and meant our usually super-sleeper 3yo had trouble dropping off every evening.", "title": "Big changes at the Oakely", "helpfulness": 1, "user": "lovetobeonholiday", "date": "May 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 129509597}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Also, beware if you're a family with small children: there is outdoor space, however as there are cars driving all around the property, you'll need to keep a very close eye even if your child wanders a couple of feet from the door.", "title": "Lovely place", "helpfulness": 1, "user": "Paul D", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123953296}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Had dinner and drinks with some friends while visiting the area, and met up with a mutual friend who lives nearby. Good service and quite a varied menu - much more than expected. Best part was the fairy cake that accompanied my hot chocolate!", "title": "Good pub food!", "helpfulness": 1, "user": "dmac72", "date": "May 13, 2013", "detail_rating": {"cleanliness": 4.0, "location": 3.0}, "id": 160617132}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the Oakeley Arms in one of the cottages for 3 nights and had a really enjoyable and relaxing time. This is our fourth stay at the Oakeley which must say a lot. The cottages are really cosy with character features and excellent facilities. We ate in the hotel and for the price, the meals are very good. The staff were friendly and polite and they always keep the fire going, making it a very cosy environment. I can particularly recommend the Sunday carvery after a morning walk in the surrounding forest which has some beautiful views, with two lakes and the steam railway only a short stroll away. We would highly recommend a stay at one of the Oakeley Arms cottages.", "title": "A great place to stay", "user": "emma p", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157851087}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Having had 2 very very ordinary accomodation experiences in the preceding 2 days with equally ordinary evening meals it was with great trepidation that we approached the Oakley Arms. Had run late and dark was fast approaching in the middle of Welsh nowhere when we happened upon the historic pub. Having been caught the previous day with accomodation we took up the staff members offer to look at the room. Up 3 flights of steps to the room was already a worry but when door was opened it was a really pleasant suprise. Large room, large really comfortable bed and actually had furniture( see previous days hotel review) TV, big bathroom with good shower and heated towel rack. Bed was just wonderful. Very quiet room despite being in a pub when Wales had just beaten Scotland. Loved the pub itself with its many comfortable sitting areas and we really enjoyed both our dinner and breakfast. Husband declared was best meal he'd had in UK. It was an utterly wonderful unexpected experience.", "title": "Surprising", "helpfulness": 2, "user": "old44", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155003758}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We dropped into the Oakeley for lunch over xmas. The staff seemed friendly enough but that's where the positives ended. The lunch was dreadful really. 'Welsh black' burger and chips was overpriced at £7.95 and was of very poor quality. The chips were the deep fried frozen variety, the peas badly overcooked and the burger a disgrace. Chewy and not discernible as beef. The token lettuce they'd put in the bun was well past its best and was actually brown in places!! Just not acceptable.", "title": "Food/drink only review - Very disappointing", "helpfulness": 1, "user": "Dylarolla", "date": "January 4, 2013", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 148809416}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I also ordered a pint of Oakeley Dokeley. It was just about drinkable (in terms of taste) but it looked awful. As murky a pint as I've ever seen. The barman said he would change it if I wanted, which is fair enough, but frankly he shouldn't have even let me see it. You just don't serve ale in that condition, period.", "title": "Accommodation needs some TLC", "user": "Paula W", "date": "September 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 139641962}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 3, "average": 3, "very good": 14, "terrible": 4, "excellent": 12}, "aka": "Oakeley Arms Hotel Blaenau Ffestiniog, Wales", "slim_ranking": 0.666666666667, "description": "Welcome to the Oakeley Arms, a beautiful Historic Welsh Inn set in the Snowdonia National Park.Situated in the pretty village of Maentwrog and surrounded by the lush green hills of the Vale of Ffestiniog in the heart of Snowdonia, the Oakeley Arms is the perfect base for a holiday in North Wales…"}