{"user_rating": 3.0, "review_count": 305, "name": "Oaks Hyde Park Plaza", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "I was very pleased to wind up my holiday in Australia in this hotel -- I got what appeared to be an excellent price using a hotel booking website, and was quite pleased with value for money -- a rather large room, with full kitchenette, refrigerator, very effective air conditioning, etc. Based on my recent experience, at the rate I paid (about AUS$130 a night), it's definately the best value for money in CBD.", "title": "Excellent location, good value", "helpfulness": 1, "user": "TravelxC", "date": "November 5, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6060055}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I arrived at 5pm, 3/10/06 and was greeted by the courteous-but-rushed receptionist, and after some 15 minutes waiting, a room was assigned to me, room 702.", "title": "Four and a half stars??? Yeah right!!!", "helpfulness": 9, "user": "wisend-traveller", "date": "October 30, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6028370, "likes": {"liked": "— nothing", "disliked": "— the fact that the whole place was in the middle of renovations, and it is not stated at time of booking."}}, {"rating": 4.0, "title": "High Standard, great location, best rates we could find - highly recommended", "text": "Upon entering my room, which was booked as a 4.5star studio apartment, I was confronted with a shame of a room. Yes, it was decorated with modern colours, relatively new furniture, and quite clean. But that was where it ended. The extractor fan in the bathroom was hanging by a thread. The TV didn't work - both a poor picture quality and the remote control did not work. Two cushions on the sofa were split and the stuffing hanging out. The bathroom smelled of stale water... the list went on.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5437506}, {"rating": 1.0, "title": "Disgusting dump", "text": "I called to speak to the manager, and was *rudely* told that he would call me back. 30 minutes passed, and I left my room and went back to reception where I was told the manager had just left for the day by the same person I had spoken to earlier. I listed my complaints to the recption staff. There were around 8 other people in the lobby, all of who were dealing with similar problems, and all of whom were similarly disgruntled. After a further 15 minutes wait, I was handed another room key, this time room 1402.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4992339}, {"rating": 4.0, "title": "great stay", "text": "I travelled up to my floor and whilst walking down the corridor, I was confronted with a strong smell of paint. When I reached my room, the door was propped open and inside was a construction worker busily painting the room! There was dust everywhere, paint tins, brushes etc etc. I called down to the reception to inform them of their mistake, and was told to hold on again while they tried to rectify the problem.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 27, 2006", "id": 4736111}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 56, "average": 76, "very good": 78, "terrible": 66, "excellent": 29}, "aka": "Oaks Hyde Park Plaza Hotel Sydney", "slim_ranking": 0.621621621622, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.5}, "description": "Oaks Hyde Park Plaza is located right in the heart of Sydney's CBD. Offering accommodation with views across Hyde Park to the city, this hotel is the perfect location for all travellers. The spacious 1 and 2 bedroom apartments, some with inter-connecting rooms, have separate lounge and dining areas and fully equipped kitchens. Studio suites have tea and coffee making facilities."}