{"user_rating": 3.5, "review_count": 168, "name": "Ocean Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Have just come back after a 2 week stay where we met up with our best friends who live in Perth, Australia.They had stayed here before and recommended this hotel and they were spot on. Upon arrival at the airport after horrendous flights from Emirates, the car was there from the hotel to pick us up. \"Oh great\" we thought, it's raining and we have just left snow behind in the UK! The journey was well over an hour to the hotel where we were met by polite reception staff who gave us flannels and a cold drink. We had booked the new contemporary room on the beach, these were located right on the beach, 6 in total with their own private pool. They were adults only - bonus! The room was fantastic, beautifully presented and the bathroom was a knock out. In addition there was an outside shower and sunken bath - really unusual. The room was spacious, clean and have everything you need: bath plus shower, wet room type shower, his and her sinks, hairdryer, small fridge, kettle, cutlery for 2 and a TV. What I will say is that the TV only had one English speaking channel and that was a news channel that was SO repetitive. I am someone who likes to watch a bit of TV before going to sleep and this was geared for French speakers not English. We were booked in bed and breakfast only so can only comment on the breakfast. This was fine, yes it was the same every day, but there was a good selection of hot and cold food and I loved having a yoghurt with freshly cut pineapple in it with a couple of pancakes to follow. Everyone else had full cooked variety and none of us had any complaints over breakfast. I know it has already been mentioned by others about ants and insects and birds but you have to remember where you are, these things are inevitable.", "title": "Fantastic stay with our best friends", "helpfulness": 2, "user": "tokar", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157082500}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had the best 2 weeks, we found some lovely restaurants, went to some lovely places and had really good fun. I have read about taxis being expensive but we never found that, we would get the local bus to Sunset Boulevard and get a taxi back at night at a cost of 200 rupees (approx. £5). The local bus was an experience in itself and we also got the express bus to Port Louis which was hilarious. We went on 2 fishing charters and my Husband's dream came true when he and his best friend caught a 300 lb black marlin. We also went to Casela where we had the interaction with the lions which was excellent and well worth a visit. We also spent the day at the opening day of the horse racing season and again had really good fun. My favourite place was a public beach, I think it was called Mon Choicy but we called it Choosy beach - the most beautiful beach which served fantastic food. We went on the glass bottomed boat there and went snorkelling which was good and had fun bartering with the sellers on the beach. Our favourite restaurant and would definitely recommend the Happy Rahja Indian restaurant located by the Super U supermarket. Easily the best Indian food we have ever had and at a decent price.", "title": "Great location by the Beach", "helpfulness": 1, "user": "Kenneth_Pedersen", "date": "March 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156047978}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We hired a car and had the most hysterically funny time getting lost and getting a flat tyre in a location that we really shouldn't have been in - the police kindly came to our aid and gave us an escort to the station to change the tyre and then took us to the road we were supposed to be on!", "title": "Nice Family Run Hotel", "user": "Menippe", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152999249}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "There are not many negatives about the hotel, namely the lack of TV channels for us Brits and the wet room set up needs attention as the drainage is poor, the slope to this was not enough as the bathroom kept flooding every time we used it. The water went from freezing cold to scalding hot and there were a number of times we had no water at all. I think the hotel shut the water off and we had to keep phoning them to say we had no water - that was the biggest negative that needs addressing. The view from our bedroom was magnificent and we spent every evening on the patio with our friends chatting and laughing about our adventures. The weather was fantastic apart from one rainy day but it did not ruin our stay at all.", "title": "Amazing sea front rooms", "user": "A_Brit_abroad294217", "date": "February 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151356781}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I would recommend this hotel to anyone, personally I would not return only because the flights were so bad I swore I would NEVER fly long distance economy class again as they were just dreadful, that is the only reason for my non return. If I could afford to upgrade our flights I would go back tomorrow as it is paradise.", "title": "Very good hotel once you get used to it", "user": "Mike C", "date": "January 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 149950799}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled with family", "text": "My first trip out of the total 3 trips to mauritius, was at Ocean Villas, i was very impressed with the staff and especially the place itself. It was clean, serene and very exotic holiday like. This review comes 3 years after my trip, as iv never been one to write reviews.", "title": "Great Place!!", "user": "bellefille24", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 19745029, "likes": {"liked": "— EVERYTHING", "disliked": "— too little mention"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We had a slight problem after a week, where the new guests who moved in next door, very loud, and noisy. And also realised they had managed to break a sliding door, and a piece of furniture. We complained and were immidietly moved to another Bangalow.", "title": "What a joke", "helpfulness": 2, "user": "Czecehneck", "date": "July 2, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 17452700, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Our stay was meant to be for 3 weeks - prepaid, but due to circumstances we only stayed 2 weeks before returning back home - with very fond memories, of snorkelling trips, trying to learn how to water-ski with very patient instructers, the Pina Coladas at the bar, and learnign how to Sega dance.", "title": "Simply liked it", "user": "christinaa", "date": "June 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17283723, "likes": {"liked": "— the room is away from main compound", "disliked": "— i don't know"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I have to agree with one of the review writers that the chinese man in the shop was quite rude-ish. As i bought a phone Sim card, and couldnt make calls from it, etc. But i know this doesnt have anything directly to do with the hotel, so i will spare you the details. Just avoid him.", "title": "UPS & DOWNS..MORE DOWNS THAN UPS", "helpfulness": 2, "user": "Mi_1980", "date": "May 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16500148, "likes": {"liked": "— the decor and the size of the suite", "disliked": "— the owner"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This place is top class, and based on that i am returning to its sister hotel (is that what its called??) called Ocean Beauty in December 2008. A little more luxurious and pricey, but hoping its going to be another great experience.", "title": "Buyer beware!!!!!!", "helpfulness": 1, "user": "giligirl", "date": "May 2, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 5.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 15575279}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Very good hotel, located in Grand Baie on the sea. Rooms are situated in different pavilions and bungalows. Meals very varied and tasty, especially on a wide selection of breakfast breads and omelettes. In the room, which was on the floor of a well-functioning air conditioning, television with satellite channels and dozens of good quality connection to wifi. Very colorful rooms have refrigerators and spacious and the bathrooms are spacious, clean and well furnished. Beach at the hotel is quite weak and close to the port, so you might want to go to other places. Supports very nice and helpful. During the accommodation offered us a cold drink. When the hotel is a bus stop, where you can go to the capital of Mauritius and other places.", "title": "Very good hotel", "helpfulness": 2, "user": "poltramp", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122390371}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "First of all: our booking was to a \"hotel\" called \"Ocean beach hotel & spa\" - soon we realized that there was a reason why we did not find that hotel from trip advisor... Our room was at the Ocean Villas and even though we booked a little more expensive \"contemporary garden view room\" it had a more than just a view to the garden - it was at the garden and at the ground floor. Ocean beach hotel & spa is not a hotel it is Ocean Villas's guest houses at the beach. -> Note to self: never go to a hotel you can't find at the trip advisor!!!", "title": "An Animal Farm", "helpfulness": 5, "user": "FillyFragile", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 122346460}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Airport transfer ordered and bought from the hotel was terrible as well as expensive: An old pickup car with no airconditioning and very little leg room (after almost 24h of travelling the 1,5h at the noisy car felt like an eternity). Although the first look at the reception and room was promising: flowers by the bed and modern renovated bathroom with both shower and a bath.", "title": "Pay more if you want to be ok", "helpfulness": 5, "user": "MarisolEscalante", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121026973}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "So why the title animal farm? After we woke up from our first nap - we were not alone. There were geckos in our room. I understand that they live in a tropical climat, but still: I don't want to them in my room. Then there were lots of ants, they seemed to have a highway road through our room - into my bed. I found a dozen of ants in my bed. Again, I understand a few ants here and there at a room situated in a tropical garden, but not a dozen in my bed, thank you.", "title": "Just loved our stay at the Ocean Villas at Grand Bay", "helpfulness": 2, "user": "travellotsallover", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119088655}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The last drop came at the private beach. As we were trying to relax and get our thoughts off the animals in our room, we were surrounded by stray dogs. They didn't seem aggressive, but they came very near all the time (btw also at the restaurant and at the bar..). There were warning signs not to touch them 'cause they can be dangerous. So it was a bit hard to close your eyes to sunbath when you had to worry of the dogs coming to make friends with you...", "title": "Excellent accommodation with a private beach", "helpfulness": 2, "user": "travel-fantastic", "date": "September 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118643701}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Ocean Villas, Grand Bay, truly great value.Benny van den Burg. U.K.", "title": "Loved the Ocean Villas in Grand Bay!", "helpfulness": 2, "user": "bennyvdb", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14619083, "likes": {"liked": "— Everything", "disliked": "— Cannot fault it. Hotel shop owner couldn't care less, money in the cash register and no eye content!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Very surprised! It was well thought out the staff where more than efficient, the meals good and all buffet, very large buffet for breakfast and all fresh fruit and food,", "title": "Goods & Bads, but a good value for price", "user": "Afour", "date": "March 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 14068073, "likes": {"liked": "— Flowers on arrival, quite spacious", "disliked": "— Noise (roof, works, etc...), Lizzards and other cockroaches..."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The villas were much bigger and nicer than we ever expected, as we made the trip from South Africa.", "title": "Damp spirits but a great holiday", "helpfulness": 6, "user": "Oots", "date": "January 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 12577234, "likes": {"liked": "— The pool and bar area", "disliked": "— Damp and cockroaches"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Talk about spacious it would sleep 8 people easily and we were only two. Large and well furnished lounge and 2 stories high with separate bedrooms and bathrooms on each floor, very clean, by housemaids everyday.", "title": "BE CAREFUL! A dump in more ways than one.", "helpfulness": 4, "user": "calimnet", "date": "December 23, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 11904322, "likes": {"liked": "— Beach", "disliked": "— Lack of cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Excellent value, except the travel agent charged us for a 5 day stay, arriving at 10p.m. on the first day and leaving at 4 a.m. on the last!", "title": "Very good value", "helpfulness": 5, "user": "LeiB", "date": "November 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10956042, "likes": {"liked": "— overall value for money, and stunning honeymoon suite", "disliked": "— breakfasts"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Not everyone was bad. But this Indian lady who was on a 7pm shift on a sat (today) couldn't hold her eyeballs and bad manners rolling!! Just because of a trival matter on asking her help to call locally to make dinner reservations was returned by her attitude of oh-you-have-no-money-to-use-room phone-that's-your-business.", "title": "Horrendous receptionist!!!", "helpfulness": 3, "user": "Sasabebe", "date": "December 29, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 148300233}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Oh and did I mentioned she, along with hotel guest, were sneering behind my back right after I head towards my room? That is one kind of classic service!!!", "title": "Nice Hotel but poor management", "user": "Maya M", "date": "December 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147712396}, {"rating": 3.0, "title": "No open sea view", "text": "Beware of what room you are getting. If its one of those rooms just upstairs the reception, don't take. It's very very noisy !! You can hear downstairs, walking of stairs, next door, roof top squeaking!! (Which apparently I can't figure what is that noise) And the staff just tell me nahh there's nothing on top!!", "user": "sister-karamazov", "date": "November 13, 2012", "id": 145289407}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "The location ?? You have to travel everywhere by taxi!! There is no convienent store (the one in the hotel close at 6pm and throughout weekends), the centre is 1hr walk away, there's only 3 restaurants nearby. That's it. And mind you, taxi here in mauritius is SUPER expensive.", "title": "Excellent location with nice private beach", "user": "doctorhasanali", "date": "October 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 142859303}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The Only hype is, a very well known nightclub is just 3mins walk away. Name is Enfants Terribles. Try that out lateee weekend nights. (1am onwards)", "title": "Beautiful Hotel but Poor Management", "helpfulness": 1, "user": "Katrien P", "date": "October 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141978167}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at Ocean Villas for six nights and were relatively satisfied with the place. It's not the most luxurious of resorts and it does seem a little fancier than real on their website, but it was also very cheap, i.e. good value for the money we payed (55 €/night).", "title": "Not the best, not the worst", "helpfulness": 1, "user": "Losviages", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 34746465}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The front desk staff were friendly and helpful; I suppose it could be a different story during high season, but we arrived to the hotel real early in the morning and nearly immediately were given a room, so that was a pleasant surprise. The private beach was convenient, but it was one of the reasons we chose this hotel in the first place.", "title": "Excellent villas, good food and total VFM", "helpfulness": 1, "user": "finalmoksha", "date": "July 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 34599648, "likes": {"liked": "— Great value for money", "disliked": "— No room service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Our bungalow had been recently refurbished (except the kitchen) and especially the bathrooms were beautyful. We found the housekeeping personnel very professional and our bedroom, bathroom, livingroom and kitchen were properly cleaned every day. I'm identifying all the rooms separately because there were also two empty bedrooms in our bungalow (it could have housed six people altogether). Obviously, they weren't maintained during our stay (although there were sheets in the beds), but still, as I checked out one of the rooms just out of curiosity, I noticed it had large windows that were so old they wouldn't shut properly and hence a lot of insects had flown in and died on the floor in front. I tried shutting the windows but couldn't manage and had to leave them open. It didn't really bother our stay, but had we ended up staying in that room, we would have been extremely dissapointed. So, the bungalows do still need further renovation.", "title": "Nice room - not ideal if you need to wear your 'glad rags'!", "helpfulness": 1, "user": "Journ3y", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 28782036}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Overall I can recommend the hotel, but with some resevation. It is a three star resort, nothing more.", "title": "A fantastic holiday for adults and children", "helpfulness": 1, "user": "DestinationUnknown45", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 28013756}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Hi All,", "title": "Good Value for Money.", "helpfulness": 1, "user": "cmtreloar", "date": "February 15, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 24574476, "likes": {"liked": "— The value for money and the service.", "disliked": "— The distance from Grand Bae."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I stayed in this hotel for 2 nights with my boyfriend. We booked the basic room above reception and I have to say it was perfect.we were greeted as we arrived with iced tea and cold towels to cool down, we were then given a personal guided tour of the complex and down to the beach before being brought to our room. We didn't expect much from the room as we booked the basic room above recption and were getting it so cheap, but it was perfect we even had a small balcony and the maids made the room special with rose petals and towels made into figures;) the small private beach was gorgeous and offers free water sports 2 days a week. Unfortunately we were not here these days. The sun loungers were lovely quality and offered round bed loungers. The pool was gorgeous . Nice to cool down in. And when we were there we were the only ones at the pool, cocktails at the bar were lovely and staff really helpful. Breakfast in the mornings was lovely and plentiful, and chef makes up fresh crepes and omelettes in front of you. There is a bus stop outside the hotel that will bring you down to grande bay . Bus comes every 15 mins to 30 mins and costs very little. Taxis are plentiful in grande bay late at night if you wish to go out. However we were worried as the reception staff said that you have to book them and they don't operate late at night, however they are very plentiful outside the bars as they close if you wish to have a night out. I cannot fault this hotel. We really enjoyed our stay and will definitely go back next time we visit.", "title": "Lovely stay", "user": "Dublin_IrelandLily", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140852409}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We stayed here for 4 nights. We had a wonderful experience with Ocean villas right from the time we stepped of airport and the time we left for our return flight. Driver was waiting at the airport for us and upon arrival we were warmly welcomed at the reception with lemon tea. The reception area was tastefully decorated and appeared fresh and appealing.", "title": "Nice hotel with a private beach", "helpfulness": 1, "user": "arif_kool2001", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130109708}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The staff at reception were all nice and cheerful, would like to mention especially Kiran, who was the most helpful of the lot. The room was nice and cosy and we also had a small room for our kids. Breakfast was filling and nice, we had opted for dinner too, which was equally good, with live music soothing our body and soul.", "title": "Good but uneven experience", "helpfulness": 4, "user": "WP664", "date": "February 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 125008785}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel has a nice and small private beach where you can relax and laze around. They also have free water sport activities but you need to register at the reception as certain days are assigned for specific activities.", "title": "Good rest", "helpfulness": 6, "user": "P1o", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123695986}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I would surely recommend this hotel to fellow travellers", "title": "Ocean Villas even better now", "helpfulness": 4, "user": "vml45", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123426950}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "I went to Mauritius with one of my friend for 2 weeks at the beginning of June 2007.", "title": "Very good quality hotel", "helpfulness": 5, "user": "PierrotL", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8749631}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My friend knew the island since he already lived there, as for me, it was totally knew. We decided to book a 7-days stay at Ocean Villas, first, because of the location, second, because contacts we had were great (needless to say we were expecting a nice hotel and location, but not fancy as a 5 star hotel).", "title": "More than expected", "helpfulness": 4, "user": "happyholsKualaLumpur", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8395096, "likes": {"liked": "— Comfy and relaxing", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The residence was beyong our expectations.", "title": "Cozy hotel,excellent staff", "helpfulness": 2, "user": "NatBratislava", "date": "May 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7634479, "likes": {"liked": "— The beautiful garden,private beach,poll area and delicious brekfast", "disliked": "— Our room was a bit noisy due to the traffic"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "We went there during winter time, therefore, prices are way cheaper and the hotel had a 40% occupancy rate (i guess not more). Therefore, the staff was all ours! They all are very nice (you are offered a welcome drink (ok, very simple) and they call you by your name the day of your arrival)! The doorman was extremely kind and always smilling!", "title": "It looks good on the internet", "user": "Carriecot", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 7190371, "likes": {"liked": "— Food", "disliked": "— Plumbing problems/cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The accomodation in itself (we stayed in a 4 bedrooms appartement, for 2 people!) is more than acceptable. The 3 bathrooms had been renovated (very modern), so as the living room, brand new. We had a lovely terrasse as well.", "title": "Family Villa", "helpfulness": 1, "user": "simha08", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5884504, "likes": {"liked": "— kitchen and space", "disliked": "— cleanliness and quality of furniture, same breakfast for 7 days !!!!"}}], "location": {"continent": "Africa"}, "stars": 3, "variance": {"poor": 23, "average": 32, "very good": 62, "terrible": 19, "excellent": 32}, "aka": "Ocean Villas Hotel", "slim_ranking": 0.545454545455}