{"user_rating": 3.0, "review_count": 377, "name": "Ocean Dunes Resort & Villas", "reviews": [{"rating": 1.0, "title": "Remorseful at Dunes, Myrtle Beach", "text": "Booking Ocean Dunes hotel in Myrtle Beach for six friends was embarrasing.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3705195}, {"rating": 1.0, "title": "Don't do it!!", "text": "12 hours of driving to 3 dirty rooms-No attempt to place us together after booking 3 months prior. - No parking spaces available-Information at front desk uneventful - Ocean Views were of dumpsters not ocean. Lacked beach towels, chairs, umbrellas. Hall, wall, were dirtywith rust and cob webs and torn carpeting.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3658307}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Priced paid for this *** NOT! $180 per night", "title": "Great for the price", "helpfulness": 2, "user": "Diva3", "date": "June 13, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3548849}, {"rating": 1.0, "title": "Avoid unless all others fall into the Atlantic", "text": "Loved Myrtle Beach-and attractions - Stampede, Carolina Opry, Legends,", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3547297}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "Planet Hollywood. Ramandos Italian restaurant great. Beaches great.", "title": "If you have a choice, choose another hotel!", "helpfulness": 4, "user": "AmyBPChef", "date": "April 26, 2005", "detail_rating": {"cleanliness": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3416487}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "This was as bad if not worse than every bad review that I have read. It was worn out, stinky, SPENT! We spent seven days prior at the Compass Cove at the other end of the beach and LOVED it. We went to the Ocean Dunes for the waterpark to let the kids play for two additional days. It was bad weather while we were at the Compass Cove but there were so many heated pools and lazy rivers that we still had a great time. Then we thought the kids would like to spend time at the Ocean Dunes waterpark. It looked great from the road. Guess what? The waterpark is only open on the weekends in April, and it is still unheated and basically unusable. All of the outdoor pools are unheated and dirty. No one could use them. They were all freezing. When you check in there are signs with arrows to the ice cream parlor, poolside bar... All closed in April. But they leave the signs up like they are open. Think you could be in the room and just enjoy the ocean view? Not unless you want to be in a flithy, worn out, dirty, stained linens on the bed and no linens in the bathroom, (towels) room. I mean DIRTY! Sand in the sheets. Stained comforters. Blood streaks on the sheets. No washclothes for a day. The celings are low with patches all over them and cobwebs. Anything with metal on it was rusted. Phones didn't work. The floors...I wore socks at all times. The playset by the beach was the only thing to do, next to the beach which the Ocean Dunes could not take credit for, and it swayed a good twelve inches in any direction. I am NOT a fussy person. We really liked the Compass Cove the seven days prior. We stayed in room 7413 in case management wants to condemn it. I was told by the front desk that the building next door was only a few years old, but it is not ocean front.", "title": "Soooo bad!", "helpfulness": 5, "user": "alltogether", "date": "April 19, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 3389783}, {"rating": 2.0, "stay_parameters": "Stayed November 2004, traveled on business", "text": "We stayed at this hotel as part of a convention we were attending at the resort. The ocean view from our balcony was beautiful and the waterpark looked like it would be great fun in warm weather. Although I felt that the $78 rate was a bit steep for Myrtle Beach in the wintertime. The room we were given was very worn out, the carpet was torn and coming up so badly that we tripped over it several times. My toddler tripped and ripped her pants on the exposed staples underneath. The room was very musty as if no one had been inside of it since the end of the summer season. We had the breakfast buffet in one of the restaurants and it was average, nothing exceptional. We ended up only staying here for one night and then found a room directly across the street for $30 per night for the last 2 nights after the ripped pants episode.", "title": "Rooms in need of updating.", "helpfulness": 14, "user": "dotdog", "date": "November 22, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 2839360}, {"rating": 5.0, "title": "great place to stay", "text": "We stayed in the 2 bedroom villa. The air conditioners kept the room cool day and night. housekeeping made sure the you had plenty of towels and the room was cleaned as if we were arriving that day. We had a great ocean view and were about 100yrs. from the ocean. This was our first trip to myrtle beach and the ocean dunes but not our last", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 22, 2004", "id": 2481949}, {"rating": 1.0, "title": "Hated ot: Just plain dirty and nasty!", "text": "My family and I stayed in Tower I over the Labor Day weekend 2003. When we first checked in everything looked and seemed okay, there were a lot of people checking in. Everything was ok until we got to Tower I, the very first things that hit us right smack in the face was the heat and smell. The lobby was not clean and it was steaming with heat. The lobby bathroom's were smelling, the two elevators were extremely slow and the floor was wet with water everywhere. My room was okay, but not clean-clean. Some family members had to go to the store to get bleach and pine sol and scrub their room down to get rid of the room odors. Other family members changed hotels completely, staying only one night. Ocean Dunes was not a good experience for my family. I do not believe that my family will ever stay there again, at least not in the near future.", "helpfulness": 2, "user": "DeeSavGA", "date": "February 11, 2004", "id": 1645924}, {"rating": 5.0, "title": "amazing", "text": "Ours is a different sort of review. My daughter was diagnosed with ovarian cancer at age 17. She went thru the surgery and chemo like a trooper. One of her wishes was to see the sunset from the beach. Mr.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 20, 2003", "id": 1102383}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "My family and I stayed at Ocean Dunes for 5 days and 4 nights. The hotel wasn't exactly the best I've ever stayed at but we made the best of it. The staff was 50/50 with some very friendly and some almost down right rude. The water park was very nice and my 1 and half year old son loved the little kiddie pool. I loved the poolside bar. Bartender was very friendly and fast. Area attractions were great and Ocean Dunes offers a dinner package you can buy at the front desk that you can use at some very nice restaurants in area. Hotel breakfast buffet left much to be desired. The rooms were clean but most definitely in need of some updating. I had a good time in Myrtle Beach and hopefully one day my family will return but honestly I think I will try another hotel.", "title": "Definitely dated but we had a good time.", "helpfulness": 9, "user": "MaddVibes", "date": "January 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4327590}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "The Desk staff was great. The Ocean Dunes Condo's were awful.", "title": "Terrible Experience", "helpfulness": 3, "user": "Sallie54", "date": "September 13, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 3899801}, {"rating": 2.0, "title": "Spacious room, but not real clean", "text": "I don't know who owned 5612, but they need to do some upgrades.", "helpfulness": 2, "user": "Zipper775", "date": "September 11, 2005", "id": 3894203}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "My Finance' is a Diabetic and the little refrigrater was not working properly.", "title": "Okay place for sleeping", "helpfulness": 5, "user": "ca_yee", "date": "September 7, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3880554}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "We had no clue we wouldn't even have paper cups. I was disappointed.", "title": "Good time in spite of worn conditions", "helpfulness": 3, "user": "touristtogo", "date": "August 1, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3727088}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 52, "average": 59, "very good": 66, "terrible": 120, "excellent": 80}, "aka": "Ocean Dunes Resort & Villas Hotel Myrtle Beach", "slim_ranking": 0.617117117117}