{"user_rating": 3.5, "review_count": 233, "name": "Oceanfront Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I agree with most of the recent reviews. The location and views are great. The property needs more help. The current owners seem to be trying but they've got a ways to go. We had to be moved from our first room as the toilet seat was broken and the bathroom sink didn't drain. Furnishings are tired and a bit on the disjointed side. The front desk staff are uninspired and going through the motions. Breakfast was OK but not special. The pool and spa were OK. For what you pay you would expect a bit more. So, should you choose to stay here enjoy the view and try and overlook the other short comings.", "title": "Almost (As Others Have Said)", "helpfulness": 1, "user": "highdesertbadger", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 180114671}, {"rating": 3.0, "stay_parameters": "Stayed October 2013", "text": "Stopped when traveling the Oregon Coast ! Great views ! Rooms small and basic ! Had laundry and pool ! Very expensive for what we had ! Breakfast included ! Weather made up for it would prob not come back to this hotel x", "title": "Great view !", "helpfulness": 1, "user": "bellamac7", "date": "October 4, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 179754963}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I could write an essay on this hotel. There are definitely a lot of pluses,", "title": "Could be 4* with some help!", "helpfulness": 1, "user": "Venusalberta33", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 179652551}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Staff were young, friendly and helpful. Location is probably the best in CC. If you get the middle ore west sections, you would see Battery point LH. The far east faces parking lot but still good views of sunset. Rooms are clean and very adequate. Bath and towels nice. Spacious dining area and better breakfast than most others along the coast.", "title": "Location..Location...Location..!", "user": "Vincent M", "date": "September 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179005958}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "However there are so many ways this hotel needs improvement. Girls at desk and dining room wearing jeans is inappropriate. The front lobby and dining room lack any character or warmth. Tables and chairs are mismatched and windows are not clean. Pretty hard to keep windows clean when you are this close to the ocean so maybe some window treatments. Fireplace area was used for storage! If they could get a hotel decorator to put some warmth or coastal character into this place, it could be 4* .", "title": "Expected better", "user": "Patricia F", "date": "September 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 177835685}], "location": {"country": "United States", "city": "Crescent City"}, "variance": {"poor": 21, "average": 46, "very good": 63, "terrible": 23, "excellent": 80}, "aka": "Oceanfront Hotel", "slim_ranking": 0.315789473684, "description": "Oceanfront Lodge, positioned only 30 feet from the edge of the rugged Northern California coast, is the premier hotel in Crescent City, CA. During your stay, enjoy sweeping ocean vistas and a spectacular view of the famous Battery Point Lighthouse from one of our modern comfortable guestrooms. Our gracious hotel is also located in the heart of scenic Redwood country-truly an outdoor lover's paradise where hiking, fishing, bird-watching, and whale-watching opportunities are plentiful. Our inviting rooms are designed for comfort and relaxation."}