{"user_rating": 4.5, "review_count": 186, "name": "Ocean Park Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Ocean park motel lays a bit from SF but the munirail goes direct to centrum. Compare too other hotels in SF its great value for the money. We travelled with 3 children and room was big and plenty of space. Its overall a great pleasuere too stay here, the only thing too say something about is that its not mutch of restaurangs and supermarkets in the neighborhood so you will be needing a car to get around.", "title": "Great value", "helpfulness": 2, "user": "Eriksen1", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 33230659}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Our son was graduating from SFSU and we chose the Ocean Park as it is about 3 miles to his place and less than that to campus. Lovely grounds and cozy rooms made this a great choice for our SF visit. The muni to downtown goes right by, so you can hop on and be downtown in about 20 minutes. Not luxury accomodations by any means, but clean and a throwback to the old days of lodging. Try it if you have no desire to be in the tourist areas of SF.", "title": "Loved this motel!", "user": "FLWfan", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31517775}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Previous review are abs right.", "title": "Good Choice", "user": "mightymousemighty", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 30508567}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "A pleasant hotel, with good amenities considering age. I longed for a wireless connection but there is a local internet cafe. It amused me that the motel take great care to warn you that this is a old art-deco motel and therefore dont expect huge rooms with loads of storage and bathroom", "title": "An attractive, well-run motel in a suburban location with good light rail access to the city.", "helpfulness": 1, "user": "BrettJR", "date": "May 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 30029971}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Good transportation to central SF. My room was noisy due to tram so previous reviews are on the money. Ask for a quieter room on check-in. Good diner 2 blocks away (Bulldog Diner). Handy if you have a car due to easy parking on street, easy acess to airport and highways avoiding the congestion of central SF.", "title": "Charm, service and a slice of nostalgia in one brief stay", "helpfulness": 2, "user": "coffeemonster", "date": "May 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 29687038}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I have been traveling the world for over 30 years. I've stayed in hundreds of hotels and motels, from scary tumble-down wrecks to five-diamond establishments in dozens of countries on four continents. I have never enjoyed a stay anywhere more than the Ocean Park Motel in San Francisco.", "title": "I'm in Love with the Ocean Park Motel", "helpfulness": 3, "user": "The_Old_Wolf", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 20606965, "likes": {"liked": "— The home-like atmosphere & proximity to beach", "disliked": "— Lack of shopping/dining within walking distance"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "A 1930's Art-Deco construction, this motel has been lovingly refurbished and updated by the couple who runs it. It is clearly a labor of love. My room in the inner courtyard, which is immaculately groomed, was obviously old construction, but spotlessly clean with everything in working order. The TV was a modern LCD flat-screen with functional remote and a more than adequate selection of cable channels. The bed was one of the most comfortable I have ever slept in, including my own - and that's saying a lot.", "title": "Very clean and friendly place to stay. Not to mention really affordable $", "helpfulness": 1, "user": "ShiaNY", "date": "September 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 20372222, "likes": {"liked": "— Quiet and friendly environment", "disliked": "— Difficult to find enough detail about the Motel online as well as the ability to book online."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The price was so reasonable - especially for San Francisco - that I thought I might have been undercharged.", "title": "Super Place", "helpfulness": 4, "user": "The_Royal_Society", "date": "September 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 20185826, "likes": {"liked": "— Cleanliness, Safety, Service", "disliked": "— N?A"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Location pros are a two-minute walk to the beach, a streetcar stop just outside the front door, and the San Francisco Zoo just across the street. Cons are a lack of other things to do or places to eat within walking distance - and a streetcar stop just outside the front door (the trolley noise might bother some people, but I didn't even notice it. The hotel thoughtfully provides wax earplugs on your night stand should this be a problem for you.)", "title": "Clean and comfortable with character!", "helpfulness": 1, "user": "DJMadruga", "date": "August 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19399270, "likes": {"liked": "— the location, the history", "disliked": "— the stairs when we arrived with lots of luggage"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I plan on staying here again, and again, and again. I would recommend it to anyone who has a taste for something with much more charm and character than the run-of-the-mill paper-maché motel, and who doesn't mind staying in a place that evokes memories of an era tragically long-gone. Brass and glass you won't find, but in exchange you shall have an abundance of warmth and a personal touch that makes it seem much more like a home than a hotel.", "title": "Ok but not great", "helpfulness": 3, "user": "David S", "date": "August 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 18846798, "likes": {"liked": "— cool garden, free wifi", "disliked": "— the shower / bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This is a charming, affordable, comfortable and friendly place to lodge. It's a quiet place only a few blocks from the zoo and Ocean Beach in a real SF neighborhood. We took the \"L\" streetcar to and from downtown which was easier than driving. The owners are wonderful people who made us feel very much at home.", "title": "It's now our favorite place to stay.", "helpfulness": 3, "user": "sierracousin", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26745981}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "The owners could not be more accommodating and the service is so friendly. I needed wireless connection and I was not disapointed . The rooms are very clean and the beds are fantastic. I felt so comfortable and secure in this place away from home. It is a real \"find\" with easy access to SF. In the morning you can stroll over to the coffee shop around the corner and enjoy breakfast.", "title": "This place is a gem , right next to the Beach", "helpfulness": 2, "user": "VEH63", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26008741}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Loved the old fashioned feel here- certainly not one of those modern hotels- Where else do you still get a \"real\" door key??", "title": "Loved the ambience! Wonderful Management!", "helpfulness": 2, "user": "PandaNicholas", "date": "February 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24082192, "likes": {"liked": "— Management; old fashioned feel; great parking", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "The manager/owner was very helpful and nice- waited up for me to show up late- extremely helpful- very cozy and safe feeling. We live only an hour a way, but hope to be back for a weekend getaway sometime- very convenient for getting to downtown etc.", "title": "Fair price and Clean", "helpfulness": 2, "user": "jayaamazing", "date": "October 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21221181}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "Great Value!", "title": "Why would you EVER want to stay downtown again!?!?!", "helpfulness": 7, "user": "DoeHEAD", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20981286, "likes": {"liked": "— The hideaway, out-of-the-maelstrom feel of it", "disliked": "— The lack of a writing desk in my room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We just stayed one night at the ocean park before flying back but we really liked it. The guy at the reception was super friendly and provided us with lots of useful information ( map, history of the motel and recommendations for restaurants etc ).", "title": "loved the ocean park motel", "user": "travelmonk", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8681201, "likes": {"liked": "— styl"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The Art Deco style of the motel is great, the courtyard fantastic. The room was nicely decorated and very clean.", "title": "Out of the ordinary", "helpfulness": 2, "user": "beekeeper5", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 8592232, "likes": {"liked": "— Location", "disliked": "— Not enough towels"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I like to stay in quirky little places like this. Being the first motel in San Francisco, you can't expect the polish of a franchise hotel, or the super smooth edges of the super expensive places. I like the history. Art Deco/Art Nouveau of this place is really charming. The rooms are a little small and awkward. But the beds were super comfortable! I don't sleep that well on my own bed (mostly because the cat walks on my face). It was very clean inside and out. Please do not include the sidewalks outside the establishment. That is city/county responsibility. The muni on rails can be heard on the street from some rooms, which I thought was romantic. It woke me up but it didn't piss me off. And the neighbor garden with all the gnomes! You can only see this from certain rooms, but boy, what a trip! And come on, they have a hot tub. You can walk to the beach and the zoo. I found the proprietors very kind and polite. I recommend it and would stay here again.", "title": "Quirky and Charming", "helpfulness": 1, "user": "prizazz", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10801741, "likes": {"liked": "— Ambiance", "disliked": "— coffee"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My two small children and I stayed at the Ocean Park Motel in August of this year. What a fun experience! We had a two room unit with a kitchen - and while it was small, it was charming and just fine. There were two queen beds, a tiny 1920s bathroom and a tiny 1920's kitchen (w/apt. range and 3/4 size refrigerator) that was perfect. My children loved that I could sit at the end of the tiny table and reach EVERYTHING in the kitchen while sitting down!", "title": "Wonderful Fun - Especially for Families", "helpfulness": 3, "user": "BaliThai", "date": "October 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 10360623, "likes": {"liked": "— Charm; location; value; kitchen", "disliked": "— Small rooms (except the kitchen which was fun!)"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I am sorry to read that a few people had bad experiences here - the comment about a lack of an elevator had me laughing however. Any homework on this hotel would have told you that! :-) Most of the rooms were on the ground floor - and the buildings are actually on a \"campus\" of sorts - some surround a courtyard and are in single story buildings - and some branch off on the same property around the on-site parking and garden area and are two-level buildings.", "title": "A charming place! Exceeds expectations", "helpfulness": 2, "user": "TheresaMc", "date": "September 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 10022632, "likes": {"liked": "— peace and quiet", "disliked": "— size of room"}}, {"rating": 1.0, "title": "What a dump!!", "text": "Our unit faced the courtyard which was nice and quiet, and we got a nice breeze when we opened up the kitchen window and the front door. There are even covered parking places (first come first get), although they are old fashioned small carports. If you have a big car, it will be a tight squeeze!", "helpfulness": 2, "user": "luv2travel108", "date": "September 25, 2007", "id": 10002614}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "They do have a little garden area with a \"playground\" that is really a simple wood play structure with a swing and slide. And it was just fine for two little kids who occasionally wanted to burn off some energy when I just wanted to sit down.", "title": "Great Experience", "helpfulness": 1, "user": "andymarino2000", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8878080, "likes": {"liked": "— Friendly staff, near beach, clean.", "disliked": "— Is out of way from main sites."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "There were four of us in a two bedroom suite. We had two teens (ages 17), my husband and myself. The boys room had two queen beds and our room had one queen bed. The location was perfect as the bus stop was steps away as well as the trolley line. The boys took advantage of the location was once they learned how to use the trolley they were gone exploring all of the time. One day they even visited the zoo (which again is steps away). They give you tons of information when you check in - I would recommend the Bashful Bull for breakfast and it's only a short trolley ride away (about 10 blocks or so).", "title": "Loved it! Excellent location!", "helpfulness": 6, "user": "BlasianGrl", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18096715, "likes": {"liked": "— The Art Deco design of the motel AND the location!"}}, {"rating": 5.0, "title": "Enjoyed the Ocean Park Motel", "text": "The rooms were clean and the beds comfortable. It's so close to the ocean (now that we were not impressed with - the beach was not what we're used to seeing) and transportation stops right outside your door! We were away from the heart of the city but close enough! We wouldn't consider staying anywhere else! We loved it!", "helpfulness": 2, "user": "judeRedding_CA", "date": "July 14, 2008", "id": 17885686}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "My daughter, grand daughter and I recently spent the night in San Francisco for my grand daughters orientation at San Francisco State University. we wanted a motel close to the college and had the good fortune to pick the Ocean Park Hotel. Not only is it about 1 mile from the college but it is across the street from the Zoo and about 3 blocks from the beach. The Ocean Park is a older motel but is very clean, well maintained and I found the rate to be reasonable. The owners were very helpful with directions and any questions we had. All in all staying there was a excellent choice and a very good experience.", "title": "Motel price is too expensive", "helpfulness": 2, "user": "Liesl13", "date": "June 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16842136, "likes": {"liked": "— Location, but you really do need a car", "disliked": "— That they bumped us for our first night following a 20 hour trip to get there."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We have stayed at the Ocean Park Motel at least 10 times over the past 15 years. When we first visited, we found it delightful and really good value.", "title": "Like being at home", "helpfulness": 3, "user": "Agusmaigel", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16737783}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Unfortunately our last stay got off to a bad start. The people staying in our room the night before we arrived had a \"medical emergency\" which meant that they could not check out on time as one of their party was in the hospital, according to the guy at the front desk. We arrived late evening very very tired from a 20 hour journey from Germany, only to find that they did not have room for us and had made a reservation for us at another motel nearby (which was absolutely dreadful and we did not sleep a wink). Now, considering that Ocean Park Motel lives off satisifed vacationers who return every year, and we had stayed there at least 9 times on an annual basis before that, we found this situation most disagreeable. We were given a discount on the room for our remaining stay, but this bad start left a very sour taste for us.", "title": "great & unique hotel", "helpfulness": 1, "user": "tooncesDurham_NC", "date": "June 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 16640112, "likes": {"liked": "— beautiful clean room & grounds", "disliked": "— price"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed at the Ocean Park while visiting our daughter at SFSU. The manager was nice and the hotel is located in a residential area. The rooms are dated but quaint. I guess that's part of the classic art deco feel of the hotel. The Ocean Park is very close to the SF Zoo and Beach. For a good place to eat try the Bashful Bull Restaurant a few blocks walk into the neighborhood (Great Breakfast All Day!). Now for the caveat, if you are a light sleeper beware of the Muni Train which passes right in front of the hotel. Our room was at the front of the hotel and the train made a heck of a racket on a regular basis (I didn't sleep well but my wife did). I can't say how loud the train was for those lucky enough to get a room at the rear of the hotel. Overall, our stay wasn't bad but for $125/night I will probably try another hotel just to compare.", "title": "OK Hotel, Nice Location", "user": "CalTraveler45", "date": "February 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 13761742}, {"rating": 5.0, "title": "Retro Motor Motel", "text": "This is a cute little motor court motel that is everything motels aren't anymore. The art deco exterior is great and the updated interior are awesome. This is old school and you must have no 'motel' expectations when you check in. This is a charming, friendly, clean and comfy place to stay just a couple of blocks from the beach. Take advantage of the list of ideas for touring, dining, and transportation provided when you check in as well. If we stay in SF again, we will definitely stay here.", "user": "lauracro", "date": "February 16, 2008", "id": 13602838}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "This was a great place and a very good choice. It is two blocks from the beach, and across the street from the zoo and the train stop to downdown and all of SF. All of SF's major parks were very nearby and all services within a mile. Great location! The place itself has an immaculate green courtyard and grounds and the unit I stayed in was a one bedroom with a kitchen and very spacious, like a one bedroom apartment. Also the value was excellent, it was the same price as some of the tiny hotel rooms around there but vastly superior in every respect. I'll definately stay there agian when visiting SF. Very nice, friendly owners too. I highly recomment it.", "title": "Nice Place!", "helpfulness": 1, "user": "Ktrance", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13026270, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I have stayed in various hotels in San Francisco (all price ranges) and found that Ocean Park Motel was the very best value and we enjoyed the friendly service, great location and easy access, and very convenient (and FREE) onsite parking. I know that the City and accommodations can be very noisy no matter where you are and we found that this location was one of the quietest. I have also had rooms where you could barely move. This was not the case at Ocean Park Motel. Our room and bathroom were spacious (we had an upstairs room with a microwave and queen and twin bed). It was very easy to travel back and forth from our room to visit our daughter who is now living on the SFSU campus. If we wanted, we could have easily walked to the beach or the zoo from the Motel. We plan many more visits and will always stay at Ocean Park Motel, without a doubt.", "title": "Loved Ocean Park Motel", "user": "Drage", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12740211, "likes": {"liked": "— the value and the more residential/quieter location", "disliked": "— more free movie channels"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "If you want to stay at a place that is rich in local history where the owners live on the property and the neighbors commute on the streetcar that runs by your door then this is the place for you. A list of favorite neighborhood restaurants and ear plugs are thoughtfully given to you upon check-in along with a map of the city with transit options. Hop a bus to the DeYoung museum then dine on some of the finest crab in SF - all without driving a car on those nerve wracking hills! Helpful local staff provide opportunities for experiences off the beaten tourist path. The rooms are simple and clean. The price/value/experience ratio is great. I stay here whenever I am in SF for an art fair.", "title": "Neighborhood Charm", "helpfulness": 2, "user": "Out-on-the-Town", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11034641, "likes": {"liked": "— location", "disliked": "— streetcar"}}], "location": {"country": "United States", "city": "San Francisco"}, "variance": {"poor": 8, "average": 14, "very good": 69, "terrible": 3, "excellent": 92}, "aka": "Ocean Park Hotel San Francisco", "slim_ranking": 0.221276595745, "description": "San Francisco's first motel is an award-winning Art Deco gem where guests enjoy our secluded garden Jacuzzi after a whirl of downtown attractions. Family friendly rates in a variety of rooms, some with full kitchens. Dogs are welcome and enjoy Ocean Beach and nearby Fort Funston. Entirely non-smoking, with free parking, local calls, and internet. Twenty minutes' drive to airport or downtown, with downtown streetcar at door. Near UCSF, SFSU, Golden Gate Park; opposite beach/zoo."}