{"user_rating": 3.5, "review_count": 40, "name": "Ocean Front Hotel & Restaurant", "reviews": [{"rating": 4.0, "title": "Nice little guest house type of hotel", "text": "I stayed at this nice place last weekend and it was awesome. For me it's more of a guest house than a hotel. It's right at the beach; so you'll listening to the waves all night long. Nice staff. Clean rooms. Very simple lodging. Not for those looking for deluxe accomodations.", "helpfulness": 1, "user": "golflover26", "date": "October 5, 2013", "id": 179805507}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "my wife, grandson and i spent a couple of days this week at this little beach front hotel and really enjoyed our stay. the hotel is a little dated but clean with good service and only 40 feet or so from the ocean. the food at the very nice resturant was excellent and very well priced for the area. the hotel has a very nice deck where you can have lunch and dinner and also drinks over looking the beach and ocean. the staff was very friendly, helpful and totally bilingual.", "title": "couple days with grandson", "user": "ron h", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165598666}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We got a room for 2 nights rather at the last minute. The room was nothing fancy, but since you're not going to be in it much is that really an issue? :-) Tile floors, sensible since you'll track in sand; but the floors were very clean! So was the rest of the room. Spacious bathroom with a roomy shower. Yes, I've slept in better beds but after a day spent swimming and sunning (and drinking sangria from coconuts down the way) the crisp clean sheets felt heavenly as my tired slightly burnt self nestled in for the night. There's a restaurant attached to the hotel (we didn't eat there) as well as a nice patio bar (which we did visit...the chicken wrap is delicious) but you can walk down the road a ways and find numerous things to do.", "title": "Get a great night sleep then roll out of bed on to a fantastïc beach", "user": "aerenii", "date": "June 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 164959027}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "The best view.. don't expect luxury rooms but very clean and all you need to relax and enjoy the amazing sea view.", "title": "Amazing location..", "user": "Pasukaru03", "date": "June 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 163000887}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "Good food, excellent mojitos and good service.. What else do you need?!!", "title": "Not the best option", "user": "Aileenms84", "date": "May 26, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 161921098}], "location": {"country": "Caribbean", "city": "Isabela"}, "variance": {"poor": 1, "average": 8, "very good": 14, "terrible": 6, "excellent": 11}, "aka": "Ocean Front Hotel And Restaurant", "slim_ranking": 0.833333333333}