{"user_rating": 4.0, "review_count": 149, "name": "Ocean Manor Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Even though this was a long flight from Alberta it was worth the wait. The bar and restaurant staff were the friendliness of anywhere I have been and by far went beyond the call of duty to please.", "title": "Worth the wait", "helpfulness": 1, "user": "specialgirl14", "date": "February 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96624673}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The rooms were among the best I have been to for cleanliness and the only one that I have been to that offered maid service everyday if needed. We found this wasn't one of things that we needed though since we were always at the beach front or pool which we didn't want to miss for a moment.", "title": "Any vacation is what you make it", "helpfulness": 2, "user": "wpiglet", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93047006}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Although a family may not find this as exciting a resort as some of the larger facilities, it was definitely what", "title": "Not really worth the money", "helpfulness": 1, "user": "srj55", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 91486401}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "the doctor ordered for us since we were there for much needed R & R.", "title": "This was an amazing holiday!", "user": "braidlady", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 89109030}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The food was also second to none with lots of choices and variety.", "title": "I would stay here again", "helpfulness": 1, "user": "Prism123", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88695889}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We loved spending our honeymoon at Ocean Manor!", "title": "Lack in size made up for with HEART", "helpfulness": 1, "user": "Omahaneymooners", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 69918308}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Good, bad or otherwise, most of the reviews are true and accurate -", "title": "quiet, quaint....needs updating.", "user": "wendy_Mallory", "date": "June 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 68431596}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The location is not convenient (but the ocean and views are unique); there are not a lot of activities (but they try & they are fun); the resort is somewhat small (but immaculate and friendly). With that being said, this place was GREAT!! We absolutely had a blast. The food on the dinner menu was delicious. We never ate the same thing twice and enjoyed every dinner. The breakfast was just ok, but it was sufficient for filling the belly for the morning. The service was friendly, outstanding and personal (which is more than I can say for Iberostar Costa Dorada). The bartenders and servers knew what we liked and went out of their way to be a local friend.", "title": "You deserve better then what this place has to offer...it's that bad!!", "helpfulness": 1, "user": "Cape2010", "date": "June 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 67590930}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Leo, Rodi, and Fabio are great! They are a blast and they are extremely helpful.", "title": "Not very impressed", "helpfulness": 1, "user": "enigmap", "date": "June 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 67529720}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We were on our honeymoon and are not \"lay on the beach/ by the pool” kind of people. We went to a different excursion everyday, but coming back to Ocean Manor was like coming \"home\" everyday.", "title": "Great vacation!", "helpfulness": 1, "user": "babsbrister", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 64587039}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We are a family of 4 and loved ocean manor resort. We were in room 322 and although it didn't have a view of the ocean, it was very spacious with 2 bedrooms, a large living room and balcony. The facility is immaculate. I have never seen so many staff cleaning all day long. The food was very good, too. There was a lot of variety and local delicacies on the menu. All of the food was made from scratch. The pineapple and papaya melted in your mouth. As others have said, this is a relaxed small resort with only 33 units. There were only 7 units occupied when we were there. It is exactly what we wanted because we wanted to be near the locals and to experience the culture in the Dominican Republic. There was a list of activities to do each day through the hotel. Our 13 year old boy played beach volleyball with other young resort guests and Alex, the activities director, virtually every day. The daily list included things like Spanish class, aerobics, beach volleyball, surfing lessons, bingo, and boogie boarding lessons. We also paid to do the jeep safari to 27 falls. We had a blast because we learned a lot about the culture and history of the DR but we also got to climb the last 7 falls. The other paid activity that we did was scuba diving. We went with Dive Cabarete. The owners, Jane and Chris, are amazing. They made sure my 20 year old daughter and 13 year old were confident and prepared for the ocean dive in Sosua Bay. We went down to 40 feet and saw all kinds of fabulous fish and marine life. Our youngest said it was the coolest thing he has ever done in his life. He wants to get his complete PADI certification now. I would recommend this facility if you want to get a feel for the wonderful culture and beauty of the Dominican Republic. I should mention, the beach is rough in front of the hotel but Cabarete has a very nice beach and Sosua is crystal clear and very calm. Cabarete is a 20 minute walk and Sosua is a 10-15 minute cab ride away.", "title": "Great service and so clean!!", "helpfulness": 9, "user": "wunderful", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116259678}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "we enjoyed our vaca but the resort was tooo small not much to do, they had very lil activities for us to do. we went on the buggie tour which was horrible the host 'ANA' AT OCEAN MANOR sold it to us knowing it was $80. worth of garbage. Every Buggie or ATV at some point and time broke down. It was the worst and i would never recommened it to anyone. ANA is a scan but OCEAN MANOR overall was nice.", "title": "\"it was a nice resort\"", "helpfulness": 1, "user": "sunshine8556", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115842011}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "To start off this review, let me just say that my brand new wife and I had heard good things about Cabarete and had seen some reviews of Ocean Manor on Tripadvisor before selecting it. We'd had no experience with timeshare condos or RCI in the past and were given this trip as a wedding present. We had no real idea what to expect.", "title": "Not a bad honeymoon", "helpfulness": 36, "user": "oraclesam", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115372060}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "In this review, we'll talk a little about the geography, getting around, as well as our experience with Ocean Manor (both the pros and cons). Overall, I'd say we got a pretty good experience out of our stay.", "title": "This Place was awesome!!", "helpfulness": 8, "user": "jackie101_2", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 108867273}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "As we got closer to our day of departure, we started to tie up some of the loose ends. Ocean Manor is a mandatory all-inclusive place, which means you'll be shelling out around US$60 per person per day in addition to whatever points you're cashing in for RCI. For the two of us, that ended up being about $950 for a week (including taxes). We had originally reserved an auto to drive around in, but at the last minute canceled it thinking it was not really necessary (there's probably some pros and cons to this, which I'll get into later.", "title": "A Lovely calming getaway", "helpfulness": 3, "user": "czechman", "date": "May 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 108632710}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I recently had the privelege of staying at the Ocean Manor Resort in Caberete, DR and was very impressed by all that it had to offer, from the rooms, amenities, food and drink you name it this place is an upscale place. The food when you think of all inclusive you might be under the impression of buffet style food that will become mundane over you stay, but to your suprise Ocean Manor offers a diverse menu over 3 square a day with cooks who take the time out to prepare each meal. Along with the restaurant on the resort it wait staff is at your service to see that you needs are met, they are local residents who can speak good English enough so that you can convey what you want. Endless drinks speaks for itself. The view of the ocean from the rooms is priceless and the nearby pools are an awesome place to bake in the sun and relax. Im young so my only gripe is that it seems that Ocean Manor caters to more families and the older crowd which is fine, so if your young just be mindful of that as well as its not chica friendly! Its location is a a few minutes away from the City of Caberete which is good in a sense that it quiet and away from the nightlife, and its just a 15 minute cab ride away from Sosua and a half hour from Puerto Plata. If you are considering staying here its worth your while, you will be satisfied and happy that you made this choice!", "title": "Very Quiet place, unmatched for relaxation", "helpfulness": 2, "user": "nycbombero", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 104399471}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "My friends and I have travelled all over the world and enjoyed our stay at the Ocean Manor. It is smaller than the huge resorts that you find in places like Playa del Carmen or Jamaica so if manicured lawns, artificial fountains and swimming pools with slides leading into them is what you're looking for, you will be disappointed. If you are looking for a smaller, quieter atmosphere that is appropriate for adults and families, then this is the place. There are two pools and a small beach. We are in our late 30's and early 40's and were at home with the younger families and older guests. The place is small enough that you can strike up acquaintances easily if desired and large enough that you don't have to! The staff is really why I am writing this review - my first ever. They went above and beyond to be sure that every need was met. From the wait staff to reception to bartenders to the activities director, everyone was kind, considerate and top notch. There is only one restaurant, but a fairly large menu. If you get tired of the food, it is only a 2 minute drive to downtown Cabarete which has a fabulous beach and many restaurants. The rooms were a good size and very clean. There is an air-conditioned lounge near reception with free wi-fi, computers you can use also for free and there is a telephone that guests can use that is also free! Everyone kept their calls to 5-10 minutes so it was never a problem gaining access (and calls are free to other countries too!). All-in-all, a great place to stay!", "title": "Wonderful Staff and great place", "helpfulness": 3, "user": "stetwin", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 102656438}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I have written a few reviews and traveled alot. 4 plus vacations a yr. some are for vegacations to recharge some for adventure and culture. this was a veg and went with my wife and sister and her husband. Very good travel pards.we all concured that if you go to Motel 6 and it is what it is but it isnt what you thought it should be you cant complain.if you go to the Hilton and the same is said then you may complain because you paid for the Hilton.", "title": "I returned to home relaxed but glad to be home", "helpfulness": 9, "user": "tctommy", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 99121927}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Now I will try and clarify the above statement. First what both couples liked and in general alot of the opinions from other guests will also be included for both the pros and cons.", "title": "Don't miss out on this one!", "helpfulness": 3, "user": "VulcanPortColborne", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 97998155}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We all Loved the staff they went out of the way to make everyone as happy as they could.", "title": "I felt like being with family-", "helpfulness": 2, "user": "c_burgess57", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97476272}], "location": {"country": "Caribbean"}, "variance": {"poor": 12, "average": 16, "very good": 56, "terrible": 13, "excellent": 52}, "aka": "Ocean Manor Beach Hotel Cabarete", "slim_ranking": 0.35, "description": "This property is located on the beach and has 33 rooms. Is an All Inclusive mandatory hotel.RCI-affiliate ID #7553. The Restaurant and the 2 Bars are open from 7:00 am until 11:00 pm everyday. (Kitchen close at 10:30 pm everyday.The program includes Breakfast, Lunch and Dinner, Alcoholic & Non-Alcoholic Beverages,Daily Maid Service. Ocean Manor Hotel is 13.92 miles from Puerto Plata Gregorio Luperon Airport (IATA Code: POP). Aprox 30-40 minutes."}