{"user_rating": 4.0, "review_count": 2976, "name": "Ocean Maya Royale", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "My vacation was awhile ago, but I have been meaning to write a review since I returned to the US. First off, the group I traveled with (my boyfriend and some friends) were expecting very little from this place. Between the (mostly) harsh reviews and the very low rate we got we were practically expecting holes in the walls. I am happy to report we were very pleasantly surprised! From the moment we walked into the hotel we were greeted with drinks and welcomed. The only problem was that our room was not yet ready and we were forced to walk around and wait for it to be ready. We had to put our luggage in a storage closet and we wanted to change out of our flight clothes, but it seemed like more trouble than it was worth to dig out shorts/a swimsuit to change in the public lobby bathroom. Things may have started poorly, but after an hour or so our rooms were ready and we entered our rooms. The villas were very cute and gave the hotel a home-y feel. Our room had just one king size bed, and though the mattress was very hard, like some reviews say, it did not bother us in the slightest. After all, we weren't there to sleep! Granted, we are young and without any back problems, but that was our take on the mattress situation. The room was immaculate aside from a few ants right near the window but it was not close to the bed at all so this was not too bothersome. It should be known that I can be quite picky about cleanliness, and this room lived entirely up to my standards.", "title": "Great Vacation", "helpfulness": 2, "user": "travel12326", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 74380993}, {"rating": 1.0, "title": "WORST \"MOTEL\" - WORST VACATION EVER!", "text": "The beach and pool area were great. We had black VIP bracelets so we were allowed in the nice roped-off section, which I must say was incredible. It did seem like there were pool games with a microphone going on all day which was a little annoying when walking by that area, but nothing not tolerable and I am sure fun for those participating.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 8, 2010", "id": 74278639}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Food was overall very good. Fresh fruit, omelettes every morning...overall good variety. Fresh mojitos just waiting out one night! We tried all of the restaurants. Japanese and Italian were great, Mexican was not so great. Sometimes we were stuck with a late reservation but we had a party of 10 so that is to be expected. There was a great open air restaurant by the pool/beach, great for grabbing lunch without having to walk far. As far as drinks go, they were made fairly weak but if you slipped the bartender a dollar or two they seemed to throw a little extra alcohol in. On that note, don't bother converting money. US dollars were perfectly acceptable and even encouraged. It sometimes seemed like you were being hounded for tips, but these people are just trying to make a living and it did not take away from the quality of my vacation at all.", "title": "Not all true!", "helpfulness": 2, "user": "eastwood50", "date": "August 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 73517542}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "One thing I had a problem with though was that I developed an ear infection about 4 days into the vacation and the doctor only came by on certain days. I needed some antibiotics, which I did not realize were over the counter in Mexico. But I made an appointment and when I arrived was told it would cost $150. This seemed ridiculous and I stuck it out until I got home.", "title": "Great first vacation", "helpfulness": 2, "user": "D_from_Mtl", "date": "August 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 73457272}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Despite a few small problems there was nothing I could think to change about the Ocean Maya. I was very impressed with the rooms, the beach, the food, the drinks, the grounds (people constantly landscaping). I would tell anyone to give this place a shot.", "title": "Great stay with only a few hickups", "helpfulness": 2, "user": "KJM604", "date": "July 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 4.0}, "id": 73187792}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We upgraded to highest level & got nothing!No ameneties, no stocked fridge, no iron,no robe & slippers,no alarm clock and only a sheet on the bed!Had to plead for ocean view that I paid for which turned out to be about a mile from the lobby!No room service, concierge never there.NO BEACH-there's a wall in front of beach chairs. No service at pool or beach. Pool was dirty. Was ignored at the filthy pool bar because they cater to the locals! Italian restaurant charged money for half the menu at an all inclusive! Did not feel safe, in fact, the room safe was not electronic as promised and very flimsy! Only one shuttle into town. Buffet looked like left overs! Staff was rude and not accommodating. We left in 24 hours which was 23 hrs. & 59 minutes too long. Thank God we hooked up with the only other americans who were leaving also! The pictures of this hotel are deceiving and so is Continental Travel Package. They lied about this Ocean Maya & that is fraud. Stay far away!!!!!!!!!!!!!!!!", "title": "IT WAS A NIGHTMARE!!!!!!!!!", "helpfulness": 8, "user": "JupiterDonna", "date": "August 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 76869362}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "I just got back last week from a 6 day, 5 night stay at Ocean Maya. When we made reservations at the resort, we were upgraded to the deluxe all-inclusive package because the resort was doing room renovations and wanted people to still come. We were excorted to our room by a staff member and he took us through all we needed to know like not drinking the water, how to work the safe, and use the TV. He told us that are staff would always be full with water and other beverages and actually checked to make sure it was. When he saw it was not, he immediately filled it. He also looked and saw that we were short one bath towel and got it within five minutes. We also had an issue with our cabinet door of the cabinet where the refrigerator was stored. We reported it before dinner and came back to our room and it was fixed.", "title": "This was one of my favorite resorts that I have stayed at!", "helpfulness": 5, "user": "Worldtraveller8068", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76575955}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The pools were amazing! There were areas to lay out that were in the pool, plenty of pool activities and plenty of chairs to sit on near the pool. Not all were on the pool deck, but they were on the beach facing the ocean. The upper pool bar was open and if you went to the lower one, your order was taken and brought to you. There is a section of the pool that has jets like in a hot tub, but is still a part of the pool. There are also some seats in the pool that have those jets. Both the seats and \"hot tub\" area alternate. The beachfront was actually larger than expected and people staying in the resort were able to use things like kayaks in the ocean, in the resort's section, for free and things like parasailing and snorkeling for under $20 US a person.", "title": "Your Money is Better Spent Elsewhere", "helpfulness": 3, "user": "PDC_Lovers", "date": "August 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 76061794}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The staff was very friendly and attentive to the needs of the people staying at the resort. When walking past staff members, I would be greeted with a hello or good day. Also, since the area is known for rain storms, the resort lets you check out umbrellas to use for your entire stay. You have to ask for them, but it does not take long to get them.", "title": "Good place for the price", "helpfulness": 3, "user": "Mudstrap", "date": "August 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 75762791}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The food at the main restaraunt was not five star by any means, but there was a variety of foods and the menu changed daily. The other restaurants were fantastic! The Japanese restaurant especially...and I don't even like Japanese food normally!", "title": "spend your hard earn money on another resort", "helpfulness": 4, "user": "familyof11", "date": "August 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 75077384}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "For the price, which is not cheap, the service is poor, very few people for too many clients. Food in the buffet has reduced options, nothing healthy for kids. The people in charge couldn´t help you or they just tell you to write your complaints down instead of trying to help. The Resort is beautiful, rooms are great except for some structural problems as water floods in the bathroom, but... I really needed a good rest, it didn´t happen. Be careful with the front door guy, he makes the taxis chrage the double fee for him to take half of it. Sorry, I don´t like being negative.", "title": "Not a nice vacation", "helpfulness": 2, "user": "vazsalgado", "date": "July 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 73139074}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We arrived on Friday and all was well, except that we specifically asked for a king bed and got the two smallest full size beds that I swear were made of rock. The food was good for the first two days, but it must have been a local event because the third day, the staff stopped talking to anyone who was not Mexican. We kept getting cut in line in front of us and the service went from friendly to extremely cold. I was told that the fajita plate in the Mexican restaurant was a large plate. I saw the plate given to one Mexican gentleman next to me and it was, and I got excited. What was brought to me was embarrassing. It was about a handful of greasy meat with cheese all over it. I truly believe that was where I got sick. The bartenders were also serving locals above us as well.", "title": "Good at first, then things went wrong.", "helpfulness": 1, "user": "jamesindallas", "date": "July 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 72730734}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My wife and I just got back from Ocean Maya, and for the most part it was good. The room was very modern and spacious, the AC was very nice and cold, and the bathroom was pleasant. The beds, however, were very uncomfortable, but due to the high level of activity during the day and free booze, that issue worked itself out.", "title": "Cool place and great service but be vigilant with management issues!", "helpfulness": 2, "user": "Spurginj", "date": "July 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 72655916}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The restaurants had great service but food quality was below average-slightly above average, definitely not excellent at all. The best we had was the Japanese grill portion of the Oriental restaurant (so named). It was plentiful and delicious, but took some time. Second-best was the Italian restaurant, Dolce Vita, but mainly for service and atmosphere (beachside with cool wind blowing at night). The food quality was average. The buffet had a wide array of choices but all the food was below average-average at best.", "title": "For the price, you can't beat it!", "helpfulness": 1, "user": "firenicz", "date": "July 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 72343864}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The bars/cafes were great for service and beverages, but you'll be disappointed if you're a beer drinker like I am because all they have is Corona. I eventually switched to rum and cokes. The poolside bar is convenient but can get dirty, particularly the swim-up part. The coffeehouse was very nice and clean, with free baked goods. The front lobby had many sitting areas and was quite breathtaking aesthetically.", "title": "Well...it's kinda thumbs up, thumbs down", "helpfulness": 2, "user": "keddiej", "date": "July 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 71880345}, {"rating": 5.0, "title": "Great Value Excellent Service Great Fun", "text": "We stayed at this resort from October 17th 2010 to October 21st 2010. We traveled with myself, husband, 1 year old and nanny in one room. When arriving our rooms were not ready but they locked up our luggage and we ate, explored and swam. When our rooms were ready we were pleasantly surprised. We requested first floor and next to our friends who were with us. We had building 9 right on the beach facing the ocean. We also had adjoining rooms with the other couple which worked out great because we were sharing a nanny. The room was completely renovated to a modern flair. It was small but a ton of storage. We had 3 adults and a 1 year old in it and had plenty of room. We had 1 king size bed, 1 couch, 1 chair a desk, table, 2 night stands, a fantastic closet. We had inside a full size jogging stroller and a pack and play. We requested a crib and all they have is pack and plays but who cares I did not have to haul it. It was clean and safe. The only thing that was difficult was the marble tiled showers with a 1 year old. Bring either a blow up tub or a non slip mat. The beds are hard but we did not go on vacation to sleep all day. The room was clean and we had really no issues. The first 12 hours we were there the manager called to see if we needed anything. If we did we just called and we got it. The safe is fine it has a key lock and we had no issues. In fact the only thing we had in it was money and our passports. My credit cards were out in the room all week in my purse and no one bothered them. I felt very safe.", "helpfulness": 3, "user": "jenai23", "date": "October 25, 2010", "id": 84703521}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The staff is amazing and friendly. The food was great. A good selection. If you could not find something you liked I'm not sure you would like anything anywhere. I had no problem feeding our 1 year old daughter. We went to all the specialty restaurants and they were good. If you did not like it order something else.", "title": "Enjoyed Mexico But Not This Resort", "helpfulness": 3, "user": "Chanel1102", "date": "October 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 83658738}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The drink staff was always great. No problems ever waiting. Shaday up front in the lobby was always on top of it.", "title": "Much better than expected", "helpfulness": 2, "user": "TexasBahamamama", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 83617386}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The resort was really empty. We barely ever saw a hundred people. It was quiet and peaceful.", "title": "Mexican atmosphere", "helpfulness": 1, "user": "Zmijas", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83285869}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The pools and ground were very clean and beautiful. Mosquitoes are in an abundance so bring bug spray. It is Mexico.", "title": "Great value - only complaint was the food", "helpfulness": 1, "user": "luv2ski84", "date": "October 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 83151660}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3, "variance": {"poor": 181, "average": 336, "very good": 990, "terrible": 118, "excellent": 1351}, "aka": "Ocean Maya Royale Hotel Playa Del Carmen", "slim_ranking": 0.239795918367, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": ".Ocean Maya Royale is a luxury all-inclusive beachfront resort in Riviera Maya, in the heart of the Mexican Caribbean. Offering intimate settings and lush tropical landscapes, this Caribbean gem is very close to Playa del Carmen, Tulum, Cozumel and Cancún. Relax and enjoy our Despacio Spa, two swimming pools, exclusive south beach section featuring Balinese sun beds, Dive It! watersports center and our a la carte restaurants, where you can taste the best International cuisine, including our new beachfront La Dolce Vita restaurant. Effective May 1, 2011 Ocean Maya Royale is exclusively an Adults Only resort, a perfect retreat for honeymooners, couples and any one over the age of 18 looking for a more relaxing and sofisticated Caribbean experience"}