{"user_rating": 4.0, "review_count": 4923, "name": "Ocean Coral & Turquesa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We travelled to Ocean Coral on 4th December with First Choice and what can I say...it was Great!!! We travelled as 2 couples ages 20 - 22 and I honestlky do not undersatnd all of the negative reviews! I apologise now for the long review but I just want people to know how good this hotel really is!", "title": "Excellent", "helpfulness": 8, "user": "happy_peeps", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52115939}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Check in was very easy, as soon as you arrive they make you feel welcome. The bell boys take care of your luggage and you are greeted in the lobby with a very refreshing cocktail! We checked in and were in a rooms within half an hour of arriving. The rooms are lovely, we were room 12201...they are exactly as the look on the h10 website! We had a beautiful view of the pool and the beach/sea! Yes the rooms were a little musty on arrival however after a couple of days the smell had gone....just leave the air con on as they advise and you will be fine, its just because its so humid!", "title": "Welcome to Paradise!", "helpfulness": 5, "user": "dachshundparent", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 52109374}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The food at the hotel is brilliant! Each moning we went to the main buffet and there is such a selection! They had cooked breakfasts, omlettes, fresh bread, cakes, cereal, yoghurt! The list goes on! WE ate in the buffet most nights as they had such a good choice, there was four of us and we could always find more than enough that we liked! We also tried the Italian and Mexican. There is a restaurant next to the beach which during the day serves snacks but in the night is a really good restaurant. Some of the things on the menu come with an extra charge but we just had the meals which were included in the all inclusive and they were lovely. I recommend the cajun spiced steak! Yummy!", "title": "Fan-Freaking-Tastic :)", "helpfulness": 5, "user": "audge169", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52059595}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The pools were really good at the Ocean Coral - whatever you like to do during your holiday. There are 4 pools at the hotel, 1 very quiet one, 1 with a pool bar with some activities and music, the activity pool and a childrens pool. Our favourite was the activity pool as there was things going on here you could join in with if you wanted too but it you prefer you coulpd just watch and listen to the music!", "title": "Beautiful hotel, bad food.", "helpfulness": 4, "user": "CEBuff", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 52034165}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The entertainment during the day was really good whatever you fancy. The animation team work so hard getting people involved and organising activities. They do things such as water polo, beach and pool volleyball, aqua relax, yoga, aqua aerobics, poker and lazy games! Theses are all I can remember but I really think they cater for everyone! Evening entertainment was good too. They had beach parties, toga parties and live music by the pool, shows which the animation team perform in and whilst we were there they done a Christmas Show which was brilliant!", "title": "Ignore the whiners,this is a very nice place", "helpfulness": 10, "user": "greatholidays199", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52030559}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Everything was satisfactory for my family – location, hotel, food, staff and tequila quality. This hotel is very close to airport (15-20 minutes) then most hotels in Cancun.", "title": "Very good place for the money...but the ocean is dirty.", "helpfulness": 1, "user": "AlexWashingtonDC", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 51473404}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We paid $100 per room per night and I think this was a bargain. The only thing was very disappointed for us is the ocean. It's very dirty - lll kind of see weeds and garbage. I am not sure if the ocean is that dirty and unpleasant all around the year. Check before you go.", "title": "Well worth the money!!!", "helpfulness": 4, "user": "PittTraveler1221", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51421440}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just returned from the Ocean Coral and we really enjoyed ourselves. I am unsure how some of these other critics state the service people are not helpful or friendly. I think that was the best asset about the resort. Whether it was at the pool or at a restaurant or simply walking by a service person, they all had a big smile and friendly greeting. We enjoyed the activity pool for the entertainment crew in keeping us chuckling all day long while we relaxed in the sun. Polo and his crew are a trip!! Great senses of humor. We also enjoyed going to the lobby bar every evening and grabbing a drink from Gaspar (I think that was his name). He was constantly singing and joking with us and everyone that came to the bar. Always fun to come across such great personalities on vacation in making sure you have a good time!", "title": "Great Resort", "helpfulness": 10, "user": "tiffanyrose", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51419802}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The food was not excellent but good. However, there were more than enough choices at each place to find something we enjoyed. Mike's Coffee spot was the best especially after dinner with all of the delicious cakes, cookies and brownies they had to choose from!", "title": "Beautiful, contemporary, and excellent service!!", "helpfulness": 5, "user": "nels1288", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51357653}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My only negative from the entire resort would be the seaweed on the beach. The sand is very nice with tons of great palapas for shade but the seaweed made the water so murky. We are more pool people than beach people so didn't bother us much. We ended up taking a catamaran to Isla Mujeres to snorkel and enjoy the crystal clear water. On a smaller note, our lock broke on the next to last day we were there and they actually had to brake it open. Kind of a bummer to be locked out since it was when we returned from breakfast and needed to change for pool but the service person was there within minutes. I didn't even complain to the front desk in getting anything comped or whatever since that is something that was really out of their control.", "title": "Excellent Time", "helpfulness": 4, "user": "TannedLady", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51356795}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I am not really sure if some of these other reviews are for real. This resort, although small in size, was full of activities and fantastic staff. Yes you were greeted by the time share personel. They were very knowledgeable about the resort and a simple \"we are not interested\" was enough to satisfy them. I give them credit, even after a couple of days at the resort we had asked Soapia a question and she remembered our names and anwered us with a smile.", "title": "amazing resort and spa", "helpfulness": 4, "user": "carryberry", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52024385}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The bar servers were also great. Each evening we would tip them and we never had to wait in line. Simply making eye contact through the crowd and our drinks were made and set to the side for us to pick up. Always laughing and telling jokes or singing and creating crazing new drinks to be tried.", "title": "Great Resort!", "helpfulness": 6, "user": "OutbackCalgary", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51947669}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We spent alot of time in the small childrens pool area. The servers there were also very attentive to our needs. Making us feel secure and comfortable with our son running around. They provided a craft painting area which most days was filled with young children painting, however I spent an entire afternoon sitting under an umbrella painting and found this to be very relaxing and rewarding. My painting turned out to be georgeous and was offered a number of times if I would sell it. I did not.", "title": "Great place, great service, great time! Going Back AGAIN!", "helpfulness": 19, "user": "designergypsy", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51537159}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The most relaxing part of the trip was the spa. Soft music and candle light hightened the full day treatment that left me completely relaxed and was a great way to start and finish the trip. If you are thinking about going try the \"sea shell massage\" and ask for Gabreil. Most incredible experience of my life.", "title": "nice staff, nice hotel, very average food, ocean sucked, we left after 3 days!", "helpfulness": 5, "user": "expecting3", "date": "December 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 2.0}, "id": 51533666}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We were at the resore during the christmas week and every day there were tons of pool activities and each evening in the theater as well as the piano lounge was live entertainment from the pool staff. I give them alot of credit. When we got up in the moring even if it was 7:30 they were already at work smiling and laughing encouraging people to participate and they were still going strong when we went to bed. A little rain did not even stop them, they simply drug enverything upstairs inside and kept the party going. I do not feel that this resort is for you if you are looking for the disco night club parties they simply do not occur here.", "title": "Think twice if you're English", "helpfulness": 1, "user": "caroleandpete", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 51523539}, {"rating": 5.0, "title": "We'll never forget the Ocean Coral and Turquesa", "text": "This trip was a celebration of our 10 year wedding anniversary. What an amazing 5 days we had at Ocean Coral & Turquesa the first week in November 2010. Most of the reviews touch on specific topics, so I did the same below:", "helpfulness": 4, "user": "Toonces76", "date": "November 15, 2010", "id": 87163719}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Safety- First of all, if you read the news, you know there are concerns about traveling to Mexico right now. However, if you plotted out the areas where the really bad crimes have been occurring, you will not that the Mayan Riviera is not one of those areas. I do not doubt that burglaries and robberies happen to tourists here, and that people get ripped off, or that one and a while a violent crime occurs. I got the distinct feeling while I was here though, that people WANTED me here and WANT to keep me safe. After all, happy tourists = money. You should, however, keep your eyes open, don’t get too drunk, pay attention to your surroundings, don’t flash all your jewelry around (just keep it at home), and don’t go off with people you don’t know. Those rules apply traveling everywhere in the world. This hotel seemed particularly devoted to my safety: there is a huge gate in the front and a person takes down the same and ID for every person who enters and leaves the property. Cab drivers cannot enter unless they have been summoned by a hotel patron. When you leave, they take your room number. In a way I guess it’s invasive, but it’s a safety measure for sure. The most threatened I felt was in the airport when the obnoxious time share people harassed me and demanded to know which transfer company I was using. Just ignore them. I used USA Transfers, by the way, and they were great and much cheaper than the others.", "title": "What's not to like - it was AWESOME!!!", "user": "redskinboy", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 87154860}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Hotel: This hotel is flat out gorgeous. Everything is modern, fresh and cleaned to within an inch of its life. It’s not common to have this type of modern design in the US, although maybe it’s popular in Europe. It was unique and beautiful. Lots of spaces to lounge and enjoy yourself inside and out. The other comments about the facilities are all true, the rooms are lovely although the bathroom setup is not what Americans are used to. I probably would not share a room with a “buddy” because of the high level of intimacy the bathroom provides. (There is basically a glass wall between the bathroom area and the sleeping area, so there’s not much privacy.) However, sharing a room with your significant other is absolutely fine! A question I had before arriving was the electricity- for example- can I plug my cell phone in? The answer is yes- the electricity is exactly the same as you will find in the US- you can plug in your cell phone or whatever other electronics you use. Be advised that sometimes they have power surges down there, though. None of our stuff got ruined, but one night our cell phone only charged for about one hour out of 8 (?). The hotel grounds are amazing- they have a definite jungle-ocean feel- everything is breezy and lush. There are workers constantly maintaining all facilities inside and out.", "title": "excellent value!!!", "helpfulness": 1, "user": "oriahlee", "date": "November 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 86873025}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "One complaint is mosquitoes, and I’m not really sure what the hotel can do about it- probably nothing, really. I am one of those people who mosquitoes seem to love. On the beach, I was surprised not to receive a single bite. In the main lobby of the hotel, I was bitten again and again. I suppose I should have worn repellant, but I just didn’t expect to be bitten inside. The main lobby is semi open-air, however, so I know how they got in! To the people complaining about the “smell” in the rooms- I admit there was a certain odor in the room, but it was not that disgusting mildew smell you are thinking- it was just distinctive and so long as you keep the a/c running, you will get used to it and its absolutely no problem. My clothes did not “reek” when I got home, although yes I did wash them when I returned – because they were dirty!", "title": "Wonderful!", "helpfulness": 1, "user": "EmilyN610", "date": "November 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 86838156}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Also please be advised that they have free wifi in the lobby- a must if you need to keep in contact with home. We signed up for a Skype plan and used that to call home. The internet connection is good if you sit right in the middle of the lobby near the water fountain. There are tons of lounge chairs, and you can even have a drink while you chat!", "title": "Awesome Time.. Everyone needs to go", "helpfulness": 3, "user": "Tammy122364", "date": "November 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 86728734}, {"rating": 5.0, "title": "we love this place", "text": "Recently back from our third time visiting here. It's such a pretty property and the people are so friendly and very helpful and work very hard to make your stay enjoyable. I had seafood and it was cooked properly. I would always reccommend if you feel your seafood is not cooked thoroughly then send it back and don't go ahead and eat it. Also, you do not need to be a privelege member to eat at the Crepe restaurant, which has excellent food and service. It's just the snack bar set up in the evening by the quiet pool, but it's very pretty by the water and the pool with the colored lights. They make excellent tableside flaming Mexican coffee, too. Also love the coffee bar; they make the best cappucino's in the morning. My suggestion would be that if you are going to please bring extra money for tips; we noticed several people not tipping and it just seems rude given how hard they work and the long hours.", "helpfulness": 2, "user": "hellommg", "date": "December 10, 2010", "id": 89522519}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This was a nice resort but the are not safe with the food handling. My wife and I ate some grilled seafood that was under cooked and both got terribly ill for 4 days with g.i infection. It ruined our trip and the hotel staff were un-sympathetic to our plight. they accused us of eating somewhere else and charged us several hundred dollars for antibiotics and pedialyte.", "title": "The food was not safe.", "user": "beebersannarbor", "date": "December 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 89302736}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "It was nice that we got a good deal on this trip, otherwise I would have had more issues with this resort based on value.", "title": "Thankful found good deal on trip...kep my expectation low!!", "helpfulness": 2, "user": "Baudette_low", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 89032111}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "My wife and another couple stayed at the resort Nov. 26-Dec. 2. Was warned to stay away from time share people at airport, they swarm you...however you get the same at this resort (see below).", "title": "This was the best hotel my family and I have ever been to", "helpfulness": 1, "user": "chanelq12345", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 89005866}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Check in was simple, had to wait for our room to be ready since we showed up a little before 3pm. That was fine because we were able to have a few drinks at the lobby bar while we waited.", "title": "Paradise", "helpfulness": 3, "user": "semplefamily", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88973604}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "\"Since we got there I loved this hotel, the entertainment team is great!!!...the food is awesome, the rooms are the best...I can`t understand why people complaint...everybody is soooooooo nice. I´ll definetely come back next year...\"The biggest beach of all the resorts in Puerto Morelos...the view of the lobby is perfect...believe me, go and you´ll love it!!!\"", "title": "i loveddddd this hotel", "helpfulness": 1, "user": "christina155032", "date": "December 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88932330}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Although I loved our 10 day stay at this hotel, the only thing that would have made it perfect would have been the customer service.", "title": "Beautiful resort, lacking in customer service.", "user": "Mexico011", "date": "December 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 88875195}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "When we arrived for check-in, we were greeted with some yummy juice concotion that was delicious and cold. They were so nice when they greeted us and everything was great. Check in took less than 10 minutes for the 5 of us. it was great. We went to our rooms which were beautiful!! I loved the modern decor. Everything looked very clean. The rooms had a musty smell, but that went away once the air conditioner kicked in.", "title": "Won't Ever Return", "helpfulness": 2, "user": "BuonaNotteRoma", "date": "November 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 88581563}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The pools are amazing. I loved the large family pool. The kids mostly stayed at one end and we weren't bothered with them. No one ever got in our way. Some days it felt like the whole pool was ours. Same can be said about the swim up bar! I loved that as well. Service here was somewhat slow. It became progressively slower with our stay. It didn't matter if u tipped or not. There was not reaction from them, barely a thank u.", "title": "The WORST CUSTOMER SERVICE I have ever encountered", "helpfulness": 1, "user": "ttreth", "date": "November 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 88440807}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "There was usually one waitress going around the pool during a day. If you ordered from her, you wouldnt get another drink for half an hour almost every time. It was much better to go to the bar urself. Sometimes the bartenders wouldn't serve ppl according to who was there first which was frustrating! One of the pool waitresses had no idea was a tequila sunrise was or a gin and tonic. My sister asked for 3 limes ( they were really dry) and she looked like she really didnt understand and would bring only one every time. Again, kinda frustrating.", "title": "GREAT RESORT & VALUE", "helpfulness": 2, "user": "btesten", "date": "November 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 88130729}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "He was so courteous and efficient, what a pleasure! He made sure that everything was perfect! We couldn't have had better service! We were told also the front desk was difficult to work with, however we had a wonderful experience. Manuela was very helpful, Maria, one of the managers at the front desk, was very eager to assist us with the special accomadations we needed for my handicapped mother. Gabriella and Maria personally stayed in touch with us and made arrangements to get a wheelchair for us, due to my mothers limited mobility, making it possible for her to enjoy all this beautiful resort had to offer.", "title": "Joaquinn, Joaquinn, Joaquinn", "helpfulness": 3, "user": "PeggyRCanonCity_CO", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 51256313}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "There was alot of seaweed in the water at this beach, and it wasn't as clear as some of the other places we had been.", "title": "We Loved It!", "helpfulness": 5, "user": "Buckeye1953", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51151122}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We spent four days there this month and hope to return in the future. The resort was very well maintained, very clean and this process was ongoing. The food and drink options were very diverse. The International Buffet was great for breakfast, lunch or dinner. We chose the Japanese Restuarant one evening and the food was great. The bars were centrally located with waitresses taking and delivering your request from the beach and pool areas. I can't compliment our service enough! The politeness of the entire staff is the most memorable! Our room was maintained daily and the refrigerator restocked, also. There were issues with the amount of sea weed on the beach(but no trash) and the rudeness of other visitors but absolutely no issues with anything the resort or it's staff controlled. We loved it!", "title": "The bad reviews by others before us were right! The beach and ocean was full of seaweed and seagrass!", "helpfulness": 2, "user": "bluesand", "date": "December 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 51018332}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The reviews we read for this resort were all too true! The ocean was full of sea grass/weeds! The water was not the beautiful clear blues of Playa de Carmen or Cancun or even the little town of Puerto Morelos! Somehow the water all along the beach at Ocean Coral and Turquesa and all the way to the town of Puerto Morelos was so murky you couldn't see your feet in a foot of water! It wasn't what we were expecting, hoping that the bad reviews of the beach and water were just because the reviewers had gone a bad time of the year, but no, it's like that all the time along this strip of the beach!", "title": "Beautiful resort, nice rooms, ok food.", "helpfulness": 8, "user": "travelingchick9", "date": "December 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 50965380}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The resort was nice and it's not the management's fault that our vacation was ruined by the rains and winds from Hurricane Ida! The food was ok and the service a bit slow but they did have plenty of food even though we had hard time getting in at the restaurants, especially the Italian and the Mexican ones.", "title": "Don't believe the bad reviews!", "helpfulness": 12, "user": "MelainaH", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 50910433}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Ocean Coral and Turquesa was our pick based on a convenient location less than 30 minutes drive from the Cancun airport. The hotel lobby was very welcoming - we arrived more than 3 hours before check-in and were able to get into one of our two rooms shortly after eating lunch in the snackbar (about 12:30 pm). We were on the second floor adjacent to the main lobby in Building 12 (giving us the advantage of the wifi from the lobby in our rooms) and our rooms were clean, nicely decorated and there was no smell or dampness. The beds were quite comfy, the shower was invigorating, the view from our balcony was beautiful and housekeeping kept our minifridge well stocked. The bathroom provided enough privacy to be comfortable - the glass wall between the rest of the room was frosted and the toilet had a door. The AC unit worked well but barely ever turned off as the temp outside was fairly high - didn't find this to create a noise issue and the room temp was comfortable. We were never disturbed by noise from outside the room or in the rooms adjacent despite being located across from the elevator.", "title": "Family friendly within 30 minutes of Cancun Airport", "helpfulness": 6, "user": "54321Paris", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181892313}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The gardens were spectacular and beautifully maintained. Everything at the resort was within easy walking distance with the main lobby at the center featuring elevated patios with sweeping panoramic views toward the ocean. The grounds were among the most outstanding of all the all-inclusive resorts we've visited and included two covered \"jungle\" paths. We visited in \"low season\" and had absolutely no difficulty finding palapas on the beach or loungers by the pool. The resort is located on a stretch of beach behind a large coral reef (too far for even a good swimmer to swim to, but apparently easily reached by many commercial tour boats) - the reef makes for fairly calm water in good weather but traps a great deal of seagrass and mud on more tempestuous days. A large tractor made multiple passes throughout the day to rake up the seaweed - this was fairly loud and not especially efficient, but there was an attempt to keep the beach relatively clear. If you're looking to snorkel from the beach at the hotel, this is not the place. Locals walked the beach selling cigars, scarves, jewelry and other items but weren't intrusive.", "title": "Average Resort", "helpfulness": 3, "user": "Jenna P", "date": "October 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 181804898}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We were attracted by the \"No reservations\" policy when considering this resort but in practice there were guests able to make reservations in the restaurants - those staying in the \"Privelege\" category. This was our only experience of definite limitations for those guests not paying the premium. We found it necessary to have an early dinner if we wanted to eat in the restaurants as times after 7 pm were largely unavailable. We ate in the Japanese restaurant (above average meal), the Seafood Grill (snack bar during daytime hours - above average meal but many of the dinner choices were at an additional fee) and the Mexican restaurant (our favorite). We enjoyed the coffee shop and the young crowd enjoyed Route 66 after hours (until nearly 5 am, I'm told). The food at the buffet was average when compared to other all-inclusives - nothing to write home about, but certainly something for everyone. No one in our party had any \"stomach issues.\" This was not a resort notable for its food. One A+ in the food category was the \"Fresh Juice Bar\" in the buffet - never fewer than ten options made before your eyes and really, really delicious.", "title": "A wonderful time was had by all!", "helpfulness": 3, "user": "Robin H", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181636412}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We enjoyed the more laid back atmosphere - translated \"less obviously intoxicated adults\" - and were more than happy to walk a bit further for drink refills. There were notably fewer bars in this resort than in others we've visited. The bar tenders worked non-stop, the drinks were above average quality (great Mojitos) and there were waitresses delivering to the pool loungers and beach at a rate of about 1 drink an hour. Our children had their first \"adult beverage\" experiences at Ocean C & T without any incidents, and that was probably in large measure due to the less alcohol-focused quality of the resort. The swim up bar was a lovely setting - day and night.", "title": "same song, second verse", "helpfulness": 2, "user": "powerduo", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181487817}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We spent very little time with the entertainment staff during the daytime hours, but did attend two live performances in the evening. The indoor setting for the shows was a disappointment and we echo the complaint of an unpleasant odor in the convention center raised by other reviewers. The staff were always pleasant and always present - working from late morning until well after midnight every day. They did a performance of Broadway hits that was quite entertaining and the Disney show is a must see for families with school agers and tweens - entertainment staff included at least a dozen kids in the performance and offered parents a free video download of the show as a souvenir.", "title": "Absolutely beautiful hotel!", "user": "Staceykemp", "date": "October 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 181465823}, {"rating": 4.0, "title": "great place", "text": "We are French, we came in this hotel for honeymoon. Its a nice place, great room, good check-in, the Mexican restaurant is just fabulous. And if you came here don't miss the pool bar there is a barman name Gustavo he is very kind and he makes great drinks probably the best of the hotel. So you if you travel to riviera maya this is the place you need to go! (Go pool bar and drink Gustavo especial!!!!!!)", "helpfulness": 2, "user": "Warcho17", "date": "October 16, 2013", "id": 181322926}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Our vacation to this resort was wonderful. Our first time visiting an all-inclusive. The hotel was great. Rooms comfortable and clean. Staff very attentive and friendly. Food was okay. I would recommend this resort to anyone who loves the beach and being outside at the pool, relaxing and being with family or spouse, this is the place to be.", "title": "my vacation", "helpfulness": 1, "user": "Lois S S", "date": "October 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 181314458}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We had a private dinner at the chef's table and that was fantastic. The food was delicious.", "title": "Great Service from Staff", "helpfulness": 1, "user": "cjoanne58", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181280353}, {"rating": 5.0, "title": "Another great time in Mexico", "text": "LS. Memphis, tn", "helpfulness": 2, "user": "Jeffery P", "date": "October 15, 2013", "id": 181204119}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "This was our 4th stay at this hotel, Cant tell you how wonderful the staff was Ricardo at the buffet as a waiter went above and beyond. Cody as a omelet chef (last year she was pasta chef) was fantastic again, Sat on the beach a lot this stay and the girls getting us drinks Theresa, Blanca and the others were the best, friendly and kept us informed on all the drinks of the day. At the Guest Service Station he helped us put together a trip to the Casino for the adults and shopping for whoever didn't want to gamble it was the highlight for all. The entertainment and entertainers (Sylvia and Abbey) were FANTASTIC. The SPA was worth every penny. The Diving Center brought us to the reef for a Great snorkeling experience, have any questions about the water, Parasailing just ask Paco very helpful. Restaurants were very good, Bartenders excellent, cleaning staff were great rooms were spotless. Can't say enough about this hotel.", "title": "A solid choice... middle of the road.", "helpfulness": 3, "user": "lionshead_11", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181119590}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I visited Ocean Coral and Turquesa from Nov 1 - Nov 5, and I must say we had the best time ever. The resort was about a 15 minute ride from the airport. When we arrived to the resort we were immediately checked in and offered a beverage from the bar. We did upgrade to 'privilege' and must say that it was well worth the extra $$. We had access to a exclusive lounge area, complimentary computer with internet access, room service, exclusive privilege pool/beach section with a waiter, and top shelf liquor.", "title": "Good Times", "helpfulness": 3, "user": "SheFAB1", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87702316}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Resort and Room", "title": "A nice get away", "helpfulness": 1, "user": "mntraveler686", "date": "November 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87661115}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The resort was beautiful - the lobby was full of vibrant colors and unique fountains. When we arrived, the resort was at 60% capacity and we never stood in line for a drink or to eat. The grounds of the resort were very well kept and the sea grass turned out not to be as bad as expected. The room was very spacious and the décor was very modern. The bathroom had an unusual layout with no doors separating the bathroom from the room - this was not an issue with us but I wanted to address it since a lot of people have been commenting on the bathroom. We also had a patio with a Jacuzzi which was a nice feature.", "title": "Good but not great", "user": "amf2000", "date": "November 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 87546914}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Food.", "title": "Not a bad place to spend a few days", "user": "crazybouttravel73", "date": "November 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 87423732}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We primarily ate breakfast at the privilege lounge outside on the patio and it was great. Mimosas at 9:00 in the morning and breakfast glazing out at the beautiful ocean was paradise for us. We ate at the Italian, Japanese and Steak restaurant and had great food at each one. We were able to get food and drinks all day and night at the snack bar, the ‘privilege lounge’ (open till 11pm) and the sports bar (located next to Mike’s Coffee open all night long). The sports bar even had a small dance area along with American “disco music”. ***If decide to upgrade to privilege - try the Fusion restaurant***", "title": "Ultimate Relaxation & Fun For the Entire Family!", "helpfulness": 1, "user": "tarks", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87280149}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Large resort nice grounds several pools and buildings with rooms most 3 floor ocean front are 2 floors. The privilege area has exclusive restaurant and bar beach area.. we had the ground floor honeymoon suite which was large kind of like 2 rooms one area had bathroom desk TV couch table other side had couch and sitting area bed tub separate shower and bathroom area. out door area had nice patio jacuzzi shower grass area with lounge chairs and direct access to beach. The food was exceptional at the privileged area and good at some as the specialty restaurants. Mexican and Sensi(Japanese) . Villa not so good.", "title": "Large all inclusive", "helpfulness": 2, "user": "R_N_S123_11", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 181087205}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The beach area is swimable with sand and seaweed no good snorkeling. I gave cleanliness as average because found several cockroaches in room a couple different times, but maid did good job making up room and it was always nice.", "title": "Wonderful, but NOT the Beach.", "helpfulness": 1, "user": "ladyanick", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 181020949}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Went to this incredible resort and was amazed by the luxury of it ( I am used to 3* in Cuba). I felt like a queen!", "title": "Great Girls' Trip", "helpfulness": 3, "user": "RuSaBu", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180947371}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "But, I was disappointed by the beach... It's \"short\" (you can hear the pool intertainment while at the beach), really crowded (you are really close to your \"neibors\" and can heard them). They clean up the sand all day long (and the tractor is loud) but the water was sooooo dirty, full of sea weed.. Couldn't see throught it (maybe it was because of an earlier hurrican That passes through... But the water was beautiful at isla mujeres). A great thing about riviera maya's beaches, the sand is from limestone, so it never gets hot!", "title": "Nice", "helpfulness": 3, "user": "Robert B", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180917725}, {"rating": 5.0, "title": "Paradise!", "text": "Another down thing, is that water is only filtered on the resort, but NOT in the rooms... So in your room, you have to drink bottled water and the shower is hot and has great pressure, but the water has a strong Funny sulfuric smeel.", "helpfulness": 4, "user": "Mary C", "date": "October 14, 2013", "id": 180878803}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Me and my 2 sisters (all in our 30's and 40's) visited OCT from Oct.11-15 for some getaway time from our husbands and kids. The unpaved road to the resort is treacherous with huge potholes!! Once we arrived at the resort, we were greeted with a welcome drink and checked in. We did not get the building or floor we requested and were disappointed because the resort was fairly empty when we arrived. Even though it was after 3:00 our room wasn't ready, so we had a short wait and grabbed a couple of cocktails which were made by a friendly bartender (Jose) at the lobby bar which is a nice place to sit and relax, even though it is not air conditioned. We were happy with our room but did not have an ocean view which was a disappointment. I had asked for a dehumidifier which was in our room when we arrived. The dehumidifier is definitely necessary as we needed to empty it several times each day. Our refrigerator was stocked daily as well as all the bathroom toiletries. We did tip our housekeeper and she was very grateful and accommodating.", "title": "Fun Time!!", "helpfulness": 7, "user": "travelreviewer", "date": "October 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 182464039}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Now for the best part of our vacation!! The entertainment staff!! This group of people, namely Raul (see you on Broadway one day!), Rodrigo, Jaime, Avy, Sylvi and Hugo work so hard and they made our trip a blast! From water aerobics to shot making lessons at the swim-up bar and all the crazy pool games and nightly shows, we couldn't have asked for a better group of entertainers. The knew us by name after a short period of time and they all felt like friends by the end of our short stay. We were sad to leave and say goodbye to all of them!", "title": "GREAT resort and EXCELLENT staff!", "helpfulness": 5, "user": "Josh C", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182379375}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We enjoyed hanging out by the pools during the day but were definitely disappointed with the beach. I have traveled extensively throughout Mexico and the Caribbean and this was the worst beach I've seen. It was even worse than what I was expecting after reading all the reviews. The water was never clear and was full of seaweed as well as some garbage. The water was warm but I never stayed in for any length of time. This would be the one thing that would keep me fro returning to this resort. We never had any issues finding chairs or umbrellas at either the pools or beach because the resort was fairly empty when we visited. We were lucky to have gorgeous weather while we were there and it was warm to hot with little humidity.", "title": "Ocean Coral& Turquesa Vacation", "helpfulness": 5, "user": "Bill B", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 182141236}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "As far as food and drinks are concerned, we were happy with the selections for the most part. We ate breakfast every morning at the indoors buffet which always had a nice selection of food and beverages. We were disappointed that the snack bars were never open when we were there, again because the resort was not very full I believe. We were able to grab sandwiches at the coffee bar and some snacks at the outdoor buffet during the day. The coffee shop is always a nice place to stop by for a hot beverage or a smoothie and some really good cookies. We tried most of the desserts there that were always presented nicely, but never found one we really liked. They do have free Wi-Fi there as well as in the lobby. For dinner, we ate at the crepe restaurant which was ok, the Japanese which we liked, Route 66 which was so-so and the Italian which was our favorite (we never made it to the Mexican restaurant). We were initially disappointed though to get to the Italian restaurant at 7:45 to be told there was no more room for the rest of the night. We did complain to one of the restaurant head waiters who miraculously found room for us!! This resort should take a lesson from some other resorts and should allow you to make some dinner reservations in advance so that there are fewer disappointed patrons! Drinks at the resort were well made and you can request some name brand liquors. The privileged guests have a better selection of alcohol which is not available to the rest. We didn't find it necessary to take the privileged route, though it might be helpful during the busy season.", "title": "Black Premium Service Exceptional!!", "helpfulness": 4, "user": "Mike J", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182032773}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "As far as the spa goes, both my sisters had massages which they thoroughly enjoyed. They will tell you they are running \"specials\" on certain treatments and that you should book early, but every day we heard them say the same thing to different guests. The same \"special\" deal is always available, but different workers will quote different prices, so be careful with their scam. The spa itself is very nice with whirlpools, a sauna and steam room. Just note, none of the whirlpools or Jacuzzis in the resort are hot or even warm. They are basically the same temperature as the pools.", "title": "Worst Experience Ever", "helpfulness": 6, "user": "paul s", "date": "October 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 181943603}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 282, "average": 608, "very good": 1479, "terrible": 192, "excellent": 2362}, "aka": "Ocean Coral And Turquesa", "slim_ranking": 0.304347826087, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}