{"user_rating": 3.5, "review_count": 63, "name": "Ocean Park Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We booked this hotel through Priceline and I was horrified when I read the commentaries on this site. We got a great deal for the Saturday night of Labor Day weekend. It was your average, old, run of the mill roadside motel. We had a decent room with older furnishings which could use some updating. But, it was clean and the bed wasn't something that I would complain about. The location of the hotel was great, right in the middle of the cape and close to restaurants, etc. You can also use the Sheraton's pool and other amenities which we didn't learn until we were at the hotel so didn't bother to bring our suits. The staff was very nice. I would recommend this hotel for those who are on a budget and aren't \"hotel snobs\" like my husband would call it.", "title": "Run of the Mill Road Side Motel", "helpfulness": 1, "user": "HMTY", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5778287, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We recently attended a wedding in Brewster, and upon recommendation of the wedding party, we booked the Ocean Park Inn. This is a seasonal motel run by the Four Points Sheraton which is next door. It would be an understatement to call this structure \"shabby\". We requested a non-smoking room. However, we were booked into a smoking room. Upon opening the door (which banged into the night table), we viewed a shoddy, smoky, disgusting sight. The room was dingy, dirty, and rug-stained. This was totally unacceptable to us. The desk clerk tried her best to be accommodating, however, she was totally overwhelmed. Believe it or not, there were no other non-smoking rooms available for her to switch us to. We were totally frustrated since we had booked this in March. Guests that had booked after us, were assigned to non-smoking rooms. I asked her to honor our request. As it turned out, she assigned us a room that would be ready late afternoon, however, it was my sister and brother-in-law's room who had booked at the same time as us. As a result of all this confusion and our frustration over the motel's condition, we asked her to check next door at the Sheraton to see if rooms were available there. The manager came over and was quite apologetic and was able to move the four of us next door to non-smoking rooms which were quite nice. Meanwhile, the other wedding guests that remained there stayed in musty, dirty, rooms where doorknobs fell off the doors, blankets were ripped, and there were other occupants beside \"humans\". Had we been unable to book rooms next door, we would have slept in the car!", "title": "Decrepit Motel", "helpfulness": 8, "user": "lgjdf'gjdg", "date": "August 12, 2006", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5602828, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "title": "Shabby motel", "text": "Booked here by internet - sounded a bit special! How wrong! It's just a run-down motel. Furniture dropping to bits, footmarks up the doors, paint peeling off, beds sag, shower moves from hot to cold all the time, carpet threadbare! Only high point was breakfast at next door Sheraton as part of bed and breakfast package. Feel web ad very misleading - \"boutique hotel\" / \"inn\", etc.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5466915}, {"rating": 3.0, "title": "Roadside Motel", "text": "We stayed Aug 8-10. First off, Eastham is not a very ritzy area, but that wasn't what we were looking for. All the lodging in this area appears to be the roadside motel variety, except for the Sheraton which is a little more upscale (but still not too fancy!).", "helpfulness": 7, "user": "Ohio-Brown-Eyed-Girl", "date": "August 21, 2005", "id": 3794524}, {"rating": 3.0, "title": "Comfortable and convenient motel", "text": "The plusses:", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 15, 2005", "id": 3556162}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Room 304. Perfect view of the ocean just steps from the hotel. Nothing better than the sounds and smell of the Pacific Ocean. Room was clean, bed very comfortable, bathroom clean and shower worked well. Breakfast in the morning is nice however if you want a full breakfast in the morning you can't beat the hotels location to great places to eat. All with in a few steps from the hotel. Great shopping also with in a short walk. Pool was clean. Hotel provides a great shower just inside the door off the boardwalk to get all the sand off. If you want to experience the beach life this is the place. It's not a high priced resort but it was exactly what my family needed for our San Diego get away.", "title": "Great place to stay!!!", "user": "Robert W", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172891470}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "I had stayed at this hotel in December of 2012 and wrote a rave review. I had not experienced any problems. Unfortunately, that did not hold true when I spent a week from July 17th to the 24th. The hotel itself was still the same...perfect location, very nice front desk staff, good breakfast and clean. Still needs some upgrading.", "title": "Disappointment", "helpfulness": 1, "user": "Sharon L", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 172429843}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The problems: Extremely rude maids. Noisy neighbors above us until all hours of the night, due to either not enough insulation or the lack of padding under the carpet to diffuse noises. Air conditioning system that was ridiculously hard to understand. Last but certainly not least.... a lack of concern or help from management!", "title": "Location To Die For", "helpfulness": 2, "user": "keelyandlou", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171989133}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The maid problem, as I was told from management, \"We are trying to keep the cost of the rooms down so we only hire minimal maids\". We were actually asked TWICE to leave our room so the maids could clean....because they only had 15 minutes before they went home...this was after we had been gone ALL day, came back and were trying to get ready for dinner! The maids were rude about it and so was the management. I personally would rather pay a few extra dollars so the maids had some flexibility in their time schedule.", "title": "Ocean Park Inn--fantastic place on Pacific Beach", "user": "Steve L", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171807305}, {"rating": 5.0, "title": "Perfect Vacation Spot", "text": "The air system was only 2 or 3 months old...we were told, by the maintenance man, that they had complaints everyday from other patrons about the system and they themselves were still trying to work out the kinks. We were told that the front desk should have \"tutored\" us in the use of the air...but that was never done!", "user": "Connie I", "date": "August 11, 2013", "id": 171750276}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "I've stayed at quite a few hotels in my days and this was so far the best ocean front. Easy vehicle access. (Not stuck valet only) they have a pool as well. Free breakfast. Very friendly staff. Just a great experience.", "title": "Pretty awesome", "helpfulness": 1, "user": "thebeachclub", "date": "August 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171406394}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "My wife and I had a great time. Our ocean view was excellent and we had easy access to the boardwalk and the beach from the hotel. All the restaurants were within walking distance and close by. I read some people were complaining about noise from the area night clubs. We had no issues with them. Also read complaints about transients. Transients are everywhere if you look for them. Again we had no issues. They kept to themselves. I would recommend this hotel and we plan on staying there again.", "title": "We will be back...", "helpfulness": 1, "user": "rrubyxsh", "date": "August 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 171322617}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Breath-taking views of the pier, pool, and ocean! Unbelievable! So relaxing, hotel staff was great and helpful at the front desk. They are so laid back here and relaxed! San Diego is so beautiful! This hotel was far better than what we thought, never had to leave. Bars, restaurants surround the hotel. Central location in Pacific Beach, everyone knows this hotel because of its location by everything. One block from Kono's Beach Cafe which is a must visit for breakfast! Eat out by the water and theyll bring your food to you! Line out the door the whole time they are open but worth it. Beach rentals one block away, bikes, chairs, umbrellas etc which we used on both beach days we had! Would not stay anywhere else in Pacific Beach, pool was amazing too! Drank here at the pool as they are very strict her with alcohol on the beach, saw several tickets being given by cops. They dont care if youre from out of town either. Easy though cause we just walked back and forth from beach to pool all day, no worries. Stay here! the extra money is worth it!", "title": "Awesome location!!", "user": "Zachary S", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171253650}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The couple days I stayed here were awesome! I love how lively the location was and wonderful the staff was. I especially appreciated Alexandra, she worked front desk, she was kind and assisted me with all my needs. Ill definitely will be coming back to stay there!!", "title": "Perfect vacation", "user": "Vacation_Mommy12", "date": "August 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171242843}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We love the location, staff and views. Every year we escape the heat of Phoenix and spend 4 nights in an Ocean View balcony room at Ocean Park Inn. Once we arrive we park the car and walk to shops, dining and it's great having the beach at your front door. The continental breakfast included has enough variety to satisfy us until dinner. The location is great, you can walk to the Green Flash, the Firehouse and World Famous restaurants. Also to the pier and watch the fishing. The staff is friendly and efficient, they even remembered us from last year. The pool is nice. We saw dolphins in the ocean. The only downside may be a long corrider to your room, if there is a walking issue mention you would like to be close to the elevator upon check in. The hotel is non smoking which is great. Fresh fruit is available in the lobby 24/7. Our room had a Mini fridge , close enough to walk to Starbucks, Ralphs grocery and CVS pharmacy. If you forget anything the CVS has a great variety of beach items and beer. It's very nice and we love going there. Bike rentals nearby. We could get cheaper hotels off the beach but that's why we visit San Diego, for the ocean to just watch, listen and relax.", "title": "We visit every summer and love it.", "helpfulness": 1, "user": "P M", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170768408}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We enjoy staying at the Ocean Park Inn. The hotel is very reasonably priced. The Customer Service is great. I highly recommend upgrading the room. This is a nice location, right on the beach. It is within walking distance of lots of places to eat. I love the parking.", "title": "Great service Nice Family Hotel", "helpfulness": 1, "user": "texasnice", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174529807}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My wife and I have been customers for many years and we are so happy the standards of cleanliness, nice furnishings, and great staff have remained intact. You can't beat the views and people watching from an ocean side balcony. Great proximity to the beach and dining spots. 5 stars from us! Thanks", "title": "Peaceful Times at Pacific Beach by Joe and Penny", "user": "J K", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173535368}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This is a charming small hotel in a fantastic location right on Pacific Beach. Very helpful staff, good breakfast, convenient to many restaurants and shops. Highly recommend! Recommend you book by calling the hotel directly to get the type of room you want. We paid less for an inside patio room without direct ocean view, but only had to step out onto the patio to see the ocean.", "title": "Lovely property, great location", "user": "slpastika", "date": "August 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 173535077}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I felt like the Ocean Park is a little secret! Situated right on the boardwalk. Loved running along the oversized, nicely paved boardwalk - lots of room to run despite other runners, bikers, skateboarders and walkers. Has great views of the ocean, beach and perfect for people watching. Very nice restaurants within walking distance (someone in our group was on crutches) and easy to grab a cab. Belmont Park was a nice little amusement park - very clean - with lots to do & just a quick cab ride away. Hotel fit our needs for a quick getaway & includes free breakfast. It is an older hotel but seems mostly updated and is clean. Helpful staff, too & gave us great suggestions for things to do.", "title": "Great location! Right on the boardwalk & overlooking the beach!", "user": "laurie w", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 173225437}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My husband and I have stayed here a number of times over the years and we keep coming back! Clean & comfortable rooms, super nice front desk staff and WOW.... the views are amazing. We splurged on an ocean front room and I have to say it was worth every penny we paid. I could lay in bed and watch the ocean waves... does life get any better? Nope. Parking is so convient and totally worth the nightly fee in my opinion. Continental breakfast was included and we found the offerings more than met our needs. I highly recommend this property.", "title": "Awesome Relaxing Stay - This property is a winner!", "user": "danamarie", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173210272}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We paid alot of money for a 90.00 room. The hotel smelled old, the parking garage is small and tight spaces. Luggage racks are nosey and wobbly. We had 3 people in our room they would only give us 2 beach towels. The only good thing about this place is the staff, and I imagine they are under paid. Over all I'm not impressed at all with this place. I don't mind paying good money for a room, but I will not come back here.", "title": "review", "helpfulness": 1, "user": "Ralph D", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 170057064}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had a great experience at the Ocean Park Inn! The front desk and other employees very friendly and helpful. Our room was amazing...overlooking the ocean. The place was clean and roomy. Fit our family of five comfortably. The parking garage was tall enough for our 8 foot conversion van (Parking is difficult to find in PB), and we could lock our bikes in the garage, as well. Good continental breakfast. Nice heated pool and spa. Pacific Beach/Mission Beach has everything you need on a beach vacation; surf, sand, boardwalk, biking, shops, restaurants, Belmont amusement park, Crystal Pier, Mission Bay and more. We would love to stay longer next time, but of course, staying on the beach isn't cheap. We got a decent deal and were able to book this room for three nights in the middle of the summer, which is difficult to find without making reservations far in advance.", "title": "Awesome place to stay on the beach!", "user": "Stacey D", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170043238}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great location right on the boardwalk and ocean. The room itself was a little dated, but we didn't spend too much time there. The hotel staff was helpful, the pool was nice, and parking was reasonably priced. The free breakfast was good, but somewhat crowded. There is a grocery store within easy walking distance.", "title": "Nice location", "user": "a2kNE", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169988187}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The staff is great - very friendly and helpful. I paid $370 per night for my room (reservations directly with the hotel), so based on the price and other reviews, I expected a pretty nice room. I thought it was pretty dumpy. There was obvious prior water damage on the walls and ceiling, which was poorly repaired. The carpet was old and felt dirty. I made sure to wear flip flops or socks in the room. The bed was extremely hard, so I did not sleep well and woke with a sore back. The whole room, including the bathroom, was painted a dark blue-green. I did enjoy the balcony. Not sure whether to give the hotel a 2 or 3.", "title": "Really????", "user": "Josh0318", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 169159940}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I did not partake in much of the breakfast which consisted of a waffle station, hard boiled eggs, pastries and cereal. They did have amazing apples, oranges, peaches and plums.", "title": "Excellent hotel with great ocean view", "user": "Louis K", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169079652}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 15, "very good": 16, "terrible": 13, "excellent": 16}, "aka": "Ocean Park Hotel", "slim_ranking": 0.888888888889, "description": "The Ocean Park Inn is a family boutique hotel on Cape Cod that delivers all the services and features of a deluxe hotel. Adjacent to the Cape Cod National Seashore, you'll enjoy direct access to beaches, ocean, ponds, bike trails, tennis courts, pools, golf courses and Martha's Vineyard ferries."}