{"user_rating": 4.0, "review_count": 326, "name": "Ockenden Manor Hotel & Spa", "reviews": [{"rating": 3.0, "title": "Nice hotel but couple of niggles", "text": "I checked into the hotel for a child free break and to relax and unwind. When I arrived the hotel had lost my booking and had no record of me staying even through I had conformation email and they had taken my deposit, as a result I didn't get the feature room I had booked and they put me in a suite. lucky the hotel wasn't fully booked or I would be writing a different review!", "helpfulness": 1, "user": "nancy_clarke", "date": "November 16, 2013", "id": 184861276}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "All the rooms are named and I stayed in the Merrick Room: The suite was a large size with a separate living room and balcony looking over fields, there was no TV in the bedroom which is ok but I do like to relax and watch TV in bed in the mornings. The bed was a double with firm mattress.", "title": "We checked out", "user": "Sarah T", "date": "November 12, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 184474557}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "the bathroom was disappointing, the shower is over the bath and you can't stand up in it as the ceiling is too low, the shower is also not powerful and more like a light rain. This was the biggest niggle for me as I love a good shower and one of the main reasons I booked the feature room was because it had a walk in shower and the suites don't.", "title": "Dirty bath", "helpfulness": 3, "user": "Godlessiop", "date": "November 6, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 183709966}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The bathroom could also do with a good clean as mould round the bottom corners.", "title": "Fabulous stay and amazing restaurant experience", "user": "Jantwickers", "date": "November 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183572593}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Breakfast was lovely and cooked fresh to order.", "title": "Just perfect! Must return.", "user": "WorldTraveler20c", "date": "November 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183283103}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "My husband and I and two close friends have just spent a very enjoyable New Year's Eve at this hotel. We arrived early afternoon and after checking in we all went over to the Spa for a swim. It's a very modern building and houses an excellent pool which joins with an outside pool. It was amazing to swim and use the outside hot tub with the rain lashing down all around us!", "title": "Wonderful food and spa but tired room", "user": "Speges", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 189316928}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Our room was called Rose, a superior room, and was at the top of the house. It was a nice room but there is 'rustic old' and just OLD! The carpet had a hole in it and had been covered by a very rough mat. My husband had to put a towel on the floor by his side of the bed as it was so uncomfortable to stand on! The two small armchairs were worn through on the arms. The bed was very squeaky and not very comfortable. From the window the roof looked in a very bad way with plants growing on it and the gutters were full to the brim with debris. The hotel is in need of a huge renovation job. Eventually people won't want to pay the high price to stay at the hotel if it's not kept up to standard. When/if you do renovation work please put in better lighting and mirrors. Trying to dry hair and put on make-up was a nightmare!", "title": "Still waiting for ketchup", "user": "Karen W", "date": "December 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 189058729}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The meal we had in the restaurant was superb and the service was excellent. The downstairs public rooms are very nice. It's a shame the rest of the property isn't kept up to such a high level.", "title": "Family Christmas", "user": "David T", "date": "December 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188916823}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Thank you.", "title": "Don't forget anything as you'll never get it back!", "user": "gummy_bear2012", "date": "December 28, 2013", "detail_rating": {"value": 1.0}, "id": 188797107}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "To say I was very disappointed with this hotel, would be an understatement. First impressions were not good as it is very badly sign posted so, we eventually found the entrance to the hotel more by chance. Entering the hotel the reception desk was unmanned so we had to wait to check in.", "title": "An annual festive season return", "user": "TexPemberton", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188046849}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I am a member of the spa and also eat and stay at the hotel regularly. The spa is enjoyable in all seasons and the staff there are exceptional. They will bring you a glass of bubbly in the outdoor hot tub. You can stay in one of the four spa rooms, they look amazing although I've not stayed in one. The rooms in the hotel are more quaint and quirky, but very comftable. The food in the Michelin starred restaurant is outstanding with an affordable wine list.", "title": "Fabulous food", "user": "Lorraine R", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 187794565}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We enjoyed a one night stay on a Saturday evening. The hotel was busy at all times with the restaurant being a major draw. We enjoyed exceptional quality food both for dinner on Saturday evening and again for lunch on Sunday. The menu for dinner had a number of fish dishes which rather limited my personal choice although I was perfectly satisfied with what was left. The desserts and the selection of breads were exceptional. The size of the portions were modest and we left feeling satiated without the awful feeling of being stuffed. The wine list was manageable without being overwhelming and it displayed a good range of wines and price bands. The breakfast, while still good, was not as exciting or as aesthetically pleasing. An omelette would make a tempting addition to the breakfast menu. At all times the service was of a high standard; friendly, polite and professional.", "title": "Superb food, service and spa", "user": "Conlan_Rose", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 187206255}, {"rating": 4.0, "title": "Great stay, great service", "text": "The bar was small and cosy with oak panelling and an open fire. There is a larger, brighter, more luxuriant lounge to enjoy after-dinner coffee or the Sunday morning papers. WI FI was free and accessible in the bedrooms as well as the public spaces.", "user": "Carrie_barca", "date": "December 8, 2013", "id": 187107077}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "We stayed in a ground floor superior double (Edward). It was a corner room with pleasant views to both sides over fields and gardens. It was relatively quiet. No noise from above, but the fire door just outside our room gave a noisy bang whenever anyone went through it. A quiet-closing fixture and proper seals/sound proofing on bedroom doors would minimise this problem. Temple Spa toiletries provided. The hotel is an old manor house and the furnishings are sympathetic to this era and it is not spoilt by trying to over-modernise it. Despite the chill outside, the hotel was warm and cosy at all times.", "title": "Unusual old building, with good , professional service", "user": "bladesman77", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186758490}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Parking was difficult as much of the car park was being resurfaced and therefore spaces limited and on uneven ground. However, this would only be temporary.", "title": "Lovely getaway in the Sussex countryside: tradition meets modern with great results", "user": "Fcem", "date": "December 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186651249}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Friendly staff, great rooms, superb food and the spa is fantastic.", "title": "You pay for what you get and this is quality,", "user": "Mike N", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186575319}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We stayed on a Saturday night to have he taster menu.", "title": "Great food and service", "user": "Keith C", "date": "November 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 185495097}, {"rating": 4.0, "title": "A great girlie getaway", "text": "They kindly upgraded us and we used the spa on Saturday afternoon. The gym equipment is good and the spa (sauna, pool etc) is superb. We sat in the outside hop tub and had glass of champagne.", "user": "A TripAdvisor user", "date": "November 20, 2013", "id": 185267647}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Dinner was fantastic as you would expect. We had a bottle of wine that was reasonably priced and followed this with a port and dessert wine for the cheese and desert course. The staff were happy to recommend what to drink to accompany the food.", "title": "Good, but more attention to detail needed", "helpfulness": 1, "user": "Lou_227", "date": "November 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185230195}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Breakfast was good and we used the spa again even though we had checked out.", "title": "Short stay at Ockenden Manor", "user": "TheDivingFoodie", "date": "November 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 184979488}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 39, "very good": 91, "terrible": 7, "excellent": 168}, "aka": "Ockenden Manor Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}