{"user_rating": 3.5, "review_count": 293, "name": "Ocotal Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "I was surprised how nice this place was after reading mediocre reviews here. The property is landscaped nicely - it is on a hillside with different levels of single story accommodations along the rather steep incline.", "title": "Beautiful Resort", "helpfulness": 3, "user": "Tomcod", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23497956, "likes": {"liked": "— Good security, lots of wildlife, and easy access to sport fishing boats.", "disliked": "— Nearby Coco beach has a lot of undesireble characters - be careful there."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We stayed at the beach level rooms - because they were the least expensive, but it turns out, they were the best. We could just step out our patio door to a pretty lawn and the beach.", "title": "Beautiful Views (but not much else!)", "user": "CTownian", "date": "January 8, 2009", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 23365895, "likes": {"liked": "— The view / setting and the wildlife", "disliked": "— The accommodation - the standard rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The beach here is not a surfing beach - no waves. There is some snorkeling you can do near the rocks.", "title": "Stay Away From Ocotal Beach Resort", "user": "sjfsurfrat", "date": "January 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 23293605, "likes": {"liked": "— At least the AC worked.", "disliked": "— Showers, beds, food."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The hillside could be tiresome for people who don't have a car. But, we had a rental car and simply drove up to the top for breakfast (included) every morning.", "title": "Thankfully we were only booked in for one night!", "user": "Natita46", "date": "November 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 22143111, "likes": {"liked": "— Getting out of there", "disliked": "— The bathroom and feeling ripped off."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Dinner is expensive, but very good. If you want to save some money go to Father Rooster - a short walk down the beach. Father Rooster is actually easier to get to than the Hotel dining room - at least from my beachfront room.", "title": "Mixed review", "user": "Bugsyboat", "date": "November 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 22062978, "likes": {"liked": "— Views, Breakfast", "disliked": "— Shabby bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "We just returned from a week at the Ocotal Beach Resort in the Guanacaste region of Costa Rica (NW coast). Costa Rica was magical and the resort was very enjoyable. We stayed in a \"junior bungalow suite with private pool\" and found the room very enjoyable. We had our friends staying in the adjoining room (all junior bungalows are duplexes) and that made enjoying the private pool enjoyable. I think it could be awkward if you did not know the folks in the other side of the duplex. If you are in that situation, the suites in the 400 level should be perfect for you because they are close to the infinity pool. The rooms were huge and the beds and linens were nice. The mini fridge simply does not hold enough beer though . . . . The plunge pool was in great shape and was very refreshing after our scuba diving excursions. The view was excellent and it was close to the restaurant. The downside was the steep hills at the resort. It was no big deal to us, but if you are older or out of shape, I don't think this is the resort for you.", "title": "Fun in Ocotal Beach Resort and with Avispas Adventures!!!", "helpfulness": 1, "user": "AdventureJimbo", "date": "August 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18625189, "likes": {"liked": "— Nice rooms and great views", "disliked": "— Steep hills and lackluster restaurant service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The food - breakfast was great, but everything else was average at best. Service was lackluster and prices were higher than we expected. Nearby Father Rooster's was a great alternative, wonderful atmosphere and excellent food. Restaurants in Playas de Coco were close and enjoyable as well.", "title": "Great Location, Could Use Some Work", "user": "beartrax79", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 18572822, "likes": {"liked": "— Views, Location to Beach, Dvie Shop on site, Pools everywhere", "disliked": "— Rooms are in need of some TLC"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Ocotal Beach Resort ive shop manager Marianna accomodated our every request. The diving was nice, but not stellar. Viz was terrible (10-20 feet) and the trip to Bat Islands yielded two bull sharks and no mantas. Oh well, the dive shop has no control over the fish!! We dove with the resort on one day and with Summer Salt Dive Center on three other occasions. Summer Salt has a nice small operation and were extremely accomodating to everything we wanted. Patrick runs the show, but be sure to ask for DiveMaster Rolbin and Captain Juan Carlos to lead your day. A cautionary note, if you are planning on diving while at the resort, you need to have reservations long before you arrive!!!! The resorts boats were practically full when we realized we need reservations - Marianna took care of us, but I sweated bullets until everything was resolved.", "title": "Worst Hotel of our honeymoon!! 2* hotel charging 5* prices!", "helpfulness": 1, "user": "PaganGirl", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 17932614, "likes": {"liked": "— The only good things about this resort are the beach and the views", "disliked": "— Dirty, Shabby, Old, Small Rooms, Noisy Rooms, Poorly Maintained"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "The best part of the trip was the adventure tours on land. For that we have Amy and her Avispas Adventures tour company to thank. Avispas was nothing short of fantastic. The \"Miravalles Adventure\" sent us zipping on a canopy tour, houseback riding, hiking, and bathing in volcanic mud. They then took us surfing in Tamarindo and on a 4-wheel ATV tour in the afternoon. Later they took us on a white water rafting tour. Each of their tour leaders was excellent (be sure to ask for Roy to lead your Miravalles tour) and their drivers were as well. Guillermo was great (his pics of his son Andres were priceless) and Jose was a fountain of information on the way to the white water rafting trip. Avispas is lead by Amy who was readily accessible via e-mail or cell. She was incredibly helpful in getting our trips scheduled when we wanted them. If you take a trip to this region and don't turn to Amy and Avispas Adventures, you have made a tremendous mistake.", "title": "Beautiful scenery, horrible fishing services", "helpfulness": 1, "user": "MGaction", "date": "June 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 16981393, "likes": {"liked": "— Scenery", "disliked": "— Poor fishing operations"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Jim and Kristina", "title": "Best Sunsets, Nice Staff", "helpfulness": 2, "user": "Norrell4", "date": "April 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14783969, "likes": {"liked": "— The Views!", "disliked": "— Driving through Town"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "After reading one of the negative posts I figured I put my 2 cents in. 1st of all, the ride from and to the airport is around 30 minutes. The rooms do show their age however with patios that overlook the beech or cliffs why would you hang in your room. The hot water, ac worked, the room and sheets were clean. The views were amazing as well as the sunsets. There's a pool right by the beech as well as a fresh water shower to wash off if you do go to the beech. If you stay up top there are pools and Jacuzzi’s. As far as the walk up and down the hill, it is a little bit of a pain, however they offer a shuttle up and down if you ask. The walk up the path on the beech side that go’s up the side of the cliff is easier than going up the Road to the resort which is steeper. You can get food either at the beech pool or the Hotel restaurant which has a nice patio area over looking the ocean. In my opinion, for where it is and what you pay for the room prices, it's worth it.", "title": "Great sunsets", "helpfulness": 1, "user": "trav3lor", "date": "March 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14551797, "likes": {"liked": "— The views and the top side pools"}}, {"rating": 4.0, "title": "Overall, excellent!", "text": "Oh and as for it being dry....It's the DRY SEASON! It's the way nature works, if it wasn't the dry season everything would be green. If you want to see green during the dry season, stay in Arenal and Monteverde. (Elevation clounds and moisture)", "helpfulness": 3, "user": "monamehta21", "date": "March 11, 2008", "id": 14211080, "likes": {"liked": "— location, beach, wildlife", "disliked": "— prices"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I stayed at the Ocotal Beach resort for one night after landing in Liberia. I arrived around 8 pm and had no problems checking in. The front desk staff was friendly and fluent. Transportation is provided for you, to your room and back (the rooms are all on a pretty steep hill). When I got to my room, I immediately noticed that it was in desperate need of a renovation. Some of the tiles were cracking, the sink had rust, and the corners were dirty. Besides the age associated faults, the room was clean and had very high ceilings, giving it a spacious feel. The landscaping outside of the room was very nice, giving it a very tropical ambiance. Now here is the best part; the view from my patio. Phenomenal..I had a shallow beach full of small boats, and mountains in the background about 100 feet away from my bed. It was breathtaking, especially in the morning. At night you could hear the waves crashing just outside your doors, and it was cool enough that I slept with my glass doors open. In the morning, I walked out to the beach from our patio, and then hiked up the trail to the top of the hill for breakfast. The view from the top is also breathtaking. (see pictures). Breakfast was great (included in the room rate), and was buffet style. Dinner the night before was also very good, but expensive by Costa Rican standards. The tour desk is NOT very helpful, I had to find out what tours were available by my own methods and present it to the desk so he could book it for me. Try to have a good idea of what you want to do before you get there, because the tour desk will not give you many options. There are several pools on the property that are also great. If you are traveling to Arenal, or La fortuna from this resort, make sure to ask about the transportation they provide (much cheaper and quicker). Mr Patel (the owner of the resort) was present during my stay, and was very helpful as well. Overall, excellent choice, beautiful views, and non-touristy. A little off the beaten track as far as resorts go. Oh by the way, lots of wildlife on the property as well, so bring your camera to breakfast.", "title": "perfect in every way", "helpfulness": 1, "user": "debsol", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14171639, "likes": {"liked": "— it was so beautiful, well maintained", "disliked": "— they do not have much american money on hand at thre hotel-don't bring travelers checks and expect american money"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "To the staff at ocotol. I have never written a testimonial before but do want other travelers to know just how perfect your hotel is. We ( 7 of us) my son who surfs, my daughter and her husband who are avid fisherman and my brother his wife and son who snorkel all met from different parts of the country to vacation together for a week. From my on line research it seemed I could make everyone happy here as it looked like they could do all their activities. It was exactly that- PERFECT ! First of all the setting built into the side of a cliff is breathtaking. The grounds are beautiful and everywhere you look there is another pool-all different shapes and sizes .Although there is a lot of walking up and down hills-for those who wish a ride, the shuttle bus is a minute away .The restaurant where the buffet breakfast is served sits at the top of the cliff overlooking the cove and private beach .If you want to fish-just go down to the hotel beach where the boats are in the cove, same for snorkeling ( or snorkel off the beach) Dinner is served in the same beautiful spot and we all agreed the food was outrageous!!!!!. One of the chef’s is Asian and he adds that flair to the dishes which are a work of art when they appear. We fished four days as it was so awesome and the chef prepared the various catches for us for dinner each night .When my daughter caught 130 pound sailfish I knew she would remember this trip forever. The staff of the hotel could not be more helpful or pleasant .We stayed in the rooms on the top level with the infinity pool three steps away.If you are thinking about booking this hotel-just do it !!!", "title": "Shows its age", "user": "gtd068a", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14072507, "likes": {"liked": "— View from the restaurant", "disliked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Debby Solomon ( a very happy mother)", "title": "Very nice small resort", "helpfulness": 6, "user": "Rodney B", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10951033, "likes": {"liked": "— Pools, beach and quiet at night!", "disliked": "— The steep hike to breakfast, never used their shuttle!"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Our stay was OK at this hotel yet needs a bit of a renovation in the rooms and some facilities yet the service was very good as always in Costa Rica. During our recent stay we experienced a terrible surprise when we came back from dinner at nearby town. We still do not know whom but someone entered our room and took our Iphone, ipod and two digital cameras. Surprinsingly for us they did not took other valuables yet the experience was really frustrating as there seems to be no way to get the iphone back which had all my business contacts plus personal data. For a hotel that supposedly has total security when you come in and out of the premises this is very alarming as it seems it was someone from within. Also alarming is to know that whomever came into our room was well informed as they came in just after we left the premises to town as we came back to the room just 1 hour and a half later and it had happened already.", "title": "Watch out your personal belongings at this property", "helpfulness": 3, "user": "GMB40", "date": "November 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 21745582, "likes": {"liked": "— proximity to fishing area", "disliked": "— security"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Watch out for your personal belongings at all times at this location.", "title": "Wow! Super resort and diving", "user": "mhdiver", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 21677082, "likes": {"liked": "— The location", "disliked": "— Climbing the big hills!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "What a great place to vacation! I came with my family for a get together and we were very pleased with the location and food. Although the rooms are not brand new, the location, the views, and the wildlife were very special. (Iguanas and curious raccoons outside your room, and humpback whales swimming offshore from the restaurant!) Far superior to anything in the Coco area. I'll take a great location and jacuzzi overlooking the cliffs at sunset, over a newly remodeled bathroom any day.", "title": "Excellent experience at Ocotal Beach Resort", "helpfulness": 1, "user": "iceskater28", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18900182, "likes": {"liked": "— setting", "disliked": "— location of the splash pool"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We were diving with their resort shop and they were VERY professional and polite. Plus they knew the dive sites very well and gave thorough dive briefings. (something I haven't heard in a while)", "title": "Stunning view with not much else", "helpfulness": 2, "user": "CRtravelsLosAngeles", "date": "August 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 18827596, "likes": {"liked": "— View", "disliked": "— old and worn out rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I've been diving for about 20 years and all over the world and our trip to Bat island was one of the best ever. Huge Bull sharks swimming in and out of our group! Octopus and morey eels blanketing the rocks. Trevally and other pelagics coming in at out of the open ocean! Simply great! A \"Must see\" on any serious divers list...", "title": "Ocotal Beach resort", "helpfulness": 2, "user": "dwp512", "date": "August 9, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 18786212}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Playa Ocotal"}, "stars": 3.5, "variance": {"poor": 56, "average": 50, "very good": 92, "terrible": 28, "excellent": 67}, "aka": "Ocotal Beach Hotel Playas Del Coco", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}}