{"user_rating": 3.5, "review_count": 190, "name": "Off Soho Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "When we first drove down Rivington Street we all were a little concerned with what was awaiting us, especially myself who booked the accommodation for me and two friends (one male, one female) to celebrate my 30th. However, Rivington Street is a loooong street and the suites are at the nicer end. We arrived on Thanksgiving and were pleased to see a friendly face behind reception. This set the standard of the service throughout our five night stay, not at all intrusive, very relaxed but more than happy to offer advice and help when needed. Our room was on the 2nd floor, very clean, comfortable and big enough for three. The only thing it could of benefitted from was more storage for clothing, there were not enough hangers and we all ended up living out of our suitcases. The room was incredibly warm and cosy which was welcomed after the coldness of the days out, just remember that when you are putting on the layers!! We had no problems celebrating my birthday with a few friends from NYC in the room before heading out. They had storage for baggage on our last day which was most useful.", "title": "Provided all we needed in a simple manor and let us see a real NYC", "user": "NotoriousHAG", "date": "December 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88864699}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The area immediatly around the accommodation is not an indication of what is on offer nearby so dont be put off, what looks like bordered up and closed shops all came alive after the thanksgiving break and we were across the road from the cool and quirky designer area of Soho, a 10 min walk from Little Italy and a nice 5-10 min walk from the nearest subway for access to uptown and downtown. Once we got our bearings we felt really comfortable, safe and happy with our choice o accommodation. Take time to look into local shops and eateries, and Broadway East is all but a 10 min walk with highstreet shops, bars and restaurants! Thoroughly enjoyed our stay, simple accommodation but safe, welcoming and great value.", "title": "Huge letdown", "helpfulness": 1, "user": "kernbil", "date": "December 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 88741316}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I brought my twins for their first trip to NYC for their Sweet Sixteen. I was aware that we booked a hotel a little off the beaten path, but the website made it appear cozy, if not luxurious, so I was ready for an average place. The street it's on is a disappointment, but we could overlook that, as it's convenient to Canal St. where we wanted to shop. We arrived @ 3pm, and was sent to our room with keys. The maid had just begun cleaning, and it was filthy, we had to step over bedding and such to put our luggage down. Spoke to the front desk to tell them, and they said \"oh, it's ok\" ( really? not ok with ME!) We got back and the bedroom that was advertised with two queens, had two twins, no TV and no bureaus. We asked for a cot ( I had 3 teens with me) had to ask twice. I slept in the pull out, in the living area..........literally it's a wooden board with maybe a 1/2\" padding, like sleeping on the floor. No sleep for me, and a 4:30 am a rowdy crowd made it impossible to try any further. Upon asking for another cot so I could maybe sleep one night, they sent a maid with bedspreads for padding. Back to the front desk, and told him, he called the maid stupid. The help seems afraid of the managers, sad. He told me to follow him to the basement ( after me literally begging) and pointed to a cot that was folded, and said \" here, take this, hurry, I don't want a headache\" I had to wheel it to my room on the second floor, but at this point I was grateful. After the first night I had to have someone come sweep the girls bedroom because my daughter got glass in her foot, and fine shards were everywhere on the floor. I had to wipe grimy finger prints off of stained walls. Light bulbs were out, and it's really outdated.", "title": "Met my average expectations", "helpfulness": 1, "user": "Bigcityeater", "date": "November 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 88458654}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Next day, no maid service, but she had taken our towels, and not replaced them. Had to call front desk again. Also asked if they provided tissues..nope. No ammonites at all. This was a huge letdown, and I would never recommend staying here.", "title": "If you want to feel like you're in New York, stay here", "helpfulness": 3, "user": "sbendpassport", "date": "November 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 86793379}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Given the reviews i was not expecting a lot and the hotel did match my expectations. The reason we chose the hotel was because it was located a couple of blocks from where we were meeting a group of people but the area especially Rivington street itself is not that nice. We had a \"Suite\" and the bedroom itself was sparse with no TV. On the bright side the bed was comfortable and the front desk staff was pleasant but would probably not stay here again.", "title": "Pleasant change from Hotel rooms", "user": "carpetking5432", "date": "November 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 86634511}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "As many other reviews pointed out, the expectation before arrival is a nice cheap hotel in a decent area. We arrived on a sketchy small street with an out of place hotel right across from a run down warehouse. DO NOT GO TO THIS HOTEL. The relative (It really isn't ) cheaper hotel cost really isn't worth it. The clerk is rude and always make excuses about not giving you the service you ask for, and is overall an unhelpful person. The hotel has nice pictures in their websites, but be warned, those clearly doesn't accurately reflect what the rooms are and the quality of it.", "title": "Terrible Everything", "helpfulness": 4, "user": "dradow", "date": "May 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 109741319}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed one night at Off Soho Suites, with our three kids, ages 5, 12 and 16. We were given a dank room on the ground floor, with the excuse that the extra bed we'd ordered could not be delivered to an upper floor. Perhaps rooms on higher floors are nicer, but I will never go back to find out.", "title": "Skanky - Never Again!", "helpfulness": 3, "user": "NYCtoPDX", "date": "April 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 105801086}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The entire place felt run-down and un-cared-for. Ceiling fixtures hung from rough, un-patched holes in the sheetrock. Our room was dirty - floors had a residue of dirt and dust that ruled out walking barefoot. Let's just say the bathroom was not a place one wanted to linger. When you don't even want to touch the toiletries provided, you know there's something wrong.", "title": "Shhh.... Please keep this one a secret.", "helpfulness": 2, "user": "DeRouge", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 94442580}, {"rating": 1.0, "title": "Worst hotel on the planet", "text": "The final straw was finding ants in the bed when I woke up.", "helpfulness": 3, "user": "wsimmsw", "date": "January 24, 2011", "id": 94300782}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Including the extra bed charge and taxes, this room came to over $400 a night. What a rip-off.", "title": "NYC is about the people", "helpfulness": 2, "user": "WhenWeTravel", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89130406}, {"rating": 3.0, "title": "Great Location but Beauty is in the Eye of the Beholder", "text": "I will give you a decent perspective on this hotel. I like it - didn't love it. My wife hated it.. We both love the location.", "user": "Highclasslowrent", "date": "December 5, 2011", "id": 121416575}, {"rating": 2.0, "title": "a step above a hostel -- but only a step", "text": "We stayed here as the price was right. The suites are not much different from the one bedroom aprtments our friends had in Manhattan just after college. Unfortunately, we have grown beyond that.", "user": "FAMILY44444", "date": "October 17, 2011", "id": 119403913}, {"rating": 4.0, "title": "Like having a grumpy landlord!", "text": "Clean", "user": "CaptainOver", "date": "October 10, 2011", "id": 119140873}, {"rating": 5.0, "title": "Exactly what you need in NYC!", "text": "me: Yes", "user": "Emmavan", "date": "October 5, 2011", "id": 118981134}, {"rating": 3.0, "title": "Not the best, but nice location and the room was ok for the price", "text": "Wife: yes", "user": "Canadian09876", "date": "September 12, 2011", "id": 117991289}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Our family enjoyed our stay at Off Soho. The suite was clean and roomy enough for four adults.", "title": "reasonably priced stay", "helpfulness": 1, "user": "Sharon G", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 117793080}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The staff was exceptionally friendly,pleasant and helpful.", "title": "nice and roomy for the price", "user": "Tessington", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116889596}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "The hotel was convenient to Chinatown, Little Italy,Soho and St. Marks place and an easy subway ride to other areas of the city.", "title": "THE BEST HOTEL IN NEW YORK CITY", "helpfulness": 1, "user": "HarryL32823", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116861807}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "My only \"complaint\" was the mattress on the pull out sofa bed. This was a bit thin and lumpy and could use an upgrade. The kitchenette could have used a coffeemaker too.", "title": "Good value, fantastic location!!", "user": "Spirella", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116291908}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "on a vibrant street in a colourful but pretty safe area. Nice and clean. large apartment. Air con pretty noisy but you could sleep through it. Lovely bathroom.", "title": "Fine if not spending a lot of time in hotel-courteous and helpful staff", "user": "JoeyUpstateNY", "date": "June 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 114838486}], "location": {"country": "United States", "city": "New York City"}, "stars": 2, "variance": {"poor": 17, "average": 33, "very good": 86, "terrible": 13, "excellent": 41}, "aka": "Off Soho Hotel New York City", "slim_ranking": 0.690744920993, "description": "Downtown All-Suite Hotel with European flavor & within walking distance of Little Italy, Chinatown, Soho & Financial District."}