{"user_rating": 3.5, "review_count": 1240, "name": "Ohana Waikiki West", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "I have been reading these reviews for a while prior to my Hawaii trip that just concluded. I knew they were mixed but this place seemed to have the better reviews.", "title": "Very pleasantly surprised!", "helpfulness": 18, "user": "Chris Y", "date": "February 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3168237}, {"rating": 3.0, "title": "Clean and Comfortable", "text": "Just returned from a trip to Oahu and the Big Island. I stayed a total of six nights at the Ohana West. The place was really nice!! A definite upgrade from Ohana Reef towers which was the dump I stayed at before. My first three nights I stayed in a city view Kitchenette facing Kuhio street. They actually upgraded me at no charge since I could not get a non-smoking room. The room was nicely re-done with new bathroom fixtures, paint and trim. I didn't smell any smoke. Nice big shower and bath! The room was facing the street but I couldn't hear any noise with the door closed. The pool was really cool! It's on the second floor with a pool deck facing the street. Nice bar there that is always busy. Some young girls run the bar and it's usually busy. I came back and stayed three more nights in the same type of room but in the back of the hotel this time. It was also nice and newly renovated with a bigger bathroom.", "helpfulness": 13, "user": "Bugsy66", "date": "January 30, 2005", "id": 3098953}, {"rating": 5.0, "title": "Nine out of Ten", "text": "My stay was very good. You'd think this is a four star hotel. Only problems were the front desk computer going down once delaying my check in and the airport van was late arriving at the hotel but that was due to the incompetent van driver. Elevators weren't a problem for me. There is three or four of them and they only slow down during peak hours. I was on the fourth then third floor so I mostly took the stairs.", "helpfulness": 10, "user": "JJ2005", "date": "January 29, 2005", "id": 3098536}, {"rating": 2.0, "title": "Very Noisy", "text": "I'd definitely stay here again.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 17, 2005", "id": 3013536}, {"rating": 3.0, "title": "Affordable, Clean, Convenient", "text": "We just returned from Oahu and stayed at the Ohana Waikiki West. I was a bit leary of this place due to the comments by many. From our experience it was quite basic. Clean comfortable rooms. The staff was very friendly and the room was exactly what I thought it would be.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 14, 2005", "id": 3008050}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "For a bargain/3 star hotel this was great. Parking was very tight and elevators a little slow at busy times, but nothing awful. Our room was very clean and the staff was very polite. My whole group stayed here in 4 seperate rooms and no one had any complaints. A friend even slipped the front desk an extra $20 and got a penthouse room.", "title": "Great bargain", "helpfulness": 13, "user": "supabrat", "date": "June 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5352547}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "I stayed here last year for 1 week. Good price for a central location. No point staying near the beach, the beach was so crowded. The other beaches around the island are way better. I would recommend this hotel if you want somewhere central and affordable. I would stay here again.", "title": "Love it", "helpfulness": 12, "user": "jade y", "date": "June 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5291833}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "This place was a nightmare. I went ahead and booked despite some warnings on this website. Our room was very dirty - gum on the carpet with other stains, as well as disgustingly filthy bedspreads. The bathroom was rusty and we had to hold down the toilet handle to force it to flush while it tried to push itself back up. Basicly, the only reason I'd go back would be if I was planning on partying hard and just needing a bed. We left early and stayed at a nicer place. Also we called the travel agent and recommended they change it to a half or one star rating. If you have kids - this is not the place. There were lots of partiers. I've stayed in hostels cleaner than this.", "title": "TERRIBLE!", "helpfulness": 8, "user": "Julian33", "date": "May 23, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 5191993}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We stayed in this hotel on 05/14/06 and 05/15/06 and was concerned based on some of the reviews but took a chance due to price and location.", "title": "Worth the price - IMHO", "helpfulness": 12, "user": "mahoneycutt", "date": "May 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5192093}, {"rating": 3.0, "title": "Great location", "text": "First, the less than ideal: $15 a night parking fee, *very* tight parking spaces in the garage, no view (none promised).", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 12, 2006", "id": 5064743}, {"rating": 3.0, "title": "Great for the money/families", "text": "This hotel is great for the money. There is 4 of us. Nice having a kitchenett , especially with the kids. Nothing fancy but it was clean. The staff are friendly. Everything is close within walking distance, about 2 blocks from ocean. Not alot for the kids to do in the hotel but swim, example, no arcade in hotel but there is one just across the street, a bit pricey. They were working on the hotel the whole time we were there by the pool so it was noisy with workers and then the day before we left they had blocked off the pool so they could work. Inconvenient. We would stay here again though.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 12, 2005", "id": 3180819}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Stayed at the Ohana West from 1/22-1/29/05, was pleasantly surprised after reading many mixed reviews. We had a city/mountain view, king room, on the 16th floor with a nice size lanai, the room was a little small, but clean and comfortable. The daily housekeeping service was very prompt and did a very good job, and all the staff at the hotel demonstrated excellent customer service. The location of this hotel is perfect, it is centrally located to all the great things to do in Oahu. If your looking for a 5 star hotel this is not the place, but if your looking for a nice place with reasonable rates and great service, then this is the place to stay.", "title": "Comfortable, Clean, & Great Location", "helpfulness": 13, "user": "pwisehaddock", "date": "February 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3180329}, {"rating": 3.0, "title": "Economical stay", "text": "Hi all, Stayed for 6 nights at this place, Do not excpect to get a superior room . they are kept clean , but they are small. We were lucky, we had 2 dbl beds. The others in our group had much smaller rooms with the same size beds. the staff ar courteous and helpful.", "helpfulness": 33, "user": "NS", "date": "February 9, 2005", "id": 3174336}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I actually won this trip to Hawaii. I used Trip Advisor to determine where to stay. I was glad that I didn't listen to the reviews that were posted when I booked!!! They reported a party hotel, noisy, dirty etc. I didn't have any major problems! There were a couple of \"bumps\" in the road, but it was still ok. A couple of the nice things were an upgrade for our room. We were told a large suite (needed cooking facilities), but it was actually a 2 room suite. Our lanai had an ocean view, and it was the largest on the property!! We NEVER went to the hotel pool because the ocean was just a 5 minute walk. The hotel is just 1 block from the International Marketplace and Duke's Lane. In both places, they offer inexpensive souvineers and they will work with you on the price! We got several items for about 1/2 price! Great deal! I WOULDN'T waste time with the Denny's across the street. Horrible service and VERY slow!!!!!!!!!!! There is a Food Pantry just across the street that has GREAT cream puffs! Got at least 1 everyday. They also have movie rentals there (If you bring your own DVD player, like we did). The cable in the hotel is HORRIBLE!!!!! Only a couple channels and most were fuzzy!", "title": "A nice place!", "helpfulness": 12, "user": "miraclesmama", "date": "August 4, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5555030, "likes": {"liked": "— Our upgraded accomodations! Ocean-view lanai.", "disliked": "— No internet access! Ono Cheese Steak has free wireless, across the street"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "A couple of problems were that it took about 6 hours to get a port-a-crib for my VERY tired 2 year old. We had requested one at time of reservation. The second was the mold in the on-site laundry room. There was a water pipe that ran the length of the room on the ceiling. It was ABSOLUTELY covered in mold. The good news is that there is a laundry room just 1 block over to use instead of the hotels!! We got a rental car for 1 day (and the only reason we got it for 1 day was because the luau that we went to was at the Polynesian Culutural Center and it would have been a 2 hour bus ride. It costs $15 for 24 hours of parking. That's a lot! The bus line is great (and taxi's aren't that bad).", "title": "Great value for your money!", "helpfulness": 11, "user": "goueffic", "date": "August 3, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "value": 4.0, "service": 4.0}, "id": 5554901, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Well, I think that's all, we had a great time!!!", "title": "Stay Elsewhere", "helpfulness": 12, "user": "jackmeoff", "date": "August 3, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 2.0, "value": 1.0, "rooms": 1.0}, "id": 5546845, "likes": {"liked": "— Nothing", "disliked": "— Evverything"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Stephanie", "title": "Great for families on a budget", "helpfulness": 8, "user": "tiabowry", "date": "July 31, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5530647, "likes": {"liked": "— Price", "disliked": "— Slow elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "PS, You MUST go snorkeling in Hanauma Bay. And DON'T waste your time with going to the Sea Life Park! It's 1/4 the size of Sea World (if that) and it's $30!!!!!", "title": "Great value for those on a budget.", "helpfulness": 9, "user": "Kane_Shane", "date": "July 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 5523265, "likes": {"liked": "— Location", "disliked": "— Elevator not always working properly."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I have to chuckle a bit at some of the negative reviews here. If you are expecting the Hilton, stay at the Hilton. The comment below about lack of sleep due to High School students is true - we were there at the same time and they were very annoying. We were trying to read while sitting at the pool and kept getting splashed - including our library books we brought along. But c'mon this was a rare one-week thing going on - there was a HUGE coral and band thing going on in Honolulu in March and there were hundreds of high school students there that week. I suspect all hotels were affected, not just this one.", "title": "Reasonable Price and Great Location", "helpfulness": 37, "user": "Batdude3", "date": "March 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3305367}, {"rating": 4.0, "title": "great budget hotel", "text": "So here are the true hard facts. This is a budget priced hotel that is family oriented. The location is the biggest plus. You can walk to all the highlights from the hotel (international marketplace is across the street, 2 blocks to Waikiki beach etc). There is a bus stop right out front and 2 desks inside the hotel that can help you with other tours and attractions if you wish. The staff were very helpful and friendly.", "helpfulness": 12, "user": "MAOFW", "date": "March 22, 2005", "id": 3294566}, {"rating": 2.0, "title": "Only stay at this hotel if you don't care about sleep", "text": "This hotel was recently renovated and is clean. Air conditioning works GREAT. There is a Chili's restaurant in the hotel and the world famous Perry Smorg is just two doors down the street. Like I said though, this is not a 5 star hotel. If you expect the best or at least a little extra, this is probably not the hotel for you. You will not be pampered here. But if you are the average person that just wants a clean room and bed at a reasonable rate, this hotel is #1 on my list. We paid $109 for city view kitchenette.", "helpfulness": 11, "user": "YourConcierge", "date": "March 21, 2005", "id": 3292068}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "The pool is unheated and no hottub but its a nice pool area. At night they show sports on portable movie screens in the pool/bar area and there are also big screen TV's.", "title": "Clean it is not!", "helpfulness": 8, "user": "Ajabby", "date": "March 11, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3267468}, {"rating": 4.0, "title": "loved it", "text": "There is parking below the hotel if you have a car. I think it was $13 per day.", "helpfulness": 15, "user": "SUN&FUN2005", "date": "February 24, 2005", "id": 3228275}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Stayed at the Ohana West 3 nights with 2 adults & 3 children. I was looking for something that was reasonably priced & able to accomodated all 5 of us without being cramed into one room. We got what they call a Kitchenette combo, which is made up of 2 connecting rooms - 1 of them having a kitchen. It worked out great. My husband & I stayed in 1 room & our 3 kids stayed in the other room. We each had balconies & our own bathrooms. All this for $110 per room! Now, my 1st choice hotel would've been the Moana Surfrider, right on the beach, but that was $300 per night for 1 room with 2 double beds - could you imagine how would 5 people fit?", "title": "Okay hotel if you're on a budget", "helpfulness": 7, "user": "ncthan", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5490643}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Things I liked about the hotel:", "title": "Great place for the dollars.", "helpfulness": 14, "user": "Bristraveler", "date": "July 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5473101}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "1. Centrally located, within walking distance to EVERYTHING, my 15 year old even ventured out on his own several times. True, if you don't like noise, don't stay here because it is very busy all hours of the day. But once I was in my room, I didn't hear any noise. If you want quiet, there are hotels further down that don't have alot of action or stores around, such as the ResortQuest Banyan or Sunset, Hawaii Prince, Hilton - all those are away from the noise.", "title": "You Need To Read", "helpfulness": 13, "user": "Shira_02", "date": "July 11, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 5457485}, {"rating": 3.0, "title": "Got my money's worth..", "text": "2. Well kept rooms, cleaned daily.", "helpfulness": 6, "user": "LadyElle", "date": "July 8, 2006", "id": 5438643}, {"rating": 2.0, "title": "Stay here if you like noise", "text": "3. Friendly, courterous staff.", "helpfulness": 3, "user": "dalichandler", "date": "July 6, 2006", "id": 5435046}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We just got back from a week in Waikiki and stayed at this hotel. We were a little concerned with some of the reviews we had read here, but except for the oddly programmed elevators, I need to say our experience was good. The staff was friendly and prompt - when we asked for some additional towels and 2 extra pillows, they were in our room the next time we came back in. Although we didn't request it, we got a room with a kitchenette, which, although we didn't totally utilize it, was still quite a nice bonus. It's not a 5 star hotel, but we didn't pay for a 5 star hotel either, so that's okay. Oh, and we were really happy with the shower - lots of water pressure and hot water. The power went out once while we were there, but it was due to a fire somewhere else which knocked out part of the power grid, and really was a small inconvenience.", "title": "Not that bad!", "helpfulness": 18, "user": "C&BM", "date": "January 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 2991894}, {"rating": 4.0, "title": "Comfortable and convenient", "text": "Although the next time we go to Hawai'i we would like to go to Maui, if push came to shove, and we went to Waikiki again, I would not hesitate to stay in this hotel again.", "helpfulness": 6, "user": "Sunny005", "date": "January 8, 2005", "id": 2990172}, {"rating": 5.0, "stay_parameters": "Stayed March 2003", "text": "We stayed at waikiki west in March of 03 and again in Oct 04 and have booked again for jan 26, 06 the hotel is centrally located clean friendly staff maids do good and nice to have a kitchette. grocery store across the street Chilis and starbuck in hotel along with 1 hr photo and pharmacy. People have complained about he noise of the renovation but tell me how are they suppose to make it nicer and prettier if they dont do the renovation and if you know how to mak eit quiet you will be a millionaire People complain but every day they take detours or put up with the neighbors dog barking. Noise didnt bother us cause we were gone all day seeing the sights that we went there for . See you in Jan 06", "title": "Going back for a 3rd", "helpfulness": 21, "user": "cousin310", "date": "May 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3449038}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "After a quick check in, I took a sometimes slow elevator to the 10th floor. The elevators let you out onto an open walkway/balcony facing Kuhio Ave., with enclosed corridors at either end that lead to the rooms. Pleasantly surprised, the room was clean, neat and quite cold. The a/c system was more than adequate. Yes, the bathroom is small with not much counter space. The good news is the shower has fire hydrant like water pressure and instant hot water. The maid service and all staff encountered were very courteous and prompt.", "title": "Location & Convenience", "helpfulness": 36, "user": "vsop", "date": "May 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3447917}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "At the street level of the hotel is a Starbucks and Chili's restaurant. Across the street towards Diamond Head (to the left as you exit the front) is a Food market and coin laundry. Directly across the hotel is an entrance to the International Market Place and Fatty's restaurant. The bus stops to Ala Moana Shopping and downtown or Hanauma Bay and Diamond Head are just steps away on Kuhio Ave.(always ask for a transfer, saves you a fare, $2). The beach is just two short blocks away.", "title": "Great location", "helpfulness": 30, "user": "MFCDBC", "date": "May 4, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3438924}, {"rating": 4.0, "title": "Great location, great price, but noisy", "text": "For my hotel requirements, which are clean, safe and inexpensive, the Waikiki West fit the bill. Add to that the convenience of its location and I have no hesitation with being a repeat customer.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "April 6, 2005", "id": 3337363}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We stayed at this hotel for five nights in April. When we arrived at the hotel and saw our room with a \"view\" of the parking lot and surrounding buildings, we were quite disappointed. However, after realizing that we were only there to sleep and probably wouldn't even be opening the drapes, we decided that this was O.K. The room is large and clean with a king sized bed, large closet, and a fridge. There is only a stand-up shower, no tub, and it took a bit of work to shower properly. I had read previous reviews which indicated that the hotel was noisy. Well, we must have \"lucked-out\" as we had a very quiet room on the seventh floor and heard very little noise. The staff was friendly and were willing to help with directions or information whenever needed. The activities desk staff were very helpful and friendly as well. The hotel is centrally located and is within walking distance of most things such as a grocery store, restaurants, a pharmacy, the International Market Place, and just minutes from the beach. The public transit buses stop in front of the hotel or just across the street and will take you just about anywhere for a couple of dollars. We are budget concious people and don't mind walking a few minutes to save money on a hotel room that we are only in for a few hours of sleep time. I would recommend this hotel and would stay here again. By the way, I am \"bug phobic\" and we did not see a single one here.", "title": "Great Value, Great Location, Great Pool Deck and Bar!", "helpfulness": 25, "user": "DevinRichert", "date": "April 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3331835}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "4 of us stayed at this hotel. When we got there we were advised we had been upgraded, instead of 4 to one room we were given two rooms. This was fantastic as 4 to a room can be a bit much at times!!. We found the hotel rooms clean and tidy. Had a great bathroom with no problems and great views from the balcony. The restaurant they have down stairs (Chillis) is great too. We used the laundry with no problems either. The only downside was 8 months later we received a letter stating that there was a pay dispute and we owed them $1137 USD!!! turns out when we received an upgrade we were supposed to have been given 1 big nicer room not two rooms but all has been sorted out now. I would highy reccomend this hotel to all who visit Hawaii and its close to all the shops and the beach as well.", "title": "Ohana West Hotel in Hawaii", "helpfulness": 6, "user": "Jada007", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5421591}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The Ohana Waikiki West is a great hotel, I can't imagine what the people who wrote the negative reviews expect from a hotel!", "title": "Great hotel", "helpfulness": 12, "user": "eddyy", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5419392}, {"rating": 4.0, "title": "Ejoyed the Ohana Waikiki West", "text": "The rooms are huge, clean, beds are comfortable and clean, the air con is excellent as are the bathroom facilities, all clean and hot water available at all times. The maids and activities staff and front desk staff are all very friendly, polite and very helpful at all times of day and night.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 29, 2006", "id": 5411540}, {"rating": 4.0, "title": "No worries.", "text": "The location of the hotel is great, less than 5 mins walk to wonderful Waikiki beach. On the same road as a number of eating places, including a great bakery across the road and Chili's downstairs of the hotel, huge portions and very nice food.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "June 20, 2006", "id": 5367196}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We didn't use the swimming pool with the beach so close but the pool terrace gets the sun for the entire afternoon and despite being above a road it's not noisy.", "title": "Great hotel", "helpfulness": 13, "user": "eddyy", "date": "June 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5354778}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "For the location and price, this hotel was great. A very noisy hotel (you could hear people talking on the phone in the room beside us at midnight/Security Guards walking up and down the corridors at all times during the night with loud RT's). The elevators take forever.", "title": "You get what you pay for", "helpfulness": 10, "user": "Shazzas", "date": "July 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3659201}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "This was the second time we stayed at this hotel. Upon arrival this time, we were put into a kitchenette (an upgrade), but it was dark and depressing. We went to the front desk and were told nothing was available, but to check back the next morning. We did check back, and they worked very hard and got us a great room (city view on the 11th floor) for a little extra charge each night. It was worth every penny we spent for the upgrade. The maid service was excellent and she was as honest and friendly as could be. It seemed that she would be sure and get in there to clean the minute we stepped out. The hotel is conveniently located so that you can walk or take a bus to just about anywhere you want to go. I only wish we would have walked towards town a little sooner, because there were lots of other places to eat and see that direction (both on the main streets and the beach). As everyone has stated, the elevators are slow, but be patient. The stairs are always an option. All in all, if you want a great value and a clean place to stay, this is it. I would not hesitate to stay here again.", "title": "Give it a chance", "helpfulness": 14, "user": "carolincolorado", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3638205}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 123, "average": 352, "very good": 535, "terrible": 94, "excellent": 136}, "aka": "Ohana Waikiki West Honolulu", "slim_ranking": 0.771084337349, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}}