{"user_rating": 5.0, "review_count": 162, "name": "Old Tree's House", "reviews": [{"rating": 5.0, "title": "Bliss in the outback", "text": "simply outstanding. Laid back and wonderful. Perhaps a tad more than nthe other places we visited but at 1200b worth every baht. The rooms ,the views and above all the hospitality. Ask and you shall find. Paulo and Nid thanks a bunch. The best stay of out time with our friends up North. See you again for sure.", "user": "KoratGordy", "date": "May 27, 2010", "id": 65448435}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Gordy and Da.", "title": "perfect place,wonderful hosts, excellent value, authentic experience", "user": "tom255106", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62220866}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We absolutely loved our stay here and the authentec travel experience Paulos self guided day trips offered, taking you off the beaten track to lots of interesting places that only a true local would know, and most travellers would so easily miss. Paulo has contacts that take you on jungle trips meeting locals as they live. He helps support a hilltribe village school that is available to visit. It is all so easy from Old Trees House.", "title": "A little piece of Paradise in north Thailand", "user": "Mairead D", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60883519}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "It is an oasis with very clean comfy bunglows in a serene tropical setting. Complimentary beers on arrival is just a start to the hearty hospitality that is comlpimented by Nids delicious Thai dinners. It is a definite must stay and a very good reason to come to Thaton. A highlight to our stay in Thailand.", "title": "It's worth the trip!", "user": "wet_buddah", "date": "February 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57344774}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We happened across Old Tree's House quite by accident, by picking up a business card for the place in our guest house in Chiang Rai. The weather was getting hotter and hotter, and that little pool looked inviting. We headed up to Tha Ton by boat from Chiang Rai, and Paulo picked us up from the ferry stop. Thus started probably the loveliest 24 hours of our Laos/Thailand holiday.", "title": "Great value for money", "user": "SwissTravelCouple", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 54151108}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Old Tree's House and its owners, the Frenchman Paulo and his Thai wife Nid, have left a smile on my face. The small boutique hotel is composed of a few tastefully decorated bungalows in a beautiful lush garden with an infinity pool and different water features. Breakfast and dinner are served on the open verandah of the main house, which is a great place even if it rains!", "title": "Beautiful and laid back", "helpfulness": 1, "user": "asmile", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137758933}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Paulo is genuinely nice, incredibly generous and laid back, and his wife is an excellent cook who will only use the freshest ingredients. Mangos come fresh from the trees next to the house!", "title": "Individual bungalows in tropical garden setting", "helpfulness": 1, "user": "Patrick E", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127760813}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Paulo not only came to get us at the bus stop with his pick up truck, he also gave us good sightseeing advice and an insight in the lifes of the people who live in this border region, including many underpriviledged refugees whom he and his wife support in many different ways.", "title": "Very nice surroundings, but don't eat there", "user": "KUFBH", "date": "March 14, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126108678}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We rented a couple of scooters from them to explore the region around Mae Salong with its tea plantations. The hotel is only a 10 minute walk from town and the jetty, where we took the river boat to Chiang Rai. Although Thaton is only a small town, we would like to go back.", "title": "Good food, friendly and ethical", "user": "vandirk", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 116367351}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Good luck to Paulo, Nid, their little daughter and all who live at and through the Old Tree's House.", "title": "What a good place to stay !", "helpfulness": 1, "user": "JohnStud59", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114830441}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I selected this B&B based on the Trip Advisor reviews and several emails with Paulo (the owner) who made it clear that we would be his only guests for 3 nights and he would be able to escort us on all of the excursions listed on his web site. We never would have chosen to stay in such a remote area if we thought we would be on our own. He stated in emails that we would discuss the many tours (with him) when we arrived. The web site mentions tours that he will take you on. We had read one negative review on Trip Advisor which complained that the guests did not feel welcome. We ignored that review and booked 3 nights.", "title": "Have never felt so unwelcome...", "helpfulness": 13, "user": "Sheri&Todd", "date": "June 26, 2011", "detail_rating": {"sleep": 4.0, "value": 1.0, "service": 1.0}, "id": 114776906}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Thaton was a 4 hour bus ride from Chiang Mai. I sent an email as to our approximate arrival time and called the B&B when we arrived, just as we were informed to do. The owner's wife (Nid) acted surprised when I called...as if she had no inkling we were coming. She eventually said she would pick us up (as promised on the web site and in emails.) She sent a scooter! My husband and I rode one at a time with our backpacks and no helmets. My husband and I were very upset as it was not expected AND there was a mini van in the parking lot with their B&B name on it. We felt she did not want to be troubled with picking us up so she sent an employee.", "title": "lovely bungalows next to the pool", "helpfulness": 3, "user": "Bruce_and_Megan", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114724346}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The grounds are beautiful and the cottage very nice. The young woman who showed us to our room said Nid was sick when I asked about tours. I asked when we could talk with her and she said maybe tomorrow. We were beginning to get upset as we were in the middle of nowhere with no promise of the tours we had traveled so far to experience!", "title": "a piece of paradise", "helpfulness": 3, "user": "timo59", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103505858}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "A while later, Nid made an appearance and showed us some tours. She made it VERY CLEAR that her husband was in France and she was not taking us anywhere. In all fairness, Paulo had emailed me a few days before we left for Asia and said he would be in France on business. He said Nid spoke English and it would be \"no problem\" to keep our reservation. He apparently never asked Nid if this was ok. She was cold toward us and we were made to feel like an imposition from the moment we arrived.", "title": "Unbelievable place in North Thaïland", "helpfulness": 2, "user": "Maillekeul", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100419148}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "She gave us 2 glasses of juice and some fruit and hesitantly agreed to make dinner for us, also a service available according to the website. My husband joked and said \"Want to bet these juie glasses will be here tomorrow morning?\" By the way, he was correct, the ant covered glasses were stil on our patio table the following morning. We swam and drank the 2 beers in the refrigerator. I had read o previous reviews that the free mini bar is limited in what it contains, but guests can request additional beverages without a charge. We had 2 more beers and we were charged for them.", "title": "Quite a gem-lush and welcoming", "helpfulness": 1, "user": "wanderlings", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99177042}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "All I can say is WOW!!!! During my 2 week trip to Thailand, Thaton and Old Tree's House were by far my favorite experiences.", "title": "Most amazing place EVER - Do yourself a favor and stay with Paulo!", "helpfulness": 1, "user": "ilovemadridalot", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91342036}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Thaton is a small village about 3 hours north of Chiang Mai on the border of Burma (Myanmar). It looks to be a one road town with a handful of roadside cafes and B&Bs. We found Old Trees House on Tripadisor and after reading the reviews, we had to check it out. The reviews are spot on.", "title": "Amazing Northern Thailand Experience", "user": "ANDYCHEF", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 81865638}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed in a poolside bungalow. By far it was the most sophisticated asthetic I found in Thailand. Very clean and simple with a FANTASTIC bathroom. It was such a nice break from dribbling showers and holes to poop in. All of the bungalows have a mini fridge stocked with water, pepsi and beer (FOR FREE) and a tv with a dvd player. We didn't use the tv. The scenery was way too pretty to be bothered. If I were there a week though, I'm sure I would've taken advantage of Paulo's and Nid's dvd collection.", "title": "A heavenly guest house when you are really the house's guests !", "user": "Dom_and_Family", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77114714}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Our bungalow had a porch with comfy chairs and a separate covered spot to lay with a headrest. Oh, did I mention that there is an amazing pool (though too cold to swim while we were there).", "title": "Jury's Out!", "helpfulness": 4, "user": "Mounthutt", "date": "August 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76914809}, {"rating": 5.0, "title": "Paradise in the middle of northern Thailand!", "text": "The owner, Paulo, was incredibly friendly, as were the fellow guests. 7 other French visitors were the only other guests. Paulo took us all to dinner at a local Korean bbq where many of the locals frequent. We had a fun night with laughs and an interesting dining experience. Evidently, Paulo's wife, Nid, usually cooks but she was out of town for the night. There is a staff on hand to fill in during her time off. They prepared us a bite to eat when we arrived and a full breakfast the next morning.", "user": "nolaeats", "date": "June 4, 2010", "id": 66446573}], "location": {"country": "Thailand", "continent": "Asia", "city": "Mae Ai"}, "variance": {"poor": 1, "average": 4, "very good": 5, "terrible": 1, "excellent": 151}, "aka": "Old Tree`s House Hotel Mae Ai", "slim_ranking": 0.2, "description": "Just out of Thaton, on a hill with a great view over the Mae Kok river, the mountains and the rice fields.Includes breakfast, internet acces + WIFI, Laundry, swimming pool"}