{"user_rating": 4.0, "review_count": 118, "name": "Old Prague Hotel", "reviews": [{"rating": 2.0, "title": "Great location....BUT...", "text": "Prague is beautiful. Personally, I think it reminds me of a larger version of Venice but I think it's more beatiful. Anyway, the hotel location can't be beat. 7 minutes walk to Charles Bridde. 5 Minute walk to Old Town. My only complaint about the hotel is the street noise at night. We were there for 3 nights and each and every night, there were car alarms, car honking and general screaming from partying folks. Maybe it's better on the non-street side...but I doubt it. We were on the 4th floor. The elevator is really, really tiny and can fit myself and 2 bags. That's it. I usually walked up the stairs (102 steps) for the exercise. Normally, I don't care about noise as I consider it part of sleeping in the city. But, it was SOOO LOUD. I think the noise was due to the strip club near the hotel. but not sure.", "helpfulness": 1, "user": "pechung", "date": "May 3, 2007", "id": 7543234}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We had a room with 2 beds (3 actually). Two beds are placed together to make a king bed and then one extra bed for my son. We paid 3000 CZK per night. Breakfast is served to your room. Expect standard euro food...ham, cheese, bread, yogurt, juice. If you have any leftover meat/cheese and bread, make a sandwich for yourself and take it up Nerudova Road up to the Prague Castle. At the top of the hill there is a sitting area of about 6 benches with an awe inspiring view of the city. Enjoy.", "title": "Very good hotel", "user": "MichelinMen", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7304788, "likes": {"liked": "— location", "disliked": "— little construction going on next door"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Here's some useful info (stuff I wish I knew before my trip) for those going there:", "title": "Loved Everything", "helpfulness": 1, "user": "KAYBOX", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6570826, "likes": {"liked": "— very clean and brilliant service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Getting There--Use your credit card to buy bus/train pass one-way into the city. 20CZK ($1 USA) will buy one adult ticket on Bus #100 to Dejvicka and then the Yellow line train to Narodni Trida. Catch the bus outside after baggage claim at the center island. Get off at Narodni Trida and exit. Once you get up the stairs, make a Right and you will see Tesco Market on your right side. At the corner of Tesco market, look straight ahead across the street and you'll see an orange colored store sign \"Rock Point\". Make a Right turn at that store and follow the small road for 3 minutes (the road only goes one way.) When you come upon Wolfgang Restaurant on your left, make a Left turn. You will see the hotel building on the right side about 200 feet on your right side. This is the quickest way to get to the hotel.", "title": "wonderful hotel", "user": "boeing747", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6568407, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Excellent location", "text": "Currency-- We had no Czech money when we arrived, we used credit card to buy bus/train pass and then once we got to the hotel we went to a bank to get money. Most restaurants take credit card so we only changed a little money.", "helpfulness": 3, "user": "Kateski", "date": "October 14, 2006", "id": 5951427}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My mother and I stayed at the Prague Expres hotel for 24 nights in July (right in the middle of the Soccer World Cup). The Hotel is in the best position you can ask for in Prague. You have a metro station only 2-3 minutes walk away and an exeptionally easy walk to Wencelas square, old town square and charles bridge, obecni dum and narodni trida. Also Havel's markets which provides fresh fruit every day is just around the corner.", "title": "Perfect Place to Stay", "helpfulness": 2, "user": "GoldCostAus", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5810679, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Tesco is just through a small walkway (about 2 mins walk) if you have a longer stay and wanted to pick something up for dinner/snacks etc, or there are heaps of restaurants everywhere.", "title": "Excellent Location", "helpfulness": 3, "user": "raemie", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5715469, "likes": {"liked": "— Location", "disliked": "— Everything was perfect!"}}, {"rating": 5.0, "title": "All Around Great", "text": "The hotel itself is very clean, and the staff are very friendly and knowledgable. Based on earlier reviews, we asked for a room on a high floor with a view (this means you should get a room at the rear of the hotel looking over the school's courtyard, with views of a lot of roof tops over old town square - and if you poke your neck out the window to the left you can actually see hradcany castle). The room was very quite and had its own shower/toilet, closet, TV, phone and bed. The room at the rear of the hotel, with view, is smaller than those at the front of the hotel - however when faced with an option of a view over a street directly looking into other windows, I would take view!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5316290}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The breakfast for two people is huge and we could never get through the whole lot, and the coffee portion for us was fine...some people say the sachet is too small, but for where we come from it is the same size. Also there are plenty of local coffee shops (like Odkolek, Kava Kava, Coffee Heaven etc.. which all serve beautiful espresso coffee)", "title": "Location, location, location", "helpfulness": 10, "user": "sophisticatedtravelr", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5237634}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "It is true that there is an erotic shop across from the hotel and a strip bar next door, however these pose no trouble at all and for someone in their 20's I felt very very safe travelling in prague.", "title": "Excellent Location", "helpfulness": 6, "user": "raemie", "date": "May 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5029849, "likes": {"liked": "— Location", "disliked": "— Everything was perfect!"}}, {"rating": 4.0, "title": "Recommended", "text": "We stayed for 3 nights in August 2005. We booked at quite short notice and were given a huge room on the 3rd floor, overlooking the street. The room had 4 beds, a table and chairs, and adequate bathroom. Front desk spoke excellent English.", "helpfulness": 9, "user": "Wyn8", "date": "September 28, 2005", "id": 3946839}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Breakfast is brought to your room at your preferred time, including juice, coffee, tea, cereal, rolls, ham, cheese etc.", "title": "Brilliant Location", "helpfulness": 11, "user": "BigMan", "date": "April 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3366134}, {"rating": 4.0, "title": "Everything you need", "text": "The location of this hotel was perfect, right in the old town and walk to all the sights. I was hesitant about the noise factor after reading other reviews - but the 'adult store' across the road caused no trouble (and was closed on Monday). The only noise was from drunk people singing in the streets on Saturday night - but you'd get that anywhere!", "helpfulness": 10, "user": "Sallyfix", "date": "February 15, 2005", "id": 3186616}, {"rating": 3.0, "title": "Very Convenient", "text": "Second visit to Prague, first time at this Hotel. The location couldn't be better, right in the heart of the city and walking distance from all you want to see.", "helpfulness": 7, "user": "MissWales82", "date": "January 2, 2005", "id": 2970424}, {"rating": 4.0, "title": "Good hotel, great price, great location (not for kids)", "text": "Beer Kellers at one end of the street, wine bar, outdoor market and fish and chip shop at the other. Sightseeing all around.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 8, 2004", "id": 2812629}, {"rating": 4.0, "title": "Excellent value", "text": "Being on a budget I chose the \"Little Rooms\" in the courtyard. Very basic, just a bed and a phone. Shared bathroom with one other room. Window with a view at ground level over the small courtyard. This means people can walk right by your bedroom window and look inside. Initially I was disappointed with this, but after a couple of days it was no major drama..", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 15, 2006", "id": 4975574}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "Hotel does not have a bar or a restaurant, it looks like every square inch has been used for bedrooms. I was told that the other rooms were far superior but at £30 per night this cannot be matched anywhere in Prague central by a long way.. Bars and restaurants are in plentiful supply nearby, and offer great food and drink for very reasonable prices.", "title": "Great Location, Great Price, Clean rooms", "helpfulness": 11, "user": "ravenjdc", "date": "March 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4725583}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The breakfasts, brought to your room each morning consists of meats, cheeses, cereals, jams, butter, black bread, baguettes, croissants, a full one litre of fruit juice, 500ml milk, and one tiny, tiny sachet of coffee!! (Hint to the management!).", "title": "Great Hotel!!!", "helpfulness": 5, "user": "Trulys2013", "date": "March 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4695237}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Wenceslas Square, the Old Town Square and Charles Bridge are no more than 5 minute leisurely stroll away, you really cannot fault the location..", "title": "Super Hotel", "helpfulness": 7, "user": "Cliffcourt", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4320809}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Would I stay here again? Probably yes.. As a single traveller I would be paying 3 times the amount for a hotel outside the centre, and that is an important consideration for me. Basically, if you just need a place sleep, this will suit you just fine.", "title": "Excellent Location, Great Staff, Clean Rooms.....A Little Noisy", "helpfulness": 4, "user": "WorldTreker", "date": "November 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4109711}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 3, "variance": {"poor": 5, "average": 23, "very good": 47, "terrible": 1, "excellent": 42}, "aka": "Old Hotel Prague", "slim_ranking": 0.274888558692, "description": "Friendly, clean and cosy hotel in the historical centre of Prague 5mins walking from the stone Charles Bridge. 14 double rooms and 14 three-bed rooms with private bathrooms. The hotel offers breakfast, free internet and wi-fi connection,safe boxes, sightseeing tours, left luggage, transfer service."}