{"user_rating": 4.0, "review_count": 690, "name": "Old Faithful Snow Lodge and Cabins", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "My guess is that the architect of this building was never in Yellowstone in the summer. The building is extremely well insulated and, as another reviewer noted, the windows in the rooms are tiny. The lack of ventilation resulted in a very uncomfortable night with very little sleep. The hotel staff did everything they could -- they had plenty of portable fans to give out -- but they could not compensate for the building's terrible design. Even the common rooms were hot. Don't stay here in July/August!", "title": "Don't stay here in the summer!", "helpfulness": 10, "user": "jbullock47", "date": "July 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 5525214}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The windows in the hotel rooms are the size of an airplane window...the rooms are HOT not just warm but uncomfortable...so warm people kept their room doors open for ventilation. Many rooms the toilets were overflowing, they have serious plumbing problems. It smells like mold. The service in the restaurants were poor just in line with the reviews in the travel books. Not good for a new facility.", "title": "Snow Lodge Bad Service Rude Employees/Ventilation Problems", "helpfulness": 9, "user": "Rozeel", "date": "July 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5515179, "likes": {"liked": "— Check-out time!", "disliked": "— Poor accommodations"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "My family (hub and grown son) and I spent 2 nights at the Old Faithful Snow Lodge as our base for touring Yellowstone NP. Our room was clean, modern, had nice wildlife touches and the beds were comfortable. Add to that the location - just across the road from Old Faithful itself and pretty central for most of the park's attractions - geysers, mud-pots and wildlife. There were 2 gift shops in the vicinity - both with a good variety of goods - and, in one of the stores, there was a convenience food section, also with a good variety of goods. This store came in handy when the Obsidian Dining Room was full and we didn't want to wait an hour to eat! It was also preferable to the cafeteria. We would love to return to Yellowstone one day - and, if we do, we would be more than happy to stay at the Snow Lodge.", "title": "Ideal lodging in Yellowstone", "helpfulness": 12, "user": "moo_bear", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5480014}, {"rating": 5.0, "title": "The Snow Lodge Rocks!!!", "text": "The Snow Lodge was a vast improvement over the accommodations we were previously in at West Yellowstone. We were so glad to move into a place within the Park. We stayed here two nights and very much enjoyed it. The atmosphere and decor of the Snow Lodge greatly enhanced our Yellowstone experience and the little bit extra money it cost us to stay there was very much worth it. We were able to walk to see the Old Faithful geyser erupt, with our kids in their jammies and all ready for bed. What a great way to end the day. It was so convenient to stay there and eliminated a significant amount of driving to get into and out of the Park. The room was clean and quiet (we were on the first floor), and tastefully appointed, and it was an easy walk from our room to two restaurants (connected to the lodge) and gift shopts, etc. The lobby was elegant and rustic, soft music playing, plenty of seating for a relaxing break. We would (and will) definitely stay there again, and probably won't ever stay anywhere else when we return to Yellowstone, unless it is backcountry camping when our kids are older.", "helpfulness": 15, "user": "DareToExplore", "date": "July 18, 2006", "id": 5479756}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We stayed in a Frontier Cabin for 2 nights (6/25 and 26). They are motel style units in sets of 2. As with most lodging in the park, it is very basic. My friend did enjoy the cabin look of the inside of the unit.", "title": "Away from the crowds", "helpfulness": 5, "user": "Blueshirt35", "date": "July 6, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5432678}, {"rating": 3.0, "title": "cabins are OK, not great", "text": "For $85+ tax, my Snow Lodge cabin was a good deal. But I'm glad I only stayed one night. While there are some great geyser trail walks in the park, and Old Faithful is fun, Old Faithful Village is remarkably dreary. The Snow Lodge cabins are certainly on the dreary side: no landscaping, and mine was next to the gas station. But, inside, the cabin was larger than most and reasonably furnished (no charm, but more than adequate).", "helpfulness": 9, "user": "Dave's_reviews", "date": "June 23, 2006", "id": 5376750}, {"rating": 5.0, "title": "Choose the Snow Lodge", "text": "The Snow Lodge itself is much newer, and if you didn't have to pay a lot more to stay in it (I think you do), would be a better choice than the cabins. Obsidian restaurant has good food but untrained staff can lead to loooong delays. Breakfast buffet is uninspired but fairly priced and quick.", "helpfulness": 15, "user": "finnishspitz", "date": "June 13, 2006", "id": 5339045}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "My advice would be to stay as long as you need to to see Old Faithful area, and then move on to other accomodations in the park. I would not make this place a base to see the whole park, as Old Faithful Village is a little bleak and overcrowded.", "title": "Great stay at the Snow lodge.", "helpfulness": 10, "user": "SR71", "date": "May 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 5224196}, {"rating": 5.0, "title": "Had a great time!", "text": "My family of 4, wife, husband, 2 kids, 16 and 11 really enjoyed Snow Lodge. It is a lovely facility. Very new and modern. The rooms, while small are arranged nicely and the storage space is good. Room has 2 double beds with locker style closets on either side. Room has a desk and chair and an additional chair in the corner. The sink is outside the bathroom and has a shelf above and below for toiletries. The tub/toilet area is large. There is a hair dryer in the room. There is a shelf that runs the perimeter of the room that I found quite handy. The laundry is on the second floor and is wonderful. It has 4 washers and 6 dryers. Cost: $1.25 a load. Change machine located there as well. It is open to everyone in the park, so plan ahead. It is open from 8 am to 10 pm - locked the rest of the time. (Canyon was supposed to have a laundry but it was closed because the campground was closed- call ahead) Some evenings there is entertainment in the lobby. The building is not well marked, so when you find it, just locate a parking space anywhere you can and go on in. It sits off and behind the general store. You can walk easilly to Old Faithful and do the geyser trails from there. The Obsidian restaurant is very good, but pricey. The grill is good, reasonably priced. We didn't try the cafeteria.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 21, 2006", "id": 5185944}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Enjoyed a two night stay at the Old Faithful Snow Lodge 12/13th May 2006. Appeared to be quite new building with very pleasant public areas and very clean rooms. All the staff were accomodating and friendly. The park was supurb and mid May seemed to be a good time to visit, not too busy and most roads open.", "title": "Modern Lodge with a Front Row Ticket", "helpfulness": 20, "user": "Hearthside", "date": "March 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4579543}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I had read some average reviews of the Snow Lodge on Trip Advisor, and I was concerned before our trip. However, our stay at the Snow Lodge was excellent. The rooms are spacious,clean, & quiet, and the showers always had plently of hot water. The beds are comfortable and warm, and the closet space is more than enough. We stayed on the third (top) floor, which probably helped reduce any noise from foot traffic that might happen if you stayed on the first floor for example. The staff (from the front desk to maid service) was very friendly and helpful. We asked for extra coffee in our room, and the maid left us six extra packets, which was above what we expected. If you don't want to mess with the free coffee in your room, then there's free French roasted coffee in front of the main restaurant in the mornings. The best thing about the Snow Lodge is the proximity to Old Faithful, which is about 100 yards away. The food at the Geyser Grill was just perfect for us - nothing fancy - just affordable and tasty food for people on the go. We had one dinner at the main restaurant, and the atmosphere was very relaxed, yet elegant. I had a lamb shank that had been slow-roasted for twelve hours and the meat fell off the bone. Delicious! We will definitely stay at the Snow Lodge again.", "title": "The Snow Lodge was just perfect in every way!", "helpfulness": 13, "user": "TexasHam", "date": "October 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3994774}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Perfectly acceptable lodging in Old Faithful area. Somewhat removed from the bustle around the Inn but these cabins were clean and quiet. Yes you are not surrounded and isolated by a forest of trees. And I for one prefer gravel over mud. Easy walk to general store and maybe 5-10 minute walk to Inn and Old Faithful.", "title": "Snow Lodge cabins", "helpfulness": 10, "user": "ColoradoDenver", "date": "September 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3980799}, {"rating": 4.0, "title": "Enjoyed our stay here", "text": "As a couple we stayed at the Snow Lodge in late Sept. of 2005. We had a room on the third floor.", "helpfulness": 7, "user": "4itchyfeet", "date": "September 29, 2005", "id": 3947420}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The rooms are nicely decorated and cozy, small but adequate for 2. A family would be very crowded in one room. Our room had a full-sized window which opened, but I noticed that rooms on the other side of the hall had one tiny window.", "title": "Snowlodge Cabins 8/17 -8/19", "helpfulness": 12, "user": "BackHomeCt", "date": "September 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3837490}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "If someone wants to experience Yellowstone National Park anytime of the year, one must be prepared to experience and appreciate all forms of wildlife, including mice that reside in the National Park. Because Yellowstone is pristine and the wildlife is preserved for all of us to enjoy, one should expect to see all wildlife. We should not be terrorized by tiny field mice that may find their way into the buildings. Perhaps the person who gave the Snow Lodge such poor ratings needs to schedule his or her next vacation at the Ritz Carlton on the beach somewhere instead of our pristine National Parks.", "title": "Loved the Lodge", "helpfulness": 13, "user": "Buffalo_WyomingBejoy", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4360569}, {"rating": 4.0, "title": "Different but fantastic!", "text": "I have visited the Lodge many times and found it to be clean, well appointed and the staff courteous and helpful.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4120437}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "It was definitely an experience staying in the cabins next to the Old Faithful Lodge. From the outside I was very apprehensive - they look like a large garden shed! However, once inside I was pleasantly surprised. There was enough room for a double bed, 2 bedside cabinets, a desk and chair and a vanity sink. The bathroom was small, but there was plenty of hot water and the shower was powerful enough. There was a considerable ground frost in the morning but the in-room heater was fine - except the bathroom remained cold! One bit of advice - make sure you take a torch with you. Its pitch black at night and there's lots of things to trip you up if you're not careful! We ate at the Old Faithful Lodge Cafeteria. The food was fine and the dining room fantastic. We sat out alone on the veranda with hot drinks in the dark listening to the gysers and the wildlife - fabulous experience!", "title": "Cabins Were Perfect For My Son & I", "helpfulness": 10, "user": "massiek", "date": "October 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4072508}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed here three nights in June. Easy check-in, good room cleaning, and an unbeatable location.", "title": "Great location", "helpfulness": 4, "user": "MarissaNH", "date": "October 8, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4002166}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "I'd highly recommend the cabins. The are nice and quiet and we saw buffalo less then 100 feet from our cabin.", "title": "Lovely building, but SO noisy!!", "helpfulness": 17, "user": "jills1234", "date": "October 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4000679}], "location": {"country": "United States"}, "variance": {"poor": 53, "average": 132, "very good": 295, "terrible": 21, "excellent": 189}, "aka": "Old Faithful Snow Lodge And Cabins Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}