{"user_rating": 4.0, "review_count": 21, "name": "Old Mill on the Falls B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My husband and I recently stayed at this very quaint B&B in Hatfield, MA at the recommendation of friends and were very impressed with the property. We do not usually stay at B&B's but there was not a good selection of hotels in Hatfield so we thought we would give it a try. REALLY, glad we did. Our room was a suite overlooking the \"falls\" with a modern bath (whirlpool tub) and decorated with an unusual collection of antiques and other interesting items. The room was immaculate. The dining room was small, cozy and intimate. You could have an excellent breakfast alone, outside or with other guests. The innkeeper was knowledgeable, friendly and eager to tell us of the area attractions. We would definitely recommend this property.", "title": "Loved the Old Mill on the Falls", "user": "garyandsue515", "date": "August 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19116804, "likes": {"liked": "— Room decor, cleanliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We were a little apprehensive because it hadn't been reviewed on Trip Advisor (we found out it only opened a year ago) and the website did not include a lot of photographs, but what a lovely B & B! When we checked in, the owner was friendly and very welcoming, and we were extremely pleased with our room, the green room that sits over the falls. The room manages to look both elegant and warm, with sage green walls, exposed beams, lots of lace covered windows on two sides, a comfortable four poster bed with lovely bedding, a Victorian type love seat and chair, and little knickknacks to make it feel homey. The room, bathroom, roomy jacuzzi, etc. was very clean. Best of all, the rushing water of the falls makes it impossible not to relax, even for my stressed out husband.", "title": "Great place to relax", "helpfulness": 1, "user": "corima", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8229560}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 0, "average": 6, "very good": 1, "terrible": 2, "excellent": 12}, "aka": "Old Mill On The Falls Hotel Hatfield", "slim_ranking": 1.0}