{"user_rating": 5.0, "review_count": 113, "name": "Old Tavistock Railway Station Cottages", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed at the Porters House at the Old Tavistock Railway station a brief two nights, but were completely blown away by the sheer magnificence of this first class self-catering establishment. The owners Jenny & Colin were very welcoming and despite our hectic travelling schedule, extremely accommodating. We enjoyed relaxing massages on the premises to help us completely unwind and had a chance to enjoy the well renowned market on the Saturday.", "title": "A glimpse of excellence", "user": "M0m_0n_b0ard", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119456156}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "A very impressive renovation and well-deserving of it's five star rating. Everything's been thought about, down to freshly baked cake to enjoy with your tea on the day of arrival.", "title": "Full of character, fantastic accomodation", "user": "LoveHolidays1969", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118902689}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We've had our fair share of holiday accommodation and it's safe to say that this was by far our best surprise yet. Would definitely return (hopefully for a longer break next time).", "title": "Perfect Digs, Perfect Location", "user": "cstucky", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118361865}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Wonderful renovation of Tavistock Station. We spent a weekend in the Ticketing Hall which was really well equipped with top quality furnishings. Very different accomodation that was full of character which just made the weekend more memorable. The owners Colin and Jenny were very friendly and gave us a warm welcome, including essentials like teabags and milk when we arrived and homemade cake - perfect after a 4 hour journey. The four stars for sleep quality is simply because the bed was tucked underneath a sloping ceiling and my husband and I are quite tall so our feet stuck out of the bottom of the bed. Other than that, everything was perfect.", "title": "First Class Self Catering Accomodation - Best ever experienced.", "user": "Dave L", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118054550}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Just returned from a week in lovely Tavistock--from incredible digs in the Porter's Office, a two-bedroom self-catering dream. The accommodations were amazing, as was the hospitality. The Railway Station has it all--comfy beds, modern kitchen, a lovely setting high on a hill overlooking a town we fell in love with, that has everything you could want, shops, great restaurants, and walks galore along a river and park.", "title": "A lovely base for moving around Devon", "user": "Jamie D", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118052417}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We spent a fantastic week in the Porter's Office. Lovely, comfortable accomodation in a great location above Tavistock with a quick walk down into town. We were lucky to have fantastic weather every day inFebruary and were able to explore this lovely area. Fantastic walks in abundance near by and some great pubs too!", "title": "Porter's Office", "user": "JeanneAlbi", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125686573}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We stayed in the Ticketing Office for half term week with our 6 year old daughter. The accommodation is 5 star, a real home from home which had a warmth/ambience not usually found in holiday accommodation. Lots of extra touches showed that Jenny and Colin really do care that you are comfortable, from the ktichen table being laid for tea with fresh homemade cake on arrival, to the luxury bath robes and towels, we had a very relaxing enjoyable time. Jenny spent time giving us a history on the station when we arrived and showed us around explaining how things worked. Thank you so much for a lovely holiday and we will definately be back!", "title": "Fantastic, highly recommended!", "user": "Janice M", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124723428}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This is at least the 9th self catering I have stayed in, and by far the best. Everything you could ask for in a luxury break from home. Jenny & Colin have thought of every little detail. They really are the best hosts. We had such a great time that we were lucky enough to extend our stay by two nights.", "title": "One of the best", "user": "Jenny C", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121437195}, {"rating": 5.0, "title": "Idyllic cottage in Idyllic location", "text": "Jenny & Colin make you feel like guests in their home. It was a relaxing break, and Tavistock is a great town. I could go on and on, the beds, the linens, the towels, the kitchen, everything is of a high standard, and maintained by people who take pride in what they do.", "user": "HardeepW68", "date": "November 29, 2011", "id": 121188020}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed at The Porter's Office for two nights, and I would have happily stayed longer if I didnt have to go back to work !", "title": "Quality of this high standard is hard to find!", "user": "Heather H", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120536750}, {"rating": 5.0, "title": "Lovely accommodation in an unusual setting", "text": "We stayed in the reception hall. The accommodation was very good and furnished to a high standard throughout. The owners were very helpful and provided advice about places to visit, eat and shop. Lots of delicious local produce in the shops and markets in the town. A steep walk back up the hill from the town. Our teenage children appreciated having their own bedrooms and the wifi.", "user": "Dawn187061", "date": "August 10, 2011", "id": 116512134}, {"rating": 5.0, "title": "Our return trip", "text": "We have been really looking forward to our second stay, having stayed here last year during August. Jenny and Colin made us feel so welcome. The restoration of the station is to such a high standard and the interior design of each room is stunning. We would recommend this venue for anyone wishing to stay in this beautiful part of England", "user": "Jonney235711", "date": "July 29, 2011", "id": 115955219}, {"rating": 5.0, "title": "Great accomodations", "text": "Tavistock is a great town to base out of for a visit to Dartmoor, Devon and Cornwall. The railway apartments were first-rate, clean and fresh, updated, yet still full of the historic English charm that tourists love. Thanks to Colin and Jenny for thinking of every detail!", "user": "Parnellcm", "date": "July 7, 2011", "id": 115134069}, {"rating": 5.0, "title": "Amazing place to stay we will definitely be back!!", "text": "We stayed at The Refreshment Hall for my Mother in Laws surprise 60th Birthday. There was my Husband and I, Mother in Law, Father in Law, Sister and Brother in Law and their 1yr old Twin girls!!!", "user": "elc158", "date": "June 8, 2011", "id": 112282616}, {"rating": 5.0, "title": "Good quality interesting accommodation ideal for families.", "text": "Jenny and Colin were extremely helpful from the start and supplied us with two high chairs and two travel cots for the girls, and arranged for a lovely bunch of flowers to be delivered to the Refreshment Hall on My Mother in Laws birthday.", "user": "maureenlawrence77", "date": "June 7, 2011", "id": 111941751}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed at the Old Tavistock Railway Cottages (Porters Office) last weekend as they were ideally situated for Tavi town centre and a wedding and reception to be held there. The cottages were delightful, we loved the decor and furnishings. All cottages have been beautifully renovated and restored to a very high spec. Well equipped and comfortable throughout. Hosts Colin and Jenny Rogers made you feel very welcome and were enthusiastic with the history behind the railway and the conversion to holiday homes. Some of the sloping ceilings would be hazardous to anyone tall, but for me this just added to the charm and character of the place. Tavi town is but a five minute walk away, downhill ( very steep coming back up). We would have liked more time to explore the area as there is a lot to see, we did however have a lovely meal at Taylors and would'nt hesitate to recommend it. We definately hope to return next year.", "title": "Hope to revisit next year", "user": "Srilanka1", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117794438}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Myself, my husband and 2 year old son stayed for 4 nights in the ticketing hall. It's very hard to find somewhere that's child friendly and nice for us grown ups at the same time but we found at Old Tavistock Railway Station.", "title": "Warm, friendly and a beautiful place to stay", "helpfulness": 1, "user": "Ashlingm", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117636800}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Jenny and Colin made us feel very welcome, we had some nice little touches waiting for us when we arrived, a delicious passion cake and fresh flowers. The cottage was immaculate, it was lovely to stay somewhere with so much character and we loved the fact that so many of the original features were lovingly restored and retained it was obvious a lot of hard work had been done.", "title": "Just a wonderful experience", "user": "Eva A", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117018607}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our little boy actually said when we arrived 'it's amazing'! We hope to visit again next summer.", "title": "the perfect location to explore Dartmoor", "user": "Dominic R", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116759495}, {"rating": 4.0, "title": "Very nice place! Would love to return!", "text": "Thanks", "helpfulness": 2, "user": "Emily_V-V", "date": "August 10, 2011", "id": 116531859}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 1, "very good": 10, "terrible": 0, "excellent": 101}, "aka": "Old Tavistock Railway Station Cottages Devon", "slim_ranking": 0.333333333333, "description": "Stay at these luxury holiday cottages in Devon where you can sense the atmosphere of days gone by. Experience the ultimate in 5 star award winning luxury self catering holiday cottages in Tavistock, Devon. Owners live on site to welcome guests. Views over Dartmoor and only 5 minutes from the centre of the old market town. Ample parking. BBQ under the platform come rain or shine. Visit local NT properties and great restaurants."}