{"user_rating": 4.5, "review_count": 675, "name": "Old Bank Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I spent 2 nights at the Old Bank in early December 2012. I have previously used the Randolph whenever I have stayed in Oxford but on this occasion decided to try something new and was pleased I did. The hotel is centrally located albeit slightly further from the station than the Randolph. The free secure car park is also a real plus point. I found the young reception staff to all be extremely friendly and helpful. The rooms were very clean and well presented. The room I stayed in was not large by any stretch of the imagination but there was just about room for a desk and chair as well as the double bed. The hotel has an interesting collection of art that is on display in the communal areas and also the bedrooms which certainly makes it feel unique. The Quod restaurant is very good and room service was excellent. The breakfast buffet was certainly good quality although not huge in range. Hotels in Oxford are notoriously expensive and the Old Bank is not cheap, although I was able to get a good rate through Expedia. Overall, I would certainly recommend the Old Bank, and particularly on the basis of the excellent service, this is now my preferred hotel in Oxford.", "title": "Small but perfectly formed", "helpfulness": 1, "user": "DavidMurphy", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148002580}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Exceptional hotel with gorgeous rooms overlooking spires of famous colleges. Room guides and reception gave us best walking tours. Evensong in corpus Christi chapel was sublime. Take two days and visit Ashmolean museum. Great staff Can't wait to return", "title": "Old World charm and service", "helpfulness": 2, "user": "Lpofbrisbane", "date": "December 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147893932}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "After an overnight flight from the US and a drive up from Heathrow Old Bank Hoitel is an oasis in the middle of Oxford. Their directions to their car park were excellent. The three days we were there we never needed the car as the location was perfect for walking. Our room had the benefit of large windows overlooking the colleges. A free guided tour from the hotel was given by an excellent knowledgeable guide. Food at the Quod, the hotel restaurant was interesting and delicious. Above all ,the staff were very professional and helpful. We will return.", "title": "Perfect location, charming staff", "helpfulness": 2, "user": "MicheleColette", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147436574}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I stayed for our wedding anniversary and although the hotel is a little tricky to get to because of the town centre traffic control it is well worth the effort.We arrived early and although our room wasnt ready we parked up in the car park ( limited space but extremely handy) the reception staff were helpful and gave us directions and a map to where we wanted to go. We havd a very tasty lunch in the restaraunt (QUOD) before we went to do some sightseeing.On our return again we were greeted by efficient and friendly staff and shown to our room ( no 21).This was a lovely room, very spacious and very well furnished with a large bathroom ( with lovely toiletries) and a very comfortable bed, The hotel has been done up to a very high standard and has lovely touches like cheese and biscuits and bottled water in the room. The breakfast was very good (although not the cheapest you will ever find) with a nice selection of well cooked dishes .The only slight drawback was we could hear the people in the room above us walking around, this is due to the construction of the building but maybe some consideration could be given to screwing the floorboards down to reduce the noise. We also had a couple of cocktails in the bar which is a great place to relax and has a real 'buzz' about it without being too loud. Overall a fantastic stay and we would definitely stay here again. If you want stylish comfort with great staff and the added bonus of a central location within walking distance of all the sights/restaraunts/museums etc then this is the hotel for you.", "title": "Luxurious modern comfort right in the heart of the city.", "helpfulness": 1, "user": "Jane H", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146808909}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have stayed at the Old Bank 3 times, usually for weddings but this time for a romantic weekend (no kids!!). The reception staff were absolutely delightful and extremely helpful on arrival and throughout our stay. The room decor is fairly bland but comfortable and tastefully done and the bathroom has good fittings and lots of hot water with good pressure (shower was lovely!). I would recommend room 16 as it is fairly large with a bay window and is located at the back of the hotel so is quiet. The car park is a little tight to get into but guests are guaranteed a parking space which is a huge bonus in Oxford.", "title": "Lovely Hotel In Centre Of Oxford", "user": "BritFamily38", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146779348}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was one of our most enjoyable stays at a hotel. The hotel was extremely relaxed and efficent. Loved the room, especially the decor. Comfy bed and wanted to take the curtains and bed spread home with me. the service was excellent and nothing was too much trouble. The restaurant was great, extremely buzzy and good food. breakfast was also great and had the option of anything we could have liked. the scrambled eggs and smoked salmon was a particular favourite. The location was great, walking distance to main shopping area and very central. Getting to the hotel plan ahead as parking needs to be worked out due to the one way system but no real issue. i would stay here any day of the week and would recommend to anyone.", "title": "Excellent Hotel", "user": "Sophie N", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145296155}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The good points about this hotel - ideally situated just off the High Street close to all main colleges, shops and sights, a car park which although difficult to get to because of the traffic restrictions is very convenient and an extremely friendly and informative reception staff. The downsides - the rooms are nothing special, although the rooms at the front do have great views over All Souls. They have tried to make them upmarket with Ren toiletries and bathrobes but to be honest for the cost I would have expected something larger. The bathrooms were a little tatty. The rooms were alse very warm even with the air conditioning on and radiators off. Service in the Quod restaurant was slow although it was always heaving so it obviously has a reputation. Food good. Our room rate did not include breakfast. But the ease with which you can come and go in the city without the need for a taxi was a definite plus point and if you have a child at university then it is ideal. Great little pub round the corner too - The Bear.", "title": "Not worth the money??", "helpfulness": 1, "user": "JoCumbria", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145293118}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Enjoyed my stay at the Old Bank, was there for a week on business. Rooms are small by American standards but had all the amenities – bathroom was quite generous with a full size tub. Staff was very friendly and helpful, accurately directing me to various destinations and arranging for transportation. Hotel has some very cool art both in the common areas and in the rooms. They have a nice library to read/work and get quality free coffee. Great central location, can walk to many colleges and restaurants.", "title": "Very satisfied", "user": "Scott M", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145285656}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at The Old Bank in November 2012, our fourth visit as we have found it ideal previously. It has the best situation in Oxford, with ample, private parking behind the hotel, accessed via a very narrow lane; the sharp turn into car park will test those with large cars!", "title": "As good as ever.......", "user": "Mary C", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145257684}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The reception staff are outstanding, helpful and well-informed. When noise in the central heating pipes proved a problem, they offered us an immediate upgrade to a suite, which was spacious, and extremely comfortable, as was our original room.", "title": "Pleasantly surprised", "user": "grizzlybear99", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145164775}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "What can i say, but they have done it again. I've visited the Old Bank before and we had a lovely stay after a long drive up from Cornwall, but this time we chose it for a romantic break for a couple of nights. We had Room 45 in the attic which has the most beautiful view of the colleges and rooftops of Oxford. The room was spotlessly clean and the mini bar selection (with added farmhouse cheeseboard) was perfect for a cozy night in. Breakfast downstairs in the Quod was excellent as usual. One night we went to their partner restaurant at Gee's for a wonderful meal and listened to some nice jazz whilst we ate- well worth the visit. The hotel is perfectly situated in the centre of Oxford for walking and sightseeing as well as the shops (its also only a short drive to Bicester Village if you really want to hit the credit card!). An amazing hotel with wonderful decor and friendly well trained staff - truly one of my favourites.", "title": "A truly amazing hotel and a perfect base for seeing Oxford...", "helpfulness": 1, "user": "paulcl99", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146688570}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The Old Bank Hotel is in a fantastic location right on Oxford High St and is an excellent point from which to explore Oxford's city centre. However, for what you get, it is very overpriced. The restaurant Quod attached to the hotel is good for dinner but the breakfast is of poor quality. Some of the fruit (e.g. strawberries, oranges) put on the breakfast buffet were rotten, I would have expected attentive staff to have removed them. My soft-boiled eggs had to be sent back because they were under cooked, and it is poor if you can't boil an egg! The bread for the toast was thin and locked mass produced. The room was nice enough, but the decor in the library is very shabby, uncomfortable, uninviting and there is an unpleasant musty smell in that area of the hotel. I would recommend this hotel for location, but in terms of price, and quality it leaves something to be desired. I think it has gone downhill since my stay in March this year. The reception staff were excellent on arrival and leaving, but the breakfast staff (outside of the manageress) were fairly inattentive.", "title": "Great location but overpriced", "helpfulness": 2, "user": "OttoBunnyUk", "date": "December 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 146563387}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "We recently stayed at the hotel to attend a friend's wedding a short walk away. Location wise it was fantastic for that purpose, especially given we had a newborn baby. This together with the car parking on site were the main reasons for choosing this hotel.", "title": "Great location with some parking", "user": "Pleasure2holiday", "date": "November 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 146034348}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "All of the staff we had dealings with were excellent although it did take 40mins and a chasing phone call to get an iron and ironing board sent to the room.", "title": "Perfect location and a lovely hotel", "user": "Cuttingblade", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145381858}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "For the price, however, we were disappointed that the room was so small (35) and that breakfast was not included (although admittedly we knew that when we booked). That said the breakfast was nice. The room was also incredibly hot which was uncomfortable as we forgot to turn the air con on before we went out and left us feeling very thirsty. This was a shame as consequently we didn't sleep very well even though of baby did..so frustrating!", "title": "Good hotel with zero character", "user": "FloreatMagdalena", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145370089}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our son is at Oxford University so we have stayed in several of the hotels in the City. It's easy to see why The Old Bank is number one on Trip Advisor. We have eaten in Quod on several occassions but this was our first stay at the hotel. I spoke to Natasha when I made the reservation who was absolutely charming and very helpful, we were even given the room I requested which had a bow french door with small balcony overlooking the back of the hotel.", "title": "Lovely hotel but do check your bill carefully", "user": "slj60", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148713286}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "It was our son's 21st birthday the night we stayed so we didn't eat in the hotel as he was having a party in a bar up the road but we did enjoy breakfast in Quod the next morning ( our actual wedding anniversary) and it was good but I have had better.", "title": "Good location, services and food", "user": "IIJAYESS", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148656794}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel is modern but still retains character and the rooms are very well equipped and clean. For Oxford I think the hotel is fairly priced given the quality of the fabric and service they provide. However when we booked we were told our rate was for Bed and Breakfast and this was confirmed by email.", "title": "Stay here, you will be pleased you did!", "helpfulness": 1, "user": "TheHolidayQueen", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148519134}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "On check out I noticed we had been charged for breakfast, so I queried this with the young man doing the check out. This was removed, after he \"checked the booking\". We then sat down by reception to read the paper and wait for our son to meet us and two other people checked out and again I overheard they had been charged from breakfast when they were on the inclusive rate. Once is forgiveable, but twice is questionable so my advice would be do stay here, it is very good but do check your bill on check out.", "title": "Charm, Location & Bikes", "user": "JenY_Travels", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148387113}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Good service. Daily guide to what's on in Oxford. Discounts for Bicester village. Shoe shine. Umbrella when raining, all the services lacking at many hotels. Parking.", "title": "Superb- wanted to stay another day", "user": "Abijennie", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148339215}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 29, "very good": 176, "terrible": 5, "excellent": 452}, "aka": "Old Bank Oxford", "slim_ranking": 0.0232558139535, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located on the High with place to park and between Oxford’s most famous colleges, Merton, University, All Souls and Oriel. Step out of the hotel onto one of the worlds most beautiful streets and you are amongst the best of Oxford’s shopping, theatres, libraries and gardens.This Georgian, stone building has forty two luxury bedrooms, all air-conditioned with marble bathrooms, great views, the latest technology and Stimulating twentieth century paintings."}