{"user_rating": 4.0, "review_count": 214, "name": "Old Custom House Inn", "reviews": [{"rating": 5.0, "title": "Lovely, friendly pub!", "text": "Loved sampling the local brews, chatting with friendly staff and the general ambiance. The refurbishment is tasteful if not a little too modern looking for my taste. The food was nice and they were kind enough to plate up some chicken for our puppy! Lovely!", "user": "Lucia S", "date": "May 27, 2013", "id": 161957911}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Booked this last minute on what happened to be valentines day and were really pleased. Perfect central location, with car park just across the road. We were upgraded and had the front corner room with dual aspect views over the harbour which was superb. We had what now seems one of only two sunny days in the UK in 2013 and the windows opening over the harbour watching the fishing boats come in and out was superb. Perfect Padstow spot, nice room, great breakfast and helpful staff in reception and bar (I prefer fresh teas to take up rather than kettle in room and extra bit were supplied for us - thank you).", "title": "Last minute suprise", "user": "onefliesoneswims", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161680767}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I stayed at this hotel for two nights over a bank holiday weekend. The staff were very friendly and accommodating. The hotel is ideally situated at the front of the harbour as well as being central to the town. Parking is available (at a cost) in the public car park directly opposite.", "title": "Bank holiday weekend stay", "user": "Carey F", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160161663}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The bedroom was newly furbished and very pleasing, however I would not wish to stay at this hotel again unless the room was facing the estuary. Our room was on the first floor (over the kitchens) and had only one small window that faced into a small first storey roof courtyard that contained all the extractors from the kitchen. Opening the window for fresh air just meant the room filled with cooking smells which was not very pleasant. It was also quite dark in the room. Although we were warned there might be noise from the bar we were never aware of this.", "title": "great stay", "user": "Christine H", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159320930}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel is made up of more than one building so be prepared for steps and different levels when carrying your cases up to your room. We were however offered help in carrying our cases.", "title": "In the heart of the action", "helpfulness": 1, "user": "AussiesBallarat", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157896206}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We booked this hotel on a last minute decision based on online reviews. We were not disappointed. Location could not have been better, the service was very good and staff were friendly. Our room had a partial view of the quay, and had recently been refurbished so had a lovely fresh feel. We had a few laughs trying to remember our way back to our room as the hotel has an interesting layout with several staircases up and down on different levels. We had dinner at the hotel restaurant with great choice of food. both dinner and breakfast were excellent. Unfortunately the hotel does not have a car park but fortunately there is a car park right opposite but the cost is £7 day. Small price to pay for a great location.", "title": "Lovely hotel", "user": "Tooseysusie", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157545331}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is a review of the Barn, it's a self catering accommodation at the rear of the pub, available to rent from Cornish Horizons.", "title": "The Barn, The Old Custom House", "helpfulness": 1, "user": "Mark B", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 156987227}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "The Barn is perfect consisting of two double bedrooms both with en suite a lounge plus kitchen. It's located at the back of the pub and has its own parking space which is a godsend in Padstow!", "title": "Review for food only.", "user": "KDBanks", "date": "April 5, 2013", "detail_rating": {"cleanliness": 4.0, "location": 4.0}, "id": 156726140}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The accommodation is tastefully decorated throughout and has all you would expect, Tv, radio, WIFI, washing machine, dishwasher, cooker, fridge freezer, obviously you don't need to cook whilst in Padstow.", "title": "A Lovely Hotel", "user": "TiffersP", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155958663}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The larger of the two bedrooms has a single bed as well as a double in it. This place is perfect to explore Padstow and having a great base to do it from.", "title": "The Old Custom House, Padstow", "user": "Feefy", "date": "March 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154617640}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Don't be put off by the public spaces in this lovely hotel which is the reason I have downgraded by one point which, but for this, could have been a five out of five rating.", "title": "So much better than first appearances - highly recommended", "user": "Lemniot", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163694023}, {"rating": 4.0, "title": "Nice hotel, fantastic location", "text": "Not so much the restaurant or breakfast room which are fine having been recently renovated (breakfast by the way is very good) but the corridors and the outside of the rooms which are not helped by tired carpets and inadequate if clean decor. The rooms inside - we were upgraded for free to room 12 - are a credit to the St Austell Brewery who own this place.", "user": "Matthew G", "date": "June 8, 2013", "id": 163335632}, {"rating": 2.0, "title": "Mediocre, I'd avoid if possible", "text": "The view is splendid across the harbour but the room itself is lovely and airy with a great very large bed and super cotton sheets. Very crisp and clean throughout and a nice en suite bathroom. Loads of hangers and nice touches such as free tea and coffee and biscuits and toilet stuff.", "user": "Karen G", "date": "May 31, 2013", "id": 162494733}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Staff are delightful and very keen to help - again a credit to the owners.", "title": "Very relaxing", "user": "Thepans", "date": "May 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 162454876}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "In particular James. What a clever move to have a highly skilled computer expert on board to help out customers with their wi fi problems (as he did for me).", "title": "Outstanding", "user": "KasiaCe", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162208491}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "First impression quaint from then on it failed for price charged, very shabby enterance and shabby reception greeting like they were doing us a favour, I knew it had no parking attached to hotel but council one nearby which was full not recommend if you have a car!!! The room was clean and had a view, very noisy could hear people below and all around us, breakfast ok varied on the two days we styed there first morning good second morning not good at all. Upon leaving went to hand in key and reception person was on the phone could not even bother to get off the phone to take key, is this Cornwall hospitality.", "title": "Overpriced view", "user": "Penny B", "date": "March 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 153910538}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "First impressions were a very shabby entrance and awful reception desk. Upon walking up a very tatty staircase through a maze of doors we came to a small but nicely decorated room with a view of the harbour. The bathroom was nice but the toilet was butted up against the wall which was unpleasant, however, the bed and pillows were excellent and we had a very good night sleep. We felt that the price in low season at £130 a night was excessive for this level of accommodation but what really was, in my opinion, not good was the one and half breakfast window 8am till 9.30am and 10am check out (on a Sunday, really)! The check out time and breakfast window we felt was very poor for a room costing that much at an extremely quiet time.", "title": "Over priced", "helpfulness": 1, "user": "Karen S", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153226217}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Great Location, Fab Views, Nice Breakfast ... however I felt that a check out time of 10.00am on a Sunday was way too early. Breakfast also finished at 9.30 Most hotels during the weekend allow breakfast until at least 10-10.30 and checkout is normally 11-12. Out of season the room was still £160 and at this price I don't feel that this would be too much to ask.", "title": "Nice Views, Great Location. Check Out Time Too Early", "helpfulness": 1, "user": "CherylBl1", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153111480}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We were after a cheap, central location to explore Padstow on foot, and The Old Custom House was perfectly-located. Having driven there, we were able to park in the car park opposite since the hotel (which is actually a pub with rooms), had no parking. It was £7 for 24 hours - much better than where we came from! (Bath). The room itself had a harbour view, but since was on the first floor, it's not exactly picturesque. A bit of the car park, etc. But if like us you just wanted a base from which to explore Padstow on foot, it was perfectly fine. Off season in Feb (although n Valentine's Day), we paid £99 for a double with a harbour view, and got breakfast included from the next door restaurant Pescadou, which was excellent. Staff were friendly, and although the room was more functional than impressive, it was fine. Warm, spacious enough, ensuite was clean and roomy (although the energy saving lightbulbs took 20 mins to get bright!). Since we barely spent any time in there, it was what we were after, and could get around town, onto the beach, went on the ferry to Rock and had dinner at Paul Ainsworth at Number 6 (amazing food!). The pub itself is large, but modern and unremarkable. Sky Sports TVs, etc. Bar staff were really friendly and helpful.", "title": "Perfect location for exploring Padstow... but no frills", "user": "MattP1973", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152424443}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Padstow has so many options for eating and drinking (and no, you don't have to go to a Stein place!) that we didn't stay here to eat. But I would definitely consider staying here again if we return to Padstow.", "title": "Good Stay", "user": "Llangynog", "date": "February 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151915452}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 20, "average": 39, "very good": 79, "terrible": 6, "excellent": 70}, "aka": "Old Custom House Hotel", "slim_ranking": 0.660714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}