{"user_rating": 5.0, "review_count": 315, "name": "Old Harbor Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is a great B&B find, just a short walk away from Main Street but quietly located. Clean, comfortable and well kept B & B, cozy bedroom with fireplace. The extensive, delicious breakfast included fresh cut-up fruit, a fresh home baked item and more. We were invited to help ourselves to coffee and baked items which were available throughout the day and evening. We liked the many thoughtful touches like complementary water and soft drinks in the refrigerator in our room, a basket of snacks and robes in the room. The owners, Judy and Ray were warm, welcoming and very helpful and gave us great recommendations for restaurants and trips. We thoroughly enjoyed our three-night stay at this beautiful spot. We would return to this B & B.", "title": "Great long weekend getaway", "user": "micolsBedford_NH", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156431658}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "If you are looking to relax surrounded by beauty, comfort and a warm atmosphere, this B&B will not disappoint. You will love the staff, the decor, of this inn. I especially loved the sitting area with its fireplace, but our room was just as lovely to relax in. Judy and Ray are helpful as well as delightful and an unexpected homemade cupcake by Tanya sweetened the stay. I will be back.", "title": "A perfect getaway weekend!", "user": "Connie K", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155757496}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had such a wonderful stay here for the two nights! Even though it was the \"off season\", there was still plenty to do and see. Ray and Judy were helpful with dinner recommendations and what to see in the area. Breakfast was delicious and I've never stayed anywhere that was more hospitable. They took care of everything for us and made our weekend stay truly what we needed - a romantic getaway from everyday life. Thank you so much for everything! If you stay in Chatham, we definitely recommend this little home away from home.", "title": "Quintessential Cape Cod B and B", "user": "cnsmith84", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155198683}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Our stay at the Old Harbor Inn was a very memorable experience. The warm staff and owners were pleasant and friendly. Felt like being at home. The rooms were warm and comfortable and Tanya's cinnamon bread and Ray's waffles were to die for.", "title": "Wonderful location and excellent facilities", "user": "Ron G", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155055315}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Just returned from a two night stay at this property. One of the best well cared for places I have stayed at. Excellent location, fabulous breakfast, and helpful owners Ray and Judy answered all our questions re restaurants etc. I would definitely return again.", "title": "One of the Best B & B's I have visited.", "user": "Laurel C", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153860298}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We really haven't much to add to the previous reviews. Judy and Ray couldn't have been more gracious, the inn is lovely and immaculately kept. Our room, while not large, was well appointed and the bed was very comfortable. We really appreciated the free snacks, DVD's and internet (I hate when hotels charge for internet). Breakfast was delicious both days. All in all a wonderful getaway.", "title": "Lovely Inn - very gracious hosts", "user": "JohnAndTheresa", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157736612}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Just returned from another fabulous stay! We always stay here when we come to the Cape and wouldn't even consider staying anywhere else. Judy and Ray are wonderful hosts and are always available to answer any questions or help out in any way. The inn is very beautiful, comfortable, and immaculate with many special ammenities........snacks, drinks, DVDs, not to mention the delicious breakfasts! We can't wait till we can come back again!", "title": "Wonderful Getaway!", "user": "Donna4413", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157624531}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Thank you Judy and Ray for this great experience: beautiful house and decoration, sparkling and neat as we like, generous attentions (complimentary snacks and drinks, DVD's etc.), great location (3 mn walk to the city center) and a special mention for the amazing breakfast (fresh fruits, home-made mouth watering bakeries, daily fresh entrée, juices, cereals etc.)! A place we won't forget!", "title": "Just Great!", "user": "Dorothee_Sven", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157487827}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Hope to come back in the area just to be pampered at your place.", "title": "Romantic getaway!", "helpfulness": 1, "user": "DorothyM843", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157208291}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Dorothée and Sven", "title": "Great first stay in Chatham", "user": "443MichelleE", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156492790}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Evidence of the owners' attention to detail is apparent throughout the lovely Harbor Inn. We stayed in the very comfortable suite and it reminded me of the 'Princess and the Pea' as the four poster bed was so high off the ground I have no idea how a short person would climb into it! If I have any complaint, it is that the bed took up most of the bedroom. The room was beautifully and classically decorated with dark wood furniture and dark blue and white striped fabric. The bathroom was large, light and airy with generous supplies of towels, toiletries etc. the separate sitting room contained a sofa bed which was fine for our son. The public areas were spacious and well thought out. Breakfast was very good with some interesting and unexpected recipes. Coffee, tea and cake were available throughout our stay. The Inn is within easy walking distance of the centre of Chatham and also close to a bike hiring shop, which we used. We stayed late sept and the town definitely had an end of season feel.", "title": "A super stay", "user": "hjtWindsor_England", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150057856}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We chose Chatham to celebrate our 30 year wedding anniversary as we had never been to this part of the cape. The Old Harbor Inn was so charming and inviting. Owners Judy and Ray made us feel right at home. They surprised us with a gorgeous bouquet of flowers in our room for our anniversary along with delicious chocolates and a bottle of champagne! It was a great start to a wonderful visit to one of the most charming locations on the cape. Their help, Tanya and Roma, were also remarkable and truly invested in making sure we enjoyed our stay. The rooms were fantastic and the location was ideal.", "title": "30th wedding anniversary celebration", "user": "Jim L", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149262590}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We just returned from spending New Years in Chatham and stayed at the Old Harbor Inn. First night and New Years in Chatham is such a unique and wonderful experience, made only more wonderful by the accommodations at the Old Harbor Inn. The Inn is located just a few steps from downtown Chatham where most of the first night activities occur. Just park your car and walk to everything! Judy and Ray, the Innkeepers, and their Manager, Tanya, can't do enough to make your stay a pleasant experience. The breakfast served every morning is one of the best I've ever had. Snacks and baked goods are left out all day long as well as access to cold drinks, or coffee, tea, or hot chocolate. The rooms are spacious and very clean! The common room hosts a beautiful fireplace to either sit and talk to to other quests, or to just simply read and enjoy the warmth of the fireplace on a cold winter day or night. Judy and Ray are willing to answer all your questions and direct you on places to eat and things to see and do while staying in Chatham. If you are looking for that get away that is special I can't recommend a place better than the Old Harbor Inn. I am also very fussy and particular and don't give this kind of review to every place. Jeanne", "title": "A Wonderful, Relaxing Getaway", "user": "Jeanne M", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149180484}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This was our first experience staying at an Inn (B&B), and it was wonderful! Our room was warm and inviting,and the Inn was welcoming with a great location to Main Street, Chatham. The inn keepers, Judy & Ray were very gracious hosts, and when entering the Inn the smell of fresh baked goods and hot coffee filled the rooms. They were always available to make sure that all our needs were taken care of. I am looking forward to staying there again on my next visit to Chatham.", "title": "New Years - First Night Stay at Inn", "user": "Dianne L", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148704015}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The old Harbor Inn is a very special B&B in the center if Chatham Ma in the heart if Cape Cod.The owners have thought of everything to make your stay memorable from the charming public rooms to the exquisitely decorated bedroom to the scrumptious breakfasts.The Inn is walking distance to all the shops and restaurants in Chatham and a short drive to several beaches.Orleans and the National Seashore are just a longer drive away .Make sure you get a room on the second floor and not one if the newer rooms in the back.", "title": "Perfect little Inn in the center if Chatham", "user": "Admor", "date": "December 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148074548}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Just returned home from Chatham after a wonderful stay at the Old Harbor Inn. Owners Ray and Judy really made us feel right at home. They were so helpful with suggestions on everything from where to eat to what to see. I don't think they could have been more gracious. Tanya was a pleasure to speak to and she made some yummy treats. You will not be disappointed if you have the pleasure of staying at this great Inn on the Cape. The location is just off Main Street and within convenient walking distance to just about everything Chatham has to offer. If you are going to CAPE COD and chatham in particular you have to check this place out. The location is perfect.", "title": "Chatham Christmas Stroll", "user": "Tom P", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147237924}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My wife and I recently stayed at the Old Harbor Inn for our first trip to Cape Cod, after looking at several accommodations in the area, I have to say we made the perfect choice. The innkeepers, Judy and Ray made our trip wonderful with their warm welcome and all they great", "title": "Great Find...", "user": "morganhj", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147164307}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "recommendations of places to visit and restaurants to try out. The Inn is situated in a perfect spot, a short walk to wonderful stores and restaurants and if you don't mind taking a 30 minute walk, you'll be right at the beach. Breakfast was a delight each morning, I looked forward to the great combination of food,coffee and conversations with Judy and Ray.We will definitely be back to Cape Cod and the Old Harbor Inn and we will plan to make our stay longer next time.", "title": "Early December Christmas Stroll", "user": "Ozziedr", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147146717}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at this lovely inn using a BedandBreakfast.com gift certificate we received for our wedding a year earlier. It was a spur of the moment decision to visit Chatham the weekend of December 8th. It turned out bo be a great decision. It was Christmas Stroll weekend so all the shops were open and had cookies, tea, mulled wine etc. The inn's location immediately at one end of the Chatham center shopping area made it perfect for strolling. Everything was in easy walking distance.", "title": "Location, location, heaven", "user": "isch1075", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147073012}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Judy and Ray were lovely hosts - absolutely gracious and so helpful. The rooms are well appointed and maintained, and very comfortable. And they blueberry stuffed french toast for breakfast we incredibly good. We lingered over breakfast to enjoy it, the coffee, and conversation with them both and the other guests.", "title": "Extremely warm welcome", "user": "Alison T", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146791678}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 1, "average": 5, "very good": 15, "terrible": 0, "excellent": 294}, "aka": "Old Harbor Hotel Chatham", "slim_ranking": 0.1}