{"user_rating": 5.0, "review_count": 88, "name": "Oldchurch House B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "We stayed with Helen and Frank in December for our annual pre-Christmas jaunt. Once again, the welcome and service was first class. The accommodation is spacious and well appointed, and the friendly service is always top notch. I have lost count now how many times we have stayed with Helen and Frank, but I do know if you give Oldchurch House a try, you will definitely want to go back, as Kenmare is a delightful town close to the Beara Penninsula and the Ring of Kerry. Don't delay, book Oldchurch TODAY!", "title": "Top drawer bed and breakfast in Kenmare, Ireland", "user": "Rod I", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152533342}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "On our third stop in Ireland in Kenmare, we stumbled on our best B&B of our trip....#1 of 8. Vivienne was a marvelous and very welcoming host. Her gardens and the golf course at the rear of the house were especially enticing. The rooms were large, clean, well-appointed and comfortable...and the breakfast: WOW! Vivienne provided several excellent ideas for dinner and song, as well as some local sights. She and her B&B set the standard by which we compared all our other lodgings.", "title": "Best B&B on our trip", "user": "Gbraze", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150495584}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had a wonderful 2-night stay at Old Church House. Helen is a wonderful hostess and was very kind and helpful during our stay, recommending what to see and do, where to shop, etc. Breakfast was made-to order and we enjoyed the view of the golf course and surrounding hills during our meal. Our room was large and comfortable, as was the bathroom. Plenty of room for us to spread out. Very quiet, despite being very near the road, and we liked the view of the Old Church across the road. The location is perfect - we could easily walk into the main part of town for dinner or shopping and leave the car behind. We had a very pleasant, comfortable stay and would recommend it to anyone.", "title": "Irish comfort and hospitality at its best.", "helpfulness": 2, "user": "Karrie62", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146182402}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The Oldchurch House Kenmare is a great place to stay. It is just a small distance away from the centre. We were there for a night in summer. The rooms are very spaceous and very nice, the view in the mountains is great. The breakfast is wonderful. It was very nice to get a lunch packet for the day. And it was very excellent to get a lift for the first part of the Kerry way - all without any extra paying! Our landlady was very friendly ang gave us some good information for the evening in Kenmare.", "title": "Oldchurch House Kenmare - the place to stay", "helpfulness": 2, "user": "Kerrywalker2012", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 144484372}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Next time in Kenmare, we will definitely stay in the Oldchurch House again!", "title": "Favorite B&B of our Ireland Honeymoon", "helpfulness": 2, "user": "Susan M", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142999072}, {"rating": 5.0, "title": "Great place to stay!", "text": "We were delighted with our stay at Old Chuch House. The view from our room was spectacular. Helen could not have been nicer or more helpful. It is very close to the heart of town and the setting is charming. We highly recommend it!", "helpfulness": 2, "user": "Penny E", "date": "October 13, 2012", "id": 142731945}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My partner and I stayed here recently as we were down to attend a wedding locally. From the moment we arrived we were welcomed warmly by the owner Helen who even had a pot of fresh coffee and a slice of cake waiting for us which was then served in the front room which had stunning views of the surrounding mountains and golf course.", "title": "Wonderful place to stay!", "helpfulness": 2, "user": "CorkBlondie84", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142606022}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our bedroom was perfectly kept, modern and had plenty of amenities such as tea/coffee, water, magazines, TV, books etc with a great view of the Old church itself. A full breakfast was provided the next morning, again in the beautiful front room, a choice of cereals and fruit was also available. I cannot fault anything at all about the Old Church and wished i could have stayed another night! Frank and Helen thank you so much for your warm hospitality we will be seeing you very soon!", "title": "Homely B&B", "helpfulness": 3, "user": "Emma J", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142509982}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Homely B&Bring Co Kerry would be mad not to stop and stay at this homely and comfy bed and breakfast. Helen and Frank are the best hosts and look after their guests like they are family. On arrival my Husband and I were offered a cuppa and homemade cake. We stayed here to go to a wedding. If we planned our stay better we would have stayed another night. Our room was large and spacious overlooking the old church lots of room for your luggage equipped with fresh water, tea/coffee facilities, guest information booklet, magazines, local information leaflets. Large bathroom, excellent shower... The list goes on. This Bed and Breakfast is highly recommended. oh one more thing we were presented with a delicious hearty breakfast overlooking their lovely gardens. The next time we head to Kerry we will stay here again.", "title": "First-rate B&B", "helpfulness": 2, "user": "Deb P", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0}, "id": 142321954}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "What a beautiful B&B. Our room was spacious and well-appointed. The ensuite bathroom was large, and the shower excellent. Our room overlooked Helen's beautiful gardens and the 10th green of the Kenmare Golf Club - so peaceful after a day of touring. My husband wasn't feeling well when we arrived, and Helen immediately offered an assortment of herbal teas to help soothe his upset stomach. We chose to drive into town for dinner, but younger and more energetic legs could certainly walk to the main street instead. The breakfast/guest sitting room was bright and comfortable. Breakfast was freshly cooked and served piping hot, accompanied by lots of freshly brewed coffee. We stayed at B&Bs throughout our travels in Ireland, and Oldchurch House stands out as one of the best. It was a pleasure to be welcomed into your home, Helen!", "title": "Delightful Hosts", "helpfulness": 2, "user": "Heather M", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142315212}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Helen was so welcoming and made our short stay in Kenmare incredibly enjoyable. The room was quiet, the bed comfortable and the breakfast delicious! Helen made us feel right at home and while the weather was dreadful the night of our stay, the morning was gorgeous and the views from her back porch and breakfast room were incredible. Downtown Kenmare is very close (we drove due to the weather) and Helen was very helpful in recommending places to check out. Everything about Oldchurch House was great and we will definitely stay here if our travels bring us back to Kenmare in the future.", "title": "Great stop in Kenmare", "user": "MnL_Travels", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158529679}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "After driving for hours in pouring rain we arrived at Oldchurch House. Helen and Frank welcomed us like family rather than just another group of guests. The weather was too cold and wet for a stroll into town so Helen called a taxi for us. We had a great dinner at a place she recommended then walked across the street to hear music. The cab driver gave me his phone number and when we were ready to go back I called him and he was there in a minute. The rooms were spacious and immaculate. And what can I say about breakfast, except that it was generous and excellent. Make this place your number one choice in Kenmare. Nice town, not big and touristy like Killarney. Perfectly situated on the Ring of Kerry.", "title": "Best B&B in Kenmare", "user": "fishyflier", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158467668}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Helen and Frank really take care of their guests. they are friendly and informative. their place is very clean and breakfast is grand. very highly recommend old churchouse for anyone who plans on visiting Ireland or the kenmare area. 4 stars. :) this has been our 2nd visit with them and when we return to Ireland this is one place I will stay. good friends.", "title": "helen and frank rock", "helpfulness": 2, "user": "jabbo606", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156935736}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Stayed one night with Helen and Frank, wish it was longer. They are wonderfully warm people who make you feel right at home. The room was great, and would I highly recommend it to anyone who is visiting Kenmare, or travelling The Ring of Kerry. By the time we left we felt like we had made a friend. I would definitely stay there again, but for longer next time.", "title": "Denise & Keely", "helpfulness": 1, "user": "Denise S", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155995242}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Helen is a wonderful hostess. She is warm and inviting. The house reflects her personality. The gardens are beautiful and her view is wonderful. It is is easy to get to and close to downtown. It is a must! I'd definitely go again!", "title": "Pick this one!", "user": "Teresa J", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154573563}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We spent 2 nights with Helen at the Oldchruch House B&B. When we're back in the area, we'd surely stay again. Helen is really just the perfect B&B hostess and her home is lovely.", "title": "Lovely time, Helen is awesome", "helpfulness": 2, "user": "LagunaGrrl", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160402476}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "ROOM: We had the downstairs room at the front. The bed was extremely comfortable with super-soft sheets. Everything was very clean and well-maintained. There are rooms upstairs as well, but if you prefer to not carry luggage up, request this room. Good strong water pressure and hot water in the shower. Excellent wifi signal.", "title": "Very nice house and night's stay", "helpfulness": 2, "user": "Colin T", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 160181030}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "LOCATION: The B&B is a 10-minute walk to the town center. The walk is along a sidewalk and a straight shot with no turns. We preferred being just outside town rather than in the middle because it meant peace and quiet.", "title": "A wonderful stay!", "helpfulness": 2, "user": "Nichoillte", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159904237}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "PROPERTY: The B&B has a lovely breakfast room/living room area that is open for guests. It faces onto a wonderful view and is tastefully decorated. There's plenty of free parking at the front of the house, which faces onto the ruins of an old church (thus the name).", "title": "Nice!", "helpfulness": 1, "user": "Rebekah C", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159839650}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "PLUSES: Helen herself is a huge plus for your stay. She's just a natural at running a B&B and being available to answer any questions. Her breakfasts were so tasty and she took the time to introduce people to each other in the breakfast room, leading to some really great conversations. Can't say enough about Helen.", "title": "Excellent stay", "helpfulness": 1, "user": "alix1886", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158812617}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 1, "average": 1, "very good": 12, "terrible": 0, "excellent": 74}, "slim_ranking": 0.107142857143}