{"user_rating": 5.0, "review_count": 297, "name": "Olive Branch Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "To come to a B&B on a dark and rainy night in november, and feel a warm welcome as the door is opened is a great experience. At the Olive Branch Guest House in Broadway they even gave me sherry to warm up. Here it's high class down to the tiniest detail. The room was great with a comfortable and beautiful bed. And the breakfast was unforgettable, with several home-made cakes, a perfect smoothie, and the columbian coffee was rich and tasty.", "title": "Best B&B ever", "user": "Morten_Oslo", "date": "December 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11332388, "likes": {"liked": "— The breakfast and the teddy bear", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Recently returned from a visit to The Olive Branch. Beautifully appointed rooms - more in keeping with a boutique style hotel than a B&B. Spotlessly clean and stylish accommodation. A very professionally run establishment. Pam and David, the owners, are very friendly and welcoming. Breakfast was first class, lovely home made breads and the full english breakfast was nicely cooked to order. Here's to the next time!", "title": "The best B&B ever!", "user": "Sharrie7", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11199877, "likes": {"liked": "— Everything!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I stayed at The Olive Branch in September and could not recommend it enough. The hosts were extremely friendly and made us feel very welcome . Nice touches include the complimentary sherry on arrival, home made cakes and smoothies for breakfast and use of the garden.", "title": "The perfect B&B", "user": "SianBristol", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10609278}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "Next time I stay on the Cotswolds I won't even consider staying anywhere else.", "title": "Perfect stay", "helpfulness": 2, "user": "FF", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10085262}, {"rating": 4.0, "title": "Nice place, clean and comfortable", "text": "We hiked part of the Cotswold Way, a very scenic National Trail that connects Chipping Campden with Bath -- it is 160 km long, but we only walked 90 km of it. We had decided to overnight in Broadway after walking the short section from Chipping Campden (about 2 and a half hours). We literally stumbled into this B&B (we had made no reservation), and loved it at first sight.", "helpfulness": 1, "user": "rotherbyboy", "date": "October 12, 2007", "id": 10069599}, {"rating": 5.0, "title": "Hard to beat", "text": "We have returned from a 10-day stay in England. We started with a 6-night stay at The Olive Branch, a choice we made based on the reviews here. Our reservation was made more than six months ago, so we were happy to enjoy the same high standards mentioned by so many other travelers. Pam and David are top-notch proprietors and hosts and took very good care of us. Broadway was a perfect center for us and we expecially enjoyed being able to walk to so many good and reasonably priced restaurants in the evening. Zulu lived up to his reputation as a perfect host-dog and filled in nicely as a substitute for our black lab at home in a kennel. You will be pleased with both the beautiful town and with The Olive Branch Guest House.", "helpfulness": 2, "user": "2Maine", "date": "September 26, 2007", "id": 10007464}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled with family", "text": "Our stay in Broadway at the Olive Branch was wonderful. We had the delightful room at the top of the house (a bit hard to get bags up there), and had plenty of room for us and our two boys. I did think it had a ghost, which would normally terrify me but somehow it did not this time. We took delightful day trips from here to Sudbury castle, Stratford upon avon, Bourton on the Water, Warwick castle, etc. etc. It was a great home away from home. For a reasonable fee, Pam did two loads of laundry for us and we found it folded on our beds ready to pack for the rest of our incredible vacation. Go there, you won't be sorry!!", "title": "Incredible stay", "helpfulness": 1, "user": "praniw", "date": "September 19, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8823267, "likes": {"liked": "— Fun, clean, enjoyable", "disliked": "— Our stay was too short!!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We have just returned from a 2 night stay at the Olive Branch and can honestly say that it was wonderful. Pam and David have thought of everything, including a hot water bottle (not that we needed it in the warm September weather!), spare light bulbs, complimentary sherry etc., and it's those small personal touches that make the Olive Branch stand out from larger 'anonymous' hotels. The guest house is spotlessly clean, very quaint and Zulu, the dog, is gorgeous. We all love our food and we certainly were not disappointed with the beautiful breakfasts, including Pam's wonderful baking and smoothies. Broadway is beautiful as ever, and the walk up to Broadway Tower is hard work but worth it!", "title": "Lovely place", "helpfulness": 1, "user": "winelover33", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8715911, "likes": {"liked": "— location, wonderful hosts, breakfast!", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This is an exquisitely beautiful town and same can be said for The Olive Branch. Pam and David are very warm and friendly with time to spend for a chat & ever-ready with advice.", "title": "Superb", "user": "DannyShez", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8456029, "likes": {"liked": "— The decor & friendliness and cleanliness", "disliked": "— No internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Tripadvisor.com led us to the Olive Branch, and we are so grateful. Having stayed in Broadway 30 years ago with my parents, I was eager to show the village to my children. I avoided the Lygon Arms because of the reviews, and what luck we had!", "title": "Don't miss the Olive Branch! Wonderful hosts in beautiful village!", "helpfulness": 1, "user": "mrsstinger", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14835935, "likes": {"liked": "— The hosts - Pam and David Talboys", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "lovely location, friendly hosts", "text": "David and Pam are warm, welcoming hosts who provide for every need - welcoming sherry in the parlor, DVDs for the kids, a heated towel rack, etc.! Other guests at breakfast were friendly, and we found ourselves eating more than we intended to because everything was so good! My daughter claims that no one makes hot chocolate as good as Mrs. Talboys' and I am still missing the warm cheddar scones and passion fruit smoothie.", "user": "pjtuk", "date": "March 28, 2008", "id": 14615868}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Rooms are quaint and of typical size for English B&B's, in my experience. And I would be remiss if I didn't mention Zulu, the Talboys' dog/entertainment center for the children.", "title": "Can't wait to go back!", "user": "IrelandBirdy", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14260571, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Broadway is a beautiful little village, but be prepared for limited (and somewhat expensive, at least for U.S. visitors) restaurant choices if you don't want to brave the winding Cotswolds roads in the dark for dinner. It took us about half an hour to get to Stratford and a few minutes past that to get to Warwick Castle. Don't miss the Falconry Centre and be sure to arrive in time for the demonstration!", "title": "Just stay there", "user": "miller58", "date": "February 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13544947, "likes": {"liked": "— The personal attention by the owners.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "In sum, The Olive Branch clearly deserved the honor it received a few years ago for best B&B. Pam and David are wonderful hosts who make you feel a part of their family - an honor, indeed. If you've never stayed in a B&B before, you risk becoming spoiled - most are not this good.", "title": "Outstanding B & B", "user": "viaggetto", "date": "December 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11550606, "likes": {"liked": "— The hosts who were most friendly and helpful"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We absolutely loved the Olive Branch. We usually stay in hotels but wanted to experience a B&B in the Cotswolds...and we were blown away. We received a very warm welcome from Pam and David and Zulu(the dog). They were the perfect hosts. They met us at the parking lot and helped us with our bags as soon as we drove in. We have never felt so welcome in a hotel/B&B. Pam has such a warm and fun personality; it was a joy to meet her.", "title": "Perfect location, Wonderful hosts, Delicious Breakfasts", "user": "PVmomontherun", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18397495, "likes": {"liked": "— Wonderful hosts delicious breakfast and beautiful setting", "disliked": "— None"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed in a charmingly decorated family room on the 2nd floor. The room had a King sized bed and 2 twins. It was perfect for our needs. I am very particular about cleanliness and the room felt and smelt clean. I have to acknowledge the fact that David and Pam juggled their rooms in order to give me a family room for the 2 nights we were there ( I only had a confirmed reservation for a family room for 1 night). The fact that they went our of their way to do this is a testament to their concern for the comfort and well-being of each and every guest.", "title": "Beautiful rooms", "user": "Segwaysrock", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17202792, "likes": {"liked": "— The rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The breakfasts were absolutely delicious with homemade banana,muesli and fruit breads, Pam's delicious smoothies and David's perfectly cooked English breakfasts. You could not have asked for a better breakfast. It was served each morning with a smile and a wonderful atmosphere(very friendly and warm). They even served hot chocolate to our 2 boys in a tea/coffee pot... My 2 boys felt so pampered... and so grown up pouring hot chocolate from a beautiful tea/cofee pot.", "title": "Beautiful building and very attentive hosts", "user": "Angel_Delightful", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16848278, "likes": {"liked": "— Location, 4 poster bed, good shower, complimentary sweets/chocs/tea around, friendly hosts", "disliked": "— small room, cooked breakfast, maybe a tad over-priced"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The setting of the B&B is also absolutely perfect. It is on the high street and is about 2 minutes walk from the center of town. It has a very picturesque setting against the backdrop of the hills. I will try and post a picture of the Olive Branch as you approach it coming back from the center of town.", "title": "The best Bed and Breakfast in the UK", "user": "adele55", "date": "May 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16268944, "likes": {"liked": "— The owners warmth and hospitality, breakfast, location, welcoming sherry", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I have to add that although I am a little bit scared of dogs, Zulu made me feel so comfortable. He is the Perfect Host Dog.", "title": "a wonderful place to stay!", "user": "ruverma", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15510562, "likes": {"liked": "— The hosts, the room", "disliked": "— 2 night minimum over weekend"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 1, "very good": 17, "terrible": 0, "excellent": 278}, "aka": "Olive Branch Guest House Hotel Broadway", "slim_ranking": 0.0322580645161, "description": "The Olive Branch Guest House, Broadway, is a 400 year old building having been built in 1592. Situated in the quiet, upper High Street and offers the very best accommodation with the modern comforts of the 21st century whilst still retaining the charm of the 16th century. All our rooms have been tastefully decorated and are equipped with colour TV (with satellite), radio alarm clocks, top quality bathroom and welcome trays. Truly 5 star accommodation."}