{"user_rating": 4.5, "review_count": 1239, "name": "Omni William Penn Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I were in town for some baseball games and wanted a hotel close to the stadium (10 min. walk) and was reasonably priced. And we defintly got what we wanted with the Omni William Penn. I was amazed at the low prices for the hotel (for the quality of the place, they could've asked for double and even triple what we paid). Our room was huge (it was a king room) - only down side to that - the TV was a million miles away from the bed across the room. The bathroom was a tad small, but very nice. Everything was very clean as well. The staff were all very helpful and attentive. We didn't get in to any of the restaurants in the hotel, but did get some room service and it was very yummy. We've stayed in many hotels all around the world and I'd have to say this hotel is up at the top of our list.", "title": "Beautiful Historic Hotel", "helpfulness": 2, "user": "KPOmalley", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8457562, "likes": {"liked": "— Huge Room, Beautiful Lobby, Friendly Staff, Comfy Bed, Convient to Stadium", "disliked": "— Small Bathroom, Room so big - TV's far away across the room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Booked this on priceline and was thrilled to see the name of the hotel after offer was accepted. I took my two boys to see their first major league baseball game at PNC Park last night (Pirates vs. Phillies). The disclaimer on priceline says only that a room for two adults is guaranteed. I called the hotel directly the day before we arrived and was told that we were given a King non-smoking room. I requested two double beds and the agent said she would note it. When we checked in yesterday we were indeed given a room with two doubles and it was HUGE. I know this is an older hotel so I was amazed by the size of the room. Bathroom was all marble and water pressure in the shower was awesome. The desk agent also ordered a milk and cookie turndown for my two boys - how cool is that??? Sure enough, we returned from the game and they each had two cookies and a carton of milk waiting for them - they were thrilled. Overall, the stay was fantastic from location and amenities to staff and decor. I can't recommend the Omni William Penn highly enough.", "title": "fantastic all around", "helpfulness": 3, "user": "DullardSpillmore", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8451078}, {"rating": 4.0, "title": "Good value", "text": "Beautiful historic hotel in Pittsburgh, I've stayed at most hotels in Pittsburgh and short of the Renaissance, this is next best. The lobby is beautiful, and it's a nice convenience to have Starbucks and Brueggers in the ground floor of the building. Also the free downtown subway line across the street was useful.", "helpfulness": 1, "user": "profriars", "date": "August 18, 2007", "id": 8447654}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Only negatives is the rooms need a bit of updating. Strong smell of cleaning solution when entering. Found dark red stains in the carpet in the corner of our room, also the sink fixtures were hurting. The drain was rusting while the two faucets had visible screws that were holding them in. (flathead for hot, phillipshead for cold!) Not the kind of finishes you expect in a four-star. A bit of an antiquated air conditioning system as well. These items may sound bad but overall were minor. But sometimes its the little things...", "title": "Omni Wm Penn ~ A Great Grand Value ~ Happy Times On A Hot Weekend", "helpfulness": 2, "user": "rwa", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8422634, "likes": {"liked": "— Grand classic hotel room at a good rate.", "disliked": "— Parking options may not be ideal."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Overall would recommend.", "title": "America's Best!", "helpfulness": 1, "user": "susaness", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8419286, "likes": {"liked": "— The comfort, luxury and history of the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I have stayed at the Omni at least 4 times a year for the past 3 years on business and have always found it welcoming and homely.", "title": "Reliable, good location", "helpfulness": 1, "user": "TBUK", "date": "December 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11458438, "likes": {"liked": "— Location and value for money", "disliked": "— Slightly dated decor in most guest rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The location is excellent for downtown Pittsburgh, and you are no more than a few blocks from stores such as Macy's and Saks.", "title": "Lovely Experience", "user": "alynn", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10921299, "likes": {"liked": "— T"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I recommend getting one of the refurbished rooms on the 6th floor if possible, as these are much better than the slightly dated decor on other floors. However, for the rates I normally pay here, I have no right to complain!", "title": "More style than substance", "helpfulness": 2, "user": "terryjgardner", "date": "November 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10914687, "likes": {"liked": "— T", "disliked": "— Lack of attention to detail in some areas"}}, {"rating": 4.0, "title": "Elegant Hotel", "text": "Overall, I would recommend this hotel.", "helpfulness": 2, "user": "Ksquared26", "date": "October 26, 2007", "id": 10357074}, {"rating": 2.0, "stay_parameters": "Stayed October 2007", "text": "My husband and I and another couple stayed here 11-16 for Light Up Night in downtown Pittsburgh. I could not have been more impressed. From check in everything was smooth and efficient and everyone that worked there was kind and courteous and it really was a wonderful experience.", "title": "Reservations mean nothing", "helpfulness": 3, "user": "berres215", "date": "October 26, 2007", "detail_rating": {"front_desk": 1.0, "location": 5.0, "value": 4.0}, "id": 10342330}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "The service at the Omni was excellent during our stay - very warm and helpful. Every time we asked for anything, they were more than happy to accommodate. The rooms are a comfortable size, and thoughtfully furnished. The beds are especially comfy. There is a Starbucks in the lobby. There were a few oddities for a 5-star hotel, such as: no minibars in the rooms (apparently available upon request), and no dvd player in the room, or even available to borrow or rent. We enjoyed our stay and would definitely return, but I would say this is an exceptional 4-star property, not quite a 5-star.", "title": "excellent service, just a few oddities", "helpfulness": 3, "user": "hollymnyc", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10243559}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "We have stayed im Omni Hotels several times and this makes our second to this. We realized the great deals we could now get on Priceline. Its a great hotel and the service was the same as our previous visits at rack rate. The rooms are great and newly rennovated. The lobby has a pianist on weekend nights, its the sure bet for Pittsburgh", "title": "Great Hotel (again)", "helpfulness": 2, "user": "cookbritish", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10087148}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The exterior of the Omni William Penn fails to provide evidence of the high quality that awaits visitors upon arrival. The hotel is located in the center of downtown close to all major office towers. Both Macy's and Brooks Brothers are in the same block of the hotel, which speaks well of the neighborhood surrounding the OWP. I arrived very early in the morning and called the hotel in advance to see if my room could be ready at 8:00 AM. While most hotels would never allow check-in at this ridicilous hour, the OWP was more than happy to approve my request.", "title": "Penn-Tastic!!", "helpfulness": 3, "user": "gfkr2", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10068468, "likes": {"liked": "— Professional Service by Hotel Staff", "disliked": "— So-So Air Conditioner"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "My room faced due east and was bathed in sunshine on my arrival. It would large for what one considers as a standard room, and filled with high-class furniture. The bed was extra confortable compared to most other hotels. My bathroom was particularly clean. I always expect to see a little mold and chipped paint in the bathroom- None Here at the OWP. I found the daily maid service exceptional. The maid left plenty of towels each day and clean-up after my making a mess with dirty shoes one day. My only complaint about the room was a less than expected air conditioner. The AC struggled to keep the room cool enough to my liking, although outside temperatures were in the 80's.", "title": "Who could want more?", "helpfulness": 2, "user": "quaznoid", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10025627, "likes": {"liked": "— It's extraordiary---so much luxury at a reasonable price", "disliked": "— That I couldn't stay there forever"}}, {"rating": 4.0, "title": "Fruitful, few pits", "text": "I found the variety of food and drink above average. I dined in the Terrace and was particularly fond of the breakfasts. There were ample trained waiters who made dining here worth staying in the hotel. There is a Stabucks and Bruegars Bagels on premises for those looking for a quick bite. I also frequented the Tap Room that was packed with fans before a hockey game at the Mellon Ctr. The drinks were cold and storng to my liking.", "helpfulness": 4, "user": "Dangank", "date": "September 22, 2007", "id": 8852028}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My wife and I stayed here last year for a wedding. We found the room to be extremely comforable and well kept. The bed was the best bed we have ever slept on, it was honestly like a cloud. My wife and I are both chiropractors and have invested money into a very nice bed for our home and found this bed to be much better. Overall the service was nice, the hotel lobby area was great to hang out pre and post wedding, however the only problem we had was really a matter of principal. There is a spa within the hotel, my wife called the front desk to be transferred to the spa to change an appointment, she was told that she would have to call them directly, my wife inquired if there would a fee involved for which she was told there would not be a charge. Upon check out we discovered that there was a $1.50 telephone charge added to the bill, we had to argue to have it removed and were made to feel as if we made a ridiculous demand. Frankly, it is a matter of principal, the spa is within the hotel, the front desk representative indicated there was no charge, for us it was a matter of principal. Other then that incident we had a wonderful stay.", "title": "Awesome overall", "helpfulness": 2, "user": "dharmadc", "date": "September 21, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8839658}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This is a elegant hotel and quite classic, but yet I felt comfortable even in my shorts/t shirt.", "title": "A classic hotel", "helpfulness": 1, "user": "mseverywhere", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8699912, "likes": {"liked": "— All good.", "disliked": "— None"}}, {"rating": 4.0, "title": "Great weekend", "text": "The room was tastefully done, and the bathroom was good size.", "helpfulness": 1, "user": "ross1ad", "date": "September 7, 2007", "id": 8670713}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Really enjoyed my stay.", "title": "This was 4-star??", "user": "uofmrapper", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8618808, "likes": {"liked": "— Location, Beds, Priceline offer of $80/night", "disliked": "— Poor service, lame views, lack of standard amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My husband and I stayed at the William Penn for a weekend last month. This was our second visit to the hotel and we would definitely return. Staff was friendly and made check-in a breeze. The room was spacious and the bed super comfy!", "title": "very nice hotel", "helpfulness": 2, "user": "lcosette", "date": "August 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 8524062, "likes": {"liked": "— the beds", "disliked": "— nothing, really"}}], "location": {"country": "United States", "city": "Pittsburgh"}, "stars": 4, "variance": {"poor": 36, "average": 91, "very good": 346, "terrible": 19, "excellent": 747}, "aka": "Omni Hotel Pittsburgh", "slim_ranking": 0.0294117647059, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This classic downtown hotel, known as the \"Grand Dame\" of Pittsburgh, has defined history and elegance since its opening in 1916. A recent multi-million dollar renovation modernized this property to meet the needs of today's traveler. This luxury property is known for its outstanding service, guest room accommodation, and award-winning dining. The Omni William Penn is situated in the heart of downtown with easy access to sporting, culture, shopping and dining."}