{"user_rating": 4.0, "review_count": 1118, "name": "Omni La Mansion del Rio", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I stayed al La Mansion for Christmas. The rooms were very clean. Although the hotel was very full, they managed to find three rooms on the same floor for all our family members. The Concierge was very helpful before we arrived--helped us with dinner reservations, mass schedules at local churches for Christmas--and extremely helpful and efficient while we were there. Valets also very helpful with driving directions. We had three rooms with river views, perfect for viewing the lights. We worked out at the sister hotel, the Watermark. The facitilies there were excellent and very clean. Our Christmas Eve dinner at Las Canarias was outstanding. It was a great place to enjoy the holidays.", "title": "Great stay at La Mansion", "helpfulness": 2, "user": "Westwind13", "date": "December 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4301588}, {"rating": 3.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "I was in town for a conference. My wife attended with me. The La Mansion was listed on the conference list with a good price. The price was good and I was happy with the location. The walk to the convention center was nice either on the riverwalk or street level. I dont think the hotel should be rated above 3.5 of 5 stars. Here is a list of some good and bad points:", "title": "It was OK", "helpfulness": 2, "user": "BigBenNelson", "date": "December 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4230266}, {"rating": 5.0, "title": "A wonderful trip to San Antonio", "text": "Good--", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4160765}, {"rating": 1.0, "title": "La Mansion Way Below Par", "text": "The location. Its far enough from the busy part of the riverwalk to not impeed the area but close enough to get anywhere quickly on the walk.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4149239}, {"rating": 1.0, "title": "On The Decline", "text": "The Staff was very good and helpful. Our room wasnt ready when we arrived. The bellman took our bags and placed them in our room when it was ready.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 26, 2005", "id": 4145158}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I have stayed at this hotel several times and am more impressed each time. Every staff member is friendly and gives exceptional service. It is not new, but a very elegant \"classic\". Remodeling was going on during our stay, but it did not bother us. If new and shiny are more important to you than quality and class, then you might want to stay elsewhere. This hotel is for those who appreciate old world charm and service.", "title": "Fabulous stay", "helpfulness": 5, "user": "Travelholic55", "date": "September 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3913820}, {"rating": 1.0, "title": "Horrible Experience", "text": "I might advise those who are allergic to feather pillows to look in the closet for a standard pillow.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 15, 2005", "id": 3907698}, {"rating": 5.0, "title": "Festive and Fun", "text": "We ate at the Champagne Sunday Brunch for the first time on this trip and were amazed at the variety and quality of the items served. We will definitely make time for the brunch on our next stay. We cannot imagine staying anywhere else in San Antonio.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3904211}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The rooms were dirty. The hotel is under some construction and it's a good thing because I thought this place was a dump. I have stayed at nicer two star hotels. I travel alot too, two to four days a week. The linens were old and dingy. The noise was unbearable, I had to move at 12:30 pm because I could not take it anymore. The a/c in that same room froze up. The beds and the pillows were the worst and they had nasty old smell to them. I will never stay here again.", "title": "Irresistible", "helpfulness": 5, "user": "wherearewegoingnext", "date": "September 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3879947}, {"rating": 5.0, "stay_parameters": "Stayed March 2003", "text": "We have stayed at La Mansion many times. It is our favorite hotel in San Antonio - very nice, very clean and staff is always very accomodating.", "title": "We Loved Mansion Del Rio", "helpfulness": 3, "user": "wintersummer", "date": "August 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3814875}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Decided to take my lady to San Antonio for V-day and the Omni looked reasonable and nice. The only issue we had was with the receptionist that checked us in. I had planned a few surprises for my girlfriend and the receptionist (Krystal, I believe) read them off out loud! My GF heard all of the plans I had made and luckily she wasn't too upset that the receptionist had ruined the surprise. Other than that, the concierge and service was great.", "title": "Nice place..dumb receptionist.", "user": "baltusmcgilroy", "date": "February 12, 2009", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 24512040, "likes": {"liked": "— amenities", "disliked": "— bad reception service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "Excellent location in the active heart of the River Walk. Nice public areas including swimming pool and exit right onto the River Walk.", "title": "Great Location, Friendly Staff, Nicely appointed hotel", "helpfulness": 1, "user": "CMMNYC", "date": "January 19, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23713457}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "Standard room was fair sized. Room enough for a King Sized bed, large desk (with convenient electrical outlets and internet hook-up) and love seat. French doors opened onto a common covered walkway/terrace. Bathroom was standard size with nice marble countertops, handheld (not wall mounted) hair dryer and a convenient vanity table with lighted magnifying mirror outside of the bathroom. Not a lot of storage space for clothing (a few small drawers and small closet) but overall very well appointed – brick wall, good lighting, nice flat screen TV. Not a big selection of pillows (two larger feather pillows) but the bathroom had robes.", "title": "Fantastic!", "helpfulness": 1, "user": "kjoyo", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23248532, "likes": {"liked": "— Wonderful location!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The staff was very friendly and the hotel was well maintained.", "title": "Pro's & Con's", "helpfulness": 1, "user": "Maelstrom88", "date": "January 3, 2009", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 23214153, "likes": {"liked": "— Location", "disliked": "— Noisey elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "One slight drawback noise-wise in my room – 6th floor overlooking small courtyard –the somewhat loud bus sounds from the nearby stop were easily heard, earplugs did the trick in drowning it out.", "title": "Great Location, Good Service", "user": "VisionTvl", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 23075115, "likes": {"liked": "— Great location", "disliked": "— Bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We recently stayed at the Omni La Mansion and loved it! (We are partial to the Omni Hotels chain) Check in took all of about 3 minutes - so quick and easy! She informed us that we have use of the gym at the Mokara across the footbridge on the other side of the riverwalk, and to bring our bathing suits, as they have a nice pool too. Don't get me wrong, the Omni's pool is very nice, but we went over to the Mokara and WOW :) What a beautiful and relaxing rooftop pool. Upon resting our stuff down on their towel covered beyond comfortable lounge chairs we were greeted with lemon ice water, chilled Evian misters, SPF 30 lotion, and chilled washcloths with cucumber essence. My husband loved their gym too! Back to the hotel --- the room is on the small side, but I expect that considering it is a historic hotel. The bed was so comfortable - we slept so soundly! And we loved using the free beverage service as our \"alarm clock\" every morning. Everything was neat and clean. All the staff is friendly and accommodating. The location can't be beat! My one \"complaint\" is the lack of a dresser to unpack. You only get three small drawers. Good thing we were only there for 4 days total!", "title": "Beautiful Historic hotel on the Riverwalk", "helpfulness": 2, "user": "LisaP090310", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115996753}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I stayed here with my boyfriend on Monday night on a quick trip to San Antonio. The location is just fantastic - right in the middle of the best part(s) of the River Walk.", "title": "Fancy/Modern meets Historical", "user": "Fotopunk", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115981432}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The valet was pricey $30/night, but convenient and friendly. The room was beautiful and we had 2 balconies overlooking the riverwalk. Everything was clean and seemed new inside, despite the old historic building. We wound up being grateful for the sound machine as late night riverwalk goers seemed to be partying a bit and sound traveled. we slept well - the bed was super comfy. Bathroom was really nice and clean/modern, but Hot water took forever to heat up.", "title": "Wouldn't stay anywhere else in San Antonio", "user": "Tman312", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115974194}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I would come back and stay at this hotel, even though it was a little pricey.", "title": "Fabulous Hotel", "user": "DarleneSanJose", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115944462}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Great hotel, location, service & rooms. On the River Walk, River Walk views w/balcony a must. I've been going back for years. While the hotel has changed owners several times, it never fails to impress. We'll be back on our next visit to San Antonio.", "title": "Perfect place to experience the Riverwalk", "user": "lahanson", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115892377}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "I am not sure if we could have found a better hotel for our vacation! Everything about the Omni la mansion exceeded our expectations in every way. The service was great, location was perfect directly on the riverwalk, and certainly the cleanest. We haven't had to move our vehicle once, were able to walk to everything.", "title": "Simply amazing!", "user": "Chase47", "date": "May 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 109253563}, {"rating": 5.0, "title": "authentic and charming", "text": "My husband and I spent three nights at the Omni. If you want to experience an authentic \"Old World Mexican\" feel, then this is the place for you. The hotel used to be a college and law school and then was transformed into a hotel. They did a magnificent job of joining the old architecture with the modern conveniences every traveler wants. Here are a few things I'd like to share:", "user": "karenofpa", "date": "May 20, 2011", "id": 109143109}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "1. Every day there is a complimentary refreshing drink in the lobby.", "title": "Broken Promises and lots of I'm sorries", "helpfulness": 1, "user": "ShelleyClark", "date": "May 11, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 107805007}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "2. From the terra cotta tile floors in the lobby area, walkways, and balconies to the furniture and decor of the rooms, and the beautifully landscaped courtyard areas - this hotel is spectacular. I loved the wooden beams and exposed brick in the room.", "title": "Specifically state what view you are after!", "helpfulness": 2, "user": "Tx_jetsetters", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 107690082}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "3. Loved the ceramic coffee mugs in the room. Much classier than styrofoam cups!", "title": "Wonderful....", "helpfulness": 1, "user": "msrdh", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106957527}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Hotel is located in a quiet part of the River Walk, but still very close to everything. Stayed there with and without kids (it is great for both - our kids love this place). The rooms are very quiet even with noise outside, and the black out shades keep the room pretty close to pitch black, making for great sleeping. The hotel staff has a great attention to detail and was very accommodating and friendly. It has made our stays pretty enjoyable.", "title": "Our Favorite", "user": "emrtes", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118393570}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The strong points for this hotel are its amenities: the restaurant, the bar, the Riverwalk access, the great and reasonable room service, an excellent concierge, and access to the Mokara Spa and fitness center across the charming foot bridge over the river. The hotel is a historic building that has undergone numerous changes over century+ of its existence and is a bit convoluted to get around with rooms reflect the tastes of a much earlier era.", "title": "Great service and a great location", "helpfulness": 1, "user": "jax848", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 118310265}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The staff went out of their way to provide for our comfort and were gracious and laid back. We enjoyed our stay here and would recommend it with a couple of caveats. One, street noise from college street starts up at 6 a.m. on weekdays. Two, there is limited space in the room for luggage-just one suitcase rack. Three, the late night room service menu is limited, take a cab to LuLu's instead.", "title": "nice but small rooms", "user": "mrgreene36", "date": "September 15, 2011", "detail_rating": {"value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 118161861}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Just stayed at Mansion Del Rio in San Antonio, Tx. Paid extra for riverfront room. It was small with tiny bathroom and limited storage space. Great Sunday buffet. They have a sister hotel across street that looks very nice. I would stay there next time.", "title": "Feeling the Heat in San Antonio", "user": "lidia111", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118148847}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Whan planning our trip in April, who would have know the whole country would have a heat wave! However, we decided to make the best of a a short getaway. The Omni La Mansion hotel was great. It had a Spanish Colonial feel and you reall felt like you were in Texas. Being right on the River Walk, your could just walk out the back and start exploring this great area. Hotel staff was wonderful and more than accomodating. The pool also helped after we finished exploring and needed a cool down. The biggest dissapointment on the River Walk was the food at the restaurants. Although all were packed each night, the quality was more like \"tourist food\" rather than the quality described on their websites. Two exceptions were Boudro's which was very good and potions were large and Mi Tierra Cafe in Mexican Village. It is worth the short mile or so trip to Mexican Village to shop the stores and have lunch or dinner at Mi Tierra Cafe. Besides being an unbelivable sight for the eyes (very flamboyantly decorated) but I had the best port tacos ever (I still dream about them). Worst dinner experieces were at The Fig Tree (extrememly overpriced and service horrible) and Casa Rio (where not only was the food mediocre but the waitress kept screwing up our bill and ignoring us for most of the evening). Other wonderful exepiences included the Alamo, Mexican Village and just strolling the River Walk.", "title": "RIVER ROMANCE", "user": "FtWorthTexasTraveler", "date": "September 12, 2011", "detail_rating": {"location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 118031932}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "My husband and I had a small anniversary party in one of the suites overlooking the river walk. The hotel made u fee like we were a top priority. They made my part guests feel like royalty as well. The concierge organized a carriage ride to our restaurant for dinner and a timely return. Once we returned the hotel was very accomodating in making sure our appetizers and cake were delivered on time as directed. The manager also gave us a nice card and bottle of champagne. I am very picky and I really appreciated the staff showing us four different rooms to help us find the perfect one for us. The only downfalls was that the hotel does not have a spa or fitness center. You have to use the one at the hotel accross the bridge. And the elevators were not very fast nor did them seem to have air. Despite those negatives it is very charming and romantic. Not to mention it is in the best location in town; the san Antonio River Walk.", "title": "Top Priority", "user": "foxyb03", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115872067}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Absolutely perfect! Excellent service, wonderful clean room, upgraded to river view for no apparent reason, ideal location. Would love to go back again!", "title": "If I could rate them higher than a 5 I would!", "user": "thatcherc2", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115861376}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed at the Omni La Mansion for four nights and enjoyed my stay. The staff is so helpful and nice. My room was lovely and I especially liked the balcony overlooking the river walk. I had lunch in their bar, El Colegio, and I loved the interesting menu and had a fabulous duck confit salad. I would have liked to gone back and tried more items! I was there for business and we had a reception and the food was amazing. During the meetings, the meals for our group (breakfast and lunch) were great, particularly the breakfasts with a Mexican flair. The staff 'catering to our needs' were wonderful. All in all, many thumbs up!!", "title": "Beautiful historic property right on the River Walk", "user": "SFCupCake", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115860879}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I travel to San Antonio often and stay at Omni La Mansion del Rio. We always have the most amazing stay at this hotel. Our last visit was our honeymoon August 2010. We arrived late and the staff brought us chocolate covered strawberries and champagne!!!", "title": "We always stay at this wonderful hotel", "user": "jlbourg7", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115814358}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The staff are freindly and have a service attitude. They are always willing to accomodate us on anything we need.", "title": "Classic style, amazing service.", "user": "mikevt1966", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115758541}, {"rating": 5.0, "title": "Great December Rates Through SA Convention & Visitors Bureau", "text": "The San Antonio Convention and Visitors Bureau offered great rates at this hotel. We even got a room overlooking the Riverwalk, but it was on the 6th floor. We had that same tree blocking our view, but it was so cold that we didn't spend any time out on our two balconies. The room was beautiful, with wooden beams and a brick wall. I especially liked the make-up area, which was a long counter between the room and the bathroom. It had very good lighting. The only problem we had was with the concierge. We had been told, prior to booking, that the hotel had a shuttle service. Upon check-in, everyone denied this. The manager finally admitted that there was a towne car available for short trips. This would have been nice to know after our first day, when we got back so exhausted from touring, that it took every last bit of energy to walk a few blocks to a restaurant. Overall, the location is great for access to everything.", "user": "tamaralea", "date": "December 16, 2008", "id": 22776030}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The location of this hotel was the main reason we booked and because it \"used to be\" the best hotel on the Riverwalk. The location is still great, however the noise, need for major renovation and could care less attitude of the hotel staff made what could have been a very romantic 2 night anniversary weekend, for my husband and I, a huge disappointment. I called \"in-house\" reservations upon booking and told the woman we were celebrating a special weekend and wanted a \"quiet room on a high floor\" of the hotel. I booked a \"Riverview King\" for $329/night. Everything seemed OK at the time of booking and she was even going to put a \"little something special\" in our room. The little something turned out to be an $7-$8 bottle of champagne (which would have been appreciated, had the room been worth $329/night or $771.22 for 2 nights (with all the taxes). We received an e-mail prior to our arriving asking us to confirm our reservation with a time of arrival and credit card (which I did). We parked across the street in the parking garage to avoid the $24/nite valet parking fee. Our room was on the \"river side\" of the hotel, but the \"view\" was that of a huge tree...could barely see the river through the tree. The room was very dated, small and \"absolutely nothing special\". The door to our tiny, balcony would not secure (only had a lever that kept it from opening). The bathroom looked like it had been somewhat renovated, but certainly not clean. The tile grout was dirty and the pillow headrest on the tub was filthy! As far as being on a high floor (the 4th to be exact) that didn't happen. We were at the end of the fourth floor next to emergency exit & closet to a major street that serviced the SA bus line, garbage trucks, etc. Beginning at 4:30am we were awakened by the noise of buses and trucks, motorcycles (you name it). My husband asked for us to be moved to another room the next morning, but they offered us a room on the 5th floor (closer to the middle of the hotel), but located right next to the loud (very slow) elevator traffic and it had a small, dirty chair in the shower w/o a door, a dingy shower curtain and tile floor (it was a handicap bathroom made to roll a wheelchair in and out of). Not very romantic if you ask me! By the way, the girl at the desk said the hotel was only 60% occupied and they had no other rooms to move us to? The weekend took a no return downhill slide at this point, We had friends joining us the 2nd night, so we were obligated to stay at this hotel. Needless to say, the 2nd night (Friday night) we were kept awake by the noise and partying going on along the Riverwalk until 3am, then awakened again by the buses and trucks. Exhausted, we checked out at 8 am on Saturday morning and drove home. There are many, many other great choices for hotels along the Riverwalk and next time, you can be assured the Omni La Mansion will not be one of ours!", "title": "Don't waste your money", "user": "Tgrl_7", "date": "December 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 22507175, "likes": {"liked": "— The location; across the river from the Omni Watermark Hotel & Pesca Restaurant", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "This hotel is a good place to stay on the RIverwalk in San Antionio Texas.", "title": "Good Place to Stay in San Anotnio", "user": "rak57", "date": "December 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 22465955}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I attended a conference for a week with the conference rate of $195- / night.", "title": "Great access to riverwalk", "user": "Spicy04", "date": "November 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21702876, "likes": {"liked": "— location", "disliked": "— pillows"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Upon arriving at the hotel, the staff was professional, cheerful, and helpful.", "title": "Best Location on the RIverwalk!", "user": "MCHCA", "date": "November 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21656478, "likes": {"liked": "— Location!", "disliked": "— Pool wasn't very exciting."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had a very relaxing weekend at the La Mansion. The service was nearly flawless - the staff was polite and called you by name. We made reservations in the spa for the afternoon, and before hanging up I mentioned that we were going downstairs for breakfast. When we got to the restaurant, they made a note of our name. While eating, the spa had a cancellation and they were able to get us in earlier - and they called down to the restaurant and have the hostess track us down. I felt like the staff went above and beyond when it came to service. The spa across the river at the Watermark was decadent and tranquil (and extremely overpriced; my girlfriend and I loved every minute of it until the bill arrived). I would like to return to the spa, but it will be awhile before I can afford to do so. The only major issue was the parking at the hotel. You have the option of either valet parking at the hotel for $30 or self parking at the garage across the street for $15. We decided to be lazy and paid the extra money for valet. Saturday night we went to get our car to go to a concert and waited over 40 minutes for our car. It seems that when the hotel's garage is full, they park cars across the street in the other garage, and there was a bit of a traffic jam getting out of the garage. After 40 minutes, we opted to share a cab with a couple of other guests in the same situation and got to the show just as the opening notes were sounding. The hotel did take off one night's parking charge for the inconvenience. They also double-billed us at the spa, but we were able to fix that at checkout without a hassle. The rooms were very nice and well appointed, and the riverwalk is beautiful. There's great food and nightlife within walking distance of the hotel. We'll be back.", "title": "Nearly flawless stay", "helpfulness": 1, "user": "Snarky", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26661451}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Our stay was for Friday, February 13, 2009. We went as a Valentines weekend excursion. Upon arriving we waited about 10 minutes in the street for parking. There was one attendant who did not appeared hurried. The parking area was filled and there were five cars behind me! He did apologize for the wait.", "title": "Too much $ for Routine service and hotel", "helpfulness": 1, "user": "RobertRSanAntonio", "date": "March 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 26175465}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Upon checking in, the process was very rapid and smooth. I was not asked, however, if I needed help with my bags. The room, #412, was very clean and all amenities nicely arranged. Although we heard the maid knocking next door for a turndown service, she never knocked on our door nor visited. I was surprised to find that there was no hotel safe in the room. In the morning, my wife attempted to make coffee. This was absolutely impossible as the pull out drawer had the coffee maker connected in the back. The coffee maker was plugged in and could not be pulled out so as to pour water into the device. I have enclosed a photograph below. There were no newspapers either at our door or check out area in the morning as are in nicer hotels.", "title": "great service but loud", "user": "cp5006", "date": "February 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 24828274}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Dinner was spectacular. We had reservations at 7:15 and were seated within seconds. The food was served exactly as we had asked and all tasted wonderful. We both had the pear/spinach salad and steak. I felt the spinach dressing was a tad bland, but again the meal in general was supreme. We had the desert pudding that was outstanding. Our waiter, Ricky, was very nice. Prior to dinner, we walked the river. Practically every restaurant was lined up waiting rooms filled. Las Canarias was partially empty. A nicely lit sign on the river would help people know about the restaurant. Some extra accent lighting to show off the site would help obtain “street business.” As it stands, there’s only a small dimly lit slightly dirty windowed menu stand. Curb appeal is missing.", "title": "The most enjoyable hotel and staff we have ever experienced!", "user": "searayty", "date": "February 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24633947}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "In many hotels, there are newspapers available either at the desk or at your door in the morning. None were seen.", "title": "Great stay!", "user": "MaiaB", "date": "February 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24531189, "likes": {"liked": "— comfortable, luxurious rooms", "disliked": "— no free parking and no free internet"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I exhaustively researched hotels for my husband's & my first trip to San Antonio. I chose Omni La Mansion del Rio for its location & balconies. We had an excellent stay. Lots of restaurants & bars just steps away. The room was a good size & had a nice decor; the bed & pillows were extremely comfortable; flat panel tv; nice clean bathroom.The best part was the small private balcony. Great views of the riverwalk...trees....birds...very serene....good people watching. The front desk staff was friendly & helpful. One of the elevators was out of service for our entire stay, but we just walked down the hall to another one. There was a stocked mini-bar fridge in the room, but no room to put our own stuff. Bought a styrofoam cooler from a liquor store a couple blocks away. Didn't experience any noise problems. For parking, we saved a lot of money by self-parking in the garage across the street. We walked the Riverwalk & saw a lot of hotels and didn't see any that I wished we'd rather stayed at. I would definitely stay there again.", "title": "Great location, great views", "user": "Tworabbitz", "date": "April 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28700548}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I went to this \"4 Star\" hotel to celebrate our 25th. I was told our rate [$300 per night] included breakfast daily -great we thought! NEVER HAPPENED! We asked for a bottle of champagne to be in our room upon arrival [we'd pay]- NEVER HAPPENED!", "title": "Stop and think before you click and book", "helpfulness": 1, "user": "Albany_NYFreelancer", "date": "April 24, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 28666914}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The room was average- with mixed style- none matched! We stayed in better Best Western 2 stars! The daily room cleaning was \"SUPER\"---IF you don't mind your bed not made by 4PM [we left to see the town at 10AM]. The bed was \"made\" with the bedspread in a ball on the chair- no glasses replaced, water in ice bucket, towels not picked-up etc..and when we asked a mgr to ck the room- he was quick to call housekeeping--who then told us \" they were just cleaning the room\"-- Hmm really! BUT the bed was made- somewhat and no housekeeping anywhere near the room! We left for dinner and upon our return the hotel gave us 2 bottles of WATER and note saying sorry!! WOW WATER! Alright it was Evian- BIG DEAL!", "title": "Great Location... Ok Hotel...", "user": "ChicagoBears1985", "date": "April 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 28359296}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "For $300 a night- we shouldn't pay $6 bucks for bottled water, a dirty pillow in the whirlpool tub, a filthy soap dish, and a balcony 5 floors up that wouldn't hold Twiggy! If someone sat on the tiny private balcony [they boast about] their knees would hit the rusting railing! THE ONLY THING THIS PLACE HAS IS IT'S LOCATION.", "title": "Great location", "user": "Solar-sailor", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 27709062}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "STOP! Don't stay here! I can't wait to write Omni and send them my pictures of their \"4 Star\" wanna be hotel! What a total waste of money! Oh yes, use the biz center --cough-up $6.95 for 15 min!", "title": "Great location", "user": "Solar-sailor", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 26867820}, {"rating": 3.0, "title": "Not worth the price", "text": "We had a King room on the river with a private balcony. The rooms are old and small and need to be redecorated. The bathroom was small. There are not very many jacuzzi rooms. The concierge was nice. The room service was good, although overpriced. I have stayed in many hotels in many cities and don't stay in anything less than 4 stars. This room was not worth the $260/night price tag. I will stay elsewhere for my next trip to San Antonio.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4122093}, {"rating": 5.0, "title": "La Mansion is the place!", "text": "I just got back from a trip with me sister to La Mansion. It couldn't have been better, and the hotel's location can't be beat. We had spa services at the Watermark, La Mansion's sister hotel (and the were fabulous!), but for reflecting the architecture and \"feel\" of San Antonio, we were very glad we chose La Mansion.", "helpfulness": 4, "user": "Tex56", "date": "October 12, 2005", "id": 4015823}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Our stay was great. The staff was extremely accommodating. Location was great also. My husband needed a refrigerator and microwave for medical issues and they were brought up quickly with no extra charge. Everything was great!", "title": "Loved it!", "helpfulness": 2, "user": "lombardote", "date": "October 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4012991}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "It was a busy weekend & our original choice, the Westin, was booked. My husband and I planned to stay 1 night and then go to the Hyatt resort for a conference. We got an amazingly low rate at La Mansion & booked it after reading these reviews. Upon checked in we were instantly treated like royalty. We travel quite a bit and have never actually received this level of customer service-even at the Ritz. After speaking w/the concierge regarding dinner ideas, who gave excellent advice, we proceeded to our room. There were some slight renovations (painting,etc) in the halls, but nothing major. When we got to our rooms our bags were set up and 2 different employees were delivering extra ice and robes (we did not even ask) and later that afternoon we also received champagne and strawberries. The rooms were nice, large and clean, but a little dated. French doors led to the shared balcony, which was fine because no one was out there throughout our stay. We decided to stay an extra night and they honored the same LOW rate. Once again, we received champagne and chocolates before leaving for dinner. The only complaint...our room was over the pool and we could clearly hear some very loud people, that appeared pretty drunk. You can also use all ammenties in the Watermark across the street. Location cannot be beat. Four Seasons quality service at an excellent value.", "title": "Customer Service/Location Top Notch!", "helpfulness": 3, "user": "gafaith", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3985803}, {"rating": 1.0, "title": "Down grade to a 2.5 star", "text": "I recently attended a conference at La Mansion. And this is my experience.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "September 23, 2005", "id": 3933934}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I know this review is a little late in coming. We stayed at La Mansion between Christmas and New Year's for our 30th anniversary. I like historic hotels and we wanted to see the lights on the River Walk. Everything was perfect. I had read some of the reviews that stated River Walk rooms had trees that blocked their view so when I made the reservation I requested that it be an unobstructed view and let them know it was our anniversary. We got exactly what we wanted. We also booked a package that included valet parking, breakfast, and a river tour.", "title": "All that we hoped", "user": "tlegray", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112206211}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "It is right on the River Walk and we were there during a holiday so we expected it to be noisey but it wasn't so noisey that is bothered us. We checked-out the day of the Alamo bowl so during our stay at any moment one of the college bands or Pep squads could break out in a song or cheer right across or under our balcony. All of this actually enhanced our experience and while I know the hotel didn't put this on just for us if you want a exceptionally quiet place this is not for you. We however loved it all!", "title": "Absolutely loved this hotel", "helpfulness": 1, "user": "lbeggs81", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111911268}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Because it rained one day of our stay we decided to try out the restaurant/bar for lunch. We enjoyed it and would definitely eat there again.", "title": "Great Place", "helpfulness": 1, "user": "mikeint1", "date": "June 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111272500}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Service everywhere was excellent.", "title": "Great stay!", "user": "Brandi01", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110772715}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Thank you La Mansion del Rio", "title": "Super!", "user": "parker68048", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110354183}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Couldn't have picked a better hotel on the Riverwalk. La Mansion is right the in the middle of the action on the Riverwalk and balcony views are great as long as you're not too high up. We were on the 6th floor and would have liked to have been on the 2nd or 3rd floor. We actually had two balconies - a small private one and a larger shared balcony. The room was very well decorated and clean. It was very luxurious. The service was unparallel. We stayed on a Sunday night and asked for an upgrade since we knew they wouldn't be booked up. We got the Ambassador room, which was larger than a regular room, for the price of the regular room. We didn't use valet and opted to park across the street in the garage since it was cheaper but the valet service was very helpful and courteous while we were at the front desk checking in. I read in previous reviews that the elevators were slow but since we were there on a Sunday in October it wasn't really an issue. It was great to walk right out of the hotel onto the riverwalk. The hotel is just as lovely in person as it is on their website.", "title": "Great views of the Riverwalk", "user": "deadheadatheart", "date": "November 7, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 21634273, "likes": {"liked": "— Access to Riverwalk", "disliked": "— Didn't like being on the 6th floor"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We've stayed at La Mansion several times. It's location can't be beat and the fact that it's a historical property with rumors that one of the ballrooms is haunted makes it an intriguing place to stay. That said a traveler must be fairly picky about the room location in this property so you might want to see the room prior to check in. BE PREPARED if you booked on a site like Hotwire you'll get the worst and loudest rooms. They allowed us to upgrade to a riverview room for $25 well worth the price. The rooms aren't huge by any stretch but well kept. The pool is in desperate need of a remodel but the hotel now has an arrangement for it's guests to use the spa amenities and pool of the five star Watermark across the river. That benefit alone raises La Mansion to a 4.5 star property. That makes for an unbeatable combination. Enjoy", "title": "Location, location, location!!!", "helpfulness": 1, "user": "sparkyparks", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21502591, "likes": {"liked": "— Location", "disliked": "— $28 valet parking."}}, {"rating": 5.0, "title": "Loved the Omni", "text": "We wanted to stay on the Riverwalk and wanted a better room than a homewood suites type room so we pricelined 2 rooms and our offer was accepted 60% less than published rates. I called ahead to see if we could get our rooms next to each other. The hotel was allmost full. The Mgr. on duty offered us the navarro suite for a modest upgrade. The room was fantastic! The staff was very friendly and helpfull. We have stayed in San Antonio many times and found the Omni to be a nice , Clean getaway. I highly reccomend it. AAA+++", "user": "us2Luv2travel", "date": "October 27, 2008", "id": 21319186}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Omni La Mansion rescued us from a horrible experience with the Westin La Cantera. After a beautiful wedding, we arrived at the Westin La Cantera to discover our room had been sold and there was no room at the inn. We are not from San Antonio but my husband remembered hearing about La Mansion. He called and they had the presidental suite available! When we arrived they gave us a generous voucher for breakfast. Everyone was so gracious to us and made our stay so special. They rescued us from what could have been a terrible night.", "title": "Wedding night rescue", "user": "ahpTexas", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20697634}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Omni La Mansion is truly a first class hotel.", "title": "Very pleasant stay", "user": "TXsandals", "date": "September 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19837501, "likes": {"liked": "— Location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "I recently stayed at La Mansion for a conference, and had a great experience. I don't know if some rooms were renovated and others weren't which might explain some the negative reviews, but the room I stayed in was extremely clean, had new tile in the bath (no mold at all), and the service during my stay was impeccable. Just a few minor complaints: the room service was very expensive, so I didn't try it, and the \"refreshment bar\" took up the entire refrigerator, so if I wanted to buy my own drinks at a fraction of the cost, there was no place to put them. The rug in the room was in good shape and looked new, but the rug in the hall needs to be replaced. Weirdest thing about the room: no drawers to speak of! There was a big desk with one center drawer to hold local info and phone books, and the entertainment center had really narrow (less than a foot wide) drawers which would hold underwear, but not much else. I hung up what clothes I could and left the rest in my suitcase. Beds were comfortable, not fabulous, but good. TV is too small for a 4-5 star hotel. Bath products are from the Watermark Spa across the river, and they were nice. The best things were the charming ambience of the hotel, and the wonderful service. Every hotel employee I met was delightfully friendly and helpful. The hotel is older which adds to its charm--I loved the exposed brick wall and wooden beams in my room, and my view of the pool courtyard was lovely. The hotel has a very convenient location on the Riverwalk. If you're looking for a brand new sanitized hotel, this isn't it, but if you like a more old-world feel with top-notch service, this is the place.", "title": "Wonderful service; clean room", "helpfulness": 4, "user": "StJohnFan", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4388558}, {"rating": 3.0, "title": "The Old Gray Mare", "text": "We are 25 year customers. I'm sad. Our hotel has became very average. The walls and tub were dirty. Everthing seems so expensive, parking, $25. Average is $100 a couple with no drinks. Very rude bartender...we were scared not to tip her over our $4 coffee and a $4 coke. Room sevice is a joke....below average food has a $4 delivery charge and 19% tip included. Then the guy stands and waits for a cash tip. This hotel is not in the middle of the action. The greenery is so thick that a balcony room has lost its appeal. I'm looking for a new home away from home. I must mention that the people, other than the female bartender, try very hard and are extremely nice, but you can get that at most hotels. Good bye old friend, i must let you go.", "helpfulness": 3, "user": "txjetman", "date": "January 4, 2006", "id": 4324705}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We stayed from Dec 18 - Dec 22, and all I can say is what an excellent hotel. We arrived late on Sunday night and were greeted with a warm welcome and a bottle of wine and fruit in our room, which was most unexpected. Our room was on the second floor and overlooked the Riverwalk, which was all decorated for the Christmas period. All the staff in the hotel were attentive and very courteous, with special thanks to the concierge staff who took care of our site seeing arrangements. If you want glitz this is not the place for you. If you want refinement with old Texas charm then it is.", "title": "Great Place to Stay", "helpfulness": 3, "user": "DrJC58", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4319771}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We had a mixed experience during our Dec. 26-30, 2005 stay. On the one hand, the hotel is beautiful and is centrally located along the Riverwalk. However, its management fell far short of its claimed five star level. The check in and checkout lines were slow. We had to wait over one hour for our room which was not available until 4:30 PM. We reserved double beds for our family of four, but only a king-sized bed was available (but when we got to the room I pulled the cushions off the sofa and discovered a sofa bed -- why had the check in desk not told us?). One day our room was not even cleaned! We requested turn down service one night (based on an earlier posting raving about it) but the service was not performed. All in all, a poor value for the money.", "title": "Pretty but Poorly Run", "helpfulness": 1, "user": "ArlingtonNOVA", "date": "January 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "service": 2.0}, "id": 4314772}, {"rating": 4.0, "title": "Good experience after mixed reviews", "text": "I read very mixed reviews of La Mansion and was apprehensive before we arrived. It is a very old hotel and therefore has small rooms and limited storage, so an extended stay could be problematic. However, for a long weekend we found it to have a great location, courteous staff and a nice ambience (IE doesn't feel like a big chain hotel). The hotel restaurant was very good and we very much enjoyed our stay. We would stay there again.", "helpfulness": 3, "user": "wander1", "date": "December 28, 2005", "id": 4306951}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We elected to stay at La Mansion due to it proximity to the Majestic Theatre. It had been 17 years since we last stayed and we were glad to see that things were still up to standard. Our corner balcony room had windows on three sides and two balconies. One of the balconies overlooked a courtyard and Navarro Street. The 2nd faced Navarro and had views of the Riverwalk, downtown, and the Tower of the Americas. Service was excellent, food and drink were good (with expected Riverwalk prices), and the overall experience at the hotel was above average. Put it on your short list for Riverwalk hotels", "title": "Excellent weekend stay", "user": "sanantoniopete", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119234375}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This is the third Omni hotel I've stayed in and I have yet to be disappointed. The location was fabulous - right on the Riverwalk amidst great restaurants. The room itself was very nice and modern and the bed quite comfortable. As with all Omni places thus far, the service was fantastic. Their parking is a bit high at $32/night for valet with no Omni-specific self-park but across the street is self-park. Unfortunately it's one of those lots that only has a reasonable price from later in the day to early in the morning with no in and out privileges so you're really better off (if you believe it) with the valet.", "title": "Great Location, Great Room - True to Omni Experience!", "user": "nunce1", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118985011}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The restaurant had a good breakfast, though pricey. WiFi is free for loyalty members, which was a nice perk. The fitness center is actually located in Mokara hotel across the Riverwalk (a 2-minute walk from my room to the fitness center) and was very nice (hotel-like, i.e. mostly cardio with some free weights and nautlius machines). The spa at the Mokara was fabulous (though pricey).", "title": "It was okay, a few problems the first night...", "user": "shellywade", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118867782}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Overall I would definitely recommend this place. When I got back to my room on my last night there was a message from the front desk offering to give me a wake-up call or help me print out boarding passes since it was my last night of the stay. A small gesture for sure but much appreciated and speaks to their service level for sure.", "title": "But the location is great! Really neat building other than that not so great.", "helpfulness": 1, "user": "saaz801", "date": "October 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 118847106}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We were visiting San Antonio for a surprise birthday trip for my sister n law. We chose to stay at the La Mansion Del Rio because we got a good rate online. I had seen the property before and had always wanted to stay there. The location is great, directly on the river walk so we were very excited about that. Upon check in we were advised that there is a $50.00 a day charge for incidentals which we were not aware of prior to arriving. I know most hotels keep a card on file for things like this, however here at the La Mansion, you are billed automatically and refunded 7-10 days after you check out. This was not a problem for me, I was just surprised so I wanted to make others aware. We were given our room keys, we were in room 150 across from the main lobby in the other building. Now this room is directly behind the double door entrance and directly across from the elevator so we heard people coming and going all night long. The room was a nice size with two double beds and a flat screen tv. We noticed when we first went in the room was not cooling properly, we decided to turn the ac down lower while we went to dinner hoping it would cool off by the time we got back. We were gone for a few hours, when we returned the room was still hot and muggy. We noticed this in all of the hallways of the hotel as well. We decided to call it a night as we arrived late and were very exhausted. My husband did not sleep due to the heat and noise coming from the hallway all night. We contacted the front desk early the next morning to make them aware of the issues we were having with the room. At that point we were told that they would let the manager know to contact us as soon as he was out of a meeting. In the meantime they did send up a maintenance worker to check the ac in the room. Come to find out the filter needed to be changed, which he promptly did. We noticed a difference right away, but we were still not happy with the noise so we requested a new room. Taneeka, one of the front desk clerks advised they she would move us to a new room as soon as one was available because they were completely booked the night before they didn't have any rooms available right away. We were fine with that since we were leaving to get lunch anyway. Around 3:00 we were contacted by Taneeka again to let us know that our new room was ready. Tankeeka also offered to have a member of the staff move our things from the old room to the new one since we were out. She also gave us two complementary tickets the breakfast buffet for all of the inconvenience. I have to say that Tankeeka along with all the other front desk representatives were amazing to work with and went above and beyond trying to make our stay more comfortable. We really did appreciate that. Our second room was 405 with a pool view; it was clean, cool and quiet. We were very happy with this room and were able to enjoy our last night in San Antonio. Thanks again to staff for everything!!", "title": "UPS & DOWNS", "user": "daOScotland", "date": "September 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 118483963}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This is an excellent property. Although the hotel is not new and not in perfect condition, it has tons of high-class character. The property is built in exquisite Spanish architecture. The hotel is located directly on one of the most lively portions of San Antonio's River Walk. I attended a convention while staying at La Mansion and the convention center is a 10 minute walk from the hotel. However, you never have to leave the shaded River Walk to get to the convention center. The hotel has no exercise facilities, but provides access to the nice facilities at its sister property, directly across the River Walk.", "title": "Excellent!", "user": "Bug3", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116950080}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We adored our stay here. We got our room at a good price, but even if the Mansion had cost a little more, the ambience and location would have been worth it. I prefer the rooms overlOoking the lovely but small pool and courtyard, where there is a small bar and where mariachis bands often entertain. We spent one day just relaxing with cervezas by the pool.", "title": "Beautiful Old World style, furnishings, and service. Affordable luxury. Splurge and go for it. You won't be sorry. Step from you", "user": "lkreid", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116832161}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We adored our stay here. We got our room at a good price, but even if the Mansion had cost a little more, the ambience and location would have been worth it. I prefer the rooms overlOoking the lovely but small pool and courtyard, where there is a small bar and where mariachis bands often entertain. We spent one day just relaxing with cervezas by the pool.", "title": "Beautiful Old World style, furnishings, and service. Affordable luxury. Splurge and go for it. You won't be sorry. Step from you", "user": "lkreid", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116832160}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed in Room 217 which had access to both a private small balcony and a larger balcony shared with 3 other rooms overlooking the river. The room was large making it very comfortable for relaxing for quiet time during our stay. The hotel restaurants were very enjoyable also.", "title": "Luxurious", "user": "joann09134", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116781231}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "I remember this place from back in the day as a child. Very nice with classic feel and look. But that's about it. The rooms have a dated feel, small and with only a few pulgs for your electronics. The service was good, nice pool but on the small side. Overall it's a nice place but I remember it much nicer and prestigious as a child. You can find a better place for your money elsewhere.", "title": "Great location, aging facility.", "helpfulness": 1, "user": "Porfiriopicante", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 116779288}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The location of riverwalk was great. We decided to stay at Omni and were willing to pay more per night since it was our 25th Anniversary.. We have stayed at many Hotels during our lifetime.. I am so sorry to say the room we stayed in was in need of a facelift. The restroom was very small. the countertop of restroom sink was faded and old. and the tile flooring in restroom was cracked.. I expected more for our money..Nothing to come home and brag about..We were on the 7th floor the elevator took a while to arrive when we needed to go up or down. Not that we were in a hurry but just saying. And our coffee pot didnt work called room service they did replace it. All in all other motels Drury Suites etc. are alot more modern. parking is outrageousn 32.00 plus tax a day ( so that was another 70.00)... if u want internet its a charge as well..", "title": "Not what expected for the 600 dollars spent for two nights stay!", "helpfulness": 1, "user": "nicelyput", "date": "April 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 104673250}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "After booking the hotel weeks before, I came to this site and looked at the reviews. I was somewhat leery about it, after I had read some of the comments.", "title": "Loved the location - good service", "user": "Brat8163", "date": "April 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102945396}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I contacted the Omni website about my concerns & immediately received a reply promising that we would be happy and not to worry.", "title": "So glad we found the Omni!", "user": "shortnsweet545", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 102564032}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "When we checked in, there were 4 complimentary riverwalk boat tours tickets there for us. This was NOT the reason I had contacted them. I just wanted a good place, for the 4 of us to have a good time on vacation, for the money we paid. We got a very good rate thru Expedia, we found out later. We tried to book the remaining week and the price was very high (we stayed here Sat night - Weds morning)", "title": "Best Hotel on the Riverwalk!", "user": "pickypicky58", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102426024}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We had a great room, a great location - we sat on the balcony every night and \"people watched\". We were there during the Final 4, which we did not know. Watched the Kansas pep band & cheerleaders go down the river on Sat night. Everyone had fun!", "title": "Really impressed with service. Room was on small side", "user": "trip1Canada", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 102352487}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My daughters and I stayed at the Omni -Riverwalk in San Antonio recently. There were 3 of us and we had requested a room with two double beds in it. Upon check-in I was informed that our room had only 1 bed. I asked to have our room changed to two beds and was told that they could not do that for us. The young woman at the desk said they were at full capacity without even checking. She said that the hotel would furnish us a roll a way bed. Since I didn't have any choice I agreed to the roll a way bed. We went to our room and when we opened the door the 3 of us were shocked to see that we were put in a very small room. When the roll away bed came there was barely any room to walk in the room. I called the front desk again asking to be moved and how uncomfortable our room was for all of us. They still refused to do anything for us. The Omni Hotel is suppose to be a four star hotel and I was not happy with our room or rude treatment by the staff. The room and the bathroom were not very clean either. We checked out on Sunday and did not bother to eat breakfast or spend anymore time at this hotel. I will not stay at any Omni Hotels in the future.This was our first and last visit with this hotel chain.", "title": "We were disappointed in the hotel and service!", "helpfulness": 1, "user": "janhar1", "date": "August 13, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 116674169}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This hotel is literally steps from the river in San Antonio and a couple blocks from the Alamo. The staff was great, especially the gentlemen we talked to at the concierge desk. The only downside of this hotel is that parking can be a bit expensive. I think we paid around $15/day at the city parking garage across the street. Booked this through hotwire for about $100/night.", "title": "Beautiful Hotel, Friendly Staff", "user": "C K", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116530736}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Went for the weekend, Sarah upgraded us to riverwalk room, brought us strawberrys and champagne for our special occasion. Everyone was so nice, great location. Nice Bar in lobby. Omni made a good trip great. Look, its a old hotel, if you are looking for a 4-5 star resort than this is not for you, its a classy older hotel with history. Double pillow top matress. Nice bedding, Flat screen tv. Good coffee in room. usa in the morning. Park across the street for 9 dollars a day. Pay the extra for riverwalk view. Or go see Sarah at the front desk.", "title": "Great Stay", "user": "mikshe", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116184785}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "I checked into the hotel today staying for a total of 4 nights, but I will be checking out in the AM. The room is a corner room with a balcony to no where. I politely called the front desk to see if they could accommodate their guest with a better room and was told they didn't have anything availabe. You mean to tell me this big hotel can't accommodate guest staying more than 3 nights. I will check into a better hotel that can accommodate my request. Hotel was recommended by a previous guest who obviously had a room with three balconies overlooking the Riverwalk at the same rate and I can't even get one balcony overlooking the riverwalk.", "title": "Obsurd!", "user": "deidthm", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 116126150}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Stayed only one night here, visiting San Antonio for the weekend while in Houston for business. Great location you can't be any nearer the riverwalk action! Room a good size, loved the exposed brick wall. Bed super comfortable. Hotel pool was great to relax in a with a cold beer after sight-seeing on foot round San Antonio.", "title": "Perfect location on the Riverwalk", "user": "mollyjetset", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 116036660}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "3 in 1 ...No that is not my margaritas to hour ratio, this is the number of rooms I was changed to before I was placed into the correct one...I am a San Antonio native ,and was downtown celebrating my wives birthday,this is a annual thing for us,and I have made a point to try a different property each time...MISTAKE", "title": "Far from the best one", "helpfulness": 2, "user": "Marcelgi", "date": "September 12, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 5.0, "value": 1.0, "service": 1.0}, "id": 117976607}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Room 1-Nice size just what I was looking for,but the carpet was still wet and,the bedding from the previous stay was in a garbage bag on the top of the bed. I wasn't aware of how much of an injustice it was,until a very responsible, room cleaner came to the door with the vacuum cleaner ready to finish the room that wasn't ready. He advised us we should request a different room,and at that point I agreed.", "title": "Perfection again and again", "user": "tevetv", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117800005}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We made our way back to he lobby,and the staff was more than happy to re-accommodate us,so on the spot we were given new keys,and a new room. We merrily made our way to the room...Whats behind door number 2? Nice room,clean and dry carpet,but it is half the size of the first one...I'm not sure of the train of thought in the switch,but I'm not willing to spend the same amount of money for smaller accommodations,In hindsight I should have made that clear from the beginning,but I didn't think I had too.", "title": "Omni is the best", "user": "runtoeat", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117720494}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Now I don't like complaining,in fact I pride myself on being as \"out of the way\" as possible. So the fact I was going to have to call back down to the front desk,was asking me to step out of my character.,but I did. I spoke to Sarah.I inquired if she was aware the room they sent me to was smaller than the first. \"Yes\" she advised. She explained the hotel was a historic building ,in which the rooms sizes vary,but like the first they offered to move us again,but it would be on the other side of the hotel. I said sure,and they offered to send our room keys up to us...I was fine with that,so me and my wife waited ,and waited,and waited some more.They NEVER brought the keys up. By this time I was getting a little upset,and honestly this is when they turned a potential 5 rating to a resounding 2. I didn't have the patience for another roundabout with them so my wife offered to call them for me. She, spoke to Sarah again,and asked when I should expect the keys,Sarah advised they were waiting for staff to pick them up,but would put a rush on it. Now maybe I don't know what rush means,but I'm thinking 5-7 minutes from then right?WRONG we waited another320 minutes before my wife decided she would go down and just get them. So she did,she was told that they forgot to send them? How convenient!", "title": "Beautiful river-walk location.", "helpfulness": 2, "user": "BIistheBest", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117186446}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "So we get to the third room,and what do we find? A perfect room. Just like the first minus the wet carpet...Finally! We could enjoy the stay,we left for about 5 hours and returned to see a birthday card for my wife, four chocolate covered strawberries,and a bottle of champagne... Nice gesture! But the damage was done.", "title": "Good-- but Inconsistent", "user": "Globespan15", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 116961312}, {"rating": 4.0, "title": "Very nice hotel, super convenient.", "text": "We had a room overlooking the river on the third floor and thought it was just about the perfect place - any higher and you'd not see the tour boats as well and any lower can be noisy (the hotel actually provides soothing sleep noise-makers in the rooms).", "user": "tenknots", "date": "May 4, 2011", "id": 106808340}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The room was clean and modern, and though not large, was comfortable. The bed faced the balcony and was comfortable. The balcony is a great place to sit and watch the traffic, both foot and boat.", "title": "I would stay there again but...", "user": "froglegs54", "date": "April 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 105862660}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "It's a wonderful place to take in the Riverwalk since it's directly on it. Restaurants are everywhere. We didn't eat at the hotel's restaurant since it is very expensive (I haven't seen an $85 entree in a long time) though highly rated. There are so many great places to eat along the water. We also took a short walk downtown to Las Canarias for great inexpensive food.", "title": "Best Place to Stay in San Antonio", "user": "gslink", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105673784}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The pool was small and often it was hard to find a chair, but it was cool and refreshing.", "title": "Beautiful, Great Service, Staff Good with Kids", "user": "pittardm", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 105340178}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The staff was always friendly and accommodating.", "title": "Just wonderful!", "helpfulness": 3, "user": "EaglesSteelers", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105289366}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 65, "average": 105, "very good": 286, "terrible": 47, "excellent": 615}, "aka": "Omni La Mansion Del Rio Hotel", "slim_ranking": 0.0345821325648, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "One of the top hotels in the city, and filled with Spanish charm."}