{"user_rating": 4.5, "review_count": 1604, "name": "Omni Berkshire Place", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Genuinely friendly staff. Clean rooms, nice amenities. Informative and AVAILABLE concierge. (I've stayed other places where you could never reach the concierge by phone, and then would have to wait in lines in the lobby.) Great location (near Rockefeller Plaza). Hotel program worth joining (free breakfast beverages, free internet access, turn-down service with chocolates). Will definitely stay again.", "title": "Loved it!", "helpfulness": 1, "user": "SonjaWitt", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 7190056, "likes": {"liked": "— location (midtown), price & quality", "disliked": "— proximity to subway"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The Omni was comfortable and clean. We had a group of 3 rooms, and one check-in incident. We all had requested non-smoking and had to stay in a smoking room for one night, then was switched. Other than that, it was an enjoyable stay. The hotel restaraunt was very expensive ($7 for a cup of tea), however I heard the food was good. The concierge staff was fantastic and very helpful, especially in making recommendations and directions. The location was great; blocks (1-5) from shopping, subway, and Rockefeller Plaza, and theatres.", "title": "Great Stay", "helpfulness": 1, "user": "denverbee", "date": "March 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7161997}, {"rating": 2.0, "title": "Pretty Ridiculous", "text": "I had read all the great reviews on this hotel, so I decided to stay here this past weekend. I have literally stayed at every hotel in NY and this was pretty bad. We were supposed to have a superior room, but due to delayed flight we didnt check into the hotel until 1 am. They had sold our room and stuck us in a double room. the room was so small, you couldnt pass somebody at the foot of the bed. Smalest hotel I have ever been in. We had a fantastic view outside of city workers tearing down a building which started at 5 am each morning and didnt end till 9 at night everyday. I feel that the hotel should have given guest some warning as to the noise level outside, or have discounted the rooms that had that noise.", "helpfulness": 2, "user": "CLSanti", "date": "March 11, 2007", "id": 7012950}, {"rating": 5.0, "title": "Great! Really pleased we changed to the Omni!", "text": "Never had room service so I cant tell you how that was. One of the elevators was out of service so you waited a minimum of 10 minutes on your floor to get into an overly packed elevator. Room key on two occasions didnt work, and we had loud neighbors in the room next door.", "helpfulness": 2, "user": "Nasha", "date": "February 27, 2007", "id": 6850746}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I dont recommend this hotel to anyone. especially if you are used to a more higher end hotel!", "title": "Very Nice Accomodation, Great Service", "helpfulness": 1, "user": "Davelw", "date": "February 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 6818016}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We just got back from a great stay at the Omni Bershire. We went with our 10 year old son to see a Yankees game- which was rained out but was able to get tickets for the next day's game. First visit to NYC and was leary about the trip being from the South, however the hotel was great and the staff was very friendly and helpful. The room was bigger that expected for NYC and very clean and close to walk to most attractions. The doormen and conceirge guys were very helpful and friendly with ideas of where to eat and visit. The first night the staff brought up cookies and milk and then chocolates and slippers. Isadora's cafe across the street is a great and cheaper place to eat breakfast, lunch or dinner. Felt very safe on the subways also. Got a better rate a hotels.com(about $300.00 per night). Be prepared to spend alot for everything in NYC.", "title": "Great Stay", "helpfulness": 1, "user": "BaseballMom3", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7291295, "likes": {"liked": "— clean and friendly", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This was our 4th stay at the Omni in about 6 years. You can't beat the location and the rooms are so comfortable. We had booked a Deluxe and were upgraded to a Superior, I assume because we are part of the Select Guest program. Upon check in, we were told that the front desk was out of the free beverage vouchers that Select Guest members get and that they would be delivered to our room that evening. We never received them. Granted, we never inquired about them again, but I would say this was the only glitch in our stay. I also have to agree with the last review which mentioned how fantastic the doormen are. Lenny has been there since we started staying there and even if he really doesn't remember us, he always acts like he does. He is great! Also, there is construction going on behind the building. I'm not sure there would be any room where you wouldn't hear it, but we were always anxious to get up and out early anyway. It usually started around 7:30 am but they didn't work on the weekends.", "title": "Another great stay at the Omni", "helpfulness": 1, "user": "francesca", "date": "March 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7260097}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I'm hoping to stay there again over the 4th of July. We can't get enough of the Omni.", "title": "Loved this hotel", "helpfulness": 1, "user": "Xpat11875", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7253212, "likes": {"liked": "— the hot chocolate in the morning delivered to our room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Simple as this ... we loved this hotel. We loved the bar and restaurant (Fireside) too. Room service was great, staff were friendly, location is perfect ... absolutely nothing to complain about!", "title": "Downtown Manhattan -loved it", "helpfulness": 1, "user": "workinhard", "date": "March 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7230242, "likes": {"liked": "— door men & location", "disliked": "— placement of electrical sockets"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My wife and I traveled up to New York city for a little get away. We stayed at the omni through hotels.com and the hotel was more than perfect. Turn down service, great bar & restaurant. The rooms had tray ceilings and they were terrific. Shower was huge and comfortable. We walked every where- broadway, times square, flea market on the weekend. It was great and the door men make this hotel. We never talked to the desk or the concierge, the door men took care of everything!", "title": "FRIENDLY/HELPFUL", "helpfulness": 1, "user": "cmacNYC", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7193109, "likes": {"liked": "— Cleanliness", "disliked": "— lack of cab service, due to snow storm"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "We were part of a family group of three couples who stayed at the Omni in the beginning of January for a theater weekend. We booked broadway tickets through a special we saw on travelzoo and then used their site to search for hotels. The Omni was very reasonable so we used the travelzoo discount code and booked online at the Omni's site. We are very pleased we stayed there. The room was spacious, bathroom large and staff very friendly. I really liked their web check-in process. We said we'd be there at 11:30AM, showed up on time and our keys were ready on arrival. I appreciated that they treated us with great care even though we'd booked using a discount. All three couples enjoyed the hotel and agreed we'd like to stay there when we do our 2009 theater weekend.", "title": "Excellent Choice for Theater Weekend", "user": "LuvToTravel", "date": "February 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13287034}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "This is my third time staying at the Omni Berkshire in the heart of Upper Mid-town Manhattan, although this is my first time staying without the family and on my own. Rate was great deal, and that was a big factor in the stay (~300/night, compared to ~500 normally) for the week before Christmas. This hotel is all about location, location, location! You are the same distance to Central Park as you are to Times Square. Right by Rockefeller Center, 1/2 block from 5th Ave, and only minutes to all the major shopping up north off Madison Ave. For those looking for an amazing experience within the hotel, the Omni will not amaze. The rooms are overpriced relative to size, even for Manhattan and the noise level from outside is disturbing at almost every location throughout the hotel; whether the noise is coming from outside or the floors above/below, the Omni just happens to be of an older construction with thinner walls and windows than one would expect from a 4-diamond ranked Hotel. As long as the price is right, it's not that bad of a hotel, but sells itself as a luxury-minded, high-end hotel; however this claim is only holds true on the surface.", "title": "Great location, not so great service", "user": "na711cho", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12945369}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My husband, 12-year old son and I just returned from a trip to NYC where we stayed at the Omni Berkshire for two nights. I learned about a special rate being offered at the hotel via Travel Zoo. At $209/night (plus taxes), we were a bit concerned about what we'd end up with, but the hotel was lovely, staff very friendly and efficient and the room exceeded our expectations. The room was a suite, probably 500 square feet, with separate rooms for our king size bed and the sitting/living room area with pull out couch. Each room had its own T.V. -- a real perk for my son. Because they knew we were visiting with a child, they delivered complimentary Yoo-Hoo and cookies to our room each evening.", "title": "Pleasantly surprised at the Omni", "helpfulness": 1, "user": "travelin5705", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12361020, "likes": {"liked": "— location close to attractions without being in the middle of the hustle bustle", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The location at 52nd & Madison was an easy walking distance to the attractions at Times Square & Rockefeller Center, theaters and shopping -- without being in the middle of the hustle bustle. We bought a three-attraction pass at Rockefeller Center that included admission to the Top of the Rock - where we were fortunate to enjoy an exceptionally clear night's view of the entire NYC area, an NBC Studio Tour, and a Stage Door Tour of Radio City Music Hall - well worth it if you've ever been there for a show (or not) but never had the opportunity to appreciate it's history and splendor without the thousands of show-goers.", "title": "Fantastic Hotel in Midtown Manhattan", "helpfulness": 2, "user": "alexchan88", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12280120, "likes": {"liked": "— Location", "disliked": "— Contruction next building"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I would comfortably recommend the Omni Berkshire.", "title": "Ok", "helpfulness": 2, "user": "kjfiliault", "date": "December 6, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 11285731}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The Omni is a very nice hotel. It's not flashy, it's not overly fancy, but the sleep quality was very high for NYC. The service was very accommodating. It's a perfect hotel for business if you need to stay in Mid-Town. A little on the pricey side for what it is, but it's NYC, so what isn't expensive.", "title": "Quality hotel, quiet sleep", "helpfulness": 1, "user": "fozzetti", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118416952}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Extremely friendly, helpful front desk staff, concierges. The very best parts of the hotel are the staff members and the great location. The hotel was recently remodeled and our room was clean, well appointed and a good size. Our Internet connection was somewhat weak and slow, and they do charge if you are not a loyalty program member. Nice amenities if you are a loyalty program member (bottled water, newspapers, beverage delivered to room in am). TV, air conditioning, shower worked well, though I hate bathtub showers. We actually really liked the restaurant and had two meals there. Good elevator system also (never had to wait long). I recommend the hotel and rate it \"very good\" primarily because of the excellent, helpful, friendly staff, overall room cleanliness and amenities, and the great location; and because it is a good value for New York City.", "title": "Good Value; Great Location; Friendly Staff", "user": "IllinoisLovetotravel", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118388987}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I stayed here for two nights. While the hotel interior and rooms are nice, that is certainly not everything, because I experienced the most inept service I've ever experienced at a hotel. I've stayed at places that cost a fraction of the price and received much better service.", "title": "Worst Service of My Life", "helpfulness": 4, "user": "John K", "date": "September 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 118337564}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The air conditioning in our room wasn't working, so we asked at the front desk to get it fixed. We also asked for our room not to be cleaned. We were gone for 10 hours, and when we returned, the AC wasn't fixed, and our room was cleaned.", "title": "Perfect choice in NYC", "user": "tmhmimi", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118293382}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "First of all, for a hotel of this supposed caliber, you think they would have better record keeping to know when not to enter someone's room, and if facilities are working in a room.", "title": "Midtown Omni a Real Treat!", "user": "CherokeeLola", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118206777}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Stayed at hotel for weekend. Very impressed for big city location. Ideal for most venues, staff were friendly and helpful and we really enjoyed our stay. Booked it having read previous reviews and not disappointed.", "title": "Great hotel", "helpfulness": 1, "user": "D1962", "date": "March 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4623858}, {"rating": 5.0, "title": "Nice people", "text": "My two sons and I visited NY between February 25 and March 3 2006. The people were very nice. The room spacious and clean. The location could not be better.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 5, 2006", "id": 4583138}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We stayed at the Omni for a weekend (with the hotel's special weekend rate - $199/night) to celebrate our anniversary. Our flight was cancelled and the Omni allowed us to cancel our reservation for the first night at the last minute. The rest of our stay was just as easy. The room was nicely decorated, comfortable, and spacious. The location was perfect -walking distance to Times Square and the subway, even in the middle of winter. We highly recommend this hotel!", "title": "Great Stay at the Omni!", "helpfulness": 2, "user": "MelWPB", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4567961}, {"rating": 5.0, "title": "Superb location with superb people", "text": "You really cannot beat the location of this hotel. The subway is so close. You can walk to most places. I had my 12 year old daughter with me and we walked everywhere even with the worst snow storm!!! Saint Patrick Cathedral is outside the door practically. If you do not want to walk, you can easily get into the subway. The staff is utterly kind and professional. They will go out of their ways to please you. They all look as if they really enjoy going to work at the Bershire. The free beverages in the morning just add perfection to my days early in the morning. The rooms are very big for New York. This hotel is CLEAN!!! I am very picky with cleanliness especially with hotel bathrooms and I was floored at how immaculate it is!!!! I strongly recommend this hotel to anyone even the pickiest travelers!", "helpfulness": 3, "user": "MLD31", "date": "February 22, 2006", "id": 4496603}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "This is a very nice hotel in an excellent location. For reference, it is near the Waldorf Hotel. However, since it fronts on 52nd, rather than a main street, cabs can be a little hard to come by. Our room was an adequate size, with lovely furnishings and a nice bathroom. I might reserve one up from the run of the house next time because I think this was probably the smallest of their rooms. The room was also extremely quiet with a minimum of street noise. The lobby and public areas are smaller, understated and elegant. This is not the big splashy lobby type hotel. In fact, two cab drivers did not know the hotel by name, so have your street adress handy. I would also strongly recommend putting out the door hangar for coffee the night before if you want coffee. There is no coffee in the room and when I called room service for just coffee I was told it would be 45 minutes to an hour. I would like to see this hotel add coffee pots to the room to eliminate this problem.", "title": "Quiet hotel in good location", "helpfulness": 5, "user": "DRace", "date": "February 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4471014}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We were traveling together with 2 families for a total of 7 people. I emailed management before arrival to requests certain accomodations. Management responded with an email that everything possible would be done to accomodate us and this was true. The only requests not fufilled was no view, as we were on 7th floor but that was ok as we did not spend much time in our rooms anyway. We arrived, rooms were not ready but they stored our luggage for us. Check in was smooth when we did arrive back. Again, we toured New York and spent very little time in our hotel but when we were there it was very relaxing. Location is great! Rooms were spotless, large and extremely nice. Housekeeping did a wonderful job and the doormen were helpful. I want to mention especially William who went above always speaking to us, holding traffic for us to cross the street, hailing a taxi and just extremely friendly. He is a plus to this hotel! We would stay here again and recommend it due to the location, rooms and management. In this day and time it is refreshing to experience a business who really cares and wants you to be happy!", "title": "Great Location, very clean, nice large rooms, and Great Management", "user": "ilovechristmom", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32176531}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Omni provides excellent ambience and access to the business district. The staff is very courteous", "title": "Omni has a perfect location", "user": "Srikg", "date": "June 12, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 32170381}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Arrived early but still had our room ready. the room was a good size for NYC and very clean. Our view was not the greatest, but I did not ask for a room with a view. The staff was so friendly and helpful. The maids could not do enough for us. We never had such prompt and excellent service. The concierge was probably the best we ever encountered. I just cannot say enough about the staff at this hotel. The bar as usual in a hotel was a bit over priced compared to other places we stopped in at.. The papers in the morning were fantastic and the coffee and tea delivered to the room in the AM was wonderful. We also received bottled water in the room the first night of our stay. They turned down the bed everynight and the room was always perfect nomatter when we came back to it. You could tell it had been attended to.", "title": "LOVE the Omni Berkshire", "user": "teena99", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32024753}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We stayed for 5 nights over the Memorial weekend. Good sized room with 2 queen beds as we had requested. Definitely sign up for the free internet and coffee service plus free paper delivered when you request. Friendly staff from concierges to cleaners. Excellent location for shops and sights. Little bit noisy at night but you are in the centre of Manhattan and we got to see Nicolas Cage filming in the street!. Isadora's across the road very useful for snacks etc. Had worst breakfast at Prime Burger opposite St Patrick's ...had best breakfast at Madison's on 3rd Avenue. Enjoyed two late nights at the Fireside bar - pricey but decent measures! Would definitely return.", "title": "Absolutely no complaints!", "user": "quietsteam", "date": "June 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0}, "id": 31725115}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We are frequent travlers and I was excited that we got an Omni hotel on PriceLine. Ended up landing this one for a 5 night trip for $150 a night. So not bad. Check in was quick, the lobby was clean and straight forward and the location of the hotel cannot be beat. We upgraded to the superior room since PriceLine always only gets every hotel's sub-par room. The room fealt very out dated, and Motel 6ish. The bathroom was also very small. The TV is old, small and off to the side (I have come to expect a nice big flat screen from any 4 star hotel we stay at these days). Here is the strangest thing: On our first night of arrival we went to jump into bed and quickly realized that there was only a bottom sheet and comforter, meaning the comforter rest atop your body. The same public comforter used by every guest...this was unacceptable so I quickly phoned the front desk, and they ran a sheet up to us and told me that although they never provide a top sheet he would make sure the maids were made aware of our preference and would leave a top sheet for the remainder of our trip. Well they went 2 for 4 and we had to call for a top sheet on 2 other nights. Very strange.", "title": "Not great - Not horrible.", "helpfulness": 1, "user": "PressuredUCLA", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 31339241}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I loved staying at omni berkshire, it was a hotel that was really all about catering to you and getting you the extras that other hotels would normally not even bother with.", "title": "Amazing location and great staff", "user": "Mardy J", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 118003378}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I booked to stay at omni during my business trip to NY. First off, the location of the hotel couldn't be better. It's right between madison and 5th ave. so you are literally steps away from all the iconic NY shops and there was even a crums location just on the other side of madison from the hotel.", "title": "Simply Wonderful", "user": "FBrown", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117981026}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The staff was really kind and very well trained. there all hustled to get you whatever you wanted, taxi, hold the door for you etc...", "title": "Fantastic Option in NYC", "user": "texasgirl020", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117845885}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "my favourite part of the trip was the fact that I asked for a room but got a suite at the same price. The room was super clean and tastefully decorated. The bed was king sized and very plus. Bathroom ammenities were sufficient. My favourite part about staying at the hotel was that there was a complimentary breakfast that was included with the stay. Also on the first night, when I came back to the hotel after a meeting, they knocked on my door and delivered a cheese and fruite platter. My co-worker got the same thing plus a bottle of wine to relax with.", "title": "after yaers i font the a very good hotel in new york", "user": "frank b", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117837296}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I highly recommend staying at Omni, it had more room and more service than most other new york hotels I've stayed at.", "title": "Service, location, and comfort all in one", "helpfulness": 2, "user": "hockeychief", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117704354}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I have visited New York a few times and when doing so I like to stay in and experience different hotels.", "title": "OK, but would not stay here again", "helpfulness": 1, "user": "sandinmyshoe", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 29155014}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "The primary reason I selected this hotel was due to it's location, which is good and has been positively commented on in detail in other reviews. The hotel itself is showing signs of age , particulalry in the public areas. We were initially allocated a room on the 13th floor, unlucky for some. This room was overlooked by a building site which was in very close proximity to the room and was very noisy. This was not acceptable and we requested a room change. Initially we were offered a room on a smoking floor, again not ideal for us. After a bit of persistence we were moved, or to be more precise we moved ourselves to a room on the 8th floor at the front of the hotel. Not much of a view either, but the room was a reasonable size and the fittings and fixtures were in good condition. Although, the showers could really do with updating. I was concerned traffic noise might have been a problem being on such a low floor, however we weren't disturbed.", "title": "Clean, great location, super staff", "user": "detroitmom", "date": "April 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28760615}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Initially, we didn't find the hotel staff particulalry helpful, a couple of times we had to hail our own taxi, not a major problem I know. I also requested the concerige confirm a restaraunt reservation while we were out during the day, surprisingly this wasn't done for us despite me having written all the details down for them. Although on the last day the doormen were very friendly and helpful. Would I stay here again, no, this hotel is not a five star property, it's three star plus, as a result it is comparatively overpriced. It strong point is it's location, but this is New York, there are a number of better quality hotels in the vicinity. If you are visiting New York for a special occasion and want to stay somewhere to remember, then look elsewhere. If you're visiting with friends or a repeat visitor and just need a room, you could do worse but, you could do better.", "title": "Very friendly, large rooms, excellent location", "user": "Marc I", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 28665814}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Visited NYC with six friends last weekend. Paid $220/night for a spacious (even by non-NYC standards) well appointed room. Room 1602 is a corner room with entry vestibule, love seat (not a pull out), desk, chair/ottoman, wardrobe, king bed and large bathroom. Hotel staff was terrific. The only glitch we ran into was that we had booked four rooms with two double beds each - even calling twice to confirm - but all that was 'left' at 2:00pm when we checked in were king-bedded rooms. Two roommates chose to have rollaways, which fit fine in the room. Hotel is extremely well located.", "title": "Omni Berkshire Equals Quality", "user": "sandylbi", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28577304}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We were very well greeted at the Omni and provided with a beautiful upgrade to a marvellous corner room. The room was spacious and well appointed.", "title": "Great hotel, great staff", "user": "Jedi_Donkey", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28516912}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Stayed on a busy Saturday night in November. Hotel was fully booked. Room was ready at noon when we checked in. Hotel parking greeters were welcoming and upbeat. Our 7th floor room looked out on Madison Ave and a fun street fair. Room was immaculate and pleasantly sized.", "title": "Lovely, clean, calm", "helpfulness": 2, "user": "Netlizard", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 11195437, "likes": {"liked": "— frinedly service, cleanliness, location", "disliked": "— food was pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The location is out of the Times Square craziness yet convenient to everything. Just a short walk to Bloomingdales!", "title": "Fantastic stay", "user": "rathertravel", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11184220}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Stayed at the Omni for the US OPEN tennis tournament. Very comfortable, spacious rooms (for NYC) excellent service,location etc. Clean, comfortable beds. Would recommend and stay there again for sure!", "title": "Perfect spot for the holidays", "user": "spotter1314", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11162468, "likes": {"liked": "— The Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My Family and I stayed at the Omni Berkshire for 4 nights over the Thanksgiving weekend. This is an excellent hotel in an ideal location. You are a 5 minute or less walk from everything (Rockefeller Center, Times square, Fifth Avenue shops and Central park.) The hotel itself is very nice and for a fairly large hotel has a boutique feel to it. We had a standard King room which was more than nicely firnished and had a suprisingly large bathroom. The hotel staff was also very nice and we never had a problem getting our car out of the valet. Finally we booked the hotel on hotels.com for under $300 a night which was at least a $150 less than any other 4 or 5 star hotel in the city. so it was also a great value.", "title": "The perfect stay!", "user": "lefty303", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11161625}, {"rating": 4.0, "title": "Quiet, comfortable hotel", "text": "From the wonderful service we received from Eduardo at the Front Desk upon arrival to the moment we left, we loved our stay at The Omni!", "helpfulness": 2, "user": "seaviewCranston_ri", "date": "November 25, 2007", "id": 11055759}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Our room was clean and spacious (by NYC hotel standards). The hotel was a short walk from many attractions and a quick cab ride to others. The staff could not have been more helpful. Free internet was a plus.", "title": "Great hotel, well located", "user": "thanford", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119006149}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Breakfast at the hotel is expensive, but there is an excellent place just across the street that serves good breakfasts at a reasonable price. For dinner, try the Fig & Olive restaurant just up the block.", "title": "Nice hotel - great location!", "helpfulness": 1, "user": "kimandkiki", "date": "October 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118885674}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I was here the last weekend in September and had a fabulous time. Hotel was nice, room service was fast, and its a super clean hotel.", "title": "First time New York", "user": "KTraveller1976", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118867223}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This hotel is about a 20 min walk to Central Park or a 20 minute walk to Time Square and right by the shopping on 5th Ave.", "title": "Great experience and location", "helpfulness": 2, "user": "Deiaemeth", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118636051}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I would go back to this hotel again.", "title": "Omni Berkshire Place", "helpfulness": 1, "user": "suern0000", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118631957}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Just back from a President's Day weekend stay at the Omni Berkshire Place. We generally have a bias against the chains and were looking for more of a boutique hotel such as the Muse (which we've loved in the past), but after seeing the extremely low rate and extremely positive reviews on TripAdvisor we decided to book the Omni and take the risk that our stay might not be quite as \"special.\"", "title": "Excellent weekend stay at the Omni Berkshire Place", "helpfulness": 4, "user": "WashingtonFan", "date": "February 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6814430, "likes": {"liked": "— Great value for a high-end hotel", "disliked": "— Location near Rockefeller Center"}}, {"rating": 4.0, "title": "Location location location!!!", "text": "In short, I'm not going to tell you anything that hasn't been covered by the other reviews here. I joined the Omni frequent guest program and requested a high room away from the construction. Our room was very quiet and quite large for New York, modern and clean, luxurious if not overly formal, king bed with plump down pillows & duvet, real 3-way lights, CD/Stereo, large bathroom with good lighting, plenty of water pressure, 2 large cotton robes, complimentary high speed internet and beverages delivered to our room each morning with the Times. The hotel staff was very well trained and professional, eager to meet our every need.", "helpfulness": 2, "user": "acumom", "date": "February 19, 2007", "id": 6814332}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "In short, we were thrilled, and not just because it was a bargain. I would stay at the Omni Berkshire again without hesitation.", "title": "Wonderful stay at Omni Berkshire", "helpfulness": 2, "user": "Elizabeth V", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6783086, "likes": {"liked": "— Everything was perfect!", "disliked": "— There was nothing to dislike!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This hotel is all about location...if you are a shopper, than I suggest you stay here. It is sandwiched between 5th and Madison, with great shopping surrounding it. The concierge were fairly helpful. The doorman had a hard time hailing cabs due to the horrific weather and the location on a side street heading east bound, so most times we had to hoof it to 5th Ave and grab a cab at the corner. We were there in the coldest week of January for a big birthday. I nearly froze to death as I am from Miami, thus the complaining.", "title": "A well-run, solid four star hotel", "helpfulness": 3, "user": "EPH04", "date": "February 11, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 6780776}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "As a healthy eater, there isn't really anything around the hotel, unless you want to go to Whole foods or cab it downtown where all the organic healthy places are.", "title": "Great Hotel! Great Location!", "helpfulness": 2, "user": "Todnick", "date": "February 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6764723, "likes": {"liked": "— Location and friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed in the Omni for our honeymoon late last year. We had come from Aruba and didn’t arrive until after 9pm, wrecked. The location of this hotel cannot be beaten in my opinion. St Patricks Cathedral is literally around the corner. Our room was good, small enough but what we expected in New York. It was very clean, the bathroom was nice, not noisy, very nice hotel staff – especially the concierge. I would recommend Smith & Wollensky for steaks – you can only get 16oz steaks which I wouldn’t eat so rather than waste food I ordered the lemon chicken – which I was told was a WHOLE chicken!! So go here hungry – great steaks and well worth a visit. BICE Italian was recommended by the concierge and we loved it – really great staff, food, wine and general atmosphere. We also ate in Water’s Edge. This was nice – very expensive and the yacht was broken the night we went. They were under pressure because of the yacht being broken so I don’t think we saw it at its best. Still it was nice. We did A LOT of shopping – our favourite was Bloomingdale’s. Macys was too crowded and Bergdorf Goodman too expensive. Don’t forget to avail of the 11% discount for visitors in Bloomingdale’s & Macys. We went to the Guggenheim museum – worth a visit and hired bikes in Central Park which was brilliant. Pershing Square Diner beside Grand Central Station is somewhere we went for breakfast – highly recommend it. We will definitely be going back to New York and we will definitely stay in the Omni. Oh and it’s well worth joining the Select Guest programme – free coffee & juice every morning.", "title": "Brilliant Hotel", "user": "DublinAngel", "date": "February 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13882004}, {"rating": 2.0, "title": "Location is about all you get", "text": "My family of 6 stayed at the Omni this past weekend (Feb 15-18) and we were disappointed. First, you should know that there is construction going on right next to the hotel. We could look out our window and practically touch the construction site. We did not have noise to deal with because of the holiday weekend, but another traveler might. Also, I had booked two rooms and paid extra for King Deluxe with two beds in each room. I also phoned the hotel to reiterate this necessity and to request adjoining rooms. My children are 10 and under, so we needed them to be in an adjoining room. When we arrived, we were told that not only did they not have any rooms with two beds, but that we also could not get adjoining rooms. They offered us a cot for free in each room - but still - I had paid about $100 extra for the two beds! Running bak and forth to two rooms proved to be a royal pain.", "user": "travelingmom99", "date": "February 21, 2008", "id": 13728613}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The first night, I asked the concierge for directions to a Japanese noodle restaurant and she sent us to a different one than I had requested. Maybe she got a kickback - I don't know. The rooms are decent but the TV is TINY and as soon as you walk in, ther is a console stuffed with minibar food on the top -- I should have asked the hotel to remove the mini bar food! Also, when we left, it took over 30 minutes for the valet to bring our car. I think they didn't actually order it until we asked the second time after having waited 30 minutes already.", "title": "Above and Beyond!!", "user": "JeanieKAS", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13594558, "likes": {"liked": "— Service", "disliked": "— No hotel gift shop - no big deal"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The doorman was a pleasure and it was nice to have the hotels umbrellas (which were in our closet) on the day it rained. The location is great - but that is about all the good I can say.", "title": "This place rocks!", "user": "gatorfreud", "date": "February 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13417710}, {"rating": 5.0, "title": "It Took 25 Years to Find the Perfect NY Hotel!!", "text": "I travel to NYC 4-6 times a year for business and have stayed at more than 25 different hotels here over the last 10 years. The Omni Berkshire has always been at the top of my list, but my most recent stay here cemented it as an all-time favorite.", "helpfulness": 2, "user": "TravelSnobBG", "date": "February 6, 2008", "id": 13325082}, {"rating": 5.0, "title": "First Trip To NY From Houston, Texas", "text": "I can not stress how impressed we were with the Omni, the staff and the location! The service was impeccable! If you are going to NY for the first time STAY AT THE OMNI!!!!", "helpfulness": 1, "user": "ny2007Houston", "date": "November 24, 2007", "id": 11017426}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We are a family of 4 and we arrived at 2am because of our flight delay. Had to book a Madison suite as I waited too long to get a Berkshire suite. Great room.", "title": "Great stay, courteous staff", "helpfulness": 1, "user": "atlmom2", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10773521, "likes": {"liked": "— Location", "disliked": "— Hard to get taxi's"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Wonderful staff at the front desk while checking in. They suggested we get a roll away as we have 2 daughters. They brought it promptly up to our room.", "title": "The good and the Bad", "helpfulness": 3, "user": "BNSCH", "date": "November 10, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10736771, "likes": {"liked": "— The location", "disliked": "— The Front Desk!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Have to agree with a previous post that getting a taxi at the hotel is hard especially around 6-8pm. A couple evenings we just used a private car that happened upon the hotel (I know they must sit around there knowing the taxi situation). One evening we shared an SUV with a couple and split the cost which worked out fine as they were going in the Broadway area too and it was raining.", "title": "Great time at the Omni", "helpfulness": 1, "user": "jodiebo", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10486562}, {"rating": 4.0, "title": "Very good stay, with one problem", "text": "Loved the location as its easy to walk around to eat and shop and sightsee.", "helpfulness": 4, "user": "BMO1234", "date": "October 20, 2007", "id": 10165084}, {"rating": 5.0, "title": "Can't wait to go back", "text": "My husband and I spent a weekend at the Omni and have nothing but good things to say about the hotel and it's staff. I had stayed at the hotel on business years ago and enjoyed my stay then. I was uncertain that the quality would still be there. IT WAS!! We arrived early and quite frazzled from the drive (the tunnel entrance was a nightmare) We were checked in early and upgraded at no additional cost. The room was beautiful and the staff was friendly and helpful (especially Lenny the doorman). We will definitely be back.", "user": "shoegirlPhiladelphia", "date": "April 20, 2007", "id": 7403157}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I selected the Omni Berkshire for the weekend of April 14 - 16 based on strong Trip Advisor reviews, so thanks to all! I planned the weekend as a very special birthday celebration for my Mom, who had never visited NYC before. I'm pleased to report that the Omni was an outstanding part of a great weekend, the Nor'easter notwithstanding!", "title": "Excellent experience at the Omni", "helpfulness": 1, "user": "washpa", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7393857, "likes": {"liked": "— Location and excellent customer service", "disliked": "— nothing - it was all good"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Before traveling to the hotel, I called and spoke to a manager about our special occasion, asking for a nice room on an upper floor. When we arrived, we were upgraded to a junior suite on the 19th floor. It was lovely, clean, spacious, and quiet. The hotel also surprised us by sending up a bottle of champagne with a birthday card for my Mom, who was thrilled at the thoughtful gesture. Our dealings with all personnel - front desk, concierge, doormen, and housekeeping staff - were uniformly pleasant and professional. We felt very \"looked after\" at all times.", "title": "Great Hotel, but noisy!", "user": "PaulCardiff", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7379118, "likes": {"liked": "— Location", "disliked": "— Noise of construction site"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "As others have commented, it is a good deal to join Omni's free \"select guest\" program. As a result, you get complementary breakfast beverages and a newspaper delivered to your door. Our morning order was right on time and well-presented.", "title": "Disappointed in Omni", "helpfulness": 1, "user": "biztrl", "date": "April 12, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 7339091, "likes": {"liked": "— the location", "disliked": "— the staff and the construction"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The location of the Omni could not be better - corner of Madison and E. 52nd - so you are in the heart of mid-town Manhattan. Since we were there on a weekend (and checked out before 8 a.m. on Monday morning) we did not experience the construction noise that has been mentioned by many others. In fact, I thought the hotel was exceptionally quiet, but our 19th floor location no doubt helped in that regard.", "title": "Beware the construction noise!!!", "helpfulness": 3, "user": "LikeItIs-Reviewer", "date": "April 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7331536, "likes": {"liked": "— Location", "disliked": "— The unrequested hammer-drill wake-up call at 6.30am! Poor problem resolution by staff."}}, {"rating": 4.0, "title": "Nice hotel in a great location", "text": "Stayed here for 2 nights in Feb 2006. We got a rate of $209 per night which I feel was good value. The room was nice, especially for NYC. clean carpet, marble bathroom, nice furniture, nice bed linens, and good service. The room was a reasonable size, too, for NYC. My husband said it was nicer than the Waldorf. If you can get a rate under $300, you will probably feel you got your money's worth. If paying more than $300, there may be nicer hotels. I would say the Omni Berkshire is between the Benjamin (5-star) and the Hemsley Hotel (3-star), but closer to the Benjamin. These are just the hotels where I have stayed in NYC so trying to give a direct comparison.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4417932}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "This hotel is AMAZING!", "title": "The Best Bathtub EVER", "helpfulness": 6, "user": "SuzannW", "date": "February 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4416097}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "I checked in at 1:00pm with ease. I even had an upgrade coupon sent from Omni’s frequent stay program, which was granted without question. When I opened my door, I thought I had died and gone to heaven. I’m super picky about my hotel room’s décor, and Omni did a smashing job with the colors and textures. The room was very clean and rich feeling. Okay, let’s venture to the bathroom. Ladies, if you love taking baths, you will ADORE the bathtub. This was the deepest and longest bathtub I’ve ever had the pleasure to bathe in. Seriously, I took three baths in one evening! I loved my room so much that I opted to stay in and order room service instead of dining out in NYC. The food was delicious and prompt. In fact, the four onion soup was to die for!!", "title": "Excellent location, pretty interior, nice staff", "helpfulness": 4, "user": "lisavirginiabeach", "date": "January 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4399748}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "If you want to feel like a king or queen, this hotel should be on the top of your list. The room, service, and food are outstanding! Talk about a triple threat. I only paid $199 for my room, but I will be back and willing to much, much more.", "title": "location and value", "helpfulness": 2, "user": "GJerz", "date": "January 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4396562}, {"rating": 5.0, "title": "Perfect Hotel in the Perfect location", "text": "Omni is my home away from home in NYC!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4394192}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I'm a travel agent and spend quite a bit of time in NY. I try to stay at many hotels there, from the most deluxe to fairly moderate. A recent visit to the Omni Berkshire Place was a real pleasure. They've done a complete renovation, from top to bottom, and the property shines. So does the service, which was as helpful and friendly and efficient as at hotels twice the money. The location couldn't be better. We were there during the transit strike and walked to everything...museums, theaters, Central Park, etc. (One little tip: the stores on Madison Avenue, all the way up to the mid-eighties, are much more interesting and varied than those on Fifth.) I would not hesitate to recommend this hotel.", "title": "Outstanding Hotel", "helpfulness": 9, "user": "MBQ", "date": "December 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4305965}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Good location in Midtown. My room over looked the internal well which was probably a good thing as they were digging up the road outside at night!", "title": "Great Location", "helpfulness": 5, "user": "Bezi", "date": "November 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4142978}, {"rating": 5.0, "title": "A great surprise in Midtown", "text": "Only thing I would say is that for a hotel this smart the could provide bath or shower gel and for a US hotel it was surprising that there was no coffee making facilities in the room.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 20, 2005", "id": 4128599}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Still, I really enjoyed my stay there.", "title": "Pleasant Experience", "helpfulness": 7, "user": "Chemainus48", "date": "November 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4087613}, {"rating": 5.0, "title": "Nice Hotel, Great Staff", "text": "I am a Londoner living in New York and I travel back and forth a lot. Occasionally I've just moved apartments or somesuch and I need to stay in a hotel: this was the situation I found myself in this August. I needed to find somewhere comfortable, reasonably-priced and in midtown as I was looking for apartments in Harlem, the Village, UWS, Brooklyn etc (ie all over and needed a good central location)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 1, 2005", "id": 4077794}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel is in a great location, very convenient. Our room was rather large and very clean but we had a terrible view (a pile of debris). However, we did not spend much time in the room looking out the window. Bellmen were great and concierge staff were very helpful. Fireside Restaurant was suprisingly good. Would definitely stay here again.", "title": "Perfect location", "user": "Beens29", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28178143}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "The rooms are larger than expected. The bathrooms have exceptional water pressure and spacious. The hotel is older and shows some of it's wear but still it's very clean. Here's the rub though. Don't ask the staff for anything...and I mean ANYTHING out of the ordinary.Here are two examples. First, I was in the lounge and was seated by a party with several children. I asked to be moved and was met with \"NO\". The waiter then marched off to never return in a half empty room. Secondly, I disliked the first room I was assigned because it faced a construction site. At first ,the staff rebuffed my request. Finally, they relented and told me that would allow me to switch rooms.The front desk staff moved me but they made me work for it. They seemed to take delight in the fact I was powerless and practically had to beg them for help. As punishment for being so brazen and asking for a room change they made me wait four hours. Average at best.", "title": "Medicore service in an older hotel w/large rooms", "helpfulness": 1, "user": "Brent431", "date": "April 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 27991475}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "As a family of six we stayed at the Omni Berkshire Place in 3 Doubles for a week in April and had a brilliant time. The hotel is definately a 4* property with the service you would expect. Although it has about 250 rooms it feels like a much smaller hotel as each floor only has 35 rooms and there are plenty of lifts/elevators, and we could not fault any of the staff a single time, as everyone from doormen and receptionists to the housekeeping staff were excellent, and although all impeccably behaved, none had the prententious attitude you sometime get in luxury hotels - just plain friendly.", "title": "Superb at the right price!", "helpfulness": 2, "user": "coachroad", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27990599}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The rooms were very large by NYC standards, even though we made our booking on Priceline and got our rooms at about half of the rate advertised on the hotels own website for the dates we stayed, and so were allocated standard rooms. We emailed in advance to ask for rooms as high up as possible, as traffic noise can be an issue at night in some NYC locations, and were given rooms on the 16th floor, which was great. If you pay $300 per night, you might expect something even better than us, and so should choose to stay in a 5* hotel like the Ritz Carlton or Mandarin Oriental.", "title": "Excellent Hotel, great location, amazing value", "helpfulness": 2, "user": "castewil", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27943204}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The decor is very old-world, and although incredibly well maintanied, the hotel shows it's age with extensive use of marble, old-fashioned ceiling cornice, brass everywhere and small lifts. So if you prefer your hotels Philippe Stark cool, this might not be the best choice for you.", "title": "Never again, thanks.", "helpfulness": 1, "user": "Reenbybobeeny", "date": "April 12, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 27885773}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed for 2 nights and found the location was perfect. Easy to walk to Grand Central station where we caught the subway to go to the US Tennis at Flushing Meadows. Also right between 5th Avenue and Madison Avenue. The room was perfect ,spotlessly clean with lovely quality bedding. It was quite pricey but worth it.", "title": "superb location", "user": "patriciapilates", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118204491}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We ate at a restaurant 2 blocks away called Papillon and had breakfast at Frescos to go It was fabulous value. All bread baked fresh and choice was fantastic. Cost for 2 about $18", "title": "Beautiful Hotel, Great Staff, Amazing Location!", "user": "carvakaguru", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118181311}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "We went there for the labor day weekend and they were overbooked. It was 8pm and we were exhausted after a long drive from DC so we were in no mood to hear that they didn't have a room for us even though we had confirmed reservations. The staff was extremely apologetic and courteous (am I really in NYC?!?!?). They put us up for that night at the Tribeca Grand which was a pretty decent hotel (frankly at that point we just didn't care). They gave us $20 for the cab fare to and fro from the hotel (the cab ride was actually $15 each way so they shortchanged us on that ... oh, yeah we are indeed in NYC!).", "title": "Terrific location w/Old World Charm & Top Service", "user": "Recessionista", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118178495}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "They promised us a suite for the next night and said that they wouldn't charge us for one of the nights, and they certainly kept up their promise. The Suite was truly wonderful, a nice living room with sofas and a separate bedroom. We have stayed in bigger suites but for NYC this was quite large. They also sent a bottle of champagne to the our room as a \"sorry/thank you for understanding\" gesture which we promptly polished off within 20 minutes (waddya expect we were getting late for our 9:30pm reservation at Junoon - one of the best fine-dining Indian restaurant in NYC)!", "title": "Fabulous location and space for the kids!", "user": "RJLC", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118104032}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Overall a fantastic trip! The staff at Omni really made sure that we were taken care of! Next time around, we will book the suite, no doubt about it!", "title": "Good Midtown Location", "user": "mhender", "date": "September 12, 2011", "detail_rating": {"location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118020428}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I recently traveled to NYC to celebrate our one year anniversary. We booked through Priceline. A week or so before my husband called to ask if they would upgrade our room if others were available. When we arrived we found out we had been upgraded from a regular room to a junior suite on the 20th floor! The view was great and we were extremely pleased with the size of the room. We signed up for the select guest program and received coffee and juice in our room every morning along with free wi-fi and my husband had two shirts pressed for free. The concierge was very helpful with suggestions for places to eat, shows to see, and especially use of the subway system. All of the staff were very friendly in general. We ordered room service once and it was delivered promptly, set up for us, and tasted delicious. We also ate in the restaurant connected to the hotel once and enjoyed that as well. The location is great also - close to restaurants, subway, shopping (fifth ave is about 1/2 a block away), and tourist attractions. Overall I would highly recommend this hotel to anyone visiting NYC.", "title": "Excellent Service - Would Highly Recommend", "helpfulness": 1, "user": "lori517", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31104723}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Hotel was clean and Staff,especially Yumi, took great care of us. We were able to check in early, and everyone was very friendly. 5 minute walk to Rockefeller, 15 to Broadway, and 20 to Times Square. Felt very safe in the neighborhood. Area was not as loud and busy as Times Square, which was a plus. We could walk to the busy sections easily, but could \"get away\" when we returned to the hotel.", "title": "Excellent Location & Service", "helpfulness": 1, "user": "Honest24", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30884694}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My fiance and I stayed at the Omni for the Memorial Day weekend. We found the hotel to be very accomidating and the servce was very friendly. We checked in late on Friday night and found the lady at the front desk to be very helpful. In general, I found the front desk personnel to be very helpful the entire stay. Overall, I enjoyed the stay here, the location is centrally located and I would stay here again.", "title": "Good Stay", "user": "GTGuy314", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 30832002}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "My wife & I stayed here this past April. She had a business meeting, I tagged along to see NYC. The Berkshire Omni is located a block from Rockefeller Place between Madison & 5th Ave. I cannot comment on parking as we arrived from JFK via taxi. Check in was easy. The rooms were small (standard for big-city hotels) but clean & with full amenities. For example, full ironing board, nice hairdryer, mini-fridge, safe, etc. The bath was nice - lighted shaving mirror & excellent showerhead. Quality toiletries. Wireless internet in rooms for no cost - nice touch! The beds were superior - soft linens & super soft (while firm enough). I did not have time to check out the exercise room (it was too nice to work out inside). The staff were friendly. Beds were turned down & chocolate drink & cookies were provided. Newspapers were at the door in the morning. During rush-hour, it was hard to get a cab out front, but the doorman tried very hard! Fortunately, the subway is 1 min away & took me everywhere. The area felt very safe even at night & there were loads of things to see nearby (Central Park, Rockefeller Center, NBC, 5th Ave Shops, Time Square, NY Public Library...the list goes on). Good location for business or pleasure. Would stay again.", "title": "Central Location, Very comfortable bed, Would Return", "helpfulness": 2, "user": "adamgator", "date": "May 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29670820}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Also - desk staff held our labtop in the manager's office the day we checked out -- very easy and helpful.", "title": "Great Value, property, and location", "user": "mick1036", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29570519}, {"rating": 4.0, "title": "Great Hotel", "text": "My parents and I travel to NYC atleast 2-4 times a year. We ALWAYS stay at the omni, the rooms are really clean and nice, the beds are so comfortable you dont want to get out of them.", "helpfulness": 5, "user": "BrooklynStylez", "date": "October 22, 2005", "id": 4043980}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The location is great, your right beside 5th ave and Madison, its a good walk to get to broadway though, but if you like exercise it shouldnt be a problem.", "title": "Lovely Hotel", "helpfulness": 6, "user": "nurse87", "date": "October 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4006793}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My parents really like the fact that there is a store right across from the hotel where they can get coffee and breakfast in the morning.", "title": "A Great Hotel on Madison Avenue", "helpfulness": 5, "user": "Dudega1", "date": "October 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3984867}, {"rating": 5.0, "title": "This Hotel Made Our Vacation", "text": "The hotel is a little pricey but what can you do, its New York City...", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 24, 2005", "id": 3935897}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "I would recommend this hotel 110%", "title": "A good choice", "helpfulness": 3, "user": "ohcharten", "date": "September 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3900794}], "location": {"country": "United States", "city": "New York City"}, "stars": 4.5, "variance": {"poor": 57, "average": 110, "very good": 475, "terrible": 22, "excellent": 940}, "aka": "Omni Berkshire Place Hotel", "slim_ranking": 0.0812641083521, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Experience enviable luxury at the Omni Berkshire Place located in the heart of Midtown Manhattan. Stay just steps from some of New York City's most notable attractions including Fifth Avenue Shopping, Rockefeller Center, St. Patrick's Cathedral, Central Park, Broadway Theatres, and Times Square. Modern Technology and fresh contemporary decor are brought together for accommodations that embrace the look and feel of an Upper East Side residence. Luxury guestrooms combined with the renowned service and amenities make the Omni Berkshire Place an ideal destination for both business or leisure travelers looking to experience the excitement of Midtown Manhattan."}