{"user_rating": 4.0, "review_count": 1043, "name": "Omni La Costa Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Had clients in town and they booked a 2 bdrm. Villa at La Costa. They were traveling with kids & nanny so this set up was perfect for a family. I didn't stay but had several meetings in their suite which I was VERY impressed to say the least. High end viking appliances & all the amenities needed. Villa is set up so the 2 bdrms. still have their own private space. One bedroom had their own outdoor patio with fire place on it! Big great room that drifted into the kitchen area and plenty of bathrooms for all!", "title": "La Costa Villas were amazing!", "user": "KM634", "date": "May 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162459692}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Pools were perfect to keep the children happy while we talked. Plenty to do poolside with various ages.. slides, water park, beach walk in pool. This was before Memorial Day weekend so maybe that's why the service was poor. Hard to find service poolside. Food poolside by family pool had a limited choice... pretty fried food heavy, but if you ask for a turkey wrap they can make it for you and it's not on the menu. Their anti-oxidant Mojito.. HIGHLY recommend, very good. Adult pool had better menu but again... crickets... where's service?", "title": "Potential disaster averted!", "helpfulness": 1, "user": "UCLASteve", "date": "May 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 162375878}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Attendants on resort were very friendly and offered to golf cart to and fro as needed if you're toting around a bunch of things on this big resort. One thing I did notice... they may not 'advertise' as a kid-friendly / family-friendly place... but it offered the options equally for couples / singles / families. You could sit outside listen to live music by the blue fire grill, while kids roasted marsh mallows by that patio area. A nice lil mixture of both to keep everyone happy... young and old. It's tucked away in a quiet community but still has the resort feel. Relaxing & Convenient Happiness for everyone.", "title": "Married at La Costa Resort & Spa", "user": "TiffMichelle", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162342397}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Was at a wedding that occurred during their jazz festival, which happened to overlap. I guess they had different planning staff since the very loud (but fun) jazz festival could have drowned out the relatively brief wedding. Fortunately, during a walk just after the ceremony I walked by the jazz area and heard them say that they had to keep it down for a wedding, but that they were about to crank it up. So, poor initial planning that they made up for in the end. I do a lot of event planning and was impressed with how smooth the wedding went - ceremony, reception, dinner, dancing, each in different locations and the transitions and service were flawless.", "title": "Not a 5 star, but definitely a 4 hotel", "helpfulness": 2, "user": "Charlotte G", "date": "May 29, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 162280193}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "On the down side, the weekend was packed so service outside the wedding was slow and my some guests landed a far away as you could get from the ceremony (try walking what seems like a mile in high heels and a formal dress!). They do have golf cart shuttles, but the place is quite spread out so it's a good idea to look at a map and request a specific location if it matters. Room was comfortable and clean. Watch out for the high \"resort fees\" if you are price sensitive.", "title": "Staycation Relaxation", "user": "Robin S", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162199384}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "1) Check-in and Room - My boyfriend was staying here with his work crew while working on a job in Oceanside and since I live in Irvine I figured I'd join him for the weekend. We arrived around 10 p.m. At check in we asked how late the bar and pools stayed open. The front desk girl told us 10 p.m. and we were both really surprised by this and made a comment regarding such (especially since people were still in the bar area). The guy standing behind her didn't say any different. We then went to our room which was an accessible room. While I was not too bothered by this (the boyfriend wasn't thrilled), I was a bit surprised that the girl at the check-in desk hadn't asked us whether we were okay with this type of room. Later we found out that everyone else in the crew had been put on higher floors without balconies or patios so we were happy we had received one with a patio facing a hot tub.", "title": "Beautiful Property, Lackluster Service", "user": "Swttalula", "date": "June 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 164435002}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "2) Room Service - At 10:15 pm the first evening we decided we wanted some champagne and dessert so I hit the room service button which after several rings connected me to security. Security first said that room service was closed until I said \"then why is there a late night menu that says served 10 pm to 6 am.\" Of course the late night menu didn't offer ANY dessert options and we really wanted the cheesecake so after much prodding I got the guy to request the cheesecake by writing it on the bottom of the sheet. About 15 minutes later our cheesecake arrived (wrapped in plastic), but no bottle of champagne. So we had to wait another 10 minutes to get the champagne. In the meantime we noticed that people were enjoying themselves in the hot tub (past 10 pm mind you) so we suited up and joined them once the champagne had been poured. PS the Cheesecake was good, not great, but it did the trick. Another thing, we asked the security guy who delivered our food about the pool times and bar and he said the bar stays open til 130 am and the adults only pool until 11 - so the front desk girl lied to us?!", "title": "Ok if you like clubs - every extra is overpriced", "user": "Chris015", "date": "June 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 164428855}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "3) Adults Only Pool - my good friend came down to enjoy the pool with me on saturday while my boyfriend worked. We got there around 11 am and were able to score some chairs, which were quickly taken up by noon. The pool area is really beautiful with infinity jacuzzis overlooking the golf course. The drinks were expensive but yummy (try the lightened version of a pina colada!). The food was good, but the service was lackluster. Our sashimi app came out with 1 set of chopsticks for 2 people and when asked for another, they didn't bring them out until our tacos came out - it was extremely hot that day and I really don't like my sashimi cooking while I waited for chopsticks so I was pretty annoyed by that. The tacos were delicious. The pool closed early (4 pm) that day for a wedding, which we were ok with because we had to go, but I would have been pretty bummed if we had had more time to enjoy the pool", "title": "So So Nice!", "user": "Gary M", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164426773}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "4) Food/Bar/Restaurant/Service - On the last night my boyfriend and I decided to meet up with his work crew for dinner. We headed over to Blue Fire at 9 pm only to find that it was already closed. The sign outside stated it was open until 10 pm. So we went back to the bar to order food (which is the same food on the poolside menu). The waiter was borderline rude, never once did we receive a smile. Everything we ordered though was delicious - mai tai, shrimp quesadillas, caesar salad and the french fries. Believe it or not, we were at the bar until 11:30 pm and it was still going strong when we left....but we were told it closed at 10 pm?!?", "title": "terrible", "user": "Mona F", "date": "June 18, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "location": 1.0, "service": 1.0}, "id": 164415001}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Being from the south I have long recognized that Southern California is not the place to come if you are looking for world class service. If you can handle snotty attitudes, general annoyance with you being there, etc. while staying in a beautiful location on gorgeous beaches, then come here OR go to Bali for vacation as their service and beaches cannot be rivaled and for the amount you would spend on a room and food at La Costa, you and your honey can get flights, hotels, massages, and food in Bali for about the same price...no really...check it out sometime!", "title": "Our stay at La Costa was extraordinary.", "helpfulness": 1, "user": "Miche099", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164017747}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I asked the front desk to change my credit card on file. A trainee didn't know how to remove one credit card in the system & replace it with another one so my old card ended up being billed. After I left, I discovered this error. Now, 45 days after my departure, I am still working with the Finance office to get the correct credit card billed. Sloppiness has occured many times. Emails are not read correctly. It may seem like they are handling things while you are on-site, but this was just a mirage.", "title": "Front desk mishandled my billing. Now the Finance office can't correct it. The decent stay was not worth all this", "user": "s m", "date": "June 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 163862645}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Just spent two nights here at a meeting. The rooms were comfortable and nice. There is no turndown service and no newspaper delivery in the morning, two things that usually are offered at most high end hotels and resorts. They did a great job of getting me an early checkin on a Sunday (a super busy day for them). The only real negative was that we paid over $200 to play on the \"championship\" course and it was not in championship shape. In addition, there is no monitoring of play so we endured a 5 hour round behind a twosome of beginners.", "title": "Nice but expensive rooms, golf not so good", "user": "troutbum2", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163363321}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This was the most challenging hotel reservation experience I have ever had. I spoke to a reservation agent regarding a potential reservation. She recommended that I \"have her hold the room for 24 hours, that way Im guaranteed the room is available for me if I decide to move forward with the reservation\". I called back 30 minutes later to finalize it and was told \"Yes I see you have a hold on that room\". I was on the phone for 20 minutes with them putting me on and off hold then was asked me if a manager could call me back. Rebecca the manager called me and said the room wasn't available and that \"The 24 hold did not guarantee the room would be held for me\". What?!", "title": "Reservations Department Gets An F", "helpfulness": 3, "user": "LizaS S", "date": "June 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163091052}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "She did not apologize and and was not empathetic to the fact that I had already finalized the room with others. After 35 minutes on the phone with Rebecca I booked a different smaller suite. She then emailed me a confirmation which was incorrect and showed a different room AND location then I booked. I called her and she said the reservation was sent by mistake during the process of us looking at rooms. How does their reservation system even allow for a mistake like that to happen? She emailed me another confirmation with the correct room but it did not mention that she would guarantee 2 beds in the room. I sent her an email right away and 24 hours later have still not heard from her. The whole experience was disappointing, unprofessional, and exhausting. On top of that I was never apologized to. We have used La Costa Resort in the past for large Corporate functions as well as individual rooms, always with an outstanding experience. Unfortunately it looks like that service is a thing of the past.", "title": "Business Trip/Girl's Weekend Amazing Combo", "helpfulness": 1, "user": "cjh63", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163066178}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "What started as a business trip and then turned into a girl's weekend ended up being an amazing trip to an awesome destination! The grounds are so beautiful. The food was fresh and the staff took the time to ensure my food allergies were respected.", "title": "Great stay - even gave us an upgrade", "user": "Monique R", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162854712}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We just spent 4 days at La Costa. Best spa ever. The food is excellent although expensive. The landscaping is really lovely, with lots of little bunnies running around in the grass. We had a very large suite like room that was far away from the main area and very private (#988). It's on the golf course and the last building on the property. It doesn't have a balcony or patio but many others do. There were lots of kids around but there is a private pool for adults. We loved our visit here. I went into La Jolla to kayak one day and to the Safari Park another. Both activities were a blast.", "title": "Amazing food, Amazing Spa, Amazing hotel", "user": "wunderful", "date": "June 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165349240}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "My husband and I are staying at the resort right now. We are here for a convention and will be checking out on Thursday of this week. Upon checking in we were not asked if we needed any help with our luggage.We were given a map with the wrong information.We went to our room and was not impressed at all. We called the desk to see if we could get better accommodations .They said they were Over booked and did not have any other rooms available . We settled in our room.", "title": "Not that great of a place to stay.. Not impressed!", "helpfulness": 1, "user": "Christy L", "date": "June 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165201503}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The next afternoon we called to asked for an iron.They said we should have one in our room,which we did not. They said they were out of irons and could not help us. Went to the convention dinner with wrinkled clothes. The next day I called again to get an iron and was brought one this time. We heard from others that they waited two and three hours for their rooms. Some were told the hotel overbooked 13 rooms.", "title": "Not worth the time!", "helpfulness": 1, "user": "HowieEmbry", "date": "June 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 164833111}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We did enjoy a massage but had to question several people before we found out where the spa was located .Very strange that the activity person and the wait staff in the bar could not tell us the proper information . Both said down the steps to the adult pool.Really!", "title": "What a GEM!!!", "user": "NanaCof3", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164805345}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The same day our room was cleaned and we were not left any wash cloths ,or lotion. I found out too late.", "title": "Perfect Getaway", "user": "Diana H", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164501651}], "location": {"country": "United States", "city": "Carlsbad"}, "stars": 4, "variance": {"poor": 95, "average": 143, "very good": 273, "terrible": 79, "excellent": 453}, "aka": "La Costa Hotel Carlsbad", "slim_ranking": 0.705882352941, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Omni La Costa Resort & Spa is an iconic San Diego area resort destination, set in the coastal foothills of Carlsbad Calfornia. Our picturesque 400-acre garden retreat is California's Original Destination for Mind, Body + Sport. Here, you'll find fresh and inspired cuisine, world-class San Diego area golf and spa, stunning pools and exhilarating waterslides. You'll enjoy an innovative activities program that offers more than 168 things to do each week. And throughout your stay, you'll feel energized and refreshed.After a recent $50 million resort-wide renovation, Omni La Costa is better than ever, with renovated guestrooms and suites and a fresh, contemporary style. Current accolades include the Conde Nast Traveler Reader's Choice Award, the #1 Wellness Spa in the Nation from Spa Magazine, and GOLF Magazine's Gold Medal Resort ranking."}