{"user_rating": 4.0, "review_count": 1099, "name": "Omni Rancho Las Palmas Resort & Spa", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Stayed here for Memorial Day weekend. We have a toddler, so a couple days before I called ahead to make sure they would have a crib for our room. They assured me it wouldn't be a problem, they had plenty.", "title": "If you expect decent service and relaxation stay away. Stay far, far away.", "helpfulness": 1, "user": "nycwestvillage", "date": "August 9, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 18781626, "likes": {"liked": "— Food in the pool area.", "disliked": "— Just about everything."}}, {"rating": 1.0, "title": "Terrible service", "text": "We arrive around 9pm at night after a long drive from LA, and guess what? They don't have any cribs. I say, that can't be possible, I specifically called ahead to make sure I would have one in our room. She says, \"sorry, we're out,\" then gives me the key and turns her back on me/tries to leave. Are you kidding? Who teaches their staff to behave that way?", "helpfulness": 1, "user": "Guest86", "date": "August 1, 2008", "id": 18511066}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Trying my best to restrain my anger, I tell her that's not going to work, and to get a manager. The manager apologizes profusely and asks me what they can do. I say perhaps somebody should head over to the 24-hour wall mart and get more cribs. They say they'll work on it and apologize again. Basically I'm going to be at this place for 3 days, and there's still no assurances of having a crib for my stay. Unbelievable and imagine the stress levels.", "title": "Not the greatest", "helpfulness": 2, "user": "StacyC33", "date": "July 31, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 18445521, "likes": {"liked": "— Splashtopia but wished my four year old could go on the water slide", "disliked": "— Pool Service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "So we wait for 2 hours in our room, still no word from them. Finally we call housekeeping ourselves and they've found one. We call the front desk and tell them not to worry about going out to wall-mart (if they even were, I doubt it) since housekeeping has found a crib. We finally get the kid down after midnight. Great start to the holiday.", "title": "It was OK", "helpfulness": 1, "user": "LoveMN", "date": "July 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 18361228, "likes": {"liked": "— Splashtopia", "disliked": "— Overpriced meals at the resort resturants"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "So let's talk about splashtopia, the \"highlight\" of this property. It's ok. Lots of concrete, not very charming, but the lazy river is sorta fun, and there's a little beach area for kids to play. However...on the first day we didn't realize how fortunate we were to have chairs. Because on the second day, we got there around oh 9am, and there were no chairs left. 9am people! So that's when I and other unlucky guests spend the next 2.5 hours getting promises from the staff that chairs will be coming soon every 15 minutes. A few times they told us to just give up, they had no more. Meanwhile, some other guests are whipping out wads of cash and tipping the pool attendants, and magically lounge chairs are appearing for them. Unbelievable. I waited with other families who had the same problem the day before. Two days these poor people had to wait hours each day for chairs. I was incredibly angry after having to wait over two hours on one day. An absolute joke that you charge as much as you do for this property and you can't count how many guests you'll have and get the appropriate amount of chairs ready, especially knowing it'll be busy on a holiday weekend. Go back and read reviews from past holiday weekends, and you'll see it's the same issue year after year. And the same went for the inner tubes for the lazy river. Gone and hoarded by other guests for most of the day. Which created another lovely situation where all guests had to behave like vultures for chairs that might be vacated, or inner tubes being held on to by selfish guests. More than a few times harsh words were exchanged when some guests tried to \"steal\" chairs because guests had gone off to eat, or were in the pool not protecting their chairs. Awesome vacation right?", "title": "Beautiful Resort", "user": "baxterdog", "date": "July 28, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 18360954, "likes": {"liked": "— comfy clean rooms, nice grounds, and a fun pool area.", "disliked": "— Plates, beer cans, cups and dirty towels left too long around pools."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "I, and 23 other women, stayed at the Rancho Las Palmas June 19th for 4 nights! We are a spa group and search out properties with high quality spas.", "title": "Great Service!", "helpfulness": 2, "user": "kell113", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17167249, "likes": {"liked": "— The Beds", "disliked": "— Need flat screen TV's in the larger suites."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "We arrived on one of the hottest days of the year so it was quite a job for the valets to get us unloaded but they did it as fast as they could under the 116 degree conditions. Mike was a great valet and I would ask for him if you had any special needs throughout your stay. He went above what was expected of him.", "title": "ONLY stay here if you...", "user": "GotTimeWillTravel", "date": "June 23, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 17163816}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The spa was the highlight of our stay. It may not be the most opulent spa we have experienced, but they had excellent therapists and the service was wonderful! They are running summer specials in the spa so do inquire about them. Nathan seemed to be a favorite with the girls for massages. I did not hear any complaints about services and that is unusual for a group our size. If you like deep tissue massages....the theraputic massage would be best. Their spa lunches are great and handy to enjoy in the afternoon after treatments.", "title": "Seemed nice- but wouldn't go back!!", "helpfulness": 1, "user": "REmom2", "date": "June 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17112584, "likes": {"liked": "— Lovely property", "disliked": "— Dirty pool with horrible use hours"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I didn't hear great things from my group about the Blue Ember restaurant. They do have a nice happy hour in the RR bar, however. The Blue Ember advertises their signature cupcakes which are $8 a piece and they look beautiful! However, a couple of ladies ordered them to go and they ended up throwing them away for they felt they were stale. I would hope the pastry chef is making them fresh every morning.......but the ladies didn't think so. We basically went across the street to the Yard House, Babes BBQ, Cheesecake Factory, Flemings and Roys for dinners. All excellent!", "title": "Very Nice!", "user": "on-the-journey", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16605483}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We had a wide range of rooms with our group, from the Presidential suite to reg. rooms. Everyone seemed pleased with their rooms. Unsure why there aren't 42 inch plasmas in the larger suite family rooms? Seems odd they offer small TV's in the living rooms but 42 inch TV's in the bedrooms. The beds are very comfortable and the rooms are quiet.", "title": "Memorial Day Disaster - Not Recommended", "user": "gpk684", "date": "May 26, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 1.0, "rooms": 3.0}, "id": 16421939, "likes": {"liked": "— Leaving it", "disliked": "— Oversold, old stale food in mini bar, terrible management response"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The resort was nice especially the pool area. The one drawback was not enough servers around pool area.", "title": "Nice Resort But Bad Service", "user": "nena0315", "date": "July 27, 2008", "detail_rating": {"front_desk": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 18319862, "likes": {"liked": "— The room", "disliked": "— The cleanliness of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The room was ok. It looks like a lot a people eat in the room so it would be nice to vacuum under bed and around corners. We saw food under both bed and in corners.", "title": "Actually and good pick being pregnant w/kids & hubby", "helpfulness": 1, "user": "Millyj", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18182414, "likes": {"liked": "— It can get VERY crowded at the pool area."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The staff was not particulary friendly.", "title": "Splashtopia Rocks!", "helpfulness": 3, "user": "mblackstone", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 18071467, "likes": {"liked": "— Splashtopia!", "disliked": "— Wait Staff / Food Costs"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Great for kids but not sure if I would go back.", "title": "Disappointed", "helpfulness": 1, "user": "Horsenut47", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 17822076, "likes": {"liked": "— Room", "disliked": "— Pool area"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This year for my 5th yr wedding anniversary we decided to spend it with the kids being that I was 9 mos pregnant. We drove down from LA and didn't want to go far because of my condition (37wks). We stayed on a friday and left on a Sunday. We were greeting very nicely by the luggage guy and being that I was VERY pregnant the front desk clerk was VERY accommodating and we stayed in bldg 28 on the first floor in room 2814 which was a king bed w/sleeper sofa. Our kids didn't seem to mind the bed at all (2 girls) and my husband and I were in heaven in the king bed. The room was like 10 steps away from the pool and splashtopia. We booked the splashtopia package on the hotel website which is really a good deal because we had our own lazy river tubes to take home. Its a really good family place to get away for the week or weekend being that it also has a little beach area for babies and toddlers. Our girls stayed in the pool area the whole stay which was fine with us. We didn't buy any food from any of the onsite restaurants but instead brought a cooler and ate snacks in our room. The first night we caught a movie down the street at the plaza and the next night which was our anniversary we had the girls stay in the room (both preteens) and they ordered pizza and also went to the pool to see the movie near the pool for the kids, which was an added bonus. There are not many resorts that do this. Kids got to swim and watch a movie on a screen TV all at the same time - hubby and I went to the Cheesecake Factory in the plaza across the street. Our little sitting area outside our room was perfect! It was shaded and looked out over the golf course and the lake. We ate breakfast at Ruby's which was a 50's themed diner about 2 min away across from Apple Bee's in the plaza. Its a nice hotel the only complaint I have is the puddy near the bottom of the bathroom door even though the bathroom was very clean and nice, other than that, we will return with the new addition to our family next summer.", "title": "Nice stay", "helpfulness": 1, "user": "OliveK", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 17769971, "likes": {"liked": "— Clean accomodations", "disliked": "— Crowded pool areas"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We just got back from a trip for the Fourth of July and it was the best!!!!!! Here is my take on this resort. If you have kids under 12-- it's a must! Splashtopia is fun but CRAZY! Be prepared, bring ear plugs and a good book, Fridays and Saturdays are busy but the rest of the weeks it's quiet. Saturday nights they put up a big screen around the pool and make it movie and swim night-- the kids love swiming at night!!! Make a spa appointment they have awesome deals and the spa and tranquil pool are soothing and regenerating! Food is expensive at the resort: $6 breakfast burrito, $7 beers, $8 hot dog, $11 Nachos, while we did buy there it wasn't cheap BUT don't worry because across the street is a spectacular out door mall surrounded by built in streams and waterfall/ponds and they have great dining!!! Baja Fresh, Cheesecakes, PF Changs, Pieros, Yardhouse, Flemmings Steak-- Our favorite to do was hit happy hour at the Yarhouse they appetizers were amazing especially their take on the California Roll!!!! Go between 5-6PM and order appetizers half price! We also loved Pieros Agua-- it was so delicious! Another quicky place that appeased my 4 year old was Marios Italian Cafe which is at the end of Bob Hope next to the resort. They serve authentic italian and the best cheese pizza--we went there 4 times during our 7 day stay. Don't miss out on the Palm Springs Aerial Tram. It's about 40 degrees cooler at the top and the view is incredible. Its fun going up and down as the floor rotates 360 degrees. We saw fireworks from our hotel balcony and hit up the outdoor market fest in down town Palm Springs on thursday night at 7pm. Knotts Soak City is great if you have teens too. All and all we will definitely be back! We will make sure we stay at the same resort and in our same room! We went and looked at other hotels and think Rancho Las Palmas is the best of all of them!", "title": "We LOVED it! RLP is the best!!!", "helpfulness": 2, "user": "fultimevacaioner", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17631963, "likes": {"liked": "— Splashtopia, Scenery, Large accomodating rooms", "disliked": "— Key cards demagnetize easily."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My family of four (including 2 children ages 5 and 10) stayed at this lovely resort the week of June 21-28. I am very particular about hotel accommodations and hotel cleanliness, and I was very pleased with both the grounds, hotel room, and pool area. We stayed in the 600 building which was ideally located near both the main lobby and restaurants and the Splashtopia pool complex. Our family of four stayed in a room with 2 double beds. My only criticism of the hotel involves their choice in offering double-size beds versus queen-size beds. Though our children are young, I must concur with other reviewers who said they felt that the double beds were simply not large enough. That being said, I found the room to be tastefully decorated and very comfortable. We particularly enjoyed the lovely view off our patio.", "title": "Pool Paradise", "helpfulness": 2, "user": "Luckymommy", "date": "July 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17470087, "likes": {"liked": "— Great pool area, attractive room, good dining nearby.", "disliked": "— Onsite dining wasn't very appealing."}}, {"rating": 5.0, "title": "Perfect For Kids Of All Ages", "text": "The newly remodeled Splashtopia pool area is fun for both adults and kids. Though other reviewers mentioned having issues finding chaise lounges at the pool, we never had a problem finding 4 chaises together under an umbrella. This was the case every day of our stay, even though the hotel was \"sold out\" on several days during our stay. Additionally. we arrived at the pool at different times each day and never had an issue with seating. The pool area is a kid's dream, complete with lazy river, \"squirty fountain area\" and 2 water slides. This is all in addition to a standard pool. We spent every day, with the exception of the day we visited \"Soak City\" in Palm Springs, at Splashtopia and enjoyed each and every day. In terms of the water slides, as other reviewers mentioned, the lifeguards do enforce the 48\" height requirement. My five year-old wasn't tall enough to go down the slides, but had a great time in the pool and the other water options. Food and drinks are available poolside. Both are pricey...typical prices for any resort food and beverage. My husband and I enjoyed several delicious cocktails poolside, but found the food to be adequate at best. After my first poolside lunch, I certainly was not re-ordering each day due to the delicious food. It was merely due to convenience. That being said, my children said they thought the food was great. I guess the chicken tenders and grilled cheese on the kids menu is quite good!", "user": "JJCOJEDA", "date": "July 2, 2008", "id": 17457431}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "If you are traveling with young children, I recommend bringing a DVD player from home. The flat screen TV in the hotel room has easily accessible jacks, and we very simply plugged in a DVD player we brought along. This proved to be helpful when we needed a break from the sun and heat. We were regular customers at the video store located at Monterey and Country Club Drive. They had many rentals that were 99 cents. After a full day at the pool, we all enjoyed \"movie nights\" back in our hotel room! A side note for parents, the hotel does not have Disney Channel, and we found the \"kids channels\" offered to be sorely lacking in appropriate children's programming.", "title": "Very nice resort, could use more help", "helpfulness": 1, "user": "JGlynn", "date": "June 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17322816, "likes": {"liked": "— Great spa, Adults only pool", "disliked": "— Slow service and overpriced restaurants"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Aside from eating poolside, we did not dine at any of the onsite restaurants. You have several good options, such as Cheesecake Factory, The Yardhouse, and P.F. Chang's, right across the street at The River. Additionally, there is a Pat & Oscars at the Westfield Shopping mall about 10 minutes away. You will also find Mimi's Cafe and Ruby's Diner very close to the resort on Highway 111. Both are great choices for families with kids. If you are looking for a delicious, step back in time, don't miss a visit to Louise's Pantry located about 15 minutes away in La Quinta. Louise's has been a long-time landmark in Palm Springs since 1945. Customers would line up for a table at lunchtime. They still offer up homemade comfort food, and fresh baked pies and cakes. The original Palm Springs location no longer exists, but locals and tourists alike still seek out the good food at the newer location in La Quinta. For breakfast, try the breakfast quesadilla. Children will enjoy the Minnie Mouse pancakes. Don't miss their homemade jam, too. For lunch, their kitchen beef sandwich is both flavorful and very lean. Unfortunately, we never saved room for the famous pies and baked goods, but they sure looked good in their bakery case.", "title": "Not what I was hoping for.......", "helpfulness": 1, "user": "MWhitney", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 17286265}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 88, "average": 139, "very good": 324, "terrible": 70, "excellent": 478}, "aka": "Rancho Las Palmas Hotel Rancho Mirage", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}