{"user_rating": 4.5, "review_count": 1504, "name": "Omni Royal Orleans", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The Omni is a beautiful hotel. We attended a wedding reception there and everything was lovely. The lady checking us in was a bit rude, but no big deal. Check-out and the bellman were great. We stayed in a deluxe queen room on the fifth floor. The room was very nice, with all the amenities. The safe in the closet was broken. The bathroom was the smallest bathroom I have ever encountered in a hotel. There was virtually no counter space to put anything. The bathroom could have used a little maintenance work as well. Walls between rooms were pretty thin, but since this is an older hotel, I wasn't really surprised.", "title": "Omni--Great location, nice rooms, SMALL bathroom", "helpfulness": 6, "user": "amandatx", "date": "March 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4739509}, {"rating": 5.0, "title": "Delightful and Convenient", "text": "All in all, if the price was right, I'd probably stay here again as the location was very good. Right in the heart of the French Quarter, but it was pretty quiet.", "helpfulness": 5, "user": "sglazier", "date": "March 26, 2006", "id": 4735564}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We spent 5 nights at this elegant hotel in the heart of the French Quarter. It was most convenient. The deluxe queen room was small but sufficient and efficient, and included all the luxuries one should expect. The concierge and bellmen were very helpful. New Orleans isn't all it used to be, but the hotel certainly left nothing to be desired.", "title": "Great Stay", "helpfulness": 5, "user": "LouisianaHerb", "date": "March 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4692915}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Just checked out after a delightful two night stay at the Royal Orleans. Staff, amenities, rooms - just about everyone and everything was top notch.", "title": "Recomend this hotel!!!!", "helpfulness": 7, "user": "hobbiezm", "date": "February 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4500341}, {"rating": 5.0, "title": "You're in for a treat at The Omni Royal Orleans", "text": "Great location, great hotel. Top to bottom a wonderful experience.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 14, 2006", "id": 4460096}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This is my favorite place to stay in NO. Great location in the French Quarter. Great service. Clean. Love the rooftop pool and bar. Have stayed here multiple times and would definitely recommend it.", "title": "Favorite place to stay in NO", "user": "ymak37", "date": "December 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11630793, "likes": {"liked": "— Location, pool, pool bar", "disliked": "— Slow valet service getting the car"}}, {"rating": 2.0, "title": "not so great", "text": "I stayed at this hotel from 12/7-12/9. I had some items go missing from my room on the first night and am pretty much being told 'tough luck' from upper management. I get the impression they look at your belongings as fair game if you don't utilize the safe they provide (and have access to at any time!). Bottom line...don't take anything of any value with you when visiting this hotel. Other than that, it is a beautiful place to stay!", "helpfulness": 2, "user": "SFHArkansas", "date": "December 12, 2007", "id": 11498420}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I stayed with my family over the Thanksgiving WE and was extremely happy with the Omni.", "title": "Excellent everything", "helpfulness": 1, "user": "Guillaum", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11072577, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We booked two connecting king rooms and at the time of booking, the staff was very helpful advising on the best and cheapest solution for us, made sure with the front desk we would get connecting rooms (not only adjacent) and even told us our room numbers at the time of booking. The rollaway bed was there when we came. Rooms were rather on the small side, but clean and nice.", "title": "Excellent All Around", "helpfulness": 1, "user": "TARCY2", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10922880, "likes": {"liked": "— Service & room", "disliked": "— Lack of drawer space"}}, {"rating": 4.0, "title": "The Good and The Mediocre", "text": "Location is excellent, in the middle of the French Quarter, close to all nice restaurants, etc. but also quiet, safe, easy to walk back at night. NOLA restaurant, The Pelican Club, Mr B's Bistro, Preservation Hall, House of Blues - all these restaurants or jazz places are like a couple of blocks away - not to mention Bourbon Street if you like the drunk / party / strip club atmosphere there... Daytime, you are on Royal Street with antiques shops and art galleries. The hotel building in itself also is rather nice.", "helpfulness": 8, "user": "Giveypup", "date": "November 16, 2007", "id": 10860505}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Recently stayed at the Omni Royal Orleans for three nights. It is a very good location - right in the middle of the French Quarter - within walking distance to everything.", "title": "Good Location", "helpfulness": 1, "user": "DuffyDo", "date": "January 12, 2009", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 23495172, "likes": {"liked": "— Location", "disliked": "— Mild \"sour\" smell in our room. (Maybe the carpet was damp somewhere in the room?)"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The room and bathroom were very clean. The bathroom was on the small size and the room was a standard size - not huge but not tiny either.", "title": "Wonderful Hotel that Pampers You, Valet Staff Very Helpful", "user": "angeleyes27", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23311127, "likes": {"liked": "— Location", "disliked": "— The 800 Reservation Line-at first we got someone who didn't know what they were doing so we called back to book the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "The common areas of the hotel are quite lovely with lots of fresh flowers!", "title": "Fantastic Hotel", "helpfulness": 2, "user": "clcg128", "date": "December 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23053501, "likes": {"liked": "— The location and beautiful comfortable bed", "disliked": "— The price"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Staff was pleasant.", "title": "Charming!", "user": "MaggieMaySc", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23038175}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I stayed in this hotel last week. I got an excellent rate. The hotel was in a very good location, close to the river, Jackson Square, restaurants, etc. Beautiful lobby and great valet service. We could call down to the valet service and they had our car waiting for us when we got to the parking garage. We left an expensive digital camera in the car and one of the valet staff brought it to us because he wanted to make sure that nothing happened to it. Express Check In was down, so we couldn't do that , but it didn't take long anyway. The observation deck was great. We could go up there during the day and see a birds eye view of the French Quarter. We had a Christmas cookie in our room upon arrival. We had 2 rooms and they made sure that our rooms were adjoining. We had a robe in the closet to wear. The mattresses were comfortable. The sheets were soft. They had the room temperature set to 67, which was cold for me, but you can change it.", "title": "Best hotel in the Quarter", "helpfulness": 4, "user": "Writer/Director", "date": "December 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 22758226, "likes": {"liked": "— location, Don the concierge, balcony", "disliked": "— poor service from bartenders, sneaky rate change"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We just returned from a six night stay at the Omni Royal Orleans and we could not be more satisfied with our experience. We had a long stay at the Omni and they took the initiative to upgrade us to an oversized, jacuzzi room, without us even asking. We were expecting a very small, french quarter-style, room so we were thrilled with our oversized space with a sitting area and a jacuzzi tub in the room! The room had a definite NOLA charm and was clean and well kept.", "title": "A True Home Away From Home!", "user": "leahzub", "date": "October 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21202248, "likes": {"liked": "— Exceptional service.", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The hotel was very quiet at night, none of the Bourbon St. noise leaked down to the Omni. The staff treated us like one of the family and by the end of the week Leroy the door man was telling us \"welcome home\" when we returned every day. Travelling can be so difficult and it was a great feeling to have people looking out for you on the other end.", "title": "Beware of Staff", "helpfulness": 6, "user": "jenn_girl_md", "date": "October 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 20857702, "likes": {"liked": "— accomodated my room preferences", "disliked": "— front staff lack professionalism"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "The concierge service was very knowledgeable and booked several tours and dinner reservations for us. Everything they recommended was top notch. The location of the hotel in the quarter is great, with everything you want to see in the french quarter within walking distance. Thank you so much Omni Royal Orleans! You helped make our stay in NOLA one of our best trips yet. We will be back!", "title": "Fantastic hotel", "user": "grniii", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20768556, "likes": {"liked": "— the staff at the hotel was super friendly :)", "disliked": "— paying $10/day for internet access, but once it was up it was great (wireless)"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Check-in was fast and easy with courteous staff. Room and bathroom were both spacious and well lit. Bell service were helpful and quite prompt.They even accomodated ALL of my pre-arrival preferences (That was a first!). As a select guest member, I got free wireless internet, my paper, morning beverages accurately and punctually. Two minor mishaps which were promptly corrected: room was missing a remote- which was brought up by engineering in literally 2 minutes and nicely followed up a phone call from the front desk. The other mishap- party noise from the hallway late at night- which was quickly extinguished by their security. At this point, this was by far, the best Omni experience I've had...until check-out.", "title": "Best choice inside the French Quarter", "user": "DennisNJ", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 20648997, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Very good hotel", "text": "Upon check-out, I found out my hotel bill including restaurant breakfast charge that morning that I did not make. The front staff at check-out was quite degrading and criminalizing. At least 2 different people questioned me numerous times if I ate breakfast in the Rib Room that morning. The last straw was when the manager with a demeaning head tilt asked me \"Are you sure?\"", "user": "skpke", "date": "October 3, 2008", "id": 20600700}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed here in a basic king room for 3 nights in late December, 2007. The hotel is attractive, clean and has an accommodating staff. The prices during the week are great, then increase for weekend nights. Great location. Close to everything in the French Quarter. My only real complaint was the internal noise. If someone is talking while walking down the hall you will hear it very clearly in your room.", "title": "Reasonable price and a great location", "user": "Westshore", "date": "December 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12079771, "likes": {"liked": "— Price and location", "disliked": "— Interior noise"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Loved this place. First time here and really wanted to make sure I got a great hotel. I am on the last night of my week here and have mostly great experiences. The location is perfect. Close to all touristy things, service was excellent as well, concierges were all very helpful. I booked a superior room directly and got a great rate, because I did not want any issues with a small room. Also, definitely sign up for the select guest service beforehand. Free wifi, turndown service etc. ALSO, my birthday is this month, so they left a bucket of cold champagne in my room with a sweet card. WOW! Great touch. Had no noise issues whatsoever. All in all a great place to stay.", "title": "Great Hotel/Great FQ Choice", "helpfulness": 1, "user": "Goteed1", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11934850, "likes": {"liked": "— Location", "disliked": "— Food prices"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Some minor things for me: Room service bills. Order an $18 breakfast and by the time it gets to your room, it magically becomes $36 with all the fees and gratuities. You would think that they drove it in from Texas. I know hotels do this because business travelers could care less, but I bet if you kept those fees in check more people would order food.", "title": "Bring your tourist $$$ to New Orleans", "helpfulness": 4, "user": "cabogolf19", "date": "December 22, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 11899001, "likes": {"liked": "— Location", "disliked": "— Noise in hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Rib Room has great food, but the attitude is a little too precious for me. Although I did get a kick out of seeing people actually dress up for dinner and lunch, much of the help there think they own the place. I was about 10 minutes too late for a breakfast serving and the help clearly thought that I had some nerve for dare asking for breakfast too late.", "title": "A great first anniversary!", "helpfulness": 1, "user": "GaryKarr", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11886595, "likes": {"liked": "— The location and the concierge's friendliness", "disliked": "— The slow waitstaff at the Rib Room's bar"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I would reccomend this place to anyone and would definitely come back here.", "title": "A great place for a long or short term visit", "user": "caholla", "date": "December 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11670856, "likes": {"liked": "— Location", "disliked": "— Horrible Check-in experience"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We spent 3 nights here in Nov. 08. Overall the hotel is nice. The lobby is very nice and the roof deck has incredible views of the French Quarter and skyline. The location can't be beat and the staff was nice. We booked a king view room and were upgraded to a king balcony. The room overlooked Royal St. The room itself was acceptable but a bit dated. There were cobwebs along the ceiling. The bathroom was tiny and clean but also a bit dated. The only real issue is out of the hotels control. Royal St is very loud with street performers, cars and other traffic. I think if we went back we would get an interior room. If I needed a French Quarter hotel and the Ritz was booked I would stay here again.", "title": "Nice but...", "helpfulness": 3, "user": "GraftonTraveler24", "date": "November 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 22056307}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I just returned from a three-night stay at the Omni Royal Orleans. It was my first trip to New Orleans and I wanted to stay in the French Quarter. I chose the hotel based on the positive reviews here, the location, and a good deal I got on Hotwire.", "title": "Great location, comfortable room", "helpfulness": 3, "user": "Maenad1", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21948066, "likes": {"liked": "— Location, customer service, convenience", "disliked": "— Small rooms, outdated furnishings, no free breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Upon check-in, I was shown to a very small room with a queen bed, with a view of a wall. I called down to the front desk and spoke to the Select Guest coordinator (my joining this program before I left home was a good idea; I highly recommend it) and politely asked for a complimentary upgrade as my husband and I were celebrating our wedding anniversary. She couldn't have been nicer or more helpful; she came upstairs and showed me two king-bed rooms -- both of which, while not huge, were significantly larger than the queen room -- with a view and allowed me to choose whichever one I preferred. I took room 540, which had a view of St. Louis Street. Room 508, which I was also shown, had a view of Royal Street but was noisier -- I could faintly hear music from the bars downstairs, even with the windows closed. It wasn't very loud, but I am a light sleeper and knew it would bother me at nighttime.", "title": "Could use a good cleaning", "helpfulness": 4, "user": "SiteSeeingInAmerica", "date": "November 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 21912528}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Room 540 was near the elevator and was a smoking room, however, I could not smell any type of smoky odor (and trust me, I'm very fussy about bad odors), and its proximity to the elevator was not a problem with regard to noise -- I didn't hear the elevator dinging or anything like that. I did hear people in the hallways during the daytime, of course, but that would be true of any hotel. At night, the hallway was very quiet, and I didn't hear any street noise either.", "title": "Will return at next opportunity", "user": "UMnMD", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21817616, "likes": {"liked": "— Friendliness, ambiance, location", "disliked": "— In-room coffee was not good"}}, {"rating": 5.0, "title": "Beautiful hotel in a great location.", "text": "The bedroom was furnished in a pleasant cream and gold color scheme; the decor and furnishings were a bit faded and the bedspread had seen better days, but that didn't really bother me. There was a TV, a locked minibar, a coffee maker, a small but attractive bathroom, and a closet. The bed was comfortable. The overall feeling, in both the rooms and common areas, was that of faded elegance. The hotel could use some redecorating, but it's not rundown or shabby. I've heard it was recently purchased by a new owner who plans to do some updating, and I think that's a good idea. A luxury hotel should have certain amenities (upscale toiletries, flatscreen TVs, good quality bed linens) this property currently does not have. A fridge in the room would have been very welcome, too, as would some type of continental breakfast or evening teatime, etc.", "user": "CreeHatch", "date": "November 9, 2008", "id": 21682525}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The service here was fantastic. We'll talk about it from now on. They made our 25th anniversary a lifetime memory. We are coming back, you just can't see it all in a weekend. Thank You Omni Staff.", "title": "Omni is # 1", "helpfulness": 1, "user": "jodam", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8751579, "likes": {"liked": "— Everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This hotel takes your breath away the second you step in the door.", "title": "Absolutely amazing!", "helpfulness": 2, "user": "suzitzki", "date": "September 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8712033, "likes": {"liked": "— Everything", "disliked": "— Night front desk clerk"}}, {"rating": 5.0, "title": "The best in the Quarter!", "text": "The rooms are lovely, not huge, but so well put together with small finishing touches that are lovely.", "helpfulness": 3, "user": "dixiedee10", "date": "September 13, 2007", "id": 8709110}, {"rating": 3.0, "title": "Convenient location but just another hotel", "text": "Rooms are quiet, staff are friendly, location is absolutely perfect - you feel completely safe - rooftop pool/bar/lookout is really relaxing and welcome after being out and about in the heat.", "helpfulness": 3, "user": "Myia001", "date": "September 10, 2007", "id": 8688810}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I was unwell when we arrived in New Orleans and the staff went out of their way however they could to help me get medication and asked each day how I was feeling. Every single staff member was amazing - they exemplify customer service. The only exception was the grumpy unhelpful young woman who was on the front desk at night.", "title": "Book with confidence at the Omni Orleans", "helpfulness": 3, "user": "news222", "date": "August 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8454693, "likes": {"liked": "— The hotel is beautiful and elegant", "disliked": "— There were a few exterior areas not as immaculate as the rest of the hotel"}}, {"rating": 5.0, "title": "We only stay at the OMNI", "text": "I just returned from a 4-night stay (8/5-8/9). I've stayed at the OMNI nine times over the last several years. We had a wonderful stay at the OMNI as always. The pool area has nice new outdoor furniture (thank you!) We loved seeing the welcoming doormen and the bartenders at the Rib Room. Too bad the Touche was closed for remodeling - guess we'll see the new renovations next visit. I loved the beverage service in the morning for Select Guests-that is SO nice. The only recommendations I have to share with hotel staff is that the shower head in room 448 needs to be fixed. We stayed in this same room in Sept. 06 and it was broken then too (it won't stay \"up\" when the water is on). Also the housekeeping staff is very noisy in the am. They are all very nice, but I guess they don't realize how loud their banging and voices are in the hallway in the am. There is a large gap under the door so we can hear everything they say and every bang very clearly. There is also a stain on the bedskirt (window side) that was there last September...it is needing attention. These issues did not ruin our experience at this hotel in anyway however, just made us puzzled. The OMNI has the best location-you will be so happy you chose this hotel because of its location in the quarter alone.", "helpfulness": 1, "user": "travelinSan", "date": "August 14, 2007", "id": 8421601}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I just returned from a long weekend in NOLA. We stayed at the Omni Royal Orleans and were very satisfied. Our room was on the same floor as the pool, observation deck and fitness center, which we used daily. Hotel is close to all the places we love: Nola, the Cafe Beignet, Jackson Square, etc. So, let me sum it up: price was great, room was not huge but quite nice with a view of Royal Street, hotel itself was lovely, location TOPS, hotel staff were very friendly and accomodating, especially Marty, the Bell Captain, who always seemed to be right there wanting to be of service.", "title": "Superb", "helpfulness": 1, "user": "DOCA", "date": "August 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8406462, "likes": {"liked": "— location", "disliked": "— walls were a little thin"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We visit at least once a year and will definitely stay here again! Thanks everyone at the Omni Royal Orleans for your excellent service.", "title": "Nice Hotel, Terrible experience", "helpfulness": 3, "user": "willymcbride", "date": "August 13, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 8402510, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Let me start by saying the hotel is very pretty, the rooms comfortable, and the hotel in an excellent location in the French Quarter.It is in the heart of the Quarter but far enough away from Bourbon St so as not to be disturbed by the noise late at night. However, despite not being disturbed by street noise my fiance and I were greatly disturbed last night by the two men having very loud \"relations\" in the room next door to us. The problem was that the rooms were adjoining and it sounded like they were right inside of our room with us. They didnt go to sleep the whole night and as a result neither did we. My problem with the hotel is as follows: Not all of the rooms in the hotel are adjoining. The hotel was not even close to be being fully booked. There was no reason to put us in an adjoining room and/or they could have informed us that we were being put in such a room and given us an option of a non-adjoining room. Now these things happen and I understand that but this morning when I approached the front desk and told them very nicely what transpired and offered a suggestion that they may want to inform guests at check in of the adjoining rooms and if other options are available offer them and they basically said sorry about that but you should have called us to have your room changed. Who wants to change rooms at 2am after spending a night enjoying the music, food, and drinks of NO. They made us feel like it was our fault and we were not happy about that to say the least. The only reason I said something in the first place was so that they were aware that this happens and offer them a suggestion on how to create better customer satisfaction. There was nothing in it for me. I was just trying to help them because it was ashame that our stay was ruined by this because it is truly a very nice hotel. The pool is very neat with its views of the city and again the rooms were comfortable (though I couldnt get any cold water in the shower. It was around 100 degrees out.), and the location perfect. So if going to this hotel try not to get a room that connects with another and room 758 is definitely one of those rooms.", "title": "Would probably stay here again!", "helpfulness": 1, "user": "jennrn", "date": "August 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8279685}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "This was our third trip to New Orleans in the last 12 years and this hotel was the best we had stayed in so far. I only wish we had found it sooner. You can not hope to find a better location in the French Quarter and the amenities were great.", "title": "A wonderful hotel", "helpfulness": 1, "user": "HappyTrailsForMe", "date": "October 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10360731}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We were very pleased with our stay and hope to return again soon.", "title": "Small Room, But Great Hotel", "helpfulness": 3, "user": "ParrotHeadFL", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10088080, "likes": {"liked": "— Great location", "disliked": "— Small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I visited New Orleans for the first time this past summer, and stayed at the Omni Royal after finding a great rate online.", "title": "Omni was fab!", "helpfulness": 2, "user": "Dragonsausage", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10076860, "likes": {"liked": "— Service and location", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "We stayed on the 7th floor, which is the same level where the roof-top pool is located. While the room was small, we found the decor to be charming. There were no high-end features like flat-screen TVs or a jacuzzi, but we didn't spend that much time in the room, anyway.", "title": "5 star luxury on a 3 star budget", "helpfulness": 1, "user": "Zelda_T", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10057978}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The pool was lovely both by day and night, with a great view of the French Quarter and the river. You can order meals there, but we found that it took an incredibly long time (around an hour) for our food to arrive.", "title": "Loved the Omni", "helpfulness": 1, "user": "LiverpoolVonny", "date": "September 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10018201}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We spent on wedding night here, after flying in from our wedding in Texas and leaving the next morning for our honeymoon in the Caribbean.", "title": "Heaven!", "helpfulness": 1, "user": "NewBrideNYC", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8259346, "likes": {"liked": "— Beautiful, beautiful room", "disliked": "— Nothing - it was great."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The staff was wonderful, the entire hotel was exquisite, our room was what we both had always dreamed of - an enchanting king-size room with a large balcony overlooking the French Quarter. We were surprised with champagne and chocolate covered strawberries in our room. It was the wedding night of our dreams.", "title": "Boo the Omni - Love the Service", "helpfulness": 1, "user": "CruiseLineFans", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8252205, "likes": {"liked": "— Location", "disliked": "— Size"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We are looking forward to spending our first anniversary there.", "title": "First Class accommodations", "helpfulness": 1, "user": "travelingtexan69", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8234499}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "First of all let me preface that I got the room on Priceline for $82 so I really don't have too much room to complain. But if I would have paid regular price I would have critiqued the place much worse.", "title": "Great stay!", "helpfulness": 1, "user": "atpatt", "date": "July 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8123498, "likes": {"liked": "— Lovely hotel, great local", "disliked": "— bellhop and room service"}}, {"rating": 5.0, "title": "GREAT location, clean rooms, would stay here again!", "text": "One word comes to mind SMALL. My room was sooo SMALL. It was myself, my wife, and my 4 month old. There was no room to setup her pack-and-play so we had to make her a small mat to sleep on.", "user": "MelisaFla", "date": "July 11, 2007", "id": 8103856}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The location here is great – 2 blocks from Bourbon St. & 2-3 blocks to the River. The hotel itself is large and kept up (more so than other hotels in NOLA). The service was nothing to write home about – in fact, many times you had to repeat your request 3-4 times before someone understood or could figure out a response. The rooftop pool is average size but the patio area is nice & has a bar & towels (There is a view of the river as well). I didn’t eat at the restaurant but heard from many that it was good. Our room size was fine for 3 people – not cramped at all. Most hotels in NOLA charge extra for a third person we wanted to avoid that fee and yet had no problem milling about the hotel w/ three people. The bathroom is a little small but was nice looking w/ marble countertops and free toiletries. I would return here although on my next visit I might want to check out a more personal NOLA B&B.", "title": "Omni - Upscale hotel in NOLA w/ great location", "helpfulness": 1, "user": "lolomojo", "date": "October 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6017662, "likes": {"liked": "— The Location", "disliked": "— Rooms were a teeeeeeny bit dirty"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I just returned from staying at the Omni with my husband and we loved it. We had a balcony room overlooking the French Quarter, which was amazing. I lived in New Orleans 6 years ago, and I picked this hotel because of the location. You are only 2 blocks from Bourbon and Jackson Square (different directions), but feel like you are in a quiet area of the quarter at the hotel. I was not at all disrupted by noise even though we had a street view room. I did hear jazz music every night from around 7-9pm coming from the street, but that was a welcome sound. I did not hear our neighbors in the hotel either.", "title": "Super location! Great Hotel!", "helpfulness": 3, "user": "diana333", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6006444, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I would recommend staying at this hotel to anyone visiting New Orleans. The pool was great and the view was wonderful from the rooftop terrace. The French Quarter is pretty much completely up and running now post-Katrina. The Uptown street car to visit the Garden District and Audubon Park is NOT running. You have to take either a city bus or taxi to venture uptown. We took a bus (pick it up at the street car stop location), and it was fine. I would stay at this hotel again!", "title": "Great Hotel, Noisy Location", "helpfulness": 2, "user": "RDCollins", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5966110, "likes": {"liked": "— Location", "disliked": "— Noise at night makes it difficult to sleep."}}, {"rating": 4.0, "title": "Nice service and great rooftop pool area", "text": "I stayed at the Omni Royal for four nights in conjunction with a meeting of my professional organization from October 12 through October 16, 2006. It's a great hotel in every respect, save one: street noise.", "helpfulness": 4, "user": "jimjade3", "date": "September 24, 2006", "id": 5832851}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The rooms are very nice and very well maintained. The bed is comfortable, the furniture is high-class, the rug is clean, and the bath is impeccable. The public areas, including the meeting rooms, are also very nice. Equally important, the staff, though limited after Hurricane Katrina, is exceptional, although spread a little thin at times. My room was especially nice, overlooking one of the French Quarter streets from a large wrought-iron balcony. Fabulous!", "title": "Loved the Omni", "helpfulness": 3, "user": "DC0715", "date": "August 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5692324, "likes": {"liked": "— It was located right in the heart of everything", "disliked": "— I did hear parking was expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "We both loved this hotel.", "title": "Fantastic Stay", "helpfulness": 2, "user": "Ally11", "date": "December 12, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 22673322}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "The location is excellent; in the heart of the French Quarter but on a relatively quiet side street. There are numerous great bars and restaurants close by and it is only a few blocks to the waterfront.", "title": "Thumbs Way Up!", "helpfulness": 2, "user": "spork-girl", "date": "December 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22617285, "likes": {"liked": "— Location/Staff", "disliked": "— Nothing comes to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The pool area was really nice, a bit of an oasis and really relaxing after a busy day walking around the City.", "title": "Great location, great stay", "helpfulness": 3, "user": "Beens29", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22348932, "likes": {"liked": "— Value for price paid, location, view from rooftop", "disliked": "— Having to check out!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I loved our room, it wasn't huge, but plenty big enough. The towels and dressing gowns were big and fluffly and top quality toiletries.", "title": "Royal Treatment at the Royal Orleans", "helpfulness": 9, "user": "Dr. Pub", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22248504, "likes": {"liked": "— Great room at a great price.", "disliked": "— No complaints. None."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Overall we had a fantastic stay.", "title": "Great hotel! Great location!", "helpfulness": 1, "user": "travelerSavannah", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 22093097, "likes": {"liked": "— location and service", "disliked": "— smaller room size"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Let me first say that I am extremely particular about where I stay. The hotel room must be a certain way, the bathroom must be just right and the ambiance and decor of the hotel must be up to my standards. This hotel was wonderful! I had a room with two twin beds and it was perfect. It is not tiny like some of the reviews state. There was a small stain in the carpet by the desk, but not an issue! The bathroom can hold more than one person, and is nicely decorated with beautiful mirrors and granite counter tops. No mold in the bath tub either! We stayed on the 5th floor. There was no moldly, musky odors. This hotel is beautifully and elegantly decorated. The attached gourmet resaturant and bar is excellent. The pool on the roof is awesome. The view from the roof is breathtaking! Hotel is close to Bourbon, Decatur and Canal street. You can walk to everywhere. Emeril's restaurant NOLA is few steps away. Great food! It is also close to Harrahs casino and jackson square. It is in the center of the French Quarter. It is worth the 4 or 5 stars. It is worth it, trust me! Maybe any bad reviews that you read are from people who just can't be pleased or who are having a bad day. If you are a polite, positive person, you will enjoy your stay! Tip the door men and house keeping.", "title": "you will not regret your stay, worth it!!", "helpfulness": 1, "user": "monchy73", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8087200, "likes": {"liked": "— hotel itself and the location", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Nice Stay", "text": "We stayed at the Omni the weekend of June 16th to attend a wedding. We were greated immediately by a friendly door man who whisked away our bags. Although we arrived early (12pm) a room was ready for us immediately. The room and bathroom was very small but also very clean. It could have used a new comforter but other than that I was pleased. We overlooked the courtyard on the 4th floor and got to watch staff set up the wedding we were to attend that evening. The wedding ceremony was in the courtyard and the reception was in the adjoining ballroom. The staff at the reception was wonderful as was the food.", "helpfulness": 1, "user": "kbowden", "date": "June 26, 2007", "id": 7999454}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "I was a little worried about noise in the rooms but since we we had one on the inside it was relatively quiet. The only noise came from other guests checking out early the next morning. Our flight didn't leave until 7pm on Sunday night so the door man stored our bags all day with no problem. We found all the staff (including the conceirge who gave great directions) very warm and helpful. I would stay here again and recommend it to others.", "title": "Really enjoyed the Omni", "helpfulness": 3, "user": "Holly R", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7958940, "likes": {"liked": "— Location", "disliked": "— Pets allowed-dogs barking"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "This was my first visit to New Orleans and we chose the Omni because of it's proximity to the events in the French Quarter as we were there to attend a wedding. I found it exceptionally quiet even though only a block from Bourbon Street and that made for a good night's sleep.The bed was comfortable and I slept really well. My view was disappointing though as I looked out upon a wall. However I was out most of the day so it was not too important. Being on the 4th floor I was surprised the windows would not open but I realize now it was because of the air conditioning which was always on. The room's decor was very pleasing and very clean. My trip to New Orleans was great and I can't wait to go back !", "title": "Just perfect", "helpfulness": 3, "user": "Blue_Dogster", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7852598, "likes": {"liked": "— Location", "disliked": "— N/A"}}, {"rating": 4.0, "title": "just fine", "text": "My wife and I recently stayed at the Omni along with several friends and family members. We were in town for a convention but arrived a few days ahead of time to enjoy Memorial weekend in the city. In total we spent 9 nights at the Omni Royal. As everyone says, the location is just perfect. The rooms were clean, very comfortable, beautifully decorated, and quiet at night. We agree with most reviewers in viewing the staff as simply outstanding - warm, courteous, helpful, and efficient (Stan, you are the Man!) On one occasion we had a minor problem with the laundry service but this was rectified without fuss, and in addition complimentary drinks were sent up to the room as a token of apology. The test of a great hotel is what happens when things go wrong (as something inevitably will from time to time even in the best run establishments). The Omni passed this test with flying colours. We will be back to N'Awlins soon, and we will head straight for the Omni again. Based on our experience I would recommend this hotel without reservation.", "helpfulness": 2, "user": "basilb", "date": "June 12, 2007", "id": 7841913}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Just returned from the Omni for our 17th wedding anniversary (after reading all of these reviews)...and we just loved it! Beautiful, clean hotel, courteous staff, and great location! They even had a chilled bottle of champagne waiting for us in our room upon our return from dinner! We were able to walk to church at St. Louis Cathedral, and stroll the shops of Royal Street! Perfect stay! (Hubby thought parking rate was rip off; he felt that b/c we were guest at the hotel, parking should have been minimul if not free...oh well...) Oh yeah, I also felt perfectly safe in the city that the media is portraying as \"dangerous\"! Visit New Orleans...they need us!", "title": "Great Hotel!", "helpfulness": 13, "user": "Mom2Rhett", "date": "July 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5446800}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Given the devastation in the city, the Omni has done an incredible job of retaining its old world service. The restaurant is quite good, if expensive. The rooms are indeed small but the hotel is from another era. It's a charming place, true old New Orleans, and the service and attention to guests is excellent. I had a complaint about bathroom cleanliness and within minutes a staff of four was there to remedy the situation. The front desk staff are very welcoming and efficient. And the location is indeed perfect. In a city where very little is functioning it is a wonderful oasis.", "title": "Wonderful staff", "helpfulness": 7, "user": "Lillyw", "date": "July 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5432643}, {"rating": 4.0, "title": "Good location", "text": "Stayed at the hotel - got a great rate $89 plus tax. Staff very attentive, and asked for a high level room non-smoking. Room was on the small side, but perfectly adequate and clean. The hotel is ideally situated round the corner from Bourbon Street, and close to the waterfront. There is a charge for parking of $28 plus tax, but I was aware of this before arriving. Never ate in the hotel, but it appears to us to be a 4 star rating, and anything we asked was dealt with speedily. I think most people were happy to see tourists arriving from the UK! Everyone very friendly.", "helpfulness": 9, "user": "j0hn100", "date": "June 22, 2006", "id": 5374949}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "We went to the Omni Royal Orleans last weekend. We arrived by car but they were busy and we ended up hoofing it up the stairs in the hot garage with our luggage. The room was shockingly small, and the bed was adorned with a thin, scummy bedspread. The bathroom was the size of a small pantry and had virtually no counter space. The bathtub boasted a gaping hole between the drain and the pipe, and more mildew than a girl could ever hope for. We got suited up and went to the pool but there were only around 10 chairs, which of course were all taken, so we had no where to sit and went back to the room. To top it all off, there were tons of hidden charges and taxes. The parking was $28 a day plus tax, internet- $6 for 15 minutes. I hate to be a whiner but I feel I must warn you... this hotel has Holiday Inn flair with a Ritz Carlton price tag.", "title": "Not Quite Royal", "helpfulness": 13, "user": "srqchic", "date": "June 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5296461}, {"rating": 5.0, "title": "Excellent choice in the French Quarter", "text": "If you are looking for a French Quarter hotel, this is an excellent location--basically centered in the part of the Quarter that is of interest to most tourists. Staff were helpful and friendly. Check in was especially good, our reservation requests were accommodated and our rooms were upgraded to a larger size than we booked, all without asking. Roof top pool is nice. This is a gracious older hotel, well maintained. It was always nice to return to this oasis of cool and quiet after venturing out in the French Quarter. We did not eat at the hotel restaurant, but room service was very good. Only negatives were minor maintenance issues (i.e. slight leak from one shower head). This is well above average for a hotel of this age and probably a miracle post-Katrina.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 2, 2006", "id": 5293495}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Well appointed rooms, lovely common areas and attentive and friendly staff made my stay at the Omni Royal Orleans very pleasant.", "title": "Great Value, Great Service, Great Experience!", "helpfulness": 6, "user": "mddla", "date": "June 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5291180}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Very nice building in the heart of the French Quarter. Beautiful facade. Nice and invisable employees. The rooms are very small and decorated in an old fashioned way, but it's quiet, comfortable, and the beds are very nice. This is a great hotel for under $200 - anything above that though and you are getting ripped off.", "title": "Great Quarter Hotel", "helpfulness": 10, "user": "EHB", "date": "May 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5047471}, {"rating": 5.0, "title": "Great Venue - Great People - Southern Hospitality is Alive and Well!", "text": "Our company recently held our annual meeting at this lovely property. We wanted to begin the process of doing business throughout the Gulf Coast again.", "helpfulness": 6, "user": "Shawnie G", "date": "May 2, 2006", "id": 5028606}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The guest rooms were well appointed (I had a room with a balcony!) We were one block away from Bourbon Street and right on Royal Street, everything within walking distance!", "title": "Wonderful", "helpfulness": 5, "user": "cyndy3567", "date": "April 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4939499}, {"rating": 5.0, "title": "THE HEART OF NEW ORLEANS!!", "text": "The staff were attentive and genuinely responded like a team to all our requests. Some of their services were operating on limited hours, but they were kind enough to check in with us to be sure we were ok prior to room service shut down.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 2, 2006", "id": 4828818}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 36, "average": 116, "very good": 455, "terrible": 20, "excellent": 877}, "aka": "Omni Royal Orleans Hotel New Orleans", "slim_ranking": 0.0133333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}