{"user_rating": 4.0, "review_count": 537, "name": "Omni Richmond", "reviews": [{"rating": 1.0, "title": "Horrible Experience - Start to Finish! Total waste of $$$", "text": "Our experinence at the Omni hotel was painful from the minute we called to get directions to get to the hotel. We were transferred and disconnected to the bell stand 3 times, and upon finally getting through, they weren't even able to give us basic directions. I was told that the concierge leaves by 8pm on Friday evenings - which is ridiculous on a weekend when the hotel is completely sold out. I question the management at this property because the theme of under staffing continued to be a problem through out the entire weekend. Not once, but twice in two days our room keys mysteriously deactivated themselves, so we were unable to access our rooms and had to go all the way back down to the front desk. We paid extra for a club level room, only to go to breakfast the next morning and have an extremely rude young woman let us know what an inconvenient it was to make another pot of coffee. Upon returning to the hotel Saturday evening, there was no access to the hotel. I counted 7 cars running with their keys in the ignition because the valet was so understaffed. Honestly, I could go on and on... but the worst part was that every staff member I did have the chance to communicate with was stressed and rude. I stay in 35 - 40 hotels annually - and this hotel is simply not worth the money. You are better off staying at a hotel half the price and recieving better service.", "user": "enjoytoday", "date": "July 24, 2007", "id": 8228339}, {"rating": 3.0, "title": "Only if you must be downtown", "text": "stopped here for one night on my way further south. I got a pretty good deal on priceline, but after all the additional expenses, probably should have just stayed at one of the nicer suburban hotels. The location is convenient to many of the downtown attractions, but that comes with the price of $21/night for parking. I dont get the sense that Richmond is a bustling metropolis 24/7, so for that reason this seemed a little high. The hotel lobby is nice. The rooms are nice and reasonable in size, but nothing spectacular. The bathrooms are above average. I was disappointed to be charged $10 a day for internet access. This seems to me - a nickle and diming scam that is not typical of similar class hotels. Since there was nothing all that notable about the rest of the hotel combined with $10 additional for internet and $21 for parking, I will look elsewhere when staying in Richmond again.", "user": "Mike77777", "date": "June 27, 2007", "id": 8004592}, {"rating": 4.0, "title": "Nice hotel, great location", "text": "We stayed at the Omni in Richmond on two separate occasions in June of 2007.", "user": "ATXwino", "date": "June 26, 2007", "id": 7991985}, {"rating": 5.0, "title": "In love with all OMNI hotels", "text": "We found the hotel to be nice and in good condition after the renovation. The staff was very kind and tried to be helpful but they consistently failed at restaurant recommendations. The rooms were of an average size and decorated nicely with comfortable beds and quality linens.", "user": "woodsfamily", "date": "June 18, 2007", "id": 7871557}, {"rating": 5.0, "title": "Great stay", "text": "We didn't eat at the hotel but we did have a couple of drinks at the bar. If you are a smoker or love second hand smoke and nasty smoke smell, you will love it. Otherwise, steer clear and hit any of the restaurant bars outside in the immediate vicinity - there are many.", "user": "mjlass", "date": "June 13, 2007", "id": 7843803}, {"rating": 5.0, "title": "Great Experience", "text": "Very positive experience at the Omni. Check-in was super quick and efficient, conducted by pleasant staff. The room was clean. Service was good but not intrusive. While valet parking is admittedly expensive, that is to be expected in a downtown area where parking is at a premium. With a 10 minute call ahead, my car was waiting for me when I came downstairs. There are many nice restaurants within a few blocks in Shockoe Slip. I would definitely stay there again.", "user": "rwoody", "date": "September 25, 2007", "id": 10002128}, {"rating": 5.0, "title": "Recommend the Omni", "text": "We stayed at the Omni in April of 2007, for one night. We splurged and had one room for my husband and me and an adjoining room for our two daughters. Very large and comfortable rooms. As hotel guests we had use of the health club in the adjoining office building (did not have to go outside . . . from one elevator bank to another). Good location in downtown Richmond, very near many great bars and restaurants. I had never been to Richmond and did not expect to like it as much as I did. More character and historical flavor than I would have expected.", "user": "LillianV", "date": "September 5, 2007", "id": 8662661}, {"rating": 5.0, "title": "Loved the Omni", "text": "We arrived at the Omni Richmond and the bellhop took our things. We got the valley parking for $19.00 because the self-parking was $1.00 and was 2 blocks away. Everyone was very friendly. Clean room. Free hot or cold beverages in the morning, evening turn down service. I booked the room through priceline (name your own price) and got the room for $105.00! If you went through the hotel it was $149.00! Before you stay become a member of the select guest progam and free wi-fi(wireless highspeed internet) We will defintly stay at the Omni hotel.", "user": "josephbbrooks", "date": "September 5, 2007", "id": 8662330}, {"rating": 4.0, "title": "Great Price and Location", "text": "We spent two nights here on a weekend getaway to Richmond. The location is great and the staff were very friendly and helpful. The public areas of the hotel were nice. The room was nice and spacious but not as luxurious or refined as other Omnis I have stayed at. For the price we paid (booking a \"special\" on the Omni website), it was a steal.", "user": "pbb3a", "date": "August 20, 2007", "id": 8457668}, {"rating": 5.0, "title": "An excellent hotel!", "text": "We stayed here for 2 nights in August, and were very impressed with the hotel and its facilities. It is well located for good restaurants, and there was a free shuttle bus up to Carytown.", "user": "Nib2899", "date": "August 15, 2007", "id": 8431224}, {"rating": 5.0, "title": "Consistent Quality", "text": "I have stayed at the Omni many times over the last 15 or so years. Each time, I have been pleased with the service and the hotel, and you simply cannot beat the location. This time was no exception.", "user": "2BAnonymous", "date": "May 8, 2007", "id": 7565438}, {"rating": 5.0, "title": "Great place for weekend get away", "text": "The staff at the hotel is excellent. From the valet to the porter to the front desk, each is professional and pleasant. Much higher quality than one would expect.", "user": "MJRED", "date": "April 10, 2007", "id": 7327399}, {"rating": 4.0, "title": "Great Hotel..Nice location..off 95", "text": "The rooms at the Omni have always been good, but following the recent renovation of the hotel, I would say that they are now excellent. Hence the reason for the fifth star in my rating.", "user": "nglaw1116", "date": "April 7, 2007", "id": 7291362}, {"rating": 3.0, "title": "It was OK - under construction might be better now", "text": "Despite the high quality of the staff and the hotel facilities, the Omni remains a good value for downtown Richmond. I would recommend this hotel without any hesitation.", "user": "jek_review", "date": "April 5, 2007", "id": 7283612}, {"rating": 5.0, "title": "Greatest Staff Ever", "text": "We stayed at the Omni for the Easter weekend and really ejoyed our stay. We had a room on the 17th floor with a great view of the Virginia Capitol. The room was nice and large and the bed was very comfortable. We told the maid that we were going to breakfast and she could clean our room and when we got back it was all finished. The staff was excellent in the dining room and in the valet area. We got a lift down favorite local restaurant in Shockoe Bottom - the van was a bit late picking us up and there was some confusion but because of that we got a ride back with them after their cut off time and they were very prompt picking us up.", "user": "vchords", "date": "March 12, 2007", "id": 7148742}, {"rating": 3.0, "title": "Omni okay but beware of suites", "text": "The Omni is a very nice hotel but the suites are not worth the money. I booked a junior suite and ended up with two adjoining rooms. The only difference was a couch in one room with a bed in the other. I enjoyed the view but I think it would have been cheaper to book two rooms instead of the so called suite. I was highly dissappointed with this feature of the hotel. I've stayed in tons of suites, down to a Days Inn in college and have never seen a hotel pull something like this for a suite. Other than the awkward room the decor was very nice and the staff was pleasant. Room service was great but beware of the crab dip, it's really soup. I would stay here again but not in a suite, just a regular room. I guess I better stick with the larger cities if I want a suite.", "user": "rthotelers", "date": "February 17, 2007", "id": 6805107}], "location": {}, "stars": 4, "variance": {"poor": 25, "average": 72, "very good": 203, "terrible": 15, "excellent": 222}, "aka": "Omni Richmond Hotel Richmond", "slim_ranking": 0.164705882353, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}