{"user_rating": 4.0, "review_count": 897, "name": "Omni Austin Hotel Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I stayed here for one evening at the request of my employer. I'm usually a Hilton person. The hotel was across the street from where I needed to be so it was convenient. The rooms were great and had plenty of outlets for my gadgets. It was clean and I liked the shampoo. soap and conditioner provided. The workout room has every thing I need for exercising and it was very clean. The pool was great too. The only thing I found weird about the pool is that smoking is allowed. The room service I ordered was delicious, especially the migas for breakfast. I will stay here again.", "title": "Perfect Business Stay", "user": "LizzChicago", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170012215}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Omni while in Austin for a getaway and had a great stay. The hotel staff was extremely friendly from our arrival to our departure. We had a nice time at the roof-top pool and our suite was very nice. The location is great for all downtown activities. We walked a couple of blocks and we were on 6th street.", "title": "Great Hotel in a Great Location w/ Friendly Staff", "user": "SM46", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169753574}, {"rating": 5.0, "title": "Great location & staff", "text": "My friends and I recently stayed at the Omni Downtown on our first trip to Austin. Nice hotel in a great location downtown, walking distance to 6th Street (East & West) and Rainey Street, short cab ride to South Congress. Rooftop pool with bar is convenient for relaxing before going out. What sets the hotel apart from others is the staff. Front desk, bellhops, floor managers, and especially concierges are all very welcoming and accommodating. In particular, Rob and Miles at the Concierge desk were very helpful during our weekend stay, and went out of their way to bring activity ideas to fruition. Everyone we encountered at the Omni made us feel like welcome guests. Would definitely return if the opportunity arises.", "helpfulness": 1, "user": "Joe K", "date": "July 29, 2013", "id": 169706398}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "My friend and I were seeing a concert in Austin and chose to stay here. It is a block or two over from all the bars but not close enough to be bothered by drunks late at night. Great service from doorman, bell-boys and at check in. The pool on the roof was amazing. Very small and shallow, not for swimming, more for dipping and wading. The pool also had a bar which was very nice. The hotel was cozy, modern and very accomodating.", "title": "Loved It!", "helpfulness": 1, "user": "Mreid918", "date": "July 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 169497099}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Got a good deal through Expedia for a weekend stay. Great hotel in an even better location! So much within walking distance. Parking is easy to find. Super clean rooms and friendly service! Enjoyed the roof-top pool and bar as well. I'd live to stay here again when visiting Austin!", "title": "Excellent Stay!", "helpfulness": 2, "user": "Beth D", "date": "July 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 169237286}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I was in town for a conference and was staying near the hosting facility. I was on priceline within the first hour of check-in. I selected a 4*, named my price, and was LUCKY enough to get in @ the Omni. As soon as I walked in I knew what to expect... and was not let down. Excellent service, outstanding room, and the location could not be beat! I will be staying here again. I was in town for business but will be bringing my family back for a few days of pleasure! Austin has it all. Golf for me and shopping for my wife!", "title": "Please priceline purchaser!", "helpfulness": 1, "user": "AggieGolfer", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108973738}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "This is my third stay at Omni Austin Downtown this year. Once again I am having a great stay here. I do not understand the recent negative reviews I have read on TripAdvisor. I have never had a problem here and I have stayed in a variety of room types. I have found all the staff to be pleasant, helpful and genuinely friendly whilst professional. Every question I have ever asked has been answered promptly. The rooms are spacious,well appointed and clean. Some of the suites are a little worn and dated but are due for upgrade later this year. The pool area is great this time of year and the location of the hotel is excellent.The space and value is hard to beat. Keep up the great work, April and team.", "title": "Glad to be back !!!", "user": "Nawlins66", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108700175}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Got to hotel around 1PM on Friday for our \"name your own price\" rooms. They tell me I have a king suite on the executive floor. Got off the elevator and barely made it through thick smell of smoke. They stuck us on the smoking floor that has not been renovated. Horrible experience. How can you call that your executive floors...get real omni...stop lying and misrepresenting your rooms. The rooms were gross and falling apart with carpet coming up. I paid $80 a night for the room and that was way to much. I would never stay here again or park my car at their $25 / day valet ($18 self-park). Sound insulation is horrible...be prepared for sirens all night if you on a weekend.", "title": "Smoking Rooms for Priceline customers worse than Motel 6", "user": "bdanziger", "date": "April 28, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 105953513}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hotel was nice, but not exceptional considering what you would normally pay. We booked through a well known online discount site, so got the hotel for about the same as a new or newly remodeled LaQuinta. Staff at the counter was cold and really didn't care that we needed to be in a room getting ready for an event we were going to that evening. Robert King the Client/Guest Services Manager was the only outstanding thing at this hotel. He made us feel like he really wanted to take care of us and true or not, at least made us feel like he was trying to expedite us getting into our room. It was convenient to our event, but just wasn't what I expected from this highly rated hotel.", "title": "Check in was posted as 3:00, we arrived at 3:45, room was not available till 5:20", "user": "BeckWilhite", "date": "April 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 105340032}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I have stayed at this Omni several times, both on business and for pleasure. It's a great, professional hotel, and the attention to detail is very impressive. I will stay there again, hopefully soon!", "title": "Great hotel for a getaway!", "user": "TAskewTraveler", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105314177}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We stayed in one of the large suites in this downtown hotel on New Year's Eve. There were (6) people in our party (4 adults and 2 children). The \"idea\" was good, but the room was terribly outdated. The kitchen was not equipped with anything that might be helpful in making a simple breakfast the next morning. The bathrooms were really sub-standard with leaky fixtures and poor water pressure. The common area was perfect for the two roll-away beds that we ordered, but the blinds on the window were missing several slats so daylight ROARED in at an early hour. The ONLY good part about this hotel is the location and the view we had of the fireworks at midnight. I am disappointed in the price of the suite ($700) since the room was in need of updating and simple maintenance.", "title": "Suite . . . not so sweet!", "user": "Mis_Adventurous", "date": "March 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 98501722}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Reserved a room through Priceline. Called the hotel directly Sunday before arrival to see about an upgrade and to confirm a king room. Was told upgrades could not be done over the phone but was assured that I was booked into a king room. The person with whom I spoke did not say that they would try to honor my kin room request. Instead, she assured me that I was booked into a king room and I confirmed this with her before I ended the call. When I arrived, I was booked into a room with two double beds. The desk clerk, who was polite and helpful, got Matt, the assistant manager, who was anything but polite and helpful. He told me that I had booked through a third party and that room requests weren't guaranteed. I explained that I had spoken with someone at his hotel on Sunday who assured me otherwise and, in my opinion, had overridden any such policy. He suggested I had misunderstood and said they had tapes of calls (implying that I was wrong). I assured him I had not misuderstood and that I wanted him to review the calls and to contact me when he did so that I could listen with him. This never happened. In fact, after I said this, he backed off his original statement that the call had been preserved. He finally offered a king smoking room, which I declined. He did not apologize until the end of the conversation and it was not sincere. He didn't properly explain that the hotel was booked, he never acknowledged their mistake, and didn't offer to make any accomodations. Instead, he continued to imply that, as a Priceline customer, I was a second-class guest and not entitled regular treatment and that the mistake was mine. He finally offered to let me know if a king room came open. If did, two days later, by which time I had fully unpacked and had meetingss and did not have time to move. The hotel itself absolutely is not a four start hotel. It has not received the AAA 4-star diamond rating since 2006. The rooms are nothing special--mine was smll and cramped due to the 2 beds. It was quiet, however. Because I had joined the loyalty program, I got free wifi in the room and complimentary beverages. However, the first morning, nothing arrived and the order form was still on the door the next morning. The second morning the drinks arrived 45 minutes before requested. I gave up and didn't order again. The support staff is helpful and friendly but the management with whom I dealt was not. I had read the reviews on trip advisor and was concerned about some of the problems others had experienced and had hoped for a good experience of my own. That did not occur. I would not stay again and I would not recommend it to anyone. I will say that the location is very good.", "title": "Do Not Recommend", "user": "ebd217", "date": "February 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 98389885}, {"rating": 2.0, "title": "Noisiest Hotel Ever!!!", "text": "When I checked in I was given the opportunity to receive a pair of free earplugs. That was my first warning sign. The hotel is located adjacent to the raucous 6th street bars. Loud music, police sirens, and drunks heard until 3:00a.m. on both nights we stayed. If you have to stay here get a room facing the lobby.", "user": "DesmondBlue", "date": "February 23, 2011", "id": 97738089}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Clean rooms, but very small. $18 extra a day to park. Not worth the $.", "title": "Keeping Up with the Omni Tradition", "user": "Jackie H", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 97718661}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Do not recommend this hotel.", "title": "Great deal for downtown austin", "user": "sthom2", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 97528343}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Hotel was in a central location. If you're planning a trip over the weekend, I would not recommend it because of the influx of bachelor and bachelorette parties at the place. The walls are thin and it sounds like you're sleeping in a college dorm. The hotel staff is helpful, however if you want some sound sleep look elsewhere. I stayed for an entire week, the weekdays are fine but weekends are a different story.", "title": "good location", "helpfulness": 1, "user": "paw2004", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 166909771}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We just returned from a three night stay over the Fourth of July holiday. This was a perfect hotel for our visit to Austin. The location could not have been better. We were walking distance to the convention center, South Congress, and Lady Bird Lake, as well as the state capitol building. Every single staff member was kind and courteous and beyond helpful. We had a concierge level room and the food provided was delicious.", "title": "Just about perfect stay", "helpfulness": 1, "user": "Disneyprofmom", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 166783969}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Two minor complaints: it took a long time for our room to cool at night. It was really hot in Austin and perhaps that's why the AC just took so long to really cool the room down. Also, the hotel pool is simply inadequate for the number of guests.", "title": "Great stay all around", "helpfulness": 1, "user": "kristinmarie24", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166769682}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Other than that, it was a wonderful stay. We'll definitely be back.", "title": "Decent, not up to par for Omni", "user": "dgerson76", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 166761207}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I and a group of 13 friends stayed at the Omni Hotel- Downtown Austin the last week of June 2013 for my bachelorette party. The hotel was very nice- rooms updated, clean and comfortable. The hotel is in a great location with easy access to all of downtown Austin by foot. Without a doubt the best part of our stay was the hotel staff. Everyone was extremely friendly and accommodating. We had a mix up upon check-in with one of our rooms. The people at the desk corrected that with no issues. The concierge staff was wonderful with great recommendations for places to go and they were extremely hospitable during the breakfasts and happy hours we attended on the club level. When we needed transportation anywhere, the staff helped us immediately. Overall this was a great trip.", "title": "Great place to stay", "user": "Heshian", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166721162}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The Omni was a very good deal compared to other hotels within walking distance of 6th street. The room was in good condition / a little small / beds were comfortable. The staff was very friendly. Self Parking was not too bad at about $20 a night.", "title": "Good Value", "user": "CanuckHorn", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166680681}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "The hotel was full of drunks. Every where we went except for the gym had loud people who were drunk. Even in the mornings drunks in the pool. Had to take the stairs to avoid the foul mouth drunks. Stayed 3 night & got no sleep even in the executive suite. Hallways smelled of trash. Starbucks only sold regular coffee. No continental breakfast. Just lemon water, whole uncut fruit, & no meals served except in rooms or at the bar. A/C barely worked. The coolest it got was 78 degrees. Had to call to get room cleaned. We had 4 people in the room but were only given towels for 2 despite many calls requesting more. The \"Spa\" is not even in the hotel. Your have to drive to it. Bathroom had hair all over the floor. No fridge in room. Will never stay there again.", "title": "Great place to stay if you enjoy being with loud drunks.", "helpfulness": 1, "user": "Shannonrober", "date": "July 7, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 166638115}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I was recently at this hotel due to a conference. The room was nice (in a King Exc), but nothing exceptional. The TV in the sitting area never worked right. The cable would lose signal after 10 minutes of viewing. However, the TV by the bed did work. The shower took a really long time to get hot water. Overall, the bathroom was pretty nice. The hotel itself just seem ok at best to me and nothing super special.", "title": "It was OK at best", "helpfulness": 1, "user": "Klion77", "date": "June 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165801331}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "A large group of us stayed for three nights in early May. The rooms were outstanding! Large, clean and a great nights sleep. We even bought one of the down comforters that was on the bed from their website when we got home. The concierge had a map of all the local restaurants and even offered to make a reservation for us. Will ABSOLUTELY return next time we are in Austin.", "title": "Excellent wedding destination", "user": "Sharon M", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165784459}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This was my first stay at the Omni in downtown Austin but I hope it will not be my last! This hotel is in a perfect location. Just a block of two from all the hopping bars on six and seventh street, close to the UT campus and it is surrounded by restaurants. Now, let me be the first to say that the Omni has a GREAT breakfast buffet with out a doubt it is the BEST BREAKFAST BUFFET I HAVE EVER had the pleasure to enjoy. And the bar is cozy. My favorite item to snack at the bar was a Mexican chicken dish that was great.... and the hamburgers are awesome! The property is well maintained, clean, well appointed and the staff are professionals. The rooms are excellent and are lacking nothing. Soft beds, curtains that do keep the light out and air conditioning that will keep you under the covers all night long. That is a very important factor when you travel in Texas!", "title": "Two perfect nights of rest.", "helpfulness": 1, "user": "FamilyManFrom_E_TX", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165616911}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "The lobby is lovely, check in was quick and efficient. Then we got to the room. Tiny, with an odd little closet that looks like a washer/dryer belongs in it. A king bed one(!) end table, a desk and two chairs. No available electric outlets except in the bathroom and that funny little closet. WIFI for a fee (I hate that). One bright spot, the shower. Good pressure, plenty of hot water.", "title": "Nice hotel - except for the room", "user": "JohnAndTheresa", "date": "June 3, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 111274916}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Staff was great- from housekeeping to concierge! Rooms were noisy at night but would stay there again and recommend!", "title": "Nice place and great staff!", "user": "HNYMOONER28", "date": "May 31, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 110835646}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "This hotel has a very prime location one block form sixth street. The rooms were large & nice, and the service was good. The down side is this hotel has a huge glass atrium, which in December made for a very cool lobby. I would not want to be the the lobby in August", "title": "Prime location", "user": "wesheltonj", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 109396293}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "I stayed for a business convention. The Omni is not as close to the convention center as some other hotels. That said, it was a pleasant surprise. Nice clean rooms Ana pleasant staff. Very close to many restaurants and live music venues on 6th.", "title": "Nice hotel, close to nightlife", "user": "jakeiszues", "date": "May 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 109225433}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I stayed at the Omni Hotel Austin from March 27th to April 1st for a conference. This hotel does a good job catering to conferences. The rooms were well stocked, the included meals were good. Breakfast was pretty much the same thing everything, but lunch had something different every day. One negative is that area did get rather cold. I like it on the cooler side, and I noticed it was cool, so I am guessing most people would have been cold, as some of my co-workers were. The hotel is a block up from the 6th street, the entertainment hub of the area. There are plenty of bars, restaurants, and music venues to keep the nights as lively as you like, all in walking distance. The actual hotel rooms are nice, soft comfortable beds, and I felt it was good price.", "title": "A nice business Hotel, close to entertainment", "user": "jhulsla", "date": "May 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 109106209}, {"rating": 2.0, "stay_parameters": "Stayed April 2011", "text": "Booked a suite for a romantic weekend to celebrate our anniversary. The room they gave us had ripped carpet, poorly equipped kitchette, cigarette burns in the carpet and smelled horrible. They then sprayed the carpet with freshner but that only burned our eyes. Could not give us another suite nor would make other arrangements. The manager admitted she would not want to stay in that room. They eventually moved us to a standard room that had been updated, but the mood was lost and the trip a disaster.", "title": "I'd rather have been in a Motel 8", "user": "Dmcam102", "date": "April 3, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 102642409}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The Austin Omni Downtown was the dirtiest, nastiest hotel experience I think I've ever had. I was in Austin for 4 days for a conference, and booked a room at the Omni. Let me share with you how their website described their rooms at the time of booking: \"... contemporary Texas decor, including dark woods and crown molding ... spacious bathroom with granite vanity and lighted makeup mirror ....\" The Omni Austin Hotel Downtown's website summed up it's rooms as \"Texas hospitality meets cosmopolitan elegance in Austin's bustling downtown.\" I paid $250/night - but with all that, how could I possibly go wrong? Well ... please see for yourself - I'm attaching photos of the room that I took with my iPhone.", "title": "Room so Nasty it was Shocking", "helpfulness": 6, "user": "RoxxinTampa", "date": "March 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 102105217}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The room was unbelievably disgusting, but it doesn't quite tell the whole story. Worth noting was the noise. I'd specifically requested a higher floor when, at check in, Murphy the desk clerk asked me if I was a light sleeper, and notified me that \"sometimes the rooms can get pretty noisy with street noise.\" I figured the hotel must take it's guests' needs for a quiet night's sleep seriously when, in addition to the desk clerk's noise warning, I passed curious signs at the elevator on my way up to the room that instructed \"NO UNAUTHORIZED GUESTS IN GUEST ROOMS\" and \"NO PARTIES IN GUEST ROOMS.\" Well, again I was wrong. I was placed on the 18th floor, but that made no difference. Not only was the street noise loud, but there were at least 5 or 6 people screaming and cheering in the room next to mine until well after midnight (when I finally had to call the front desk for help).", "title": "great stay, minor complaints", "user": "Biagi", "date": "March 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102099061}, {"rating": 1.0, "stay_parameters": "Stayed March 2011", "text": "Not all elevators were functional during my 4 day stay, and one of the functioning elevators routinely malfunctioned (call buttons didn't work - didn't matter what floor you wanted or whether you needed to go up or down, it ignored all call requests and would not take passengers to the 1st floor lobby, causing us all to have to use the stairs). Carpet in the elevator was faded, delaminated, dirty and frayed (c'mon, Omni, how much does it really cost to replace a 6'x6' square of carpet?). Parking is $25/day to use valet service (not including tip).", "title": "Stay Away From This Awful Hotel", "user": "BizyBizTraveler", "date": "March 27, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 101729139}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "In addition to the photos, which pretty much speak for themselves, I found that the overall cleanliness of the hotel is bad. REALLY bad. I didn't want to touch anything in that room. The Omni's idea of a hygienically suitable setup for your morning coffee is to put a few packets of splenda and a single stir stick, all unwrapped, in a tray next to a coffee cup. Whose fingers (or worse) have touched that stuff before me??", "title": "I would stay there again.", "user": "froglegs54", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 99797514}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Stayed here for a couple nights with a friend. We were in town to check out Austin and as many of it's great dining establishments and interesting places as possible.", "title": "Great Location! Very Clean!", "user": "mainetoday", "date": "April 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 105307338}, {"rating": 3.0, "title": "Nice \"Free\" stay but could use a few tweaks", "text": "First off, this hotel is very convenient to 6th Street and for us, totally within walking distance (or a short cab ride) to the Warehouse District. The rooms were clean, bed pretty comfortable and the bathroom was good-sized with plenty of amenities. The TV's were newer flat screens, but i think they need to tweak the cable/satellite, as the reception wasn't great on every channel.", "user": "A TripAdvisor user", "date": "April 23, 2011", "id": 105161497}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We did check out the rooftop pool and hot tub. Not too bad, nice panaramic views of the city. If you want a good pic, stand on the top of the hot tub...", "title": "Not up to Omni standards and definitely not a 4-star hotel", "helpfulness": 1, "user": "Travel_Buff_BL", "date": "April 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 103233023}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The concierge did help us out with recommendations one night as well...", "title": "Mutton dressed as Lamb\"", "user": "Jagggs", "date": "April 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 103069547}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "The room was convenient to lot's of attractions, but as i read on TripAdvisor and as i noticed on Sat. night(early in the morning), if there is anyone partying in a room, you can hear everything. The walls are kinda thin... They do make you sign a waiver that says that you cannot bring any \"non\" hotel guests to your room after 10 PM, which was quite odd, but understandable, as it's so close to 6th St. Note: we did get back there at like 12 midnight on a Thurs. night and there was no security around, just the front desk people and they did not even verify our keys...", "title": "BEAUTIFUL HOTEL!!", "user": "n5nar", "date": "April 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 102978257}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My favorite part was the bed. Most comfortable beds -- I could've stayed there for days. I wasn't able to though. It was a quick trip into Austin for my husband's class reunion. We got there mid afternoon and the pool looked fabulous so I was ready for pool time before the evening festivities. It was extremely hot - well over 100 degrees - but the bed in the room was all I needed. The room was very comfortable. The lobby was also very nice. I enjoy big lobbies where you can sit and people watch if you'd like. They had a Salsa Dance competition going on so there was a lot to watch from the lobby view. And this dancing went on well into the morning. I could hear loud voices in the hallway around 4:00 AM. I could tell these people were being very thoughtless and noisy, but honestly, the sound was quite muffled from my room and it wasn't a big bother. I liked that ALOT!. Only one problem was the parking. A very large parking lot and yet, with this dance competition, there was no place to park except way in the back which bothered me a little - a long walk, but it was well lit so not too bad. We could not find a place to eat breakfast the next morning so it would be nice if more information available for those looking for food. We had a very nice stay here and will definitely stay here again.", "title": "Home away", "helpfulness": 1, "user": "Carey D", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168584411}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "From the valet greeting us immediately to the doorman and front desk service it only took a few minutes to realize this was a top notch hotel. Our initial suite was not ready at check in so they gave us the option to upgrade or choose another suite in which we chose the suite with the work out area on the 19th Floor (1909 to be exact). This room has a very, very nice view of the Atrium AND the State Capital which was a nice bonus. Room was excellent down to the bed, shower and pull out bed for our kids. Maid service was excellent and turn down service was a nice as well coming back and able to just climb in bed. Whenever we needed something (towels, pillow, etc) it was only minutes before someone was at the door with what we needed. Let me touch on a few things that some neglect to mention or overlook..Valet and Door service. The guys who work this area at this hotel are AWESOME!!! It was busy all the time but these guys hustled their tails off to make sure people got in and out quickly but did it professionally and with a smile. We arrived back from a day trip but would be leaving again in 30 minutes for dinner so they held our car out front and already had the navigation set for our dinner destination..how cool is that!!! The Doormen did more then just greet you they would carry luggage and offer advice and on many occasions in the morning would offer guests water while they waited for their cars. Room Service totally blew us away, we used it for some dessert late at night and mostly for breakfast but calling them was easy and they were wonderful to speak with and NEVER messed up the order. Food was brought quickly. Let me tell you do not waste your time leaving the Omni for breakfast eat there. The breakfast choices are endless, portions are large and the food is excellent. I hope the staff reads these reviews because they did an excellent job this weekend and I thank them for that. Will be back very soon!!!", "title": "Excellent stay, Excellent service, A Must stay", "user": "texastourist", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168484353}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Our stay could have been a disaster if not for the great service we recieved from both Jonathan and Justin. I was in quite a dilema when,after four different conversations with front desk and reservations, I learned that I did NOT have a two bedroom suite with full kitchen. Website, pictures, google searches, desk staff, all had different descriptions for rooms. Justin was so helpful in finally getting me the correct information as well as upgrading me to compensate for the confusion. Also went out of his way to assure that all rooms were on the same level. Thank you Justin! Jonathan is a true customer service gem! One of the girls luggage was lost and after a full afternoon and night was still told she would not get it until late that evening. After explaining to Jonathan, within an hour the luggage magically appeared! He is a genius! His smiling face and attentiveness at breakfast was amazing! Omni don't let this one go! One complaint was the young lady who served during the happy hour on Club Level....try smiling sometimes it will do wonders and you may even get tips....just saying. Overall, experience was wonderful and I would highly recommend this hotel and if I am in Austin again will stay here!", "title": "Celebration with daughter", "user": "Depp54", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168199933}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Hotel was outstanding in every way. From the moment we checked in we were greeted warmly. The staff is exemplary, warm southern hospitality that extends to guests by every member of their staff. Rommy was a delightful member of the Omni staff that checked us in. She was friendly, knowledgeable and welcoming. She told us about Austin, the nearby areas and things to do to enjoy our first visit to this amazing city. Rommy was kind enough to offer us an upgrade as a long time Omni guests and we were so appreciative. We couldn't get over the genuine and caring attitude towards all guests. The room we had was on the 18th floor with a spectacular atrium view. We couldn't have enjoyed the hotel more. Modern furnishings, understated elegance with a modern vibe. The bed was comfortable and the room was immaculate. We enjoyed the central location to all of the restaurants and nightlife. There is a charming old theater that shows classic films around the corner and is not to be missed. If you are coming for business or pleasure this is your hotel. You will leave feeling valued and impressed. Thank you Rommy, we will return.", "title": "Lovely hotel, perfect location", "user": "welovetravelsf", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167672793}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The Omni is steps away from 6th ave. The rooms are spacious and clean. There's a really neat rooftop pool you can lounge at during the day to grab some sun. The hotel also has a solid fitness center with complimentary headphones and towels. We found that overall the hotel offered great value given it's location. Recommended.", "title": "Good Hotel", "helpfulness": 2, "user": "MichelDrolet", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166932020}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Me, my girlfriend and her mom were in the downtown area for the IKKICON animae convention. We only stayed for one night, but I would love to return when I get the chance! The rooms are beautiful, clean, and luxurious. The view, although not an exterior one, is really cool! The windows face the interior of the hotel. When you look out the window, you have a great view of the lobby, bar and restaurant area instead of the bright, loud downtown roads. The only issue encountered was a drunk group (2 guys 2 girls) that happened to be staying in a room a few doors down across the hall from us. The girls began fighting in the hallway and making quite a bit of noise. Security and APD were VERY quick to respond to the situation. They were already on their way up to the floor when we tried to call. Hotel managers and staff were very apologetic and comped our room for the night. Quite a bit of excitement, but nothing the hotel can control, so no blame there. I do like the hotel's no noise, no tolerance policy to help control things like this. In my opinion, all the hotels in downtown Austin should have this policy, just because of the city. If you're looking for somewhere to party, like the other comments have stated, why bring it to a place where people are trying to sleep?? Go somewhere else! I don't know, that's just common courtesy to me. If I'm ever in the downtown area again and am in need of a place to stay, it'll definately be Omni!", "title": "Great Hotel, Great Service!", "user": "AndyTheFox", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97514820}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Our stay of the Omni was the best part of our fabulous long weekend getway in Austin. My daughter and I went to Austin (our first trip there) to celebrate my birthday and could not have asked for a better place to stay. Everyone there went way beyond to accommodate us. It began when we were put in a room where we could hear music from 6th street way into the night and thus couldn't sleep. At checkin we had specifically requested a quiet room, so at 1:30am I called the front desk to complain and was surpised and delighted to hear a sincere apology and that they would move us right away, or the next day. We opted for the next day and to our surprise again, the OMNI gave us 2 complimentary room service breakfasts to make up for the inconvenience ! They were fabulous in all ways ! I booked directly with the hotel about 2 months prior and got a GREAT deal ... much much less than thru on-line bookings. Maybe I just got lucky with that !", "title": "Best of the Best !", "user": "mrckr1101", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97469281}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The service was beyond excellent... all the staff went above and beyond to assist us at every turn. This hotel is in the perfect location; within walking distance of 6th Street and Congress Avenue, and a nice 2-ish mile walk to shopping at South Congress.. The overall atmosphere of the hotel is relaxing with wonderful employees. I never encountered one employee who was not nice, accommodating and a pleasure to speak with. We enjoyed our trip and would definitely stay here again. Thanks to everyone at the OMNI downtown Austin for a great birthday weekend !!", "title": "Great location", "helpfulness": 1, "user": "Derek_London_Ont", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97461905}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Excellent value – close to downtown and 6th St bars, as well as Capital buildings and Univ. of Texas.", "title": "Quiet! Perfect hotel in downtown Austin!", "user": "Aoqtpi", "date": "February 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 97331243}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "In-out parking $12.00 – be careful driving down the ramp, lots of car paint left on the walls. Become a member of the Omni Select Club (just sign up) and get free wi-fi Internet and free juice and coffee delivered to your room in the morning.", "title": "No privacy in rooms", "user": "ScribblerChicago", "date": "February 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 97031114}], "location": {"country": "United States", "city": "Austin"}, "stars": 4, "variance": {"poor": 64, "average": 103, "very good": 278, "terrible": 42, "excellent": 410}, "aka": "Omni Hotel Austin", "slim_ranking": 0.121546961326, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}