{"user_rating": 4.0, "review_count": 472, "name": "Omni Jacksonville Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed here for one night as part of a relocation move. I just could not let this one pass without posting my comments before they are considered out-of-date. Personally, I was disappointed here. Had I read the reviews, my gut would have told me to stay away. My gut would have been right.", "title": "Below-average Omni", "user": "AmericanRoadGirl", "date": "July 7, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 8072880, "likes": {"liked": "— Valet and Bell staff", "disliked": "— cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I found this Omni on the Omni website. I based my hotel selection and decision to stay in this area on 1) my experience with the Omni coupled with the desire for a full-service hotel, 2) using Jacksonville as a pit-stop on our way out of FL, 3) the pet-friendliness of Omni for this rare traveling-with-pets occasion.", "title": "Nice Hotel for businessmen", "helpfulness": 7, "user": "locallani", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 7854203, "likes": {"liked": "— The staff and the cleanliness", "disliked": "— cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "While I'd long been a big, big fan of Trip Advisor, this trip marked the second time in late '06 where I did not look at the Trip Advisor reviews on a hotel, stayed there, and later heavily regretted it. The first incident involved the Hyatt Regency in downtown Miami in Sept.", "title": "Great stay", "helpfulness": 2, "user": "AKPtraveler", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7729308, "likes": {"liked": "— Location", "disliked": "— A little pricey but worth it"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Trip Advisor and the good people who have taken the time to write reviews here made me a much savvier traveler as far as selecting what turn out to be some real hotel gems - ones that really suit my set of needs and preferences.My travel life is all the better for it. I would be considered pretty picky about cleanliness, especially the further you go up the hotel brand food chain.", "title": "High marks, especially for integrity", "user": "Savvy_Traveler46", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 7725172, "likes": {"liked": "— Friendly, honest staff", "disliked": "— Questionable neighborhood after dark"}}, {"rating": 4.0, "title": "Good choice.", "text": "While there were no problems with check-in or check-out, the front desk left me un-impressed. Relative to other Omni experiences - Omni Champions Gate Orlando front desk rates a 5 (highest) and this Omni would rate, sorry, more like a 1. (further supported below)", "user": "n1cf2", "date": "April 4, 2007", "id": 7282078}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I haven't been to this Omni in a number of years, and was pleasantly surprised by the upgraded look and feel of the property. I was promptly greeted as I pulled up to the hotel, and was immediately helped to the front desk and was on my way to my room within seconds (I belong to their frequent guest program).", "title": "Comfortable, nice, excellent service", "user": "bethrad", "date": "February 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13869654, "likes": {"liked": "— Location (convenient for event I was attending), decor, service", "disliked": "— Downtown location can be a bit isolating (worked for me since my event was downtown)"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "My room was great - loved the muted, rich colors of the room decor. I had a fabulous view of the river - rooms ending with \"33\" face the Main Street Bridge and the Landing and provide a really nice view.", "title": "Absolute comfort at the Omni", "user": "artfam", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12826636, "likes": {"liked": "— The bed", "disliked": "— Computer access"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Everything seemed very current and in great condition, and I felt really comfortable in the room.", "title": "We Had a Nice Stay", "helpfulness": 2, "user": "racer_chick79", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 12636141, "likes": {"liked": "— The bed", "disliked": "— The bed, and the food."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The Bell staff is excellent - I passed them several times throughout my stay and everyone was always friendly and had helpful advice.", "title": "Gator Bowl - Great location; Not-quite-so-great service/staff", "user": "Wahoolio", "date": "January 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 12311848, "likes": {"liked": "— Proximity to the action", "disliked": "— Not-so-great service for the price paid"}}, {"rating": 4.0, "title": "We'll be back", "text": "There is nightly turn down service. I only ordered room service once, and the food was acceptable. I dined in the restaurant and the food was good there.", "helpfulness": 1, "user": "cokosmomma", "date": "October 1, 2007", "id": 10026635}, {"rating": 4.0, "title": "Nice Hotel", "text": "Stayed at Omni for labor day weekend. Its location is near restaurants and bars, parking is not that accessible ( its not connected to the hotel not like the Hyatt), check in is fast and easy. Room is very clean, nice and spacious. We requested for a crib and housekeeping delivered it right away. Its a nice property for a quick getaway or for business travel.", "helpfulness": 1, "user": "mommy77", "date": "September 4, 2007", "id": 8619228}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We live in Jax so this is always a self book. We are Omni Select Guests. We stayed mothers day weekend in May, as well as last weekend. We Have been booking the romantic escape weekend since 1988. It used to be perfect, as it gets more expensive, it gets less perfect. This review is not based on a one time visit. My husband is ill so we sometimes take a pamper us break, this is the best place to do this in our city. Our last two visits, have been less than acceptable for the money.", "title": "More dissappointing with each stay", "helpfulness": 1, "user": "wasntme", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8615522, "likes": {"liked": "— the bed", "disliked": "— having to request and re request expected services"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "I will give you the good stuff first.", "title": "Good Hotel", "user": "DaKine1", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8517576, "likes": {"liked": "— Check-in process", "disliked": "— Only one restuarant and bar"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "1. If you want a great room, you have to book the high floor king corner rooms. We do and pay extra for it every item. We want full class and full service.", "title": "Decent Hotel", "user": "endicott1", "date": "August 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8356384}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "2. Juliettes is wonderful food and always very tastefully pleasing to the eye as well. The service is usually very good. The crab cakes and filet are pretty close to the best in town.", "title": "nice hotel for jacksonville", "helpfulness": 1, "user": "SHFT54", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8184910}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have stayed at the Hyatt downtown before but decided to try the Omni this time. Bad mistake! For a 5 star hotel the room was just dirty. I am guessing that no one had stayed in the room for a least a week because the clock had not been changed for daylight savings time. The bathroom had been partially refurbished but the bathtub was still old and covered with mold. There was a thick layer of dust on the toilet paper holder. Soap scum all inside the shower stall as if it hadn't been cleaned in months. The ottoman had mud all over the top which we easily wiped off with a wet cloth. You could see it as soon as you came in the room so I am not sure why the maid missed it. The desk which had a glass top protecting the wood was covered with some unknown sticky substance and the dresser had spit balls on the side. The window with a nice view of the river was covered with nose and hand prints that were clearly on the inside since we were on the 11th floor. The bed was extremely hard. I really felt like we had been put in a room that had not been visited by housekeeping in some time. However on a positive note, the staff was very friendly and helpful in other matters. The wait staff were extremely friendly. The hotel is directly located across from the Performing Arts Center and Jacksonville Landing which is nice. All the hotels in the downtown area are close in price so I would suggest finding one other than the Omni unless a dirty room doesn't bother you.", "title": "Poor cleaning job on the rooms", "helpfulness": 1, "user": "LCarpenter", "date": "March 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7179962, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "When I read all those rave reviews it got here I am sorry I was not as lucky as the others. I spent in Omni Jacksonville four nights from February 24 while our Sales Summit. While checking out they tried to charge me for the local phones made from my room. But I am sure I did not pick up the phone there and even I was out of the hotel for shopping with four of my friends at the time the phone calls had been made. I complained so they decided not to charge me. Ok, but while I was leaving the hotel I realized that my change wallet is empty. And I am sure it was full, not much only 5 to 10 bucks but I still have bad taste in my mouth. Be careful and watch your belongings. Do not provoke the chambermaid letting your valuables unattended in the room.", "title": "Watch Your Chambermaid", "helpfulness": 1, "user": "JerryKPrague", "date": "March 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 7012308, "likes": {"liked": "— Cuisine", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I stayed here with a group, and when I arrived, they did not have a record of my room reservation. The three people at the front desk had to have a conference about what to do, and finally I suggested they might just re-book me with the group at the group rate ($139). After they figured out how to do that, they booked my room in my male co-worker's name, even though I gave them my driver's license and credit card. Good thing my hubby has a good sense of humor (or doesn't check receipts too carefully!)", "title": "Above average, but not perfect.", "helpfulness": 3, "user": "TallahasseeLassee", "date": "January 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6641436, "likes": {"liked": "— Room decor", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Other than the front desk problems, I had no real issues with the hotel. The rooms are very well designed, clean and peaceful. When I arrived, my television was turned on to a channel with nature scenes and new age music. A little unnerving until I realized it was supposed to make your arrival calm. Bathroom was clean, and had good toiletries. Bedding was new, attractive and very comfortable. The A/C cover in the room itself was not covered by wallpaper and looked out of place. Complimentary wireless internet access was a real plus for me, and workspace was large and comfortable. Didn't take advantage of the minibar or workout room, so I can't comment on that. Coffee maker is in room, and if you are a member of their frequent guest program, complimentary juice and tea can be delivered to your room with your morning paper.", "title": "upscale modern room downtown", "user": "GDL77", "date": "January 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6584531}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Group banquet service breakfast offerings were hot and fresh, and meeting rooms were comfortable. Very convenient to shops and restaurants at the Landing...we had dinner at Mongo's (Mongolian bbq), which was an excellent value.", "title": "Beautiful hotel!", "helpfulness": 1, "user": "Barneslover", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6161902, "likes": {"liked": "— Feels like an upscale hotel, very friendly employees"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I stayed here July 21-22, 2006. The hotel has great amenities like a pool, fitness room, and a business center. The rooms are also nice; very well decorated, and they have a desk, chair, TV, roomy closet, clock radio, and very well stocked bathroom. The room was also very clean. The only problem was the bathtub drain was a bit backed up. There were plenty of towels, a hair dryer, and toiletries. There were also a few nice touches like bags in closet for dry cleaning and shoe shining. Overall, this is a very nice hotel, and it is right across the street from the Jacksonville Landing. The Landing has bars, clubs, shopping, a food court, spectacular views of the water, and live music. Additionally, the staff was highly professional and the bellman was very friendly and knowledgeable. He gave us an outstanding recommendation for breakfast within walking distance of the hotel. My only real complaint was Juliette’s, the hotel restaurant. The food was sub-standard (tasted like reheated Applebee’s) and the drinks were 99% mixer. The service was good, but the food was so disappointing, yet so expensive, it ruined our meal completely. Also, valet parking is $15/day, but you can come and go as many times as you want. Self-parking is $14/day, also with unlimited in and out privileges. Despite Juliette’s, overall, this is a good hotel in downtown Jacksonville.", "title": "Good Hotel in Downtown Jacksonville", "helpfulness": 5, "user": "Lucky777nyc", "date": "July 25, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5511428, "likes": {"liked": "— Clean room with good amenities."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "My corporation booked this hotel for me at my request, as I refused to stay at the standard \"Hilton Garden Inn\" when I knew Omni Hotels were amongst our preferred. What a mistake.", "title": "Are you kidding?", "helpfulness": 3, "user": "pdx2006", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 5494738, "likes": {"liked": "— in downtown Jacksonville", "disliked": "— the rooms/cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "PROS:", "title": "Great Value through Hotwire!", "helpfulness": 6, "user": "jkmarsh", "date": "July 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 5440880}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "-There is a restaurant/bar onsite...but good luck finding any servers.", "title": "Exceeded expectations", "helpfulness": 6, "user": "Mauilovin", "date": "June 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5394678}, {"rating": 5.0, "title": "Wonderful service, great location", "text": "-It's in downtown Jacksonville with shops and restaurants across the street.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 26, 2006", "id": 5391555}], "location": {"country": "United States", "city": "Jacksonville"}, "stars": 4, "variance": {"poor": 33, "average": 68, "very good": 147, "terrible": 16, "excellent": 208}, "aka": "Omni Hotel Jacksonville", "slim_ranking": 0.204545454545, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Omni Jacksonville, a four diamond hotel, centrally located in downtown to leisure and business destinations, including the Jacksonville Landing, an entertainment and dining venue with dozens of restaurants and shops. Luxurious rooms include city and St. John's river views, custom bedding, with various upgrade options. Hotel amenities include a rooftop heated pool and sundeck, well appointed fitness facility, and breakfast, lunch, and dinner dining. Fine regional cuisine and wines are served in Juliette's Bistro which recently underwent a dramatic renovation. Satisfy your appetite with small plates of progressive bistro inspired cuisine and enjoy cocktails or savor a glass of wine in the J Bar, open every night for cocktails and light fare."}