{"user_rating": 4.0, "review_count": 607, "name": "Omni Charlotte Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have stayed at this Omni several times, with the last time being May 11. The hotel staff is wonderful--most friendly and helpful. A water main broke in the downtown area while we were there, and the staff called up to our room to inform us and to keep us informed about the city's progress in fixing it. The staff also provided free bottles of water and bagged snacks down in the lobby to accommodate their guests' inconvenience. (The problem was fixed in a couple of hours, and it was during the afternoon).", "title": "choice location", "user": "r0ckhill", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 130042068}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The hotel rooms are somewhat dated--whereas the lobby area is beautiful. Though the rooms are dated, they are very clean--with nice linens and a small, but clean bathroom. We usually stay on the 14th floor, and the view of the city at night is lovely.", "title": "Great location but needs updating", "helpfulness": 1, "user": "hunterjackson", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 129983059}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We choose to stay here when going to a performance at the Blumenthal. The location is perfect--there is no need to go outside at all if you choose not to. The hotel is connected to an indoor shopping plaza and \"Overstreet Mall\" area. Everything is most convenient. There are a number of upscale restaurants within a couple of blocks. We often eat at a Tuscan Italian restaurant--Aria--which can also be reached without going outside. In bad weather, all of this can be a godsend.", "title": "Dear oh dear...", "helpfulness": 2, "user": "Ctephen", "date": "May 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 129287665}, {"rating": 5.0, "title": "I like this hotel. A lot.", "text": "The room is average, but the staff, the lobby, and the convenience of having the Blumenthal so close impel me to give the hotel a 4 instead of a 3.", "user": "agshark", "date": "April 28, 2012", "id": 128986364}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I'm sure we'll be back here often.", "title": "Great sleep, great staff.", "user": "zzzptm", "date": "April 27, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128943880}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This hotel is nice with a perfect location to access Charlotte. The rooms are nice but getting dated. It needs an upgrade. The staff is wonderful - very helpful without being bothersome except for that darn voice mail message. My one complaint is the voice greeting every day - it adds nothing and it is a REAL bother. I had long days on business in Charlotte, arrived back at the hotel late at night and had to go through multiple steps to delete that blinking light and really unhelpful voice mail - repeating every day that you were there to help me. As business travelers, we know that. After 3 days of late nights trying to delete that message to get rid of that beacon of a light, I had had enough. Tip: become and OMni awards member, the \"already done\" check in system is really wonderful.", "title": "It is getting tired", "user": "Mary N", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 161145346}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed overnight at the Omni for business and was completely impressed with the entire visit. Everyone was extremely friendly and upbeat (from the valet to the front desk)- genuinely- not that fake kind of nice either. Room was clean, quite, and with an updated decor. Beds were those incredibly cosy ones which are difficult to leave and make you want to sleep in. Nice view of the city also. Super location with plenty of great eating options in close walking distance. It is more money than I probably would have liked to spend, but it was completely worth it. Loved the breakfast buffet. My co-worker and I kept saying this was one of the best hotels we have stayed in. Would absolutely recommend the Omni and will stay here again next time in Charlotte!", "title": "Fantastic Stay at the Omni", "user": "Kathleen H", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160997520}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Good location within walking distance of several good restaurants. The staff was very helpful and courteous. However, our room needed a major overhaul. The room had a musty smell; carpeting was torn and stained; furnishings were cheap, worn and outdated; tiles in bath/shower were moldy; draperies didn't close completely.", "title": "Good location but rooms need major overhaul", "user": "funsandiego", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 160941374}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We had the best stay at the omni! This hotel is located right in the center of anything and everything in downtown Charlotte. Our room was big and comfy and clean! The window spanned the entire one side of the room with great views! If I had to pick one negative..it would be that they don't have free wifi. After spending what we did on the room and valet..it would have been nice to have free Internet. But the very best part of the stay was the breakfast. It was not just a typical breakfast buffet. It was the best tasting breakfast buffet that I've ever had. The chef was so kind and so good! You must add on a breakfast if you stay here!", "title": "Excellent", "user": "Mindy G", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160619187}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Omni Charlotte is in the exact center of the city and across the street from the performing arts center as well as several good restaurants. The quality of the hotel is below standard for this chain, however, with solid wood slabs for doors (with some cracking of the surfaces), small bathrooms, and so-so furnishings. For one night on the town (theater, dinner, etc.), it is great, but I would not want to stay longer!", "title": "Best location but not deluxe", "user": "AndrewM_8", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 160612425}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I stayed at the Omni for three nights recently (Apr 19-22), and it was a great experience! The location cannot be beat, the service was fantastic, and everyone at the hotel was friendly. Although our room had a strange layout because fo the shape of the building, it offered windows running the full length of a long wall. Unfortunately, our view was of the bank building right next door. But, the daily morning beverage service was fantastic, and anytime we needed extra towels, the staff was there within five minutes! The only issue we had was the iron that was provided with the room was not working, but again was replaced with just a phone call. The water pressure in the shower was great. The hotel has a breezeway that connects directly to the EpiCenter, which plenty of restaurants, bars, and shops! I was very happy with my stay, and it was worth the price we paid. I will definitely be back during my next visit to Charlotte!", "title": "Excellent Stay", "user": "bjk5692", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128639487}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Hi loved Charlotte the hotel was great right in the middle of things good food shops and resturants handy all under cover. The staff were really helpful and friendly would recommend this hotel", "title": "Good room", "user": "simgapore1", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 128609059}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I stayed at this hotel for one night and used Priceline and received a great rate for the stay. The checkin was quick and easy. The front desk was helpful and friendly and I received the King bed I had in my Omni Guest profile.", "title": "Very enjoyable one night stay", "user": "Billpa", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128552364}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The room was clean and the bed was comfortable. I had a room facing the front courtyard of the Bank of America plaza. The bathroom had plenty of room, the towels were very nice and the shampoo and such were very good, don't remember the brand. I received a call from the Concierge to ask if I needed anything and there was turn down service also.", "title": "Great Location Great Room", "user": "RPatNorthTexas", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128494623}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "The hotel lobby is on the second level and is connected to shopping on the first floor and you can even access the Performing Art Center by going over a bridge over the street. There are plenty of restaurants in the area. I visited on a Sunday so the shopping wasn't available, but a lot of restaurants were open. It is in walking distance to the Convention Center and the Duke Energy Center.", "title": "Would stay here again!", "user": "newb_in_missouri", "date": "April 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127883727}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "It's all about corporate icons in Charlotte, and has little if anything to do with being in the old South. Banks is the life blood of this town, its like the Cayman Islands, with the commercial center being distinct, glitzy and isolated from the locality itself. The Omni is set right there at business ground zero, literally within the Bank of America plaza and fountains. The rooms are standard 4 star corporate fare, but the common areas are unique, polished, upscale, and fun. The lobby opens into a mall atmosphere, with a nice lobby bar, and escalator going down into the shops and restaurants, which border on the B of A plaza. Across the street is the B of A conference center, a block further and you're at the concert and arts center that all the corporate money has built. The Omni staff are remarkable in their service orientation, you, you, you is what they are about. I'm not talking just polite, I'm talking a high level of customer service training and discipline for every staff member you meet from the valets, to the desk, the bartenders, even the maids.", "title": "A Logo Set within the Corporate Icons", "user": "LLFauntleroy", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127780677}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "In the blocks around the hotel, all the executive class chain food icons are well represented, Ruths Chris, McCormick & Schmick's, the Capital Grille, etc. The atmosphere is like experiencing New York through the imitations of it at Las Vegas. They capture the facades nicely.", "title": "Great service, appearance needs updating, but would stay again.", "user": "bgood58", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127023491}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Back to the airport, and its what they call \"rush hour\" with all the commuter flights taking back to New York, Chicago and Atlanta all the business people like me who flew in that morning or the day before. They all want to do business in the town, but not stay overnight, it looks like. If you are going to be overnight, then the Omni is an authentic part of this strange little banking district.", "title": "Not bad", "user": "Cdaae", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126930920}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I cannot say enough good things about the service at this hotel, especially the valet service. These young men were quick, personable and professional, the best I have experienced at a hotel. The hotel staff was likewise, professional and friendly and truly made me feel welcome and appreciative of my stay at the hotel. Everything I asked for when making the reservation was honored when I arrived...high floor, city view, extra towels. My check in process was the fastest I have ever experienced. This hotel is serious about it's customer service. If you are a member of their rewards program, you get free wireless internet and to me that is a big plus. There are no coffee pots in the room, but complimentary beverages are brought to your room each morning at your specified time. To me, that is much more enjoyable and definitely more sanitary than the cups and pots that are never cleaned in other hotels. The one thing I would suggest is to begin a renovation of the appearance of the hotel. Walking down the hall to our room, the doors were badly marked up and dirty looking. It just looked very worn. Our room was very clean, but was beginning to show a lot of wear. The tub had been \"patched\" where the porcelain had worn off and the caulking was beginning to look bad. Even the telephone looked very old and discolored. This is a great hotel in a great area. It is at the Epicenter and there are lots of excellent restaurants within easy walking distance of the hotel. I managed to get what I thought was a great rate, and if I could get that rate, would definitely stay again. but I hope there are plans to make the hotel itself as beautiful as the people who work there.", "title": "Great location", "user": "SCCam94", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126806376}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed here over St. Patrick's Day 2012. This is an older property and it shows. But if you are attending an event at Blumenthal Center the location cannot be beat. We had a fire alarm early in the morning and the safety protocols are excellent- even if there were only 8 of us who made it outside. Fortunately it was a false alarm. I am not sure how the majority of guests managed to ignore the alarm. It was not the nicest hotel nor was it the worst, which is why I rated it average. I was not impressed by the breakfast buffet that was boasted about on the website. Overall, I might try another property in the uptown area before returning to this one.", "title": "Sometimes, a hotel just works", "user": "94Q45T", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126468881}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Booked a \"premier\" room at a reasonable rate and it was very large (albiet layout was a little awkward). Make sure you sign up for free membership rewards program as it gets you free wifi.", "title": "Great service and location. Party-time location.", "user": "BillyMcKay", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 126394446}, {"rating": 3.0, "title": "Lacking for the Price", "text": "Service was fantastic (free cookies for the kids sent up after we checked in, free juice/coffee delivered to your room in the morning, nice rollaway bed was already in the room, express check in even though I hadn't requested it, etc.)", "helpfulness": 1, "user": "travlgirrrrl", "date": "March 15, 2012", "id": 126157930}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Outdoor pool area looked very cool with nice lounge chairs. Gym wasn't anything special. As mentioned frequently, parking spaces in garage is very tight for wide cars/trucks. At least rate of $10 was cheap.", "title": "An older Omni, but still quite decent, with very good service", "user": "Sutter", "date": "March 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125998729}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Location is either a pro or a con. Right across street from EpiCentre. You're right in the middle of all the action. We were there on St. Pat's night and it was party time there (didn't know it was such a big deal in Charlotte). You could hear the thumping music from the outdoor venues, but of course that wasn't the fault of the hotel. If you're a light sleeper, either get a very high floor or look for a hotel farther away from action.", "title": "Decent Hotel for Uptown Stay", "helpfulness": 1, "user": "PearlVision2", "date": "March 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125614565}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "This hotel, while fine location wise, lacks the amenities you might expect from the price. The rooms are clean but not updated. Wifi was not included in the room rate. There was not even a coffee maker in the room which I consider standard. The staff was professional though not affable. For a rather pricey hotel I expected more.", "title": "Good downtown hotel", "user": "LiskoPS", "date": "March 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125554344}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The hotel rooms have an odor that smells like older hotel. Furniture and set-up seems dated.", "title": "A little dated, but staff is very good", "helpfulness": 1, "user": "Tim D", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159858829}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "However, the staff at the hotel and bar make up for this.", "title": "Awesome Night View", "user": "sumwheretropical", "date": "May 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159853145}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "One staff worker at the bar (and maybe the bar manager and rest of the bar staff from I could tell) deserve a special mention - Valerie. She,along with the rest of the bar staff seemed extremely professional. They stayed on top of orders, whom to bill to ( in a curtious way ) and basically covered the busy bar well. The manager seemed to step in easily when needed.", "title": "Great location, clean room, quiet!", "user": "Maysameh", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159739852}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Very nice experience!", "title": "Wonderful Experience", "helpfulness": 1, "user": "Sherrie S", "date": "April 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159194516}, {"rating": 5.0, "title": "Great Experience", "text": "My husband and I stayed at the Charlotte Omni for our anniversary. The room was amazing! It was a corner room on a high level floor that had an great night time view of Charlotte. The room was clean, spacious, and quiet. The bed was extremely comfortable. We will definitely stay again.", "helpfulness": 1, "user": "Hernandoman", "date": "April 26, 2013", "id": 158882156}, {"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "Location good. But nothing else positive to report. Room old and tired, needs overhaul. Not particularly clean or fresh. Pillows actually filthy. Basically an inferior small hotel room for over $300. Highly disappointing. Would not recommend. Or come back.", "title": "Inferior property that is overpriced but well-located", "user": "NomadicNina", "date": "June 11, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 163724282}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We had a conference at this hotel so had little choice about where to stay. As I read the reviews I was a little hesitant about staying here because of some of the comments however I was pleasantly surprised. We stayed in a corner room on the 9th floor and the room was very spacious and had a great view. We would stay here again.", "title": "great location and great hotel", "user": "kalough", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163313067}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The hotel was perfectly located downtown. We could walk to the epicentre in just a few minutes over the walkway that is connected to the hotel. The bar in the hotel was really nice but a little pricey. The hotel has a Walgreens and restaurants in the lower level which is convenient. The staff was friendly as well.", "title": "Great location and wonderful hotel", "user": "Joyful9995", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162913709}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We recently spent 1 night in room 923. It had 2 double beds with a great view from the wall of windows. The hotel staff were all very friendly. hotel had nice amenities and very clean. Our room was clean and seemed in great condition. The bathroom was one of the smallest we have seen in a hotel. You couldnt open or close the door if you were sitting on the toilet and the toilet was right up against the tub. It was very clean though. I did smell syrup on the bedspread on one of the beds, that didn't thrill me too much.", "title": "Nice hotel/room", "user": "deb_nc1971", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 162721744}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We overlooked the Epicentre. We heard a little bass from the music being played at the Epicentre but with the air conditioning going it blocked out a lot of the sound. The noise was very little and didn't prevent us from sleeping.", "title": "Loved it", "user": "Remy_on_the_go", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 162165778}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I stayed at the Omni last month while in town for an appointment. The location of the hotel was awesome. Right across the street (connected by an above street walkway) was an outdoor bar/restaurant area called the EpiCenter. There is a CVS there as well. The hotel itself was nice. The rooms were clean and comfortable. There is an outdoor pool on the 2nd floor with lots of seating and music being piped in.", "title": "Great location, nice hotel, lacked service", "user": "thechandlers", "date": "August 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 73808060}, {"rating": 1.0, "title": "Had confirmed reservations. Arrived. Told they were \"overbooked\"", "text": "My only complaint about this hotel was the lack of service. We had several issues that could have been handled better...", "helpfulness": 1, "user": "Victorianna_11", "date": "August 4, 2010", "id": 73762024}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "1. Upon arriving in our room, we noticed that our toilet would not flush. The front desk sent someone up to look at it. He said we needed wait wait a few minuted before flushes and there was nothing wrong with it. 20 minutes late, it still would not flush. It took 3 times for someone to come look at it, and us asking to be moved, before they moved us to the room next door.", "title": "Major Party Hotel", "user": "discerningdilettante", "date": "July 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 73164083}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "2. The in-room binder said that the hotel provides personal hygiene products that you may have forgotten. I called the front desk and requested some items. I was told they would be sent right up - they never were.", "title": "Free rock concert, whether you want it or not", "user": "Bob734", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 1.0}, "id": 72922301}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "3. Only one of our keys worked. We notified the front desk of the issue. They told us to wait outside our room and a staff member would be right up. It took 30 minutes for them to arrive.", "title": "Short on service and amenities", "user": "jmw245", "date": "July 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71954406}, {"rating": 4.0, "title": "A Pleasant hotel but rooms a little old fashioned", "text": "Thr room was clean and the bed comfortable. The very strange thing was that there were very few power sockets and even the coffee maker had to be used in the bathroom as there was no space not free power point elsewhere.", "user": "voyager_b", "date": "April 16, 2010", "id": 61709848}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Internet was only free to those who join the loyalty programme. This can be done at the Front Desk but it takes time.", "title": "Convenient location, but the beds are uncomfortably hard!", "user": "Mochelly", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 60648166}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The location, in the midst of the CBD is good and only a few hundred yards from the theatre(s).", "title": "Great Service, Excellent Location", "user": "MadisonRentals", "date": "March 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60048787}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I was traveling for work, so the location of the Omni is very convenient and it is centrally located to a wide variety of places to eat. I certainly didn't want to eat at the hotel restaurant as it was way overpriced and very fru-fru for my Southern taste buds! The staff was friendly and very helpful. But, nothing could be done about the uncmfortable beds! I took the down comforter off the top and folded it up so I could lay on top of it in the hopes that it would help me get a better nights sleep -- not so much! The TVs are so outdated...less expensive hotels have the flat panel HD TVs, so surely the Omni could afford to upgrade with what they charge. The gym wasn't so hot either. However, there is a really nice gym across the lobby that you can pay an extra $9 a day to use. I think they're in cahoots with each other on that subject.", "title": "Never Again!", "user": "earlyjulie", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 59914109}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "My wife and I stayed at the Omni on our way to the USVI. The service was fantastic. Everyone was very friendly and accommodating. Rooms were clean & sufficiently large, comfortable bed and nice bathroom. A tip: sign up for the Omni Select Rewards program -- they don't require much personal information and member benefits include free in-room wifi at Omni hotels and complimentary coffee/juice delivered to your door in the morning. Both are nice perks (especially the room-delivered coffee - you specify the time & they just drop it off outside your door with a friendly knock). I expected a modern flat screen given the level of quality throughout the rest of the hotel, but the room was equipped with a perfectly functional (yet clunky) 27\" CRT. Frankly, it was more surprising than anything else. Another tip: The number 5 Sprinter bus from the Charlotte Airport (CLT) will take you directly into downtown and drop you off literally in front of the Omni Hotel in the event that you would like to avoid a car rental. It is a short ride and only makes a few stops on the way. It was perfect for us. The Epicenter Complex is just across the street - lots of restaurants, bars and a CVS drug store there, so that was nice too. Great stay, will stay again when we can.", "title": "Worth every Penny!", "user": "paminpoq", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57350129}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The staff and service at the property coupled with the excellent location make it a great stay. I was there recently on a business trip and unfortunately came down with food poising. Not only did the staff (Blair) go out of their way to get me some necessities from the nearby CVS, there was a message on my phone the next day from a manager checking to see how i was feeling. As I was waiting for my car after checking out, Blair showed up to see how i was doing. The location is great, my only issue with the hotel is the centralized reservations is awful. They have no clue about their properties otherwise A+ for the Omni.", "title": "Fantastic Service, Staff goes above and beyond!", "user": "seeingtheworld1977", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160409619}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed at the Omni Charlotte for four nights last week. I enjoyed it so much that it's difficult to know where to begin!", "title": "A great hotel in a great city.", "user": "mmvoicever", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160399673}, {"rating": 4.0, "title": "Great location, attentive staff", "text": "Check-in was very fast and easy. The rep at the front desk was very informative and professional, answered all of my questions in a polite and efficient manner, and was also kind enough to show me a great jogging route around Charlotte, which allowed me to see a large part of the city up close.", "user": "Diane W", "date": "May 9, 2013", "id": 160164206}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "My room was on the 11th floor. It was quiet and very clean. And a hotel first for me: the mattress was very supportive and comfortable, as opposed to the cushy, spongy marshmallow mattresses usually found in hotel rooms. Additionally, the room featured real incandescent light bulbs, providing much more comfortable light than the curly \"dust collector\" CFL bulbs many hotels use these days.", "title": "Excellent downtown location, average hotel", "user": "msh305", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 160125683}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Service throughout the hotel was great. As part of the Select Guest program, you can have fresh coffee or juice delivered to your room in the morning and it's complimentary. The service at the Trade Bar and restaurant was exceptional, as was the food. Wireless internet service was also complimentary through the Select Guest program.", "title": "Great place to stay", "user": "amosfamily", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160046522}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "First off, all the staff at the hotel were exceptional. They were friendly, extremely helpful, and informative. The rooms were clean and nicely decorated. The TVs were in a big bureau thing, so it doesn't really matter that they weren't flat screen (though the outdated remotes were a little difficult to use--maybe weak batteries?). We loved the orange water that was put out in the lobby and fitness rooms in the morning.", "title": "Great Service, But Can't Recommend", "user": "mahassiddasairy", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 68219446}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The beds, however, in all three of our rooms, were hard as a rock. Nobody in our group got a good night's sleep, and, since that's the main purpose of a hotel, I can't recommend the Omni, despite the wonderful service. Since, judging from the reviews, that seems to be a common complaint, I hope the Omni does something about this in the future. If they're able to correct this problem, I'd recommend them 100%.", "title": "Getting A little tired and worn", "user": "Audrocks", "date": "June 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 67531254}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I've been staying at the Omni for years on business and it's beginning to show it's age.", "title": "Location, location, location!", "user": "klmDallas", "date": "June 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 66177201}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The rooms are very functional for business but I've begun noticing things like broken pieces of the desks, chipped lamps, toilets that run constantly, peeling paint, elevators with broken buttons, etc.", "title": "We enjoyed it!", "user": "ls64497", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66082873}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "And *why* do hotels insist on wasting space on minbars that noone uses. A simple refrigerator would be far more functional and appreciated (an amenenity at a newly-opened high-end hotel less than a block away I recently stayed at)..", "title": "perfect location", "user": "lngwlksnbdwthr", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65325960}, {"rating": 2.0, "title": "NEED MORE EFFICIENT STAFF", "text": "This was my wife's birthday. I specifically requested a high floor away from the elevator. In asking front desk, the employee by the name of Christina, was incredibly unhelpful in trying to find another room either on the same floor, if not higher, that would ultimately be away from the elevator. She said that she would call my cell phone if she had any luck. My wife and I went down to the pool for about 1 hr, and come back to get ready for dinner and house keeping came to our room 3x wanting to clean up the room because they had been notified that we moved to room 709 (we were in room 1116). I didnt have a missed call on my cell or any messages on the hotel room phone. In mentioning this to the hotel manager (Andrew?), he seemed pretty set on having me talk with Christina about the issue (even after I told him she didnt seem like she knew what she was doing). Also, breakfast in the morning was incorrect twice with the french toast. It normally comes stuffed with some sort of flavored cream cheese. I asked if we could have just normal french toast with nothing else...and we got french toast stuffed with plain flavored cream cheese and bacon instead of sausage.", "user": "velasco1983", "date": "July 12, 2010", "id": 70656838}, {"rating": 3.0, "title": "Maybe staff was having a bad weekend", "text": "I would not recommend this hotel to my friends. The staff was overworked and rude this weekend. My room had ants,I was not far from the pool on the 3rd floor maybe the reason for the ants. The location was great, but not good enough for the bad room,the rude service,and the loud music. I would not stay here again..actually I am on facebook,myspace and contacting my local union to continue my complaints.", "user": "praise55", "date": "July 11, 2010", "id": 70542522}, {"rating": 3.0, "title": "Great location, but.......", "text": "I was very excited about getting a wonderful price at a discount site for our vacation scheduled in Aug. My husband and I was so excited that we decided to stay for the 4th of July weekend. Hopefully, when we return in August, we will have a better experience.", "user": "happysmilesallday", "date": "July 8, 2010", "id": 70115854}, {"rating": 3.0, "title": "Great Location Need a renovation", "text": "The hotel is in a wonderful location in downtown Charlotte. Multiple restaurants and attractions are in walking distance. The Epicentre is located across the street and connected to the hotel by a walkway. FYI-If your room faces the Epicentre, expect to hear music early in the morning. There are several clubs that are open late. If that's what you are looking for, then this location is perfect. We arrived at 130 on a saturday and it looked like things were just starting. My children can sleep through anything so this was not a problem for us. Facing this direction was a bonus because we enjoyed the fireworks from our room. We booked a premiere double room which is a larger room but it seems smaller than it is because of the odd shape of the room; but the room follows the shape of the building. It had a small bathroom-large enough for the shower/tub and toilet. The circular pool and exercise room are small especially considering how large the hotel is. I could deal with all of this (especially at a discount) . The problem I had originated from my check in. I was checked in by 2 different people. I was not given a parking pass for self parking and had to go back to the lobby to get it. I am a new loyalty member, but on check in was not given the member information which included a form to fill out to recieve the complementary beverages in the morning (2 per person up to 2 guests). My bill on check out was double the amount because 1 of the persons who check me in placed a hold on my card (correct) but also credited my card (incorrect)! I am now watching my account closely. The front desk manager was very courteous and attempted to amend things but the damage was done. If I could, I would go to another hotel in the area. But, I am hoping for a better stay in August :)", "user": "badschwartau", "date": "July 2, 2010", "id": 69499412}, {"rating": 4.0, "title": "Great location but pricey", "text": "I booked the Omni Hotel through Priceline and paid 85 USD. First time, that Hotel staff mentioned this several times at check in. I asked for a non smoking room and again they told me : you booked through Priceline so you have to take the leftovers. Guess what, I got a smoking room which was so bad, that you can smoke a ham inside. Back to the Check In, I told them, that I can not stay in this room. It took some time and then the Manager showed up, told me again, that I only booked through priceline but at the end I got a non smoking room. The location is great but the Hotel needs a renovation. Fitness Center is a Joke but for 15 USD you can use a real Gym in the same building. If they don´t like Priceline Customer at the Omni in Charlotte then please accept the bids.", "user": "xanthoxylum", "date": "June 24, 2010", "id": 68538762}], "location": {"country": "United States", "city": "Charlotte"}, "stars": 4, "variance": {"poor": 43, "average": 106, "very good": 192, "terrible": 29, "excellent": 237}, "aka": "Omni Hotel Charlotte", "slim_ranking": 0.172619047619, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}