{"user_rating": 4.5, "review_count": 728, "name": "One & Only Palmilla Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "This Palmilla measures up against the finest resorts. Its positives begin by being closer to the Cabo airport than most other high end resorts. It is secluded but completely self contained. If you must leave, the fun old town is a 10 minute ($15) taxi ride away. Cabo San Lucas, for tourist stuff and nightlife, is further away. So, Palmilla is expensive but the gorgeous beach (one part is swimmable), delightful and traditional rooms and villas, excellent bar-restaurants, and spa services make it worth the money. Perhaps what separates Palmilla from other very similar resorts is its staff. There are a ton on duty and they are charming and always helpful. We especially enjoyed the complimentary beach cabanas with constant staff attention. One item that we thought might be a concern turned out not to be. Fancy Cabo resorts tend to attract those who want to be seen and see the famous and those who are there to party hard. On our first day we spotted a few of these candidates, but their behavior never got to a level of concern for us. It really is an impressive resort with a staff that makes you want to return.", "title": "Fab Palmilla", "user": "cabdrinker", "date": "June 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164750562}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I love Cabo and visit quite frequently - but this was our first stay at the One and Only Palmilla. The hotel, the grounds and our suite were all stunning and very well maintained. As for as service - I would have to agree with other reviewers - lacking and at times felt as is the staff were \"slackers\" - NOT really caring about anything. Food is OK but we went to some of the better restaurants in Cabo and enjoyed that much more. We did enjoy the private pool on our balcony and our stunning location right on the beach!", "title": "Stunning Hotel but Lacking in Service", "helpfulness": 1, "user": "FF4ever", "date": "June 20, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164604999}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I spent 5 nights at the Palmilla One & Only last week. We knew the prices going into the reservation - no problem on that expectation. However, as gorgeous as the property was, there were many hiccups in the level of service that surprised us. Nothing that was abhorrent, but just enough missed expectations where the shine wore off unexpectedly fast. Now, compared to the world's \"real\" problems, these missed details are insignificant. :) But when you are paying as much as you do at Palmilla, I would have expected better. A brief summary:", "title": "Was surprised I couldn't give it 5 stars", "helpfulness": 15, "user": "TheBelbuts", "date": "June 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164328065}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Didn't meet our butler for over 4 hours upon check in so we were not offered to be unpacked, or shown around the room so we missed the espresso machine hidden away until our friends told us about it in their room", "title": "Unbelievable!", "user": "RLegacy", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164322189}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Had multiple problems with our safe in the room, and security had to reset it 3 times", "title": "The Perfect Wedding Location and Experience", "helpfulness": 1, "user": "JohnInCalifornia", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164311864}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff's attention to detail is endless and imaginative including: homemade fruit popsicles at check-in, a personal butler, complimentary tequila in your room, customized scents at turndown, complimentary foot massages and eyeglass polishing at the pool, a sewing kit customized to your wardrobe and the list goes on. The grounds are absolutely gorgeous and plush. No need to leave property for dinner as Market and Agua on-site are top notch. I did a lot of research prior to arriving and also talked to a lot of people in Cabo, I'm so glad we stayed at the One&Only vs. some of the other lux properties (e.g. Capella Pedregal, Las Ventanas, Esperanza). While the One&Only might be older, it's still the best. I can't wait to come back!", "title": "Perfection is in the details.", "helpfulness": 1, "user": "MissMMeyer", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168049801}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My husband decided to surprise me for our 33rd wedding anniversary. Monica Ortiz made our stay exceptional. We had a special candy tree in our room to celebrate our anniversary. We had an amazing room, service was second to none and the night of our anniversary we had our own moonlight table at the Aqua Mediterranean restaurant with a menu specifically celebrating our anniversary. The food was magnificent and the view of San Jose and the Sea of Cortez was breath taking. I enjoyed a day at the spa having a very relaxing manicure. Lunch was enjoyed at the Breeze restaurant where a conch shell was sounded when there was a whale to watch breaching. My favorite part of the hotel was the fact that each time we were greeted no matter who the person was, they would put their hand over their heart to greet us. Although our room was a hike from the pools, we did enjoy the private porch we could look over the Sea of Cortez. We said we have to have our last daughter's wedding here!! Can't wait!!", "title": "Best Anniversary Surprise Ever!!", "user": "Shayne U", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167720356}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "First off, I have been lucky enough to stay at some seriously upscale properties around the world and I must say the One and Only is right up there with the best of them! How the entire staff can be so gracious and accomodating is a real treat, usually there are a few gems but here they all seem to be on the same page. The Hotel is not for the feint of wallet, it is pricey - but this is one of the few Hotels that is worth the money! Go there and Enjoy!", "title": "Wow!", "user": "amozz1", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166841500}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "With only a few missteps along the way, this resort is by far the best hotel my husband and I have ever experienced. We have stayed in Fairmont's, Four Season's, Miraval, and many other Fine hotels and resorts in the world. This resort impressed us beyond all others. Was it perfect? No, but those small imperfections (mostly in service) were not enough to taint our view of this lovely property.", "title": "Beauty and the beach", "helpfulness": 1, "user": "Kelli W", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166783386}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "When we first arrived at the airport we easily found the One and Only representative outside the airport. We were then led to the parking lot past two branded One and Only Hummers to a shabby gold suburban. At that point I wondered why the different mode of transport? No one was telling us anything and they just ushered us into the car. Once in the car there was a leather box with amenities, however the driver did not show this to us, I had to find it myself and there was only one warm bottle of water in it. It would have been nice for them to have that stocked and offered water to us. The ride to the resort took about 20 minutes.", "title": "Exceptional Hotel", "helpfulness": 2, "user": "5StarJunkie365", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166637950}, {"rating": 5.0, "title": "Worth the money", "text": "We came here on our honeymoon. Expensive. Yes. But you feel like you are the only guest at the resort. They are there to serve you and they are very professional as many have been working at the resort for a long time. The food was incredible. Absolutely fantastic. Try the Serrano margarita developed by Francisco. Out of this world! We will be saving our money to come back to this slice of paradise. Thank you for making our honeymoon the best!!!", "helpfulness": 1, "user": "Bentlydog", "date": "July 5, 2013", "id": 166428317}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The first thing I noticed when I went to this resort for the first time was all of the attention to detail. The smell was amazing, the staff greets you with their hand on their heart and a little bow (not kidding, every time you pass a hotel staffer). The rooms are gorgeous and decorated just right for the area. I have stayed here twice and both times have book a Jr suite because I love the bathroom, it has an open shower and an amazing free standing bath tub. The butler for your room provides you with a sun kit, a hat and delicious little snacks every night. I am a hotel boutique shopper and their boutique doesn't disappoint. They offer Missoni swimwear, Mara Hoffman sun dresses, Louboutin shoes, Stella, and gorgeous pieces of statement jewelry. The massages at the spa were relaxing and not overly complicated or over sold. I got a pedicure and chose their signature polish color \"Palmilla Red\". Lastly, the lamb tagine and the butter cake at Aqua are worth the trip alone. Don't stay here if you are budget minded, this is not a place to pinch pennies.", "title": "Totally Plush", "helpfulness": 1, "user": "Lynsey H", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165652412}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My wife and I stayed 6/10 - 6/14 for the first time. We loved everything about the resort. Get a room with a pool and your stay will be the best ever! The butlers are very helpful and will unpack your luggage if you ask. The Agua restaurant was our favorite. The resort is very safe and has a manned security gate that all cars have to enter through.", "title": "Best resort in Los Cabos", "helpfulness": 1, "user": "sullymanley", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165481480}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Stay here for a business trips. Kind of has more of a couples/honeymoon type vibe but the accommodations are top notch. Love staying here. The rooms are all detached giving great privacy. Great ocean views right from your balcony. The balcony is huge and allows you to eat or relax out there. Great furnishings, bedding and linens. Doesn't seem to have a great beach but i've yet to see on anywhere in Cabo. I'm there for work so not using the beach anyway. Room service is great. They also have some great restaurants on-site. Love the turndown service and evening appetizer brought to your room nightly. If you have an AMEX Platinum card, book it using the Fine Hotels and Resorts program. You'll get a free room upgrade, early check in, late check out, spa credit and free breakfast each morning. I've even got the 3rd or 4th night free occasionally. I've thought about trying some of the other resorts but the One&Only has given me no reason to. Quite content there.", "title": "As good as it gets", "helpfulness": 1, "user": "Wutzke", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165242171}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "To say that this is an exceptional resort is an understatement! From the moment you enter the property to the day you leave (which you do not want to do), the property, staff, accommodations completely exceed your expectations! Wow... You want to talk about relaxing and unwinding! This is the place! It was our first time at a One and Only and will certainly not be our last, we loved this place!", "title": "Exceeds all expectations!", "user": "Bubbaj44", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165164194}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Let me start off by saying service is Out of this world. It's fantastic to experience such an amazing hotel in my own country. Makes me feel really proud.", "title": "As good as it gets!", "helpfulness": 1, "user": "mrsregino", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 169737653}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "From the moment we arrived, we were greeted by our personal butler, Mauricio. He offered us", "title": "Have You Been Experienced??", "helpfulness": 5, "user": "gemologist_10", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168609191}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "fruit popsicles and led us to our beautiful beachfront suites. 4 glasses of cold milk and cookies along with complimentary caps for our children were waiting. Tequila for us :)", "title": "Amazing Service", "helpfulness": 1, "user": "mbashour", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168321966}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We had the opportunity to rent the hotel's private yacht located at the Marina. Loved it! The captain and Joanna, crew members, are remarkable.. They make you feel at home, we enjoyed a wonderful lunch along with our family.", "title": "Sigh - wish we could have stayed longer!", "user": "mabbett", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168092638}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Spa/Gym is incredible. Wonderful facilities, terrific equipment and the utmost professional staff. Sugey gave me one of the best deep tissue massages I've ever had. Really.", "title": "Incredible!", "helpfulness": 1, "user": "John G", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168076672}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 5, "variance": {"poor": 23, "average": 37, "very good": 67, "terrible": 11, "excellent": 590}, "aka": "One&Only Palmilla Hotel", "slim_ranking": 0.0540540540541, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "A verdant oasis on the tip of the Baja Peninsula. Where azure waters greet the mountainous desert and the Pacific Ocean merges with the Sea of Cortez. Where warm waves break onto a dramatic shoreline… and gray whales can be seen rising majestically in the distance. Here, the gracious style of Old Mexico - with its red-tiled roofs, whitewashed walls, and idyllic setting of exquisite fountains - is quietly nestled amidst swaying palms, bird of paradise and other tropical bloom."}