{"user_rating": 4.5, "review_count": 1081, "name": "Opus Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The best hotel experience I've ever had in my life! There is a reason why this hotel has won many \"Best Of...\" awards from reputable travel magazines.", "title": "Best Hotel I've Ever Experienced!", "helpfulness": 1, "user": "Shehryar S", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124413154}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "My girlfriend and I travelled all the way from San Jose, California to watch our beloved Sharks play the Vancouver Canucks. We happened to stumble upon a Groupon for Opus that gave us $40 in breakfast credit at the hotel restaurant, free-wifi, and a great discount on a fabulous room.", "title": "The professionalism of the staff make this hotel an excellent choice.", "helpfulness": 2, "user": "delighted57", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124410331}, {"rating": 5.0, "title": "This is \"the\" happening place to stay.", "text": "When we walked into our room, we were blown away with how posh it looked. But what really blew us away was the free bottle of wine and snacks that Nicholas, the manager, left for us after he heard about the reason for our trip.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 7, 2012", "id": 124265761}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Amenities are great. The gym is small, but we used it every morning. There is 1 treadmill, 1 elliptical, dumbells, and a multi-purpose machine. What's great is that there is a snack bar area inside with complimentary apples, refridgerated towels, and a water cooler with slices of fresh lemon. There's also a stereo system that lets you hook up your iPod/iPhone to the gym speaker system.", "title": "Perfect...Once Again", "helpfulness": 1, "user": "RobertCampbell", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124253790}, {"rating": 3.0, "title": "Nice Location, but service could be improved", "text": "We stayed for 3 nights at Opus and really didn't want to leave. The location is amazing. It's in Yaletown, right across the street from the train station. There are many great places to eat, including a grocery store that feels like a Whole Foods.", "user": "AlphaBaje", "date": "February 6, 2012", "id": 124215478}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed in the penthouse suite for a valentines celebration. First up it's valet parking not something I really like and it's extra $, The room is ok nothing over the top, modern styling and yes a comfy bed. Internet/ wifi is extra????(even airports are free) Went to the restraurant food and service was good nothing mind blowing. Overall it depends what you want, a place where people try and be trendy and charge over the top prices for the image without a lot of substance (it cost me over $1300) or all the same thing for a lot less.", "title": "Opus Vancouver, no thanks", "helpfulness": 1, "user": "Rangijones", "date": "February 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124714049}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here to be close to the Roundhouse for the First Half-Marathon. Enjoyed being close to the restaurants of Yaletown and walking the seawall of the north side of False Creek. The hotel was a wonderful experience, right from dropping the car at the valet, to the sparkling wine offered at check-in, to a stylish hotel lobby and room. For dinner we thoroughly enjoyed The Flying Pig in Yaletown, 1/2 block away - excellent food and value.", "title": "A great experience!", "user": "LJLtraveller", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124588242}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Great service! Modern and elegant hotel. The lounge night club theme works and doesn't seem tacky. The rooms are stylish, sophisticated and very comfortable. Opus is located in trendy Yaletown and is right near all the hot spots of downtown Vancouver!", "title": "Stylish, sophisticated and comfortable!", "user": "NotJasonFeldman", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124575310}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I've been in 5 Star hotels all over the world and my experience with this hotel is more memorable than any that I've had with Fairmont, Westin, etc The amenities in the room from the IPAD, to the sound system with docking station l'Occitane toiletries, and the most comfortable bed ever. I never sleep well in hotels but I sure did when I stayed here.", "title": "Will definitely go back", "helpfulness": 1, "user": "mike&gina", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124575266}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The service and location also can't be beat.", "title": "Cool, Hip and Sophisticated!", "user": "Vagabond35", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124480686}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Terrific 'boutique' hotel, perfectly located, with excellent service.", "title": "A new favorite hotel", "user": "rsp1", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124873997}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The preloaded iPad was a nice touch. Front desk staff were helpful with suggestions/directions, and the hotel's free car service was much appreciated.", "title": "It's the little things", "user": "Martin W", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124865535}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Prices were very reasonable for services provided. Would not think to stay anywhere else in yvr.", "title": "Great design hotel", "user": "Sbroumand_Nomad", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124771562}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "I had a wonderful 2 night stay at Opus Hotel in Vancouver and would loved to have stayed longer. I am definitely making the Opus my hotel of choice when in Vancouver. From the moment I arrived the staff were very helpful and suggestive. Yet it was the little things that really elevated the stay. The heated bathroom floor was a great start. The complimentary overnight shoeshine service was a help. The bed turned down with a little card noting the next day's expected weather was a nice touch. The business centre on the 2nd floor was quiet and with everything I needed to make the work I had to do flow more easily. A great hotel - worth the stay.", "title": "Great place to stay", "user": "thomasrealtor67", "date": "February 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124765987}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Very enjoyable stay at a central Vancouver hotel. Great rooms and service. Walking distance to everything.", "title": "First time in Vancouver", "helpfulness": 1, "user": "Zamir D", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124734387}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Great vibe, super comfortable room (deluxe king), loved the heated washroom floor. The Hello Kitty pez dispenser left by house-keeping was a very nice touch. The lounge was also very happening both Friday and Saturday nights. Will visit again.", "title": "Beyond expectations.", "helpfulness": 1, "user": "xx23", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124211643}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Only problem was the shades had gaps between them so didn't completely keep the sun out in the morning.", "title": "Love the Opus", "helpfulness": 1, "user": "Pamela D", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124204456}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We have stayed at the Opus hotel twice now. It couldn't be a better location and we've never been treated so well at any hotel- anywhere. Fantastic service. We felt like celebrities. Staff was very attentive. We were given great advice on where to go and what to do. We were driven in the hotel car to destinations and loaned bikes for a fun ride around Stanley Park. We were there on my husband's birthday and when we returned from dinner,the turn down service included birthday cupcakes, a pitcher of water a note and soft music. The rooms are very nice and unique. We couldn't recommend the Opus more.", "title": "A perfect romantic getaway", "helpfulness": 1, "user": "pocketsbuttons", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124180543}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My boyfriend and I just returned from a short weekend stay at the OPUS Hotel Vancouver, and I must say it was the best hotel we have stayed in together. As soon as we arrived, our car was taken with a smile by the valet. We checked in, and despite arriving very early in the morning, we were able to get into our room--a nice extra we hadn't counted on. We walked into the room and were both immediately impressed with all the attention to details--nice music was playing, the decor was tasteful and cool, and we observed the nice design elements throughout, like hidden sockets, a beautiful caraffe, and a little card describing that day's predicted weather. The hotel is obviously run by people with an eye for the small things, a fact that we appreciated.", "title": "vancouver stay", "helpfulness": 1, "user": "brian b", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124078024}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I ran off to a meeting and he took a little nap. As I was leaving, the concierge was very helpful and helped me figure out how to get where I needed to be, and he did it efficiently and clearly--very helpful as I had never been to Vancouver before. When I got back from my meeting, we took advantage of the hotel's free bike rental. We inquired at the desk, were given the option of cruisers or mountain bikes, and within minutes two cruisers appeared on the sidewalk out front. The concierge helped us with our helmets and suggested a couple bike routes. We enjoyed a nice afternoon zipping around town. When we got back the staff were all so friendly, asking us how the ride went, offering advice for planning our evening. They suggested a few nice restaurants and everyone was so warm.", "title": "Fine hotel, but not what I expected for the price", "user": "sisyphusrocks", "date": "February 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123969806}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4, "variance": {"poor": 16, "average": 42, "very good": 182, "terrible": 12, "excellent": 829}, "slim_ranking": 0.0515463917526, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Vancouver's only Four-Star Boutique Hotel as rated by Forbes Travel Guide 2013. Uniquely stylish and always fresh, OPUS Hotel Vancouver redefines the boutique hotel experience, blending contemporary design with warmth and intuitive service. Located in fashionable Yaletown, OPUS Vancouver Hotel is steps from the inner harbor, Canada Line rapid transit, outdoor recreation and Vancouver’s best restaurants, spas and shops. * 2011 Conde Nast Traveler / Gold List Reserve* 2010 Conde Nast Traveler / Readers Choice Awards * 2010 Travel + Leisure / 500 Worlds Best Hotels."}