{"user_rating": 3.0, "review_count": 149, "name": "Orbit Hotel and Hostel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Wow what a place. We arrived and were welcomed with open arms at the reception.", "title": "What a great place", "helpfulness": 3, "user": "tashbash621", "date": "May 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7542035, "likes": {"liked": "— Location & People", "disliked": "— There wasn't anything"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The room which we requested was a private room, very clean and had a balcony which was nice.", "title": "Check In Lady had Attitude Problem", "helpfulness": 3, "user": "canterburygirl", "date": "April 15, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7366010, "likes": {"liked": "— The location and Boogie, the manager", "disliked": "— The check in chick with an attitude problem"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Breakfast was available every morning, which was very conveinient and cheap.", "title": "Great Value, Great Location", "user": "LaMarianina", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6919564, "likes": {"liked": "— Price for the Location", "disliked": "— Noisy Guests"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Laundry room is available dollar 50 for wash and a dollar for a dry.Very useful to us as we'd been travelling across the US.", "title": "Orbit -Reliving the fantastic banana bungalow 10 yrs on", "user": "aussiechick06", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6856476, "likes": {"liked": "— the staff , location and activities on offer", "disliked": "— nil"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Lots of people willing to talk from all different parts of the world.", "title": "this place sucks", "helpfulness": 1, "user": "pip22", "date": "February 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6804713, "likes": {"liked": "— leaving", "disliked": "— the constant lies"}}, {"rating": 2.0, "title": "ok for a hostel", "text": "we stayed at the orbit for 3 nights in June. It certainly is not a hotel or anywhere near that standard. If you are a regular hostel user it will be fine for a short stay. We had a private double room. Overall it was just grubby and a bit smelly. The bed was clean which was the main thing. The shower was not tempting at all as it was so old and smelled of damp but after a 10 hour flight we had to use it. I'm 5ft 8inches and couldn't fit under it. My boyfriend is 6 foot 4 inches and almost had to sit down to get his head under the shower! I was very glad we had our own towels as the ones supplies looked horrible. We were there during the world cup and everyone was happily up early and watched the games in the communal area which was good. Basically just don't expect hotel standards and definitely not what is on the website. It's totally different now, everything is well worn and grubby. The big bonus is the location and the free parking.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 11, 2006", "id": 5452928}, {"rating": 5.0, "title": "best place every....", "text": "this has got to be the best place every to stay it has such a great atmosphere every one that worked there was so friendly and also very helpful...pluss there was always something to do there you could mingle with other people that was staying there (cause everyone is from some where different),they also put on great tours and trips and they also put up great night outs it was cool...def would recommend it and will prob go there on my next trip to california.......c\",)", "user": "A TripAdvisor user", "date": "June 30, 2006", "id": 5412409}, {"rating": 5.0, "title": "A cheap awesome place in LA", "text": "I had such a great stay at the orbit hostel. I stayed there from june 9th until june 15th. The staff is very friendly and helpful. The place is not as new as it appears in the website but it's still very nice. It's a safe place to stay at. I didn't even need to lock up my stuff in the lockers or my window and door at night or even during the day while nobody's in. The bus is right at the corner of the street. It will bring you everywhere you need to go: Hollywood bd, sunset bv, venice beach, santa monica beach, universal studio, Disneyland. Also, the hostel offer you great deal for all these above. It also offer nights in town, comedy night in the hostel. Free bbq on sunday night. There is everything around it. Farmers market is down Fairfax. It's a nice outside mall (forever 21, Apple...) with fast restauration such as Chipotle etc... You can't cook your own food but there is a cooker that prepare breakfast and dinner every day, prices are between $2 and $5 and it's really good for the price. Internet is $1 for 12 minutes. Be carefull, the connexion is reeeeeeally slow. I met many people from all over the world and I really enjoyed my stay there. I know that the day I have to go back to LA, I will stay at the orbit for sure!!! I recommend it to everyone.", "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5394971}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Stayed here from 12th - 17th April. Be careful when getting cabs from the airport - the driver took us a really long way round and it cost way more than it should have. We had a private room with our own bathroom, not bad for £20 each a night. All facilities in room and communal areas were good. As someone has mentioned before, the photos on their website make it look much better than it is. The rooms are accurate (well ours was) but the communal areas look nothing like it, the pictures must have been taken by a really good photographer when everything was new! The whole place was a little bit grimy around the edges, but overall cleanliness was ok.", "title": "Good Value, Average Location", "helpfulness": 2, "user": "Melbo77", "date": "May 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5047434}, {"rating": 4.0, "title": "Can't find better for the place for the price", "text": "Bugie who organises all the trips was great, but some of the other staff that worked there weren't very helpful, they didn't know LA very well. I would definately recommend the LA City Tour, especially if Mike is driving. It was a blast, cheaper than any of the tour companies, takes you places only natives of nearly 40 years would know, like a close up view of the Hollywood sign with an amazing view over the city. We were very lucky and saw Nicholas Cage driving out of his house on the stars homes part of the tour!!!", "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5040249}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We booked two beds here in December having looked at the hostelworld website. Unfortunately the website was full of lies regarding the facilities the hostel had;", "title": "Don't say here!", "helpfulness": 2, "user": "jimmy1231", "date": "February 6, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0}, "id": 6749881}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "There was no free airport shuttle.", "title": "Recommended", "helpfulness": 1, "user": "jeni8686", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6595398}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled with friends", "text": "There was no free Breakfast.", "title": "The best place to stay in LA", "helpfulness": 3, "user": "RobLondon", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6554597}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "The 'full kitchen' is a microwave, thats it.", "title": "Pretty good.", "user": "PM-of-M", "date": "November 17, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6140481}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "we asked the manager about all this and she fobbed us off with some mumbled replies, it was pretty pathetic. The whole place was freezing too, there didn't seem to be any heating in our room. The location was poor too, you can get a much nicer place at venice beach or hollywood. Definately the worst hostel I stayed in in the US.", "title": "Fantastic hostel!", "user": "anonymousreviewer10", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6139011, "likes": {"liked": "— Laid-back atmosphere"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "Let's start with the negative aspects : our room smelled bad, (like humidity/sweat : probably the too old carpet) and I think it was a bit small for 6 people (I've seen rooms this size for 3-4 people in other hostels). A couple had apparently lived there for many days, meaning they spread their belongings all over the room. They also took possesion of the bathroom for half an hour, showering, knowing we were waiting to use it (they told us it'd be \"a quick shower\". Right... There also was a guy from UK that was drunk the first night, but he was OK. Expensive breakfast. Deceiving, knowing that most hostels give it for free.", "title": "Depends on your roomates...", "helpfulness": 2, "user": "Mathieu B", "date": "November 9, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6092888, "likes": {"liked": "— Cheap rate, great location", "disliked": "— Smelly small dorm, unpleasing roommates"}}, {"rating": 5.0, "title": "Sweet As", "text": "Otherwise, it's true that the common room is cool (you can watch soccer/football there with the many guests from UK !) they have nice furniture there. All the common areas are clean and the building is too. Our bathroom was clean enough and large. We didn't take advantage of it, but they offer many interesting excursions. The location on Melrose is perfect to discover the city and if you enjoy shopping there are many stores real close. There are many bus lines around that can take you pretty much everywhere. If you don't know it yet though, expect long bus rides : LA is tough to cover by bus. It can take more than an hour to go to Santa Monica, 45 min to Downtown. Hollywood is close though. The area is safe I think, we walked around at night and it never felt like it was dangerous.", "user": "Punkos", "date": "October 3, 2006", "id": 5902096}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "As I said, maybe with other roomates and a cleaner room, I'd have given a 4/5 instead. Let's not forget it's an hostel, the rates are real cheap for a city like LA. That being said, I'd probably give a try to another place next time.", "title": "Not bad for a hostel", "helpfulness": 1, "user": "AndrewT", "date": "September 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 5829562, "likes": {"liked": "— Cheap and cheerful Hostellry", "disliked": "— That its a way from anywhere - but then it is LA!!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Another thing : even if the guide books praise it as a \"must\", an \"classic vintage restaurant\", avoid Canter's on Fairfax ! We had horrible eggs benedict there. Maybe the smoke meat is better, but don't have breakfast there : probably the worst I had in my life ! An expensive ! You'll probably want to try some cool other places on Melrose, east of the hostel.", "title": "Good, but not great", "helpfulness": 2, "user": "nek0", "date": "September 7, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 5776632, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Barney's beanery is a must to me though ! Some of the best burgers and fries I ever had!", "title": "Very disappointed!", "helpfulness": 1, "user": "Travelbugzrus", "date": "August 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5616976}], "location": {"country": "United States", "city": "Los Angeles"}, "variance": {"poor": 26, "average": 16, "very good": 42, "terrible": 29, "excellent": 36}, "aka": "Orbit Hotel", "slim_ranking": 0.488888888889, "description": "The Orbit is a safe and secure two-story Hotel featuring 32 newly remodeled rooms. Private rooms have a comfortable queen size bed and TV, some having sunny balconies and high ceilings, or a beautiful view of the West Hollywood Hills and Melrose Avenue. Dorms have 6 per room, all with closet space, shelves, their own private baths and showers. They are clean and well-kept. All rooms have a cool, colorful, retro-futuristic design giving the place a swanky Hotel vibe."}