{"user_rating": 5.0, "review_count": 23, "name": "Orchard House Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at Orchard House whilst visiting friends in the area. Situated a few minutes walk from the centre of Ledbury, Orchard House is yet quiet and tranquil, providing a warm, welcoming and relaxing experience. The room was delightfully decorated and furnished - the extra large bed a boon as husband is 6ft 2. The bathroom was great with both a large bath and separate shower. Jane provided a wonderful breakfast which set us up for the whole day. Would certainly choose to stay here again when next in the area.", "title": "Luxurious stay and fantastic breakfast", "user": "TracyERowlandsCastle", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144823523}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were lucky enough to get a last minute booking here last month. Our room was very spacious with everything you need, even an ironing board in the cupboard. Nice touches were in the room,fridge hidden away with bottled water, wine glasses left out should you need them. We even had some moreish home made cake with a cup of tea brought up to our room on arrival. Breakfast was great. Orchard House is ideally placed to the High St where you will find plenty of places to eat & drink. We would certainly recommend staying here & would certainly stay again when next in the area.", "title": "Great place", "user": "Grace G", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143780961}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Found this B&B on tripadvisor and I am so glad:) The room (The Mulberry) was delightful. The bathroom is great. freestanding bath and seperate shower. There was a small soundless fridge incorporated into the fitted furniture which was a great idea and Jane provided two wine glasses into the bargain. The breakfast was excellent and her fried bread was amazing. We stayed a total of four nights. Every day when we came back Jane had left some nice biscuits in a tin for us to enjoy. We would certainly recommend and return ourselves when we are next in that area.", "title": "What a great find", "user": "57linda", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142903617}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This is an excellent B and B, perhaps the best I’ve come across in 40 years. I stayed here with my daughter to attend the Friends of the Dymock Poets autumn conference in October 2012. Jane Churchill put us up in her best bedroom, but at the price we had agreed for her second room. She went the extra mile, replacing the double bed with twins and giving us a lift to the station. Our room was elegant, well-appointed and spacious, with the most luxurious bathroom. Downstairs guests have the run of the garden and a lounge with a piano. Breakfast was delicious, especially the eggs produced by the family’s own hens. The location is ideal – in a tucked-away, quiet cul-de-sac, yet very close to the heart of Ledbury.", "title": "\"excellent\"", "user": "TracyERowlandsCastle", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142263799}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I booked a one night stay as a birthday treat for my hubby. I had tried to get into several Ledbury pubs but they were all full, being that it was bank holiday weekend. Then I found Orchard House on the web just by chance and what a wonderful fluke that turned out to be. The house looked and sounded wonderful on the website but on arrival it surpassed all expectations. The hosts were super friendly, helpful and welcoming on our arrival. The room (Mulberry) was a beautiful large room with a stunning view from the bay window, where you could sit and have your morning tea. I loved everything about the room, from the gorgeous decor, lovely furniture, huge enourmous super comfy bed, lovely welcome tray including home made biccies and fresh milk in the fridge. Oh, and the bath room which was bigger than my bedroom at home. It had a freestanding deep bath(for me) and a separate big shower (for hubby).", "title": "lovely Ledbury visit", "helpfulness": 1, "user": "bowiechoc", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139527032}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I spent four nights at this fantastic bed and breakfast and can't praise it enough. The rooms are beautifully decorated: large, airy and the softest bed I have ever slept in. There are tea and coffee making facilities, a fridge and shortbread (yum). Lots of parking, enormous garden, a heated swimming pool and very friendly owners. Try it you won't be disappointed.", "title": "Perfect!", "user": "JBMorrison", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139078476}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We were very impressed with Orchard House from the moment we arrived. Parking was easy and we were greeted with a warm welcome. The room was stunning and decorated to a high standard .There were tea and coffee making facilities, a fridge and delicious homemade biscuits. The bed was extremely comfortable and, after a sound night’s sleep, we had a beautifully cooked fast which set us up for day walking and a dip in the lovely warm swimming pool.", "title": "LC", "helpfulness": 1, "user": "Linda t", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137772109}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had a very pleasant stay in this super clean, friendly Guesthouse. Mulberry room had lovely large bed, nice linen, beautifully decorated and an enormous spotless bathroom. On arrival we were offered tea and cake, also homemade shortbread in the room along with fresh milk in our fridge. Delicious breakfast with quality ingredients. Very quiet surroundings with good views from bedroom window. Very close to the town and all restaurants. There is a useful info pack about the town and the restaurants which was very good. Can recommend the Sitara curry house which did a really good value meal on Sunday and Monday evenings. All in all a great place to stay to explore the local area.", "title": "Very comfortable stay in the heart of Ledbury", "user": "acbw_8", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155132498}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Was made so welcome here!", "title": "Delightful!", "user": "PaulElyse", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155071258}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed in the Mulberry room which was large and very comfortably and attractively furnished. The bathroom was larger than some rooms I have stayed in!", "title": "Great", "helpfulness": 1, "user": "v1asco", "date": "November 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146435315}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Had a very good night's sleep - the bed is vast and the bedlinen was of a very good quality. The little touches made such a difference. There was a fridge with fresh milk, home made biscuits and even a corkscrew.", "title": "A great find in Ledbury", "user": "247PaTricia247", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145533131}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Breakfast was cooked exactly to my liking - the order was taken the night before and you are asked how you like everything to be cooked. It was perfect!", "title": "A Little Gem in Ledbury!", "helpfulness": 1, "user": "Dai Dawson", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145402002}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 21}, "aka": "Orchard House Bed And Breakfast Ledbury, England", "slim_ranking": 0.117647058824, "description": "Orchard House is a charming Victorian property, set in an acre of walled garden with swimming pool. In a tranquil location just a few minutes walk from the historic market town of Ledbury, we are an ideal base for exploring the beautiful countryside and historic towns and villages of Herefordshire,the Malvern Hills, the neighbouring counties of Worcestershire and Gloucestershire, the Wye Valley and the southern Welsh Marches. Locally sourced breakfast, homemade bread and preserves."}