{"user_rating": 4.5, "review_count": 958, "name": "Orchard Garden Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Rooms are bigger than I would expect in SF, very convenient location. They don't have their own parking but you have a choice of their valet parking or (a much cheaper) public garage around the corner (i was surprised though the hotel does not offer any kind of discount deal with the public parking). The property has everything you would expect from a new hotel - very clean and nice rooms. Nice French bistro across the street and Chinatown gates around the corner, ideal location for a sight-seeing trip.", "title": "Convenient location with nice rooms", "user": "Mfyodor", "date": "January 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 93146797}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "This newer hotel is as good as it gets, One of the Best Value Hotels in SFO. We loved the location, walking distance to Chinatown, Union Square, cable Cars, most attractions. The rooms are small but very clean and the most comfortable beds with wonderful European comforters. The small bar in the lobby is probably the most friendly in the city. A great find!", "title": "Best Location & Facility", "user": "ShelbyTwp", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92725161}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "And GREEN friendly.", "title": "Great hotel/location", "user": "tojopop", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91629244}, {"rating": 5.0, "title": "Our SF Hotel of Choice", "text": "We got trapped by the East Cost blizzard and needed to hunker down for 2 days in San Francisco. We have stayed at The Orchard Hotel several times before but they were sold out. We were lucky enough to get a junior suite at this sister property and we were delighted with the hotel. The location is great-literally at the gates of wonderful and must see Chinatown. Our room was comfy and the bed was terrific. Big bathroom with free standing glass shower and tub. The staff were lovely and you are surrounded by great restaurants and wonderful shopping on Union Square. Not only did they take us in, but they were gracious enough to allow an early check in as our flight was cancelled at 9 a.m.", "user": "lddaw", "date": "January 1, 2011", "id": 91328435}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "It was a rainy and cold day and we were so happy to check in and re-think our holiday plans. Hats off to this wonderful hotel and it's kind and generous staff. We will be back.", "title": "Great location, service and apple pie too", "user": "MsAmmann", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 91313892}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Our stay at the Orchard Garden was very pleasant. We had stayed there before (see Nov 6, 2007 review) and the management messed up our reservation by not giving us the free breakfast that was included in our package. We wrote the manager and never received a reply. We mentioned this to the front desk when we checked in this March and they immediately gave us a room upgrade and two free glasses of wine with an apology. I said before that the hotel was very clean and in a great location and that we would stay again. We did and were very satisfied with the staff. We will definitely stay again. The location is great - close to Union Square. Cafe de la Presse is across the street, good for breakfast or dinner. Chinatown is around the corner. Ask for an inside room, no view but quiet. The roof top garden is a nice spot for a late afternoon drink.", "title": "'Green' hotel in great location...", "user": "Butcher.T", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27099250}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The hotel representative checking us in was so nice, and he upgraded us from an interior room to one with a view. Comfy beds, flat panel tv, nice scented toiletries: overall a really pleasant stay. The hotel is 4-5 blocks from Union Square (closer the financial district, which is much better than being closer to the Tenderloin) and about a 10-15 minute walk to the Montgomery BART station. We got a great advanced purchase deal through the hotel's website ($120/night). Overall, a pleasant stay.", "title": "Good vibe from the hotel staff and a comfortable stay.", "user": "CaliOhioMass", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26501184}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed at The Orchard Garden Hotel for two nights, I wish our stay was longer. This hotel is beautiful, very clean and the staff is very friendly. I would definitely stay here again, I don't even think I would look anywhere else!", "title": "Excellent Hotel...", "user": "momsweekend", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26475803}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We were there for the weekend visiting our daughter, and it was a great time. The location for walking to restaurants and sights was perfect, and the rooftop deck was perfect for visiting with our daughter and her friends. We had the suite room since the price was right, and it was large, spacious and the bed was insanely comfortable. I can't say enough good things about our stay, and we felt good knowing it was all \"green\".", "title": "Loved the outdoor deck, rooms and location", "user": "kshanfield", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26153948}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The room lived up to its name. The decor and space was fine. I requested an upgrade to an exterior room and it was great. No noise came into the room to disturb me. I have stayed in this area before and the Orchard Garden will be my choice again.", "title": "Great Location/serene surroundings", "user": "akusah", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26152968}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Belatedly reviewing this hotel after staying here in early June 2008 for 4 nights. Got a terrific rate through Expedia and after reading other reviews decided to give it a go.", "title": "Great hotel in fantastic location", "user": "eckythump", "date": "February 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24712304}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Fantastic central location right next to Chinatown entrance, with a short walk to the main shopping area/Union Square district. We walked to the Fisherman's Wharf area which took around half an hour.", "title": "Beautiful, quiet, convenient...", "user": "nkelley", "date": "February 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24692952}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "The room was great, we did not have much of a view (overlooked a back alley) but was not bothered by that, and it was nice and quiet throughout. King size bed was extremely comfortable, bathroom a decent size, nice flat screen tv with HD channels, and a small couch area. First time i had seen a separate recycling bin for papers/plastics etc. which is a great idea and should be used by other hotels.", "title": "Wonderful overall", "user": "Indy_V", "date": "February 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24647757, "likes": {"liked": "— Friendly staff", "disliked": "— Nothing - everything was great"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Didn't like the fridge, there was no room to store purchased items, and it was one of those weight sensor deals so you couldn't take items out without you getting charged for them. I firmly believe hotels should give its guests the option of at least storing a few items purchased outside of the hotel in a fridge. Our fridge was locked for some reason and because of that we didn't even bother asking to get it unlocked (it had a glass front door so you could see inside).", "title": "A fantastic boutique hotel", "user": "ddetravel", "date": "February 10, 2009", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24439380, "likes": {"liked": "— the bed and the size of the room", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Didn't eat breakfast in the hotel, but there are plenty of great choices in the nearby area anyway.", "title": "Nice Place to Stay", "helpfulness": 1, "user": "KP&TP", "date": "February 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 24409559}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Great hotel and good price and location. Loved the modern decor and the beds were great. Not a single complaint about the hotel.", "title": "Perfect Hotel", "helpfulness": 1, "user": "keepinitreal9874", "date": "April 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14782515, "likes": {"liked": "— decor", "disliked": "— lack of parking (only valet)"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "There are good restaurants nearby, Union square is not far, and there is public transportation within walking distance. Would definitely recommend.", "title": "Green credentials", "user": "USAophile", "date": "April 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 14724928, "likes": {"liked": "— The staff", "disliked": "— Room was very small"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This is a new hotel that claims a range of green features, some of which seemed to be stretching the point somewhat. However it was a pleasant stay with particularly firendly and helpful staff. Minus points were the size of the bedroom (small); a sliding door on the bathroom that didn't have any pretence at privacy; high bar prices ($14 for a glass of wine) and exorbitant parking charges ($37 per day) when there were public facilities on the same block (for $24 a day.)", "title": "Very good hotel", "helpfulness": 1, "user": "a08052013", "date": "April 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14718980}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Overall, good but not exceptional enough to make me want to go back. Darrin, the bar steward would make me want to go back though, just for the entertainment value. He was a scream!", "title": "\"Great Stay\"", "helpfulness": 1, "user": "keepinitreal9874", "date": "April 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14706129, "likes": {"liked": "— decor", "disliked": "— lack of parking (only valet)"}}, {"rating": 4.0, "title": "Love this hotel", "text": "Quite green. For example room key card put near door inside room turns on and off the electrial equipment in the room, automatic turn down of thermostat upon leaving the room. Comfortable beds, high-quality towels and bedding, good well-located, good European breakfast was included for us, generally very efficient and warm service.", "user": "Kristina G", "date": "March 27, 2008", "id": 14588887}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Referred to this hotel by a business colleague. The rates were great for the location, so I booked it. I was incredibly impressed with the cleanliness of the hotel and all of the convienences offered. Will definately stay there again on my next trip.", "title": "Excellent Value", "helpfulness": 1, "user": "beachgirl3700", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14246679, "likes": {"liked": "— The cleanliness and comfort"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "If you're a business person looking for a hotel either for a short or long stay, then you must check out the Orchard Garden Hotel. I came to San Francisco for a work conference for a few days and enjoyed my stay at this hotel. The rooms are spacious, beds are so comfortable, very clean hotel/room and the staff are very helpful!! The location is great too - right near the entry gate of Chinatown, a short work to Union Square and cable cars. It's also a small cab fare to anywhere. Would definitely stay here again if I’m back in town!", "title": "Loved our stay at the Orchard Garden", "helpfulness": 2, "user": "meli55a", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 14168382, "likes": {"liked": "— Comfortable room and bed", "disliked": "— Nothing :)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "What a treat to have stayed at the Orchard Garden Hotel. I had to pick a hotel with my business picking up the tab and I'm quite pleased I chose this hotel! Upon arrival, we were promptly greeted and our bags stowed since our room was yet to be ready. We got back in our car and when we returned several hours later our room was waiting and they remembered us so they handed us the keys and bags w/o even asking us again. Valet service was exceptional! Never had to wait long for our car, nor worry about the rental car being parked. It was worth the $37 for 24 hours! We went back and forth quite a lot and no complaints from the staff.", "title": "Fabulous Stay!", "helpfulness": 1, "user": "EastCoastJaneDoe08", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13761744, "likes": {"liked": "— Location", "disliked": "— Internet Service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The room was comfortable and the bed was AMAZING! The bathroom was nice accomodated with nice ammenities. I don't know if what was provided were Aveda products, but nonetheless they were fine. Great bathrobes, and plenty of shower space. We checked out a DVD from the front desk (small selection but something for everyone) and also used the iPod clock to listen to tunes. The room was always cleaned and enough towels were provided. We were quite pleased with the cleaning staff! We also liked that the hotel recycled all our bottles and newspapers.", "title": "Right next to the Entrance to Chinatown", "helpfulness": 1, "user": "freesias", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13757782, "likes": {"liked": "— Clean, quiet rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Location was excellent. Short walk to BART, restaurants (Starbucks, Subway, and a lil' coffee shop across the street with the BEST hot chocolate!). The front desk was quick to show us the most cost effective route to the wharf, restaurants, etc. We never got lost and I commend the front desk for giving us directions.", "title": "Nicest Boutique Hotel in San Francisco", "helpfulness": 3, "user": "fieldvision", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13665047, "likes": {"liked": "— Felt like a 5 star hotel at 2 star prices", "disliked": "— would like the room service kitchen to have longer hours"}}, {"rating": 5.0, "title": "Great experience, staff, and room!", "text": "We had a wonderful stay at the Orchard Garden Hotel. The rooms were tastefully decorated and spacious. The front desk staff was very helpful and friendly. They provided great restaurant suggestions and travel directions. We also enjoyed the roof top terrace for its views of the city.", "user": "travelisfun2", "date": "March 26, 2008", "id": 14554978}, {"rating": 1.0, "title": "beware", "text": "This hotel is much more energy conscious than other hotels we have stayed at. They take care of their property and the impact that they have on the environment. They offer recycling in the rooms and have energy efficient technology to regulate how much electricity you are using in your room. It may not be 100% organic and green in every single aspect but it came pretty close. Upon speaking to the staff about the hotel, it is apparent that there is great effort taken to be sustainable. It is way ahead of most hotels and it is a LEED building.", "user": "genie-miami", "date": "March 24, 2008", "id": 14500737}, {"rating": 5.0, "stay_parameters": "Stayed March 2009", "text": "So nice to check in early after flying from DC! The cleanest bathroom I have ever seen.Quiet and comfy. Great location. Plenty of fun,sites,history,food and shopping w/in easy walking.", "title": "Nice!", "helpfulness": 1, "user": "dimondsDc", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26131874}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I just returned from a weekend in SF. I booked the hotel from their website which was a great value. Used some of the tips I had seen here about riding BART, and no hotel breakfast, good advice, as we were trying to have a weekend away that was not expensive. We had a very relaxing weekend. The rooms are great, beds very comfortable. We stayed on the inside and still had some street noise (says my hubby, the light sleeper) I heard no noises, so you need to judge based on your normal tolerance for noise. You are in the middle of a city for heavens sake! It was very easy to get around with public transportation, we also walked alot. The staff, including front desk, were very good to us. Don't miss the roof garden. Very nice place to sip a glass of wine, and view the city lights. Only drawback....I discovered the shopping area that is very close...and now want a trip with the girls. (not on the cheap! :)", "title": "this was a great value, and wonderful get-away for a weekend", "user": "ubermeme", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26037045}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Hotel itself is new & modern, I like the energy efficiency of it with the card key turning on the power, and the in-room recycling bins. Free wi-fi internet is excellent. Bathroom is roomy and enjoy the toiletries. The bed is extremely comfortable. Love the bath robes & slippers. Rooms facing the street will hear street noise so if you are a light sleeper like I am, don't choose street view. We were on 7th floor and can hear street traffic all day & all night even with double pane windows. If you like a decent size room, make sure you book superior room size and up. Breakfast: don't eat at the hotel, and try places like Lori's diner near Sutter & Powell. The bell person, valet & security were all friendly & helpful. However, beware of front desk staff. We requested room change due to street noise & were downgraded to a standard room facing the back (we booked superior room)! After much arguing on the phone with the front desk guy and being told that \"your reservation was a standard room\", \"all rooms facing interior were standard room\" & getting real upset, he finally said \"I will have to speak with the reservation department\", we were eventually upgraded to a junior suite. On the day of checkout, we requested to check out 30 min late, and were denied by the girl at front desk, citing \"too many other guests want to check out late\". My husband and I travel a lot and were never denied late check out before. Basically what the front desk staff put us through made the stay at this hotel unpleasant. The front desk staff is unprofessional and needs more training on customer service and better people skills.", "title": "Clean & modern, overall staff friendly but beware of front desk staff....", "user": "HappyGoLucky076", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 25977102}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "To cut it short, I'd better say what we disliked about this hotel:", "title": "a pleasant surprise!", "helpfulness": 1, "user": "Mista-go", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25261848}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "1) the view from our window was on a courtyard instead of on the streets of san francisco. But I guess it was only misfortune.... ;P", "title": "Like this hotel, but...", "user": "ontheway2", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 24879318}, {"rating": 4.0, "title": "Great location, clean and comfortable", "text": "A great little hotel situated right in the middle of everywhere you need to be! Very clean and comfortable and staff welcoming and friendly..........one word of caution is to avoid Sam's Grill restaurant which is just down the road - we were forced to leave an 18% tip by a very aggressive and demanding waiter - not a nice experience!", "helpfulness": 1, "user": "dunners8021", "date": "February 13, 2011", "id": 96483961}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I really enjoyed staying at the Orchard Garden hotel - the location is fantastic - situated next to Nob Hill and China Town - it's a lovely 15-20 minute walk to Fisherman's Wharf. The room was pretty basic but clean and a decent size. The staff was freindly. Breakfast was not included. Cafe le Presse is across the street - great breakfast there.", "title": "Great Location", "user": "MadelineNewYorkCity", "date": "February 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 96268201}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We had never travelled to San Francisco before, and we were looking for a place to stay that was fairly central. Based on the other reviews, and the cost, we picked the Orchard Garden Hotel, and we were very happy with our choice.", "title": "Great Boutique Hotel!", "helpfulness": 1, "user": "CalgaryTraills", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95222297}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "First: Location. It was only about a 10 minute walk from the BART, albeit a tad uphill. It is also literally steps from the entrance to Chinatown, (not even half a block away). Only a few blocks from Union Square, and like i said about a 10 minute walk from the BART. Streetcars and buses are nearby as well.", "title": "A great find with great rates & the greatest staff!", "user": "kttravelgal", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95084724}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Second: The hotel itself. This one is a great find. The attached restaurant is wonderful, we had a great breakfast there one day. The rooftop patio is a must if you want to get a good view of the surrounding area.", "title": "Very nice hotel ... wonderful, courteous staff ... convenient", "helpfulness": 1, "user": "Unbiased&FairAdvisor", "date": "January 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93978727}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We've stayed here half a dozen times. Well run, good value, great location", "title": "Well run, good location", "helpfulness": 1, "user": "VirginiaHouse", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105694773}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed for 4 nights in this beautiful hotel downtown San Francisco. The room was very good furnished and the king bed was superb. The adjacent room was not occupied for 3 nights. The last night one single man stayed there and we could hear him talk to some guy on his mobile phone. We can imagine that more noisy people can disturb rest at night. The breakfast was OK but not stunning. We had breakfast for 2 times on the opposite of the street in the French Restaurant. Very busy on tiny marble tables but a great breakfast. The same applies for diner. The Orchard Garden Hotel offers a high quality diner, but the menu is very limited, so again to Cafe De La Presse with a great choice.", "title": "No sirens, no street noise, pfffff ...... YES!", "helpfulness": 1, "user": "Alessandro1945", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 104865442}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "The hotel staff is more than helpful in every way. The hotel is very clean. We payed approx. $ 800 for 4 nights (excl. breakfast)", "title": "Friendly staff at a nice hotel near Chinatown", "user": "cr1ms0n", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103969539}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The hotel staff always greeted me when I walked by the lobby, and were overall very friendly. I had a delicious meal in the hotel restaurant, Roots, my first night. The bed was comfy and the room very nicely appointed. My corner room on the top (10th) floor faced two alleys and was very quiet.", "title": "boutique hotel in good location", "helpfulness": 1, "user": "marPortland_Oregon", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103071074}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "this clean, newer hotel near the gates of china town and across the street from a great french cafe is a good place to stay if you want to be near to northern san fran and want to be a bit away from the fray of all the big shopping spots. the staff is helpful, the beds are comfortable, and totally worth the price which is very decent for san francisco. I have been there in february with my family and returned in march with a friend and was satisfied both times.", "title": "Clean and green", "user": "seapeace", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102241141}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We stayed at the Orchard Garden Hotel for 7 nights in December 2008 when in San Francisco on both business & pleasure. We could not have asked for a better location - the area is safe and quiet, and is centrally located within walking distance of the Piers, Union Square, and many other tourist and business sections of town. It is also very close to several different cable car lines, which makes getting around the city easy and quick. The hotel room itself was amazing - the most comfortable beds we've ever slept in! (and we've been in a lot of hotels in the US and abroad). The sheets and comforters made it feel like we were curling up in a cloud every night, which was very nice after long days of meetings and/or sightseeing. The room looked out onto the street with a great view but was still very quiet, and we never heard people in the neighboring rooms, so sleeping was easy. The hotel is \"green\" and has wonderful environmentally-themed decor and stylish recycling receptacles in the room, which we greatly appreciated. The flat-screen TV was awesome, as was the DVD player in the room and free DVDs available at the front desk - we recommend \"Escape from Alcatraz.\" Front-desk staff was friendly, and the hotel was very willing to accomodate several of our special requests. There's also a roof-top terrace with a wonderful view. I will definitely stay here again when I return to SF and I highly recommend this hotel!", "title": "Fantastic Location, Rooms, & Value", "helpfulness": 1, "user": "llamahoof", "date": "February 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24379042}, {"rating": 4.0, "stay_parameters": "Stayed January 2009", "text": "Just stayed here last wk and had a good experience. Perhaps the front desk has improved because of TA complaints but we had excellent, prompt customer service.", "title": "Pleasant", "user": "anonj", "date": "February 3, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 24185126, "likes": {"liked": "— location and attractive decor", "disliked": "— twice daily service was great but morning mister maid could be better"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Front desk guys were friendly and helpful. They also rushed to assist us in hailing cabs, carrying luggage etc.", "title": "This hotel is a gem!", "user": "AllisonAustin_TX", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23804682, "likes": {"liked": "— Emphasis on quality of product", "disliked": "— I had a great room - I know some of them are small"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We were also pleased to not see hardly an homeless people and so were not badgered or made to feel unsafe during our five night stay. According to many reviews of other SF hotels this is a chronic problem. So we're not sure what to attribute it to- apparently the mayor is asking people not to give the homeless handouts so that they will avail themselves of existing services or perhaps the hotel's location was better- between Chinatown and Union Square.", "title": "Good without the extras", "helpfulness": 3, "user": "Lali2000", "date": "January 20, 2009", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 5.0}, "id": 23733137, "likes": {"liked": "— Brand new facilities", "disliked": "— Mattress; pillows and the costumer service"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Someone else complained about the mattresses being uncomfortable- we thought they were quite comfy- kind of a firm foam rather than box springs but not too firm. Linens were excellent quality- seemed to be all cotton with high thread count. Climate control was good and the room could be made cool enough at night to enjoy the down duvets.", "title": "Nice Hotel, Great rooms unprofessional staff in front desk", "user": "maclers", "date": "January 4, 2009", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 5.0}, "id": 23265768, "likes": {"liked": "— The Rooms", "disliked": "— Staff at the Front Desk"}}, {"rating": 5.0, "title": "Great Location and Clean Hotel", "text": "One of the best and most clean hotels I have ever stayed in. The hotel staff was very knowledgeable and friendly. The location was good, just next to the Chinatown gates. The hotel room was a bit small but managed to enjoy it. The bathroom was so clean and by far the best hotel bathroom I have ever seen. The business center was a nice touch and the fitness room was really small. The doorman was always willing to grab a cab for you with the help of his whistle. There was also fresh fruit out on the front desk so it was nice to walk by and grab something on the go. A local pizza place up two blocks Uncle Vitos was a nice place to enjoy some pizza. Another nice place to eat was called the Stinking Rose. Great food for a good price.", "user": "hlc319", "date": "March 24, 2008", "id": 14482813}, {"rating": 3.0, "title": "Great location", "text": "Location is great, right on the edge of Chinatown with Union Square and Columbus Avenue both within easy walking distance. We didn't try the food always went out - plenty of restaurants (breakfast cafes) within easy walking distance. Rooms are small but well equipped - the bathroom was as big as the bedroom.", "user": "BarryMoses", "date": "March 21, 2008", "id": 14431161}, {"rating": 5.0, "title": "Great Hotel, Great Location", "text": "We just returned form a business trip and stayed at the Orchard Garden Hotel. It was very clean, quiet and had a very comfortable bed. The staff were all very friendly and helpful with dinner reservations. It's a 10 minute walk to the Convention Center and only a few minutes to Union Square. Lots of shopping and restaurants nearby. The only negative is the water pressure. Because it is a \"green\" hotel, it was very low. Not sure you actually save much water when it takes 5 minutes to get the shampoo out of your hair! Also, the \"fitness room\" is a treadmill, a bike and an eliptical machine. However, we got plenty of exercise walking everywhere. Both of these were minor issues for us. We will stay here again!", "user": "joey61", "date": "March 12, 2008", "id": 14246400}, {"rating": 4.0, "title": "Wonderful Stay in the City, with minor suggestions", "text": "The Orchard Garden is terrific hotel in a fantastic location. Walking distance to the top of Nob Hill, while also an easy walk to the Ferry Building. Nice people, excellent service. Very comfortable beds and quiet, spacious room. Reasonable price under $200 over the weekend, too. I didn't visit the restaurant, nor use the fitness equipment. Spent time in the city instead. I would only recommend one thing: the rooftop terrace could benefit from some improvement. In my opinion, if you do a rooftop space, it should make guests feel comfortable and be an oasis within the city. See Hotel Vitale in SF or Hotel Giraffe in NY. Great rooftops. When we visited the Orchard Garden's rooftop at night, the lighting didn't work. It also didn't have much landscaping and wasn't very inviting overall. It didn't even really fit with the the atmosphere for the rest of the hotel. But, I really like this hotel overall and it will get my first call for my next visit. Everything else was great and price and location are hard to beat.", "user": "David063", "date": "April 16, 2008", "id": 15092397}, {"rating": 5.0, "title": "Great HQ for SF visit", "text": "Stayed 4 nights with partner for mixture of business and leisure.", "user": "steve_randomno", "date": "April 14, 2008", "id": 15018605}, {"rating": 5.0, "title": "Loved the Orchard Garden", "text": "Main things we liked were:", "user": "sparks5311", "date": "April 13, 2008", "id": 15007107}, {"rating": 5.0, "title": "Comfortable hotel with a great location", "text": "-decor - this hotel is brand new, the building the decor, everything", "user": "traveller33Ireland", "date": "April 8, 2008", "id": 14899066}, {"rating": 5.0, "title": "Charming and Peaceful", "text": "-room - plasma TV, great marble style bathroom, eficient and quiet aircon, light and airy room", "user": "norcal-roadtripper", "date": "April 8, 2008", "id": 14898897}, {"rating": 4.0, "title": "Perfect \"Home Base\" for Exploring San Francisco", "text": "My husband and I stayed at this hotel for our first trip to San Francisco and thought it was a great location for exploring the city. Only steps from the Chinatown gate and such a good value! Although the room was on the small side, it was well appointed and had everything we needed. (And besides, we came to San Francisco to see the sights and not sit in our room!) We also took advantage of the roof top patio one night and enjoyed being able to bring our own bottle of wine to sit and relax our tired feet.", "user": "A TripAdvisor user", "date": "March 22, 2011", "id": 101167478}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We picked this hotel based on Trip Advisor and we were not disappointed. The hotel lobby and rooms are very nice. Felt like a 4 star hotel. The rooms themselves are a little small, but then again consider the city where you are staying (they are still bigger than European rooms). Staff was very friendly. BART drops you off 4 blocks from the hotel, so no need to take a shuttle or taxi from the airport. We love to walk and saw the following by foot: Golden Gate Bridge Park, Coit Tower, Pier 39, Artistic Garden, Chinatown (1 block away), Lombard street and many more sites. I would highly recommend it. The only thing I would point out, and this is not a reflection on the hotel, is that we had our credit card number stolen I am guessing while eating out/shopping in Chinatown. I would suggest you pay in cash. The only thing we felt would have made it better is for a complimentary continental breakfast.", "title": "Nice hotel with central location", "user": "gregw72", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101147886}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "All and all we had an enjoyable stay at this hotel. Location is great as it is close to shopping and restaurants and is in the walkable area of SF. Easy walk to Union Sq. and Ferry Building. Staff was quite friendly and helpful (restaurant suggestions) although they forgot our wakeup call (set your own alarm !). The rooms are not large however the three of us managed quite well over our 4 night stay (2 dbls). The only negative was the food given that the hotel promotes their own restaurant. We were disappointed with our meals, in particular the room service food we had one evening, therefore ask for alternative suggestions. There was a fitness \"room\", very small though. Would we stay here again ? Most likely.", "title": "Good location .....", "helpfulness": 1, "user": "3Family3", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 101142473}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My girlfriend and I stayed this weekend and had a wonderful experience. The hotel staff was helpful and very friendly, the hotel was very clean and new. We had a room with a king bed; it was nicely appointed and quiet. It seemed very new. Great location and value. We have nothing negative to say about Orchard Gardens. I've recommended it to several others in the last day.", "title": "Great experience", "user": "Thouv", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 100204905}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I stayed here one night and it was really nice. Rooms were clean and the bed was super. Location is great just by the china town gates.", "title": "nice hotel at china town gates", "user": "Anders_Falk", "date": "March 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98619153}, {"rating": 5.0, "title": "An Oasis for the Business Traveler", "text": "I have have experienced two exceptional stays at the Orchard Garden and recommend it highly. It is truly an \"oasis\" for the business traveler, offering a high level of service and beautiful accommodations. The staff is very helpful and friendly, making it even more of a pleasure. The fact that it is also a \"green\" hotel makes staying there even more of a priority for me.", "helpfulness": 2, "user": "DancerPa", "date": "February 18, 2008", "id": 13662915}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "From the moment I stepped my travel-weary body into the this hotel, I was instantly rejuvinated.", "title": "The little things count!", "helpfulness": 5, "user": "chic_traveler_8", "date": "February 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13583759, "likes": {"liked": "— The friendly staff.", "disliked": "— Absolutely nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My shuttle door was opened for me and my luggage brought inside where I was quickly checked into my room. Throughout my stay I was greeted by all employees and no request was too outlandish. Complimenty newspaper outside your door, great Aveda products, a selection of dvd's to watch on the flatscreen tv and a luxurious bath made it difficult for me to leave the room for sightseeing!", "title": "A San Francisco Treat", "helpfulness": 3, "user": "agnone", "date": "February 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13462499}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The bed was extremely comfortable and their bathrobes are worth buying so you can have a little luxury at home.", "title": "A great value that can't be beat!", "helpfulness": 2, "user": "travelgirl808", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13393369, "likes": {"liked": "— amenities", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Location-wise, this hotel is an relaxing 10 minute walk to Union Sqaure and right next door to the China Gate. Cabs are easy to come by and there is a valet service available if you have a car.", "title": "Full marks", "helpfulness": 2, "user": "itchyfeet2", "date": "January 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13101187, "likes": {"liked": "— The eco standards", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "honest review", "text": "My girlfriend and i stayed at this hotel for 5 nights at the end of march.", "user": "Gooch26", "date": "April 7, 2008", "id": 14858056}, {"rating": 5.0, "title": "Amazing Bed", "text": "after a long flight from ireland it was lovely to be greeted with a smile as we arrived and checked in. for the five days we where there the hotel staff where very helpfull but the where just really nice and friendly people.", "user": "lashimo", "date": "April 6, 2008", "id": 14840710}, {"rating": 4.0, "title": "Pleasant City Hotel. Good Location.", "text": "the room itself was interesting, americans make a big deal out of Green \"key cards\" this is common in europe and has been for years so im not going to get too excited about that.", "user": "lagunatravel", "date": "April 6, 2008", "id": 14822936}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 18, "average": 52, "very good": 296, "terrible": 10, "excellent": 582}, "aka": "Orchard Garden San Francisco", "slim_ranking": 0.0595744680851, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}