{"user_rating": 2.5, "review_count": 761, "name": "Orlando Metropolitan Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "I stayed at this hotel on June 22-27 in 2006. The weather turned horribly wet and there were thunderstorms 75% of the time. I was in Orlando for a business conference and had brought a family member along since they wanted to do some shopping.", "title": "You win some, you lose some.", "helpfulness": 6, "user": "jezzme", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5424507}, {"rating": 4.0, "title": "Great...for a price", "text": "For the price per night (~$53/night), it was an economical choice. The south tower was older and open to the outside, which, if I was alone, I would have upgraded immediately since I'd be concerned for my own safety. I arrived late at night because of a terrible series of incidents (specifically, a particular airline, and a particular airport) and was greeted by two clerks who looked more like bouncers! They were not audible and not particularly friendly or hospitable.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 29, 2006", "id": 5409475}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "However, the open layout of the hotel provided me with a view of the fabulous outdoor pool and no feelings of being \"boxed in\" were felt.", "title": "Felt deceived", "helpfulness": 1, "user": "golflover26", "date": "June 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 5372498}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "The location of the hotel is fabulous; you are midway between Seaworld and Universal Studios, as well as Orlando's Prime and Premium Outlet malls. Across the street is Mercado, which has live entertainment at night, restaurants, and a Titanic museum / exhibit. You are also right next to Ponderosa Restaurant, which has an affordable $3.99 breakfast buffet, a supermarket, and a larger gift / camera shop with well-priced goods. Radisson Barcelo is located off of I-drive, which has #8 and #42 buses, as well as the I-ride bus running through it.", "title": "OK hotel for I-Drive", "helpfulness": 6, "user": "CardiffTraveller", "date": "June 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5361480}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "The room itself was, like I said, older with an 80's decorum. The my room was equipped with a king sized bed, tv, microwave, coffee maker, a \"bar\" sink, bar fridge, and a small sized washroom. My room was close to the elevator (there are at least 2 for the south tower) but it was quiet, even though my floor consisted mainly of families and young couples. The rooms cleaned daily but I was not always supplied with fresh towels, which I thought was odd. I asked the cleaning girl for more towels and she didn't understand what I meant.", "title": "Great Location, Very Clean Room", "helpfulness": 4, "user": "Jennifer M", "date": "June 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5335303}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Our hotel stay was for October 12th - 17th. It was a bid price on Priceline at $35/nite. Overall, our stay was average. The hotel consists of two sections. To the left of the lobby is a 4 story/exterior corridor/entrance attached motel and to the right of the lobby is a 5 story hotel w/ interior corridors/no balconies. I did have an option to upgrade to the hotel for an additional $25/nite. I chose to remain with the motel reservations.... afterall it was only $35/nite.", "title": "Budget Hotel", "helpfulness": 2, "user": "scott s", "date": "October 30, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6031421, "likes": {"liked": "— The location.", "disliked": "— The furnishings in the motel section were dated."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Pros: The location on International Drive was great, walking distance to every restaurant you can think of. The price $35/nite. The room was extremely clean and cleaned daily. Our room consisted of a King size bed, pull out sofa bed, table and chairs, desk w/chair, dresser with a microwave on it, 19\" tv with dorm room refridgerator, full closet with safe, coffee maker and of course a full bath. We saw several families with small children in the motel section, budget motel = more $$$ for theme parks.", "title": "Good location", "helpfulness": 1, "user": "ebors", "date": "October 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 5895670}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "Cons: The motel furnishings were a little dated...1980's? The motel room has a exterior door to a common walkway/balcony that runs the length of the building....which is fairly common for low budget/economy motels in the Orlando area. Safety/Security not a problem, public, parking areas well lit. Would I recommend to others? mixed bag.", "title": "Not bad", "helpfulness": 1, "user": "JohnRizzo2000", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 5885788, "likes": {"liked": "— Location, pool, bar", "disliked": "— Rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "If your planning on staying at this hotel/motel or International Drive I would advise renting a car. I saw plenty of public transit buses however, they do not go to Disney or Universal.", "title": "filthy!", "helpfulness": 3, "user": "hotelsnobster", "date": "September 14, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5800417, "likes": {"liked": "— nothing", "disliked": "— cleanliness of property"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We go to the Orlando area about twice a year.... we visit Theme Parks as well as visit relatives. We like the International Drive area much better than the strip of hotels/motels in Kissimmee. International Drive is pedestrian friendly..... Kissimmee you have to drive everywhere.", "title": "Fair, not Great!", "helpfulness": 2, "user": "vikki51061", "date": "September 5, 2006", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5772847, "likes": {"liked": "— Location", "disliked": "— smell of the room (moldy), and unfriendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "After reading other reviews on this hotel I got a little nervous. We travel to Orlando for a long weekend 3 or 4 times a year. I figured it was just 2 nights it couldn't be that bad. It turned out wonderful!We love the place, and plan to stay there when we go to Orlando from now on. We paid $53 dollars a night, and had a large room, with 2 queen beds, and a fridge. The kids had plenty of room to spread out their toys and play and not be in our way. The pool was very nice, and there were tennis courts, shuffleboard, a playground. It is close to several great restaurants, and shopping. I don't know what people were complaining about, there are much worse places to stay. I guess they expected Peabody rooms at Motel 6 prices!! The only compliant I would have would be the T.V. It is only like a 19 inch, and seems real small. I have a large screen at home, and could barely see the race cars on the screen on this one. At least a 27 inch T.V. would be better.", "title": "Great Place- Our New Orlando Hotel!!!", "helpfulness": 6, "user": "adnmo", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5769057, "likes": {"liked": "— The quality for a great price", "disliked": "— The size of the television"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We have just returned from a week at the Barcelo (Radisson has been dropped from the name), husband and I with our 14 year old daughter. I booked this particular hotel through Octopus Travel following some research including Trip adviser. We wanted to stay on I-Drive and also wanted the benefit of a shuttle bus as we did not want to hire a car, we wanted to visit Universal Studios and Busche Gardens as we have done Disney in the past. We were not too interested in facilities as we knew we would be out most of the day/evening. The price needed to reflect this. We paid £245 for the week for the 3 of us in one room with 2 double beds. We were very pleased with the facilities and location.", "title": "Great Stay at the Barcelo - Trip adviser Liverpool", "helpfulness": 5, "user": "Dearheart", "date": "September 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5764312, "likes": {"liked": "— Location", "disliked": "— Noise of Air Conditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The location of the hotel was just right. It's directly opposite the Mercado and slightly set back from the main road, great for a stroll to many shops and restaurants also ideal location to catch the I-Ride Trolley. A free shuttle bus service was available from the Barcelo to Universal, Sea World and Wet n Wild.", "title": "fantastic holiday", "helpfulness": 4, "user": "uist", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5619339, "likes": {"liked": "— the room was fantasic and very clean", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The room was clean and comfortable. Facilities included access to the YMCA (attached) which had the benefit of a fitness room. There was a good outdoor pool again clean it had a bar attached which was handy. Inside the hotel was a Deli which sold starbucks coffee - we used this often as a 'takeaway' for continental breakfast. Although we also had the choice of a Bar and Grille - the food here was varied and good. There is also a small shop inside the hotel.", "title": "Sneaky Advertising!!", "helpfulness": 4, "user": "ChristiQ", "date": "August 8, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 5580022, "likes": {"liked": "— Tiki Bar at Pool", "disliked": "— False Advertising by Barcelo and Priceline"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The staff were always helpful and friendly and overall we felt safe and secure. The only 'downside' and this was probably the same everywhere...the noise of the air condintioning - we did get use to it after a while... but take some ear plugs.", "title": "Awesome stay!", "helpfulness": 5, "user": "bballgirl01", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5501732}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "My family just returned from a stay at the Radisson Barcelo. We were there from May 28th to June 2nd and had a wonderful experience. I was very concerned about the hotel after reading the reviews posted on this website, but I want to let everyone know that it was a great experience. True, the older part of the hotel is just that, older. The tile was chipped in the bathroom and the sink had a crack in it that had been repaired, but the floors, beds, bathtub and toilet were clean. The air-conditioning was great as it was very hot during our stay. The kids really enjoyed the pool and the we did too. I did not encounter anyone that was offensive nor did we have any problems with any other guests. There were a lot of tourists from Europe staying and we enjoyed visiting with them. If you want to stay in a four star resort and have the finest linens and most current decor than this hotel is not for you. If you want a nice, comfortable room at a very affordable price, then you will enjoy the Radisson. The price we paid for this hotel was lower than what I feel they should have charged for the excellent service we received. I am so satisfied with my stay that I would recommend it to my in-laws and that should say it all.", "title": "Pleasantly Surprised!!!", "helpfulness": 7, "user": "jcomo", "date": "June 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5301502}, {"rating": 1.0, "title": "Never ever live in this hotel", "text": "I wont recommend this hotel to anyone. Very dirty, and staff is not friendly. Some of my stuff got stolen from the room and when I complain to hotel mangment, they give me the impression that I made a huge mistake by leaving stuff (clothes and shoes) not locked. I could not even contact to manager for 36 hours to report it. The hotel room was also not clean properly and all of their furniture and accessories looked very very old.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 3, 2006", "id": 5296241}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "Overall just try to live somewhere better.", "title": "absolutely disgusting, never again", "helpfulness": 4, "user": "Bellestravels", "date": "May 31, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5287587}, {"rating": 1.0, "title": "Terrible in EVERY WAY", "text": "I would NEVER stay at the Radisson Barcelo again. I had to call security at 2:00AM due to a loud party that security should have been aware of before I called. There were so many scum bags staying at the hotel it was amazing. I felt as if I was at a homeless persons convention. In addition, they advertise plush bed, and the bed in my room was anything but. The bathroom was disgusting and old. The toilet seat was not cleaned, the grout was missing in many places (especially behind the sink) and moldy in the rest. The bathroom fixtures were the oldest I have encountered in a long time. The drain plug was dirty, flaking metal and falling apart. I did not want to touch anything in the bathroom, not to mention the towels! They were like sandpaper and so old and disgusting they were grey colored. I hated even brushing my teeth in that bathroom. The only good thing I can say is the room size was decent. But the furniture was so old I did not want to sit on the couch or the desk chair. There was only one elevator to serve 5 floors so the wait was long and then the a/c was not working in the elevator so it was stinky and hot. The ice machine did not work on my floor and the outside corridors were not safe. The only way the hotel could be improved is to bulldoze it. And not even a continental breakfast offered??!! Please! People should be paid to stay there it was so bad. I would never pay to stay at the Radisson again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 24, 2006", "id": 5205858}, {"rating": 3.0, "title": "It was okay", "text": "We made sudden plans to travel up to Orlando for one day. Looking online we thought a Radisson Hotel has name worldwide and booked a standard room for $79.00 plus tax on a regular weekday. I would never book a non-quality hotel,eventhough we knew that we only needed for one night we were positive that we made the right choice.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 10, 2006", "id": 5049205}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 117, "average": 145, "very good": 132, "terrible": 281, "excellent": 86}, "aka": "Orlando Metropolitan Hotel Orlando", "slim_ranking": 0.90273556231}