{"user_rating": 3.0, "review_count": 882, "name": "Outback Pioneer Hotel & Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I stayed 3 nights in the Lodge (YHA hostel portion of the Outback Pioneer) and have really mixed feelings about my time there. To see Uluru was a dream come true, and I certainly enjoyed that aspect of it, but I am shocked that YHA supports this property because it was so incredibly dirty and badly stocked. The dorm room was a 20 share, and was fine. I don't mind a dorm room even if it is huge, although being winter the nights were very cold and the concrete building did not seem to have any way to heat it. My problem was mostly with the kitchen- it was filthy! It never seemed to be cleaned and with so many people using it, there were hardly any utensils, pots or pans. The cook-your-own BBQ area was right beside the hostel and it constantly stunk of meat and grease! Did not seem to be cleaned properly either. Atleast while you stay here, you can use the pools of the other resort hotels, and the grounds and lookouts are nice to have a look around. In a way I would receommend this place for the budget traveller to see Uluru- as there is nothing else around with decent prices- but please be aware of what you are goign to be staying at. It truly is a tourist \"trap\"!!", "title": "Poor Accomodation in a Wonderful place", "user": "lovebeachtravel", "date": "December 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121304342}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Like all the other hotels & hostels at Yulara resort also this one is so overpriced that you don't know wether to laugh or cry. Anyway, if you want to visit the rock, you are forced to stay somewhere in the area at least for one night. We stayed at the lodge accommodation since it was the least expensive option at the resort. The rooms (we had a 4 bed dorm) were extremely small. It felt ridiculous to be in the middle of a vast desert and stay in a such a small room. We were 4 people and had no chance for example to be able to open our suitcases at the same time. Bathrooms & showers were in another building, not so cool if you have to go in the middle of the night, but they were clean and ok. The food at the hotel \"restaurant\" was terrible and expensive.", "title": "Expensive!", "user": "Nina126", "date": "November 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 120980008}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Quite near the hotel there is a kind of a look-out point where you can watch the sunset and sunrise over Uluru & Kata Tjuta. That was of course beautiful, and it was practical to have such a place near the hotel.", "title": "A basic accommodation", "user": "WSpinner", "date": "November 22, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120934617}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "If you choose this accommodation, it's because you are a budget traveler; or because you do not like the idea of being sponged. In fact, Yulara is the typical place that was thought, projected, built and managed with the only purpose of milking the tourists; I only hope that part of the money they collect is invested in favor of the Aboriginal communities (which I would not be so sure of, because on the contrary the entrance fee to the Uluru-Kata Tjuta park is extremely popular). Returning back to the hotel, it resembles rather closely some overseas military facilities, with the basic difference that military-managed places are significantly cleaner. Well, we shouldn't forget we are in the Outback, with all its peculiarities, where everything must be imported from far away; but they should not forget the use of the brush. The help-yourself-BBQ (gas heated) is a nice way to give the guests the idea of being in a wild place, and to make savings on personnel salaries. I slept in a 4-bed shared, together with a friend, an over-65 HD biker (great guy!), and a sort of ghost that appeared late in the night and disappeared early.in the morning. Not so bad, summing up, just a bit overpriced. I would come back here because all the other hotels are much more overpriced.", "title": "Ritz-Carlton Prices for Motel 6 Rooms!", "user": "fievel1079", "date": "November 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 120788620}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "This hotel is \"fine,\" until you realize the going rates for the rooms are upward of $450/nightly. Then the criticizing begins. We got what was supposedly an awesome rate, yet was still twice as much as it should have been. If you're expecting Motel 6, you'll be pleased with drabby accommodation, although decently clean aside from bugs/spiders living in the room and squash marks on the wall. Mind you, having the front door, which opens to the outside, actually close without leaving a 1\" gap for bugs and critters would be a tip for management. Especially when there are literally thousands of ants scurrying a mere feet from the doors. You have to plug in your key to turn on lights, so when you arrive at night and want to shut the door quickly to keep out mass armies of mosquitoes and flies, you can't because you have to fumble for the switch. Luckily, very high A/C levels kills off the mosquitoes, except for those who seek respite in the bathroom! And having a fridge is very nice. This resort is a complete racket but it's what you get if you want to do justice to the beautiful Olgas and Uluru. Suck it up and know you are paying the Ritz Carlton prices for a Motel 6 room.", "title": "Better than expected", "user": "modelmeemaw", "date": "November 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120464155}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have stayed at this hotel a couple of times a month for business travel over the last 2 years. The price is high due to the location and everything (including staff) has to be imported from elsewhere. If looking at aspects other than price it probably your best bet (standard hotel room) of the various properties as you won't be spending a ton of time in your room. Rooms are clean, neat and modern. The pub is onsite and there are 3 options for dinnner here depending on price and quality. The live music every night is always great.", "title": "Best value of the Voyages properties", "user": "Tiggin", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118841481}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We stayed for three nights in a standard room in June and after reading previous reviews I wasn’t sure what to expect from the Outback Pioneer Hotel, but I was pleasantly surprised. Check in staff were very friendly and went out of their way to help. Our room was very big and very clean with a double and single bed and a large bathroom with a bath (great after long days walking around the base of Ayers Rock, the Olgas and Kings Canyon) and was stocked with nice toiletries. The only thing was, the room got quite cold at night and there was quite a large gap under the door to the outside (approx 2 cm) which I think contributed. Dinner was brilliant fun. The DIY BBQ at night is such a good idea, a bit pricey but well worth it as it was such a novelty and great fun. They had a good choice on the menu including steak, kangaroo & fish and an all you can eat salad bar. These facilities were also clean, well kept and run. There was even a one man band/guitarist singing quintessential Aussie songs which added to the atmosphere. The entire Ayers rock resort is quite expensive but worth it for the experience of seeing such remote wonders of the earth as Uluru, The Olgas and Kings Canyon. All in all I enjoyed my stay and couldn’t have asked for more. This hotel was a perfect base for our three nights/days exploring.", "title": "A nice surprise...", "user": "hop_4ever", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118840346}, {"rating": 3.0, "title": "OK", "text": "We had an OK standard room. Soft towels; no free internet access.", "user": "Noodlie066", "date": "September 30, 2011", "id": 118794784}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "we wanted a good standard of twin share accommodation. the room was very clean with a fantastic shower! there was an outdoor pool & extremely reception staff. our bags were collected from our tour bus & taken to our room before i even realised they were missing. on the day of checkout we were going to be on a sunrise tour & walk. instead off dragging our luggage to the front desk at 5am we were able to fill in a form to have our bags collected from our room at checkout time & stored in a locked room for us to collect later. this made an early morning start stress free. there was a resturant that was extremely overpriced which we chose not to eat at. however there was an outdoor bar & BBQ area & there was a kiosk to buy burgers, a steak sandwich, fish & chips etc at good prices. this was a good option to take back to our room & relax after a busy day.", "title": "excellent accomodation", "helpfulness": 1, "user": "shelly1972", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118765911}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "We enjoyed our stay, however for what you pay in our case 46 dollars pp a night it's crap. But you have to let that go when your there cause its a different world! The staff is absolutely brilliant all over the place we found. We were lucky enough to have the room to ourselves the first 2 nights we were there. As you are getting up very early. I would recommend renting a car before arrival we paid 150 dollars for 3 days and only spent 40 on petrol. The 100 k's allowance was just enough to cruise around comfortably and visit the olga's which we loved! There's a beautiful walk and the 2nd look out is absolutely stunning! The whole walk was being in paradise. We spent the whole day there from sunrise to sunset. There's a great spot for the sunrise which is called the dune lookout before the olga's it's the best off both worlds as you can see uluru as well!", "title": "Great place to stay while exploring Uluru and the Olgas", "user": "itsliesbeth", "date": "September 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 118523230}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "This 'budget room with bathroom' cost $260 for one night! At that price one would expect a bit more than 4 bunk beds, a tiled floor, no comfortable lounge chair and no television. General common/community facilities were good, however, and the location stunning. I suspect a lack of competition permits them to charge such high prices, as there was no single-room lower priced accommodation available anywhere in the area.", "title": "Overpriced", "helpfulness": 1, "user": "michaelpom", "date": "October 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 119735753}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Stayed here recently in a hotel room in an unexpected stop over. Clean and shaded rooms, we were located very close to their beautiful pool. A nice relaxed feel about the place. I would recommend their hotel rooms as a good option at Yulara.", "title": "Pleasant and relaxing", "user": "pedals2010", "date": "October 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119371851}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I do realize that many people come through the hotel, but a smile and a \"welcome\" would have been nice. The girl who checked us in had glazed eyes set on the horizon and the rest set on \"automatic\". The young men we encountered later were fine. but the exitement of our arrival was taken down a few notches by the \"welcome\".", "title": "OK", "helpfulness": 1, "user": "AnneMarina", "date": "October 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119127195}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We knew the quad bunk room was basic but would rather spend money later on where we got value for our money. Beds were fine, blankets and linen adequate, common bathroom/showers quite good, laundry ok...dryer returned my 2$ :-) I kept it! Only issue was the next door air condition. It kept us awake all second night. The noise level was, and I am not exaggerating, equal to 10 empty tincans dragged behind a car...", "title": "Embarrassing", "helpfulness": 4, "user": "AK1966", "date": "October 9, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 119121906}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had brought our own cereal and coffee etc, but in spite of getting up at 6.30 both days, we only managed to find 1 bowl and a small pot to eat it from so we had to take turns. Next day we had saved our paper coffee mugs and ate our cereal from them...but we felt that in such a nice kitchen with lots of cooking space and fridge/freezers, it would have been nice to have some crockery.", "title": "Good value, middle of the road property", "user": "HawaiiNut02760", "date": "October 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118983690}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "During our 6 week round the world trip this was the most expensive rate per night !", "title": "A good base for Ayers Rock", "user": "Majobu", "date": "September 16, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 118189233}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "However if you treat the room as a base only then it was fine, its the experience of visiting Ayers Rock that made it more than worthwhile.", "title": "Well run", "user": "swishAuckland", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117685774}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We watched stunning sunsets and sunrises, sat out and had a meal under the Milky Way and saw an incredible Moon rise.", "title": "Never again...", "user": "scrubby1249", "date": "September 1, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0}, "id": 117567508}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "We visited the Cultural Centre near the Rock, the only disappointment was that the local Aboriginies dont seem to have a high profile in running their National Park.", "title": "Very disappointing - make sure you avoid the rooms next to the fans", "user": "lexywoo", "date": "August 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 117504589}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Amazing morning walk around the base of the Rock, before sitting in the grounds of the Sails in the Desert Hotel in the afternoon sunshine.", "title": "Pleasantly surprised!", "helpfulness": 1, "user": "Reachforthesky", "date": "August 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117459406}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 116, "average": 317, "very good": 298, "terrible": 74, "excellent": 77}, "aka": "Outback Pioneer Hotel, Ayers Rock Hotel", "slim_ranking": 1.0, "description": "Looking for traditional Aussie hospitality? You'll find it at the Voyages Outback Pioneer Hotel & Lodge - with your choice of 3 ½ star hotel or 2 star lodge accommodation, from comfortable, affordable hotel rooms and budget cabins to dormitories. This hotel is perfect for the demands of travellers looking for quality service in relaxed surrounds. This is a place where friendships are made and good times are had by all. Taste Australia's pioneering past, as you enjoy a beer and some outback delights at the do-it-yourself Outback BBQ, and swap stories of your day's adventures. Alternatively, opt for the peace and quiet of the Bough House Restaurant with a buffet dinner. The Voyages Outback Pioneer Hotel & Lodge is ideal for those who want to enjoy all that Ayers Rock (Uluru) has to offer."}