{"user_rating": 4.5, "review_count": 2533, "name": "Outrigger Waikiki on the Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My Husband and I stayed at the Outrigger for 2 nights for part of our honeymoon. This hotel is beautiful, the bathroom is big and everything is brand new, the rooms are nice and clean, and the balconies are really nice. We had a partial ocean view, that was ok, but it was nice to be able to look at at the city. There are two really good restaurants in the hotel, Hula Grill and Duke's. Make sure you try the banana mac nut pancakes at Hula grill , sooooo good. Dukes also has a bar right on the beach! The location is great, literally right on waikiki beach. I would definitely recommend this hotel and in fact I wouldn't stay anywhere else!", "title": "Outrigger, perfect hotel in Oahu", "helpfulness": 4, "user": "Vee123", "date": "October 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6020793, "likes": {"liked": "— The location and the condition of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We spent the second week of our honeymoon at the Outrigger Waikiki. Check in was easy, we arrived a little early, so they took our baggage and we stopped at Dukes for lunch. We had a partial ocean view room on the Cheesecake factory side of the hotel. We did hear the exhaust fan when we were on our deck, but it wasn't annoying. The sunsets were very nice from our balcony. Beds were comfy, bathroom very nice, room was made up prompty each day. The room had free ethernet with cables in the desk and free long distance within the US. The elevators did take awhile at times, but overall, didn't hold us up much.", "title": "Best location on Waikiki!!!", "helpfulness": 12, "user": "LesJB47", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6012424, "likes": {"liked": "— clean, great service, fun atmosphere", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We got coffees at the Seattle Coffee company in the lower lobby, if you get the Big Kahuna package, you can use your 5 dollar vouchers there and essentially get a light breakfast for free each day. We had lunch at Dukes twice, which was reasonable and very good, you could also order for a smaller menu poolside. There was a small deli (Pai) near the pool which was extremely well priced and the sandwiches were a perfect light lunch. Drinks were great at Dukes and the Hawaiian beers were excellent, especially Kona Big Wave.", "title": "Enjoyed every minute", "helpfulness": 6, "user": "l1verpool", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6006644, "likes": {"liked": "— clean and well kept"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We mixed it up between the beach and the pool. Definitely hit the beach early and rent lounge chairs and an umbrella. Never had a problem getting seats by the pool. It is not a quiet beach/pool experience, so don't expect it. It was a mixed group of people, friends traveling, honeymooners, and families. Bar service at the pool was excellent...and yes, bring your ID, but once the girls get to know you, you don't need it.", "title": "Great Place!!!", "helpfulness": 8, "user": "vmijt", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6003357, "likes": {"liked": "— location and service", "disliked": "— elevator service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Outrigger Waikiki is definitely in the hub of Waikiki, it is walking distance to great shopping and great restaurants. We mostly relaxed, since we had an action packed week before in Maui, but we thought Pearl Harbor and Diamond Head were well worth it. We also checked out the Magic of Polynesia across the street, fun, but not essential, and a little costly. The revolving restaurant across the street was a fun stop for a nightcap.", "title": "Great place to stay on Waikiki beach", "helpfulness": 10, "user": "rach_g", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5984406, "likes": {"liked": "— Location, Location, Location!", "disliked": "— Having to leave..."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "This hotel can boast the perfect location: right on the beach (no hassle crossing busy Kalakaua Ave). Room: extremely clean & comfortable, with in-room fridge (also safe, iron/ironing board), and nice bathroom (granite finish). Upgrade, from city to ocean view, was a definite plus. I am particularly picky, but would not hesitate in staying at this hotel again. Restaurants (again, on the beach) are enjoyable, esp. Dukes (don’t be put off by its “pickup bar” demeanor).", "title": "Great accommodation: right on the beach...", "helpfulness": 5, "user": "simon.plester", "date": "May 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5233700}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This is an excellent hotel. I'd dare to say the best you'll find in Waikiki. This isn't because it is a great facility, but rather its absolute prime location. It is directly across the street from the International Marketplace, a truly fascinating part of Hawaii and for sure a great souvenir stop. It’s within walking distance to the zoo, surfing, and almost the entire strip.", "title": "Great Stay ay Outrigger Waikiki on the Beach", "helpfulness": 19, "user": "Mike M", "date": "May 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5230873}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "HIGH POINTS: This hotel has a friendly and helpful staff that will seek to engage you. I find this far different from many other shops, restaurants, and hotels you are likely to encounter in Hawaii. For example, each day my wife and two small children set out to explore locations on the East and North shores. The valets would see to it that we had accurate direction in hand no matter how long it took. (At no point did they push for a tip or could they assume they were getting one- but of course they did). Housekeeping frequently made it a point to engage us to find out if there was anything else we needed. Our room, although small, was well appointed and very comfortable. It had a very nice bathroom and (empty) refrigerator. Free in-room internet and WIFI in the lobby and pool area. But, there is nowhere to sit!!", "title": "Perfect Honeymoon!", "helpfulness": 13, "user": "TeacherMommy7", "date": "May 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5224723}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "LOW POINTS: Check in can be abrupt. They do seem a little too serious for the setting. The overall facility is much smaller than their website would make it seem. There is one relatively small pool and a small hot tub. There are no kiddy pools or even a shallow end. The total square footage devoted to outdoor activity (aside from public beach) is far too small to support the number of rooms and guests, but they do make it seem less crowded through an intelligent multi-level design.", "title": "The Outrigger 'Scoop!'", "helpfulness": 10, "user": "Peteetrius", "date": "May 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5180683}, {"rating": 5.0, "title": "wouldnt stay anywhere else", "text": "FOOD: The hotel has at least 2 (I think more) excellent restaurants. We ate many times at Duke’s and found it to be excellent food and an unbelievable bargain compared to other food in the area. For example; on Mother’s day, all 4 of us ate at their Sunday brunch for $35 with a nice tip. The food was some of the best I had on a 3 week trip to various islands in Hawaii. When compared to the $20 we spent eating a Waikiki fast-food breakfast on the way to the Zoo (also close), it truly seems like a bargain. The only major issue is the lack of sit down restaurants in the direct vicinity of the hotel. The only one was Cheesecake factory which had a perpetual 80-90 minute wait (total waste of time). In the end, we opted to eat at the most multi-cultural food court probably one of the best the planet many nights, the food court of the International market. It was great and a 2 minute walk. There was everything from cold coconuts, to sushi, hamburgers, Korean BBQ, pizza, Mexican, local cuisine… all excellent and frequently accompanied by a free show.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 18, 2006", "id": 5180427}, {"rating": 5.0, "title": "Loved the Outrigger", "text": "We had a week stay at the Outrigger & loved it. The location is excellent, right on Waikiki Beach with great views to Diamond Head & across the road from the International Marketplace (lovely shopping!!).", "helpfulness": 2, "user": "aussiemumdad2kids", "date": "October 13, 2007", "id": 10072762}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our room was a city view but the view from our balcony to Waikiki Beach was quite nice - not prime beach but a much better view than I imagined. Duke's bar is a nice place to sit back with a drink & a meal and just take in the views & the atmosphere. All the hotel staff were friendly & helpful.", "title": "Times Square Meets the Tropics", "helpfulness": 1, "user": "saverguy", "date": "October 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10065842, "likes": {"liked": "— The spacious and beautifully decorated rooms", "disliked": "— Noisy Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I can agree with some other postings about hearing noises from adjoining rooms - we could hear toilets flushing & certain \"other\" noises....", "title": "Great Place", "helpfulness": 2, "user": "bgm01", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10048172, "likes": {"liked": "— The view from the room", "disliked": "— Having to pay for the room upgrade"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Overall our stay at the Outrigger was great, we would recommend it to anyone as the location can't be beat.", "title": "Location, Location, Location", "helpfulness": 3, "user": "bella1000", "date": "October 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10047866, "likes": {"liked": "— location to beach"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This was a first trip to Hawaii and we started with Oahu. The Outrigger Waikiki was in the center of all the action, making it very convenient if you can overlook the noise and the congestion.", "title": "Fantastic View", "helpfulness": 1, "user": "adatrip", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 10036667}, {"rating": 4.0, "title": "Great hotel, great location!", "text": "My husband and I stayed at the Outrigger Waikiki on what was our second trip to Hawaii. We saw the hotel on our first trip and were keen to stay there so booked it second time around. We booked a partial ocean view room and were upgraded on arrival to an ocean view room (by request). The ocean view room was fine although the view wasnt as good as our previous visit since it is a bit restricted. We stayed in room 1219 which is on the left hand side of the hotel and were close enough to the hear the ocean and the people enjoying the beach. It doesnt get the sun in the afternoon though! The room was nice, spacious and clean and the staff very friendly. The main thing about this hotel in our opinion is the location and the bars/restaurants downstairs. Duke's is a fantastic bar with a great atmosphere, great cocktails and you must try the Beach Fries. The food is also great and offers you the choice of eating in the bar or in the restaurant - although best to make reservations if you dont like waiting. We also sampled Chuck's Steakhouse which was also fantastic. We loved the hotel because of the closeness to the beach. The pool area also looked very good and at weekends, had entertainment which was nice to listen to as you lie on the beach. Overall, whilst it would be nice to have a full ocean front room, we had a great time at the Outrigger, thoroughly enjoyed our stay and would definitely stay there again.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5393536}, {"rating": 5.0, "title": "This hotel is wonderful.............. We loved every minute", "text": "We were just in Hawaii on vacation. The island is beautiful and this hotel it top notch. We had wonderful service, the rooms were cleaned every day, the service people were very friendly, checking in is very smooth. This hotel is lovely, the lobby and waiting areas are a pleasant place to be. Can't say enough about the staff, they were all very friendly and made you feel like they were really glad you were there. The beach area is clean, pools and hot tubs were clean and had plenty of chairs as long has you were there to reserve one by 9am or so. Don't miss the \"Circle Island tour\" This was very informative and you got to see some of the other side of the island. Great deal for the money. We also did Germains luau and for the money this was not something that we will do again but not disappointed that we did it once. The show is acutally about 1/2 hour longer than it should be. And of course we did the Pearl Harbor Tour that everyone should do at least once. Overall I think our choice of hotel was the best (and we checked out many.) We have already booked next years vacation and we are staying at the OUTRIGGER WIKIKI ON THE BEACH again. The vacation was a great success and the staff at this hotel is great!!!! We had a wonderful vacation and I hope you will to.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 26, 2006", "id": 5391345}, {"rating": 5.0, "title": "Outrigger Waikiki Is the Best", "text": "My husband and I stayed at the Outrigger Waikiki and loved every minute of our stay. Everyone in the hotel was friendly and willing to help. The beach was wonderful. My husband had never been to Hawaii before. After checking into the hotel we went to Duke's Canoe Club for dinner. Our dining experience is one we will always treasure as we sipped Mai Tai's and watched a beautiful sunset. During our dinner at Duke's were Hawaiian singers strolling through the restaurant adding to the tropical ambiance that we longed to experience. Our stay at this hotel was completely relaxing.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5360067}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We just returned from Oahu and had a great time at the Outrigger. We stayed 2 nights in a City View room and loved every minute. We also stayed at the Ko Olina Beach Club for the next 2 nights, as my husband loves the city and I love peace and quiet, so we arranged for both. I was pleasantly surprised by how much I enjoyed the Outrigger and Waikiki.", "title": "Great vacation!", "helpfulness": 24, "user": "hvtxmom", "date": "June 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5327156}, {"rating": 5.0, "title": "Terrific Honeymoon stay", "text": "The hotel is tastefully decorated in Hawaiin themes, clean, and has the Aloha spirit. Even though our room was a City View, we still had a nice view of the ocean. We requested a room on the opposite side of the Cheesecake Factory and didn't hear any fan noise, although the street noise can be a little loud at times. The beds were comfortable and the bathrooms had everything including large granite countertops, make up mirrors, free safe, frig, and wonderful shampoos. Wish I could buy more of those! The room also had free internet access.", "helpfulness": 22, "user": "JVPhoenix", "date": "June 7, 2006", "id": 5323062}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I booked a week at the JW Ihilani Marriott in Ko Olina. While the resort was very nice, we are young and advernturous and got very bored!!! After having lunch at Duke's one day, we decided to check out of the JW Ihilani and come stay at the Outrigger Waikiki. We were very excited to get upgraded to an ocean view and FREE long distance!!! Great when I needed to call my husband's cell. There were also two free waters in our fridge which was a nice welcome after paying $4 at JW Ihilani. The price was $229 and WELL worth it! Bed was okay, view was awesome. We went on the canoe at the beach and had a blast. We ate at Dukes for breakfast and lunch and you really can't beat it. Great prices, great food, great music, and awesome view. The girls at the front remembered us each time. Free coffee for guests. Gift shops were surprisingly well priced. We had dinner at a sister hotel called Ocean View? Something like that, and it was good. We walked there on the strip, had dinner, and made our way back on the beach stopping at each hotel bar for a drink. It was perfect after having such a quiet week at JW Ihilani. If your looking for fun, excitement and people watching this is the place!", "title": "Great Fun after Ko Olina!!!!", "helpfulness": 5, "user": "LaurenEk77", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5979919, "likes": {"liked": "— The price, location and view", "disliked": "— bed was not very comfortable"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed at the Outrigger on the Beach with my parents recently. I was very distraught that I had made the arrangments for us to stay here while my brother was getting married at the Halekulani down the street. You enter the hotel on the busiest strip of Waikiki Beach, which is certainly not the Hawaii of serene Paradise but of cheesy t-shirts shops, chain restaurants and hoards of people. As we ascended the elevator I noticed only the horribly ugly rugs that cover the lobby area and, again, hoards of people in line for one of the Outrigger's three restaurants. Our rooms were \"ocean view\" on the 3rd floor. My parents room had an obstructed view and was very small. Our room was bigger and had a full ocean view (we paid the same rate). We thought we were the lucky ones until we opened our sliding glass doors to hear the noise from Duke's Waikiki right below our balcony. It was loud out there until well after midnight and, after that, the noise moved to the hotel hallways. In the end, it was not horrible and it was not wonderful, it was just simply fine and disappointing given some of the other hotels we saw on the strip. The place had an overall feeling of Spring Break or Girls Gone Wild. Duke's was a madhouse most of the day and we fell asleep each night to some bad Jimmy Buffet song streaming up through our room as the backdrop to drunk people laughing and carrying on. Now, I am not against a good time but when a hotel bar will only give you \"one drink per person\" and you are traveling with people in their 40s and 60s, this has got to be a sign. If you want a relaxing stay (tough for Waikiki) at a beautiful hotel, travel further down the beach and spring for the Halekulani!", "title": "Don't Stay Here -- Unless You are on Spring Break", "helpfulness": 12, "user": "jdfrank", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 5963599, "likes": {"liked": "— Free phone call and wireless. Nice staff.", "disliked": "— Spring Break atmosphere, noise."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We wanted to stay on Waikiki for one night pre-cruise and chose the Outrigger because I happened to find a great deal (<$200 per night) on their website one day, which I never saw again.", "title": "Loved It!", "helpfulness": 7, "user": "kawill", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5958782, "likes": {"liked": "— Location, location, location", "disliked": "— pool a bit outdated"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We opted for a standard \"city\" view room. Upon check-in I (barely) mentioned wanting something on the quiet side of the hotel (after reading previous reviews here) and was given a partial ocean view room with no hesitation at no extra charge. The room was clean, modern and tastefully decorated. I really felt like I was in Hawaii upon entering.", "title": "be careful you get what you pay for.", "helpfulness": 9, "user": "azzinan", "date": "October 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5949004}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "We felt the service was great and even my 11 year old commented on how good it was.", "title": "Overall good experience", "helpfulness": 10, "user": "talon27", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5933807, "likes": {"liked": "— location", "disliked": "— rooms a little older"}}, {"rating": 4.0, "title": "I had a GREAT time!", "text": "I'm going to make this short and sweet. The hotel was great...the staff was accommodating the restaurants were great and yummy. I loved that it was central to everything and the beach was amazing :) The only comments I have to make on the more negative side were that the walls are super thin and the elevators took too long at times. Other than that I would definitely recommend the hotel to anyone looking to stay in Waikiki!", "helpfulness": 2, "user": "andreajc41", "date": "September 17, 2007", "id": 8738945}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I booked a partial ocean view for 8 nights at the outrigger. We were told on arrival we were being upgraded for free to an ocean front room.. the man who checked us in kept saying not to tell anyone he would get fired for upgrading is for free.. he made a big deal out of it, however we were not upgraded. That was my only complaint about the outrigger.. we were fine with the room we booked untill we thought we had an upgrade only to find out we were lied to. That being said...", "title": "A wonderful hotel, a perfect vacation..", "helpfulness": 4, "user": "jadexx", "date": "September 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8682104, "likes": {"liked": "— Location, free internet & phone calls", "disliked": "— Check in"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Room:", "title": "My favorite Hotel in Waikiki", "helpfulness": 4, "user": "lytes", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8675727, "likes": {"liked": "— The view and the location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "we were on the cheesecake factory side of the building directly beside the fan, where everyone said is the worst place to be, however we had no problems. The part of our view that was ocean was wonderful, and the part that was city was nice too. The fan was not very loud and when the door was closed you couldnt hear it at all from inside the room. You could hear a flush from the bathroom next dr in the middle of the night but nothing you would hear if you werent already awake. The Bed's were comfortable, room was cleaned well every day. It was not a huge room, but a very good size for the two of us. Loved the in room fridge, we were always bringing home leftovers and eating some the next day.", "title": "Great Stay!", "helpfulness": 5, "user": "ZeusMonster", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8603686, "likes": {"liked": "— Location", "disliked": "— Parking fee!!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Food:", "title": "a very good hotel in an excellent location", "helpfulness": 5, "user": "herv_7", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8601293, "likes": {"liked": "— location, the beach itself, the good size room and reasonable price", "disliked": "— the extra payment for using umbrellas ans beach chairs"}}, {"rating": 4.0, "title": "You cant do better than this.", "text": "My husband and i stayed at the Outrigger Waikiki on the Beach from Sept 5 - 9 2007. It was right in the middle of EVERYTHING, and right across the street from the Int'l Market Place. We were on the 10th floor and had an ocean front delux, it was a corner unit and we had a breathtaking view of Diamond Head. Next time i would probably go with the ocean front instead of the delux, i only used the jacuzzi tub once but it was great! But i would still get just the ocean front cuz the tub took away from space in the room, but other than that the room was clean, we had no problems with noise, it was great cuz on some nights we could hear the shows going on next door at the Royal Hawaiian but only if we opend the lanai doors. The service was wonderful, for exampl on one night we didnt know where to have dinner and hubby was feeling mexican, we just walked down to the concierge and she suggested a great out of the way mexican restaurant i think it was called CHa Cha Cha's we sat outside and it wasnt even crowded, the portions were huge too! We also used the service to rent a car, they even came to get us. The beach in front of the hotel was pretty crowded but we managed to find a spot, the area to the left is where you can arrange for a whole bunch of water sports, which we never go to do, but from what i could see, we had the best hotel on the beach, i really loved it, i thougth it was convenient and it served its purpose, also right in front is the famous Nahoku II which is a catemaran another thing we never got to do, hopefully next time! But i would definately suggest this hotel, it was clean and convenient to ALL, great views, great service, had Dukes Canoe Club right downstairs which is supposed to be a happenin bar but, there was nothing happenin when we were there, it was very slow. Hope u enjoyed the review, please contact me with any questions!", "helpfulness": 6, "user": "Donny1113", "date": "October 23, 2007", "id": 10267212}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We spent a week at this hotel. We got the ocean view room with breakfast.", "title": "Great Place!", "helpfulness": 3, "user": "Pamelita448", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10264603, "likes": {"liked": "— the location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The rooms are a good size, and the view even though it wasn't front view, was great. We could see even sea turtles in the ocean from our 12th floor balcony.", "title": "Great Hotel", "helpfulness": 3, "user": "jenhip", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10154689}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This hotel is right in the beach, all others are either across the street or further. It is located right in the waikiki busy area, so you won't need a car. Everything is basically within walking distance. There are plenty of restaurants, bars, shopping and even the international market across the street where you can buy hawaiian handcraft.", "title": "Great hotel", "helpfulness": 2, "user": "woojinah", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10144476}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "For breakfast, you can choose 2 of the restaurants at the hotel, which are also right in the beach. I recommend Duke's. They have a breakfast buffet, very nice, and you can seat near the pool area, and have a great view of the beach.", "title": "Great Location... but overall just OK", "helpfulness": 11, "user": "MoChoLA", "date": "October 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 10084500, "likes": {"liked": "— right on the beach", "disliked": "— thin walls, hotel needs upgrading"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "We had reservations for 5 nights at this hotel, and had to move after only 2 nights. The walls are paper-thin, and you can hear the people in the next room talking. If the TV is on then the noise is worse.", "title": "Nice Hotel, but very noisy rooms", "helpfulness": 1, "user": "mbtravellerMelbourne", "date": "February 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 13898835}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "The hotel facilities are good, and we enjoyed the restaurant and bar facilities. Hulu's restaurant was awesome and the food was excellent. It's highly recommended.", "title": "Fab Honeymoon Location", "helpfulness": 5, "user": "BartBristol", "date": "February 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13858255, "likes": {"liked": "— Dukes restaurant", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Location is great, right in the middle of Waikiki.", "title": "This is it people!!!", "helpfulness": 13, "user": "Briansa", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13662601}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "After the noise problem we checked-out and moved next door to the Westin Moana Surfrider. What an amazing hotel. There is no comparison to the Outrigger.", "title": "Loved Outrigger Waikiki!", "helpfulness": 7, "user": "katie77iris", "date": "February 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13269234, "likes": {"liked": "— Location, comfort, service.", "disliked": "— Had to leave it!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I would not stay at the Outrigger again.", "title": "A Good Experience", "helpfulness": 14, "user": "iminak", "date": "February 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13174191}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Stayed here between 13th Oct and 17th Oct. After travelling for 16 days across the USA, ie, Anaheim,Las Vegas & New York, we were ready for some rest and relaxation and that is what we got. The room was great with partial ocean views and city views even though we'd only paid for city views. Big enough and confortable for my husband, daughter and me. Right across from the International Market Place and close to any shop or bus stop or anything you wanted. Dukes was fantastic, we had breakfast there every morning and also dinner once.", "title": "Loved it all!", "helpfulness": 8, "user": "Gabster2", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5982324, "likes": {"liked": "— roomy, comfortable and clean.", "disliked": "— N/A"}}, {"rating": 4.0, "title": "Vegas on the Beach", "text": "If you're in your 20s and love to party or your a bigtime shopper who loves to spend spend spend; you'll love Waikiki. Families or plus 40 couples or friends will be less inspired. That's not to say the Outrigger isn't a really great hotel. It is and its located right in the heart of Waikiki/ The rooms are clean, the bathrooms feature limestone-marble-like tile surfaces and modern fixtures, the sound proofing is pretty darn good—unless you leave your sliding door open to hear the surf (which you can hear even in the 11th floor rooms). The beach tends to throb late into the night, so if you're trying to stay on PST or MST (which means hitting the bed at 8Pm and getting up at 4:30AM) you'll have to wear earplugs. The housekeeping staff is really great about helping out. The Hula Grill offers excellent breakfasts, great beachside views and fairly decent prices for a hotel on the beach! The prices at Duke's, below on the beach, are pretty expensive for what you get. (side bar: Foods pretty good but about what you expect. In fact,most of the food in Honolulu at the restaurants is just so-so. Stay out of the Chinese restaurants. They're wretched. I hit three before I swore them off. Japanese is the way to go). Also, be sure to checkout the historical/art exhibits near the Outrigger canoe in the OW's lobby! It offer priceless insight into Hawaiian culture. The swimming pool features sparkling clear salt water instead of chlorine. A huge plus. You can use your room card to get towels down there. But you probably won't use it if you came for the ocean....", "helpfulness": 28, "user": "A TripAdvisor user", "date": "June 7, 2006", "id": 5318867}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "If you're tempted to take any of the gazillion catamaran cruises available on the beach out for snorkeling, forgettaboutit. They're a joke. They take you out about 300 yards, shamelessly chum for fish with cookies, and drop you in the middle of it all. Sure you see a few fish but you also fight currents and waves and the number of fish is about three species total, and maybe a turtle or two (swimming away from you as quickly as possible). Then afterwards they take you out into the ocean for a hour long out and back cruise to nowhere. It's a yawner, unless you were really dying to see the cityscape views of Honolulu.", "title": "Great Hotel, Great Location", "helpfulness": 7, "user": "mphenry23", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5315950}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "The Outrigger's new Plantation Spa is fantastic...just opened on the top floor; the prices are reasonable, the therapists highly skilled and the serene atmosphere is amazing with ocean views straight out to the horizon. I'd love to sit out in the rooftop hottubs in thevening! The very large couples massage room is extraordinary for the spa world, and the treatments and atmosphere will blow you away. The changing rooms feature a modern Hawaiian aesthethic.This is a spa treat worth considering if you plan to stay at the OW. Be sure to ask for a room near the express elevator so you can walk out of your room and take a direct lift to the spa (which is also next to a really great exercise room with all the modern cardio equipment).", "title": "Not what I expected for the price.", "helpfulness": 15, "user": "family_vacati0ns", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5299066}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "The biggest drawback to staying at the OW, and its true for many of the hotels on this strip, is that you pay a premium for parking. $18 a day plus tips. Even if you have a fly-car-stay package. Better idea: Take Speedy Shuttle from the airport and use the downtown shuttles to get around to Pearl Harbor or even around the island. For $2 per stop you can go all the way to Halaweia and Kanehoe or Hanauma Bay and back to Waikiki.", "title": "20th anniversary", "helpfulness": 19, "user": "ocboards", "date": "June 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5298475}, {"rating": 5.0, "title": "Great Location", "text": "My husband and I stayed at the Outrigger Waikiki at the end of May 2006 for 5 days on our Honeymoon. The hotel was really nice and the staff were polite & helpful. We were sent a bottle of champagne to celebrate our honeymoon, which was a nice touch. I loved the view from our partial ocean view room - we could watch the beach and the street performers on the street at night. Duke's Restaurant downstairs and the Cheesecake Factory next door are both really good places to eat. Definately try Duke's buffet breakfast - the best buffet I've ever had! My only complaints are the tiny gym (however I hear they are doing construction right now building a much better one) and the ever-present time-share sellers. We got 2 tickets to a nice Luau for listening to a time-share presentation, but that took 4 hours!! Yikes! Highly recommended.", "helpfulness": 5, "user": "Zany17", "date": "June 4, 2006", "id": 5298102}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Stayed at Outrigger Waikiki Dec 28 - Dec 31....Deluxe 1 bedroom suite. Stunnign view of beach and Diamond head.", "title": "Wonderful time", "helpfulness": 11, "user": "Butterflykiss", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6557267, "likes": {"liked": "— Feeling welcomed"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "We were amazed at how fast they get you and your luggage out of the car and check in was not even a 5 minute wait.", "title": "loved the outrigger", "helpfulness": 10, "user": "stacy13", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6520635, "likes": {"liked": "— close to beach and shopping and evening events", "disliked": "— there was nothing that i did't like"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Room was large, clean and comfortable. All the staff we encountered we very friendly and welcoming", "title": "Not as great as expected", "helpfulness": 2, "user": "mosier", "date": "December 29, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6515978, "likes": {"liked": "— On the Beach", "disliked": "— Mediocre Hotel, more like a 2 star"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Our original plane was cancelled becauseof weather and they were very responsive in working with our new dates. I could not have asked for more.", "title": "Great resort", "helpfulness": 4, "user": "HawaiiKelownaB.C.", "date": "December 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6501513}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Beach wasn't too bad during the week but the weekend was extrenely busy for space.", "title": "Awesome Place to Stay", "helpfulness": 14, "user": "Towknee_P", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6470442, "likes": {"liked": "— The view and location", "disliked": "— The odor as you past Duke's along the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Arrived the first week of October 2006. We were immediately taken with the friendliness of the hotel from the bell people to the registration desk.", "title": "Special place", "helpfulness": 10, "user": "KamloopsTrekker", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6033907, "likes": {"liked": "— Great staff, food and security.", "disliked": "— Small lanaie."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The lobby was lovely and Hula's Grill has the Best Breakfast on Waikiki!!", "title": "Loved my stay", "helpfulness": 10, "user": "studiorack", "date": "October 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6029570, "likes": {"liked": "— Location and clean", "disliked": "— Parking fee"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The rooms were very nicely decorated and felt secure. The safes were free and local phone calls were free.", "title": "Perfect Stay", "helpfulness": 8, "user": "luvcruzin", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6031869, "likes": {"liked": "— Location right on the beach.", "disliked": "— The pool area is small."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The concierge were very friendly and helpful as well as the tour booking staff.", "title": "Great place to stay", "helpfulness": 3, "user": "dsegers", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6026259, "likes": {"liked": "— The location - very close to everything", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The lanaie was small.", "title": "Love the Outrigger Waikiki!!!", "helpfulness": 13, "user": "Debbieb_96", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6025841, "likes": {"liked": "— Location, view, hotel hospitality, everything!!!!", "disliked": "— not a thing, all great!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "From the minute we arrived to the day we left this hotel was fantastic. The Christmas decorations were bright and colourful. We've never been to a warm climate at this time of year and weren't sure how we'd feel. No need to worry, it was great and we'll do it again.", "title": "Christmas", "helpfulness": 3, "user": "SL.123", "date": "January 10, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23429417, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The staff are very friendly and do their best to accommodate you at a very busy time of year.", "title": "We loved the Outrgger Waikiki", "helpfulness": 5, "user": "sjl96", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23379023, "likes": {"liked": "— Location & service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The location I don't think could be better, on the beach and near all the shops and restaurants. Beach services are good if a little on the expensive.", "title": "Best Hotel in Waikik - Family Friendly", "helpfulness": 4, "user": "Motek23", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23361103, "likes": {"liked": "— Staff was very accomodating and location location location", "disliked": "— non-heated pool"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Our room was on the 16th floor with a partial sea view, very nice thank you. I agree with some of the the other reviews when they talk about the thin walls. We could hear people chatting as they passed our room and it goes with out saying they must have been able to hear us. Never was a problem at night and we slept soundly in comfortable beds every night. The room was large, well furnished and thoroughly cleaned daily.", "title": "busy, busy, busy", "helpfulness": 2, "user": "HonestEssex_England", "date": "January 6, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 2.0}, "id": 23303029, "likes": {"liked": "— Cleaniness", "disliked": "— Far too busy"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Cheesecake Factory is virtually next door but like all of them, very busy. The hotel has very good restaurants and bars for all meals. The breakfast buffet is particularly good.", "title": "Great location!", "helpfulness": 1, "user": "cmcg0981", "date": "January 4, 2009", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 23266285}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed at the Outrigger Waikiki on the Beach from Oct 25th to Nov 3rd 2007. There were initally problems with our reservation, we were to get a room with a King size bed, but they could not provide us with that so they gave us a free upgrade to an Oceanview room. The hotel is very clean, and very secure. A security feature that I really liked was you have to use your room key to go up in the elevator. Anyone can go down in the elevator to the common floors but to go to the guest areas you had to use your room key. I would suggest that they extend their checkout time to match your flight times. We had to check out at Noon, and we were not getting picked up to return to the airport until 7:45 PM. While they did store our luggage for it would have been nice to keep the room until about 5 pm, especially since we did not check in until 5 pm the day we arrived due to a mid afternoon flight arrival. We did inquire about keeping the room until 5 PM and they wanted to charge us an additional $180 for 4 hours, which is outrageous. All in all I would recommend this hotel to anyone travelling to Oahu, it is a great hotel, with great service", "title": "Aloha", "helpfulness": 3, "user": "pandora407", "date": "November 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10752139, "likes": {"liked": "— The Hotels Security", "disliked": "— The check out policies"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "After noticing the Outrigger reef was under renovations and needing a stopover hotel for 2 nights after a 5 week trip through Canada and the US i chose the Outrigger Waikiki.", "title": "The spirit of Aloha is well alive here!", "helpfulness": 6, "user": "Harvsman", "date": "November 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10741502, "likes": {"liked": "— Beautiful rooms", "disliked": "— The pool closed too early!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "As soon as i arrived by shuttle the bellman took my bags and i was greeted personally by a man who presented me with a lei, checked his clipboard to tell me they had my reservation on record and then directed me to the Check In Desk.", "title": "Loved this hotel!", "helpfulness": 6, "user": "LABPennsylvania", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10704271, "likes": {"liked": "— The spaciousness of the room and the tropical decor. Loved everything about the hotel!", "disliked": "— Our room had partial ocean view, but also looked right into the rooms of the adjacent hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "As someone said you sit down to check in which is a nice touch and a little different as that's the first hotel i've been too that does that.", "title": "Great hotel for all travelers", "helpfulness": 5, "user": "luke90", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10626284, "likes": {"liked": "— the view, location, staff", "disliked": "— small rooms"}}, {"rating": 4.0, "title": "It is what it Is", "text": "The check in agent offered me a room upgrade from a city view to a full ocean view as part of a \"Deal\" they had. I decided to go for it and ended up with Full Ocean View on the 15th floor for an extra $300 US for the 2 nights i was there! I'm so glad i did that my room was wonderful!", "helpfulness": 7, "user": "Mark_Stevie", "date": "November 4, 2007", "id": 10592746}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Read reviews before we went and I must say I was apprehensive. Boy I don't now where some of these folks stayed but our room was large, our bed comfortable and king size. The construction was only annoying during the day time working hours but who is at their hotel at that time. Much to much to see and do and if on the beach you don't hear it. We toured the Island, shopped and ate out way through the Island. The people were friendly and we were very comfortable asking any question we had. Okay the bathroom was a little small but two average sized people could shower together. We had no problem with mold in our shower area. I was expecting black all over the place. They must have been much to picky or in the older part. The food was excellent and on our second morning at breakfast we ran into people form our home town that live 3 blocks from us. It's a small world. After all the construction is completed this is going to be the place to go and stay. More than it already is. We are hoping to go back soon. Our humidity here is so bad I miss the freshness of the Islands. And those rain showers were just little mist drop falling from the sky. When you looked up into the sky the sun reflecting they looked lke little diamonds or may be these are really the tears of Pele....", "title": "Loved it!", "helpfulness": 10, "user": "boston530", "date": "July 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5463083}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "July 1 - July 8th Loved it loved it loved it.", "title": "Loved Outrigger, Great Location, Try Dukes Canoe Club", "helpfulness": 8, "user": "cat1450", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5460221}, {"rating": 4.0, "title": "Great Vacation", "text": "Indiana", "helpfulness": 16, "user": "nydiao", "date": "July 7, 2006", "id": 5438330}, {"rating": 5.0, "title": "We highly recommend the Outrigger on the Beach!", "text": "This was a great hotel, perfect location and good amenities at a reasonable price. Duke's canoe club inside the hotel is great for lunch and drinks at any time during the day. If you go, try the crab and macadamia nut won tons and the chicken quesadillas. Rooms were clean and nicely appointed. Outrigger is located in the middle of the main strip of hotels, so within walking distance of good shopping", "helpfulness": 30, "user": "A TripAdvisor user", "date": "July 4, 2006", "id": 5425544}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "I selected this hotel based on the reviews I read. It's location is great! Right in the middle of the action. This is great when your traveling with two teenagers. However if your looking for tranquility and no noise then select another Island not another hotel. Most of them are right on the strip, at least the nicer ones. The International Market is right across the street along with Macy's a whole bunch of designer stores and a lot of other stores. Lots of Restaurant too! You don't need a car but we did rent one. We used it almost everydate. Parking is expensive $18/day. The hotel staff is very friendly and always willing to help. My only negative comment would be the noise you can hear outside of your room. They need doors that are soundproof. Other reviews had indicated noise heard from the walls but that's not what I experienced. Couldn't hear anyone from the adjoining rooms. Only heard noise from the hallway. Room was fine. We were four in total and were fine with just one room. The room had two double beds and a pullout sofa. Our City view room had a partial view of the ocean. I wouldn't pay for ocean view. If that's what you want just go to the deck or the beach. Note: if you can get a room from the 14th floor and above it's the way to go. Floors 14 and above have a separate elevator. You won't have to deal with the issues other reviewers have mentioned (waiting a long time for an elevatior). For security purposes the elevators do not stop on the lower level after 10 pm. Security roams the floors too. I would definitely stay there again.", "title": "Good for older folks too", "helpfulness": 20, "user": "ragansreach", "date": "July 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5415169}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "When booking this hotel back in Australia I was told by my travel agent that there would definitely be sun shelters around the pool. Well there is there is actually 4 sunbeds out of all of them that thanks to a couple of palm trees actually stay in the shade all day!. When you have paid $400 a night for a room, i don't except to then have to pay an extra $50 a day to get a sun shelter, which is available for hire on the beach. Obviously guests getting sunburnt is not of any concern to the hotel.. I will definitely not be staying here again.", "title": "No Sun Shelters", "helpfulness": 5, "user": "Kat D", "date": "September 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 140092762}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband surprised me with a stay at the outrigger. We had a deluxe oceanfront with jacuzzi on the 12 th floor. The rooms are average in size but have been newly renovated with upscale features. The view was spectacular....we could view the azure v", "title": "Location, Location, Location", "helpfulness": 2, "user": "ocncapt", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140036030}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Blue water, watch the outriggers, surfers and even see the sea turtles in the water. We had breakfasts at Dukes and the Hula grille, both very nice. Get reservations to Dukes as it is a happening place. the staff, especially the valets were so very helpful. If you want a hotel with a big pool area, choice the Hilton Hawaiian as this one is rather small for the size of the hotel.", "title": "Met all of our expectations", "helpfulness": 2, "user": "Sue B", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139956396}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Wonderful team, sensational property in the best location on Waikiki Beach. Great restaurants, lovely pool and really helpful tour desk team. The rooms are kept absolutely spotless and the housekeeping team do all they can to make you feel welcome at all times. Highly recommend this property to all. The ocean front rooms are worth the extra cost, the views are incredible! We will be back!", "title": "Good hotel in Waikiki", "helpfulness": 1, "user": "ktitone", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139855058}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "The staff was so friendly! They were all very helpful. The location is awesome- close to restaurants, shopping, and the beach! There is surfing, stand up paddle boarding, catamarans, tubes, floats, umbrellas and chairs on the beach. It kind of stinks that you have to pay for chairs and umbrellas even though you're staying at the hotel. The restaurant in the hotel was good, I had lunch there and it was delicious. There was live music in the afternoon and everyone was up dancing and having a great time.", "title": "Not the most modern hotel on the strip, but still has it all.", "helpfulness": 6, "user": "series49", "date": "September 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 139792908}, {"rating": 5.0, "title": "Perfect choice!", "text": "Well, after reading many reviews on this site( and others) we decided to stay at the Outrigger on the Beach, from Nov. 24- Dec2.", "helpfulness": 31, "user": "joan1", "date": "December 4, 2006", "id": 6333457}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We wanted beach front, good location, nice clean rooms , restaurant choices and a nice view. All that for less then 200 dollars a night.", "title": "Loved It!! ", "helpfulness": 19, "user": "mrshb97", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6175578, "likes": {"liked": "— The beach", "disliked": "— right on busy street"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We got it at the Outrigger on the Beach. We paid 198. and got breakfast thrown in also. Great deal, the breakfast buffet was definately excellant, made on the spot omelettes, fresh fruit, yogurts, granola, fresh baked goods, french toast( very good) waffles with warm strawberry syrup( filled with strawberries!) bacon, sausages( two kinds) eggs, eggs benedicts, etc, etc, . We had breakfast there 7 days in a row and never got bored!", "title": "oh, the sunsets!", "helpfulness": 19, "user": "Shi Hu", "date": "November 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6172570, "likes": {"liked": "— pleasant staff and fine location", "disliked": "— noisy room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We had room 1220, which we loved, not ocean front, but full ocean view, it was clean, had two double beds, and a sofa, plus a desk and a decent sized bathroom( only a half tub though, but we never use the tub on vacation, just shower) Mini fridge, iron and board, hair dryer, and safe (free) all in room also. Lots of closet space. We recomment staying on a higher floor just to avoid any noise , we think anthing about 8 or 9 would be fine.", "title": "Lots of problems", "helpfulness": 16, "user": "pompom616", "date": "November 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 6158654, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We requested and got, a room facing Diamond head, thank goodness as the rooms on the other side get awful noise from a roof fan on the Cheescake Factory. We could leave our door open at night and hear the waves crashing!", "title": "Excellent time", "helpfulness": 21, "user": "BWeed", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6139056, "likes": {"liked": "— Pool right next to beach", "disliked": "— Thin connecting door to next room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My wife and I stayed here for our honeymoon from June 18 - June 23 and had a great time. Our room was on the 4th floor with a partial view of the beach and has the perfect location. Right across the street from the International Market Place, right on the beach, easy walking distance for dinner or souvenirs. The Outrigger has so many stores within its complex, you really do need to go far for anything. We ate at Duke's and the Hula Grill and both were excellent. Other places we liked for dinner were The Cheesecake Factory and Nick's Fishmarket. Try the Mac Nut Crusted Mahi Mahi. For a cheap breakfast, try Keoni's and the Seaside Bar and Grill for under $3.00. You won't be disappointed with this resort.", "title": "Excellent Resort", "helpfulness": 1, "user": "Ortiz8384", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8052791, "likes": {"liked": "— Right on the beach in Waikiki"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "We stayed at the Outrigger Waikki for 3 nights of our honeymoon in June, 2007. It was our first three nights in Hawaii, so I splurged on an Oceanfront room with a jacuzzi. Much more than I would normally spend, so was expecting something special. Overall pretty pleased, but there are definitely better values out there (we used Hotwire later to stay at the Waikki Parc and enjoyed that too, for far less.)", "title": "Great stay overall", "helpfulness": 3, "user": "bushido", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8030491}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "Upon arriving after 10 hours of traveling, the staff was great. The valet took the car, bellhops grabbed the bags, and we checked in pretty quickly despite some computer issues. Our impression of the staff overall was very positive, including their quickly delivering a suprise gift from friends.", "title": "great location", "helpfulness": 2, "user": "doozerkilkenny", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 7973908}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed on the 13th floor (which has a handy express elavator for the top couple floors). The room was nice, with a king-sized bed, desk, and great view. The bathroom is large, has marble counters and was comfortable. The jacuzzi has funky sliding doors that can make it part of the bathroom or part of the room. The lanai had 2 chairs & a small table, and a great view. Not a huge room, but very comfortable.", "title": "great location right on Waikiki Beach", "helpfulness": 6, "user": "travelmutt1", "date": "June 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 7834619, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "They room cleaners always did a very good job, and the turndown service / additional tidying was helpful, considering how much sand we tracked with us.", "title": "A bit dated.", "helpfulness": 4, "user": "ocalllo", "date": "June 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7833682, "likes": {"liked": "— Large room and right on the beach", "disliked": "— noisy and a bit 'in your face'"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed in an Ocean View room at the Outrigger Waikiki on the Beach and this place was excellent. The room was very spacious, clean and a nice view of the beach and Diamond Crater from the small balcony. No noise issues at all. Very happy, friendly and helpful staff. Duke's bar a great place to sit and relax with a drink or two at the end of the day, listen to the entertainment and watch the sunset. Hula Grill - great meals and fantastic atmosphere.The location of the hotel is perfect, across the road from the International Marketplace and close to all the trolley's pickups and shops galore and of course the beach is right on your doorstep or relax around the pool. Very impressed with this hotel and would highly recommend. Mahalo Outrigger Waikiki on the Beach!!!.............Kel and Helen", "title": "Outrigger Waikiki", "helpfulness": 1, "user": "Helen H", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139715439}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The wife booked a Deluxe Ocean Front-One Bedroom Suite for just the two of us. The difference between the Ocean Front Suite and the Deluxe Ocean Front Suite is that the deluxe model is on the Diamond Head side of the property providing an outstanding view of not only Waikiki but Diamond Head too! We think that the Diamond Head side is worth the extra cost.", "title": "Best Room at Outrigger Waikiki", "helpfulness": 3, "user": "Bobss", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139687904}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The living room, bedroom, and two (yes two) baths were appointed nicely. And, one of my big things, we had a clean, comfortable bed.", "title": "Great Experience", "helpfulness": 1, "user": "Gailsusan", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139533055}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The Staff was very friendly, helpful and the service was super from the Front Desk (check-in/check-out), housekeeping, and Bellmen. We tried the Hula Grill for breakfast on our first morning and was very pleased. I had my first \"Loco Moco\" Breakfast - try it if you haven't already. Duke's is also a good place to eat. We didn't have a chance to eat there this time but have been there before while staying at another hotel. If you like chocolate and ice cream, be sure to try a \"Hula Pie\" at Duke's - YUMMY!", "title": "Great Location and Service", "helpfulness": 2, "user": "travelandeat_99", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 139527506}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Travel Desk was very helpful too, but be careful of the offer to have $100 knocked off your activities for spending a couple of hours in a time-share presentation - unless you like time shares- or you and your spouse can resist the sales pitch and think that the hundred bucks is worth your while. It's not billed as a time share presentation, but that's what it is. When you've been around for a while you know how to say No, but I am concerned about the younger folks that haven't been bitten yet. Unfortunately, this goes on most everywhere now.", "title": "great location", "helpfulness": 1, "user": "Bruce N Nancee R", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139524317}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I just returned from a 9 night stay at the Outrigger Waikiki.", "title": "Never, ever again", "helpfulness": 17, "user": "CelesteD", "date": "October 5, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 5920915, "likes": {"liked": "— comfortable bed and pillows", "disliked": "— walls so noisy, it didn't matter what the bed was like"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The main problem was noise in the walls...it was really bad. Anytime someone flushes the toilet, you can hear it in a very loud cascade of watery pipes in the wall. Enough to wake you up, which happened a lot throughout the night, every night. Bring ear plugs. Even my husband was awakened, and he is a very heavy sleeper. It doesn't matter where the hotel is, if you can't get a good night's sleep. This is the noisest hotel I have ever been to, ever. When I commented to the concierge, he merely laughed and told me the hotel has the best location.", "title": "Absolutely Superb in every way!!", "helpfulness": 12, "user": "KaylaP", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5912631, "likes": {"liked": "— Everything!", "disliked": "— Pool area could be slightly bigger, but you have the beach on your door step who wants the pool!!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I also felt lied to about the room. We purchased an \"ocean view\" room. I am posting photos of this \"view\". Upon looking out the window, all we could see was the next door hotel. You have to actually lean out over the rail to get the promised ocean view. The lanai is small and situated so that only one person can ever see the view. If it had been billed as partial ocean view and priced accordingly, I would not have been miffed. We purposely booked a room for ocean view, and feel that Outrigger misled.", "title": "Thoroughly enjoyed our stay", "helpfulness": 10, "user": "Domil", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5898866, "likes": {"liked": "— Location", "disliked": "— Lifts"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The room itself was very nice, and the bedding comfortable. Housekeeping was ok...we did not get toilet paper restocked on 3 days and had to call twice when we ran out.", "title": "Almost above average overall, but You need to be quiet in your own room", "helpfulness": 12, "user": "gena536", "date": "October 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5895364, "likes": {"liked": "— Location", "disliked": "— Thin walls, can hear the noise from the outside even with the doors closed"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Where do I start about this hotel, awful, awful, awful! I cant believe how many good reviews it has to be honest, I thought it should be rated 2/3*. I had been informed that the hotel had recently been modified, but I dont know where exactly.", "title": "Dont stay here if you want a nice holiday!", "helpfulness": 6, "user": "RCBD", "date": "July 11, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8098886, "likes": {"liked": "— Nothing", "disliked": "— It was all awful!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We traveled to Hawaii for our honeymoon, stopping at Las Vegas on the way to Hawaii staying in the Bellagio, I dont know whether we were comparing this hotel to the Bellagio, but after feeling like royalty there when we got to our room in the Outrigger it seemed like a hostel compared to the Bellagio.", "title": "Great location, starting to look a bit tired", "helpfulness": 6, "user": "Verona7621", "date": "July 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8098774}, {"rating": 5.0, "title": "Best Anniversary Stay", "text": "At check in we were waiting around for a while until a desk was available, we were told we had a room upgrade from a partial ocean view room to a full ocean view room, which we were pleased about.", "helpfulness": 2, "user": "Lancaster_pa_Sstorm", "date": "July 10, 2007", "id": 8097025}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "When we got to our room we were situated right out side the lift, so every morning and evening when people came back to their rooms we were woken up, it was sooooo noisy, the walls must be paper thin I have never stayed in a place quite like it. You can hear what everyone is up to in the rooms beside and above you and are woken every time someone flushes the toilet.", "title": "Loved it", "user": "wvugirl2005", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8065341, "likes": {"liked": "— Ocean view, access to shopping, wonderful treatment", "disliked": "— nothing!!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "When we entered our room we were so disappointed, the room was dated, shabby, the balcony had all paint peeling off it, the bathroom was just awful, with no light in the shower so you basically had to shower in darkness once you had pulled the shower curtain across. And so much for the full ocean view room it was still a partial oceanview room, we hadnt been upgraded at all. I did complain about this at reception but they basically said that they didn’t have another room for us, we could have upgraded to a full ocean suite but that was going to cost an extra $150 a night! We had already paid a fortune to stay in this hotel.", "title": "Outrigger Waikik on the beach", "helpfulness": 3, "user": "TONYADAVIS", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8063616, "likes": {"liked": "— Location location", "disliked": "— I Had to Leave"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband and I just returned from HI and a stay at the Outrigger Waikiki. The hotel is in a very central Waikiki location. The International Marketplace is directly across the street and shopping and restaurants are all up and down Kalakaua Ave (the street the hotel is on). The beach is right outside your door and Dukes on the ground floor is always hopping. For a quieter time, try the Hula Grill, especially on Friday or Saturday night when they play Hawaiian music.", "title": "Great Location", "helpfulness": 9, "user": "hulamaiden", "date": "September 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5889682, "likes": {"liked": "— Location", "disliked": "— No late check out"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The beach although crowded is still wonderful-and you can't beat the warm Pacific. If you have little ones or are timid about the ocean, there is an area in front of the Royal Hawaiian hotel that is very shallow. Better yet, down the street there is a great beach park that has a storm wall and a very calm shallow pool.", "title": "Outrigger on the Beach is a good bet.", "helpfulness": 5, "user": "Walter W", "date": "September 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5889532, "likes": {"liked": "— Location", "disliked": "— Having to pay $250/night"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "One of the highlights was seeing Aunty Genoa Keawe sing at the Moana Terrace on Thursday evening. She is consdiered the first lady of Hawaiian falsetto singing and at 87 can still hold a note for what seems like an impossibly long time-amazing.", "title": "Never Again!! Ever", "helpfulness": 11, "user": "~14Alice41~", "date": "September 27, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5881200, "likes": {"liked": "— Sign In", "disliked": "— Insects and Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Second time here, came back for our 20th. Very nice hotel with a perfect location, across from the International Market and next to all the surfing. The room (2 doubles) perfectly sized and the view was (ocean view Diamond Head) adequate. I would ask if you could be placed as high as possible and as close to the beach, it offers a better view.", "title": "Awesome location and view!", "helpfulness": 7, "user": "MannMom", "date": "September 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5880962, "likes": {"liked": "— Right on the beach, great views!", "disliked": "— Some noise from people on the beach all night long!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The beauty of the Outrigger is the music. Dukes is their open air bar on the beach and every evening a band is playing island music which carries offshore. Sitting on their beach, watching the sunset, and listening to a band, nothing is better. If you want to try to learn to surf, walk over to the surfing area, the Outrigger lesson rates are a bit too high at $45/hour for a group lesson. Got a private lesson for $35 next door at the park.", "title": "Best Hotel on Waikiki!", "helpfulness": 6, "user": "Barbqman1", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5822625, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed here in June for our belated honeymoon. We booked this last minute through their website. Their service from the start was great. They accomodated us when we had to ring and cancel the first night due to a delay caused by United at LAX. After 24hrs travelling time - they were very accomodating and tried to get our room available as soon as possible. We were upgraded to a ocean view which was unexpected surprise. The little touches like the newsletter with the individual welcome was a nice. The guest excursion services were very helpful and knowledgeable. The location of the hotel was very central and right on the beach. The hotel guests were a real mix from families, teenagers, couples and hooneymooners.", "title": "Loved it - all smiles and great service", "helpfulness": 4, "user": "Manilaice", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8378344, "likes": {"liked": "— Location, Service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "You don't need to to do car rental as you can get around most of the sights (Pearl Harbor, Diamond head) by the BUS. We only rented a car for 1 day to explore the north of the island. Don't miss out on the other beaches and shaved ice.", "title": "Exactly As Advertised", "helpfulness": 8, "user": "PeterSydney80", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8358423, "likes": {"liked": "— View", "disliked": "— Room Service"}}, {"rating": 5.0, "title": "Great!!", "text": "We would highly recommend the Paradise Cove Luau.", "helpfulness": 6, "user": "cptlarry", "date": "August 2, 2007", "id": 8282340}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Also a must for breakfast is Eggs & things.", "title": "Great location in the Heart of Paradise", "helpfulness": 3, "user": "Frbill92", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 8230884, "likes": {"liked": "— location in central Waikiki", "disliked": "— Condition of room on my arrival"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We ate at the hula Grill on our last night and the food was great!!", "title": "Costa Del Hawaii", "helpfulness": 6, "user": "Lifes_a_beach_7", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8220555, "likes": {"liked": "— View", "disliked": "— The lifts were very poor, and took ages to arrive even late at night."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Check-in was aggravating because they do not have a normal desk. They have desk clerks seated far apart from each other at a very long desk. This resulted in confusion when checking in. One man sailed past a line of 3 parties with luggage waiting to check in, straight to the clerk who had just came available. I figured he did not see us all standing here and I politely (I promise, politely!) stated that there were 3 different groups of us there waiting. He proceeded to insult me. The hotel staff did nothing and he was waited on ahead of the line.", "title": "Great experience at the Outrigger Waikiki", "helpfulness": 5, "user": "Kyle77323", "date": "September 30, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5894477, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "November 6, 2008", "title": "Fabulous Time at the Outrigger Waikiki", "helpfulness": 2, "user": "Legal12", "date": "November 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21601393, "likes": {"liked": "— The hotel in general, location and wonderful staff.", "disliked": "— The partial ocean view room with the noisy air condition at the Cheesecake Factory"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "My husband and I spent four wonderful days and nights at the Outrigger Waikiki last month. The hotel was beautiful and clean with a great room. The staff was extremely helpful and courteous. Can't say enough about it! Duke's Restaurant is also a great place to dine as is the Hula Grill with the beautiful view - especially for breakfast when it is nice and quiet on the beach. Our only disappoint was we had a partial ocean view and we really could not sit on the porch without hearing the loud air conditioner from the Cheesecake Factory - we didn't spend that much time in our room but when we did want to sit out at night it is quite noisy. We were celebrating our 40th wedding anniversary and renewed our vows at the Outrigger Reef which I would recommend to anyone going there for an anniversary. A beautiful ceremony on the beach - we even had a rainbow! All in all a beautiful time in a great hotel. We went on to Maui after Oahu and found it to be a much more relaxed island without all of the shopping and traffic of Oahu. However, still had a wonderful time!", "title": "Wonderful Hotel", "helpfulness": 6, "user": "tawill", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21574780}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My friend and I stayed at this resort 10/26 – 10/30/08. Here is our view of the hotel.", "title": "A great hotel - right on the beach", "helpfulness": 2, "user": "Sequin-Sue", "date": "October 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21400179}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "CHECK-IN: Super easy & fast. When you pull up to the curb in front of the hotel, the bell hops will meet you, tag your bags, get your name and advise you to proceed to the lobby. Once you walk into the lobby, they call you by name right away to come and sit down for check-in. Only took a few minutes. We booked a city view room (cheapest) and were told at check-in we were getting a free upgrade to a partial ocean view since we had previously stayed at an Outrigger resort. I had emailed the hotel a few weeks before arrival and asked that we be put on one of the top floors and also on the opposite side of the Cheesecake Factory fans based on all the reviews I had read. They replied back that they couldn’t guarantee it but all rooms are assigned the day before arrival. We were pleased that our requests were honored. We were on the 14th floor, opposite side of the Cheesecake Factory. Also very pleased to be away from the elevators and the ice machine. Our view from our balcony was nice. I’ve attached a picture.", "title": "Nice rooms, beautiful beach", "helpfulness": 1, "user": "GatoRat", "date": "October 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21081170, "likes": {"liked": "— The Beach", "disliked": "— Noisy Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "ROOM: Nice and roomy enough for 2 people. We requested and had 2 double beds. There was also a sofa and desk, which served as our bar. There was a nice large walk-in type closet off the bathroom vanity area. Also another closet in the hallway with sliding doors that had full length mirrors on them. The shower and toilet were separated from the vanity area by a sliding door. Small tub, which would only be big enough to bath a small child but that didn’t bother us as we are shower people. Vanity is good sized, nice granite counter top but not very well lit, as some have mentioned. You also have a large safe, mini-fridge that is rather good sized for a hotel, hair dryer, coffee maker, etc. Some reviews have said the décor is dated. I didn’t think so at all. It’s tropical. You’re in Hawaii, what would one expect? The A/C worked well but you need to shut your lanai sliding door in order to get it to come on.", "title": "Lovely Hotel", "helpfulness": 4, "user": "wendy-brian", "date": "October 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20988074, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "A lovely hotel, GREAT staff, terrific restaurants, and what a location! BUT, if you want to sleep on your vacation...this property is not a good choice. Walls are paper-thin between rooms and you can hear EVERYTHING going on in the adjoining rooms (on either side, and above). After reporting concerns to the front desk they said we had to call them as soon as we heard the noises (which were more or less non-stop) and they would send Security to investigate...not really something we want to become involved/engaged in during our vacation. People in other rooms were not being that unreasonable...the hotel just needs to do something about soundproofing. There was also a gaggle of \"musicians\" making noise for donations directly in front of the International Marketplace (right across the road from this hotel). The drum, electric guitar and steel drum solos carried on until after 2:00 am, making it impossible to have a window open. We spoke with hotel security staff at the entrance and they said there was not really anything they could do about it. It was obvious that we were not the only ones being bothered as we witnessed others voicing similar complaints. I would think the surrounding hotels would be taking steps with the local authorities to establish some guidelines. We spoke with the police at the Waikiki Beach detachment and they had received similar complaints that same day. We live in the heart of downtown Vancouver in a condo and are not unreasonable about city noises, but between the poor sound proofing and the unregulated noise makers across the road we did not get one night of sleep in two weeks! So, if you are hoping to get any rest during your stay in Waikiki I would personally not recommend this otherwise lovely property.", "title": "Wonderful EXCEPT for the noise....", "helpfulness": 3, "user": "J_CVancouver", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 23086072, "likes": {"liked": "— Staff, location, nice decor etc", "disliked": "— No sleep....very noisy!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "We were extremely satisfied with the Hawaiian hospitality.", "title": "Loved the outrigger on the beach", "helpfulness": 1, "user": "mollydog7", "date": "December 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22929713, "likes": {"liked": "— close to everything", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel was great the service fantastic We would stay there again and again", "title": "Great vacation", "helpfulness": 2, "user": "pfed", "date": "December 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22480546, "likes": {"liked": "— Rooms were very well kept and up to date. Great Views!", "disliked": "— thin walls, noisy housekeeping staff near the supply closet, noisy A/C unit at the hotel next door, timeshare people"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "This is my second time staying at the OWB, after our stay 2 years ago we vowed we wouldn't stay anywhere else.So many great things about this hotel, free calls to USA and Canada for keeping in touch with family (this came in handy) booking activities, rental car, transportation etc through hotel, literally a one stop shop. I found that our hotel had the best restaurants in Waikiki Beach, we kept returning after walking the strip because nothing could really beat the views and the quality of food, Chucks, Dukes and Hula grill were fantastic, the store in the lobby came in handy as well with bottled water very reasonably priced and accessible near the beach and our room. My only disappointment this time were the thin walls, I never realized it as a much during our last stay but we were kept up at night with the sound of flushing toilets, people bathing, talking etc. we were situated right next to the maid supply closet and trust me they weren't quiet when speaking to each other. If you do stay here and realize you are in a room ending in \"00\" maybe request a room change, all the floors with \"00\" for (200, 300, 400) have the supply closet next to it which is accessible at all hours of the day by the janitorial staff, Also these same rooms overlook the roof of the Royal Hawaiian hotel that is undergoing a huge reno and their A/C fan is on the roof deck right outside of the \"00\" rooms and is extremely noisy . We mentioned this to the hotel staff and they quickly switched us into another oom, aside from the thin walls that all the rooms have, I was again a delited guest, service was great! Oh and another thing to be aware of is there is a pushy timeshare person offering discounts right next to the activities desk so be aware when booking an activity through the hotel that you may be bugged 1 second later by a timeshare rep telling you that they can give it to you for free if you attend a session of theirs. Which I found kinda unfair to the hotel activities sales people who were very helpful.", "title": "Outrigger fantastic!", "user": "gcjw", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22418937, "likes": {"liked": "— location, room size, cleanliness", "disliked": "— can't think of one"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Far exceeded our expectations. Was decorated for Christmas, very festive. All staff very friendly and helpful. Rooms very clean and quiet, and much bigger than expected. Was told we had a city view room when in fact our room had a great view of the ocean from our balcony. Great beach access. Dukes restaurant OK, LOVED Hula Grill!! Don't rent a car from the airport. Rent a car from hotel for the day. Don't need a car unless you want to explore the island. Will absolutely return in the future. Vancouver, WA", "title": "superb hotel for beach location", "helpfulness": 1, "user": "nickss1", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22353432, "likes": {"liked": "— location - right on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Outrigger Waikiki is a fantastic hotel. The position is superb, the staff are so friendly and certainly the best place to stay on Waikiki Beach. Umbrellas are lacking and should be available around the pool. We stayed there twice in the same month and both rooms on the 11th floor were fine.", "title": "Best location, amazing service and best value", "helpfulness": 3, "user": "Wendy F", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139448540}, {"rating": 5.0, "title": "Excellent location and service", "text": "My stay of10 nights at The Outrigger Waikiki on the Beach was wonderful! My Partial Ocean View room on the 14 th floor was very comfortable ,quiet and recently renovated. Staff are very helpful and cleaning was excellent! Best place to stay , right on the beach in Waikiki, good value , close to the best shops and restaurants such as Dukes and the Cheesecake Factory! I traveled with my elderly parents who were accommodated in the room next door , which was very convenient for us.They were very pleased with the hotel service and location. I will definitely be back!", "helpfulness": 2, "user": "minky92", "date": "September 3, 2012", "id": 139218742}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed at Outrigger on the Beach Wakiki. On arrival we were told we in \"luck\" as we had been given a partial view room on 7th floor. I would hate to be unlucky. This room was very small with the word\"partial\" being appropriate. Room was overlooking the roof of the building next door and nothing but their generator could be heard all night.", "title": "Lucky for location", "helpfulness": 3, "user": "Brad D", "date": "September 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 139213107}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Went out onto to very small balcony, but far too noisy and back inside and closed the door.", "title": "Excellent value for the view and location", "helpfulness": 1, "user": "pickygirl09", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139172841}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Only thing positive is the location, short walk to beach and to Duke's Restaurant.", "title": "Great location", "helpfulness": 3, "user": "tsb123", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139118153}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My husband, son (19) and I just returned from Honolulu at the end of last week and had gone to Turtle Bay Resort for the first part of the trip and then decided to spend 3 nights in Waikiki at the Outrigger. We really enjoyed ourselves. The service was excellent in the resort as well as in Duke's, the restaurant, on the premises. We ate breakfast there one day, dinner their one night and lunches every day. You couldn't beat the ocean view from Duke's. Our room was a partial ocean view. It was fine except there wasn't a full bathtub--only a half-bath with shower. Everything was very well maintained but could do with a facelift. The lounges around the pool were a little tired and unfortunately there were no umbrellas around the pool if you wanted shade. You would have to rent them on the beach for $50U.S. The location on Waikiki Beach was perfect. Lots to look at in the evenings after dinner--shopping etc. One of the things we appreciated most about the Outrigger was that they gave us a room to shower and get ready for our late flight on our last day. We weren't flying out until 1:30 a.m. and had to check out in the morning so they stored our luggage and when we were ready to shower and leave they gave us a room for 30 minutes to get ready. This was wonderful. Would recommend this resort for those wanting to take in Waikiki Beach!", "title": "Really enjoyed it!", "helpfulness": 4, "user": "RuthB", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7708817, "likes": {"liked": "— Location", "disliked": "— A little tired!"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Yes, location is good if you want central Waikiki, but the following pitfalls would make us stay somewhere else next time:", "title": "Beware the pitfalls !", "helpfulness": 6, "user": "Micwa", "date": "May 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7705547, "likes": {"liked": "— Location", "disliked": "— Quality of room (especially the noise factors)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "* Walls are paper thin (this is quite true). Could hear conversations next door).", "title": "Great place to stay!", "helpfulness": 5, "user": "Laurem29", "date": "May 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7668932, "likes": {"liked": "— Great location.", "disliked": "— Had to pay for beach chairs."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "* Initial room with adjoining door let in a ridiculous amount of noise.", "title": "Perfect Oahu honeymoon hotel", "helpfulness": 18, "user": "portnoyd", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7641012}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "* Rooms on Cheesecake Factory side do get a lot of noise from the outside aircon vents.", "title": "What a view!", "helpfulness": 6, "user": "pastyman", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7615951, "likes": {"liked": "— The views", "disliked": "— a touch noisy from the entertainment below"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I booked the Outrigger for the majority of our honeymoon stay in Hawaii. Of course, we read many reviews on trip advisor before going, so we weren't sure exactly what to expect based on the mixed reviews.", "title": "Loved the Outrigger!", "helpfulness": 3, "user": "mhamelin", "date": "August 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8448987, "likes": {"liked": "— The deluxe oceanfront room!", "disliked": "— Sometimes we could hear noise from our neighbors..."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We had a great time! The first 6 nights we stayed in a partial ocean view room with a king size bed. The room was spacious and the bathroom was very nice. However, being on the first floor, our view wasn't very good. We could see a little of the ocean, but mostly just the building next door. We liked the free in-room safe. The beds were very comfortable as well. The hotel also allows customers free calling anywhere in the U.S.! As honeymooners, there was a bottle of champage in our room the first night.", "title": "Completely positive experience!!", "helpfulness": 2, "user": "stephanierob", "date": "August 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8438927, "likes": {"liked": "— location location location!! right on the beach", "disliked": "— occasional wait at elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "After returning from a few days in Maui, we upgraded to a deluxe ocean front room, and it was definitely worth it! The room has a spa tub and a fabulous view of the ocean (obviously). The room is a bit smaller than the partial ocean view, but still worth it. If you can, upgrade to this room!", "title": "Excellent", "helpfulness": 2, "user": "maddie59", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8435304, "likes": {"liked": "— Location and the hotel iteself", "disliked": "— Rooms a little tight but nothing major"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Maid service was excellent and the staff at the Outrigger was very helpful. We were amazed at how well they handle everyone's luggage with so many people coming and going. The staff was also great about moving our luggage during our stay in Maui. We didn't take all of our bags with us, and when we returned to the Outrigger, our luggage had already been moved for us into our new room.", "title": "Fantastic Hotel", "helpfulness": 5, "user": "Buddy1234", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8417808, "likes": {"liked": "— Service, rooms, restaurants, everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Since I've read other reviews of the hotel, I know that some people complain about the walls being too thin. I was able to hear our neighbors several times, but the noise wasn't so much that we couldn't deal with it.", "title": "Can't beat the location!", "helpfulness": 4, "user": "LillianLM", "date": "August 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8400712}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We just completed a 1 week stay at the Outrigger Waikiki on the Beach and had a great time. All the staff were helpful and friendly. We enjoyed the coolers of ice water with lemon & lime that was available during the day in the lobby - nice touch. The staff & services were top notch. We arrived during the end of a winter wind / rain storm, which was an unusual event.", "title": "Great location & service", "helpfulness": 14, "user": "Rush4", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11587461, "likes": {"liked": "— Location, great staff,", "disliked": "— the pigeons at Dukes"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Restaurants: Dukes & the Hula Grill had to put up tarps to keep the wind & rain out of the restaurant, which was interesting, but not terrible. Not much you can do about the weather, you know? The tarps came down as soon as the weather cleared up.", "title": "Great location, relaxed but professional atmosphere", "helpfulness": 9, "user": "hulahulagirl", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11537769, "likes": {"liked": "— clean, fridge, spacious; fab location; good food on site.", "disliked": "— balcony noise and style; no late room service."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We had free breakfast at Dukes or Hula Grill included in our room price. Dukes had a good buffet - lots of choices and everything kept freshly stocked. At the Hula Grill we had our choice of items from the menu. The breakfast was good here too, but the service was lacking the one day we tried it for breakfast, so we just stuck with Dukes. We had dinner at Dukes once and Hula Grill twice - we actually preferred the Hula Grill over Dukes for the atmosphere and view (and the service was wonderful at dinner). All the pigeons running around and flying around Dukes were a bit unnerving. Especially when they flew & landed on the table (yuck!). We put up with the birds during breakfast , but twice in one day was too much. I guess they were part of the atmosphere (?). The food was excellent in both restaurants.", "title": "Great location", "helpfulness": 3, "user": "sidney14", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 11223920, "likes": {"liked": "— location", "disliked": "— bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Our room was on an upper floor with a partial ocean view . We enjoyed sitting on the patio & taking in the sights. The rooms on that side of the hotel (at least on our floor) are rectangular shaped and a bit smaller than the angled rooms across the hall, but our room was adequate for the 2 of us. It had so much closet space and dresser drawers! We did talk to a man who had a room across the hall, right behind the elevators. He said there was no noise from the elevators at all, but he could hear the fans from the Cheesecake Factory next door. This surprised us, as we were at such a high floor. I do wish there was more light in the dressing area of the bathroom. The lighting is all over the vanity area, and it is dark looking into the closet, and also hard to see if you style your hair & turn your back to the vanity to use a hand mirror to see the back of your head! Housekeeping kept the room tidy & clean, which was nice. We did hear faint noise occasionally (not even daily) from our neighbors and even from the street performers across from the hotel at night, but I think I only noticed because of reviews I had read that said the hotel was very noisy. Although the rooms aren't completely soundproof, we didn't think it was too bad at all.", "title": "Awesome Hotel!", "helpfulness": 3, "user": "zrmmom", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11201767, "likes": {"liked": "— Room was beautiful and very clean", "disliked": "— Beds were small"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We didn't rent a car, so we didn't have to experience the parking fees. We did enjoy the central location of the hotel - so easy to get anywhere we wanted to go! We had a late evening flight home, so we were able to have a late checkout (only 1 extra hour, but better than nothing) and we were able to use a courtesy room to clean up a bit before our trip home. That was a huge plus in our book! We would definitely stay here again!", "title": "Great location", "helpfulness": 10, "user": "sidney14", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 11178079, "likes": {"liked": "— location", "disliked": "— bathrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Spent 3 wonderful days at the Outrigger. When we entered the hotel, we were immediately approached by a very pleasant greeter who led us to chairs to be checked in by another equally pleasant clerk. The people at the Outrigger are well trained in hotel hospitality. Being treated well is as important to me as the cleanliness of the rooms, which by the way were spotlessly clean and beautiful. My room was very large, with large mirrors making it feel even bigger. Although the rooms looked nice online...they are even better in reality! I always use tripadvisor reviews to choose hotels, and so had mixed feelings about this hotel as many reported being disturbed by other guests because of too thin walls. This never happened to me...phew. I must say however, that my room faced the fans of the Cheesecake factory and this noise is not pleasant. However, I would recommend this hotel, but advise others to ask for rooms on the opposite side of the building....and suggest that the Outrigger might want to pay for some sort of noise barrier for roof with the offending noise. All rooms have balonies with chairs and you can see the ocean from each. Went to the hotel bar, Dukes, which is right on the beach and found a very friendly bartender and a fun atmosphere. Had dinner there one night and it was delicious (again, I expected just ok food and was pleasantly surprised by the fresh well cooked fish of the day). They also have an extensive salad bar and Hawaiian wandering singers. This hotel is so welcoming that it made the noisy fan over the cheesecake factory bearable. I liked it better than the fancy resort we stayed in on the north shore of Oahu, although that resort was beautiful, the staff were neither helpful nor friendly.", "title": "Great Hotel with Very Friendly Staff", "helpfulness": 10, "user": "sandysloop", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12357139, "likes": {"liked": "— Right on the beach, friendly staff, nice room, balony overlooking the sea, resonable rates", "disliked": "— Noisy fan from Cheesecake Factory next door."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Just returned form our first trip to Honolulu, and stayed at the outrigger waikiki on the beach.. It was wonderful. The staff was all very polite and helpful, from the housecleaning and bell boys, to the staff at Duke's. There were 20 of us who went and we all got the rooms we had requested, with 2 doubles and a pull out couch. We requested a microwave and received it within 2 hours of checking in, and there was no extra charge for it. They had backpacks and sunglasses for the kids. They also gave us a late check out for 8 p.m. for a minimal charge, and even moved one of us to another room for that day because the other room was booked. We had a city view room but we had a great view of the ocean. Watched the fireworks over the ocean from our room on New Years eve, which was perfect because our kids were in bed sleeping. The hotel was great with the kids. The lobby bathrooms were always clean, so you didn't have to go up to the room from the beach with the kids to go to the bathroom. The pool was deep for little kids, but the sand and beach area in front of the hotel, I think is the best spot on Waikiki. There were two boats right in front of the hotel you could go on for $25 for 1.5 hrs, that includes drinks. The hotel is also right in front of the International Marketplace,could go shopping any time we wanted.The prices in Duke's restaurant and bar, were very reasonable also. A great seafood dinner, with salad bar and fresh ceasar salad for $20. All in all, it was great, and I will definitly go back.", "title": "loved it", "helpfulness": 13, "user": "joan6891", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12339757, "likes": {"liked": "— location and price", "disliked": "— slow elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The location of this hotel just can't be beat! It's literally right in the middle of everything, and the beach access is fantastic. The room itself was pretty standard, but nothing really to complain too much about. The free breakfast buffet every morning was delicious, although it was the same food every single day...", "title": "Best Location!", "helpfulness": 4, "user": "beachyluv", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12303491, "likes": {"liked": "— The location", "disliked": "— Maid service was a little slow..."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This was our first trip to Hawaii, and we were both glad we chose this place over all the others.", "title": "Loooooved it", "helpfulness": 12, "user": "lokysmom79", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12146576, "likes": {"liked": "— Evrything!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "All in all, I would definitely recommend this hotel. (Personally, I would rather save some money and stay at a hotel not on the beach.)", "title": "Loved the Outrigger Waikiki", "helpfulness": 2, "user": "Spydrblt", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11703689, "likes": {"liked": "— The friendly staff and out view", "disliked": "— We have no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "If you want tranquillity or natural unspoilt beach, don’t come to Waikiki; go to one of the other islands, where there are plenty of quiet and beautiful beaches and mountains, great surf and scenery, and not too many people.", "title": "The Classic and Quintessential Waikiki Experience", "helpfulness": 2, "user": "Toofastcat", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 140459515}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "If you come to Waikiki expect a city on the beach, a party on the sand where skyscrapers meet the ocean and there are people: eating, drinking, sunbathing, surfing, swimming in the ocean, listening to bands, and doing whatever makes a vacation. It’s classy in places, a bit trashy in others, but it has a unique style of its own, based on sun, sea, surf and the Hawaiian culture. Personally, I think it is great.", "title": "Fantastic Holiday Location", "helpfulness": 3, "user": "Toni D", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140458980}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I have stayed at a few Waikiki hotels, but a September break in this Outrigger has been one of the best. We got a 14th floor room with ocean view on two sides, and the view was spectacular. The hotel has three restaurants inside, all good: A great Steakhouse, an upscale seafood restaurant and not forgetting the famous Duke’s Barefoot Bar and Grill, named after Duke Kahanamoku, one of the founding fathers of modern surfing. He is certainly well remembered and loved, with a statue of him on Kalakaua Ave by the ocean.", "title": "Perfect Location", "helpfulness": 3, "user": "Mich10Australia", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140440442}, {"rating": 4.0, "title": "Great location", "text": "Our one bed suite was spacious, if traditionally furnished. The atmosphere was great, and you had the feel of being right in the action, or above it, with easy access to the pool, beach, shops, the sunset rock band and more.", "helpfulness": 3, "user": "steady1302", "date": "September 14, 2012", "id": 140280350}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "If you like Waikiki you should like this place. I would certainly come back here.", "title": "Redecoration? really?", "helpfulness": 1, "user": "jpb62", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140263979}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Hotel is very nice. Bellhops waiting outside for baggage when we arrived around 1130 at night after a long flight from the mainland! Check in was a breeze with the individual chairs. Had a room with a King size bed and sofa bed. Plenty of space in the rooms. Bathrooms are amazing. Marble countertops, new fixtures etc. Large closet with safe. We had an onceanview room, which was fantastic. Enjoyed watching the catamarans and surfers in the morning and evening from the lanai. Beach was crowded, but well it's Waikiki enjoy yourself! Try and take your own beach chairs if you can fit them. They cost about $10 a day to rent. Gets expensive. Very convenient location. International Marketplace and mall are right next door. Also convenient to tour bus pick ups (Koa Street). All in all, can't wait. If i ever get the chance to return, would probably stay somewhere else, just to stay somewhere else. would definitely reccoment this hotel. very nice!", "title": "Loved It. Want To Go Back NOW!", "helpfulness": 8, "user": "hawaiiloverPa", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 13069951, "likes": {"liked": "— just being in Hawaii", "disliked": "— corridors were a bit dated."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at the Outrigger Waikiki on the Beach for the first two nights of our Honeymoon in Hawaii. You can't beat the location - right in the middle of everything! We were able to get outrigger canoe rides and a boat cruise right in front of the hotel. And the service was really top notch. We had a partial oceanview room, and I thought the view was decent and worth the upgrade. (See picture.)", "title": "Great location and service!", "helpfulness": 5, "user": "VacationWhen?", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13007377, "likes": {"liked": "— Location, Service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Overall, we were very happy - it's a very nice place!", "title": "First floor fabulous", "helpfulness": 5, "user": "aubry", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12778026, "likes": {"liked": "— location", "disliked": "— crowded beach chairs"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had booked an Oceanview though the travel agent and were offered an upgrade to Oceanfront balcony for $90 additional. Glad we accepted the upgrade. Our room was #127 and all the balconies on this floor are larger because they are over the patio restaurant roof and practically on the beach. Thankfully, there was very little noise from the restaurant. The band played on the patio from 4:00 - 6:00 both nights which were Saturday and Sunday. Don't know if the band plays during the week though.", "title": "Divine Luxury", "helpfulness": 17, "user": "childfree_traveller", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12365637, "likes": {"liked": "— Location!", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The rooms are non-smoking with comfortable beds and fridge. Large shower but no bathtub. Separate sink and make up room with plenty of hangars and a safe. Unlimited long distance calls to the Mainland and Canada was a great feature. Spirits available in the giftshop downstairs.", "title": "a 3 star hotel at best", "helpfulness": 9, "user": "omiek", "date": "January 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 12359597, "likes": {"liked": "— the view sitting whether yoiu are sitting at duke's , chuck's or the hula grill", "disliked": "— lack of customer service"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and booked the Outrigger because we wanted to stay at a hotel that was centrally located and right on the beach. We had also read many great reviews of the hotel on this website so we figured we couldn't go wrong.", "title": "Not worth the money", "helpfulness": 8, "user": "Sun_Worshiper08", "date": "November 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 10512494}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Upon arriving to the hotel we were greeted by a very friendly lady named Jan. Unfortunately, she ended up being the best part of the hotel. Jan informed us that we would be staying on the first floor in a room with a queen bed. Upon booking the hotel in May, we had requested a king bed on a higher floor. I do realize that requests are sometimes not possible, but I figured that they should at least be able to try and accomodate one of them. We said that the queen bed was no problem, but did they have something on a higher floor? She looked in the computer and eventually found us a room on the top floor with a queen bed. We headed up to the room and were extremely disappointed. The room was the most awkward shape. The bed was in a corner up against a wall and did not face the TV which was on the opposite side of the room. The bathroom was tiny and I could barely fit in it. The decor of the room seemed outdated and everything felt old. The balcony was very tiny and seemed somewhat unsafe. We went back down to the reception and asked Jan if there were any other rooms available. She then put us in another queen room on the 12th floor which she assured us we would be more happy with. This room was not much better. The bathroom was bigger, but the tub was half the size of a normal tub and the floor was dirty. I also lifted up the toilet lid to go to the bathroom and found urine all over the seat! We ended up staying just one night at this hotel and we checked out the very next day. They did not penalize us for leaving early and just charged us for one night. Before we left I checked out the pool. It was very small and not private at all. Anyone walking on the beach could have gained access to the pool as there were steps leading up to it from the beach.", "title": "Avoid this hotel rip off", "helpfulness": 9, "user": "Arizona-Senior", "date": "November 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10504536, "likes": {"liked": "— Beach location", "disliked": "— Reception and badly insulated rooms - very noisy"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Don't waste your money on this hotel. There are far nicer hotels just minutes away from the beach that are still reasonably priced. We checked into the Hilton Prince Kuhio wihich was a hundred times better than the Outrigger. It is newly renovated and each room has a huge bathroom and a 42 inch plasma TV!!", "title": "Great hotel, beware of what you get for an 'ocean view' room", "helpfulness": 7, "user": "chrisi2007", "date": "October 27, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 10381290, "likes": {"liked": "— Closeness to the beach", "disliked": "— noise of cheeskcake factory fans, in our room before we got upgraded"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I am writing this from our hotel room just before check out as free hi-speed internet is one of the best services of this supposedly deluxe hotel - along with its unbeatable location on Waikiki Beach. We have been here 4 nights and the free internet and convenience of walking downstairs onto the beach are not adequate compensation for the terrible check-in experience we suffered - where the hotel \"held us hostage\" to higher rates than those quoted by phone & email with a snooty manager who when we protested suggested we might look for \"less expensive rooms\" elsewhere - as we checked in after having reserved back in May 2007 - Plus the paper-thin walls between our \"partial ocean view\" room (if you go out on the 4-foot balcony on the first floor - any hotel's worst floor as we know from many international travels) and the juvenile party goers next door... Every time the toilet flushes anywhere near us the noise is like a small freight train next to the beds,,. At least the kids quieted down when I phoned their room at 11 pm and politely asked them to be a bit more quiet.", "title": "Great hotel - location, location, location", "helpfulness": 2, "user": "trippintheworld", "date": "October 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10346946, "likes": {"liked": "— The location is close to everything", "disliked": "— The balcony of our room seemed unsafe"}}, {"rating": 5.0, "title": "Honeymoon in Waikiki", "text": "Anyway, you get the picture. We reserved with local Hawaiian friends for a dozen people in May and on arrival we got the worst service I've experienced; the worst floor in the hotel; a very noisy hotel that seems to cater more to the \"younger crowd\" (ie 20 somethings) - which would be fine if the rooms were adequately insulated: 4 of our rooms complained to me about this... for a deluxe price.", "helpfulness": 2, "user": "Bannister", "date": "October 24, 2007", "id": 10276173}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I was a bit reluctant over this hotel. It was the first stop for 3 nights on our honeymoon but I cannot praise the hotel enough.", "title": "Wonderful in Waikiki", "helpfulness": 9, "user": "Squiz", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7807560, "likes": {"liked": "— The view", "disliked": "— Very busy"}}, {"rating": 5.0, "title": "Outrigger the best hotel on Waikiki for location and price", "text": "We booked a partial ocean view but managed to upgrade at a cheaper rate when we checked in to an ocean front room and boy was it worth it (see the pics!). The view was amazing.", "helpfulness": 5, "user": "rickChandler", "date": "June 8, 2007", "id": 7804687}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I realise that some people had trouble with thin walls/noisy rooms but I have to say that at one point I thought the rooms next to us weren't occupied until I physically saw people coming and going....we didn't hear a peep! We were on the 14th floor though and I know Lonely Planets review of this hotel said to get a room on the upper floors for the best views and the 'quietest' digs.", "title": "Excellent Hotel with small beach and poor soundproofing", "helpfulness": 2, "user": "johnsmith47", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7750742, "likes": {"liked": "— Waikiki Beach", "disliked": "— Poor Soundproofing in the rooms."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We only ate at Dukes the once - it was pleasant enough, plenty of choice.", "title": "Amazing Hawaii", "helpfulness": 7, "user": "pompeybelle", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7750433, "likes": {"liked": "— Large rooms with plenty of space on balcony", "disliked": "— Next to the ice machine and not getting a good view .. view of bins!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The location is superb, right in the centre of Waikiki so close to everything. The staff were wonderfully friendly and the hotel is clean and well kept - we couldn't fault it at all. Chip on the door is a great guy too :)", "title": "2 Thumbs up", "helpfulness": 4, "user": "Mommmy", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7712231}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "First off, staying right on the beach has it perks. It’s nice going straight to the beach from your room in less then a minute. Of course in Hawaii you’re really not in your room much. The staff was very friendly and helpful. The rooms are pretty spacious and clean. I hear from people that stay in Waikiki that there is a lot of city noise but we didn’t notice anything excessive. We were also staying closer to the city side than the beach side. They’ve done a pretty good job keeping up the hotel for how old it is. Dukes Barefoot Bar was a cool place to hang out with nightly live music. The hotel is located right across the street from The International Market Place and several other shopping centers. Also the beach had plenty of open space to just lye out. Overall we were pretty happy with the hotel and were heading back again next month. The only expense that’s kind of a drawback is the parking which cost $25 a night.", "title": "Outrigger rocks!", "helpfulness": 2, "user": "spongesurfermatt", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22065133, "likes": {"liked": "— The location", "disliked": "— Parking fees"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Outrigger Waikiki is a great modern, clean, and well located hotel. Every member of the staff with whom I was in contact was pleasant, well informed and eager to help. The location is right in the middle of Waikiki Beach, with plenty of shops and restaurants in the immediate area. Especially nice was the hospitality room, which was available on the day we departed for a quick shower before heading to the airport. Duke's Canoe Club restaurant was a great place for lunch, dinner, or a breakfast buffet with a view of Diamond Head. Airport shuttles and tour companies pick up right in front of the Outrigger. It was a great place and a terrific value.", "title": "Great Hotel;Great Location", "helpfulness": 4, "user": "bjohn435", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22009467, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Stayed 9 nights on first trip to Hawaii with boyf.", "title": "Great Location, great service-shame about the thin walls", "helpfulness": 1, "user": "angelakittycat", "date": "November 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21977724, "likes": {"liked": "— location", "disliked": "— Thin walls-no privacy"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Greeted before I barely stepped in the door by a charming bellboy who addressed me by my name. What a nice welcome.", "title": "2nd Visit-Still loved it!", "helpfulness": 5, "user": "MistyPink", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21746349, "likes": {"liked": "— Location and the hotel restaurants", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had a room on 2nd floor with view of next doors balconies but a small view of the beach and ocean. Better than having no view. Didn't think I'd be able to see any sea so it was nice surprise.", "title": "Great location but............", "helpfulness": 4, "user": "chookas", "date": "November 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 21638119}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "As it was our first trip to Hawaii, we booked an ocean front room which was quite expensive.", "title": "A wonderful hotel - expensive but worth it", "helpfulness": 2, "user": "richman707", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8592601, "likes": {"liked": "— On the beach location", "disliked": "— No complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We drove up with our rental car and was immediately approached by a car valet attendant and bell person. Luggage was unloaded and I was told to go register and luggage would be brought to the riim. Registration was at a desk (sitting down!), In about 10 minutes we were in our room and the luggage then arrived.", "title": "Outrigger is okay!", "helpfulness": 4, "user": "PauloB66", "date": "August 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 8501260}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Room was attractive, clean, turn down service, with a candy treat each night and a small but truly ocean from balcony. Met every expectation.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "Familytraveller31", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8497382}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The hotel was busy, though much easier to navigate than the larger ones - realtively small.", "title": "Best Hotel in Waikiki", "helpfulness": 9, "user": "OC-Lynch", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8465949, "likes": {"liked": "— Location & Service", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Our room was off to one corner so it was quiet. I imagine that roomes near the elevator could be a bit noisy and many reviews mentioned the noise from the Cheescake factory. Not a problem for use. Ask for the side away from the restaurant when making reservations.", "title": "Not Too Impressed", "helpfulness": 4, "user": "Netzie0220", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8456784, "likes": {"liked": "— location, location, location", "disliked": "— customer service, thin walls, and too crowded."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We just came back from a weeklong stay at this hotel. Overall, we were pleased with the Outrigger. We booked on Priceline for $190 a night. The room was big and clean and the staff was friendly. We were on the 7th floor on the Cheesecake Factory side. The fans were pretty ugly, but the noise was not an issue for us. Also, we could see the beach from our room. There were lots of amenities included for no extra charge such as a small refrigerator, safe, high speed Internet, and long distance to the US and Canada (good for us since we have lots of family in Canada). We rented a car and parking was expensive ($25 a day for valet and no self-parking available). We ate at Duke’s, Hula Grill, and Chuck’s. All were very good, and we thought the prices were reasonable for a beachfront hotel in Honolulu. On the down side, the walls did seem pretty thin, but this didn’t cause too much of a problem. The pool is small and the beach area behind the hotel is pretty narrow. Last time we were in Honolulu we stayed at the Hilton Hawaiian Village, which was definitely more of a luxury hotel with a big beautiful pool area and wide beach. However, I felt like the Outrigger was good value for the price we paid. I would stay here again if the price was right.", "title": "Good value", "helpfulness": 5, "user": "Texan_Family", "date": "January 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6694693, "likes": {"liked": "— Location and value", "disliked": "— Price for parking and thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "Just returned from a great stay at Outrigger Waikiki on the Beach. We went to relax and that's what we did. I read many of reviews before booking this hotel and I'm glad that I did. When booking....(all hotels in Waikiki ) be sure to ask about construction. There is a lot and many hotels will not let you know unless you ask. The Outrigger was in the perfect spot and no construction. We rented the deluxe beach package every morning at 8:00am at the beach rental cabana. This costs $40.00 and includes two lounge chairs and an umbrella from 8:00 to 5:00pm. You can come and go all day. We were right on the ocean in the front row and it was well worth the money for the reserved space and location. We ate at Dukes, Chuck's Steakhouse, and the Hula Grill. Dukes bar was fun and the food was good. Chuck's was fairly average for the price. Hula Grill was incredible. It has great island decor and a limited menu but terrific food. Be sure to order the crab won tons and the shrimp scampi...they are excellent. There is also a small hidden deli to the far back left of the pool. It is down the walk and near the laundry. Great sandwiches for $5.00-$6.00. We found this and grabbed lunch at the \"hidden\" deli and ate on the beach. The food was great and we saved money so we could go for a nice dinner. We really loved the Outrigger. Excellent service and great location. I highly recommend this hotel!!!", "title": "Great Stay", "helpfulness": 8, "user": "Netters", "date": "January 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6642849, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "title": "What a great Hotel", "text": "Stayed 11 to 19 Jan 2007. Excellent hotel on arrival we were upgraded from a ocean view room to an ocean front room on the second floor without asking. Room and bedding very clean had a great balcony in full sun all afternoon never needed to rent chairs on the beach. Complimentary everything tea, coffee, in room safe, bottled water on first day and even a daily newspaper. Must be one of the best hotels on the beach 4 star luxury but with a young and informal atmosphere, got breakfast included either in Duke's buffet or Hula grill. Prices for food and drinks probably about the same as Vegas i.e. pricy for US visitors but good value if your from the UK due to the exchange rate. The activities desk were excellent and we visited Pearl harbour on our 25th anniversary we will always remember what we did on that day! Also had a tour of the north shore (half a day) our guide Harry managed to squeeze everything in, including turtle beach where we were lucky to see one of the magnificant turtles sunbathing on the beach.", "helpfulness": 8, "user": "Regular_US_Visitor", "date": "January 22, 2007", "id": 6640264}, {"rating": 5.0, "title": "Wonderful experience!", "text": "Flights were by Virgin on an airbus with on demand movies and TV, Hawaiin then flew us from LA to Honolulu rented a digeplayer for $15 (inc 2 headsets) good value as headsets for the plane TV (one film) were $5 each. Cabin crew on both airlines were excellent, previously had bad experience flying with Virgin but on this occasion everything was great and the crew could not have been more polite and helpful.", "helpfulness": 8, "user": "hjhildo", "date": "January 21, 2007", "id": 6635927}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The staff was wonderful. Very clean! You can call home for NOTHING on their phone whenever. They supply the postcards and postage. Very polite staff. Feel secure in the hotel. Center of attractions. Easy to get anywhere just ask for assistance. Beach is in back yard and beautiful. Can take surfing lessons, highly recommend no matter what age! I'm 49 and loved it. Took outrigger ride. Loved it. Reasonable. Sunsets are WOW! I had the cheapest room in the hotel and still had a beautiful view of the beach and Diamond Head volcano and the city. Always something to see. Can get a bus to almost anywhere for a reasonable price. Many excursions around the whole island from the hotel or very nearby. Oh, also a newspaper at your door when you get up every morning. Beds were very comfortable. Highly recommend. Also two boats come up on your beach to take you on a sunset sail or whenever. You never have to leave the hotel!", "title": "Nice but crowded", "helpfulness": 6, "user": "FingerLakes", "date": "January 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6634143, "likes": {"liked": "— good restuarants on site", "disliked": "— elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed here in October of 2005 for the first time based on tripadvisor reviews for the first half of our honeymoon and absolutely loved it. We came back this year for a 6 night stay from October 29th until November 4th and still hold this establishment in high regards.", "title": "Great once again! Can't beat the Outrigger.", "helpfulness": 18, "user": "Khyron", "date": "November 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6135255, "likes": {"liked": "— Location, beach access, room quality.", "disliked": "— First floor timeshare people!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "We booked an oceanfront room with a king size bed, but upon check in we were given a room with two twin beds. We returned to the front desk and they accomodated us by giving us a king bed on the 10th floor of the hotel.", "title": "Great for Honeymooners", "helpfulness": 4, "user": "schnipke05", "date": "November 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6131783, "likes": {"liked": "— Everything", "disliked": "— Probably the maid service because they were slow"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The room was extremely clean, spacious and had an absolutely gorgeous view of Waikiki beach and Diamondhead. Like others have said, their could be a bit more lighting in the bathroom, but that is really splitting hairs. The room itself was wonderful. We never experienced any problems with noise from adjoining rooms or loud toilet flushes in the oceanfront wing. The maids were always very friendly and Mike the concierge was also extremely helpful if we had questions.", "title": "Location Location Location", "helpfulness": 9, "user": "banksfolsom", "date": "November 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6083459, "likes": {"liked": "— Location, Beach, Night Life", "disliked": "— Pool"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We had breakfast for two included with the room and Duke's buffet was excellent, although it is hard not to each too much when you go! The Hula Grill also has really good breakfast; try the stir fried rice with eggs and apple cinnamon french toast, both were very good.", "title": "Terrific Experience", "helpfulness": 16, "user": "beedybo", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6060259, "likes": {"liked": "— Aloha spirit in abundance", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Our first trip to Hawaii with my wife and teenage son and daughter. Had a wonderful time and what a wonderful hotel. You are treated like royalty and as long as you get a room high up, Partial or Ocean View on the Diamond head side you should have little problem with noise. Beautiful newly renovated rooms with lots of space. We had a partial ocean view room with a king bed and a pull out sleeper sofa. We also brought an inflatable aerobed and it was great for our daughter.", "title": "Busy and Great Place to Stay", "helpfulness": 15, "user": "nixster1987", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5807934, "likes": {"liked": "— Clean and professional", "disliked": "— So many people everywhere"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "They have wired Internet in the rooms so if you have VOIP like Vonage at home you can bring it with you like we did. Bring a cordless phone so you can call anywhere you need to, even down the street in Hawaii and not worry about long distance charges! The food at all restaurants are excellent and we enjoyed many breakfasts at the Hula Grill and many drinks and meals at Dukes and Chucks. Plan to do lots of walking as there is lots to see, but if you want to drive let me suggest going online with Thrifty car rental as they have convertibles to giant Jeep SUVs at great prices. They are only two blocks away and let you drop off as late as 9pm! Rates are amazing and you can rent online an hour or two before and go pickup! We rented 4 times in 12 days! Cheaper than parking!", "title": "happy at the outrigger", "helpfulness": 8, "user": "aussie_rose64", "date": "September 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5802456, "likes": {"liked": "— location", "disliked": "— a bit over priced"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Great golf like being in a rain forest at Luana Hills CC. Worth the half hour drive for the privacy.", "title": "Nice place, paper-thin walls...", "helpfulness": 9, "user": "JoanneZR", "date": "September 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5799110}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Beaches and water is really great. Beaches are beautiful with a great view in every direction. We saw it all and wiped ourselves out in 10 days so I do not suggest staying here more than 12 days including travel time. There is a weekly luau next door at the Royal Hawaiian that is not very highly rated but was wonderful for us and a quick walk next door. Many others require a two hour drive! Great price and very well done. Get a coupon online for a 20% discount! All in all a great experience and we will be back one day. This hotel is very busy with people everywhere but all of the beauty and friendliness of Hawaii that you hear about is all there at this one hotel! Enjoy!", "title": "Outrigger Wakki Shore - great views - but some construction noise", "helpfulness": 7, "user": "Alex2005", "date": "September 4, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 5768012, "likes": {"liked": "— The views", "disliked": "— condo in need of updating"}}, {"rating": 3.0, "title": "Outrigger Waikiki on the Beach ", "text": "we have just arrived home to australia from hawaii and we stayed out the outrigger waikiki, we had a great time staying there as it is very central to shops the beach and cafe's. the area is quite safe to walk around any time if the day or night. the international market place is just across the road and ABC stores are every where ( these are like 7-11 stores) they sell every thing. the beach is right out the front and beautiful. we stayed there 3 nights prior to our cruise on the \"pride of hawaii\" and one night post cruise. i admit we were on the side of the hotel near the cheese cake factory and the fan on the top of that building was noisy but we had the balcony door closed and the aircon on so that didn't worry us at all. the staff were very friendly and helpful which was great. i can highly recommend this hotel as it's location is just the best, we are going back one day and would definately stay there again no doubt at all! any questions you can contact me \"rosiepla10@hotmail.com\"", "helpfulness": 4, "user": "Churchnow4God", "date": "August 31, 2006", "id": 5731468}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 85, "average": 208, "very good": 807, "terrible": 33, "excellent": 1400}, "aka": "Outrigger Waikiki On The Beach Hotel", "slim_ranking": 0.132530120482, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}