{"user_rating": 4.5, "review_count": 3135, "name": "Outrigger Reef on the Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "This is the second time that I've stayed at this hotel and although the construction made things a little noisy, it really didn't spoil my trip in any way. After all, how much time does anyone actually stay in their room? Once you're by the beach or the pool the noise is minimal (mostly drowned out by kids enjoying the pool or patrons cheering their team on at the pool side sports bar!), The staff here are incredibly friendly and helpful (especially the housekeeping staff) and the room was spotlessly clean on arrival and kept that way during my two week stay. This hotel is by far the cheapest on the beach and yes, that's probably reflected in the out dated decor etc. but I'd rather put up with some 80's wallpaper than pay another $200 per night. My room on this stay was booked through hotelnow[--] and cost $175 per night. It was on the 9th floor (room 959) and overlooked the pool and had a partial view of the ocean. There were two Queen size beds plus a double sofa bed - all for me!!! The food, as per the last time I stayed, was excellent and the bar and waiting staff are very attentitivie. All in all another blissful vacation at the Outrigger.", "title": "Super, friendly hotel", "helpfulness": 14, "user": "MaisieM1", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5337906}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "We have just spent 2 nights/3 days at this hotel. For the money we spent, I felt the hotel room standard was shabby. The bathroom was small and the shower was over a shub which was very scratched and the basin was in poor condition.", "title": "In need of refurbishment..", "helpfulness": 8, "user": "EmmaNewZealand", "date": "June 11, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 5330868}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We were aware that there some construction of the beach walk area but our travel agent didi not know that the entire Ocean Tower was undergoing a major refit so it was not possibel to stay in a beachfront room. Our room was on the city side and opposite the construction site. The noise started at about 6am and went all day- a good reason to get up early and get out!", "title": "Many Roses - A Few Thorns", "helpfulness": 10, "user": "Americanrm", "date": "June 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5328031}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "It was handy having a Starbucks and Juice Bar on site as we tended to eat there for breakfast. We tried the Shorebird for dinner one night where you grill your own meat on large bbq's. It was very hot and the salad bar was average.", "title": "Good value for hotel on the Beach, Outdated rooms", "helpfulness": 8, "user": "driagirl", "date": "June 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5318151}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I totally recommend having a drink at the Halekulani Hotel next door at the House Without a Key Bar. The setting is fabulous and they have reasonably priced food.", "title": "Great location and quaint rooms", "helpfulness": 8, "user": "Shortypots", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5295748}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Travelled to Waikiki with spouse who has never been. I have not travelled here since 1996.", "title": "Really enjoyed out stay at the Reef", "helpfulness": 3, "user": "ValleyGirl2", "date": "December 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50764118}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We thoroughly enjoyed out stay. Rented a car downstairs from Hertz from Sean, he was great. Rented a Harley for the day from place on Royal Hawaiin street and Kuhio . Great people.", "title": "Wonderful base for a fantastic family vacation", "helpfulness": 4, "user": "Hendersongal", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50743771}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Travelled to Pearl Harbor early in the morning, at good time to go I think, not to busy.", "title": "Wonderful Hotel", "user": "gagabrielle", "date": "December 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50596609}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Hike up Diamond Head, thought it was okay, the garbage at the top was a real turn off. Otherwise view was nice...", "title": "Very pleasant, good value, poor internet access", "helpfulness": 2, "user": "235Steeler_Fan", "date": "December 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50535527}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The hotel was great, the staff great. Houskeeping not as top notch as everyone says. I found it just okay. The beds are so comfortable and we looked over the pool and loved to have a drink and listen to the Hawaiian music below. The Shorebird restaurant is good for Mai Tai's, breakfast was good, but only went once.. We did have dinner once and grilled our own steaks. Very hot and smelly..... Salad bar was good.", "title": "Best Room I've ever had", "helpfulness": 3, "user": "MrTinPhoenix", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 50434081}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "After reading reviews was apprehensive. Husband booked this hotel after getting word of it from someone he worked with.", "title": "Would stay again", "helpfulness": 9, "user": "boston530", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5508333, "likes": {"liked": "— Close to everything", "disliked": "— Construction, but that will pass"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Outrigger on the Reef is great.", "title": "Life's a Beach in the Reef", "helpfulness": 12, "user": "jph948", "date": "July 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5463754}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Check in was later on a Saturday evening. Walked into the room and was pleasantly syrprised. Big room, king size bed, balcony that actually gave us a mini ocean view. Not too bad. Bathroom was a little small, but two average sized people could shower together. Who spends a lot of time in the bathroom when in Hawai'i? . We were near the Military museum and enjoyed that. Toured, toured toured. Loved all the things about it. Food by the pool, Chef's Hut. The breakfasts are splendid. And resonable.", "title": "GREAT HOTEL", "helpfulness": 8, "user": "James_w23", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5448653}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Met people from our home town that live only three blocks from us. Small world.", "title": "Great Place!!", "helpfulness": 13, "user": "Smartyfan", "date": "June 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5409235}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "Tour of the Big Island. It is a great tour and it is worth the early morning flight. Circle Island Tour was great fun and you learn all about the movies and TV shows that have been filmed there.", "title": "Disappointed in the room quality", "helpfulness": 9, "user": "ldadkd", "date": "June 25, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 4.0}, "id": 5382647}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I have stayed at this property many times and have enjoyed each stay. However, due to construction around the property and the property itself, I would strongly urge people to stay at another property. It is very noisy, starting at approximately 6:45a.m. and lasting until 3p.m. There isn't much relaxation at the pool as the noise is constant. All the neat little shops that were on this property are gone due to the construction and the 2 small bars are closed during this construction along with the Chief Hut restraunt. I am sure once the construction has been completed it will be a great property again.", "title": "Wait Another Year", "helpfulness": 6, "user": "DuluthSuds", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7253286, "likes": {"liked": "— Friendly staff always willing to assist", "disliked": "— The noise from all the construction, made it difficult to sleep in or relax"}}, {"rating": 5.0, "title": "Back from Hawaii", "text": "Back last Wed. from a 7 night cruise (Pride Of Aloha) and also a 2 night stay at the Outrigger Reef On The Beach. I loved the cruise, this was my first and also first time in Hawaii. What's not to love?", "helpfulness": 7, "user": "NDSnowbirds", "date": "March 26, 2007", "id": 7227825}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Many people complained about the freestyling but since I have not been on any other I enjoyed it. The first few nights you had to wait in line at the Buffet and also at the Restaurants but then we got right in after those few days. Also they hipe up how great the shore excursions are and then when you go to book them they are all filled up. Our helicopter ride in Hilo was cancelled but due to the weather and also a beach day was cancelled due to bad weather. The ones we did go on were nice.", "title": "A few things to Consider", "helpfulness": 10, "user": "springbreakwasgreat!", "date": "March 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7224488, "likes": {"liked": "— The location.", "disliked": "— That you have to rent beach chairs & umbrellas!"}}, {"rating": 4.0, "title": "Construction not bad", "text": "Did the luau in LaHaina and it was great, glad we didn't do the one that NCL sponsered as they had to go inside due to rain. This is the only authentic one. Food was good and also the entertainment.", "helpfulness": 10, "user": "hulagirlwa", "date": "March 16, 2007", "id": 7171700}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Did the Road to Hana, but rented a convertible and in my opinion the only way to go. It was alot of fun driving it with the top down and a beautiful day.", "title": "Loved the Outrigger!", "helpfulness": 11, "user": "missleesh", "date": "February 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6852217}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I assumed I was going to a newly renovated 4 star resort. Instead, I stayed 7 nights in the dirtiest room in the Pacific Tower. It was really dirty all the way from black grease on the bed skirts to mold growing thru the cracked tiles in the bathroom.....Had to get up close and personal to all the filth in order to unplug things to plug in my hair dryer.....I believe with out my flip flops I could have ended up with someones athletes foot as the once over vacuum job was just not enough for this old dirty room!!! Truly I assumed the renovations were done and while the construction was not an issue at all for me it was just major disappointment of the age and cleanliness of the room.~ On the positive side nice staff, good food, great bar./restaurant!!!~", "title": "Not so GREAT!!!", "helpfulness": 5, "user": "dissappointedutah", "date": "April 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7420434, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Our room had a great ocean view and was clean enough but the first morning we woke up to little ants crawling all over in the bathroom, including our toothbrushes. We also saw them on the nightstand between the beds and coming out from around the outlet covers. Housekeeping got rid of them but they returned each morning. Once remodeled maybe it won't be a problem. Everyone was friendly and food was good. Nice and close to shopping. Beach was beautiful but rocky. We will probably opt for a different hotel next time around.", "title": "Great view but hated the bugs", "helpfulness": 4, "user": "dsbl", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7351856, "likes": {"liked": "— The view", "disliked": "— The bugs in our room"}}, {"rating": 2.0, "title": "Niced location- but UNDER CONSTRUCTION!!!", "text": "Considering what we left in Wainea to get to the beach, Outrigger was a warm welcome.", "helpfulness": 6, "user": "S&S07", "date": "April 1, 2007", "id": 7265238}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Fantastic experience. Hotel is under construction but you would never know it. Didnt hinder any part of our stay. Perfect location too. I wouldnt listen to any of the negative reviews.", "title": "Excellent hotel", "helpfulness": 3, "user": "lotstravel", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 10600727, "likes": {"liked": "— clean, friendly, good food, location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We stayed at this hotel in the Ocean tower during September 2007. Although the lobby was under renovation at the time, we were never disturbed by noise or dirt. The rooms were beautiful as they had just been renovated and everything was like new. The bathroom was huge, the beds comfortable and we enjoyed the LCD tv.", "title": "Newly renovated, staff went out of their way to fix Expedia's mistake", "helpfulness": 6, "user": "Aloha_Eric", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10379505, "likes": {"liked": "— Staff went out of their way", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Outrigger Reef on the Beach/Oahu", "text": "I booked the hotel on Expedia because there was a \"Hotel Promotion - Buffet Breakfast Included Daily\". After I booked I contacted Expedia to ensure the breakfast was included as advertised as it was not explicitly mentioned in my booking confirmation. Expedia denied that the offer included Breakfast and finally after several emails and calls and even showing them the screenshot where it said \"breakfast included\" they said it would be included.", "helpfulness": 5, "user": "TerryMyrtleBeachSC", "date": "October 4, 2007", "id": 10041122}, {"rating": 5.0, "title": "We fell in love with Hawaii", "text": "When I got to the hotel they claimed it wasn't included and that Expedia was wrong, but as a testament to their service they included it for free. Breakfast buffet at the Shorebird restaurant fronting the beach was fantastic to say the least. I was very happy with the staff at the Outrigger in resolving Expedia's messup. I would return in a heartbeat.", "helpfulness": 4, "user": "high-roller711", "date": "October 4, 2007", "id": 10039875}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My mother and I spent a week in Oahu September 14th thru the 20th 2007. The weather was beautiful. This was our second trip. We went 2 years ago. We stayed at the Outrigger Reef on the Beach both times. The first time we had a standard room and were upgraded to partial ocean view at no additional charge. This time we had partial ocean view and were upgraded to ocean view with a beautiful view of Diamond Head. The hotel is remodeling and some of the reviews I read had me concerned. The back of the hotel is finished and they are working on the front. I can honestly say none of the construction was a bother. Our room was a brand new remodeled room in Ocean Tower and the hotel is beautiful. I was impressed 2 years ago and even more impressed this time and didn't think that was possible. The staff could not be friendlier. When we came back from our tour and walked by the front desk they would stop working and speak to you. I lost my jacket and 2 days later one of the ladies working at the front desk stopped me to see if I had found it. I could not believe with all the people they see everyday she would even remember. I did find my jacket at the restaurant. The waitress went looking for it and found it in lost and found. We ate at the Shore Bird Restaurant in the hotel and food was excellent. We had breakfast, lunch and dinner and all 3 were great. You could get buffet or order off the menu for lunch. The restaurant overlooks the ocean with a beautiful view and breeze. Everyone there was very friendly. I would not hesitate to return to this hotel the next time I visit Oahu. I could not imagine wanting to stay any place else.", "title": "Love this hotel!", "helpfulness": 4, "user": "dmbland682", "date": "September 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8708011, "likes": {"liked": "— nice rooms"}}, {"rating": 5.0, "title": "The best vacation we ever had.", "text": "My family had the best vacation ever. The staff was great. The rooms were clean.We had so much to do at the hotel it was perfect. I loved the entertainment. The ocean was right there, the kids were always busy. We will be back real soon. It was the best.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 30, 2006", "id": 5236006}, {"rating": 2.0, "title": "Overrated", "text": "My girlfriend and I reserved a weeks stay here on PleasantHolidays. I think it had a 4 star or something rating. It is at best between a 2 and 3. We booked our travel and requested a king bed. We ended up getting put in this tiny room with (0.75 bath, not tub) with a queen bed. The room was about 10' X 10' (yeah, tiny) And it had decor for the 80's. The comforter was scratchy, the cheap kind you would expect at a Motel 6. While it was on the beach, and there were convenient shops inside the hotel, the two restaurants were pitiful. The drinks pricy, and the food, just terrible. Also, they are building some hotel right across the street and it is 24-7 construction. If the rating for the hotel had been a 2-3 star, I wouldn't be writing this. And my gal and I are not even that difficult to please. If you are looking for a 3-star and up hotel, look elsewhere than the Outrigger Reef. Luckily, after complaining the statff did move is to a better room, with a king bed. But it still was 3 star.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5233183}, {"rating": 5.0, "title": "The Outrigger Reef on the Beach - great", "text": "My daughter, niece and I had \"girls week\" at Waikiki, Honolulu and booked our stay at the Outrigger Reef on the Beach. We couldn't have picked a better location and hotel. The hotel lobby and pool area is beautiful, shops were inexpensive compared to shops on the street, even a Starbucks. The staff was great and very helpful. The hotel is right on the beach, just steps from the sand. We booked a partial ocean view and received an upgrade at no additional cost onto the 17th floor of the Pacific Tower with a good view of the ocean and pool area below from the lanai. Although the room was a little small, it was clean, \"no tropical insects\" and a great housekeeping staff. We were quickly provided with extra towels, pillows and hangers.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5144634}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The Shore Bird restaurant is beachside and was great fun as we grilled our own steaks with the help of our waiter and which were excellent. We also had dinner in the Ocean View restaurant with excelllent dining. I ordered a macadamia nut crusted mahi mahi with a garlic cream sauce over pasta surrounded with shrimp and scallops - delicious!!", "title": "Enjoyed Waikiki But Construction Noise Annoying", "helpfulness": 8, "user": "SUN-SNOWLOVER", "date": "May 15, 2006", "detail_rating": {"cleanliness": 3.0, "rooms": 2.0, "value": 4.0}, "id": 5078017}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "As none of us had ever been to Hawaii, we wanted to do tourist things and also have time to relax on the beach. The activities desk was very helpful helping us plan our tours. We snorkled at Hanauma Bay, took a bus tour around the island including the North Shore, went to a luau at Paradise Cove, went horseback riding and visited the Polynesian Culture Center and saw the show.", "title": "Well located...the sunsets are free!", "helpfulness": 7, "user": "Rantin rover", "date": "May 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5034293}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "Incredible!", "title": "Mahalo Outrigger!!", "helpfulness": 3, "user": "Kortine", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52786005}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Great location - walking distance to everything you want and more in Waikiki!", "title": "Best Christmas EVER!", "helpfulness": 3, "user": "duplark", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 52684348}, {"rating": 3.0, "title": "Great service - but noisy room", "text": "Clean rooms, comfortable beds!", "helpfulness": 2, "user": "msHI", "date": "January 4, 2010", "id": 52612254}, {"rating": 5.0, "title": "Loved this resort", "text": "Friendly staff - I would want to work here!", "user": "XDMCX03", "date": "January 3, 2010", "id": 52450956}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Easy access to a spectacular beach - thats not too crowded!", "title": "Fabulous Waikiki Experience", "helpfulness": 2, "user": "jesseandaddy", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52420687}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Outrigger Reef on the Beach was wonderful! We went there for our 5th anniversary and couldn't have asked for a better hotel! The tower we stayed in had undergone some major renovations and just re-opened in May. The rooms are beautiful! We booked the lowest class of room and were upgraded to a room with a balcony and ocean view. The hotel is on the beach - no roads to cross or anything! Just walk outside and there's the water! The beach there is a little rocky, but if you have water shoes, you'll be fine. Lots of lounge chair and umbrella rental places near by, you can rent floats, kayaks, etc. We at eat Shorebird's on 2 diff mornings - great breakfast buffet! If I was going back to Honolulu, I wouldn't stay anywhere but this hotel! Note: Airline employees - the Outrigger properties offer a GREAT discount if you book directly on their website!!", "title": "Beautiful hotel - loved it!", "helpfulness": 5, "user": "sherrimc", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8677681, "likes": {"liked": "— Location, location location!", "disliked": "— rocky beach"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Fantastic hotel experience. The rooms was brand new and included everything we needed at no additional charge - internet, safe, local and long distance calls to the USA mainland. We were also given breakfast vouchers to the Shore Bird restaurant which was excellent.", "title": "Great Hotel Experience", "helpfulness": 4, "user": "randyccci", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8667032, "likes": {"liked": "— Rooms were very nice", "disliked": "— Still under construction - just a little inconvenient (not bad)"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "While we were there, they opened their new lobby - which is beautiful. All the staff were very friendly and helpful. The pool was nice and they were never stingy with us about anything.", "title": "Right on the beach!!!", "helpfulness": 7, "user": "RawwDogg", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8391561, "likes": {"liked": "— Right on the beach", "disliked": "— Restaurants weren't that great"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The best part was it was right on the beach and close to everything in Waikiki. Excellent experience.", "title": "I love the place, especially the view.", "helpfulness": 12, "user": "Aloha52153", "date": "July 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8249388, "likes": {"liked": "— The View", "disliked": "— The construction"}}, {"rating": 5.0, "title": "Fantastic stay in the Outrigger Reef on the beach", "text": "The hotel is located right on the beach, you walk out the back of the hotel and you are on the beach. That is fantastic! The 3 restaurants in the hotel are decent, nothing special about them. The staff is very helpful in booking excursions and such. The room we were given had a nice ocean view and was large and clean.", "helpfulness": 9, "user": "skis0504", "date": "July 27, 2007", "id": 8243663}, {"rating": 5.0, "title": "Luxury Treatment and Accomodations at an Affordable Price", "text": "I was a bit nervous about coming here, knowing there were renovations going on, and was thinking of changing my reservation to its better known sister property, the Outrigger Waikiki on the Beach. I am sure glad I stayed at the Outrigger Reef on the Beach ...it was EXCEPTIONAL. We were greeted with an orchid-scented cool towel and were seated to check in. We received Four Seasons-type service during our entire stay.", "user": "SDMari", "date": "July 12, 2008", "id": 17802192}, {"rating": 5.0, "title": "Customer Service was Amazing!!!", "text": "We had a beautiful new Oceanfront room in the Ocean Tower and we could literally hop off the balcony and onto the sand and go for a swim and the price was half that of the overrated Halekulani next door!", "user": "RobeFrost", "date": "July 6, 2008", "id": 17599995}, {"rating": 5.0, "title": "Outstanding Resort - Loved the Outrigger Reef!", "text": "Usually I am leery of hotel bathrooms, but it was spotless...the housekeeper did not use a dirty mop, she was literally on her hands and knees scrubbing the floors with clean towels. To a germaphobe like me, that was a wow factor!", "user": "max2402", "date": "July 4, 2008", "id": 17507022}, {"rating": 4.0, "title": "Loved it, very modern", "text": "The breakfast buffet in the Shorebird restaurant was great and a really good value at $12.95. The pool is newly renovated, and although a bit small, there were plenty of lounge chairs and ice water to go around. Who wants to be at the pool when you are literally on the beach? The poolside bar is almost complete and looks like it is going to be awesome!", "user": "Salisbel", "date": "June 29, 2008", "id": 17347426}, {"rating": 5.0, "title": "Would definitly return to the Outrigger Reef", "text": "Waikiki Beach Walk is right across the street, there is a bus stop close by to take you to Diamond Head and all over Waikiki Beach, cab rides down to Duke's were around $4 ....it was great to be close to everything but away from the 4th of July craziness going on down at the Waikiki on the Beach.", "user": "Sidneylouise", "date": "June 11, 2008", "id": 16866392}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had a flawless check in experience. We had a very nice room with an excellent bath with a walk in shower. A local paper was hung on the door knob each morning. The activities desk was very helpful in arranging tours and both hotel restaurants were top notch. When we come back to Oahu we're staying here again.", "title": "No complaints at all", "helpfulness": 2, "user": "signots", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51090585}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I was amazed at the rooms and grounds/layout of this hotel but what impressed me the most was the happy and very personable attitude of the staff who were very professional yet also very down to earth and friendly unlike those of huge chains. From the valet to the front desk, everyone I ever interacted with remembered us by name and greeted us everytime they saw us in a warm and helpful manner. I felt very at home and had all the amenities I could hope for.", "title": "Amazing combination of small place charm with big hotel amenities", "helpfulness": 3, "user": "Kaiserskid", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51079836}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We have just returned home after spending 5 nights at this hotel in December. I chose it mainly from the reviews on Trip Advisor and also because it was on the beach.", "title": "Third time lucky!", "helpfulness": 5, "user": "Aussiegal15", "date": "December 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 51024143}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I booked the hotel back in January of this year and I understood we were getting an Ocean Front room with a King size bed. Upon arrival, we were told that the only Ocean Front room that was available was one with 2 double beds and we would be moved next day. We wanted to get settled immediately especially as we had been travelling for over 5 weeks so we weren't very happy about having to move the next day. We went and looked at the room which did overlook the ocean but it was on the corner next to another hotel and there wasn't any privacy, plus with 2 double beds in the room there was nowhere to sit.", "title": "A disappointing hotel", "helpfulness": 1, "user": "GarryLu", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 50908823}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We then asked what else was available, and we were shown to a one bedroom Ocean View suite which was very roomy and had a king size bed. We decided to accept that room and unpacked. During the night, I thought we were hearing the ocean but instead we were actually hearing many air conditioners from the roof of the next building which is part of the Outrigger Reef and of course we were looking at the building opposite us and only had a slight view of the sea.", "title": "Wonderful hotel", "user": "CadenStor", "date": "December 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50779591}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "OUTRIGGER REEF ON THE BEACH", "title": "Perfect start to a Hawaii dream trip...", "helpfulness": 7, "user": "gruvtrtl2", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16705015, "likes": {"liked": "— Friendliness of staff, newly renovated", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Book Em Danno", "text": "What a great stay! We loved this hotel. The location is ideal at the west end of Waikiki beach. The hotel is right on the beach and across the street from Beach Walk. We had a partial ocean view category room 809. The view of Diamond Head was gorgeous. We were across from the elevators, but there was little noise. We were also across from the drink machines and ice maker.", "helpfulness": 3, "user": "beamjane", "date": "June 4, 2008", "id": 16664953}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The lobby and pool area have been recently renovated and were very nice. All of the Ocean Tower rooms have been renovated. The décor is upscale island. We had a huge lanai with doors that opened all the way across. There was a small table and two small chairs on the balcony. The room had a separate sitting area with a desk and small couch. It was very roomy.", "title": "Fabulous experience!", "helpfulness": 3, "user": "Blessed11", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16653937, "likes": {"liked": "— Everything", "disliked": "— Sun is blocked early in the day at the pool as a result of the builings."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I liked the bed but my husband thought it was too soft. Wish it was king size. Good pillows, sheets and comforters. The shower had great pressure with an adjustable shower head that was removable. The room temperature was easy to control.", "title": "Great Value, Service and Beach", "helpfulness": 4, "user": "gorams", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16375880, "likes": {"liked": "— Location to shopping and beachfront"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We didn’t visit the bar or two restaurants, but they seemed to be hopping. The bar overlooks the beach and they had music/entertainment/karaoke there nightly. Fitness room, coin laundry and same-day laundry service available. Starbucks on site.", "title": "Loved the Outrigger", "helpfulness": 3, "user": "sashab4", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16259918, "likes": {"liked": "— The new rooms", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "From the moment we arrived at Outrigger Reef on the Beach, I was impressed. The decor is beautiful and the service was outstanding. The valet knew our names (and car) by the second day and was extremely helpful in suggesting possible outings. Room was wonderful - tastefully decorated, clean, independent thermostat, great city/pool view (was upgraded for free at check-in). Great restaurant on first floor rear (Shorebird) - open air - sits right on the beach - lovely views of Diamond Head Crater and Waikiki. Great $3 Mai Tias from 12:00 noon to 5:00pm every day. Wonderful bar staff. Would avoid this restaurant for breakfast (not so hot) but highly recommend dinner - you grill your own entree and they have a fantastic salad bar that comes with every meal. Outrigger Reef at the Beach got everything right. It is definitely not for the business traveler but for a vacationer, it is paradise! Oahu was our first stop on a three island trip and I was definitely spoiled by this hotel - the hotels on the other islands were all a disappointment after staying in this one!", "title": "Fussy Traveler - LOVED Outrigger Reef on the Beach!", "helpfulness": 3, "user": "hawaiifive-oh", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50390998}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed at the Reef on the Beach for the 1st 3 days of our trip, we couldn't be happier with the place. The rooms were great, they were clean, they seemed very new and the beds were very comfortable. We had 2 rooms and our teens loved their connecting room also. The location is awesome, directly on the beach, a great bar/restaurant looking out over the Waikiki Beach area. We never got to the pool, but it was also a great scene. The shops and restaurants just across the street are great with a Roy's, Cheeseburger Waikiki and Yards (a cool beer cetric establishment - 120+ beers from around the world on tap). We left the Reef on the Beach and went to Hilton Waikoloa which paled in comparison to the Reef on the Beach. The Hilton is sorely underkept, the rooms were dated (and dirty to boot). It seems that the Hilton is a few years behind in reinvestment/upgrades.", "title": "Exceeded our expectations", "helpfulness": 3, "user": "Savo0923", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50339625}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We travelled to Oahu on vacation to get away from the rain. Our hotel was beautifully situated on Waikiki. Our room was not. We were on an Hawaiian Airlines package, so we did not expect luxury. Our room was on the end third floor overlooking the dead plants in the walkway below and the large building next door. The sun never hit our balcony.", "title": "Great Location, Nicely appointed", "helpfulness": 2, "user": "sunlessinseattle_9", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 50118464}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This said, the room was very comfy, the cleaning staff gracious, the front desk and valet efficient. We used the Activities Center (Jackie) and would recommend it to all who are first visitors. However, the restaurant, bar and other staff seemed tired, cranky or just plain unfriendly. Not all, but enough to make us wonder if all the tourists have worn them out.", "title": "It's Hard To Do Better Than The Renovated Outrigger Reef Hotel", "helpfulness": 6, "user": "onesguy", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 49939234}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "Things to remember....The Wyndam Hotel people are everywhere ( trying to sell time shares ) in the lobby and on the street. Do not make eye contact. Look both ways and be ever so careful when crossing the streets as a pedestrian because it seems that turn signals are not used. If you are faint hearted, do not sit in the front row of those van-like buses that take tourist to the various sites. The roads are full of ruts, the buses do not seem to have shocks and the drivers are fast and furious.", "title": "I'll be back again- soon!", "helpfulness": 2, "user": "Caroline63", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49936852}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We have stayed at countless hotels on several islands in Hawaii over the years, and found the renovation of the Outrigger Reef on the Beach to be one of the best we have ever encountered. We had an ocean front room, and were delighted with the tasteful decorating and appointments not just in the room, but in every part of the hotel. Bravo for a job well done. We will definitely be back for the next trip we take to Oahu. On the Big Island, the Mauna Kea is still our number one choice.", "title": "The Best Renovation Ever", "helpfulness": 1, "user": "MinneapolisReno", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52330697}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed at the hotel for 10 days in November/December. We arrived at 1000 morning, and went to check in, and asked to be upgraded from a partial ocean view suite to a full ocean view suite, and were told that there was a room ready, and we could have it if we wanted (we did). Had to pay extra, but no dramas. The staff were really friendly and helpful, although the Wyndam (sorry 'bout spelling) people can be a bit annoying, as they work on commission. The tour desk staff were also great, and accomodated our every need.", "title": "fantastic", "helpfulness": 4, "user": "witial", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52151996}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The hotel itself is fantastic. I read reviews from everyone on every site i could think of, on every hotel in waikiki, and we decided on this one, and we weren't disapointed. The room was really clean, and waking up to a great view of waikiki and the pacific ocean is one of the best parts.", "title": "Great stay", "helpfulness": 4, "user": "Ralphcat62", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52049905}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "On the downside (there has to be one) was the Kani Ka Pila Grill. We were there at 0630, and i finally got an orange juice at 0715. Left at 0720 without the eggs in my belly. The Shorebird is better food, service and view - having breakfast as the sun comes up was a shock to the system, but a pleasant shock.", "title": "A+ stay at the Outrigger Reef on the Beach", "helpfulness": 2, "user": "Helenbrooks", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51937471}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Around the corner is the Waikiki Beach Walk, with shops and places to have a few quiet ales, as well as the international market place about a 5 min walk away. The Ala Moana mall is about a 15 min walk, which is very easy to do there, but not on the way back if you've done a bit of shopping. You can get the pink trolley for $2, which stops around the corner.", "title": "Excellent Choice", "helpfulness": 1, "user": "Toby1959", "date": "December 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51756236}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We just got back from a 10-day vacation to Oahu; 5 of which we spent at the Outrigger Reef.", "title": "Nice place! Hope to stay there again!", "helpfulness": 10, "user": "Marti", "date": "June 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3555106}, {"rating": 5.0, "title": "Paradise on the Beach", "text": "Pros: a beautiful hotel; nice pool; great beach location; great location, period; nice rooms; great deal (internet site averaged $107/nt for their smallest room, which was quite adequate and had nice park views); Starbucks in lobby opens early; restaurants on site are nice and a decent value; shops in lobby are nice; quiet room (despite the fact we were adjacent to the elevator, we heard no elevator noise!); the beach/surf was very nice and calm and I saw a surprising amount of reef fish while snorkeling; there were 3 hot tubs (2 that are separate, elevated from the pool level and one attached to the pool); there is an adequate amount of pool lounge chairs.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 1, 2005", "id": 3515711}, {"rating": 2.0, "title": "demolition site", "text": "Cons: it is true that there is demolition going on in the area. It was not excessively noisy when we were there and you can't hear anything at the beach. However, I kept wondering if someone was doing an air quality analysis due to the potential for asbestos fibers in the air since old hotels were crashing to the ground within yards of the hotel's driveway. The beach has lots of rocks/coral and I would recommend wearing footwear if you're going to swim. The beach itself is very \"short\" and there is an additional charge for lounge chairs and umbrellas.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3508829}, {"rating": 5.0, "title": "Perfect Waikiki Hotel", "text": "Overall, we had a great experience and would go back to this hotel.", "helpfulness": 43, "user": "A TripAdvisor user", "date": "May 16, 2005", "id": 3475130}, {"rating": 3.0, "title": "just okay", "text": "Having grown up in Hawaii and having stayed at many hotels on Oahu, as well as other islands, I have only praises for the Outrigger Reef on the Beach. Traveling over for a wedding, I was completely satisfied with the accomodations of this hotel. With direct beach access, three restaurants, and a very helpful staff my trip was nothing less than fantastic. Definetely a great place to stay while on Oahu.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3459061}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We went back to the Outrigger Reef for the second year and were a little concerned by some of the reviews we read about construction going on in the area. The good news is that the rooms in the tower that have been renovated are far superior to the old rooms and are extremely well decorated and maintained - a 1000% improvement over the older rooms. yes there is construction going on at the hotel and because of this the lobby is not as nice as it used to be or will be in the future so if you seek perfection do not stay here. All the staff were extremely friendly and helpful and the rooms were cleaned efficiently and before noon every day. the pool is surrounded by some of the construction and I guess my message to folks would be \"why go the pool in Hawaii?\" the beach is close by although as many folks have complained, it is a little bit rocky - boo hoo - walk 200 yards and be on the beautiful sandy beach that fronts the royal hawaiin.", "title": "Quit Your Moaning", "helpfulness": 10, "user": "EnglishMike998", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8239535, "likes": {"liked": "— Recently renovated rooms were very well appointed with large closet/storage space", "disliked": "— Room had two full beds and I am definitely queen size when sharing with the wife!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Both restaurants are still operational, the shorebird is a little bit funky with the cook your own entree but the price is reasonable and it can be fun. the Ocean house is really good and my meal there which was ordered different to the entree on the menu was served exactly as ordered and very quickly by a very personable and efficient server.", "title": "Rave Reviews for The Reef On the Beach", "helpfulness": 9, "user": "sarahlouise55", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7791611, "likes": {"liked": "— Fantastic choice of food in the restaurants", "disliked": "— Could do with a bigger pool if you dont like the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Overall if you want to avoid a big city feel (trump hotel is going up directly opposite) stay away from Oahu in general - this area has lots of older hotels that quite rightly are being upgraded. If you want the joy of rolling out of bed and stepping into the sand a couple of minutes later - this is a great place - we will certainly be back!", "title": "loved the outrigger reef", "helpfulness": 10, "user": "mreen", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7754475, "likes": {"liked": "— location", "disliked": "— the long walk to the reception desk."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "we stayed for 4 days at the Outrigger Reef and loved it. we had a partial sea view room that was huge!! Our room was spotless and had all the comforts you need (dressing table, shower, hairdryer, tv, safe and balcony with furniture) the hotel is open plan with no windows or doors and it had such a lovely relaxed feel. Check in was quick and we were upgraded because we were away for our wedding anniversary. every morning fresh lei (flowers) were placed in our room. There was a reasonably sized pool and 4 places to eat. we had breakfast (buffet style but you can pick your meat and request how you want it cooked) in the restaurant right by the beach and had the delight of watching a beautiful morning wedding ceremony take place on the Waikiki beach. as you would imagine there was a great variety for breakfast with so much fresh fruit its unbelieveable. also cereals, cooked meat, yoghurts, breads etc..the beach was right on the hotel's doorstep and went on for miles. lots of nice clean sand and also a playground on grass for the children. to the right of the hotel you get a fabulous view of Diamond Head Crater. we had dinner in the restaurant overlooking the beach. the food was out of this world. the waiter was so friendly and gave us tips on what to do/see and also where else to eat on the island. im vegetarian and found i had a good choice off the menu. each morning we would come down to breakfast to see different activities taking place - basket weaving, lei making, hula dancing etc.. the children loved it.", "title": "Ocean Tower Open-All New!!", "helpfulness": 6, "user": "mondo36", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7714859, "likes": {"liked": "— All the rooms are updated and just opened as of May 12, 2007", "disliked": "— construction is still ongoing on other parts of the hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "we had hired a car from the airport but did find th edirections a little confusing getting to the hotel(dont drive in Honolulu at rush hour - mad!) and even more bizarre trying to get out of the city. The hotel has valet service. the only downside to our stay was the weather. we were there 4 days and it rained for 3 of them. but if you visit you must go to the Polynesian cultural centre and Byodo-in temple is worth a look at. Will definitely go back one day.", "title": "Great location, rooms are not so great", "helpfulness": 2, "user": "Jeanos", "date": "May 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7650763, "likes": {"liked": "— location", "disliked": "— room"}}, {"rating": 4.0, "title": "The Outrigger Reef was great!", "text": "The Outrigger Reef on the beach was wonderful. We stayed for 2 weeks in late April 05. The staff was great, the restaurants were good. The location on the beach was quieter then the Outrigger Waikiki. The beach was nicer closer to the outrigger waikiki, but you can settle on your mats anywhere for the day. The reef staff up graded us when we arrived, you just have to ask. They do have annoying time share people trying to sell you time shares in the lobby. We walked everywhere shopping and eating. There is no need for renting a vehicle if you plan on staying on waikiki. The bus system is very good and accessable. In Waikiki, on Lewers street, (across the street from the reef) they are tearing down hotels to replace with state of the art ones, it can get noisey, but they are doing a good job keeping down the dust and keeping traffic flowing properly. We only heard the noise when walking the streets, not from our room. The reef has a complimentary renewal of the vows ceremony and that was very nice. We will return to Waikiki and we will return to the reef.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3456719}, {"rating": 1.0, "stay_parameters": "Stayed July 2004", "text": "In 2004 we visited the USA for over 4 weeks for our honeymoon, during this time we stayed at the Outrigger Reef on the Beach in Hawaii. I must say this was the one place I was looking forward to visiting the most - how wrong could I be? On arrival we were allocated a room that was disgusting to say the least, just big enough to fit in a double bed, there were toe nail clippings on the floor and a shower that wasn't fit enough to wash my dog in (I think he would have complained also), we were advised that we had a beachfront view, not sure which beach that was but we couldn't see it, we did have a great view of the hotel directly adjacent to our window though (2 yards away I think?)", "title": "please save your money", "helpfulness": 13, "user": "evanskerr", "date": "May 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 3.0}, "id": 3446077}, {"rating": 4.0, "title": "fantastic friendly hotel on the beach", "text": "We called the Hotel Manager and were politely advised that the hotel was now fully booked but to call back in 2 days time to see if we could move to another room, ok we thought - let's just get on with it, however 1 hour later we strolled through the reception area to see a family of none Europeans asking if they had any vacancies for 3 nights. The answer was \"Yes Sir, would you like an Ocean view?\" We then immediately asked for a transfer of room which was granted, the room still didn't come anywhere near the rooms we had seen the week before in San Francisco - Alcatraz comes to mind! We tried to enjoy our weeks stay in Hawaii spending our days on the beach and evenings in the Shorebird Bar which did have some very talented bands and vocalists to be fair. I have to say that the American customers are more highly thought of than Europeans and this is evidenced in the superior rooms and by far better service they receive. We have both travelled the world extensively and can safely say that this is probably the worst Hotel we have stayed in yet, on our travels around he US we have visited 14 States which all bar one we have rated very highly. Very Disappointed - we didn't even see Magnum but think we saw TC and Higgins in an Italian restaurant one night! Definitely saw Magnum's mate though - that other geezer in the Hawaiian shirt - Rick we think his name was!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3433668}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "we stayed at Outrigger Reef for two nights in late April and loved the place!", "title": "A Wonderfully Fantastic vacation. We Love the Outrigger!!", "helpfulness": 44, "user": "Discotish", "date": "April 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3427159}, {"rating": 4.0, "title": "Big bang for your buck", "text": "Great central location, friendly staff and wonderful food at both restaurants.", "helpfulness": 11, "user": "Maredixon07", "date": "April 29, 2005", "id": 3426026}, {"rating": 3.0, "title": "Hated the Jackhammer!", "text": "We had a great surfing lesson at Beach Boy Hale right outside the hotel on the beach- this is not to be missed.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 1, 2006", "id": 5289521}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "On a positive note, I requested extra towels and pillows and they were promptly provided and replenished in the room by the maid daily. The staff was courteous, helpful and responsive. We enjoyed breakfast daily at the Chief's Hut. The daily specials were a fantastic deal (4.99). We enjoyed a great lunch at the Shore Bird (we did not order the buffet, it didn't look too good). The hotel was conveniently located on the beach and within walking distance of many restaurants, shopping and of course your choice of several ABC stores! The pool was nice and not over crowded the time we spent there.", "title": "Great Hotel...friendly staff...nice stay", "helpfulness": 13, "user": "smethingsweet", "date": "June 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5381372}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Although I've had very good experience with Outrigger overall on many occasions, I would not recommend the Outrigger Reef. Instead, try the Waikiki Shores next door and book through Outrigger (not Castle). Be sure you get the deal that allows you use of the Outrigger Reef facilities. That way, you have the best of both worlds. A great room with full kitchen facilities and the amenities afforded by the hotel next door!", "title": "First time in Hawaii", "helpfulness": 9, "user": "bdjpaj", "date": "June 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5378311}, {"rating": 4.0, "title": "Great Hotel", "text": "The hotel was nice , the staff was super friendly and I would definitely stay again. As with any hotel there are a few cons, but this hotel had minimal downs. The hotel rooms were a lil cramped but do-able, and the bathrooms are small, yet do-able...but who stays in their room the whole time? And their was construction, but that is almost inevitable anywhere..and plus they are upgrading the area so it was fine, it didnt wake me up. My major concern was the un-timely elevators! I was in the Pacific Tower and they took forever!...so that needs to be changed somehow.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5362044}, {"rating": 3.0, "title": "Great place to stay for the price", "text": "The cleaning staff was friendly and great...and even if they werent staff on our floor and would get on the elevator and say hello or ALOHA...the open lobby was beautiful..they had someone performing in the lobby every night and it was nice to go to sleep listening to beautiful hawai'ian music. Everything was in walking distance of the hotel ie.e shopping, eating, the bbeach, the park..and it was just great. I had a wonderful stay at the Outrigger Reef in Hawai'i and I would definitely come back. One more thing if you go on the Luau go to Germaines Luau and request the bus with Cousin K he was so so funny and awesome! :)", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5341770}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We have stayed here before and loved it, but this is our first time since they did a total renovation, and it's so much better. Stayed 4 nts here. The location can't be beat - right on the ocean on one of the better parts of Waikiki beach. Still can get crowded but it's ridiculous to the east. Idyllic view of Diamond Head. Rooms are Tommy Bahama island style - beautiful job. We had no view whatsoever, but the room was great, including wet bar and fridge. Got local paper every day, which was a nice touch. Flat-screen TV with many channels. Can walk to just about everything from here, which we love. Staff was really nice and seemed proud of the hotel renovation. Poolside bar played excellent live music every night and drinks were reasonably priced. Nice to stop there before heading out for dinner. Ate at Shore Bird for breakfast buffet several times - great open-air dining overlooking beach. Had the cook-it-yourself dinner once, which I wouldn't do again, though it seemed popular with families. Love it here and look forward to coming back.", "title": "Love the Outrigger Reef", "helpfulness": 4, "user": "steptravel", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51283307}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Stayed here for nine business days along with an adult family member. The Good: Hotel was remodeled and beautiful with all the amenities at a discounted cost. Rooms were excellent, except it would have been nice to have a chair, or sofa in the room there was certainly ample space for it. The staff was extremely friendly and helpful at all times. The facility is oceanfront, has a terrific large pool, a Starbucks, $3 Mai Tais and is immediately next door to the best restaurants - Roys and La Mer, My favorite feature was it was within close walking distance to all Waikiki's shopping and dining - but completely hidden away from all the overcrowded Waikiki madness.", "title": "Beautifully redone oceanfront hotel with all the amenities - steps away from overcrowded Waikiki", "helpfulness": 2, "user": "Fedchic", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51281482}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Bad: Internet service (that's free) from the rooms is too slow. It's ancient like dial-up and takes forever to load a page (gmail actually gives up and ask you to select basic html in order to load.) There is WiFi in the lobby's open areas if you want to head downstairs every time. Restaurants and food are basic/bland. There if you need them, - but honestly, there are so many good choices right outside your doorstep why bother. Ask if you are getting a room overlooking the pool. Beware this means you will be hearing the poolside band with loud speakers every night in your room until 9:00 p.m. Move. Lastly, be prepared for the fees to have a chair on the beach daily. We decided to search out the best beaches on the island instead after finding this out the first day and experiencing the rocky (not sandy) beach.", "title": "Great hotel in a great location", "helpfulness": 3, "user": "Thunderchief", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51260625}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Nightlife, dining and shopping is outstanding in Waikiki. But our stay at Outrigger Reef on the Beach provided the haven away from it all. An there was the staff every day saying \"welcome back - where did you go today?", "title": "Fantastic Hotel", "helpfulness": 3, "user": "Wamdog", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51229723}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "This was our second visit to Honolulu and we could not have picked a better hotel. Our rate included breakfast each day, which was excellent and, with the choice of three restaurants, you can have an ocean view from your table. The staff were unfailingly attentive (without being pushy) and knowledgable - nothing was too much trouble. The hotel offers a complimentary wedding vow renewal service on the beach just behind the hotel (you can book this through the front desk). There was plenty of space in the room and, as our room was in the ocean-view tower, our balcony overlooked both the pool and the ocean. City noise was not an issue, and it was nice to hear the local musicians playing in the hotel restaurant each evening. Bed was EXTREMELY comfortable, and it is almost worth staying here just for the complimentary body lotion (coconut/lime: wonderful!!!).", "title": "Noisy hotel in over-rated Waikiki", "helpfulness": 1, "user": "Julie_PwMS", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 51137478}, {"rating": 2.0, "title": "Expected Way More", "text": "We booked a partial-ocean view at this hotel because of the previous reviews and we knew the location (as we usually stay at the Ohana Village on Lewer - which doesn't exist anymore). We were really looking forward to it and were extremely disappointed. Our room was a partial ocean view if you looked over the lanai (which could barely fit us), so we asked to be upgraded to an ocean view room which did have a great view, but we were travelling with a 3 year old (stroller & stuff) and the room they ended up putting us in was only accessible by stairs from the 9th or 9 1/2 floor (via the \"express\" elevator, which was anything but fast!). Also, we got to the hotel at 11:00 am and was told that our room wasn't ready yet, imagine that?! Our room ended up being ready at exactly 3:00 (which just happens to be check-in time). I was hoping that they would let us in a little early considering we paid for an extra day ($300) (so that we had the room for the day we were leaving, as we weren't flying out until 8:00). In any event, I found the hotel front staff unhelpful, the bathroom was so small I could barley turn around in it, the shower temparture was not constant so we had to be careful when showering our 3 year old (although upon booking (in September 2004) I did book a room with a tub... or so I thought?!), our air conditioner could wake the dead and the room needed a serious make-over. In two weeks we had three housekeepers and two were really good. The location of this hotel is right on the beach which is great, but considering the amount of construction going on, it's not a nice walk through the streets to the main drag - totally run down. I definately will not stay at this hotel again. I really expected something a lot better.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "April 11, 2005", "id": 3349506}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "We checked in an was accidentally given a room on the smoking floor. The front desk upgraded us for free to a city view which was great. The rooms are a little outdated and the tiles in the shower needs to be change! However, the location and the people made the stay worthwhile. We paid $125 per night (Friday-Sunday) on travelocity which was more reasonable than other hotels that I found. The hotel is right on the beach so it was perfect. You can enjoy your mai tai at the Outrigger restaurant/bar and enjoy the beach at the same time. There's also a McDonald's right across the street and Jamba Juice inside the hotel! It's also located in the middle of the Waikiki strip so it's a good spot. Worth it!", "title": "Good Location!", "helpfulness": 8, "user": "iyvettei", "date": "April 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3346840}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "We just returned from a week at the Outrigger Reef, and it was a terrific place to stay. The rooms were nicely appointed and well maintained, the restaurants were excellent, and the staff was uniformly friendly and helpful. There's free entertainment in the lobby every night, and it was really very good. It's a great location -- right on the beach, but far enough from the center of Waikiki that it's a bit less crowded and noisy.", "title": "We loved the Outrigger Reef . . .", "helpfulness": 8, "user": "David012", "date": "April 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3341975}, {"rating": 3.0, "title": "Great Campy Hawaii Hotel!", "text": "I am mystified by the complaints in some reviews about the timeshare salespeople in the lobby. They do have a desk there, but no one there said one word to me or was trying to approach anyone else in the lobby.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3330237}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I would stay here again in a heartbeat.", "title": "Great Hotel!", "helpfulness": 13, "user": "peajay66", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3329715}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Where do I begin. Well, let me just say that I have a great time at the Outrigger. It was a very nice, clean hotel. I didn' have any problems at all. The location was the best. It was in walking distance to all the major stores and resturant. The staff was very friendly and courteous. The activity desk was very knowledgeable about the activities that you can do. We loved Dukes Resturant. The only thing that I didn't like was the birds that walked freely around the resturant. If you can, upgrade to an Ocean Front Room!!!! We were in room 711. The hotel was remodeling, but it wasn't a bother at all. I never head anything while staying there. I like that the hotel was offer free vows renewal which we did. We were there for our 2nd anniversary. It was free so we did it. It was nine couples all together. It was a couple who got married just 2 days ago. I can go on and on about the Outrigger, but I will end it here. Just go and have fun!!!!!", "title": "Just Beautiful", "helpfulness": 3, "user": "casinocassie", "date": "May 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16171709, "likes": {"liked": "— new renovations", "disliked": "— no smoking area"}}, {"rating": 4.0, "title": "Great \"New\" Outrigger Reef on the Beach", "text": "This hotel is being renovated and was just beautiful. The construction is kept to a minimum as to effect your stay. The rooms are lovely and the Shorebird cannot be beat. for scenery and their Lava Flows. Vow renewal ceremony was way more than I ever expected. Great location to walk to most of downtown Honolulu. Beach has a beautiful view of Diamond Head. You won't go wrong staying here as we just loved it. Everyone is so nice and helpful and you are located near the bus stop for going to places too far to walk. I highly recommend this hotel and I am hoping we get to go back sometime in the near future. Full of island spirit and Aloha.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 9, 2008", "id": 15858242}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Just returned from a great week at the Outrigger Reef on the Beach. The property is still being renovated so it is still", "title": "The good, the bad and the beautiful!", "helpfulness": 3, "user": "Casen", "date": "May 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 15733738, "likes": {"liked": "— Location", "disliked": "— Front Desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "pretty noisy at the pool durning the day you might want to take along an I-pod to block out the construction noise.", "title": "Outrigger Reef on the Beach - Great!", "helpfulness": 6, "user": "Martha31", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15474921, "likes": {"liked": "— Attention to detail. Large spacious rooms and baths", "disliked": "— Pool had no ocean view. Enclosed in a courtyard"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed in the Outrigger Reef and had a wonderful experience. Their website is easy to navigate and we recommand this hotel for your nights in Waikiki. Great location next to the quiet Fort de Russy park and beach, next to the famous beachwalk and opposite the best restaurant on Oahu, Roys Hawaiian cuisine. Staff is helpful and friendly, hotelrooms are spacious with very comfortable beds and great amanities. After a long flight out of Amsterdam, we felt totally relaxed in this hotel.", "title": "excellent hotel", "helpfulness": 1, "user": "pokiedoc", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51594413}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "What an incredible room we had with a nice view of the beach! The room was new and clean. Our room (#420) was on the corner with two balconies.", "title": "Excellent Hotel", "helpfulness": 1, "user": "larslentz", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51470604}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel recognized that we were on our honeymoon, and provided complementary champagne. This was more than the two previous Hilton stays in Hawaii had done in the days preceding.", "title": "Fantastic", "helpfulness": 1, "user": "Loveshawaiiseattle", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51412661}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Breakfast was included each day of our stay. It was a good breakfast buffet at the Shorebird Restaurant inside the hotel. We ate and drank there ($3 MaiTai specials each day) and they had reasonable prices on great food (grill it yourself - that was a great novelty too).", "title": "Perfect place to stay!", "helpfulness": 2, "user": "Travel_Addict_69", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51381703}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Pool was nice although it was salty for some reason. Not sure if that was planned or not, but it was like swimming in the ocean it was so salty.", "title": "Great Location and Comfort", "helpfulness": 1, "user": "ArtemonNewZealand", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51289657}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We booked this hotel through Bookit.com and was a little concerned by some of the traveller photographs that I viewed here on trip advisor. That concern was unfounded.", "title": "Great Hotel", "helpfulness": 5, "user": "perthwestatraveller", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18049892, "likes": {"liked": "— Location, cleanliness, service", "disliked": "— That after the renovations are complete, the price will probably double"}}, {"rating": 5.0, "title": "Great time at the Outrigger Reef on the Beach", "text": "The week we stayed at the Outrigger Reef on the Beach was a great experience. The staff was extremely nice and helpful. They are remodeling, but we felt this was not a bad thing as the pool was not crowded. The pool has a shaded area to avoid the hot sun for those of us who are fair skinned! Also, there was no remodeling noise such as jackhammers. The restaurant Shore Bird at the hotel was open air and pleasant to enjoy the view of the beach while dining or having a cocktail. They have an excellent breakfast buffet as well. The room we had was very nice with a comfortable bed and pillows! We would be more than happy to stay here again.", "user": "hilltop82", "date": "August 4, 2008", "id": 18622839}, {"rating": 5.0, "title": "Memorable", "text": "It was our honeymoon. We were greeted with a champagne bottle on our first day there. Beautiful view of Diamond Head & Wakiki Beach. Room was always clean. We had 2 balconies. Walking distance to everything. Feels like you're right above the ocean. Recommended to all!", "user": "loveoahu", "date": "July 26, 2008", "id": 18264053}, {"rating": 5.0, "title": "Loved It!!!", "text": "This hotel was wonderful!!! It was right on the beach only steps away form all the night life and shopping. Everyone was very nice and helpful. The room was beautiful and the view was awesome. I was a little worried when we pulled up because the hotel in under construction. But the only time you really noticed was when you were coming in the parking area. The pool was wonderful with 2 hot tubs. They have 2 restaurants on site which the view and the food is amazing. I'm a picky person and I must say I would go back to this hotel in a heart beat. The only thing that was a little pricey was the parking 25 a day so keep that in mind. 10/10", "user": "chrissyandfox", "date": "July 25, 2008", "id": 18223400}, {"rating": 5.0, "title": "Glad I Read Reviews!!!", "text": "We are so glad we did our homework and trusted the wonderful reviews on trip advisor. I was so confused as to where to stay but the Outrigger was spectacular. From the moment we got out of the cab to the time we checked out the service was unbelievable. I felt like I was at a 5 star hotel. Took advantage of the vow renewal ceremony which was very special and way way way above our spectations. Dinner at the Ocean House on that day with a beautiful sunset was so romantic. The construction in no way affected our stay. We were also upgraded to a full ocean view room. I can't say enough about this hotel. I hope to get back to see when all the remodeling is done and there is no question, we would definitely stay at the Outrigger Reef again.", "user": "Tina55", "date": "July 21, 2008", "id": 18119140}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The Outrigger Reef was great. We knew before going to Hawaii that there was construction going on in the area and at the hotel, but honestly it did not bother us one bit. We were only in our hotel to shower and sleep so we barely noticed the men working. We did not get a new room, but the room was still great! It was a small room, but the closet was big enough to store all of our luggage (4 suitcases) so everything was put away and made it easier to move around. The bathroom was average size with a shower only. The rooms were very clean. The lobby and amenities inside the hotel were excellent. If I had to pick one thing I disliked about the hotel it would be the timeshare company in the lobby. By the end of the stay I simply said No as soon as they started talking because I was tired of them asking me stuff as I walked by. The outside of the hotel was great. The pool looked great (we didn't use it). The Shore Bird restaurant was excellent and being right on the beach was wonderful. The beach had a lot of coral and rocks right there so we walked over a little bridge and swam right in front of the hotel right next to us and it was great. All in all I highly recommend this hotel.", "title": "Hotel was great!", "helpfulness": 3, "user": "jmgriffith", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6599559, "likes": {"liked": "— Location right on the beach", "disliked": "— Timeshare salespeople & Slow Internet"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My boyfriend and i stayed at the outrigger reef on the beach after reading some reviews on tripadvisor and also because it was very affordable, and above all because it was on the beach... immediately when we arrived we were upgrated to a one bedroom suite (i think they assumed we were honeymooners) it was great the views were wonderful!!!", "title": "so so romantic", "helpfulness": 8, "user": "mizzluna", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6599327, "likes": {"liked": "— the location and the beach", "disliked": "— the bathrooms"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "--the rooms are spacious, we had city and ocean views, they are clean", "title": "a good place to stay but be aware...", "helpfulness": 12, "user": "dreducation3", "date": "January 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6577461, "likes": {"liked": "— location on the beach", "disliked": "— lack of amenities and business service -- outdated room accomodations"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "--the staff was super friendly", "title": "New Year's at the Outrigger", "helpfulness": 4, "user": "jasbas", "date": "January 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6540719, "likes": {"liked": "— The location was absolutely great! And, the calamari was delicious!!!!", "disliked": "— The amount of parking per day for your rental."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "-- the Shorebird restaurant is great and well priced ($10 lunch/$20 dinner)", "title": "You won't be disappointed!", "helpfulness": 4, "user": "wjb46", "date": "January 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6539942, "likes": {"liked": "— In the heart of everything, yet not busy.", "disliked": "— coral in thewater."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Second leg of our Honeymoon, we were there for ten nights - absolutey fantastic!", "title": "Paradise at the Reef", "helpfulness": 12, "user": "Helen321", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5791675, "likes": {"liked": "— Just fantastic!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Don't be put off by the fact that there is construction work going on around the hotel. They are obviously trying to improve on already excellent facilities, and to be honest, it didn't bother us.", "title": "Decent Hotel, but be wary of construction", "helpfulness": 9, "user": "jami674", "date": "September 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5782318, "likes": {"liked": "— Calendar of activities", "disliked": "— Construction going on across the street"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The staff went out of their way to be helpful and friendly, champagne was bought up to our room 10 minutes after we checked in, and complimentary buffet breakfasts were ours for the duration of our stay.", "title": "Wilson/Horne Relaxing Vacation!!!", "helpfulness": 8, "user": "CamW", "date": "September 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5776625, "likes": {"liked": "— My Room", "disliked": "— Cleanliness of the dishes"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Only downfall was transferring from the airport to the hotel - it cost us $40 in a cab. Take a tip, ask the bell desk to book you on the shuttle for your return to the airport - it was only $18!!!", "title": "Great location but too much construction!", "helpfulness": 8, "user": "Vahini220", "date": "September 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 5760480, "likes": {"liked": "— The Beach right outside the hotel.", "disliked": "— The rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The room was excellent - bright clean with a fanstastic views over the ocean. The bathroom was a little on the small side, but hey! who spends their vacation in the bathroom? It was clean and perfectly functional.", "title": "Too Much Cobstruction", "helpfulness": 9, "user": "brudda", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 5708451, "likes": {"liked": "— The AC worked well.", "disliked": "— Yuky bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "picked up our car to go site seeing we were greeted by great people, we received directions,weather report, places to stay away from due to road construction and two water bottles. The new rooms are magnificent, new beds and pillows", "title": "Such attention to detail!", "helpfulness": 6, "user": "flydrive&fun", "date": "April 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15359857, "likes": {"liked": "— Location", "disliked": "— Construction - I just see want to see what it looks like when it's done!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My Fiance and I needed to stay somewhere for one night before we started checked into out timeshare in Waikiki as well. We ended up picking Outrigger because it happened to be right next door to our timeshare, and of course it was right on the beach!", "title": "Location A++++, Rooms D-", "helpfulness": 5, "user": "numba1goalie", "date": "February 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 5.0}, "id": 6832285, "likes": {"liked": "— View, location", "disliked": "— rooms decor, room state, contruction 20 feet outside your window!"}}, {"rating": 5.0, "title": "Trust me !!!!! this was a fantastic place", "text": "When we arrived, out check it was smooth as silk, the front desk was overly friendly and very courteous. We checked in around 9:00 PM, and there were no Bellman in site to help us with our bags.", "helpfulness": 8, "user": "Rock-a-hula", "date": "February 13, 2007", "id": 6784690}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "When we arrived to our room, sure enough, it was beautfiul. Because of the busy night, we had been upgraded to a corner room with two balconies looking straight out to the ocean. We deffinatly took home some beautiful pictures, i'll post them later.", "title": "Great Central location", "helpfulness": 5, "user": "jtown41051", "date": "February 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6775397, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My problems with the hotel were the rooms were in DESPERATE need of updating! it seemed like anywhere you looked you saw wallpaper peeling off, cracked ledges on the counter, broken door knob.", "title": "Good location but nothing special", "helpfulness": 8, "user": "lajollagirl", "date": "February 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6748561, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 4.0, "title": "great location and hotel", "text": "The bathroom was also VERY small and had a really bad shower inside. There was mold in all the right places, and the caulking on the metals frame to the door was virtually non exsistant. It didnt help that when taking a shower, the shower drain was clogged up, and we turned it into a bath tub!", "helpfulness": 8, "user": "benihana07", "date": "January 17, 2007", "id": 6612673}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I can't recommend the Outrigger Reef On The Beach highly enough. In spite of the remodeling construction going on, we felt we were treated like royalty and the acommodations were excellent. Upon our arrival we were upgraded from a partial ocean view room to a full ocean view room free of charge (beautiful view of Diamond head and the beach below), the doormen were always cordial, friendly and helpful and remembered us by name each time we saw them. The service was simply top notch, for me the most important part of a hotel stay. The rooms were impecably clean with a warm island charm. The atmosphere throughout the facility just oozed the Hawaiian spirit and kept us in the mood the whole trip. While not the most luxurious hotel on the block, we just loved the homey feel and the way we were treated. If that's your thing, then don't hesitate to give the Outrigger Reef a try.", "title": "Best Hotel Experience yet", "helpfulness": 2, "user": "Scotius2001", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18794268, "likes": {"liked": "— The personal service", "disliked": "— Breakfast buffet was so-so"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Stayed for 7 nights during the Marathon", "title": "Great value for your money; will definitely stay there again :-)", "helpfulness": 7, "user": "traveller0808", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53324848}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Thumbs Up:", "title": "Waves crashing on the beach", "helpfulness": 1, "user": "SEDM1", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53320072}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "-great location: hotel is right on Wikiki beach, walking distance to many high end (Gucci, Bally, Tiffiany, LV, Cartier.....well you name it!) and local shops and restaurants on Kalakaua Ave (5-8 mins), Ocean Walk (1 min), and Ala Moana Shopping Center (20-30 mins). An ABC store (a convenience store) is just steps away from the hotel.", "title": "Love this hotel.", "helpfulness": 7, "user": "Oscar A", "date": "January 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52989257}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "-clean and spacious room with a small balcony", "title": "Fabulous as Always!!", "helpfulness": 1, "user": "HowManySleepsNow", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52851120}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "-fridge in the room for use", "title": "Over - Rated", "helpfulness": 4, "user": "ItsIttoday", "date": "January 6, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 52799723}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I stayed in room 741 and it was very \"70's.\" In fact, I am sure that was the last time they did any type of remodeling. Currently, they are remodeling and based on the reviews it seems that some patrons have stayed in the new rooms. I was not so lucky. The beds and carpets were fine, but the bathroom was pretty gross. Please see the pictures and judge for yourself.", "title": "Good Location ...Yucky Rooms!", "helpfulness": 17, "user": "santanabes", "date": "August 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5597545}, {"rating": 1.0, "title": "Don't Waste Your Money", "text": "First visit to Hawaii - we paid for a superior vacation and thought the Outrigger Reef on the Beach sounded great. But, our rooms were like going back to the 1970's - very small, old furniture, peeling wallpaper, stained carpet, no natural light etc etc. Shower extremely dark (no natural or articifical lighting) and tiny (similar to a brown virtical mouldy coffin), view from small rusty balcony - stairway to neighbouring hotel. Located well for the beach especially if you like stoney beaches. We did complain about our rooms to the respection desk, but nothing they could do!Shorebird restaurant is a rip off.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 27, 2005", "id": 3418708}, {"rating": 2.0, "title": "Paid for the view, not the accomodations.", "text": "After weeks of sorting through internet pictures to find the best hotel on the beach for the most economical price, we were essentially dismayed with the condition of the room. The biggest problem being the state of the bathroom. The shower intermittently went from ice cold to scalding hot. A terrible danger, especially to those with children, it's something which they really need to address. I spent more time fiddling with the temperature and jumping in and out than taking an actual shower. There was also no bathroom ventilation, either because the fan was broken or perhaps didn't even exist. Which would in turn explain the mold on the ceiling and on the grout between the bathroom tiles. It wouldn't have been so bad for a night or two, but a week is pushing it. The room was small, which is livable, but the termites crawling around the wall sockets was repulsive. On the other side of the coin, the view and the location of hotel is spectacular. There are 3 restaurants located within and numerous stores. The concierge as well as front desk staff were all friendly and helpful. If you have no hang-ups about room quality, this hotel would be a great choice.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "April 27, 2005", "id": 3418670}, {"rating": 5.0, "title": "Another great stay at The Outrigger Reef on the BEACh", "text": "We had another great vacation (fourth visit) at the Outrigger to celebrate our 25th Wedding Anniversary. Our room was a Garden Terrace clean and well maintained. Food in all the restaurants very good with excellent service. Lewer Street is just about to be redeveloped so there may be some noise and dust in coming months. Hope that we will visit again in a couple of years after the redevelopment to see how the area has been improved.", "helpfulness": 8, "user": "Northdowns", "date": "April 15, 2005", "id": 3366471}, {"rating": 4.0, "title": "What a difference a room makes!", "text": "My daughter and I have now had the opportunity to stay in four different rooms at this hotel between October 2003 and April 2005. We have stayed in a high-level partial-ocean view room which had a nice view, two beds, fridge, lanai, but no tub; a 5th floor Pacific Tower corner (Rm 547) non-smoking, which had the other ammenities listed as well as a microwave, some plateware, a small table for four, and a fold-out couch, plus a lanai with no view; a Pacific Tower non-smoking room with no lanai, no tub, no microwave, paper-thin walls, and noisey appliances (RM 1167); and finally a room in the Diamond Head Tower building (Rm 477) on the smoking floor, but with more space, two beds, a shower, lanai, fridge, small table with two chairs, all of which suited a longer stay and if we leaned we could see the ocean from the lanai. We got the Diamond Head Tower room by complaining about #1167 the morning after our first night's stay there. We had five nights to go on our vacation so it was worth it to speak up, and we didn't have to pay for an upgrade. Thank you Matt at the front desk!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 14, 2005", "id": 3357299}, {"rating": 5.0, "stay_parameters": "Stayed April 2004", "text": "I recommend the Diamond Head building, which is only four floors and the farthest from the front desk, because it is quieter and close to the pool -- really great if you have a child. We used the starcase in lieu of the elevator all the time. The Third floor is non-smoking, and the fourth floor is smoking, but we were not bothered by the fumes for the most part. If you keep the lanai doors open, you will smell bacon frying in the morning and hear and smell the evening activities at The Shorebird Restaurant, but I swear it all shuts down promptly at 10:30 p.m., even on the weekends.", "title": "Fantastic", "helpfulness": 12, "user": "worldstepping", "date": "April 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3353604}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 83, "average": 225, "very good": 961, "terrible": 50, "excellent": 1816}, "aka": "Outrigger Reef On The Beach Hotel", "slim_ranking": 0.0722891566265, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}