{"user_rating": 4.0, "review_count": 25, "name": "Oxford Inn Silverdale", "reviews": [{"rating": 3.0, "title": "Standard Room in Standard Town", "text": "This is the older sister property to the new and nearby more upscale Oxford Suites.", "helpfulness": 2, "user": "wonderfulworld", "date": "October 19, 2008", "id": 21011910}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Our room had two comfortable queen beds, a desk and chair, a little dining table and two chairs, a TV with dozens of channels, a microwave, a refrigerator, a coffee pot, and an ac/heating unit that was on the noisy side, but we didn't use it.", "title": "Three stories, no elevators", "user": "ProudToBeFromBend", "date": "September 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 8603580, "likes": {"liked": "— Price, location", "disliked": "— No elevator, older property"}}, {"rating": 4.0, "title": "Perfeclty OK basic \"passing through\" motel.", "text": "This is a basic motel in a busy location. We stayed overnight because it was a good stopping point on the way to our next destination. It is a very good motel of its kind. Lack of elevators, even with three floors, is a bit odd, and while the front desk staff was consistently efficient, they have apparently never been told how valuable a smile is in the hospitality industry. Nobody smiled. The continental breakfast was, like everything else, basic -- but we got fair value for the money.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 27, 2011", "id": 115869413}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This is our second time staying at the Silverdale, WA Oxford Inn. We returned because Diane @ the front desk was so friendly. She and Teresa were both awesome. They treat us like family. Our rooms are clean and we have all that we need when we stay there. The rates were great. The service was Impeccably professional yet personal, fun and friendly. They go out of their way to help or answer any questions we may have had about the area or sites to visit. We will stay again when we return to visit our daughter and her family.", "title": "Like being home", "user": "LompocLauramom", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102492544}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Good basic spot to stay in Silverdale . The rooms were small but very nice with down comforters, and the free continental breakfast featured really good oatmeal w/ fruit & nuts & good coffee too! Staff was very friendly and overall atmosphere excellent. If you don't plan to use or care to pay for the pool, water views & restaurant at the Silverdale Beach Hotel across the street, then this is the place for you.", "title": "Basic but very attractive rooms, great service & location!", "helpfulness": 1, "user": "letsgetoutahere", "date": "February 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57199954}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Clean room, good service. Better than average experience. I'd definitely come back here.", "title": "Good value.", "user": "hausman", "date": "August 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 38823274}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We came from Japan and needed a place to stay that allowed pets. Oxford Inn is just that! My wife, daughter, dog and cat were quite comfortable. The hotel is near a lot of stores and restaurants. I was very pleased and will stay there again!!!", "title": "Nice place", "helpfulness": 1, "user": "CALIFAN26", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23215078, "likes": {"liked": "— Allowing pets", "disliked": "— N/A"}}], "location": {"country": "United States", "city": "Silverdale"}, "stars": 2, "variance": {"poor": 4, "average": 6, "very good": 6, "terrible": 0, "excellent": 9}, "slim_ranking": 0.428571428571, "description": "Exceptional has never been so affordable! You’ll find dining, shopping, golfing, and sightseeing just minutes away. We are pet friendly too! Complimentary amenities include a Continental Breakfast , High Speed WiFi, Parking, and Premium Bedding. Ask about our extended stay rooms and rates."}