{"user_rating": 3.5, "review_count": 626, "name": "Oxford Spires Four Pillars Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Stayed here on business just for one night and found the hotel to be very pleasant with well appointed rooms and an efficient and friendly level of service. Free newspapers in the reception are a welcome touch. Tried out the the gym, which typically for a hotel is fairly small, but had all the equipment I needed for a bit of a workout. We dined at the hotel, and I was very pleased to note that the kitchen had been given a 5 rating for food hygiene by the local council. I had a problem with my starter but this was dealt with satisfactorily. The food was generally fine if a little unmemorable. Breakfast was an average affair, typical hotel buffet, with fairly slow service for hot drinks and any items cooked to order. All in all a good stay and one I'd be happy to repeat in the future.", "title": "Safe choice", "user": "anonKingston", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 139386087}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is the first time we have stayed at this hotel and we enjoyed it very much. Everywhere was very clean, the staff were more than helpful nothing to much trouble, in particular the barman Petre could not fault him. We were on a deal that gave us an meal in the restaurant on the first evening and we could not fault the food, also the breakfast which was self service and once again the food was excellent. We had a standard room which was very clean and very well equipt, if I have one gripe with it being a 4star hotel I would have expected a bottle of water in the room as standard. My other little gripe was the bathroom, although spotlessly clean it had a little bit of mould in the sealant and also, the shower curtain could have been of a better standard for a 4star.Having had my little moan we would not hesitate to stay here again it is a lovely walk beside the river to get into Oxford, which takes about 20mins.", "title": "Nice Hotel", "helpfulness": 1, "user": "Jim G", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139172820}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I stayed at this hotel for two weeks while participating in a sporting tournament in Oxford. While generally I was quite happy with the hotel there are a few aspects that deserve comment. Firstly its not air conditioned which means that the rooms get very hot in Summer. We were on a top floor facing West so we had the afternoon sun heating our room. The standard room we occupied while otherwise comfortable and spacious also did not have a bar fridge. The management on request provided us with a fan which made it a little more bearable. The hotel restaurant was expensive by comparison to some of the pubs in the area (see my review of Duke of Monmouth only about 500 metres down the road).", "title": "A good base for Oxford", "user": "MaurieDobbin", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 138422284}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed at the Four Pillars for three nights while in Oxford on business and was thoroughly pleased with my visit. I arrived in town early on Sunday morning, August 19th. It was well before check in time when I got to the hotel and they were unable to get me in early, but did lock up my bags in a room which allowed me to start exploring the town without having to drag my stuff with me. By the time I got back to the hotel around 1:00 p.m. it was still before official check in time, but they had my room all ready to go. The room was a very good size with a nice bathroom that had a huge tub. The bed was very comfortable, not too hard or soft and there was a nice size TV in the room. My room was towards the back of the hotel on the first floor. Very quiet and peaceful, I slept so well, the only sounds I heard was the occasional shutting door, other that that I heard nothing. No air conditioner or mini-fridge, but I really didn't miss having them. I slept with the widow open at night and that did the trick. The widow is designed to only open a little, not nearly enough for someone to get in, but big enough of a breeze.", "title": "The perfect place to stay.", "user": "flemister60", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138214369}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "I went to breakfast for the three mornings I was there and I was completely satisfied. It was buffet style and everything was there to constitute a well rounded breakfast, two styles of eggs, bacon, sausage, hash browns, beans, pastries, breads, fruits and other things that I know I am forgetting. There were plenty of servers moving about the spacious restaurant making sure everything was in order. They were very attentive, but not to the point of being bothersome. The only other time I ate at the hotel was my first night when I ordered room service. No hassle, fast delivery of very hot food with everything I needed. The gym is small, but well enough equipped to make your workout worth while. Some free weights, compound machines, two elliptical machines, two treadmills, two TV's, a water dispenser and free towels at the front desk of the spa. If I every have the opportunity to go back to the very lovely city of Oxford, I absolutely will make reservations at the Four Pillars Hotel", "title": "Excellent hotel in Oxford", "user": "francescavillis", "date": "August 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137847250}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "The.hotel is comfortable clean with good service. Located well for oxford city centre.", "title": "Comfortable and clean even though its undergoing a refurbishment", "helpfulness": 1, "user": "A1bossywoman", "date": "August 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 137796867}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I ate in the restaurant and it was very good. A little expensive and also I d advise checking your bill as a mistake or two had been made on ours.", "title": "Weekend in Oxford 10th & 11th August '12", "user": "WillsyGrimsby", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 137452028}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Just stayed two nights at the Four Pillars, Friday & Saturday. Have no complaints whatsoever regarding this hotel, ample parking, quick & efficient check in, polite & friendly staff throughout. Nice clean room with good facilities. We ate at the in-house restaurant on the Saturday evening, booked a table via reception but still plenty of tables. Food was very good and the service was excellent.", "title": "Wonderful.", "user": "LancashireEllie", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137429751}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The only downside was the door banging that went on until gone midnight, not the hotel's fault just selfish guests who had no respect for anyone else after they had \"a sniff of the barmaid's apron\".", "title": "I'd stay there again anytime", "user": "Michael F", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137378627}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The Hotel is in an excellent location, through a gate, down a path through fields and you are at the Thames, quick left turn along the river bank and a short stroll to the city centre.", "title": "Decent Hotel in a Beautiful Area", "helpfulness": 2, "user": "Stephanie F", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 137200798}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed here for a bit over 2 weeks in a standard room at the front of hotel. Clean & well maintained room, but no bar fridge. We were told that an upgrade was needed to get a fridge. very high step to get into bath for a shower. The kitchen and dining areas were being remodeled during our stay but breakfast was still ample and service good. Although some staff better than others.", "title": "Pleasant Setting", "user": "wiskey", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 140640161}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We had the odd meal & drinks in the lounge area & also outside in the grounds. A bit expensive when compared to pubs in the area. It was nice flat walk along Thames back into Oxford and just a bit of a slope up to the High street.", "title": "Nice Hotel walking distance from Oxford City Centre", "user": "5cottie", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140455741}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Swimming pool/ spa/ sauna & gym are well kept, with enough equipment to get a good workout. The grounds are lovely with ample area for kids to run around away from the parking areas.", "title": "Nice hotel, clean and comfortable", "user": "lyzzydee", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140169299}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "Very pleasant Hotel. Great staff, very professional. Large rooms nicely laid out with all normal facilities yet much more character than most modern four star Hotels. The bathroom was large and luxurious and the views from the rooms pleasant being set well back from the road in it's own grounds. The open plan bar was relaxed and comfortable. Needless to say the Hotel was clean, as you would expect in a Hotel at this level.", "title": "Business-like and comfortable", "helpfulness": 1, "user": "BradWPerth", "date": "September 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 140109686}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We spent two nights at the hotel last weekend. Reception staff were helpful and we were allocated a twin room 103. The room was spacious, clean and comfortable overlooking the front of the hotel. We ate in the hotel on the first night and the meal was very nice.", "title": "Nice clean hotel", "user": "Chefbear1", "date": "September 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140084973}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "During our recent weekend to Oxfordshire we were taken to the Four Pillars hotel where about 13 of us had a meal. The location and the hotel itself looked excellent and the service was good but we found that the meal was not up to our expected standard. It may have been because we had booked our meal for 2.00 and we were the last guests in the restaurant but we were very disappointed with the quality of the food which tasted as though it had been kept warm and my salmon was dry, tough and I was unable to finish it. The vegetable selection was very poor and not at all hot and as tasty as we would have liked. The puddings were good though, a good selection and very tasty. However, I would not recommend it for a return visit. Sorry.", "title": "Lovely place but poor meal", "helpfulness": 1, "user": "TonyandChris1929977", "date": "September 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 5.0}, "id": 140057575}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The rooms are definitely in need of an update, to be fair they were doing this when we stayed there but they hadn't made it to our room yet! Unfortunately the redecorating meant that you could hear drills and banging at certain times (and we were only there one night) We thought breakfast was extremely expensive, even with their discount so we chose not to eat there. The setting is pretty though with green fields full of horses and it's not to far a walk into the city centre, there was also plenty of parking too.", "title": "Pretty setting but inside doesn't quite match up to that", "user": "sunny88sydney", "date": "September 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 139711470}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Great looking Hotel set well back from the main road. The interior looks jaded and could do with a lick of paint. Drinks and food over priced.", "title": "Needs redecorating", "user": "tolly_roger", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139645535}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Easy walking distance to the city center ( Use the hotel gate and walk along the Tames into the city). First class fitness center swimming pool, steam room, Jacuzzi, wonderful -never used gym. Enjoyed Our nights stay.", "title": "Great Wedding Venue, Fantastic Rooms", "user": "Jon_Daniels", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139575859}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Enjoyed a really good wedding here over the weekend. We also had a room in the new renovated Eastwyke House. Large spacious rooms, all brand newly furnished. Lovely.", "title": "There are better value hotels out there", "user": "Hood_UK", "date": "September 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139506725}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 54, "average": 151, "very good": 275, "terrible": 11, "excellent": 135}, "aka": "Oxford Spires 4 Pillars Hotel", "slim_ranking": 0.325581395349, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}