{"user_rating": 4.0, "review_count": 920, "name": "Oyster Bay Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at OBBR for our Honeymoon from 9/8-9/15 and thought the resort was nice, courteous staff and wonderful housekeeping. We arrived at 3:30 PM but the room was not ready yet, we waited by the pool and got into our room just after 4 PM. No problem at all. We had a 1 bedroom suite on the 1st floor overlooking the marina. I actually enjoyed this as it reduced the number of stairs tremendously and you were still elevated and could see the marina just fine. Only complaint about this side is employee parking is the lot below the main parking which runs along the water, and they would play their car stereos loudly on some nights.", "title": "Nice trip", "user": "explorer6380", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 8739791, "likes": {"liked": "— Nice room, pool and beach"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We dined at Daniel's (Mr. Busby's during the day) which is next door. Do not waste your time or money at Daniel's. Ordered 2 \"Butterflied Filets\" which were not filets at all, and let him know this as well. Way overpriced for what you get and there are far better places to go on the island. Only ate at Infinity once, the hotel restaurant, and that was for breakfast the morning we left. Limited menu, but the food was good. We highly recommend the 3-island snorkel tour with Captain Alan off the hotel marina. Great guy and a fun day which includes a mud bath on Tintamore island. It is a half day trip. We found Dawn Beach to be pleasant as well as Orient Beach, do not miss. As far as location, we did not mind being away from the main cities, we had a car. If we were to return to St. Martin, I would probably try out Divi Little Bay which looked nice in passing it as well as it is just outside of Phillipsburg and closer to Simpson Bay where you will find the majority of restaurants.", "title": "Loved it! what can I say!", "user": "littlebeachgetaway", "date": "August 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8396249, "likes": {"liked": "— Cleanliness and beauty of premises.", "disliked": "— smoke alarm in the kitchen. it went off repeatedly when cooking."}}, {"rating": 5.0, "title": "A VERY relaxing and fun-filled vacation in St. Martins", "text": "Try Talula Mango (sp) on Phillipsburg beach, great place for lunch or to spend and afternoon at Blue [--] Bar. We had lunch while waiting for some jewelry to be resized that we purchased on Front St. My only complaint is that we went during the off season (late August to early October) and the majority of French shops and restaurants in Marigot and Grand Case were closed. We didn't even bother going over to St. Barth's as we heard it would be much of the same. These towns were virtually abandoned while we were there. But the positive is that traffic was light except for a couple of intersections, both on the Dutch side. On the main road which is a 3 way yield, not stop, yield (which means a free for all) which leads to Phillipsburg, Marigot or Simpson Bay, this was always backed up. And the worst intersection was coming out of Phillipsburg toward Cole Bay Hill and the marging traffic from the Middle Region before the traffic circle, awful. However, at this traffic circle you will find the best market (like any supermarket in the US) and I don't remember the name, but it is next to Mark's Place, which we also dined at and recommend. You will find many locals here. Our other favorite was a casual place in Simpson Bay called Pineapple Petes, great food and service, reasonable price. Overall, a good hotel, probably upper 3 1/2 stars in the US. The pool area and exterior walls could use a power washing and some fresh paint, but if that is my only complaint then that is not bad. Also go to Beau Beau's all you can eat BBQ night, good ribs and great chicken. And our housekeeper was wonderful everyday, and even cleaned up our breakfast dishes witch we didn't have a chance to clean that morning which we did not expect.", "user": "Denise S", "date": "July 17, 2007", "id": 8139477}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We traded out our timeshare to stay in OBBC. It was a good thing!", "title": "A Beautiful Escape", "user": "dasweetest1", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8128143, "likes": {"liked": "— The Maid service was excellent", "disliked": "— The air conditioner should have been service prior to our stay"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had been to SXM before and wanted to stay on the french side. This was as close as you could get and still have the american touch. Our room was on the third floor overlooking the marina. a quiet and beautiful view. The rooms were clean and in good shape. the only gripe I have is with the smoke alarm in the kitchen it is situated right over the oven and frequently goes off if you cook. The maid service was nice. The staff very friendly and I would recommend again. We ate at Mr Busby's and weren't that impressed, must have been on off night. Our fav's were the grand case for very different styles of food. lots of culture.", "title": "Very Relaxing and Peaceful", "user": "bronze28x", "date": "July 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8124101}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We just returned from spending a week from 04/07/07 to 04/14/07 at OBBR. We had a fabulous time overall. The resort was very beautiful. The weather was great, the water warm and clear, and the beaches and pools clean. However, the hotel front desk was courteous but not overly friendly nor overly helpful. We found it almost impossible to get a travelers check cashed there. If fact, I did not get any cashed there but a traveling companion managed to get a $20.00 one cashed. We did get a couple cashed at the OBBR restaurants but they did not give us the coin change as they did not have it. So in essense they rounded our bills up to the next dollar. We did not like that & found that kinda odd. Once the waitress gave me change out of her own wallet. The food was very good but expensive to eat there all the time. Breakfast at Mr. Busbys is good. We were told by several people to eat at Marks Place at Cul de Sac and it was Excellent!! and not expensive. The casino at the Wyndham hotel down the road is great and they have tables and slots.", "title": "Had a Great Time at Oyster Bay Beach REsort", "user": "beachbav", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7381147, "likes": {"liked": "— Pool and Beach & Close to French part of Island", "disliked": "— Front Desk Staff"}}, {"rating": 5.0, "title": "White sands, warm water", "text": "We just returned from a week in St Maarten at the Oyster Bay Beach Resort on the Dutch side. It was very enjoyable. The resort was excellent with friendly, helpful staff and a great mix of beach, restaurants and facilities. We had three second-story studio units with excellent views from the balconies on the ocean.", "user": "svrtexas", "date": "April 17, 2007", "id": 7380548}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Dawn Beach has great water, excellent snorkeling, $10 BBQ rib plates available for lunch, 75 cent beer from 11 to 4, and Beau Beau's happy hour from 4 to 6. We rarely felt the need to leave the resort.", "title": "Wish it didn't end!", "user": "ADTK", "date": "April 4, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "business": 3.0, "rooms": 4.0}, "id": 7281212, "likes": {"liked": "— The room was very clean every day. New towels and bed made up. Dishes done.", "disliked": "— Smoker next door on balcony."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We did rent a van/taxi for a day for a tour of the island. Dennis the driver was good for history and desriptions of the various regions of the island. Peg Leg Pub was excellent for dinner and drinks. The Sunset Beach Bar was a major disappointment. They would not honor their internet coupons, had rather unfriendly staff, and really stood out as a tourist trap with a capital \"T\".", "title": "Very Rude and overpriced", "user": "Danzer", "date": "April 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7270687, "likes": {"liked": "— nothing", "disliked": "— the hotel management attitude"}}, {"rating": 2.0, "title": "Oyster Bay-Just Okay", "text": "Overall, St Maarten is a great place to spend a week in the sun with friends. Next time we may do a bit more sailing, shopping and bar hopping.", "user": "joeybaggad", "date": "March 29, 2007", "id": 7246070}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I stayed at this resort a few weeks ago for our honeymoon. My family owns at another resort on the island and we traded out to this one. We are SO happy we did. For the 10 years that my family has owned on the island, we've been content with our home location, which is an older property, because we aren't high maintenance.", "title": "Simply the Best!", "helpfulness": 7, "user": "Marlene R", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178465490}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Well, OBB has shown me the error of our ways. My husband and I travel several times a year using my timeshare and have never had such a wonderful experience at any other resort!", "title": "Awesome", "helpfulness": 10, "user": "pnp08", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177959256}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff is friendly, attentive and extremely personable. Now don't confuse this with \"it's their job,\" no no. They are genuine and I think it's because they love their jobs and where they work.", "title": "Unbeatable views!", "helpfulness": 11, "user": "Michael H", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177674049}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The resort is just beautiful and offers many entertainment options on and off-site. We loved it so much that we purchased a timeshare directly from that property.", "title": "Nice week away", "helpfulness": 7, "user": "MFSK", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177432409}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Amazing views, great restaurants, awesome infinity pool and great location.", "title": "Fantastic Trip", "helpfulness": 12, "user": "JudyG8201941", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176996052}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We stayed at the Oyster Bay Beach Resort May 12-19 and were very impressed with the hotel and the service that we received. We had blindly bought a timeshare there on the resale market and we're at all sure of what to expect. The pool area is absolutely wonderful and the view of the ocean and surrounding islands from our hotel room was just gorgeous! Yes, the resort is in more of a secluded part of the island, but to be honest that's what we liked the most about it. It is quiet there, yet the drive to action is doable. We also spent a day at Orient Beach which is by far a more touristy section of the island. It too is beautiful though and a must for anyone who visits the island. We had a wonderful trip and we will definitely be back!", "title": "Awesome Experience", "user": "thetisdels5104", "date": "May 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7672899, "likes": {"liked": "— Pool", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "FYI ~ Spirit Air flys to St. Maarten now at very reasonable fares.", "title": "Tropical Paradise!! May 12-May 19, 2007", "user": "acandpj", "date": "May 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7671734, "likes": {"liked": "— Spectular ocean view and pool", "disliked": "— Front desk staff seem a little impatient at times."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Just returned from 7 wonderful days at the Oyster Bay Beach resort. The websites that give reviews are a great resource. But after visiting the resort I believe you just have to sometimes take a chance for yourself, everyone has a different opinion. We were guests of family members that are owners. This resort was in an ideal tucked away location. The check in process was without hassel. The grounds to the resort are immaculate and you can see the effort put in by the staff to keep it that way. Our accomdations far exceed our expecatations. We had a one bedroom suite that had every amenity of home. The housekeeping staff kept the place immuclate and there were fresh towels every day. One day we returned from our outing and there were fresh placemat rugs in the bathroom and bedroom. Upon our arrival we attended a Welcome Orientation that basically gave you a schedule of activities and things to do on the island which was very helpful. The resort was surrounded by the beautiful water. The front side had a spectacular marina view of many sailboats. Laundry facility, exercise room, gift shop, all on hand. There was a small grocery store with items and a nice restuaurant called Big Fish that we ate at for breakfast the food delicious and very reasonable. The staff so friendly. The resort was very accomodating the poolside the best. The spectular view of the infinity pool just kept you going back everyday. The staff there waited on you had and foot. The bartenders at Infinity were so friendly. This resort is the type of place you have to pull yourself from daily to go out and explore because of how relaxed the atomosphere is you just could hang out at the pool or beach all day. We did rent a car and explored the Island at our own pace. We did a grocery store shop on the island tour. This was helpful, as we had full kitchen amenities, and was able to make some of our own meals. There was entertainment and the activites staff kept you occupied if you wanted to do so. We ate mostly at the Beau Beau's restaurant the food was good. We attended the 3 island snorkel trip and it was our first time. The captain was very helpful as well as his assitant Arlene she actually gave us personal attention during the trip. We would definitely plan to go back there. Its the ideal place to go to just relax.", "title": "St. Maartin is great", "user": "sandralynne", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7614797, "likes": {"liked": "— The pool was amazing!", "disliked": "— Location. Had to take a cab everywhere that was not on the resort."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I went to Oyster Bay for our honeymoon. We used his parents timeshare exchange and a getaway for a two week trip. Two weeks was great for me, but I could sit on a lounge chair and read a book forever. If you are a busy body and can't sit still for two weeks, only go for one. The hotel staff was great. The reception was a bit cold, not rude, just not overly friendly when we checked in, but there were no problems. They had our information and someone brought our luggage to the room. The first week we stayed in a studio with a kitchenette and ate breakfast in the room. We ate at Beau Beau's alot during week one and enjoyed it. Everyone was nice there and got to know us by name, which was fun. Get the Lobster Thermador (if they have it, we only got it one night because their lobster selection isn't always available). We ate at the Infinity restaurant one night and was not overly impressed. Nothing bad, just not great. The Infinity bar, however, was great. The barstaff there was awesome! Casper is the best bartender and is so much fun. We spent a majority of our days laying by the pool and getting lunch and drinks from the bar. Nothing fancy, just bar food. We went to Captain Oliver's two nights. I loved it, but my husband got sick from it both times we went. I guess it depends on if you have a sensative stomach. They have a bus that comes and gets you and drops you off. We ate at Mr. Busby's down the road a couple days and it was ok. The only truly positive thing about that place is the $.75 carib beers they have. The food was ok, but the service was not consistent at all, borderlining on horrible. But it's cheap enough for lunch and VERY cheap beers. We did not rent a car and did not have a problem. The activity desk will call you a cab wherever you want to go and the hop on hop off bus was great for us. Some people complained that there wasn't enough options, but for us it was fine. We did the three island snorkel with captain alan and coleen, it is a must! Not only is it a fun morning, but they take you to an island and you get a mud bath. Good times. We did the 12 Meter Regatta which was another must do. So much fun! Orient Beach is great, lots of naked people, but fun. Foods expensive on the french side and everything has a 15% tax. We kept our dining to the Dutch side because we did not want to pay 30% on top of dinner (15 for tax and 15 for tip). The second week we upgraded to a one bedroom and that was great. Full kitchen and very large bathroom. We went grocery shopping once via the hop on hop off bus and had no problem. Make sure you go to the grocery store because the Mom and Pop's store is expensive and they hardly EVER had change so everything was rounded, not a big deal but $.70 a day is annoying. Big Fish was good for breakfast, enormous fruit plate and breakfast sandwiches. Overall a fantastic trip!!!", "title": "Great Vacation", "user": "Yigael", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7555409}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We traded our Timeshare in Scottsdale for the OBBR. I will initially state that we had a fantastic time on our vacation, though we spent very little time at the resort. We had a studio, with a small kitchette. The room was immaculate and very nice. Then entire resort for that matter was pretty well kept. We only spent one day on the property, the day after we arrived, just to relax and catch up to the time change. We spent most of the day at the pool, which is as spectacular as the photos. We went to the beach at the end of the day, and we were not too impressed. The beach area was quite small and there was a lot of seaweed on the beach and floating around. Needless to say we found other beaches the rest of the week. We booked two excursions through the resort. Monday was Carnival and the resort had buses for us to attend. It was quite an experience. We also went on a snorkling trip to Anguilla. Well worth it. Captain Arthur and his crew were very hospitable and entertaining. The first night we ate at Daniel's which was right outside the resort. Service was terrible and the food was very average. We did not eat in the area again. OBBR has a two for one happy hour from 4-6 and the bartenders were very nice. Overall I was impressed with the staff. I had read about their indifference but saw none of that. If you like to explore, you will need a car as we did. We spent most of our evenings at Grand Case and our days at Orient Beach. We will be looking forward to our return.", "title": "Very relaxing, enjoyed being away from the crowds", "user": "sblackmon", "date": "April 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7432791, "likes": {"liked": "— view of the ocean and the beauty of the pool Room was very comfortable", "disliked": "— not close to much"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My wife and two Children (ages 10 1/2 and 13) spent the last week of June at the Oyster Bay Resort. First of all let me tell you that getting to St. Maarten was very easy and affordable from Florida. We flew from Orlando thru Ft. Lauderdale on Spirit Airlines. The cost was 1500 US for four people. Vary basic low budget airline but yes it did get our fannies there!!! Princess Juliana Airport very modern and new. Getting thru customs took about 20 minutes and we were off to Oyster Bay.", "title": "Above and Beyond Expectations", "user": "PalmCoastPete", "date": "July 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8065262, "likes": {"liked": "— the views and the staff", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Before travelling we had booked a car thru Payless Car rental.", "title": "We had a great time", "user": "ScrapQueen22", "date": "July 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8064496, "likes": {"liked": "— The view from the balcony", "disliked": "— no elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "They met us at the airport and took us to pick up our car. Cost", "title": "relaxing vacation", "user": "cottingham2556", "date": "June 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8027281}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "121.00US for one week. Gas was 99 cents litre US. Never had to fill up car until last day 30 dollars US.", "title": "First time in OBBR", "user": "Hootie1731", "date": "June 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 7752759, "likes": {"liked": "— Pool and the great view from our room.", "disliked": "— far away from the downtown scene and the cleanlieness of our room."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My first impression driving to the resort (25 minute drive cross island) was not great. Alot of poor depressed areas, but having lived in the Caribbean myself in the past I knew what to expect.", "title": "Enjoyed our stay at Oyster Bay", "user": "cadenise", "date": "June 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 7740323}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This resort is our yearly spot during April. Festival times. First, let me tell you that the staff is five stars. They treat you like they know you for years and some have even remember our names after a day.", "title": "Our Yearly Spring Spot", "helpfulness": 10, "user": "Roger R", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176886615}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The resort provides daily activities, so if you follow their plan, you will stay somewhat busy. However, we mainly go there for the beaches and relax under the sun.", "title": "Best Resort Vacation Yet!", "helpfulness": 9, "user": "Donald A", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176885547}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Some rooms are updated, they are still working on renovating all. Ask for a renovated room. We stayed in one last year (2012) that was not and the TV was antiquated, and so was the decor. But this year a new fresh day. Pleasant room.", "title": "Nice resort, great area, with a few issues.......", "helpfulness": 4, "user": "pcteamchevy", "date": "September 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176871761}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Cab vs car rentals. Depending on what your objectives are, or how much you plan to move around, a rental car is best option if you are going places. Cabs fairs will overwhelm you, as most of the main attractions are on the French side. A good 15-20 minutes. We love to stay here and evening plan on the French side, and the beaches on the French side as well. Great eating places on this Dutch side where Oyster Bay is on. But there are great places to eat all over. That I leave up to you. Everyone's taste buds are different.", "title": "Great Resort!", "helpfulness": 7, "user": "Barbara S", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176684500}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I hope this helps. As we have been coming here now about 5 years in a row.", "title": "Pluses and minuses", "user": "Karen H", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 176461713}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "OBBR has a nice location on the island if you prefer to be a bit farther away from the congestion of the Phillipsburg/Simpson Bay area. If offers both a dramatic ocean view and a picturesque harbor view with mountains in the background. As others have noted, you need a rental car here unless you are satisfied with staying put, with the occasional taxi trip somewhere.", "title": "Many positives, a few tolerable problems", "helpfulness": 8, "user": "sparisoma", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 176372396}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Our reservation was via a timeshare exchange for a 1 bedroom unit. For the week we had available, the only option we could get was a studio size unit. On the positive side, it had a partial ocean view with a balcony and the breeze was nice. But the studio units are quite small and the kitchen area was a bit frustrating to work with, other than for the simplest food preparation. The A/C unit was of the wall-mount type but was effective and not too noisy. We had a few minor maintenance/condition problems but nothing truly serious. Not all were addressed while we were there, but I assume the management will act on the written descriptions I left with them.", "title": "Good bang for your buck", "helpfulness": 6, "user": "Sudibaci", "date": "September 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 175820640}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We give high marks to the housecleaning staff and the activities desk personnel; all very courteous and helpful.", "title": "Went out of their way to keep us happy!", "helpfulness": 8, "user": "Al W", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175813976}, {"rating": 5.0, "title": "Great two week stay!!", "text": "The beach is nice, not the nicest on the island but not disappointing. It has a great view of Saint Barthélemy (St. Barts), which cuts a dramatic profile on the nearby horizon. This area is not very good for snorkeling, unless maybe you're up for a very long swim out to the true reef. During our stay, this entire side of the island (eastern side) was more prone to wind and waves than some other areas, but the outer reef catches most of that energy so the waves at the beach were quite small. We visited a lot of other beaches on the island - some just to look, not to swim. Among the most beautiful, I thought, were Baie Rouge and Baie aux Prunes. There are many others but some are hard to find and a somewhat long side-trip off the main roads.", "helpfulness": 8, "user": "Joanne D", "date": "September 4, 2013", "id": 175785763}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "One maintenance complaint we have about the resort grounds is a leaking sewer odor that is sometimes noticed in some locations when we were walking around. It was slightly noticeable on the nearest portion of the beach, depending on wind direction. They need to find and eliminate that.", "title": "WOW...Fantastic Time!", "helpfulness": 8, "user": "C00kie909", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175592020}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "In all fairness the resort could get a better rating because most of the staff were very helpful. However like with all resort there are a few that aren't very good at customer service and not helpful and only offer information when asked specifically. We traveled with our 15 mo old daughter and when we arrived they checked us in right away. The crib and high chair I requested was already there which was kudos for their coordination as when I called ahead they even took down my flight information. There were daily cleaning service and the resort doesn't nickel and dime you by providing free wi-if in common area, providing paper towels, dishing washing liquid in the room and providing beach chair and umbrella at the beach. The cons were that there is smoking allowed at the property so there are cigarettes butts everywhere and people constantly smoking around you. Which as a non-smoker and with a young toddler it's very unpleasant. The sand at the beach is the finest we have seen of the many beaches we have been to around the world but is littered with cigarette butts makes it unsightly. Many resorts we stay at have designated smoking areas. The rooms were a bit dated but sufficient with all condo amenities. The information packet provided in the rooms weren't really detailed/helpful. There is no in-room dining available so you have to pick up. The restaurant food was average. The walls are thin and you can hear your neighbor coming home each night or when they are watching a tv show. We stayed on the first floor and faced the marina and right below us is the parking lot so you hear a lot of car noises too.", "title": "Resort with potential but require some improvements", "helpfulness": 1, "user": "wlslb", "date": "September 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 179273883}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Overall, this resort is not catered to families with young children. The shallow end of the pool is the only kid friendly thing it has going for it. The grocery store sells basic things which is nice but there is no fresh milk except for Lactaid, no Cheerios, don't think there's baby food but I didn't look. It has some diapers and wipes. So families should def rent a car bc the taxi ride to the large supermarket is 20 each way. Nevertheless the grocery store sold delicious baguettes, pastries and the staff is super nice. You can reserve your pastries in advance.", "title": "Best Vacation!", "helpfulness": 7, "user": "cardsender", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179263711}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "In short I think the resort has potential but def needs improvement.", "title": "Our week at OBBR", "helpfulness": 3, "user": "swedengrove", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179245399}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed in a beautiful beachy(newly updated)2 bedroom,2 bath,complete kitchen over looking the ocean & St Barths. We could also see the ferry coming & going from the beautiful small Harbor Oyster pond behind us. The hotel lobby area is great & they have fabulous staff at the actvity desk. Happy hour(BOGO) is everyday 4-6. The infinity pool & jacuzzi look to flow into the ocean. There are fantastic restaurants-the infinity restaraunt right there had a delicious all you could eat brunch on Sat complete with\"what do you want on your omelette? Within a 3 min walk you had fabulous other places to eat right on the ocean or by the Harbor. Also a little grocery store & pizza place & gift shop. Our favorite was Beau Beau's overlooking turquoise water Dawn Beach. Oyster Bay has their own area of chaise lounges with umbrellas & outdoor showers. This beach is GORGEOUS! Oyster Bay had ALOT of entertainment going on & we met & had fun with people all over the world! I have never seen a place where also the guests know each other because they come every year & I see why! I can't say enough about this place! Also, If you go... Must do their \"Beach Party\"!!! & do the Farewell catamaran all day trip thru Eagle co. It was recommended & if I were to go every yr I would do this each time!!! So much I haven't shared. It was the Best vacation ever!", "title": "Twelve years and counting!!", "helpfulness": 8, "user": "Dianne S", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178645289}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We had the most beautiful room, 1 bedroom, with large kitchen, dining room, living room, beautiful deck on ground floor. We felt like the pool was our private pool because we just walked out of our balcony on to the pool area. Never needed to get a chair around the pool because we had our own private balcony with our lounge chair, table, etc. In fact our balcony came off our bedroom and living room. Right out our walkway was the beautiful blue surf with waves breaking and we could hear them at night while sleeping. All the staff went out of their way to make sure we were having a great time. We preordered groceries and that was great. We chose not to rent car -- took advantage of the bus tour on Sun and that was great. Took advantage of the $l5 grocery trip on Mon and that was great. Did a 6 hour snorkeling tour and that was great. If we didn't live so far away (we live in Calif) we would surely come back often", "title": "Great views, cool infinity pool", "helpfulness": 4, "user": "EARTHLINGTOURIST", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 178626988}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 49, "average": 113, "very good": 287, "terrible": 33, "excellent": 438}, "aka": "Oyster Bay Beach Hotel Oyster Pond", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Just south of the amicable French/Dutch divide, Oyster Bay Beach Resort awaits. Perched on a coral reef overlooking the Caribbean ocean and Oyster Pond Marina is paradise found. With breathtaking ocean views, white sand beach and countless amenities Oyster Bay Beach Resort and its sister properties, Mainsail, Spinnaker and the Lighthouse serve as your escape from the every day. Find adventure, serenity and the fullness of life at our island resort. Make Oyster Bay your next stop."}