{"user_rating": 4.5, "review_count": 409, "name": "Pacifica Suites Santa Barbara", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Decent facility, but poorly run. When we arrived on a Thursday evening for a 3 night stay, we were informed that the hotel was sold out and they had given away the suite we had reserved. We were offered a reduced rate for a bedroom in the Sexton House, a Victorian house on the property. Feels more like a B&B than an suites hotel, but the decor was fine. The TV remote didn't work and the room was small, with a queen bed and tiny closet. The service problems continued the next day when there was no maid service and they hadn't done anything about the TV remote. There was no hot water for showers on Saturday morning, but by the time we got back to the room Saturday night, the TV remote was repaired, the maid service performe, and the hot water was plentiful. There was no soap in the bathoom, and it took 20 minutes to get some delivered. At no time did management make any effort to apologize for the series of service foul-ups. They just took it in stride as if this sort of thing happens all the time.", "title": "Overpriced and poorly run", "helpfulness": 2, "user": "Roadwearrior", "date": "August 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 18828400, "likes": {"liked": "— Pet-friendly rooms available.", "disliked": "— Multiple service foulups"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The breakfast is cooked to order but very limited - eggs and bacon or sausage. No omlettes or any of the other variety you'd expect at an Embassy Suites. In all things, I found Pacifica Suites disappointing - tolerable, but I'll be spending my money elsewhere in the future.", "title": "One of the best hotels i have ever stayed in !", "user": "catlovertina", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18720358, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "This has to be one of the best hotels i have stayed in and believe me i have stayed in dozens all over the world! I LOVE the Pacifica because it is so quiet and peacful . If you want a relaxing break this is a must . But one tip: Don't bring young children here because they will have nothing to do. !", "title": "Good value", "user": "VisitorBob", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18169820, "likes": {"liked": "— Quiet and well-maintained location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "As mentioned by previous reviewers, this hotel is perfect for visiting UCSB. The rooms are clean and nicely furnished. The grounds are attractive, but my visits are business related and I don't really have time to enjoy the grounds. The hot breakfast is ok and helps to ease the morning start.", "title": "Comfortable", "user": "Horus7", "date": "July 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 17504293, "likes": {"liked": "— convenience, comfort", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My husband and I recently visited Goleta to attend a family gathering and stayed at the Pacifica Suites because of the proximity to the function.", "title": "Love the Pacifica!!!!!", "user": "gnawh2", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15717753}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I would reccomend this property to parents/families of students at UCSB for comfort and location.", "title": "Very Nice Property", "user": "Patricia A", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14891392, "likes": {"liked": "— spacious room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "This is our second stay at the Pacific Suites. We always stay upstairs in room #219 (i think) because it faces the pool and it's by the parking lot and breakfast area. Great service - easy check in, free cookies by the front desk, free wine and cheese in the early evening, and free internet. Confortable bed and good breakfast. We like this place because it's so serene. Everytime we open our shutters, the view always reminds me of Georgia or somewhere in the south. Our little yorky loves it here too. It's an easy 10 minute drive to downtown SB or 30 minutes to Solvang. We will definitely stay here again =)", "title": "Hidden Gem in All Santa Barbara Area", "user": "WKTimpco", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14592564, "likes": {"liked": "— Large, clean room overlooking lush grounds at very reasonable prices", "disliked": "— Make sure you can get a room a bit away from the busy elevated road"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "This hotel is great for anyone visiting UCSB or someone travleing for business. There are a few strip malls in the vicinity, and toursity areas like State Street are within driving distance. If you'd like to stay some where more \"happening\" this might not be the hotel for you.", "title": "Excellent hotel for visiting UCSB or business traveler", "helpfulness": 1, "user": "OCruiser", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10717240, "likes": {"liked": "— Spacious rooms, cooked to order breakfast, clean!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The entrance is a little obscured from the main street as the property and entrance sign are shrouded by trees. I think all the trees do a good job of distracting you from the busy street located behind the hotel. The grounds are very serene and lush.", "title": "Not bad but NOT a good value for your buck!", "helpfulness": 3, "user": "taranaP", "date": "October 16, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "business": 4.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 10086903, "likes": {"liked": "— The well kept property.", "disliked": "— cleanliness and staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The rooms are very spacious and CLEAN. There's a large living room area with a couch, coffee table, writing table, large TV console, a TV and DVD player. There's a sink area that's separate from the bathroom.", "title": "Great location for UCSB parents", "helpfulness": 2, "user": "oldcarrot", "date": "September 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10013195, "likes": {"liked": "— location", "disliked": "— sofa bed was lumpy"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The room is a comfortable size as well. In addition to the TV in the living room, there's a TV in the bedroom. Very nice if you will be traveling with kids. They can watch in one room while the adults watch something in another room. There's also lots of room for kids to run around in the room.", "title": "Pacfica Suites in Goleta", "user": "Siempre_Italia", "date": "August 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8467192}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "There was a complimentary cooked to order breakfast that was served in the historic Sexton House. Very nice ambiance and nice change of pace from the regular continental breakfast that most hotels serve. There were also fresh cookies in the lobby in the evening.", "title": "Very peaceful and plenty of space", "user": "babybuny", "date": "August 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8398357, "likes": {"liked": "— Large rooms", "disliked": "— Distance from Santa Barbara"}}, {"rating": 3.0, "title": "Room Rates Reasonable for Area", "text": "We normally would not spend $300 a night, but it was a romantic 4 days while our son attended Jordan Camp at UCSB. We chose this from recomendations of other parents. Rooms spacious and breakfast made to order above average. Part of our plans included time at the pool and jacuzzi. Unfortunately the fires kept us our of the pool. Staff never called pool maintenance until we requested. Then never followed up. After 1 1/2 days of dirty ash filled pool. Sign from manager read \"Swim at your own RISK\". Upon check out when I mentioned our disapointment in not being able to jacuzzi or pool, a slight apology was given.", "user": "sullibob", "date": "August 8, 2007", "id": 8371049}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Happy hour each night was a highlite of the stay. Besides pool I could recommend hotel to others.", "title": "Great repeatable experience", "helpfulness": 1, "user": "terryworldtraveller", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8236199, "likes": {"liked": "— Completeness", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Our family gathered at the Pacifica for memorable weekend. We found this hotel to be an excellent venue, the staff were very friendly and helpful. The suites were spacious, clean and provided for all our needs. The breakfast that was included was quite sufficient, varied in choice, and quickly served. The happy hour each day was a very nice touch. Great venue for familes although just a little distant from the centre of Santa Barbara.", "title": "Just O.K.", "helpfulness": 3, "user": "DavidBradley", "date": "July 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8206011}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "We will return. Terry UK", "title": "Pacifica Suites - Very Comfy", "helpfulness": 1, "user": "Chet777", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8098077, "likes": {"liked": "— quaint style, friendly staff", "disliked": "— WiFi"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I was underwhelmed by this hotel, particularly given the rates. I agree with other reviewers who have said that the hotel's grounds are very nice, but it just didn't meet my expectations for a room that was over $250 with taxes.", "title": "Beautiful Grounds!", "helpfulness": 1, "user": "monkeytravelling", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8086087}, {"rating": 3.0, "title": "Convenient with some nice touches and some problems", "text": "This was a good place to stay overnight while visiting Santa Barbara. The reception was efficient and helpful and we enjoyed the happy hour in the lobby. Breakfast was fine...nothing more. Beware the rooms that look out onto the freeway onramp. We had a room away from the noise and slept fine. It was however very chilly that night and our heater did not work when we awoke. The next day we noticed many portable heating units in the cleaning staff's storage room...had we known, we would have requested one.", "helpfulness": 1, "user": "TonyPSP", "date": "December 27, 2007", "id": 12001193}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "My husband and I are always driving up to see our daughter at UCSB and we've just found a local hotel gem in Pacifica Suites. We were a little skeptical at first because it is near the freeway, but the property is just beautiful! There is an old historic house that you can tour on site and just delightful gardens and landscaping.", "title": "Definitely worth it!", "helpfulness": 1, "user": "chargerfam04", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11195626, "likes": {"liked": "— great service, great location...very home-like without the typical hotel feeling/look", "disliked": "— no minibar!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We went to visit our son at UCSB and called the hotel directly to book our room with the UC parent discount. Paid $189 per night to overlook the pool. Many of the rooms look out to the pool area, but the rooms that don't looked fine too. All of the rooms have plantation shutters in the bedrooms so the views are obscured of any parking lot. We wanted to bring our dog, but the pet friendly rooms were booked. (There are only four of those, so call early if you want one.) The pet friendly rooms do not overlook the pool area and are on the ground floor looking at a small parking area and trees. I would stay in those rooms without a problem if I could bring the pup. The staff was very efficient and friendly. The rooms are very nicely decorated and each one is a suite so you have a living room, too. The free breakfast is a plus, you can order eggs, bacon or sausage and pancakes if you want. They even have a little espresso machine that makes you an instant latte or cappucino or whatever you want. The happy hour was nice. We were able to go down and pick up our wine (not jug wine as another review stated, but a decent selection) sodas, and some crackers, cheese etc. and take back to our room to enjoy with the kids. They had free wi-fi and my son was able to use his laptop to sign up for his next quarter classes while we enjoyed our drinks. We also really enjoyed the grounds at this hotel. Out in front is the Sexton House, which was owned by a local horticulturist and now is open to walk around in. The grounds have a grove of amazing trees out front which were planted by Sexton. There is a wonderful cork oak tree that is very rare as well as other very interested unusual trees.", "title": "Great place to stay", "helpfulness": 1, "user": "ClariceCalifornia", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13607443}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We were able to drive into Santa Barbara within about 10 minutes from the hotel and to the campus in about five minutes. It's not in a good area (too busy) to really walk anywhere except to walk around the grounds. If you want to be in Santa Barbara proper and near the beach, etc. this hotel is not what you want, but if you want a really nice hotel near the campus for a good price, it's a winner.", "title": "Generic, Unhelpful, and Over-Managed", "helpfulness": 5, "user": "ccvardis", "date": "January 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 12819863, "likes": {"liked": "— Clean", "disliked": "— NOT IN SANTA BARBARA"}}, {"rating": 5.0, "title": "relaxed", "text": "First of all, understand that THIS HOTEL IS NOT IN SANTA BARBARA. It is in Galeta, a $25 cab ride away. Nice advertising. We arrived at about 6:30 pm. The hotel staff had no recommendations for restaurants or bars despite the fact that there is no restaurant or bar in the hotel. We read reviews here and asked not to be put in a room with a view of the highway on-ramp. Guess what we got. When we checked into our room, we were pleased to learn that there was a wine happy hour to distract us from the on-ramp traffic noise. We called the front desk. We were blandly informed that the happy hour had just ended -- They never told us about it, even though it was going on a few feet away from us when we were at the front desk. We did get free breakfast with our stay -- Only it seemed mainly designed to keep people from stealing. When you check in, you get a sheet to fill out with what you want for breakfast. The only problem was that no one ever explained this to us, so when we went to breakfast, we were told to go back to our room and get our sheets. Very accommodating! Almost like prison or a high school cafeteria. Also, the wireless Internet requires a password that is in the \"handout\" you get when you check in. If you don't magically know this and have to call the front desk, you will be interrogated. The heaters, which are inexplicably located in the ceiling, are unbearably loud. Oh, and when we called a cab, the front desk gave them our room number as ID. So we were worried all night that the cabbie and all of the folks at dispatch knew where we were staying and that we weren't there. Avoid this place if you are interested in aesthetics or a nice weekend. It is anti-theft, not customer service, oriented. It's an EconoLodge with palm trees. The rooms are clean and fairly contemporary. That's about all that's good about them. If you're an overnight traveler not looking to enjoy Santa Barbara (just sleeping, eating, and leaving), this is an okay place.", "user": "pintsize79", "date": "January 15, 2008", "id": 12634223, "likes": {"liked": "— the rooms, and the fact that it was very pet friendly", "disliked": "— the location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "My husband & I and our son & his wife spent 2 nights at this wonderful resort. I can't say enough about the friendliness & helpfulness of the staff.", "title": "All It Promised & More", "user": "bc713", "date": "May 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 30260158}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The breakfasts, described in earlier reviews, were not sumptuous but better than we have experienced at more expensive resorts. We paid $164 each for our pet-friendly rooms which had very comfortable, clean bedding & a small private patio where we could relax with our morning coffee. As noted, it is not right in Santa Barbara but very close & with easy freeway access. We were happy to be a bit out of the bustle & noise we have experienced at other properties in the midst of SB.", "title": "Freeway noise and view of parking lot", "user": "Mom2BoysTwo", "date": "April 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 2.0}, "id": 28353402}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Would definitely recommend this place & plan to return the next time we are in this area.", "title": "Pacifica suites is also dog friendly", "user": "MBMfamily", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27787943}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Where do I begin? We stayed at this hotel because of the reviews and we were VERY disappointed. We paid $187 to have a view of the parking lot and freeway onramp. The freeway noise was ever-present, especially when motorcycles or trucks drove by. We were not happy. We tried to switch rooms but were informed that the hotel was booked up for the weekend. The room was clean, but the bed was old and too soft and the bedding and comforter looked like it had been there since the 70s. It just wasn't a very cozy room. I admit, I usually stay at 4 & 5 star hotels, so I knew this place was going to be less than what I'm used to, but for $187/night, the towels should have been slighter newer and softer. There are a lot of trees around, but they are just trying to hide the ugly surroundings. I would never stay in Goleta again and especially not at this hotel.", "title": "Beautiful setting and convenient location", "user": "FMCMaryland", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27726032}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We stayed at the Pacifica Suites as part of our college tour (or as I like to say, our 100 mile march, because we certainly walked that much). Pacifica Suites is extremely dog friendly (up to 40lbs), with a small surcharge of $25. Many hotels charge $100 for a dog. It's also right down the road from UCSB. Be certain to ask directions to the Beach House cafe for dinner. Our stay was wonderful. Oh, and you can take your dog on the college tour, there will be plenty of other dogs there. Just don't sit in the admissions talk with them.", "title": "Amazing grounds, surprising breakfast", "user": "thecookielady", "date": "March 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26809061}], "location": {"country": "United States", "city": "Santa Barbara"}, "stars": 3.5, "variance": {"poor": 14, "average": 29, "very good": 135, "terrible": 6, "excellent": 225}, "aka": "Pacifica Suites Santa Barbara Hotel", "slim_ranking": 0.116666666667}