{"user_rating": 5.0, "review_count": 615, "name": "Pacific Resort Aitutaki", "reviews": [{"rating": 4.0, "title": "stunning", "text": "Having spent the night in the sister resort in Raratonga this resort was just stunning; from the view from the plane coming in to the two rooms we had. The villa was large and spacious with separate bed and lounge area and several balconies to sit on and direct access via stairs to the beach. However ours (no 300) didn't get much sun throughout the day. We also had a beachfront bungalow no 112 which was direct onto the beach infront of the others and 10m walk to the sea. We spent most of our day on this balcony! Mossies are a pain and the hotel fogs and provides DEET. Yes there are plenty of sea cucumbers but wear the reef shoes available from the bar and forget them. The lagoon is shallow and the coral reef provides plenty of fish life to see. Having been, the beachfront bungalow is all you need. Restuarant and local night are reasonable value but the whole resort isn't cheap, but what a beautiful setting. The view of the reef lagoon is enough to set you up for the day and makes the bill that much more palateable.", "helpfulness": 6, "user": "watchitLondon", "date": "September 9, 2007", "id": 8681459}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Definitely do the Kia orana cruise ;small boat 10 people max, for a stunning day out. There are also a few shops 10 mins walk away for convienence stuff.", "title": "Nice", "helpfulness": 9, "user": "Fitzy2", "date": "August 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 8466469, "likes": {"liked": "— Location", "disliked": "— All of the cockroaches!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "On a general downside note the local sight of family graves infront of the houses is somewhat unnerving and if this practice continues the island will resemble an extended graveyard in a few generations time.", "title": "Utterly fabulous", "helpfulness": 11, "user": "Jessopsjuices", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8427664}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This was the main part of our honeymoon - we were there for 12 nights. Firstly I must say that this is far too much time to spend on this one island - it's tiny, there's nothing to do at night, and 4-5 nights would be enough before moving on.", "title": "Solid venue", "helpfulness": 5, "user": "ECtravels", "date": "August 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8378869}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "On arrival at the hotel, the first impression was magnificent. The beach was amazing, and you're right on it. The views are spectacular, really once in a lifetime job! However, that's what we were expecting because that's what we paid for. The first few days were lovely, the staff were friendly, the food was amazing, and the rooms were lovely. Unfortunately, we had one problem, and it was a big problem that ruined out honeymoon to an extent - cockroaches. We could handle the little lizards and big spiders that we came across in our room occassionally, but not the cockroaches. They seemed to have infested our room. We came across them running up the wall, across the ceiling, in the bathroom - little ones, medium sized ones, and giant ones. The locals thought that this was totally normal, and the management talked about sorting it out. But after every major psticide spray - they just kept on coming back! We recieved no apology, or any acknowledgement of the severity of the problem. The irony was that we specifically choose this resort based on previous reviews from trip advisor saying that it was cockroach free as compared to Fiji/Tahete/etc.", "title": "Such a dissapointment!!!!!", "helpfulness": 4, "user": "Frank H", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8347961, "likes": {"liked": "— It was awesome", "disliked": "— Mozzies and Sea Slugs"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "my husband and i spent our honeymoon here and found the pacific resort to be pure bliss! our beachfront bungalow was perfect, quite roomy and the service was excellent. the staff was at our every call and even delivered our room service dinner in courses! i would highly reccomend this amazing resort to anyone looking for a romantic and beautiful place to spend their time in the cook islands.", "title": "a true fantasy - perfect in all ways.", "helpfulness": 4, "user": "kategr", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7616709}], "location": {"country": "Cook Islands", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 6, "average": 13, "very good": 48, "terrible": 5, "excellent": 543}, "aka": "Pacific Resort Aitutaki Hotel Aitutaki", "slim_ranking": 0.2, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "An intimate collection of 27 secluded hideaways with absolute beach frontage while set amongst lush,palm filled gardens for privacy. With a luxury rating reaffirmed through its association with Small Luxury Hotels of the World this winner of numerous International Awards offers the complete luxury escape while respecting the principals of Social Responsability. Pacific Resort Aitutaki champions Eath Hour and also offers the Cook Islands first Aquatic Eco Trail just off their beach. Pamper yourself in the Tiare Spa with Manicure, facial or island Rapae Massage, Dine on sophisticated cuisine in Rapae Bay Restaurant as the sun sets, or between July and October breakfast while whales Breech in the waters offshore. The Black Rock Cafe is nestled between the beach and the infinity pool and provides a selection of cocktails and al fresco dining experiences to perfectly round off your day."}