{"user_rating": 4.0, "review_count": 486, "name": "Pacific Resort Rarotonga", "reviews": [{"rating": 5.0, "title": "Great stay in beach front room", "text": "We attended a wedding at Pacific resort for a week and booked a beach front room. The room was lovely clean and had amazing views.", "helpfulness": 1, "user": "Jetboy787", "date": "August 18, 2013", "id": 172861635}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The location is one of the nicest on the island.", "title": "Wedding Moon", "helpfulness": 1, "user": "Leanne G", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 172311830}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The staff looked after every need and were always prompt and efficient.", "title": "Excellent resort, but please get rid of the dogs!", "helpfulness": 3, "user": "Angie W", "date": "August 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172287648}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "There are lots of dining options within walking distance of the hotel.", "title": "Pacific Resort (Has it all)", "helpfulness": 1, "user": "cameronclan4", "date": "August 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 171656417}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We will stay here again.", "title": "Beautiful Pacific Resort, Rarotonga", "helpfulness": 1, "user": "Sue M", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171122456}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My wife,myself,and our 5 and 7 yr old boys have just had an 8 day stay at the Pacific in Muri beach.What a fantastic holiday at a fantastic resort.I think it would have to be the best located resort on the island with direct access to a beautiful sandy beach and the spectacular Muri lagoon right on its doorstep.Included in the resort rates are the use of snorkel/mask/fins/kayaks and the kids club which I cant speak highly enough of.I was expecting a group of motherly type Rarotongan ladies as the kids club hosts but was surprised to find it is run by the nicest bunch of young Raro guys you could ever wish to meet.The kids thoroughly enjoyed their time there and we felt totally relaxed and confident that they were in safe hands.Thanks guys,you rock!", "title": "Easy family holiday", "user": "Grant E", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167590138}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "The restaurant food is delicious and again the waiting staff was super friendly and nothing was too much trouble.", "title": "Pacific luxury", "helpfulness": 1, "user": "Travellove414", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167363094}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The rooms are comfortable,clean and well serviced with fans and very effective aircon in every room, and if your lucky,may come with a gorgeous resident lizard or two.The only gripe here is a larger fridge would be nice.", "title": "Great family holiday", "helpfulness": 2, "user": "Juliette291", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 167106373}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "All in all,a great resort with even greater people running it.I wouldn't hesitate to recommend it to anyone wanting a relaxing holiday.We're already planning next years winter break at the same place.Only next time it will be longer!!", "title": "Home away from home", "user": "CHSPeng", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166993962}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Stayed in Dec '12 and loved it, spent 4 nights in a Garden suite. The rooms are huge with beautiful bathrooms and lovely sitting areas. Though the room was set in the gardens its less than a minute walk onto the beach - which is stunning. The food is great you can eat with your feet in the sand (and have a cocktail or two)! The beach activities hut is great and the resorts location spectacular. Will definitely return!", "title": "Best Family holoday ever!", "user": "Fenella C", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166679445}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "we had ordered premium family room , there was me my wife and 19 yr old son. when we got to the room there was only one bed but they were more than happy to fix that and get another bed in there for us. my problem was for a premium room there was nothing very premium about it . I let them know that I wasn't all that happy with the room ,and if there were any nicer room we could look at , the assistant manager Nick I think that is title and name was no help what so ever didn't seem to want to help at all ! one of the people that work front desk brought it to the attention of the manager her name is Anna I believe , what a difference that made she went out of her way to help us , got lined out with beachfront suite for 3 of the days, got us a single bed moved in for my son , she did everything she could to help! we try to pay for next 2 night in suite but just couldn't be done they had people coming in. I would like to personally thank Anna for all her help ! I would recommend up grade to suite if feasible , if not your still going to have a great time on the cook islands and The Pacific Resort .", "title": "great time on island", "user": "cooks1957", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168438625}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed three nights in a beach front unit upstairs with a wonderful view over Muri Beach and all that takes place. The Resort is on the east side of the island so one can watch the sun come up; also dark enough to enjoy the night sky.", "title": "Pacific retreat", "helpfulness": 1, "user": "MitzyNewZealand", "date": "July 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167965723}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We found the staff to be very friendly and seemed to enjoy their work. Meals were expensive but large and well presented.", "title": "Paradise in the Pacific", "helpfulness": 2, "user": "brudii", "date": "July 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167876130}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Just spent 7 days with 8 family members (including 4 kids aged from 4yo to 9yo). Two families stayed in premium family rooms whilst my wife and I stayed in a premium beachfront suite. The only negative about the family rooms (41 & 42) were their location where they essentially backed onto the main road with its obvious noise distraction. Our beachfront suite was very good and if we were to find an issue it was the fact there were no bed-side lamps but hey .... whose arguing given the exceptional and spectacular vista from the suite.", "title": "Family paradise", "helpfulness": 2, "user": "Michelle V", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167745643}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The barefoot restaurant situated right on the sands of Muri lagoon was exceptional but generally over-priced even taking into account the vagaries of island economies. We felt that for lunch there should be a wider choice of light lunches -- simple toasted sandwiches at a reasonable price for a start would be welcome. Not everybody wants a massive lunch. The continental breakfast is rather drab and boring with the same \"products\" every morning. I note that some previous reviewers have made mention of the slow bar service. Regretfully this still remains.", "title": "Disappointing", "user": "grubs_wendy", "date": "July 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 167727548}, {"rating": 5.0, "title": "Waking up and stretching to the awe u didn't see at 2am", "text": "After a flight that was connecting via Auckland, arrived into a sleepy South Pacific island destination , finding this resort we were the lucky handful that were presented fresh flowers in leys at the airport, plenty of help with luggage on our shuttle transfers... After arriving at 2am and shown to our beautiful room that has the most magnificent bathroom in the world - crashed asleep and woke up to surreal blue hues.... Always acknowledged and greeted by all staff the resort is friendly and warm.... Waking up in Raro and Aitutaki in both of these properties with pacific resort is any true love and appreciation of beauty's dream.. Spoilt beyond belief here... Ask about snorkelling tours they know some great local tour operators, from the moment you get off a plane in these islands you are looked after well by the pacific resort crew.. I wouldn't want to stay anywhere else, heaven n earth and I can't wait to go back and recharge with magic!!", "helpfulness": 2, "user": "luckychi", "date": "August 3, 2013", "id": 170635027}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We have just spent 10 nights at this hotel. Everything was mint, the rooms, the location, the food and service were all excellent.", "title": "Awesome", "helpfulness": 2, "user": "Brett G", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170524733}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The kids club is excellent and you can leave your kids with staff nearly all day. My 2 girls absolutely loved it.", "title": "Paradise in the Pacific", "helpfulness": 2, "user": "kennydmac54", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169694471}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I highly recommend this hotel for a family stay.", "title": "Disappointing Resort", "helpfulness": 2, "user": "Kimi187", "date": "July 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 169567249}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We also hired a rental car & scooter from reception and all the staff are great.", "title": "Honeymoon stopover in Raro", "user": "newquin", "date": "July 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169016257}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "After reading many reviews on this property I was dubious about staying, but it was included in a package along with its counterpart in Aitutaki. We did upgrade, to a Junior Suite, which was quite lovely. Bathrooms are great. I would have to say it was far better than I expected. The grounds are lovely. The Restaurant however was superb, and after spending three weeks there, not all at the Pacific, we found the food to be excellent. But see my reviwe on Aitutaki before you spend all that hard earned money.", "title": "Nice Property", "helpfulness": 1, "user": "Frank H", "date": "August 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8347910, "likes": {"liked": "— Quality Furnishings", "disliked": "— The small outdoor area"}}, {"rating": 3.0, "title": "The flowers are like heaven!!", "text": "laketaupomotorinn.co.nz", "helpfulness": 5, "user": "jts0208", "date": "July 19, 2007", "id": 8192542}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Well, Rarotonga is a great experience and was glad i went, as we have been having -14 deg temps here at home and the hottest day while we were in Raro was 32 deg!! But you must save your moo-la to go to Raro, as it's unreal the prices in which you have to pay. The resort where we stayed was set in the most natural lush surroundings and it was just perfect. Things that weren't perfect was how much we had to spend for our poolside room which was very basic and somewhat dated. Comfortable but the room does not match the price. We got room service one night and that was the last time, I ordered a $15 cheese platter, which stated a selection of crackers, dried fruit and nuts. I got 4 water crackers, 4 sticks of chedder chees, a big hunk of blue vein and a sloppy hunk of partly melted camenbert, 3 dried dates and about 6 walnuts and 6 peanuts!! We also ordered a $6 side of fries, the bowl was covered with tin foil so by the time it got to our room, they were soggy and hard!! And above all of this we were charged $5 for the staff to walk 200m to deliver it, so we opted to pick it up. The restaurant at the resort also did not match the price with the food served. The breakfast each day was great though, really enjoyed the fruit. I was shocked to leran that a staff member who has worked at the resort for 11 years, is on a whopping $7 hour!! It just doesn't seem fair!! We stayed for 12 nights in rarotonga and that was long enough, 7 nights would of been better. I enjoyed the lagoon, the flowers and fruit and the pigs, dogs and chickens you see all over the island. A lot of the locals weren't very inviting but the staff at the resort were really friendly, so it was very pleasent in that respect. I just about fell over when going to the supermarket and a 6 pack of fresh and fruity was $11.75!! A 600 ml of milk was around $10!! A big bag of chips will cost you around $6.50!! To go out at night for a decent meal and one that you will enjoy will cost you around $100 for a main each and a dessert to share and 1 drink each. So expect to spend btween $100 to $200 on food per day. You also have to pay for your water. Whether you get a glass eating out or at a mini mart. We spent around $70 on water whilst we were there. I recommend going to the super market and getting a box of pump water for $30, at least this way you can have it in your fridge and take it out with you each day. (you cannot drink tap water as it is not treated). loved the cultural dancing and the markets and the heat. For such an exclusive island and holiday destination I was shocked at how run down a lot of the town looks and they need to invest some of our tourist money in some rubbish bins!! I'm appreciative of the experience and I feel for the locals in the struggle they have to make money. Places to eat in which I loved was Sails, The Point, The Indian Restaurant and Stefanos Italian restaurant. Tangaroa tours is great too, a 4wd drive tour run by Ups and Arama (two awsome cute guys, who are funny and enlighten your knowledge of raro). A hire car is REALLY handy!! Definately check out the sunset at the edgewater hotel, amazing!! The perfumes are beautiful made from the flowers etc. Glad I went but will not return and Raro will now be a memory with me forever!!", "title": "Disappointing and overpriced", "helpfulness": 8, "user": "sunbeam64", "date": "July 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 8139766, "likes": {"liked": "— The new garden studios", "disliked": "— The appalling poolside units and poor overall value for money"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We have just returned from our second trip to Rarotonga. On our previous trip we stayed at what was described as a budget style resort - yet were pleasantly surprised. This time we decided to treat ourselves and stay at the acclaimed Pacific resort - we were highly disappointed. We were in a 1 bedroom poolside unit with \"kitchen\" facilities. Do not stay in these units unless you are prepared to spend a lot for a poorly equipped, drab, dated and dirty unit. The kitchen cooking facilities consisted of a dirty oven and cooktop, jug, toaster, one pot and one fying pan. There was no where to store anything and the cutlery on offer was dirty and nothing to even prepare a snack in. We paid almost $400NZ per night for this unit and after 2 nights asked to be moved to a garden studio at an additional $165.00NZ per night. Yes we agree with all who have commented on these studios - they are very nice and new. But at almost $600NZ per night they are highly overpriced and we had more value for money on our previous trip. At the very least we feel a queen bed when specified should not consist of 2 single beds being pushed together. At $600NZ per night the air conditioning should at the very least work and not require the services of a repair man at 5pm in the afternoon when guests have waited a good part of the day to first move into the garden studio at 2pm. We also felt in terms of the Pacific experience Samoa was superior. Vanuatu also offered value for money. We no longer have to budget heavily and do not skimp on our trips and we travel extensively, so are always willing to pay for quality accomodation and facilities. But this one was a dud!.", "title": "A Perfect Break.", "helpfulness": 4, "user": "shazastan", "date": "July 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8060719, "likes": {"liked": "— Spaciousness, nearness to the lush flora and fauna, coconut palms etc.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "On the positive side - the Beach Hut guys were pleasant and cheerful, the housekeeping staff always greeted guests as did the staff who were responsible for moving all guest baggage at checkin and checkout. Front desk service was varied depending on which staff members were on duty. The breakfast was basic but sufficient. Children were also clearly well catered for and had lots of activities to entertain them. But children under 12 also stay here for free it would appear", "title": "Incredible Honeymoon", "helpfulness": 4, "user": "TLH73", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8028928, "likes": {"liked": "— High quality service and surrounds"}}, {"rating": 3.0, "title": "little tired", "text": "Stayed one night on our way to Aitutaki Pacific resort. Booked a three bed garden villa - got a two! but couldn't be bothered to argue or change as they had set beds up in the lounge. On first impressions the resort looked fine but we were plagued with ants and the villa smelled musty. Beautiful setting and beach area. Dinner and breakfast in the resort were fine although definately service is on island time. Small pool set away from the beach and freezing cold and unwelcoming. Check in and out and hotel transfer was faultless. Having been to the sister resort in Aitutaki this is definately a grade or two below.", "helpfulness": 1, "user": "watchitLondon", "date": "September 9, 2007", "id": 8680856}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Pacific Resort on Rarotonga is undoubtedly in the best waterside location on the island, with crystal clear seas and within a stones throw from anywhere in the complex.", "title": "Lovely place, brilliant place to take your kids", "helpfulness": 3, "user": "A_RTW_Traveller", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8679763, "likes": {"liked": "— Close proximity to all facilities and you can hear the sea from your room at night.", "disliked": "— nothing whatsoever"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The water is shallow and is perfect for taking small children into the sea in a sheltered coral lagoon, never becoming more than waist deep for the average adult.", "title": "Great for family's", "helpfulness": 2, "user": "My3sonsAuckland", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8617583, "likes": {"liked": "— Relaxed atmosphere", "disliked": "— lighting in the rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The facilities at the resort are spotless and the food excellent and the staff are wonderful.", "title": "Woeful!", "helpfulness": 3, "user": "John20987", "date": "August 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 8441175, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I understand the reservations of other reviewers about the state of some of the rooms, but some were being refurbished when we were there - the place is looked after and is maintained very well and definitely does not look jaded or old fashioned in any way. I suspect the grumblers just wanted a sea view and didn't get one :) either that or they just mssed the point of staying here.", "title": "Absolutely loved it!", "helpfulness": 6, "user": "Julie-Anne68", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8371905, "likes": {"liked": "— Super location, friendly staff.", "disliked": "— Original room allocation"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "This hotel is NOT 3 stars. Our lagoon villa was huge, with nice tile floors, breathtaking views of the ocean, and welcoming staff. The private beach was quiet, and we were able to spend hours here. We also spent hours walking through the tropical paths around the resort, admiring the lucuious flowers and greenery. Service was top notch. I will be reaturning here as soon as I can!", "title": "Amazing!", "helpfulness": 3, "user": "Waterman88", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8023878, "likes": {"liked": "— The beach!", "disliked": "— The lack of dining options"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "A great place to relax. We stayed in a Garden Sudio which was just lovely. The studio was serviced daily with lovely little extras like home made cookies left and turn down of the beds at night. the breakfast was great which was included in our rate. The Bar staff were very friendly, we really enjoyed the daily beat of the drums announcing Happy Hour at 5 pm every night, The meals in the Restaurant were so good we ate there nearly every day, either lunch or dinner. Also the free use of the kayaks and snorkelling gear was an added bonus. We will definitely be going back there again.", "title": "Great Resort", "helpfulness": 3, "user": "BrendsCanterburyNZ", "date": "June 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7990252, "likes": {"liked": "— The close proximity to the Beach"}}, {"rating": 5.0, "title": "Raro is awesome place for holiday", "text": "I absolutely loved raro. The people were all so friendly, there was plenty of activites and things to do where we stayed at pacific resort and my only gripe is that 7 nights is just not enough time there. If your going to raro be prepared for a real simple laid back pace, no flashy houses or buildings, just nice and simple. It may take a day or two to get into it but once you do you wont want to stop. Ideal holiday for couples, singles (girls you'll love the guys) and also really great place to take the kids. The kids will love it!", "helpfulness": 2, "user": "tashakManukau", "date": "June 12, 2007", "id": 7841389}, {"rating": 4.0, "title": "loved the relaxed holiday feeling", "text": "We had a very quiet relaxed 10 days at Pacific resort and can completely recommend the resort for a holiday. We were looking for an escape from a very busy and stressful life and found every thing we wanted at Pacific resort. The weather was not kind to us but there were plenty of books to read and although television would have been nice it would need to be satellite as the local programs were very basic. The activities were well planned and the staff went out of their way to be helpful. We would be happy to advise anyone looking for a calm and restorative holiday to book here.", "helpfulness": 2, "user": "gadabt", "date": "June 6, 2007", "id": 7781202}], "location": {"country": "Cook Islands", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 23, "average": 37, "very good": 142, "terrible": 20, "excellent": 264}, "aka": "Pacific Resort Rarotonga Hotel", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Authentic Boutique….Rarotonga’s leading full-service authentic boutique resort is nestled discreetly in one of the world’s most spellbinding spots. Stretching one kilometre along the south-eastern coast of Rarotonga, Muri beach is laden with glorious white sand, fringed by palm trees and lapped by the gentle waters of a shallow, safe lagoon. This boutique resort offers a perfect blend of modern comforts and traditional island hospitality. A place where simple, lazy days meet luxurious evenings. And where the friendly, gracious staff meet your every request. Dining at the resort is a fine experience. Be tempted by succulent fresh seafood, Pacific and international dishes, or be summoned by beating drums to an authentic Cook Islands feast.No matter how you choose to fill your days and nights at this breathtakingly beautiful place that is Pacific Resort Rarotonga, one thing is certain. You’ll leave feeling rested, restored and renewed. And above all, determined to return."}