{"user_rating": 2.5, "review_count": 190, "name": "Pacific Marina Inn", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This is NOT a two star hotel and for $130 ($150 after taxes) it should be considered stealing. I walked into the room and it was VERY small, dirty and not even close to the pictures on the website. I went to the desk and imeditly sked for refund. Since I booked this through EXPEDIA they would not give me a refund. I called EXPEDIA and they would not refund my money. I ended eating the $150 and stayed in Waikiki for another $180. Much nicer. Don't let the location fool you. it's not worth it. The staff was not friendly either.", "title": "Overrated", "helpfulness": 1, "user": "smitty1234", "date": "February 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 13435595, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Oh yeah, the hotel is in the middle of a large industry section by the airport with no other hotels nearby. I wish I had taken a photo of the room so you could compare it with the photos on EXPEDIA. not even close.", "title": "Impossible to sleep here - next to airport runway!", "user": "ATL1", "date": "December 26, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 11966135}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I stayed here for one night because we had to change planes at Honolulu Airport to get to Kauai. Once we checked in, we were disappointed by how small and dirty the room was. Quite cramped for two people. Ugly furnishings.", "title": "Adequate and Comfortable", "helpfulness": 1, "user": "greymatter", "date": "November 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 10884038, "likes": {"liked": "— Close to Airport / Free Shuttle", "disliked": "— Nowhere to put a cool drink / noisy air conditioning unit"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "Worse, no one told us that the hotel is located right next to the airport runway! At 5am the next morning, huge jets started taking off every 10 - 15 minutes. They planes were so loud that our room literally shook. I can sleep through just about anything, but this was ridiculous. We got up an hour later and checked out, because it was unbearable. The front desk was rude and acted like everything was normal.", "title": "Not that bad...", "user": "michiganstategogreen", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10712486}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "If you need a good night's sleep, do not stay here. For a similar price, you'll be better off at the Ohana airport hotel or the Best Western Plaza.", "title": "Only a stopover", "helpfulness": 4, "user": "osiris9", "date": "April 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7363950, "likes": {"liked": "— Close proximity to airport", "disliked": "— Basic accomodation and very noisy"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "I stayed at Pacific Marina Inn February 23, 2006 and paid $110 including tax. The area is mostly warehouses but it appears to be safe, as far as I could tell.", "title": "Acceptable", "helpfulness": 6, "user": "MaxConcrete", "date": "April 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4828935}, {"rating": 1.0, "title": "Crime Filled Slum", "text": "The parking lot was full but fortunately I was able to find a space on the other side of the building. Spillover parking was available on the street. Parking was free, a big plus in Honolulu.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 21, 2006", "id": 4722927}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "The room was very small. The room was nicely decorated and the furniture was in good condition (better than I expected). There was a wall unit air-conditioner that was typically noisy (about what you'd expect in budget motels). There was a louver-style window which did not keep out the noise very well (I was along the parking-lot road and heard vehicles). Also note that the motel is on a runway flight path, but I heard very few aircraft.", "title": "The best place to lay over", "helpfulness": 5, "user": "Ratbag", "date": "March 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4690724}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "Traffic going into Honolulu on the Friday morning was horrendous. Do not plan to stay here if you need to commute into town on a weekday morning.", "title": "Two Twin Beds!!!", "helpfulness": 3, "user": "Shannon_in_Calgary", "date": "March 7, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4591520}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "Overall, I rate this place as acceptable. If you can find a better hotel at the same price, I would recommend taking it. But if you just need a basic motel with easy parking, this could be your best bet in Honolulu.", "title": "A nightmare", "helpfulness": 9, "user": "voyageuse416", "date": "February 24, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4499600}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I paid $110 for one night (for a party of three) at this hotel. Overall, it was a disappointment. The hotel is like a glorified motel, with a pool and cleaner rooms. Though it had two beds in our room, there was not a single chair. it also lacked a bedside table. The bathroom had a shower only, no tub.", "title": "A glorified motel", "helpfulness": 2, "user": "CanadianTraveller100", "date": "August 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 19408965, "likes": {"liked": "— close to airport, free shuttle service", "disliked": "— quality of room, no Internet, insufficient furniture"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Though it is close to the airport and it offers free shuttle service, the shuttle bus runs only every half hour or so. The sound isolation of the hotel rooms is terrible -- you can hear every take off and landing, unless, of course, you are too tired to stay awake.", "title": "Horrible", "helpfulness": 3, "user": "BROYTRAVEL", "date": "May 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 16168880, "likes": {"liked": "— none"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I would not recommend this hotel.", "title": "All The Ambiance of an Industrial Park in Oakland, California", "helpfulness": 2, "user": "The_OvenMan", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 15517509, "likes": {"liked": "— Staff", "disliked": "— Pretty much everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "We received a AAA rate and it was $122 after all taxes. This hotel is located very close to the airport but it has no restaurants or hotels nearby . The room did not even have a coffee maker or a hair dryer. the bed was clean. The pictures on the website does not at all resemble the place. Really scary place. We did not feel safe.", "title": "not so bad", "user": "chuckyUK", "date": "February 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 13866120, "likes": {"liked": "— close to airport", "disliked": "— nothing"}}, {"rating": 1.0, "title": "Great for \"Worst Hotel Experience of my Life\" Stories.", "text": "I was stopping over in Honolulu for four days in early December 2007. As it turned out, my visit unintentionally coincided with the timing of the Honolulu Marathon. Therefore, I could not book any of the budget-priced hotels in Waikiki. My choices pretty much came down to something really expensive or... the Pacific Marina Inn. The website makes it look like a decent little property so I figured why not. The stay started out promisingly enough with the complimentary pick-up from the airport (great driver) but went downhill rapidly as we approached the hotel. Looking at the neighborhood, one could be forgiven for thinking that they had been somehow teleported to an industrial park in Oakland, California. The hotel itself is dingy, the pool which looked inviting on the hotel website, looked like something that you wouldn't want to expose your skin to. The room was smallish and barely adequate. A real negative at this hotel is noise from the airport. I have stayed in plenty of airport hotels. They're usually located in such a manner as to avoid as much noise from the runway as possible. Not so with the Pacific Marina Inn. I am an early riser so was in the lobby for complementary coffee before 06:30 in the morning. The thermal pot ran out after I had taken a cup and I informed the desk staff that they were out of coffee. They told me that they only made one pot per morning and that was it! Apart from the coffee incident though, I would have to say the only positive about this hotel is the staff. Everybody I encountered was actually really nice and made you feel welcome. Too bad that they're stuck working in such a horrible, horrible hotel. Thumbs down - adequate for an overnight near the airport and that's about it.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 17, 2008", "id": 13635039}, {"rating": 1.0, "title": "Stayed here 1 night, got no sleep", "text": "I would not recommend this hotel - had an early flight out of honolulu in the morning so we stayed here for one night. pay a little more for something better. It just feels gross, it was loud and there was activity all night that kept us up. I felt like i shouldn't touch anything in the room. made for an exhausting long travel day the next day. not a way to end a hawaiin vacation.", "helpfulness": 3, "user": "E4388", "date": "April 14, 2007", "id": 7351671}, {"rating": 3.0, "title": "Retro Drab", "text": "Friendly staff, small on-site restaurant & lounge, pay-per-use lobby internet access, and pool make up for the retro-drab rooms. The rooms are reminiscent of Route 66 motel rooms, with the added charm of lamps nailed to the desk and nightstand. Adequate for a one-night layover, but no more.", "helpfulness": 3, "user": "AuroraTravel", "date": "March 1, 2007", "id": 6898565}, {"rating": 1.0, "title": "\"Horrible\"", "text": "We spent fortunately only 1 night at the Pacific marina inn, because Hawaiian airlines cncelled our flight so we had to spend one night in Honolulu and fly ou the next day.", "helpfulness": 2, "user": "E4388", "date": "December 18, 2006", "id": 6457229}, {"rating": 2.0, "title": "Don't go there!", "text": "We found this hotel on the Lonely planet guide and I think they should cancel it from the guide. We have used all our hotels based on tripadvisor, and all of them have been great.", "helpfulness": 2, "user": "easygoing30", "date": "August 23, 2006", "id": 5703052}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The room is very basic, and not very well cleaned. I did not have a shower because I felt very uncofortable. It is a very BASIC Motel. We paied 100$ which I think is really too much for what the offer. Do not stay there ever!!", "title": "Best for a layover", "helpfulness": 4, "user": "Albatross37", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5436377}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 44, "average": 59, "very good": 21, "terrible": 59, "excellent": 7}, "aka": "Pacific Marina Hotel Honolulu", "slim_ranking": 0.951807228916}