{"user_rating": 4.5, "review_count": 56, "name": "Packard House", "reviews": [{"rating": 5.0, "title": "Best in Mendocino", "text": "The Packard House is by far the best place to stay in Mendocino. The design, breakfast and staff are flawless. It is not your normal B&B (which we dont really seem to like...yucky lace). It is modern and fresh and CLEAN. They also respect your privacy which for us is a HUGE plus. We will only stay at the Packard House on our visits to Mendocino.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 9, 2005", "id": 4003493}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "My boyfriend and I stayed at the Packard House last November. I chose this B&B because it seemed to offer a nice alternative to the stuffy Victorian decor offered by most of the other places I looked into. We weren't let down. The entire place was modern and exhibited good taste. They played great music too, soft jazz. We stayed in the village view room, but had a chance to see all of the rooms the next morning. Our room was wonderful. It had high ceilings and was everything you could expect from the pictures. I will say that it was significantly larger than the other 3 rooms. I think this was because it was the only room located on the first floor. It also offered a jetted bath tub, which was exceptional.", "title": "Great Place", "helpfulness": 3, "user": "mshday", "date": "June 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 3554681}, {"rating": 5.0, "title": "Wonderful lodging", "text": "Breakfast was wonderful as well. We were served a flaky pear pastry followed by a delicious egg souffle. I usually don't like eggs and I feared when I found out what was to be served the next morning, but to my surprise it was super tasty. This was the first time my boyfriend and I had stayed a B&B and overall we had a great experience staying at the Packard House.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 10, 2003", "id": 1280163}, {"rating": 5.0, "title": "Favorite Mendocino Inn", "text": "As for the reviewer who complained about the Pacific view room-", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 20, 2003", "id": 1237058}, {"rating": 2.0, "title": "Sad to say!!", "text": "In their defense there isn't much of an ocean view, but it's a beautiful room and everything else about it makes up for that.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 14, 2003", "id": 934079}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Having just returned from Mendocino, I wanted to let other travelers know about this great little B&B in the village. Within walking distance of all of the shops and restaurants, Packard House provided the perfect base for our relaxing weekend away. When we'd had our fill of shopping and eating, we spent a number of hours at the Inn; either in our room or downstairs in the main salon. Early each evening the proprieters would leave out snacks and wine for the guests which was a nice touch. Our second night there we stayed downstairs for a couple of hours just reading and relaxing.", "title": "Great stay in Mendo!", "helpfulness": 2, "user": "Becky-in-Oakland", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 5422533}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "Our room (Garden Court) was comfortable, if a bit small, but the bathroom more than made up for that. My only \"complaint\" is that there is currently no garden view from this room as they seem to be adding on rooms to the back of the inn. This didn't matter too much however since (1) if we wanted views, we walked down to the village to look at the beautiful coast and (2) there was no work noise.", "title": "Nice B&B", "helpfulness": 3, "user": "bdh1968", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 5185331}, {"rating": 4.0, "title": "One of the best", "text": "All in all, the Packard House is a great Inn and one that I will definitely be recommending to friends/family visiting the area.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5006908}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We had a comfortable enjoyable weekend at the Packard House. The breakfast and hospitality were good. The room was comfortable and the house was nicely updated. Some old B&B's can lack modern comforts, but this one seems pretty well upgraded. The views are ok but not spectacular.", "title": "Stay at the Packard House!", "helpfulness": 5, "user": "StephanieMay", "date": "November 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4125354}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "I recently spent two nights in the Pacific View room of the Packard House. It's easily the most stylish B&B I've ever stayed in, and feels like you're living in the Restoration Hardware catalog. The breakfast was delicious and equally stylish. Each afternoon the hosts set up wine and snacks in a sitting room downstairs. The staff was friendly and professional. Unfortunately I feel that the view of the \"Pacific View\" room is oversold; yes, there is a distant view of the ocean through the one small window, which you'll enjoy on the way to the bathroom, but that's about the only time. I actually think this borders on false advertising. The fireplace did not work, but I'm willing to accept that was a fluke given the very high level of attention paid to the property in general. The upside to being a few blocks off Main Street is that it's really quiet.", "title": "Lovely and modern", "helpfulness": 4, "user": "mojitogirlChicago", "date": "October 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4048501}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My partner and I wanted a quiet get a way for the weekend to celebrate both our birthdays, and that is what we found at the Packard House. After reviewing several websites regarding rooms in the Mendocino area, we were attracted to the website and the photos of the Packard House. While we like the rustic atmosphere of Mendocino, in our rooms we like quality and comfort, and that is what we found at the Packard House.", "title": "Excellent Stay!!!", "helpfulness": 3, "user": "Lawin4cr", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6364187, "likes": {"liked": "— location and decor.", "disliked": "— Would have liked a mini refridgerator in our room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I had never stayed at a B&B, rather prefering to stay at nice comfortable hotels, so this was a first for me. I have to say, without reservation I will return to the Packard House many times in the future. They are adding on and will be offering some unique and enjoyable amenities.", "title": "Great stay", "user": "Gramercy1", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6136599, "likes": {"liked": "— great rooms and delicious food"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Becky greeted us upon our arrival and was full of information on what to do and where we should eat at. We had already made reservation at several restaurants, but should have taken her advice as her choices might have been better than our searches that were done strickly on internet searches.", "title": "Beautiful, Modern Inn in a Quiet Town", "helpfulness": 1, "user": "qaz123", "date": "November 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 6093797, "likes": {"liked": "— The quality of the rooms", "disliked": "— The breakfasts"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Each morning Steven prepared an outstanding breakfest in the dining room for my partner and I. He also provided very useful information about the area and offered up great conversation.", "title": "Fantastic Experience", "user": "boydnmfn", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5805576, "likes": {"liked": "— The bathroom", "disliked": "— Size of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed in the Pacific View room and we were very comfortable. Plenty of room, a nice view of the Ocean in the distance. While the weather was rainy and overcast, it was just what we wanted. We slept with the window open so we could hear the waves crashing on the rocks at the oceans edge.", "title": "Thoroughly enjoyed our stay at this modern B&B!!", "helpfulness": 2, "user": "babylin55", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5698867, "likes": {"liked": "— Modern touches throughout the B&B", "disliked": "— The 11am check out -- too early but understandable"}}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 5, "very good": 11, "terrible": 1, "excellent": 38}, "aka": "Packard House Hotel Mendocino", "slim_ranking": 0.5, "description": "Offering sophisticated luxury in a casual coastal environment, the Packard House bed and breakfast inn is located in the heart of Mendocino Village. Downtown shops, beaches, trails, headlands, and fine dining are all within walking distance. Biking, kayaking and fishing are all nearby, and the fabulous wineries of Anderson Valley are a short drive away."}