{"user_rating": 5.0, "review_count": 348, "name": "Pak Chiang Mai", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed as a family of 4 in April and loved this Bed and Breakfast, the boy's stayed in a twin room and we stayed in the suite. The suite was well arranged and was a great haven for us to escape to. The breakfasts here are freshly prepared with a chang in selection everyday. The ladies will help you out with many suggestions for your day's activity's. There airport pickup and dropoff is also very convinient.", "title": "Relaxing and Enjoyable Great Place to Stay", "helpfulness": 2, "user": "parktravellers", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115100374}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here for five nights in June 2011, and to echo some of the comments made many times on here - the place itself is beautiful and homely, and the staff incredibly friendly and welcoming, they can't do enough to help you with whatever you need during your stay. The room we had was the standard one but was still fantastic - large, clean, and very comfortable - and the place itself has two free internet terminals, free wifi, loads of books and travel guides, hammocks and cushions everywhere in the lounging area, and a garden / stream running through it. Breakfast was awesome. The location was perfect. I can't think of a single negative comment, or even an average one. Seriously, look no further.", "title": "flawless", "helpfulness": 4, "user": "popegregorythe9th", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114932450}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "One of the most charming places we stayed during our trip to Thailand. Rooms are extremely comfortable and clean. Breakfast is fresh and delicious. Any request we had was promptly taken care of: car rental/ sightseeing/massage/etc.", "title": "We loved it and hope to be back soon", "helpfulness": 2, "user": "dunsboroughluna", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 114817553}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The place itself is a rare treasure. We highly recommend it.", "title": "A fabulous stay with great service", "helpfulness": 7, "user": "useetheworld", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114673486}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We spent 8 nights at Pak Chiang Mai and still weren't ready to leave.", "title": "In Love with it", "helpfulness": 3, "user": "weikeat", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114666342}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Everything about this accomodation is just perfect.", "title": "everything perfect", "helpfulness": 9, "user": "bkoneth", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114485900}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Friendly staff, proper room, relaxing patio, supberb food.", "title": "LOVE PAK", "helpfulness": 6, "user": "Iloveginger", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113517635}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Yay we had a beautiful experience at Pak- Don't look further- STAY here!", "title": "A little gem", "helpfulness": 7, "user": "the_ooi", "date": "June 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112875441}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Pak Chiang Mai is a gem of a place (flashpacker/family run boutique hotel... somewhere in between) and really deserves all the accolades that it gets (many from TripAdvisor!). For very modest prices, you get hotel style rooms but also the genuine hospitality that comes from a small family run place. What endeared the place to me was the real attention to the small things - like starting fans to blow off mozzies from your feet when you have breakfast, making you a small birthday cake on your birthday and even getting up after nigthfall to microwave our leftovers from cooking school when we were hungry.", "title": "Tranquility!", "helpfulness": 8, "user": "gm_beachsuites", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109458507}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Practically, it is situated in the old town and you can virtually get to anywhere by using their free rental bikes. There is free high speed internet which is great, and they have a whole host of information from good massages to any tour you would want to do. There's complementary breakfast. The only down point is that dining in the area is a little bleak, so you will need to wander if you want anything aside from Pad Thai or Pad See-Ew.", "title": "Great staff at lush, beautiful, relaxing oasis in beautiful old Chiang Mai", "helpfulness": 9, "user": "JAP85", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109400993}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This was our favorite place that we stayed in four weeks in Thailand. Beautiful place, really sweet people. The highlights: the women who come to do massages were the best we had in the country. The shampoo and conditioner are amazing! I bought a couple bottles to take home. Delicious herbal teas left in our room for evening. Location close to night market and fascinating everyday market. This is just a sweet, relaxing place. And they are great at emailing, unlike the majority of Thai guesthouses that we tried communicating with.", "title": "Definitely lives up to it's reputation!", "helpfulness": 3, "user": "KashiG", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115940467}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We stayed in the grand suite with 3 small children and found it an excellent choice. The hosts were really lovely and great with the kids. Good food, good location, nice spacious suite with a bath.", "title": "Gorgeous hotel, lovely hosts", "helpfulness": 2, "user": "KylieRob", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115893191}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We echo the glowing reviews. suecohen8 said almost everything we would have said. The guest house has been lovingly built by the owner family, using teak and other wood collected over the years. The intelligent management, exceptional breakfasts and in fact all meals, friendly help with activities plans (cooking classes, transportation, restaurant recommendations), all contributed to a great experience. The little touches make it special.For example, near the room doors, at floor level, aromatic oils are heated each evening, lending a pleasant calming atmosphere to the end of a busy day.", "title": "Excellent excellent", "helpfulness": 3, "user": "loraxes", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115695379}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "There is a fascinating street-food scene at the end of the otherwise quiet block, next to the market, where it's also easy to flag a taxi or tuk-tuk, or visit the ATM. Try the banana-egg-chocolate rotees from a cart on that street. Delicious!", "title": "Delightful oasis in Chiangmai", "helpfulness": 2, "user": "seasonedtraveller953", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115157869}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "It's difficult to over-praise this delightful place.", "title": "Wish I could have stayed longer!", "helpfulness": 2, "user": "suecohen8", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115125464}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We splurged and stayed in a suite as our trip to Thailand was a part of our 5-year anniversary trip. The room surpassed expectations, and there are plenty of photos on the hotel website! I wish that we had more time to simply relax and enjoy the room and the outdoor area outside it (lawn chairs and etc).", "title": "Fantastic stay at Pak Chiang Mai", "helpfulness": 2, "user": "Alybyzrp", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116957893}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The folks at Pak Chiang Mai were extremely helpful and friendly. The hotel itself is beautifully set up and decorated. The location - near the gate but away from the hustle and bustle of the east wall - was fantastic, close enough to walk nearly everywhere in the old city but without lots of noise at night. We also walked to and from the night market without any issues (it's fairly close), and catching public transport was close and easy!", "title": "Rated #1 for a good reason", "helpfulness": 3, "user": "JSBKK", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116700050}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We would not question staying here again - it's number one for good reason!", "title": "Great place, nice people", "helpfulness": 2, "user": "iluv2kruz", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116325829}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Pak Chiang Mai is just lovely! everything is just the way it should be. The hosts are more than generous in every way. The neighborhood is quiet, there is a lovely outdoor living room, the service is excellent and the breakfast delicious. The rooms are neat, clean, and quite lovely. The feeling is authentic Thai. All that and at a very reasonable price", "title": "Safe, Friendly, Accomadating Staff", "helpfulness": 2, "user": "savingracesarah", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116287133}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This B&B is a perfect place to stay while in Chiang Mai. our room was a suite and they kids got a premium and they were fine. O was the name of the lady that was running the place while we were there and she was so very kind. We ate most meals there and we liked the location a lot. We would go back and stay at this B&B in a heart beat.", "title": "Charming and friendly retreat in Chiang Mai", "helpfulness": 2, "user": "PattycakesSF", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 115959699}], "location": {"country": "Thailand", "continent": "Asia", "city": "Chiang Mai"}, "variance": {"poor": 0, "average": 4, "very good": 34, "terrible": 3, "excellent": 307}, "aka": "Pak Chiang Mai Hotel", "slim_ranking": 0.00639658848614, "description": "Wake up to the nature. It's a home away from home. Homemade organic breakfast will be served daily. Smoking in the hotel zone is strictly prohibited. We also provide free high-speed Internet and parking as well as a Restaurant."}