{"user_rating": 4.5, "review_count": 227, "name": "Palais Sebban", "reviews": [{"rating": 3.0, "title": "Mixed feelings", "text": "We have just returned from a 7 night stay at the Riad Seddan Palais. The Riad is indeed very beautiful, a peaceful retreat after the frantic hustle and bustle of Marrakech. However the general management of the Riad is poor, the staff,although friendly, are not particularly efficient and the standards of a so called 5 star accommodation just don't match up to expectations. I would advise any visitors to ask prices when ordering drinks as the staff will bring you the most expensive if you don't, and around £8 for a glass of Morrocan wine is no joke! Also ask what is available on the breakfast menu as the buffet is basic but you can order omlettes, however the staff neglect to tell you this when you first arrive. Never sure about what standard of service was on offer and the more fluent your french the better experience you will have at this Riad.", "helpfulness": 1, "user": "abbeyorchard", "date": "October 9, 2008", "id": 20762822}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Our party of four returned last weeked having spent a week staying at the fabulous Palais Sebban. As we had booked for 7 nights we were fortunate enough to be upgraded to two luxurious suites, Berbere, with its own private terrace & fountain and Mogadar, overlooking the pool & inner courtyard. The staff are without doubt the most accommodating we have come across in over 30 years of holidaying around the world - nothing was too much trouble and the standards of cleanliness were exceptional. Fortunately as the temperature is so high in July/August we almost had the pool and attentive all to ourselves on certain days. During our viist we saw several meetings designed to promote the Riad in various brochures for next season - our advice would be book early ahead of the crowds and enjoy a very unique experience. The Riad's restaurant also 'undersells ' itself - delicious filet de beouf served differently on two separate evenings. The only drawbacks were the approach via a couple of doubtful back-alleys and I suspect as the Riad will become far busier the bathing facilities may become a little strectched. Having read other trip advisor comments prior to visiting I would suggest the breakfast is more than adequate with the staff happy to oblige with additional dishes such as omelettes and toast. Also at lunchtime they prepared us sandwiches which agian weren't on the menu. Overall excellent facilities which all of us highly recommend.", "title": "An oasis in the chaos that is Marrakech", "user": "MagianWestBerks", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17842895, "likes": {"liked": "— The staff", "disliked": "— The approach"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This Riad is a architectural gem & worth a visit just for that. The rooms are spacious & are mostly preserved in traditional style... beautiful, intricate & ornate.", "title": "Beautiful Building, Shame about the management", "helpfulness": 3, "user": "Capita0", "date": "July 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17518971, "likes": {"liked": "— Stunning Old Riad that hasn't been overly modernised", "disliked": "— Management"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "A very pleasant garden & a pool (unusual for the medina).", "title": "Conference time? Try a riad.", "helpfulness": 1, "user": "EricOttawa", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 17453949, "likes": {"liked": "— Uniquely Moroccan experience", "disliked": "— No opinion"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The breakfast was a bit lacking & one was left with the impression that the management were just running the place as a sort of Gap year... noticeable air of amateurishness, but I guess that suits some folks.", "title": "Magical Riad in Central Marrakech", "helpfulness": 1, "user": "brambleyone", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16884855, "likes": {"liked": "— ambience"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Fantastic place and really quiet...it's all that we needed after passed all the day in Marrakech, with lots of people, motorbikes...the room was huge and the personal very nice. The breakfast it's so good but is every day the same... i'm sure if we come back some day in Marrakech we will repeat for sure...it's abolutely recommended...", "title": "a peaceful place", "user": "Lorelaina", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39906662}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I wanted somewhere really special to take my sister after the death of our mother and this was everything I could have hoped for and then some. This riad is simply beautiful. It is a feast for the senses in every way, from the ornate plasterwork to the carved wood to the mosaic floor tiles to the soft night time lighting in the courtyard. It is an oasis of calm after the hustle and bustle of the souks and main square, both of which are only a five minute walk from from the palais sebban.", "title": "Total Bliss", "user": "byrninrubber", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25647880}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "The staff are warm and welcoming, helpful and diligent. The mint tea (the best we had anywhere) and delicate biscuits provided in the beautiful courtyard on arrival were particularly appreciated. We decided to eat dinner at Palais Sebban on the first night and the tagine was one of the best we had during our stay. The whole place is spotlessly clean. The reception staff arranged a guide for us through the city and souks and a day trip to the atlas mountains at a fixed price, which is something of a relief after the normal haggling required almost everywhere else in the city.", "title": "Palais Sebban - 5 stars", "user": "alvinfromlondon", "date": "January 18, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23672118, "likes": {"liked": "— The customer service", "disliked": "— Having to leave and come home"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "One word of caution, we had told our guide that we were not interested in carpets, but this rather fell on deaf ears. We learned fast that it is incredibly important to say \"no\", mean it and walk away. It can feel terribly impolite, but anything less emphatic and you can find yourself \"trapped\".", "title": "Stunning decor and excellent service", "user": "Pingu3", "date": "January 14, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23545848, "likes": {"liked": "— A quiet oasis in the hussle and bussle of the Medina", "disliked": "— Haivng to find it when we first got there - but then that wasn't a problem as we were expecting that. Thats the nature of a Riad."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The breakfast is comprised of a variety of juices, yogurts and pastries is the same everyday, but neither my sister nor I found this problematic. In fact, my sister developed a worrying addiction to the fried pancakes. Insider knowledge proves useful. You can have scrambled eggs on request. Oh, and the coffee is great.", "title": "Beautiful building, friendly staff BUT ........!!", "helpfulness": 2, "user": "mjhale_art", "date": "November 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 21528898, "likes": {"liked": "— beautiful building ,friendly staff", "disliked": "— lack of leadership or communication between staff - very smart but just how much did they understand?"}}], "location": {"country": "Morocco", "region": "Marrakech-Tensift-El Haouz Region", "continent": "Africa", "city": "Marrakech"}, "stars": 4, "variance": {"poor": 11, "average": 16, "very good": 49, "terrible": 7, "excellent": 144}, "aka": "Palais Sebban Hotel", "slim_ranking": 0.432671081678, "description": "The owner and former king in Sebban give his name to his beautiful Palace that has been care fully ma intained by his family for over a centery.In 2006 and efter 4 years of renovationand restoration, it became a Moroccan Andalusian architecture jewel. (Zellige,Marbre,carved plaster ,Berber carved wooden, ceilings and original ceilings (Glaoui period),Marbled fontaine ....Everything in this palace of a thousand and one night makes you dreaming and soak up the Oriental culture."}