{"user_rating": 4.5, "review_count": 161, "name": "Palazzo Tasso", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This B&B has the character and feel of a hotel. The rooms are clean and bright, if a little small. The bathroom has all modern comfort and is very clean. The staff are very helpfull and the receptionist speaks near perfect English. The location of this B&B is perfect - just off Piazza Tasso, right in the middle of the main dining and shopping area of Sorrento. The rooms (at the back) have a little balcony. The B&B opened 8 months ago and I hope it can keep it's bright-white-clean-look. If at all I need to give any bad points, it would be the limited choice of breakfast where the coffee comes out of a machine and is not made \"italian style\".", "title": "Excellent location, excellent room, excellent service", "user": "chantal v", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127549561}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Had a delightful stay at Palazzo Tasso. The location in town made shopping, touring and dining made everything easy. The rooms were modern and clean. Silvana and Pepe were more than helpful and accommodating.", "title": "Comfortable & Friendly Boutique Hotel", "user": "jkhodge", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127242750}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Lucked out and switched from a hotel in town to Palazzo Tasso and was very happy with our two-night experience. The place was a little hard to find, since its on a small walking street, right off the main plaza. But once there, the facilities and room were fantastic! Evelina, Pepe and Silvana were great and very helpful with pointing us to restaurants and giving us advice for the rest of our trip. I will definitely stay here again!!!", "title": "Stayed here last week - excellent room, location and great staff!", "user": "Nick C", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126465772}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Our stay at Palazzo Tasso helped to make our holiday in Sorrento a very pleasant one. The hotel is small but it is modern, clean and very comfortable. It is also centrally located in very old and quaint street; however our room overlooked Corso Italia which is the main road. We used to have a good start to our day with Beppe who cheerfully supervised breakfast and gave us valuable tips for sight-seeing trips and good restaurants for our evening meals. Silvana dealt very efficiently with our bookings. She is a very friendly, pleasant person who gave us good advice and was always more than willing to help us with whatever we needed. From Sorrento it was easy for us to radiate to other places such as Pompeii, Ercolano, Capri, Paestum, the Amalfi Coast and Naples. Palazzo Tasso offers very good value for money and I would definitely recommend a stay to anyone travelling to Sorrento.", "title": "Perfect Base for the Campagnia region", "helpfulness": 1, "user": "Geraldine S", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126007589}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We greatly enjoyed our stay here and I would recommend this place without hesitation. The location is convenient, not only for exploring the town, but also for visiting other spots on the Amalfi Coast. The hotel was recently renovated and the modern decor is very stylish and comfortable. It is a great value for the money. The staff was friendly, and the breakfast was very pleasant in a nice room at the top of the hotel. A couple of minor issues: no matter what we did, we just couldn't seem to communicate that we needed more toilet paper. We finally had to tackle the maid to get some! Also, although the room was certainly clean, there were a couple of things that were overlooked - like an empty shampoo container that was left behind in the shower from the previous occupants. These minor problems certainly weren't big enough to distract from our stay, and maybe since it was off-season, things weren't up at full speed. At any rate, you will not be sorry that you chose the Palazzo Tasso!! I hope to return!!", "title": "Perfect base for the Amalfi Coast!", "user": "Seattletude", "date": "March 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125561905}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed seven nights here and as others said, the desk staff, especially Peppe and Sylvana, were very helpful and friendly. Peppe also managed the breakfast and helped with problems (clogged shower, A/C not working, etc.). Issues were addressed quickly and honestly. As long as the A/C was working, we could close the windows and get a quiet nights sleep. Breakfast was good considering the overall per night cost. Peppe managed the breakfast room very well. We also used the parking service for 15 euros per day, which worked out pretty well and seemed to be a good value, too. We would stay at Palazzo Tasso again for the location and the value.", "title": "Great value for the location", "helpfulness": 2, "user": "msanta", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130106922}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Silvana (I think that is her name) was very friendly and helped us with planning some local trips. The breakfast is not that great but you can grab something quick if you are in a hurry. Location is really great. It is only a 10 minute walk from the train station and a mere 5 minute walk from the city center. Overall a good stay.", "title": "Front desk personnel are really friendly and helpful.", "helpfulness": 2, "user": "Penguinantartica", "date": "May 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 129471612}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We recently stayed at Palazzo Tasso Hotel. The staff were very friendly and helpful with our enquiries. It is in a great position on the main street of Sorrento. The rooms are clean and decorated modernly. There were a few downsides to this hotel though. The room is not very well soundproofed and is therefore quite noisy. Also the curtains let in a lot of light because, being on the main street, the streetlights remain on all night. The internet connection was very weak and was continuously dropping out which was quite annoying when you were trying to book flights etc. Also, they had the annoying situation of having to put a plug into the wall in order for the electricity to come on. Except that all the keys were on the same key ring as the plug, including the safe key, which meant that when you wanted to unlock the safe you had to take the key off the ring so the power didn’t go out. Apart from these things, which could be easily addressed, we had a pleasant stay there and would probably return.", "title": "Nice stay", "helpfulness": 2, "user": "Spud64", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129401494}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Boutique hotel facing Corso Italia, the main street in Sorrento. Entrance is from a back alley. The windows are fully double glazed and noise was not a problem in our room.", "title": "Bijoux gem", "helpfulness": 1, "user": "HertsOldie", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129083656}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "The hotel is decorated in a modern fashion, large comfortable rooms with flat screen TV and wifi.", "title": "Fresh, modern, and central but loud church bells at 8.15 on sunday morning.", "user": "JoGiant", "date": "April 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 129028755}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "My stay at Palazzo Tasso was outstanding. The staff were extremely friendly and more than willing to help you with anything you needed: from directions, recommendations on food/entertainment. The room was spectacular: modern furnishing, very clean, very classy and over looked the city. Their breakfast was above and beyond the \"continental breakfast\" most places offer- they had everything from coffee/hot chocolate to fresh pastries and bacon. I would highly recommend staying here for any occasion!", "title": "A hidden treasure.", "helpfulness": 1, "user": "Kyla Jean H", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125294047}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The owner, Ms. SilIvana is very nice enough. We originally booked 2 rooms for 3 girls for a month ago through the booking.com. After we travelled from Roma, we decided to change our booking to 1 triple room. As the time constraint, I have no time to modify my booking through the booking agent. I tried to contact Silivana directly, she was very nice to offer a triple room with the original early bird price. The hotel is most likely an IKEA style as all furnitures in the room are in white colour. We are assigned to a room with rooftop window (2 single beds and 1 extra bed) so that we have chance to see the moon and stars in a clear night. The breakfast is served at the 3rd floor (next to our room). Not much choices only bread, cake, yogurt, few kinds of fresh fruits but it seems enough to have a cappuccino as well. The hotel is at the centre of Corso Italia Road (shopping street). When you arrive Circumvesuviana Train in Sorrento, you have to walk down the street and turn left on the Corso Italia Road, then straight ahead into Piazza Tasso. In the main square in Piazza Tasso. You then will see a statue in the middle of the square, keep on going ahead towards the Cathedral. Just under the bell tower of the Cathedral, on the left hand side there is an arch, go through the arch then turn left again, under the second arch and 20 meters on the left you will find the entrance to Palazzo Tasso. Silivana was also recommended us a restaurant named \" Zi ' Ntonio\" which is a very traditional and delicious restaurant. She also advised us how to travel Positano and Amflfi by bus. The man (receptionist) served us in the breakfast is also kind enough as well. Free wifi provides in the room and entire guest house.", "title": "Nice owner and perfect location", "helpfulness": 5, "user": "ChanHK", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123947137}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "It is perfect if the guest house can arrange one more rubbish bin the room and to change the “used towels“ and made up a basin in the bathroom everyday.", "title": "Look no further than the Palazzo Tasso in Sorrento", "helpfulness": 2, "user": "MonkeymanDenver", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123792560}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I extended my stay in Sorrento for three extra days because I just did not want to leave the Palazzo Tasso. Located in a perfect spot in the center of Sorrento, this extremely well maintained small property is a gem..Peppe and Silvana's hospitality is sincere..They are experts about the area and just genuinely nice people...I had a tough time leaving.", "title": "Great Stay! Thanks Peppe", "helpfulness": 1, "user": "Gloriahelm", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123208121}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Our first stay in Sorrento and the Palazzo Tasso. We struggled to find it but Peppe found us! They remodeled last year and spared no expense. The room was beautiful the room warm and the water Hot! The staffed was excellent. Breakfast was delightful pastries and delicious coffee? Thanks Peppe for a wonderful stay and we'll see you again in July", "title": "Amazing!", "user": "Rae L", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123126101}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I staid for 7 days in Palazzo Tasso last week and was truly satisfied. The hotel is located right on Corso Italia, close to numerous restaurants and remarkable historical worth seeing places. The hotel is newly renovated, offering comfortable and nicely decorated rooms. Also very importantly the staff is very helpful and friendly. Would very much recommend it./Johan", "title": "A perfect place in the city centre!", "user": "Johan334", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128534985}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed in Palazzo Tasso for a week recently in a lovely room with a tiny but perfectly adequate balcony overlooking the main street Corso Italia. The entrance is in a narrow (atmospheric) pedestrian street (Via Santa Maria della Pieta - lovely name!) parallel to the main street.", "title": "Great location and very friendly and welcoming staff", "user": "farender", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128319740}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "They do describe the accommodation as B&B because it doesn't have hotel facilities such as bar, lounge etc and it is an excellent B&B with comfortable modern rooms en-suite which are clean and bright with comfortable beds.", "title": "A great place to stay", "user": "moggyo", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128263968}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "There is a small lift from reception.", "title": "Excellent! Would recommend it to anyone!", "helpfulness": 1, "user": "Kelly C", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128226750}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Very good continental breakfast - juice, yogurt, fruit, breadrolls, pastries etc and coffee (or tea) made by the ever-cheerful Peppe.", "title": "Excellent location and very friendly service.", "user": "Sonya M", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127672461}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 8, "very good": 48, "terrible": 1, "excellent": 104}, "slim_ranking": 0.216494845361, "description": "In the charming historical center of Sorrento you will find Palazzo Tasso, which offers 15 cozy & elegant rooms, extremely luminous, decorated in a fresh style, ideal for those looking for privacy and tranquility. Sorrento, place of outstanding beauty, is the ideal starting point for the visits of all major attractions in and around Sorrento. The newly-refurnished property offers all guests the possibility to enjoy their vacation in beautifully furnished suites with all amenities!"}