{"user_rating": 4.5, "review_count": 279, "name": "Palazzo Selvadego", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the Palazzo del Selvadego for 1 night at the end of June 2006. It is the \"sister hotel\" of the Monacco Grand Canal, which is just a few minutes walk. We checked in at the MGC and then we were escorted to the Selvadego. Our room was very spacious and had a great bathroom and huge closet. It didn't have a fancy view, but that's okay because the inside of the room was great! We had breakfast at the Monacco Grand Canal and enjoyed the beautiful view. The staff is very helpful and they gave us great suggestions. One of the best things about Palazzo del Selvadego is the location! It is literally around the corner from St. Mark's Square. It's great to be within walking distance of everything. We really enjoyed our stay and would stay here again!", "title": "We loved it!!!", "helpfulness": 6, "user": "cloud99", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5472367}, {"rating": 4.0, "title": "Big rooms, great location", "text": "This is the sister hotel to Hotel Monaco & Grand Canal. We wanted to stay one more night in Venice and there wasn't room at the Hotel Monaco so they put us here. The rooms was big. The shower was huge. They had a real blow dryer in the bathroom instead of the ones that are attached to the wall and that don't do a good job. The hotel is located right behind St. Mark's (it's above the Zegna store). They don't have a restaurant but you can take to the short walk over to the Hotel Monaco if you want the free continental breakfast or any other meals. The staff here was very friendly and helpful.", "helpfulness": 3, "user": "KK", "date": "July 11, 2006", "id": 5449667}, {"rating": 4.0, "title": "Great location for first visits", "text": "I took my daughter to Venice for her birthday and stayed at the Selvadego. I had been to Venice before, but its location makes it easy for anyone to find. Waterbuses call at San Marco stop, right outside the Hotel Monaco & Grand, which is where we checked in. A water taxi would have cost around 55 euros from Piazzale Roma, a return on the waterbus cost 9 euros each. A porter then carried our luggage around the corner to the Selvadego.", "helpfulness": 10, "user": "Tubster", "date": "June 5, 2006", "id": 5299222}, {"rating": 5.0, "title": "Great Hotel", "text": "The room we had was very large by European standards, immaculately clean, and the gents on the reception desk were, without exception, very friendly, helpful and polite.", "helpfulness": 12, "user": "shaun01", "date": "April 22, 2006", "id": 4994507}, {"rating": 4.0, "title": "A wonderful find in a great location!", "text": "The view from the terrace of the Monaco, where breakfast is served, is wonderful.A basket of muffins, rolls, etc is included in the price.Hot dishes, fruit etc are available at extra charge. I found these prices reasonable considering you are in a major tourist destination in Europe, sat on a terrace overlooking the Grand Canal!", "helpfulness": 20, "user": "A TripAdvisor user", "date": "March 26, 2006", "id": 4735868}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Just returned from a week end in Venice. We booked it through Expedia... The hotel is perfectly situated, less than 200m off San Marco square but yet in a rather calm small street. We booked a standard room and it was really good in terms of size and amenities, especially the bathroom. The decoration is kid of modern style but very charming.", "title": "Perfect", "helpfulness": 6, "user": "jojo_leb", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5767079}, {"rating": 4.0, "title": "Selvagego...not quite a \"Palazzo\" but more than satisfactory!", "text": "The people at the reception were very helpful.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 2, 2006", "id": 5762661}, {"rating": 2.0, "title": "Want to feel like a second class citizen?", "text": "The continental breakfast is included... It's served at the wonderful terrass of the Monaco& Grand canal hotel. It's true that it includes a coffee/ cappucino and a basket of croissant, muffin and toasts with some jam. But it's good and sufficient! (Anything additional is extra). After all we weren't in Venice for the breakfast!", "helpfulness": 14, "user": "Davidian", "date": "August 28, 2006", "id": 5715399}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "A very big advantage is the location of the hotel, you won't know what i really mean unless you visit Venice! The Vaporetto/ water taxi drops you off at the station just in front of the Monaco & Grand canal hotel, where you can do your check-in and be \"escorted\" to the Palazzo. (Or you can directly go there of course, and it's simple too, just straight then right and the Palazzo will be facing you on your left. Just above the E. Zegna boutique).", "title": "Superior in every way", "helpfulness": 4, "user": "LisaGoldsmith", "date": "August 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5626650, "likes": {"liked": "— The location near Piazzo San Marco and the Grand Canal and shopping and restaurants", "disliked": "— Twin beds pushed together to create double bed"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Wonderful city, wonderful hotel, to be visited again!", "title": "Stay Here!", "helpfulness": 6, "user": "buckliew", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5540429, "likes": {"liked": "— The large room & the location", "disliked": "— not a lot of night life close by"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I booked this hotel on Expedia after having read reviews here. I paid 170$ / night which is a very good deal for such a location / hotel ( stayed 2 nights).", "title": "Good deal!", "helpfulness": 4, "user": "First_time_in_Venice", "date": "December 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6475320}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The hotel is like 25m from San Marco Plazza, and next to the luxury shops.", "title": "Good but not great", "helpfulness": 6, "user": "KateAp", "date": "November 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6230389, "likes": {"liked": "— location, room", "disliked": "— lack of aircon, mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "The room was very spacious for European standards. The hotel has been recently renovated, so the bathroom is in excellent conditions. My room (715) only had a shower though.", "title": "Fantastic stay", "helpfulness": 6, "user": "Des-Cork", "date": "November 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6169113, "likes": {"liked": "— Location and feeling of quality about everything", "disliked": "— No reservations"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The only thing is that Breakfast is served at the sister hotel ( Monaco) which is near the Grand canal (3min walk).", "title": "Great location, even better than Hotel Monaco", "helpfulness": 2, "user": "LouieGroup", "date": "September 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5833638}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "What you have that is included in the continental breakfast is not that great, but it's enough.", "title": "Great spot in Venice!", "helpfulness": 4, "user": "cxb56", "date": "September 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5831327}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed one night in Aug 06. We checked in at the mother hotel and the bell man walked us to the plazzo. The walk was down a dark stinky ally then right and left then another ally then we were there, so first impression was uh oh where are we going :) but it was a very nice hotel beautiful decor and very clean, the room comfortable and we loved the bathroom and shower. We made the mistake of going back the same way we got to the hotel to get to St. marks sqare but it turned out if we just turned left from the hotel we would have got there much easier :)", "title": "Pefect Venice Experience", "user": "shawana80", "date": "June 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7955048, "likes": {"liked": "— Bathroom- Breakfast", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I loved our stay,, especially the breakfast", "title": "Wondeful Place to Stay", "helpfulness": 3, "user": "TIDE2124", "date": "May 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7572278, "likes": {"liked": "— clean and good value", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "ooh yeah,, last year we paid 140 euros a night,, i just checked now it's 410! WHY??", "title": "Amazing Hotel, Great Location", "helpfulness": 2, "user": "marggis", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7429502, "likes": {"liked": "— Hotel Accomodations And Location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We were there for three nights. The room was very large, the bath had a great shower and breakfast was overlooking the Grand Canal what more could we ask. The hotel is at the San Marco water bus stop making it perfect to get around Venice.", "title": "Great Location Wonderful Stay", "helpfulness": 2, "user": "srbjsim", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7188841, "likes": {"liked": "— The room", "disliked": "— breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The hotel is beautiful, and the location could not be better. Rooms are amazing, huge, super comfortable, including the bathroom. It is a very modern fairly either new or remodeled hotel. It's in partership with Hotel Monaco Grand Canal, so you go every morning to the amazing location to eat a great breakfast with fresh orange juice", "title": "Affordable luxury beside San Marco piazza", "helpfulness": 2, "user": "AudreyO", "date": "March 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7170705, "likes": {"liked": "— location! and modern facilities in such an old city.", "disliked": "— being put in the front room, when i asked for a quiet room!"}}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 21, "very good": 94, "terrible": 4, "excellent": 153}, "aka": "Palazzo Del Selvadego Hotel", "slim_ranking": 0.341207349081, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 5.0}, "description": "This Four Star Superior Hotel, owned by the Benetton Group, as the Hotel Monaco & Grand Canal, started to be a hotel from the end of the XII century on, when it was already chosen by ambassadors, prelates and important people of the Venetian life.With its late-Gothic facade in Venetian Byzantine style it surely is one of the most remarkable and significant examples of the Venetian architecture of the late thirteenth century. Today, the 34 rooms of Palazzo Selvadego are equipped with every comfort and immersed in a calm and relaxing atmosphere and are able to transmit from the first moment the uniqueness of this building, thanks to its design and also to the exposed beams in the rooms. Services include safety box, minibar, TV, hair dryer, complimentary toiletries in the bathrooms and a kettle with various teas and coffee available to the client. Breakfast is served in the restaurant of the Hotel Monaco & Grand Canal which is just 70 meters from the Palazzo Selvadego and according to the weather it will be served on the magnificent terrace of the Restaurant \"Grand Canal\" with breathtaking views on the Grand Canal and St. Mark’s Basin. This place has always been the meeting point of the mundane life in the city."}