{"user_rating": 4.5, "review_count": 589, "name": "Palacio Duhau - Park Hyatt Buenos Aires", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2007", "text": "A lovely hotel, in an old French style mansion but with a terrible service. Overpriced room rates do not grant great service – that is for sure . Staff is plain snobby. Isn’t the company publicly traded or so? That would explains how they keep busy. Looking at trip-advisor stories of other visitors, I must say that they read like a hotel brochure.", "title": "I agree with other rewie's: Faboulous Architecture, Horrible Service", "helpfulness": 2, "user": "voyageureuse", "date": "December 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 11893486}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "In my opinion the Palacio Duhau is overrated and overpriced. In all fairness the hotel is beautiful and the service was great, but I’d recommend staying at one of the many other great hotels in BA and going over to the Park Hyatt for a cocktail (a very expensive one at that). The hotel is very pricy...not only on the room rates but also on all their services. On our last leg of our Argentinan trip we also stayed at the Buenos Aires Park Tower for 1/3 of the cost of the Hyatt and really enjoyed it better.", "title": "An OK Hotel...However", "helpfulness": 2, "user": "maybebaby", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11195756, "likes": {"liked": "— Service", "disliked": "— Price"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "At US$770 a day, we spent 70 hours in late November 2007", "title": "Fabulous Architecture, Horrible Service!", "helpfulness": 5, "user": "zuzunyc", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 11082275, "likes": {"liked": "— Service", "disliked": "— Service"}}, {"rating": 5.0, "title": "Best hotel I have ever stayed in!", "text": "at the Park Hyatt Buenos Aires Palacio Duhau where the cartoonish service was inexcusable at these rates.", "helpfulness": 2, "user": "EnglandMax", "date": "October 6, 2007", "id": 10045041}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Our \"Park Hyatt Deluxe Suite King\", while nicely furnished, had a sitting area in an attic space. The \"butler\" service was a joke as she vanished after initial introductions. Tango and polo sessions booked through the hotel left us waiting up to 1-1/2 hours in the lobby as the staff bumbled through their mess.", "title": "AN AMAZING TREAT", "helpfulness": 3, "user": "coachmark", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8507655, "likes": {"liked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Outstanding service, beautiful grounds, gorgeous rooms, delicious food, what more could you want?", "title": "Wonderful!", "user": "worldtraveler9871", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128322022}, {"rating": 5.0, "title": "Gorgeous and helpful", "text": "We stayed there for only one night and it was very expensive, but worth it! We were going to be spending 2 more weeks in an apartment across the street and staying there payed off completely because we came back to the concierge time and time again and they graciously put up with us and helped us superbly every time. Definitely the place to stay in BA... We glanced in the lobby at the Four Seasons and the hotel was not nearly as nice and the staff was very rude when we asked them about an ATM.", "user": "Heidi_traveler", "date": "April 22, 2012", "id": 128321830}, {"rating": 5.0, "title": "Stunning", "text": "We only spent one night here but the staff continued to be very generous with their time and efforts even after we checked out. The dance show was great and the restaurant staff was friendly.", "user": "Fritz K", "date": "April 22, 2012", "id": 128319534}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This hotel was great, we had an amazing view of the property from our room, and great service all together. Although we only stayed there for one night, for the next two weeks we rented an apartment across the street, and although we weren't staying there, they would always help us when we needed it.", "title": "Park Hyatt Recoleta NASTY POOL!!!", "helpfulness": 5, "user": "Batchmaster", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128024215}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel is gorgeous, based out of one of the city's most famous palaces on the equivalent of Rodeo Drive for Argentina. HOWEVER ALL IS NOT WELL AT THIS HOTEL. The pool was installed using typical third world techniques which means it looks nice but doesn't work. There is no filtration system which keeps the surface clean, resulting in having to swim in other people's hair, etc. In fact, there is no water circulation moving water into the filters. I may be criticized for being too detail-obsessed but I am an architect and know full well that if this pool existed in the U.S., the hotel would be shut down by the health department. Its a shame that an otherwise nice hotel cannot get their act together with regard to this detail. Rather than risk an ear infection or worse, it goes without saying that I will be taking my business elsewhere during my next stay in Buenos Aires.", "title": "Expensive, but worth it", "user": "bartekToronto", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128011421}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My wife and I agree that this hotel is one of the finest at which we have ever stayed. The physical property is spectacular. The courtyard between the palace and the new tower is easily the nicest urban outdoor space I have ever experienced at a hotel. Whether it was breakfast on the patio or wine and cheese before dinner, we spent a bit of time in the courtyard on every one of four days at the PH.", "title": "Exceptional Service", "helpfulness": 5, "user": "FenwayFan", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8489256, "likes": {"liked": "— Spectacular property and service.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "I booked a two-night stay at the Park Hyatt from the hotel's website and was there for New Years Eve.", "title": "Excellent stay at the Park Hyatt BA", "helpfulness": 2, "user": "rsp1", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12537728, "likes": {"liked": "— Terrific service, nice rooms", "disliked": "— pool in the basement"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Check in was very quick. After realizing that I had an Executive Suite, the person at the counter called for a \"Butler\" who escorted me to my room and showed me around. It was massive with excellent views.", "title": "One of my Favourite Hotels in the World", "helpfulness": 1, "user": "Wizardmate", "date": "January 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12325122, "likes": {"liked": "— The garden, view and location", "disliked": "— Gk"}}, {"rating": 5.0, "title": "Heavenly", "text": "The rooms were modern, clean and well appointed. In addition to the local outlets, the room had a number of Euro and US outlets, which was much appreciated. While there is no wireless internet, high speed wired connections are available. Both the bedroom and living room had flat screen HDTVs. There were multiple cordless phones which worked anywhere around the hotel property. The living room was huge as was the bedroom. They also had electronic controls for lights/fixtures like a Peninsula. The bed was very comfortable. The bathroom was huge with a shower and large jacuzzi-style bathtub.", "helpfulness": 1, "user": "drabs", "date": "January 3, 2008", "id": 12310717}, {"rating": 5.0, "title": "Great Hotel", "text": "The hotel offers free shoe-shines and 2 free pressings (at least for rooms on the executive floor). The Butler and Concierge services were top notch. They were able to arrange bike rentals on New Year's Day and an airport pickup for me at a future stop on my trip.", "helpfulness": 2, "user": "bocae", "date": "December 28, 2007", "id": 12022927}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "As it was NYE, the hotel provided a number of free gifts/surprises throughout the day -- sugar grapes, local dulce de luche, wine, etc. I believe that these were provided to all guests.", "title": "okay, but nothing to write home about.", "helpfulness": 1, "user": "gig11", "date": "December 26, 2007", "detail_rating": {"value": 3.0}, "id": 11973444}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "A zen-like environment with very good service. The rooms and public spaces are elegantly and functionally furnished. The public spaces are quiet in contrast to some of the other highly rated hotels in Buenos Aires.", "title": "An oasis of refined elegance in the midst of a large, busy city", "helpfulness": 1, "user": "zugs", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7180472}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We used our Hyatt points to stay at this hotel and it was a wonderful choice. We were upgraded to a suite in the tower, which was clean, modern, spacious, and luxurious. We found the lighting system to be somewhat inscrutable and asked management for assistance. On our second day, while visiting the beautiful indoor swimming pool area, a manager approached us, apologized for the problems with the lighting, and offered to move us to an even larger suite in the palace. We accepted (although this really wasn't necessary) and found our room to be even more luxurious. The palace also affords somewhat more of a feeling of being in Buenos Aires than the tower, which could really be in any major international city. We found the concierge and hotel staff to be extremely friendly and service-oriented. The location of the hotel is superb--only a couple of blocks from the Alvear Palace--and there are actually separate (but connected) lobbies for the palace and tower rooms. We highly recommend this hotel.", "title": "Luxurious and Solicitous", "user": "DCRE", "date": "May 18, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130168458}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The Park Hyatt Hotel (Palacio Duhau) in Buenos Aires gives definition to warm elegance and comfortable luxury. The hotel is visually stunning and exactly what you want a grand city residence to be - the lighting, the finishes, the art - it even smells rich in a good way! But the real reason to stay here is the team. The mostly Argentinian guest services team, the waiters, the bartenders, the housekeepers and the bellmen are so charming, helpful and knowledgeable, we felt we were staying with people who both truly wanted us there AND wanted us to love their city. This hotel is not inexpensive but it is worth it for a stay that will make you feel that you've been part of something very special in Buenos Aires.", "title": "Simply Perfect. Perfecto!", "user": "Amy M", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129952572}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "Its now six years since visiting BA and the Park Hyatt - which then dazzled, was outstanding value and left me wanting more. Well, what a difference 6 years makes - I arrived from Tokyo exhausted but excited...However, this did not last long... The indifference of the staff and rather naive approach was the first clue that all was not what it was. The second was the check for lunch - $90 dollars for two glasses of wine ( I requested a house Malbec). I've never had sticker shock like this before - not in the George V Paris, not even in the Mandarin Oriental Tokyo I had left 36 hours before.  This is price gouging at its worst, and it left a very bad taste.....This hotel has lost its luster, layers of dust are literally everywhere and the service and quality do not equal the ridiculous prices.  My corner suite was musty and the air conditioning and plumbing simply didn't work. I immediately opted to leave after just one night.....a good decision!", "title": "Outrageous prices!", "helpfulness": 8, "user": "luxurytravelguru", "date": "May 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 129750243}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Park Hyatt in Buenos Aires is a wonderful hotel, and we are not surprised it won a recent award for the best hotel in Argentina. We stayed for 5 nights in the older part, the Duhau Palace in an Executive Suite, which is highly recommended since it has a large sitting room and separate bedroom. The Palace is beautifully decorated and restored; the breakfasts in a lovely salon are essentially a la carte and sumptuous. But almost the best thing about the hotel is the staff; they are attentive, friendly, and nothing is too much trouble. Maria on the front desk and her colleagues are just so nice, as is all the staff in the hotel. The restaurants are excellent. Nothing is too much trouble for guests in the Park Hyatt. We could not fault it. Definitely a wonderful experience and highly recommended.", "title": "The Best Hotel in Buenos Aires", "user": "FunTimes030", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129568120}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I have traveled many places, and this hotel is definitely among my top three! The service was impeccable, and the grounds were kept very neat and clean, despite the general uncleanliness of Buenos Aires. It was nice to step into the hotel from the dog and other waste littered streets to somewhere clean and inviting.", "title": "Luxury is the best one word description here", "user": "TeamDavis", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129552573}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It’s very difficult to find fault with this hotel. From the moment we stepped out of the taxi until sadly we had to leave Buenos Aires, we had a 5 star experience from start to finish.", "title": "A 5 Star Experience In A Fantastic Location", "user": "mgirishrover", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66324884}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "The hotel itself is an extremely impressive building from the outside with staff a plenty waiting to greet you on arrival. Check in was very prompt however we did feel that a number of the check in staff had an air about them almost to a point that they looked down on us. This treatment angered us, however, the rest of the staff were so pleasant that we forgot about it quite quickly.", "title": "Beautiful Property", "user": "platinum4life", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62229944}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "The rooms are modern, stylish and very comfortable. The bathroom area was divided into 3 sections – shower, toilet and bidet, and bath and wash hand basins – and was also stocked with an ample amount of towels and toiletries. For the first time in many years I looked forward to getting up in the morning as the breakfast was to die for! Guests can chose from a very extensive buffet along with the option of ordering a hot breakfast, it was truly divine!", "title": "Luxury with discretion", "user": "elderc", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61710915}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "As I mentioned above, the staff (with the exception of a few!) are incredibly friendly yet professional, no matter what the request nothing was a problem.", "title": "Fantastic!!!!!!!!!!!!!!!!!!", "user": "claudioportobay", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61242069}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Overall, we had an incredible stay and I would highly recommend this hotel. We hope to return to Buenos Aires sooner rather than later and, when we do, we will definitely be returning to the Park Hyatt.", "title": "The pinnacle of luxury", "user": "AirMilesLuvr", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61224037}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "You can't go wrong staying at the Park Hyatt. It's simply an outstanding hotel, quiet, luxurious, great breakfast, wonderful Spa and fitness room, and incredible service. I used to stay at the Plaza Marriott when visiting Buenos Aires, but no more. For an extra $100, this place is well worth the luxurious appointments, food and extra attention.", "title": "An Outstanding Hotel in Buenos Aires!", "user": "mshbnyehud", "date": "December 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51840956}, {"rating": 5.0, "title": "Excellent Hotel", "text": "Excellent Hotel. Ideal location. Good size rooms. Excellent facilities. Nice bar.", "user": "Lance001", "date": "December 7, 2009", "id": 50825404}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed at the Park Hyatt Buenos Aires for 7 days (with a one night trip to the Iguazu Falls in between). The hotel itself was generally of a very high standard but what made it special were the superb staff - probably the best we have ever experienced anywhere else - there seemed to be nothing that they could/would not willingly do to make our stay more enjoyable !", "title": "Excellent Hotel - Superb Staff", "user": "EssexBoy", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49459035}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "One small complaint is that the lighting system in the bedrooms was so \"high-tec\" that we only really mastered it by the end of our stay - not great if you are staying for just one or two nights. Apparently we were not alone and the hotel is looking into a way of simplifying it.", "title": "Amor de Porteño", "helpfulness": 2, "user": "beentherebeenthat", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48667862}, {"rating": 5.0, "title": "Fantastic, one of best \"chain hotels\" ever visited", "text": "Also although the buffet breakfast was perfectly adequate it did not offer quite as much choice as we would have expected.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 3, 2009", "id": 48456149}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Park Hyatt Hotel ---Rated Last \"Not Recommended\" due to potential Health Risk . Park Hyatt rated last and \"not recommended \"for many reasons . Has full service salon, massage ,nice sauna ,  modern fitness equipment, its located below ground but nice ambience , has No steam, locker areas and showers as well as floor not kept to high standards .", "title": "Pool and Jacuzzi dirty", "helpfulness": 2, "user": "skiph123", "date": "April 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129112541}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Indoor pool is Olympic style and great at first look, problem is no skimmer surface filter to clean surface of body oils, hair and body fluids from heavy use . The pool was build wrong and would not meet USA and sure most European country  standards and codes . The jacuzzi in men's locker room is completely non functional with no filter system and when heavily used water quality is bad . Noticed water was cloudy at times. Found out they emptied water daily , did not add chlorine until i tested the water with my own water tester and found no chlorine to keep people safe. They then said they added chlorine  , but tested it several times thereafter and found it Not clean . The sad thing about this hotel is it is a very nice 5 star hotel facility, but apparently bad management who refuses to fix or accept they have a problem . Potential health risk is always possible from unclean water and lack of", "title": "Luxury at Its Best", "user": "damg", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129046879}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Proper maintenance and proper filtration systems. This facility and it's management will harm the Park", "title": "Very nice hotel but", "helpfulness": 1, "user": "charlestonrealtor", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129005587}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Hyatt brand if this is all not fixed and brought to high standards. To allow this bad water exposure to its past guest and future guest is simply inexcusable and deplorable and imagine someone will have to do something eventually . Until they have fixed this problem their rating will be Not Recommended.", "title": "Should rank as 7Star hotel !", "user": "Daniel V", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128602267}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Used a lot of Hyatt points to stay at the Palacio Duhau for three nights and it was well worth it. The staff, the suite, the breakfast, the location -- all outstanding. This is where the Pope stayed on his visit to Buenos Aires. It makes me want to convert. Very expensive if you are paying for the stay, but if money is no object or if you have the points, it's a once in a lifetime experience. Be sure to get a room in the Palacio, not the new tower.", "title": "nice place to stay", "user": "rachelSantiago", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128392996}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "This was a truly fabulous hotel and one of the very best we have ever stayed in. The rooms (luckily for us on the Palacio side) were excellent, especially 401, and the service faultless. We stayed here three times during our two week work/holiday trip to Argentina in late March/early April and can't recommend it highly enough", "title": "A Fabulous Hotel!", "user": "HoveSweetHove", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61188578}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the Park Hyatt twice on our recent two week sojourn to Argentina. Once on the front end for two nights and again at the end of our trip for two nights. Both stays were fantastic and the second stay perfect.This is a very well run, well managed property with a professional, coureous and well trained staff. The hotel has two parts, a \"mansion\" on Avenida Alvear and a newer \"tower\" on Posadas. I was fortunate enough to stay in both places and recommend the tower over the mansion. The best of both worlds is to stay in the tower with a room that overlooks the courtyard between the two buildings and offers a majestic view of the old mansion. To the particulars:", "title": "Fantastic Base to Tour Buenos Aires", "helpfulness": 1, "user": "Jeff R", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60430109}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Rooms: We were upgraded to a suite on both occasions. The suite in the old building was charming but small, with a view overlooking Avenida Alvear. The bathroom was nice and large with a separate shower and toilet room.", "title": "a pleasure - as always", "user": "EllaMLondon", "date": "March 27, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 59688574}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The suite in the newer building was one of the nicest rooms I've ever seen. It was huge, well appointed, and had the view described above. The bathroom was monstrious and very nicely done. Ours was number 602, so if you want a great suite you might want to request it.", "title": "BEST HOTEL IN THE WORLD!!!", "user": "RichardCLT", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59517063}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Physical Facility: The hotel is simply gorgeous. The interior is well thought out and beautifully decorated. There are two ways to get from one building to the other, and both are beautiful. One can walk through the courtyard separating the buildings or one can walk under the courtyard through the hotel's art gallery. There were two separate exhibits while we were there, so they must change the art frequenty. It added a nice touch. There are two separate reception desks and concierge desks - one in each building. This was a great idea and one I haven't seen before. Finally, there are two separate entrances with full service, one on Posadas and one on Avenida Alvear. If you know which building you are in you can check in at the applicable desk.", "title": "Stay Here", "user": "Rockemsockemrobot", "date": "March 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57387438}, {"rating": 3.0, "stay_parameters": "Stayed February 2010", "text": "Beautiful hotel, interior was amazing and the staff were exceptional.", "title": "Beautiful reception, great staff but rooms so bland", "user": "Debbie D", "date": "February 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 56906598}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Shame the rooms were exceptionally bland, adequate for the business traveller who needs somewhere to rest their head but not much else. Had everything that was needed but so dull.....", "title": "My New Favorite Hotel", "user": "Jeanne5", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56814492}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "A real shame as the hotel has so much potential", "title": "Exquisite Service, Beautiful Rooms", "user": "dskWashington_DC", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54841842}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "We stayed here twice on our recent visit to BsAs. Great rooms, service, and restuarants. Can\"t wait to go back", "title": "What a rip-off", "helpfulness": 2, "user": "johan_roets", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 54034126}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "This was one of the best hotels we have ever had the pleasure to enjoy. The service was impeccable and the suite was fabulous!", "title": "one of the best 5* hotels I have ever stayed in", "helpfulness": 1, "user": "NewYorkDunelmian", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51877463}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I fully recommend the Park Hyatt Palacio Duhau. This is a very classy place, located in one of the finest neighborhoods of Buenos Aires and offering exceptional service.", "title": "The definition of luxury and outstanding service", "user": "Smertios", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127839625}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Rooms", "title": "Elegant hotel", "user": "CiteeGirl", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127812863}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The room I had on the six floor was quiet with a nice view to the Vatican embassy courtyard. Bedding was very comfortable with plenty of pillows. Samsung large flat screen TV with variety of choices. Large desk and very nice controls to dim in and out the lights.", "title": "Sleek hotel - well located", "user": "will279", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127488412}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The bathroom was large and beautifully appointed. Marble tiles, separate rain shower, ample counter space by the sink. Toilet and bidet covered by a privacy glass sliding door. Excellent quality shampoo and soaps", "title": "An exceptional dream!", "user": "travellingmermoz", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127466381}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Complimentary water, coffee and tea. Fresh apples everynight. We arrived on Easter Sunday and they had a gift of a yummy easter egg.", "title": "Top quality hotel in an excellent location", "user": "Chesham", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 127424703}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 5, "variance": {"poor": 9, "average": 24, "very good": 74, "terrible": 8, "excellent": 474}, "aka": "Palacio Duhau - Park Hyatt Buenos Aires Hotel Buenos Aires", "slim_ranking": 0.0386363636364, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Beautiful gardens, surrounded by the elegant architecture of the Palace, create a magnificent atmosphere."}