{"user_rating": 5.0, "review_count": 86, "name": "Palazzo di Pietro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled solo", "text": "I really should have written about Palazzo di Pietro a long time ago. It's fair to say that Chania has hotels for every taste and budget. I agree with most of the other reviewers that Palazzo di Pietro is an outstanding choice. It is a charming and intimate small hotel in the historic port area of Hania. I was put in the annex, which was actually a studio apartment in the building behind the main one. I had total privacy. The furnishings were simple, elegant and rustic at the same time. The owner was very nice and helpful in renting a car. I liked the place so much that I booked my brother and his wife in there when they took an anniversary trip to Crete.", "title": "Couldn't be better", "user": "Massimo1", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51471446}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My wife and I decided on a late holiday this year back in Chania where we have spent many happy holidays when our children were growing up.", "title": "Hugely overpriced for end of season! Complain at your own risk!", "helpfulness": 11, "user": "NewspaperDirect", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 48752574}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We decided to stay again at Palazzo di Petro (PdP) where we had spent a lovely holiday with the girls back in 2006. When we contacted Christine to enquire about pricing she told us that high season prices remained in force right until the end of October because they stayed busy right through. In the end despite some huge misgivings we decided to pay 135 euros per night for this place based on the location and our ignorance of late season pricing here.", "title": "A little gem!", "helpfulness": 1, "user": "C_and_SManchester", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17784808, "likes": {"liked": "— The lovely spotlessly clean rooms & generosity of the hosts", "disliked": "— Christine could do with an assistant."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "When we arrived we were shown by the loquatious Christine up to a room at the top of the hotel up 4 long flights of wooden stairs - I was close to passing out by the time I had lugged the second of our big cases up this vertical assault course.", "title": "Amazing Honeymoon", "helpfulness": 2, "user": "LMQS", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 11303846}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "All that said we spent our holiday in glorious enjoyable isolation untroubled by other guests or indeed by Christine until the power went off during a thunder storm on the last Sunday. We had no means of contacting anyone and in the end we went out without being able to shower, change or freshen up. When we arrived back later that evening the power was still out but we did discover a number to call on the outside wall of PdPand help came at last to reset the fuse box. At this point we realised that we were just paying way too much for this hotel and the next day by way of research for next time we checked alternative prices in the area. In the very same street we found rooms just as nice with permanently manned receptions for 35-60 Euros. When we settled up with Christine the following night we decided to be honest and to tell her we were really not happy with the value for money and level of response.", "title": "Delightful palazzio", "helpfulness": 3, "user": "BlinkyT", "date": "October 25, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 10318860, "likes": {"liked": "— Hospitality of the owner, cleanliness and comfort and situation", "disliked": "— If I had one grip it would be the stairs and that is why it is unsuitable for young children and disabled"}}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3, "variance": {"poor": 2, "average": 1, "very good": 7, "terrible": 0, "excellent": 76}, "aka": "Palazzo Di Pietro Chania", "slim_ranking": 0.196581196581}