{"user_rating": 3.5, "review_count": 200, "name": "Pala Mesa Resort", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "Unless you want to Golf, don't bother with this one.", "title": "Very Average", "helpfulness": 3, "user": "jod2la", "date": "August 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3796918}, {"rating": 3.0, "title": "Not what we were looking for", "text": "The Rooms were old and musty. No Character and you feel very isolated from everything.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 30, 2005", "id": 3511597}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "If your looking for a fun, happening hotel- this is NOT the place to be.", "title": "Secluded and graceful", "helpfulness": 6, "user": "cazzina", "date": "January 4, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 2976109}, {"rating": 5.0, "title": "Finished with Renovations!", "text": "The wait for breakfast was 20 mins because they did'nt have adequate service. The pool was isolated and the only refreshment served was a Pepsi machine in the corner. Nuff said!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 30, 2004", "id": 2965430}, {"rating": 5.0, "title": "Blissful", "text": "My husband and I stayed for the Memorial Day weekend, or we were planning to, anyway. We checked in Sunday around 5pm and ended up leaving the next morning. The grounds are beautiful, including the front reception area where Aquaterra is. The stay wasn't horrible, but for $200/night and 3.5 stars, we expected more. The television had an annoying buzzing noise to it for the first 15-20 minutes it was on, the bathroom tub didn't drain very well, and when we ordered room service we were missing ketchup, so we had to call room service again and wait ten minutes for it to be delivered. By then our food was cold. We ate at Aquaterra for dinner. The restaurant has a nice atmosphere, and several tables have excellent views of the golf course. The service was good but the food was somewhat blah.", "helpfulness": 4, "user": "Koda", "date": "May 11, 2004", "id": 1931812}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We arrived at night and the road up to our room was so dark that we missed it initially. The property itself appeared nice. I can't comment on any of the resort amenities since my wife and I only stayed there one night prior to a timeshare presentation in SD. The only thing I can comment on is the room itself.", "title": "Decent One Night Stay", "user": "Austher", "date": "June 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16887577, "likes": {"liked": "— Spacious and Quiet Room", "disliked": "— Bedding was dirty"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "They gave us a discounted rate, which I believe was around $100. One thing I can say is that the look and ambiance of the outside is much nicer than the inside of your room. For some reason, they gave us a room with two beds, even though we asked for a single bed. The pros: the room itself was spacious and the bathroom seemed clean and I liked the water pressure of the shower. It was also very quiet, which was nice after a long night of driving. Con: One thing I didn't like was that the bedding was NOT clean. In fact, there were some visible stains/streaks on the comforter. Needless to say, we decided to sleep on the OTHER bed. And you couldn't help but think the carpet wasn't that much cleaner.", "title": "Very rustic hotel", "helpfulness": 3, "user": "SUgirl", "date": "May 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 16499152, "likes": {"liked": "— View from the restaurant", "disliked": "— Hotel room and location"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Overall, it was a decent place to stay...there were both positives and negatives, none of which would convince me to recommend a stay here or tell someone to avoid this place.", "title": "Loved The Resort", "helpfulness": 2, "user": "2ChildrenOfTheWorld", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15274977}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We checked into this hotel over Memorial Day weekend for a wedding that was on the grounds. The hotel did not look like it was portrayed on the pictures on the website. It did not have the feel of a 4 star resort. Our room was spacious but very outdated. It also was very damp and there was mold along the bottom of the sheer curtain. It really felt like we were in a cabin. The food was decent in the hotel (the only choice unless you wanted to drive to Temecula).", "title": "Pleasant stay, okay value", "helpfulness": 2, "user": "no3putt", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14499618}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We held a four-day corporate meeting at Pala Mesa Resort for 130 people. The staff was wonderful – everyone from the Catering Manager, to the Banquet Manager, to the wait staff, and the concierge…..it was five-star service! They all went out of their way to accommodate the group and our needs -- any request we had was quickly and efficiently fulfilled. I had read a poster’s previous comment about bedbugs, and it concerned me, but there was no evidence of any bugs in any room. The hotel rooms -- we had every room in the resort -- were all very clean and bug-free. The food was great, the setting was perfect and everyone enjoyed playing the golf course. The company executives were so pleased, we have already booked next year’s meeting at Pala Mesa Resort!", "title": "Dissapointing. Not Worth The Price, But Hotel Restaurant EXCELLENT", "helpfulness": 3, "user": "drnkwine1", "date": "February 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 13176137, "likes": {"liked": "— The Restaurant Aquaterra", "disliked": "— The Room - was not relaxing, did not feel welcoming"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We arrived Thursday October 18th as part of a large wedding party. When we booked the hotel 6 months prior we mentioned that we were with the wedding party, as to get a discount and to be close to the others who would be attending. When we arrived, the lady at the front counter looked at us like we were crazy. She had no idea what wedding we were talking about and could not guarantee us a room near each other. Before we arrived, we checked out the hotel website and discovered at Thursday night rates were much cheaper then what we were quoted. When we brought this to their attention, they did nothing. After asking if we could pay more to be near our other family members, they told us no, that no more rooms were available. We said fine and went to our rooms. What a disapointment. It was dark and didn't look very clean. We went to the bride's room, who had a nice patio and was much larger and she was paying the same as us. But she also had to be moved, as her screen door was ripped and her hot water heater was leaking. When elvauating out room, we noticed that not only did they have the most uncomfortable bed around, there were very few towels, which were not soft but a light in the bathroom was out.", "title": "I wasn't impressed", "helpfulness": 4, "user": "sandeigotrip", "date": "October 23, 2007", "detail_rating": {"front_desk": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 10260121, "likes": {"liked": "— That my family was there", "disliked": "— Everything, the food!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We had a very lovely dinner Thursday night and the concegie gave us great direction to a winery. Friday morning breakfast was slow, cold and not good. Our bed was made, sheets were not changed and no toliteries were filled. Friday night was the rehearsal dinner, we had a cocktail hour before hand. The staff at the resturant was dumbfounded when we asked where the party was. We had to move our own tables together and wait patiently for drinks. Then we heard dinner would be an hour late due to the hotel. So we waited even longer. By the time we were allowed at the dinner the food was cold and bad at that. Buffet style and cold. We returned to our uncomfortable bed. Saturday was the day of the wedding. I'm not sure if the wedding planner was part of the hotel staff or not, but she was worthless. She had no idea of our questions and no direction for the wedding party. The scenery was beautiful! The food was yet again, COLD. Saturday night our room keys stopped working, we called and John (who will help with everything and made our stay pleasant) came up, let us in our room and ran down to get us two more keys. Checking out was difficult as well, they charged us for 5 movies we never watched.", "title": "B-E-A-UTIFUL!", "helpfulness": 1, "user": "NistiQ", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8373607}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I will not stay here again, the pool was small and boring. The hot tub looked dirty. For the price of a basic room while others got a suite with a patio for the same price, I was not impressed.", "title": "Watch out for the bedbugs!", "helpfulness": 2, "user": "KMelrose", "date": "July 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8061611, "likes": {"liked": "— The grounds were beautiful", "disliked": "— The bed bugs"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "It was suppose to be an easy going weekend but instead it was full of problems.", "title": "Beautiful grounds", "helpfulness": 2, "user": "rhorbacker", "date": "May 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7489641, "likes": {"liked": "— Location, quiet, peaceful."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This resort is wonderful! Highly recommended for those of you who love golf! The restaurant was superb with many different choices. Great outside patio dining. The rooms were VERY nice and up to par. In regards to the bed bug comment left by another TripAdvisor member....there were no bugs in site of our rooms! Our group had 7 total, and none of us had a problem with bugs!", "title": "awesome service!", "helpfulness": 2, "user": "BrokenDays", "date": "February 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6765584, "likes": {"liked": "— The scenery", "disliked": "— i'm not particularly interested in golf"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We were there on our honeymoon and our room was beautiful. It did smell a little musty and there wasn't much to do if you don't golf. The restaurant had great food, but overpriced. We had originally planned 2 nights there, but only stayed 1. It's really far from anything to do off property.", "title": "Just OK", "helpfulness": 1, "user": "justmarried1", "date": "October 19, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 5972888, "likes": {"liked": "— mountain view", "disliked": "— nothing to do"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I haven't been to the fallbrook area in years, so it was great to have staff willing to share the cool things to do in the area. My wife and I stayed two nites, and I wish it could have been a week! We played a round of golf, and was sorry that the gps didn't work, but after playing all the years I've played, we had a great round. Course was in primo shape, staff at the pro shop was super, charge the beers to your room- no problem-that was hassle free thruout. Food was outstanding- and the staff didn't make us feel like we had to hurry and leave (even tho we should have) it was past 11 pm. Just respect the wait staff and give a good tip! They are worth every dime! Check out was easy, and we can't wait to go back!! Now that we are back in Sedona, the only thing I don't miss is the Smog!!!", "title": "wonderful Staff", "helpfulness": 3, "user": "buzzardonwheels", "date": "August 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5702761, "likes": {"liked": "— the Staff", "disliked": "— the smog"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "My husband and I stayed here only one night, and we were glad that was all we planned. We checked in and the people at the front desk were friendly. The restaurant food and service were good but overpriced. Nice view of the golf course from the dining area. The grounds looked well maintained, but unfortunately, that did not carry over to the room.", "title": "Not worth the price!", "helpfulness": 7, "user": "pchampion25", "date": "July 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 5444456}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The room was so musty and moldy smelling we had to air it out for 5 hours before we could close the sliding door to sleep since there was a wedding party in the suite next door. At least it had a high ceiling so it wasn't too stuffy after airing it out. The room had a small balcony which was ok, but the view was obscured by the trees. The decor in the room was outdated, it probably hadn't been redecorated since the late 70's. One review said they could hear the freeway from the buildings, but all the buildings were next to each other and we couldn't hear the road at all.", "title": "Rustic & Charming", "helpfulness": 5, "user": "Ashleezmom", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5362272}, {"rating": 4.0, "title": "Nice weekend getaway/golfers", "text": "The worst part of the stay was that both my husband and I woke up aching from the terrible beds. He was going to play golf, but was too sore and tired to do so after the lack of sleep. Every time either of us moved on the bed, the other woke up or practically bounced off the bed. Aside from that, the room was relatively clean, though they needed to run an air cleaner in the room badly.", "helpfulness": 8, "user": "redheadedangel41", "date": "April 14, 2006", "id": 4974074}], "location": {"country": "United States", "city": "Fallbrook"}, "stars": 3.5, "variance": {"poor": 21, "average": 25, "very good": 52, "terrible": 23, "excellent": 79}, "aka": "Pala Mesa Hotel Fallbrook", "slim_ranking": 0.166666666667}