{"user_rating": 4.5, "review_count": 372, "name": "Palazzo Guardi", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I travelled to Italy for 2 weeks, and Venice was the first city we visited. This small hotel was a pretty good find for the price (other hotels were very expensive in Venice, and I think we paid 190 Euros for a quadruple room). Though the property was old, the bathroom was renovated and the beds were comfortable. There was also lots of drawers and closet space for us to unpack our things. The breakfast was simple, and we usually just had fruit, yogurt, coffee, and croissants. Also, the hotel staff were very nice and helpful. I would definitely stay here again if I ever visit Venice again", "title": "Adequate stay, great location", "user": "ZKDDS", "date": "June 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7848952, "likes": {"liked": "— location", "disliked": "— rooms were a little dusty and i have allergies!"}}, {"rating": 5.0, "title": "Charming stay at Venice's Palazzo Guardi", "text": "We first learned about the Pallazzo Guardi through a review on the website Cruise Critic.com. I next read the reviews on Trip Advisor and then contacted the Pallazzo Guardi directly to make reservations for a one night stay prior to our Mediterranean cruise leaving from Venice in May 2007.", "helpfulness": 1, "user": "lambs2", "date": "June 12, 2007", "id": 7841339}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel emailed us excellent directions that were very easy to follow. We arrived in the morning at Marco Polo airport. After getting our euros at an ATM in the airport we purchased tickets for the Blue ACTV bus to Piazzale Roma and then found the 51 Vaporetta to the Zattere landing. Followed the directions the hotel gave us: Turn your back on the landing jetty, go left, and just before the little Ponte Longo bridge turn right onto Fundamenta Nanni for approx. 100 meters.", "title": "Palazzo Guardi - plus brief trip report", "helpfulness": 4, "user": "UKJosie", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7292189, "likes": {"liked": "— location", "disliked": "— Breakfast could get boring after a few days."}}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 25, "very good": 117, "terrible": 7, "excellent": 211}, "aka": "Palazzo Guardi Hotel Venice", "slim_ranking": 0.190243902439, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}