{"user_rating": 4.0, "review_count": 65, "name": "Palliser Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Kicking Horse Palliser Lodge on July 23, 2013. We noiticed this lodge on the internet, when searching for a place to stay on our trip to BC. They had a special rate on a \"guest\" room, so we decided to book there. We have never stayed at a ski resort before, so being off season, we thought we'd try it out. We had been driving most of the day, and it was getting to be after supper, when I realized on our reservation, it said that check-in was up to 6:00 and after that to call a phone #. I did that, and a cheery man answered and said not to worry, as he'd be there until 10:00, and to come to the Glacier Lodge to check in. We didn't know where the Glacier Lodge was on the property, so we drove around. We first found the Pallser where our room was. We stopped there, and walked in. It was dark, no one at the desk and no one around anywhere. Not the reception we are used to and it felt different, We knew we had to find the Glacier Lodge, but thought we'd take a look at the building we were going to stay at, and thought maybe there might be a map of the facilities there, but didn't see one. Then we drove further, after passing another building \"Mountaineer\", we came across the Glacier Lodge. My suggestion to the resort is to put up some signs pointing to each building so people like us, who drive in for the first time, know where to go. Another sign saying \"register at the Glacier Lodge\" or something would help. The man at reception at the Glacier was very friendly and gave us all info we needed to find our room. They do have a couple restaurants there, but since we were checking in late, only the saloon was open, until 10:00. We drove back to the Palliser, where they have underground parking which was nice, and would be great for a winter stay. Our room was nice and clean, with a king size bed, kichinette and balcony, We did notice that the sliding door to the balcony didn't lock, but we were on the the third floor, so didn't think of it as a problem. We then went to the saloon to eat, which was really nice. The waiter was great and attentive. Our stay in the room was comfortable, and it was really quiet there. In the morning we dropped off the key back at the Glacier Lodge, then drove around to see the new homes being built there, take some pics of the beautiful views of the mountains, and headed back down into Golden.", "title": "Beautiful Views, but note, it is 14km out of town", "helpfulness": 4, "user": "cherSK_Canada", "date": "July 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169290932}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We went to check into the Pallister Lodge after travelling for most of the day and just wanted to get into our room and shower and chill-out.... And what a carry-on trying to get the keys for our room and after several phone-calls to some mystery man we managed to get our keys from the reception in a near by hotel that was also totally devoid of any staff....", "title": "Could have been so much better.", "helpfulness": 7, "user": "Jimmy R", "date": "July 5, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166418634}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We had three nights stay there and in all that time saw no members of staff at all and also one night when we were out on our balcony my friend helped six other new arrivals to find their keys as everyone seem to be suffering the same scenario as we did.", "title": "Unbelievable!!!", "helpfulness": 6, "user": "Cindy D", "date": "July 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 166354418}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I know this is the off-season for the Lodge but i'd have thought if you take bookings and the money off people you should as least provide a service for them, so why don't they just send you with your booking confirmation a list of instructions explaining that the chances are you'll see no staff at the reception and what to do in the circumstances.... Simple as......", "title": "Spring Skiing", "helpfulness": 1, "user": "Fit4Life80", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156377924}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "But after saying that the rooms were clean and comfortable and the views from our balcony were simply stunning at anytime of the day and night.", "title": "Nice suite. Bad service.", "user": "t c", "date": "March 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 155639582}, {"rating": 5.0, "title": "2nd visit was as nice", "text": "This was my 2nd visit and my wife's 1st. We stayed on the 4th floor in room 404 facing the ski hill. The biggest attraction to us was the private hot tub. The location was quiet at night which suited us just fine. The rooms were just the right side and the beds felt more comfortable than my first visit. Like many other reviews have mentioned, the tv's could use an upgrade, it would make the units look more modern and enable them to get more space by removing the tv stand in the living room. We ate breakfast and lunch in our room and ate supper out. We would stay here again, although my wife was not a fan of how icy it was trying to ski in and walk out of the entrance/exit. The free wifi was great so we could Skype the kids every day!", "user": "dickbob", "date": "March 9, 2013", "id": 154103419}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Good bedding, OK bathrooms, OK kitchen, OK laundry, great ski in-out access, quiet location (but one night we had some rowdy neighbours). As others have noted, in-lodge reception would have been more convenient.", "title": "Not cheap but worthy accomodation", "helpfulness": 1, "user": "therudies86", "date": "February 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153351825}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The accommodation at Palliser Lodge is excellent - huge rooms with a large, fully equipped kitchen. As there were three of us we opted for a two bedroom apartment with a private hot tub, which was well worth the extra money. The ski-in, ski-out is a great facility.", "title": "Improved greatly since 2012 but bring back the ski shuttle!", "helpfulness": 1, "user": "AitchHW", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152769810}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Despite all the information stating that the rooms are only cleaned every fourth day (unless you pay a surcharge), housekeeping staff came daily and were happy to restock toiletries and coffee/tea etc.", "title": "Dog feces spoiled the stay", "user": "Cucgirl", "date": "February 16, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 152233267}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "There is still no reception desk at Palliser but the reception staff (especially Crista) at Glacier Lodge are now excellent, which was not the case a year ago.", "title": "New Years ski trip", "user": "MMonfette", "date": "January 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149217445}, {"rating": 5.0, "title": "Great Overall", "text": "Enjoyed a great four night holiday at palliser this past week. Room was spotless and well equipped. Kicking Horse is a beautiful resort and I highly recommend it for all who are looking for some great skiing at a reasonable price.", "user": "Ken P", "date": "March 23, 2013", "id": 155461079}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We booked one bedroom condo at Palliser Lodge for 8 nights. After spending 2 nights in it we inquired about upgrading to two bedroom with the private hot tub. We were able to move the same day for 5 nights and advised that we had to be back at our original condo for the remaining night. Everything seemed to be \"locking in\", we moved the rooms quickly, enjoyed our hot tub, only to find out the next day that it was broken!! We were told we have an option to move again and as much as it was inconvenient having to pack our luggage, we did it! We were assured that our new condo will be on the same floor as the original one bedroom, so we wouldn't have to use the elevator! The day before our departure my husband walked over to the reception at Glacier Lodge ( no reception at Palliser) to pick up the key to our original one bedroom condo so we could move, again!!! The speed of the reception employees and the way they operate the computer is worse then of a snail! After waiting for at least 15 min, he was told that our original condo is no longer available and we have to move to a different floor! After hearing the news I picked up the phone and demanded what we were promised and finally we were offered a condo on the same floor. I couldn't understand why we had to go through all this...calling back an forth, wasting our time? Unfortunately we were not offered any explanation.", "title": "Very disappointing......", "user": "Andy S", "date": "March 21, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155252202}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We've been on many ski trips before, travelled all over the world to find the best ski conditions and accommodation. We've done extensive research and Kicking Horse was highly recommended by our friends. Unfortunately this was by far the worst trip we've ever been on! The mountains and skiing were nice, but the experience at the lodge will prevent us from ever coming back! To top it all up, we were \"accidentally\" overcharged for our stay!!! We had received our credit card statement with additional charges even though our final receipt showed", "title": "Girls Weekend", "user": "Susan M", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155062892}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "the remaining balance as zero!! We were told the rates for the room had changed!? I would have been nice to notify the guests of any changes before their departure!!", "title": "Comfortable but a few annoyances", "user": "Joolery", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154580186}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Overall, its a nice lodge, but it lacks of customer service and satisfaction! Poor management!", "title": "Good, but not perfect", "user": "Hans1989", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 154289249}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Went to Palliser lodge at Kicking Horse ski resort in Golden B.C. for Xmas ski trip with 2 other families. The accomodations were excellent. Resort is in great condition and each unit has a private hot tub on the balconies and units are equipped with all the amenities required ie. stove, fridge, granite counter tops, tv and seperate dvd player, washer and dryer.", "title": "Top of the world", "helpfulness": 1, "user": "mmousseau", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148726765}, {"rating": 5.0, "title": "Quick Trip", "text": "The lodge is minutes from the main ski lodge and you can ski out from the base of Palliser lodge. The lodge also has a seperate storage and locker area which can be accesed through with your room key.", "user": "c_271_myers", "date": "November 12, 2012", "id": 145237859}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Palliser was a perfect place to stop while we were travelling back from the west coast. We had a fully furnished unit that had a kitchen and laundry facilities. The staff where very professional and helpful and very quick to respond when we requested an extra blanket. Overall it was a very nice stay.", "title": "Awesome Vacation", "helpfulness": 1, "user": "Amanda H", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137220816}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "First time in Golden and I think we found our destination of choice. Very nice one bedroom with hot tub and patio area. A friend of mine has been here in in the winter and said we should check it out. The guest services was very nice and extremely helpful. The area is gorgeous and there is plenty to see and do around the. Palliser is a great central place to base yourself out of if making day trips around the area, which we did. I can't believe how during the day it can get up to 30 degrees and a few hours later after the sun sets it goes down to like 10 degrees. After reading reviews about no air conditioning I was sceptic but the \"tips\" are right; get a place facing the valley and you will be more than fine. Plus, we're from Ontario and we have humidity, so this is nothing when it comes to the heat (which is great).", "title": "Picture Perfect", "user": "Eliane B", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136524584}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "-Great Staff", "title": "The palliser was not even close to the place shown in the website", "helpfulness": 1, "user": "Laila2012_12", "date": "August 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 136436632}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 11, "average": 6, "very good": 17, "terrible": 4, "excellent": 27}, "aka": "Palliser Hotel Golden", "slim_ranking": 0.53488372093, "description": "Opened in 2006, the Palliser Lodge is well situated in one of the area’s premier locations, boasting spectacular views of the Rocky Mountains and ski slope activities. The Lodge, just walking distance to the Gondola base at Kicking Horse Mountain, ensures quiet enjoyment while maintaining the convenience of ski-in/ski-out access to the mountain. Other features include: private hot tubs, full kitchens, exercise room and underground parking."}