{"user_rating": 4.5, "review_count": 2392, "name": "Palomar Washington DC, a Kimpton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My wife and I frequently travel to Washington on business. We decided to travel as tourists this trip. We decided to stay at the Palomar because of price, amenities (we booked a spa suite) and location. It definitely is a modern/trendy type of hotel. The staff was pleasant and accomodating. We had one complaint - after spending most of the day out as tourists, we arrived to a room that had not yet been serviced. We expected that 6 hours of a vacant room during the day would have been sufficient to allow the staff to service the room. A large (and I mean hundreds) of young college students booked the hotel for a \"scholarship dinner.\" They were all very well-mannered, but LOUD. When we called the front desk at 10:30 p.m. asking for advice, the manager promptly booked us a room at another hotel. We were not charged for this night at either hotel. Within 20 minutes we were unpacked at another hotel and slept like babies. Overall, I would highly recommend the Palomar and would stay there on both business and pleasure.", "title": "Very good hotel and very good service", "user": "ELDerby", "date": "March 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 25405207}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "I was in Washington to visit friends and family over last weekend, and I needed to stay in a hotel in the city for one night. I usually stay in a Starwood or Hilton property for points or a Four Seasons/Ritz Carleton type property for a luxurious experience. Since I was only going to be there for a night, and I needed to be convenient to frieinds in Alexandria and in College Park, I ended up at the Hotel Palomar. I found it on expedia.com and had never heard of it or the chain before, but I had heard good things previously about the Kimpton chain. What good fortune that expedia search turned out to be.", "title": "Hotel with great service, nice decor, great location--a winner!", "helpfulness": 1, "user": "Tar Heel Bill 92", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25352535}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "For just $139, I had a deluxe room with a king bed. The room was quite sizeable, and the decor reminded me of a more plush W type hotel. Very chic, modern decor, but not nearly as minimalist as a W can sometimes be. I found the room very comfortable and stylish.", "title": "Great location and clean/large rooms", "user": "mnytalks1", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25339309}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "The hotel was extremely well-located, just a block or 2 above Dupont Circle, and about that distance from a the Dupont Metro station.", "title": "Great Location, would stay again", "user": "CityGirl69", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25241032}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Service was impeccable for such a short stay. Room service was delivered to me after my check-in within about 20 minutes. They had forgotten my dessert, but brought it to me in about 10 minutes free of charge and with sincere apologies. Directions and suggestions for restaurants were given with enthusiasm and a sincere desire to make my stay pleasant and easy. Not bad for a single night guest.", "title": "Great Value and Location", "user": "Island_Gen", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25102035}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I travel to DC frequently and can comfortably say that the Hotel Palomar is tops in the city. It's worth spending a bit more to reserve one of the larger rooms. The additional square footage is a bargain for the price and nets an unusually large room for the DC area. All of the staff with whom we interacted were exceptionally friendly, helpful, and accommodating. The wine hour and morning coffee service are fabulous perks. And the Palomar's location can't be beat. It's an easy stroll to the Dupont Circle Metro station, and numerous restaurants and shops surround the area. The bed was comfortable. Pillows weren't so great (seemed to be in need of replacement). Room was meticulously cleaned each day. My only complaint was the hallway noise and thinnish walls separating us from the next room. I had requested a \"quiet room,\" so we were at the very end of the hall, which definitely minimized the noise. I had to relocate to another hotel for the business portion of my trip, and it has been a very difficult transition after my great stay at the Palomar.", "title": "Best in DC", "helpfulness": 1, "user": "Muriel12", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 79418387}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I had a fantastic experience at Hotel Palomar. The desk staff recognized me as a Kimpton Insider member, and upgraded me to a larger room. Additionally, they remembered to deliver my NY Times in the morning (an essential!), and the daily wine reception in the lobby took the edge off of my business day. The room was huge, the beds were super comfy, and the amenities were great. I wish I had had time to swim in the pool - it was lovely, too!", "title": "Wonderful staff went the extra mile at Hotel Palomar", "user": "JP1012", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79409398}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "After checkout, I realized that I forgot a camera and book in the room. The security staff promptly shipped my things back to me, and when they were bounced back to the hotel (no doorman at my apartment), they diligently followed up multiple times to ensure that they could reship to another address.", "title": "Not the best, but okay for the price", "user": "nycbaby64", "date": "September 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 79392786}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "My boyfriend and I stayed here using a package we purchased on Jetsetter. Our experience was positive in some ways and negative in others. For the price, it wasn't that bad, but I will not be staying there again.", "title": "Great 8-night stay at the Palomar...", "helpfulness": 1, "user": "BeATraveler", "date": "September 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 79276139}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The Good:", "title": "I'd go back again, again and again", "user": "phillm", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79239174}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The Hotel Palomar is my favourite place to stay in DC. I have stayed there many times for work and have always been very satisfied with the service, design and comfort of the rooms.", "title": "Chic Dupont Circle Hotel", "helpfulness": 1, "user": "salbolt", "date": "January 28, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23987111, "likes": {"liked": "— Chic design and good service", "disliked": "— No views"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The Palomar is chic in an imitation W Hotel-style way, but pulls it off better than most of the Kimpton hotels manage to do.", "title": "Great experience", "user": "kbmBoston", "date": "January 25, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23900211}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The last time I stayed there I had a group booking for 13, and all of my guests were very impressed by the hotel. Additionally, I was upgraded to a suite which was a nice surprise, although I had far too much space in the suite all by myself and didn't know what to do with it all!", "title": "Excellent service and excellent facilities at an excellent rate!", "helpfulness": 2, "user": "KiwiBex1", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23787872, "likes": {"liked": "— Brilliant service & large room", "disliked": "— Small Breakfasts"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel is very well located, close to the Dupont Circle metro station, and with lots of cafes and restaurants nearby. The evening wine hour is a nice touch, although most nights I miss it as I don't get back to the hotel until after 6.00pm. I wish it ran to 7.00pm!", "title": "Stylish and beautiful, beyond expectations!", "user": "tmd9015", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23758004, "likes": {"liked": "— The attention to detail", "disliked": "— the vessel sinks, dark entryway"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "Everything about our stay here was great. What a huge room for a city. Four of us stayed in this two bed room without ever feeling cramped. The staff was very accommodating and the coffee each morning and wine reception each evening was a nice bonus. Little to no noise from room to room. Nice tv with a dvd player which was a nice bonus for a girls weekend with a three night stay. Would stay here again.", "title": "Very comfortable, great location, excellent customer service", "user": "MSRose", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23383329, "likes": {"liked": "— Comfortable room and bed", "disliked": "— No coffee maker in the room"}}, {"rating": 5.0, "title": "Very nicely appointed rooms, and very friendly staff", "text": "This hotel is in a very good location. It doesn't look very impressive from the outside, but the rooms are very nice, as is the lobby area. The staff was also very friendly.", "user": "hoos90", "date": "November 5, 2012", "id": 144609798}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The rooms are very well appointed, with lights that dim throughout, a very nice bathroom, and comfortable furniture.", "title": "Get a bang for your buck!", "user": "PamHGolden_Colorado", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144589104}, {"rating": 3.0, "title": "Good hotel, good location, not quite \"luxury\" though", "text": "We stayed at the Palomar Hotel for 8 nights. I was to run the Marine Corps Marathon and we would sight see for the remaining week. The hurricane put a little damper into our plans, but nothing the Palomar Hotel could not easily erase any discomfort! Wine hour from 5-6 is delightful. We had an opporunity to meet other folks who ran the marathon and some who were stranded by the closings of the mass transit system. Everyone at the hotel was helpful. The staff was outstanding. For the price, this is the place to stay! Our room was very quiet and, on the seventh floor, my only concern to dog allergy sufferers, is that my allergies acted up on the elevator, so I took the stairs, no problem for me since I like to walk stairs whenever possible.", "user": "A TripAdvisor user", "date": "November 5, 2012", "id": 144581586}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The Palomar is a comfortable hotel in Dupont Circle and well worth staying at, especially if you get a discounted rate like we did through an online site like Snique Away which is a TripAdvisor company. My only complaint is their positioning of themselves as a \"luxury\" property which they are not. They offer a couple of nice touches, like thick animal print bathrobes and a free wine hour from 5-6pm each day, but they also do pretentious things like calling their fitness center a \"sculpting room\" and their lobby area (where the wine is served) a \"library\" which it isn't. When I think of luxury properties I think Four Seasons or Waldorf Astoria. The Palomar is more like the high end of the Marriott/Hyatt/Hilton range of properties instead. Perfectly nice as long as you know what you are getting but falls short if you are looking for true luxury.", "title": "Lovely larger boutique hotel", "user": "drdennis2", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144572089}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Recently, my partner and I spent a lovely weekend in Washington DC, just prior to Hurricane Sandy. We stayed at the Palomar DC and from beginning to end the stay was very nice. We were given an executive king on check-in which was spacious and quiet located on the back side of the hotel. No specific view, but very quiet, which is important to me. Since we were at the end of the corridor, there was little outside room traffic. The room was spacious, clean, light with a very comfortable bed.", "title": "Excellent hotel", "user": "Ellen P", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144569101}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed for 4 days in late August and were pleasantly surprised by what a great place it was to stay with kids. We had a room with two queens and had ample room. I had asked in advance for a mini-fridge and one was available upon arrival. No need to remind the hotel staff, which was nice. Generally, the service was great from the bellmen at the door to the front desk to the cleaning staff.", "title": "Great Place to Stay with Kids", "user": "notacamper39", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78250946}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Our kids, ages 7 and 4, really enjoyed the hotel as well. They liked the pool, and were always excited to come back and enjoy free lemonade in the lobby in the afternoon. We,on the other hand, really enjoyed the free wine reception each evening.", "title": "Fab Time!!!", "user": "Oxfordians_13", "date": "September 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78230200}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The location was excellent. Close to the metro and many great restaurants.", "title": "The Best Pet Friendly Hotel in Washington!!", "user": "Pat0405", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78136317}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Also, I noted a few posts on Tripadvisor complaining about noise. We had no problems at all (though perhaps being at the end of the hall helped).", "title": "Recipe for hotel success. Something for everybody!", "user": "ANZOTraveller", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77918164}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If I could find anything to critique it would be the bathrooms. While they were very nicely done and always clean, they were a bit small. The addition of a few hooks (to hang used towels) would be a welcome addition.", "title": "The little things make a difference", "helpfulness": 1, "user": "NHSteve411", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77761826}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I agree with much of what is written in the most recent reviews of the Palomar. It is one of the few hotels I can imagine that suit business and leisure travelers equally well. It does not feel overly corporate -- a huge plus in my book. Service is outstanding all around. Manager's receptions are a great idea: far better to have coffee service in the lobby than to service individual coffee makers in all of the rooms, for economic and psychological reasons (it just feels nice).", "title": "Really one of the better hotel stays I have had", "user": "DiMe2", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78640902}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The staff at this Hotel is top of the line. I have stayed at some of the top Hotels in the world and I have never received any better service than at the Hotel Palomar in Washington DC.", "title": "The Hotel Palomar was absolutely wonderful to me and my family !!!", "user": "texasderek", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78627213}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "While you're there look up Abe Liao, the Front Office Manager... He is just Great !!!", "title": "Simply Stellar....", "user": "mimi0352", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78585138}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Also... Nabil the Bellman is an excellent source of information and can get you an excellent tour of the city.", "title": "Can't rate the service high enough!", "user": "luvstojeep", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78410760}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "After a very surprisingly frustrating month dealing with the Kimpton reservation line, all was redeemed when I arrived at the Palomar. Initially, I thought my saga was not over, as I had arrived at the wrong Hotel Palomar. Fortunately for me, Edgar was at the front desk. After assessing my preferences, he called the Hotel Palomar Arlington and arranged for us to shift our reservation and settle in directly. Edgar was just amazing, exemplifying stellar service and raising the star of the Kimpton brand.", "title": "Great Value and Location", "user": "freqtraveller50", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78359003}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed at the Hotel Palomar for 3 nights. I booked an Executive King room directly through the hotel's website.", "title": "Disappointing Executive King", "helpfulness": 1, "user": "timer13", "date": "January 6, 2009", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 23319921, "likes": {"liked": "— Location", "disliked": "— Tiny window"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Pros: Enjoyed the location and proximity to the Metro. The evening reception is nice. Plenty of wine and people seemed to mingle. The room was large.", "title": "Very very good", "helpfulness": 1, "user": "SueSt", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23262451, "likes": {"liked": "— location", "disliked": "— room was small, though comfortable"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Cons: Tiny window hidden behind a column meant that you could not see the window from either the bed or the sitting area. This made the room feel like a very large, very dark closet. Room was above an alley that was full of beeping service trucks in the middle of the night. Front desk staff seemed fairly unhappy, bordering on unfriendly.", "title": "Palomar good for the price", "helpfulness": 1, "user": "dcnanners", "date": "January 4, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 23253351, "likes": {"liked": "— Happy hour", "disliked": "— Dark"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "My unhappiness with the hotel is almost entirely due to the room. I think if I had been in a room on the street-side of the hotel I'd probably give it at least 4 stars.", "title": "Great Experience!", "helpfulness": 1, "user": "Kristeachs", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23214246, "likes": {"liked": "— Cean and friendliness of employess", "disliked": "— Pet noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Based on the reviews, my husband and I stayed for 2 nights over New Years Eve. Very small but comfortable room. I was concerned that it might be a noisy given that it was New Years Eve, but was pleasantly surprised that the noise was kept to a minimum. Staff was very warm and helpful.... and aside from delays trying to retrieve our car from the valets (again, it was New Years and very busy), we were very pleased.", "title": "Fantastic hotel", "user": "JKDC", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23181474, "likes": {"liked": "— location", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I'm a bit torn between a 3 and a 4 on this stay. Nothing was particularly bad, so I'll give them the benefit of the doubt and bump it to 4.", "title": "Pretty good stay", "user": "Mark H", "date": "November 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145025144}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Usually we stay at the Willard in DC, but recently becoming IC with InTouch I thought we'd give Kimpton a try in DC. After this stay I was missing the Willard.", "title": "Great place to stay", "user": "CGO11", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144979204}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When we arrived, the valet was quick to show up, offer to help with our bags and give us the valet tag. Check in was also pretty smooth. I wasn't told about the upgrade we ended up getting or given any mention of my IC status. These are pretty minor things, but just kind of set me up for the stay. I had originally booked a Deluxe Suite and we had been moved up to a Spa Suite.", "title": "Lovely Boutique Hotel in DC", "user": "AdventuresTraveler", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144933620}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The room was roomy and reminded me very much of the similar suite at the Palomar Los Angeles. Perhaps they were designed around the same time. Walking to the room, it was very dark. Not an issue, more just a note. The room itself was well appointed with plenty of seats and lots of room. But, everything was seriously beat up. How old is this hotel and how long ago was the last renovation? From looking at this room, the place is in serious need of at least a quick touch up. One of the sliding doors wouldn't close, and the ones that did slide were very hard to move. A quick application of lubricant could easily solve this problem. The door that could slide to cover up the window into the bathroom was actually missing a part of the wood covering the railing. It was sitting on top of the railing. Did no one notice this while cleaning the room? It didn't bother me much, but just really shows a lack of effort. The paint around the doors was bubbling and peeling at spots. The drapes to cover the bedroom window were not long enough to cover the whole window. So, what was done? There was a piece of double sided tape to hold it on the wall. It just seems very lazy not to fix these things. In one afternoon this entire room could be fixed up almost like new again.", "title": "Excellent hotel", "user": "2AussieTravellers104", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144912068}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "In the room we had our normal IC amenities. They were actually pretty good and exactly what we'd like. Only odd part was the note. It had my name on it and a place for the author to sign it, but no one signed it. Again, just seems a bit absentminded. The odd part though, was the housekeeper took our remaining pretzels away on the second day. They were still good and more than half were left!", "title": "Spacious rooms, brilliant front desk/concierge service, near metro", "user": "smartiq", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144911378}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I stayed at the Hotel Palomar for two nights in Feb 2009. We wanted to stay in Dupont Circle and the Hotel Palomar was a great choice! After using AAA discount it was $125/night. Parking (valet only) was $34 dollars a day which seemed about average after pricing other hotels in the area. The rooms were wonderful as well - very clean and a decent size - the bedding was also very nice. There are plenty of places to eat near by and the hotel even has a restaurant attached - but was very crowded both nights. The metro was 2-3 blocks from the hotel and very easy to use. Overall we were very pleased with our experience at the Hotel Palomar. The staff was very friendly and helpful - thanks Ben!!!!", "title": "Great location, great rooms, great price for Dupont Circle!", "user": "clttravel11", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25056396}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I (in our mid-30s) decided to do a one-night local \"getaway\" and dropped our baby off at the grandparents. It was very exciting to be having some freedom for the first time since she was born almost 8 months ago. This hotel was perfect for that. It was modern and chic and in a fun area with great restaurants and lovely buildings. We were in a queen deluxe and it was huge and very nicely decorated. We got a great deal with AAA. I loved the light and fluffy comforter and the very soft and textured carpeting. We had a fantastic time overall and took a cab to Adams Morgan for dinner.", "title": "Great hotel and helpful tips...", "user": "JuneBride", "date": "February 16, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 24639286, "likes": {"liked": "— The size, decor and comfort of the room and location of the hotel", "disliked": "— the noise level from neighbors"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Here's my complaint. We were on the 7th floor. Room 726. It has double-layered connecting doors on both sides of the room to other rooms. We could hear entire conversations word for word and our neighbors were very inconsiderately loud, early in the morning. The doors also slam automatically and that was happening a lot throughout the morning up and down the hallway.", "title": "What a great hotel", "helpfulness": 1, "user": "JPL93", "date": "February 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24635438}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Next time, if I were to stay there again, I would ask if there are rooms without connecting doors because the noise is not blocked very well in those at all. I also forgot my earplugs, which is a must in any hotel.", "title": "My favorite Washington hotel", "helpfulness": 1, "user": "BubblesNC", "date": "February 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24545566, "likes": {"liked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Other than that, it's very chic and luxurious and we felt pampered staying there. Oh, one more thing that really surprised me for a hotel of this caliber. I had asked for a 10am wake up call and 10 am came and went with no call. I had already been up anyway, but at 10:20 am the front desk person called and apologized profusely saying they had gotten very busy. I found it unusual that they didn't have it on an automated system. Maybe it's there way of giving a \"personal touch\", but what if I had a plane to catch? I wasn't really upset, more surprised than anything...", "title": "Def a good choice...", "helpfulness": 1, "user": "Schjumes", "date": "February 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 24067255}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We spent a weekend in this hotel. One of its advantages is that it is a couple of blocks away from Dupont Circle Metro Station. The room is reasonable in size, bathroom is comfortable and noiseless (we stayed at the 10th floor). It has a very nice Reception and direct access to the Urbana restaurant which has a very decent menu and not too overpriced. Very close by to the hotel you can find several restaurants: thai, mexican, italian too. There is a Starbucks nearby. However, one recommendation is to have breakfast at Le Pain Quotidien. It has very interesting and delicious options.", "title": "Great Hotel steps away from Dupont Circle", "helpfulness": 1, "user": "Beto_Rios", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144797268}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed in the Palomar as part of our Honeymoon. The hotel is ideally located, being within walking distances of restaurants and the Metro. All of the staff were very friendly and helpful and we were given a complimentary upgrade. Our room was very spacious and breakfast had a good range of options. The wine reception was very enjoyable with a great atmosphere. We will definitely stay here again.", "title": "Great hotel with great staff", "user": "DrMurphy2012", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144772759}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The staff was very friendly. I thought the fitness facility was nice. I really liked the wine receptionat 5pm!", "title": "a good place to stay in dupont circle", "user": "afellowes4", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 144697424}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location at Dupront Circle is good- not too close to the Circle because it can be loud at night.", "title": "Loved the exercise machine in the room!", "user": "PotterMoose", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144671935}, {"rating": 5.0, "title": "Great hotel, great location", "text": "The restaurant and wine bar called Ubana is very nice and not over priced.", "helpfulness": 1, "user": "HighWycombeMIch", "date": "November 5, 2012", "id": 144645241}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "As is true of all their properties, the Hotel Palomar in Washington DC does not disappoint. The staff are professional and helpful, checking in and out is a breeze, and the rooms are comfy, well appointed, and quiet. The location is ideal -- a 5 minute walk to the metro, 10 minutes to Dupont Circle, and 15-20 minutes to Georgetown -- this is the perfect locale for exploring the city.", "title": "Perfect location, perfect hotel", "user": "worshiguchi", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79038977}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Absolutely loved this place - loved the modern decor, the flat screen tv, the morning coffee, the short walk from the metro and the great restaurants and cafes in the neighhbourhood. I got an amazing $99 hotwire rate for two nights, but by the end of my stay I was desperately trying to rearrange my schedule so I could stay a few more nights, and I would've paid $300 a night happily if I couldve done (the hotel, it turned out, was booked out, and my plans weren't flexible enough).", "title": "Couldn't love it more!", "user": "whatshername", "date": "September 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 78792694}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I especially loved the soaps in the bathroom, the furry bedspread, and the yoga workouts on the in room entertainment (and the helpful chap who delivered a yoga mat to my room). The pool too is a good size.", "title": "Loved the Palomar - Exceptional Hotel", "user": "planthenexttrip", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78685633}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "When can I come back?", "title": "A very good DC alternative", "user": "SANTravelers", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78660767}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A perfect hotel experience. Friendly staff, spacious, clean and well equipped rooms, and perfect location. Evening wine reception was a lovely touch.", "title": "Excellent boutique hotel in a perfect location", "user": "Mitch-n-Greg", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78653899}, {"rating": 4.0, "title": "Overall very good but some small things need fixing", "text": "We stayed for a few nights over Hurricane Sandy and so saw the hotel cope with almost all guests stuck inside for a couple of days. They seemed to deal with matters very efficiently, providing tea and coffee in the lobby all day and the daily wine reception went ahead although I would guess a lot more than usual was consumed!", "user": "RATSOMATIC", "date": "November 18, 2012", "id": 145676102}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It's has a very contemporary feel and we had a deluxe double which was extremely spacious with armchairs, a huge desk etc. Lucky really as we spent much more time cooped up indoors than we anticipated. Given the size of the room and the comfortable furnishings, I felt the bathroom was disappointing. Very small in comparison and the paintwork was marked and a bit shabby. There was no shower gel so had to ask housekeeping for that and they did not automatically provide a shower cap/cotton wool etc. These were available upon request. Also, I don't know if I was having a \"senior\" moment, but the bath plug just didn't seem to keep the water in, so it slowly drained away! However, the huge, soft bathrobes were wonderful!", "title": "Will return", "user": "Cairolass_12", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145576194}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We requested a quiet pet free room and that's what we got. Didn't hear a sound during the night or in the mornings and I'm a light sleeper.", "title": "Swanky, but not intimidating.", "helpfulness": 2, "user": "the_golden4", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145371980}, {"rating": 4.0, "title": "first stay in first palomar", "text": "Excellent location - Dupont Circle is a lively (but not too noisy) eclectic area with lots of eateries. Also few hundred yards from the metro and a 15 min walk to Georgetown and about 20 mins to White House. I'm not sure I would pay the rates being quoted by the hotel booking websites (we paid partly with frequest flyer points) but if you can get a good deal, it's worth staying there.", "helpfulness": 1, "user": "nycmom22", "date": "November 10, 2012", "id": 145120340}, {"rating": 4.0, "title": "Worth the price just for the free happy hour", "text": "Excellent location . Welcoming reception staff organised a lovely room overlooking pool area. The little touches like the wine tasting each evening allowed us to meet other guests and socialise which was a nice idea. Breakfast was wonderful and I only wish we had more than a few days in Washington.", "helpfulness": 1, "user": "ranger937", "date": "November 10, 2012", "id": 145102554}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 4, "variance": {"poor": 55, "average": 150, "very good": 588, "terrible": 14, "excellent": 1585}, "aka": "Kimpton Washington Dc", "slim_ranking": 0.0852713178295, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Timeless sophistication meets contemporary style at the Hotel Palomar Washington DC. This luxury boutique hotel provides flawless service and exquisite amenities in engagingly innovative surroundings. Located within Washington’s historic Dupont Circle, this Kimpton Hotel and its lively Urbana restaurant are a short walk to Georgetown and the city’s largest concentration of private art galleries, museums, theaters, shops and restaurants."}