{"user_rating": 2.5, "review_count": 28, "name": "Panorama City Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Stayed here as we were going to a function at the same place. Had a Queen room on ground floor, would have been good 30 years ago. Very dated and in need of a major refit. Shower head full of a green growth, iron too stained to use. Better value elsewhere in town.", "title": "Overnight enough", "helpfulness": 1, "user": "wiskey", "date": "November 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 183839034}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Room very basic and although it seemed clean, on closer inspection, it really wasn't! The air vent in the bathroom was disgusting and retrieving a dropped pen from behind the bedside cabinet revealed a host of grot. Really needs a major overhaul - so glad we were here for one night only.", "title": "Keep on driving.......", "user": "meplusthree", "date": "July 31, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 170090681}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "On our arrival we were met by this very friendly receptionist. Usual stuff swipe your card and pay for the night. We went to the room and found that it was freezing. Fortunately their was a heater so we put that on and then - the rooms are very basic but for one night we only needed a bed. All of which needs a serious update. The best thing about the room was the TV.", "title": "One night in Bathurst", "user": "Happych00k", "date": "June 22, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 164770481}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": ".", "title": "Excellent Location", "helpfulness": 1, "user": "XAGTKate", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160220465}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We decided we would eat in that night and thought we would try their restaurant. So off we went to the Bistro and bar. No money so I asked where a cash point machine. Tried to get money out of the thing but it was just not playing. I advised the bar and asked if I could book up my meals and drink and then pay later. The answer was a clear no but there was a cash point at the servo next door. Guess what No cash point at the servo next door. Back at reception my wife had negotiated that we put the meals and drinks on our room and we were told as long as we paid by 9 pm that would be fine. Back down to the Bistro and waited at the bar, my turn came and went. In fact 7 people went in front of me. The barman walked straight past us and called for help. We were then ignored further and there is only so much you can take. We left and went back to reception to complain. Don't bother you will get the same answer we got. \"Sorry to hear that I will go and speak to them\". There was no follow up what so ever - very disappointing.", "title": "Not one to recommend", "helpfulness": 1, "user": "DrasanWales", "date": "April 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 156596032}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Bathurst"}, "variance": {"poor": 7, "average": 7, "very good": 5, "terrible": 8, "excellent": 1}, "slim_ranking": 0.818181818182}