{"user_rating": 5.0, "review_count": 105, "name": "Pantai Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We just returned from 4 nights in a 2 bedroom suite, number 201. Now I have stayed at great places all over the county and a few in other countries, but this is by far the best of everything. No expense was spared in turning this oceanfront oasis into a luxury destination with the highest quality everything! Large LED televisions 3 total, gas range and high end appliances in the kitchen. The bathroom has a rain shower and totally clean. The carpets are so clean that you can walk barefoot without any concern. The turndown service includes free Eclipse chocolate bars that sell for $4 a piece and are the best chocolates you have ever had. My kids wanted extra bars and they were given them, they were so happy with that. The breakfast had quality food, almond milk, fruit, organic coffee and tea, the best muffins and pastries you could imagine as well as bagels and cream cheese. The staff is what sets this place over the edge, you feel important here, and they go out of their way to make you feel important. This was paradise, stay here, spend he extra money you will be glad you did! The beds are so wonderful, feels like your sleeping on air. This is what every hotel should be like. The pics are great but don't do it justice.", "title": "Can't wait to return! 10 stars!", "helpfulness": 2, "user": "Lynneraz", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148251670}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Great location next to Shell Beach & Scripps Park. Shopping & plenty of restaurants for all budgets & tastes within minutes walking around downtown La Jolla. The place is a mix of restored cottages, bungalows & town homes about 11 units in all.", "title": "Real Treat!!", "helpfulness": 1, "user": "socratesa", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148038513}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed in floor level 1 bedroom cottage with sweeping views of park & ocean. It included a living room with gas fireplace & a 55' screen above it! A full modern granite top kitchen, GE appliances & formal dining area, a big plus if you are staying for more than a few days & don't want to eat out constantly. A separate bedroom with its own 55' HDTV a very modern bath Balinese style. As a matter of fact the Balinese influence is everywhere the decorative tile, mahogany wood, copper fixtures & artwork. A filtered water system, security safe, docking stations, complimentary wifi & parking were appreaciated. The last two you typically pay dearly at resorts & parking is at a premium around here.", "title": "Real Gem", "user": "BurnabyWanderlust", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145548545}, {"rating": 4.0, "title": "My Birthday Surprise", "text": "There is a nice inner courtyard to relax & unwind with modern heaters for the chilly nights. That is also where you can enjoy the complimentary buffet breakfast of teas, coffees, juice, pastries, fruit & Greek yogurt. Nice!", "helpfulness": 1, "user": "Misssly", "date": "November 9, 2012", "id": 145038185}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "No need of a pool or fitness center since you have the beach & oceanfront for jogging & cycling:)", "title": "Fantastic!", "user": "DonnaMaree", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144616189}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "My daughter and I stayed in a one bedroom partial ocean view. We each had our own room - as the living room had a Murphy Bed - what an improvement over a sleep sofa. The staff, location, and ambiance were excellent. This is a gem!", "title": "relax and enjoy the view", "helpfulness": 1, "user": "Pat6060906", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152447346}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "What a fabulous place. Great location, helpful staff, clean, upscale and peaceful. We had the two bedroom with a view at the front of the hotel. Coffee outside in the morning was superb. It was one of the best locations I have ecer had at any hotel.", "title": "Superb location & ambiance", "user": "lovetotravel2012_13", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152035352}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Wow - what a beautiful Inn. We stayed in a one bedroom partial ocean view. Everything exceeded our expectations. The location is absolutely fantastic. We walked everywhere - a nice perk in a place where parking is a challenge. The women who checked us in was very helpful and friendly. Wi fi worked well - fast and easy. Beautiful rooms with many extras and details like under cabinet night lighting in bathroom and a filtered water tap. Bed was very comfortable. My husband loved the huge flat screen tv. Breakfast was simple but delicious - big bowl of fresh fruit with variety of berries (not typical cantelope or bananas). They even thought to put out soy milk. So nice to listen to waves crashing. Loved our stay!!", "title": "Wonderful!", "helpfulness": 1, "user": "indigofire", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151339468}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Celebrated our 21st Wedding Anniversary at the Pantai Inn for two nights.", "title": "We'll Be Back!", "helpfulness": 1, "user": "Mike W", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150242255}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Everything, and I mean EVERYTHING is perfect here. The Inn, The staff, The location... all perfection.", "title": "Lovely stay at the Pantai", "user": "Scousie", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149562047}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed in room 208 for five nights. A beautiful spot looking across Coast Blvd to the Pacific. Private deck, full kitchen and nice small bedroom. The giant TV was a nice bonus for March Madness. Beautiful courtyard and grounds. Very kind staff. Always coffee and tea in the lobby. Fresh fruits, cereal and bagels for breakfast. Walking distance to all the shops and restaurants. There was a mix-up upon check in - we booked full ocean view suite thru LuxuryLink and we were originally shown to a room with no view. Quickly remedied, but since there is only one room like 208 be sure you've confirmed it if that's the room you desire.", "title": "Serene and lovely by the seas", "user": "MaineIzzy", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156165752}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is called a luxury property by some - it's not actually luxury if you're thinking Waldorf or Leading Hotels of the World. But it is wonderfully peaceful and beautiful. The adornments in suite weren't my taste (fake flowers, bamboo furniture) but that's v. subjective. Would highly recommend for a relaxing getaway.", "title": "First year anniversary made perfect", "helpfulness": 1, "user": "Ryan T", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 155943508}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My wife and I went back and forth on where we wanted to go for our very first anniversary. We both wanted something nice and quiet and my wife loves the ocean. The problem we had was that our anniversary falls during spring break. I found the Pantai Inn here on tripadvisor, saw the reviews but was more impressed by the staffs responses to the reviews. I am all about guest service and usually ask a lot out of the staff where ever i stay. Right after booking, i sent an email to the hotel to find out what they could offer for a one year anniversary and was very impressed by the quick response. Ryan, the gentleman that responded, was one of the best I have encountered with regards to guest service. He handled everything promptly and professionally. He told me about the romance package which included flowers, a bottle of wine, candles, and chocolates. I set that up with him but push the boundaries by asking him for a wine that the hotel does not usually use. He responded quickly by saying that not only would he have someone get that for me but that he would have it all in the room prior to our arrival. At other hotels I have ordered similar packages and paid twice as much but did not get an option of wine. I have also gotten use to having to check in before a concierge could go in and set up a room, Ryan and the staff at Pantai Inn went beyond my expectations. Needless to say, I was impressed with the Pantai Inn before I ever left my home.", "title": "Perfect Stay in a Litle Gem!", "user": "Travelmamabkk", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155669249}, {"rating": 5.0, "title": "Long weekend at Pantai Inn", "text": "When we arrived we were greeted warmly by Ryan who shook my hand and introduced himself by saying he was the guy that had been talking to me through emails. It is a smaller hotel but it seemed as if he was expecting us and throughout my stay he would always refer to me by name. It was that type of service that made us feel welcome and comfortable. Ryan was impressive through email and did not disappoint in person. He is very good at his job, its really a gift he has.", "helpfulness": 1, "user": "Izzyl11", "date": "February 20, 2013", "id": 152658967}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "As far as the hotel itself, its furnishings are marvelous. no corners cut, my wife liked the small touches like books in the room about Bali and Balinese culture. I had my questions about the shower because the floor was flat with the bathroom tile but those questions quickly vanished after my first shower. The two ceiling shower heads that rained water down were perfect and relaxing. The sink in the bathroom did leak when we got there but was not really an issue because the floor was designed to get wet. I did let Ryan know though because I did not want it to become a bigger problem in the future, he promptly had it repaired while we took a trip to Old Town San Diego, It was a 15 minute drive from the hotel.", "title": "Our Favorite Hotel!!", "user": "melissa b", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152467362}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed here for a mini-honeymoon right after our wedding (our honeymoon is not until December). The location of the hotel is perfect since is in downtown La Jolla and within walking distance to a lot of shops and restaurants. We arrived and were greeting by the friendly receptionist. The check-in process was easy and the receptionist even showed us around the room. We had a 1-bedroom suite with a full kitchen. The furnishings were nice and we especially liked the fireplace and large flat screen tvs (2 tvs total - 1 in bedroom and 1 in living room). We also liked the complimentary continental breakfast, free parking, and wireless internet. My only complaint would be the size of the bathroom. The bathroom was EXTREMELY small and the toilet practically was in the shower. There was no bathtub and every time we took a shower, the water leaked all over the floor because there is no shower pan and the floor is not slanted. The bathroom fixtures were very nice, especially the multiple showerheads. My other complaint would be that there is no \"do not disturb\" sign. We wanted to sleep in and the housekeeping lady came by every day around 10am asking if we wanted service. It would have been nice to have a sign so she would not wake us up.", "title": "Quality Hotel", "helpfulness": 1, "user": "k15nguye", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144505740}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Overall, the hotel is very nice and the location is ideal. The staff is friendly and the hotel is clean. We would definitely stay at this hotel again.", "title": "Wow!", "helpfulness": 1, "user": "John S", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142925004}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed here for one Thursday night in mid October 2012 and it was one of the best all around lodging experiences we’ve had (and we’ve stayed in some nice places). It was my wife’s birthday and she decided to bring homemade scones for the front desk and ask for an upgrade. What the heck, it was worth a shot. Amanda at the desk couldn’t have been nicer (as was everyone there including the gardener who keeps things looking great). She gave us their best suite, 208. Check out the pictures, it’s awesome. You’ve got your own giant porch overlooking the Pacific, which is right across the street. When you tire of that, the large living room has a full-length picture window and two big couches to sit and gaze. Also in that room is an eating table with four chairs, a big working gas fireplace, a gorgeous flat screen TV and a Murphy bed which folds down from the wall. Everything is new and spotless. Then you have the lovely bathroom with hand painted ceiling and a medieval style shower, a full kitchen with brand new appliances, and a cozy bedroom with a four-poster queen size and another flat screen.", "title": "Home Away from Home", "user": "431Janet", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142517611}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "You’re in between La Jolla Cove to the north and the Children’s Pool with its seals to the south. We walked up the steps to eat at the restaurant 9-10 which is gourmet with a capitol G, but there are twenty other restaurants up there to suit any taste. Of course you have free parking so you can cruise anywhere.", "title": "Perfection!", "helpfulness": 1, "user": "Lucydamico", "date": "October 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142129838}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I’d recommend this room to anybody. If you’ve got a special occasion, say a wedding with a group from out of town, this suite could comfortably sleep five. A word of advice: this area is world famous and fills up with people during the day on weekends and holidays. They all leave after sunset though and you’ve got the waves and the seals to lull you to sleep. I hope to return someday.", "title": "Wonderful inn", "helpfulness": 1, "user": "gaume01", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141120425}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 1, "average": 1, "very good": 12, "terrible": 0, "excellent": 91}, "slim_ranking": 0.166666666667, "description": "This exceptional boutique hotel masterfully blends Bali's old-world charm, kingly comforts, and cutting-edge technologies. Reminiscent of the tranquil retreats of the Indonesian island, Pantai Inn offers the essence of Bali with richly appointed suites and ocean views. No two rooms are alike, each decorated with custom furnishings, art, wood and stone carvings, all hand-chosen and imported from Bali. Most notably, Pantai Inn exudes the purest form of luxury. This paradise is your gateway to experience Bali's most revered traits...the highest standards of genuine, friendly and welcoming hospitality service."}