{"user_rating": 4.0, "review_count": 277, "name": "Pantip Court Serviced Residence", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Stayed in a two bedroom apartment with two children. The apartment was so big, quiet and the beds were really comfy - a huge king and two double beds. It had a kitchen and fridge stocked with softdrinks ( you had to pay for these) complimentary bottles of water. There is roomservice, a restaurant, gym, great pool, and make sure you try the Thai massage. Would stay here again. The only drawback is the location - it's a bit out of the way. We managed to get a taxi to MBK shopping centre - about 10 minutes away. Great shopping if you don't have a lot of time. Also just downstairs on the corner is a very modern Thai restaurant called Pandanas. Great food, decor and interesting menu.", "title": "HUGE APARTMENT", "helpfulness": 2, "user": "linlu65", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37898126}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We instantly felt at ease in this beautiful enormous suite. The staff were wonderful and made every effort to ensure we were ok both in and out of the hotel. The pool area was a blessed relief from the heat as was the air conditioning. With 3 teenagers we could all spread out and relax. This hotel is excellent value for money and with the night markets just a short walk away we would definitely return here next time.", "title": "Wonderful apartment luxury", "helpfulness": 2, "user": "Mum23Queensland", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37022129}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Its not often you check into a place and instantly feel you will like it, but Pantip fits the bill. Check in was pleasant and efficient and in no time we were in our suite. And what a suite - must be the largest 2 bedroom place I've ever stayed in. Massive lounge and 2 big bedrooms. Kitchenette small but since we didnt plan to cook or eat in, no drama. Pool was nice and daughters used the gym daily and liked it. The apartment decor and fittings are not modern but still acceptable. The king size double bed could have slept 4. Minor concern was the height of the balcony railing - I'm 5'10\"ish and it was just below my waistline, so a wee bit scary on the 17th floor looking out/down. You'd need to keep smaller kids well back. And the satellite TV service was grainy, but I've found that everywhere I stay in Thailand.", "title": "The Family Bargain of Bangkok", "helpfulness": 3, "user": "Scotsmaninmalaysia", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 35628599}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Fab little restaurant open all day just across the road to the right (forget the name, but its the only one). Easy walk to Suan Luam night bazaar where there are plenty more good eating places and interesting stalls. I read that it may close down and looks like half has already been boarded off for \"re-development\". A real shame if true. Close to underground station too, but underground and skytrain really dont go near main tourist sites - only offices and shopping malls. Plentiful taxis cruise by hotel and we found them very good - never failed to put the meter on, took us where we wanted to go, clean and youngish Toyota cars. Didnt pay more than 100baht for any trip - for 4 people, cheaper than using public transport.", "title": "Made me feel like an executive", "helpfulness": 3, "user": "Roamingx", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28990967}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We have just returned from our trip to Thailand and our first stop was a few days in Bangkok. Please ignore all the negative comments about Pantip Court I cannot praise it highly enough. The staff were very friendly and extremely helpful. We had booked a two bedroom apartment which was enormous, there was so much space , a huge living room area with a kitchen . Both bedrooms had ensuites and an extra toilet in the apartment too, it really was a home from home. The whole apartment was really clean and spotless.", "title": "Fantastic stay", "user": "Diwinny", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74562692}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The buffett breakfast was really good , plenty of choice from pastries ,toast , ,fruit, juices, a chef cooking eggs, a hot buffett selection including egg fried rice and bacon. It really did cater fro every taste and there was plenty of variety.", "title": "A great place to stay and relax in bustling Bangkok", "user": "Guinness45", "date": "July 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73115028}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The hotel has a lovely pool which we made use of , and I had a facial in the spa at the hotel which was really good.", "title": "Look no further. This is your home away from home.", "user": "JulieKear", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62268944}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Location wise it is fine , you're out of the hustle and bustle a little bit and it is about a 20 minute walk to the sky train but the hotel does provide a shuttle service to the station which is free , and a taxi back would only cost about 50 bhart which is about £1 .", "title": "hard to beat for price and comfort", "user": "KapitiTraveller", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60417387}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "There are lots of resturants we ate at the night market which has lots of them all varring degrees of cost from cheap to western prices.", "title": "Fabulous! Fabulous! Fabulous! Can't rate it highly enough", "helpfulness": 1, "user": "haar0064", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59318646}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I only stay here on my trips to Bangkok. Why suffer in a teeny, tiny room when I can have an apartment to myself. The pool is spectacular, the workout room and sauna great. I love this place.", "title": "Wow!", "helpfulness": 1, "user": "Donsabai", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48959036}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Everything exceeded our expectations. The apartments were huge and the two bedrooms were huge and each even had their own bathroom including the extra bathroom in the hallway. The view was great and service was top notch. Hotel staff was always very friendly and helpful.", "title": "Wonderful", "user": "grey_jago", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46355744}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Stayed in Pantip Court Service Apartment for 13 days, the price is very reasonable! First step in the room, i feel the decor have a little bit old but very comfy and home feeling! The living room is huge, The kind size double bed is very comfy and big, enough for 3 -4 peoples to sleep! Bathroom is big too ( I love that bath tub)! All staffs are so nice, friendly and helpful. Breakfast was so so, almost same food everyday, not too bad not too good. This service apartment have a fully equipment gym room, really good for customers to do some exercise (they have dancing class too, but i didn't join). I most like this hotel swimming pool, the pool is big enough for swimming, sun bathing chair is very comfy, I love it! Room Service was good too, food is delicious and the price is acceptable! Great!", "title": "Huge room, Very nice service apartment in Bangkok!!", "helpfulness": 1, "user": "Ray88888", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 40394796}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed for 4 nights at Pantip Court & were very impressed with the apartment & the wonderful staff. Although the location is a little 'out' it is very close to the night markets & some great eateries, You could not ask for more attentive staff & the apartments are extremely well presented. Breakfasts are fine and we would recommend Pantip Court to any travellerts who are visiting Bangkok & want a peaceful, friendly & pleasant place to stay", "title": "Huge apartment with great staff as well!............................", "user": "OzzieBarb", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52348764}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Ok, to start with, we booked a suite, but this suite was HUGE! (See attached pics)", "title": "Pantip is like home", "user": "AmarChopra", "date": "December 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 51711071, "likes": {"liked": "— Huge rooms", "disliked": "— breakfast"}}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 11, "average": 36, "very good": 122, "terrible": 8, "excellent": 100}, "aka": "Pantip Court Serviced Residence Hotel Bangkok", "slim_ranking": 0.361904761905, "description": "Located in Bangkok's prime business district of Sathorn Road, Pantip Court Serviced Residence combines the convenience of home with the luxury of a five-star hotel - all within a short distance from the Bangkok's premier office buildings, embassies, entertainment, and shopping zones. Surrounded by lush tropical gardens, Pantip Court is also close to Lumpini Park, the largest park in the central business district of Bangkok."}