{"user_rating": 3.5, "review_count": 114, "name": "Paphian Park Tourist Village", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We have recently visited this hotel on an all inclusive basis. The complex itself is very clean, and the food was good no tummy upsets which was a relief. The menu was repetitive so we did have to eat out which added expense to our all inclusive break, but this was a personal choice. The staff were very friendly but could speak limited english, but they made us feel extremely welcome and without them the holiday would have been a bit of a drag. The entertainment was quite poor and noise was limited after 10.30, in the evening and not a lot to keep the children busy during the day. I would not recommend this venue as a lively family hotel, which we would of liked. We did make the most of what we had, and overall we did have an enjoyable time. The apartments are of good size, but when I did book, I did not realise that I would have to sleep on a sofa bed for two weeks, having a back complaint this was not good, I advise that you do check this out. The complex is quite remote and you do have to get taxis or the bus to town and the larger beaches, which also adds expense to your holiday, there is one shop and bar close by. I would visit cyprus again, just not this holiday village.", "title": "Could of been better", "helpfulness": 3, "user": "Dereck7", "date": "June 17, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 1.0, "service": 4.0, "rooms": 2.0}, "id": 7869642, "likes": {"liked": "— The Staff", "disliked": "— Sofa Bed"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Family of four - May 07", "title": "What a great hotel!", "helpfulness": 3, "user": "DKVM", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7774954, "likes": {"liked": "— GREAT VALUE FOR MONEY"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Booked a late deal to Cyprus and found this wonderful hotel on Sunshine.co.uk. Read other reviews before travelling and wanted to post our own views.", "title": "An enjoyable stay", "helpfulness": 4, "user": "KateEngland", "date": "May 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7670358, "likes": {"liked": "— Vegetarian food, clean and comfortable accommodation.", "disliked": "— Buzzing fusebox, would have been nice to be located nearer town."}}, {"rating": 4.0, "title": "Our Family Holiday", "text": "We have just returned from 2 weeks holiday from Paphian Park Aparthotel in Cyprus, ( 22/07/07 to 05/08/07.)The Hotel was advertised at a 4 Star Hotel but i would put it at 3 Star, it was a nice Hotel but we thought the Entertainment in the 2nd week was Absolutely rubbish.", "user": "mummymik", "date": "August 10, 2007", "id": 8389814}, {"rating": 4.0, "title": "Repetitive food? Only if you stay for 10 weeks....", "text": "The Bar Staff were Fantastic Peter The Headbar man his Special Cocktails were out of this world, Janos He made His Special Cocktails Fab & Strong too.", "user": "charlton_bird", "date": "July 30, 2007", "id": 8256253}, {"rating": 4.0, "title": "perfect getaway", "text": "We were very sorry to say bye to them when it was time to go home.", "user": "awayalways", "date": "July 22, 2007", "id": 8215135}, {"rating": 3.0, "title": "Not 4* but you get what you pay for", "text": "We had some laugh's with them. we also met some lovely people, Daz, Cheryl, Sian, Carl Ect.", "user": "JOHNBOY2711", "date": "June 28, 2007", "id": 8019856}, {"rating": 4.0, "title": "cheap, last minute and great value for money!", "text": "would defo go back to Cyprus but not in the same hotel as we found it was hard to get clean towels & bedding or even the cleaners never came every day we kept running out of toilet roll and had to keep asking for it. we had to empty our own bins a few times because they came full and no cleaners were coming in to empty them. we payed just over £4,000 for our holiday so i did not expect to keep having to ask for toilet roll and clean towels and bedding.", "user": "karaokeequeen", "date": "June 26, 2007", "id": 8001109}], "location": {"country": "Cyprus", "continent": "Europe", "city": "Paphos"}, "variance": {"poor": 16, "average": 25, "very good": 32, "terrible": 15, "excellent": 26}, "aka": "Paphian Park Tourist Village Hotel Paphos", "slim_ranking": 0.726315789474}