{"user_rating": 4.5, "review_count": 539, "name": "Paramount Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My wife and I stayed at the Paramount over the past Thanksgiving weekend (3 nights). This was our first stay in downtown Portland.", "title": "Perfect Location", "user": "Bill B", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146233774}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We chose the Paramount after reading other reviews and learning that they had a pretty good deal going on for the weekend. Through another booking service, we landed a king room on the 12th floor.", "title": "Downtown Location without the Big Hotel Hassle", "user": "BallGrl", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 146210675}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Our room was clean and removed from street noise. We had and excellent view to the north. The bed was soft and very comfortable. All the usual amenities were in the room: small fridge, coffee maker, etc., but no microwave.", "title": "Great location but Lack of Attention to Simple Details", "user": "lorlo5", "date": "November 24, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146115941}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The room was surprisingly large for an older building. It felt airy and open.", "title": "Location, value, comfort", "user": "JesseOntheGo", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146053583}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "So, why the 4-star rating? For starters, the lobby was a let-down. It felt sterile and unwelcoming. We felt no inclination to lounge there. It was too bright and the seating wasn't comfortable. It was simply a large room to move through on the way to the elevators in back.", "title": "Beautiful and Convienant", "helpfulness": 4, "user": "Jodie D", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145613786}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This is the first time staying at the Paramount. It was a lovely stay. The staff were all courteous. The room was quite comfortable and clean. And the location of the property was very convenient. Though older, it has a feeling of history.", "title": "Comfortable Rooms", "user": "Stephanie R", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147280925}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "During a recent stay (November 28th-29th, 2012) for business I was traveling alone and everyone I encountered at the Paramount was helpful and accomodating. The desk staff and concierge were both willing to give opinions and advice on where to eat, and I ended up choosing to dine in the lounge and not go out into the cold because of the late hour. There was a sushi roll with honey, shrimp and avocado that was to die for. The room was comfortable, clean and spacious with a great view of the park in front of the hotel. They have recently remodeled the rooms and the bathrooms are gorgeous. The pillows on the bed were great! The next day, after quickly checking out of the room and driving 10 miles towards my meeting, I realized I had left something in the room. (OK, it was the Voodoo Donuts I had heard so much about.) I called the front desk, and the attendant was so nice, she had the bellman go up and grab them and I picked them up later that afternoon, before my flight back to San Diego. Upon my return I spoke with the valet/doorman who was helpful with lots of advice and info about downtown, the area and walking, and just in general. I was able to park and walk for awhile downtown. Everyone there was easy to approach and seemed happy to work there. I felt right at home talking to any of them, and that meant a lot, especially being a woman on a trip alone. It was my second visit to the Paramount and if I'm back in Portland again, this won't be my last visit to this hotel; I will definitely come again.", "title": "Great hotel & great staff", "user": "Ariana B", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147141196}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "While the overall feel of the place is mid-range, three star, due to just average appointment of rooms and common areas, and perhaps aging just a bit, the large corner view room, and very comfortable bed and linens, are worth an extra star. I also very much appreciated the jacuzzi tub! The hotel is in a great location near pioneer square and train and trolly, lots of great food and drink options nearby, starting with right in the hotel lobby.", "title": "Large, comfortable view rooms", "helpfulness": 1, "user": "john_northbay", "date": "December 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146889414}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I heard just a bit of noise from room above, and just one garbage truck,, but it was not a major inconvenience. I had a great stay.", "title": "Perfect location", "user": "trouthousenogo", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146498423}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This is the second time we stayed at the Paramount Hotel in downtown Portland over the Thanksgiving holiday. It is the perfect location for shopping, short outings with the little one, walking around, and taking part of the city holiday festivities like T-day Macy's parade, and tree lighting in Pioneer square. The hotel staff is friendly and helpful. Last year, I forgot some clothes in a drawer, I called to inquire and they still had them and were nice enought to ship them to me. The hotel offer valet parking but there is plenty of street parking around the hotel. One just has to keep in mind the new city rules for parking off the street.", "title": "Almost perfect...almost", "user": "GoGoBear", "date": "November 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 146289468}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed for a few nights-- as others have pointed out, the location is very good. Our room was clean and comfortable-- and the staff were all very friendly. Our room was quiet and the wi-fi worked well.", "title": "Very happy with the Paramount", "user": "TT40", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170782788}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The in-house restaurant was fantastic-- Portland has so many great dining options that we only got to experience it once! I would gladly return to the Paramount on future trips!", "title": "Centrally Located.", "helpfulness": 1, "user": "seaturtledove", "date": "August 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 170637322}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "From this location we could walk everywhere. Totally enjoyed the Pearl District and the Saturday/Sunday market which has unique and creative merchandise.", "title": "Wonderful experience", "user": "James M", "date": "August 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 170369267}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel and rooms are very clean and comfortable, and a good value for the dollar in an expensive hotel district. The front desk was professional and courteous.", "title": "Elegant lodgings, great location!", "user": "nysatx", "date": "August 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170364719}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The only thing I was not satisfied with was the Concierge. The front desk had to call him in the morning. He seemed distracted and did not respond with any enthusiasm when asking for help. I asked him for \"a good place for breakfast \" within walking distance. ( We had just arrived and did not know the area.) Well he suggested \"Mothers\" which was about a 20 minute walk- not too bad distance wise, but when I asked him if some streets were safer/better/busier/prettier to go down then others he said it was all the same. I was in the lobby with 3 young children, so I thought he would\" get\" what I was asking for. So following his route we had to walk past several blocks with many transients/homeless and by some places advertising things that I did not want my kids to see. After I learned the downtown area I found there were many fantastic places about 5 to 8 minutes away if we went in the direction of the Pearl District or toward Nordstrum that I discovered on my own. Why he did not tell us about this area or direction, beats me. He lead us down a lonely area of the downtown to get to one breakfast house. A suggestion for the manager: Have the concierge \"walk the streets\" so he can present the best and safest of Portland. If it wasn't for the disturbing experience I would be giving the hotel 4 stars.", "title": "Very Nice", "user": "funat50Alabama", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 170009866}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "I travel to Portland several times a year and almost always stay at the Paramount. The central location is very convenient, I've always received excellent service from the staff, and I really enjoy the Te restaurant. I highly recommend the Paramount for stays in central Portland.", "title": "Excellent location and service", "user": "CharlesGrant", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169721385}, {"rating": 4.0, "title": "It's rare that I have no complaint or criticism", "text": "Delightful bed and pillows and high-quality linens; simple, tasteful decor; large size room and bath, convenient location, exercise room with towels and water (nice!).", "user": "MidwestPhotog", "date": "July 29, 2013", "id": 169653809}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The hotel also has doormen which is more useful than I'd ever thought. They were available about 50 percent of the time though.", "title": "Satisfied customers", "user": "546HilaryJ04", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169485544}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Price is about $20 more than I wanted to pay hence the 4 stars.", "title": "Read the fine print", "helpfulness": 1, "user": "GaryAZAZ", "date": "July 27, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169300239}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The Paramount was ideal for us. It,s situated centrally in downtown, a short walk to everything we wanted to see and do.", "title": "Great hotel ...... Very relaxing!", "user": "Linda H", "date": "July 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169288856}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My family recently traveled to Portland to visit for four days. I found The Paramount Hotel on Tripadvisor and booked based on the great recommendations. The staff displayed exceptional customer service; making transportation arrangements from the airport and back again for our departure, printing our boarding passes when the business center printer was not functioning properly, and finally in making several excellent dining recommendations. Overall we had a wonderful visit and I would recommend the hotel for its great staff and central location to every part of the city.", "title": "A great visit", "user": "Vegastravelr", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149195354}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We arrived at 10:30 on a Thursday and the hotel was able to give us a room which was great since we had just arrived via Amtrak. Loved the lobby and having an onsite restaurant was a nice addition although we did not eat there.", "title": "Two Days at the Paramount", "user": "58susieb", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149101289}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Loved the room, we took a junior suite with a balcony and this made the room seem much bigger and lighter. Everything about the hotel was thoughtful and well laid out. Loved that the room had a refrigerator instead of the mini bar. Downton location had easy access to movie theater, Starbucks, bus and subway. Walking distance to food trucks, Lardos and Star Donuts.", "title": "Ideal location and service", "user": "orcasgypsy", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148739592}, {"rating": 5.0, "title": "Not disappointed", "text": "We stayed here for two nights after Christmas for a little break. The location was perfect--just a short walk to the river, shopping and good food. The staff was extremely helpful and very pleasant. We were referred to Little Big Burger for a quick bite by the gentleman at the registration desk and it was awesome! Our room had a nice view of the city and was very quiet (6th floor) for a hotel in the downtown area of a busy city. We will definitely stay here on our next visit to Portland and will recommend it to friends and family.", "user": "Nikki G", "date": "January 1, 2013", "id": 148480615}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Staff was/is superlative and very friendly. Booked a park view room and enjoyed every moment of our view of downtown and Director park (especially watching people play with the giant chess set ). Even for New Year's Eve, the noise wasn't terribly awful and what noise we did hear was typical for the hustle and bustle of Portland on a big night. Absolutely zero complaints. My advice is to book a park view as high up as possible, valet the car, and enjoy Portland for all that it has to offer.", "title": "Disappointing!", "user": "LISDessert_First", "date": "December 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 148455644}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I recently stayed here for one night before a business meeting. The staff starting with the valet were very nice and helpful. I had a corner room that overlooked the city and it was very spacious and comfortable. The bathroom was a good size and I appreciated the use of dispensers instead of individual bottles. The only complaint I had was the *very* low water pressure. As a woman with thick hair I had a real problem getting the shampoo out - I had to resort to putting my head under the bath faucet. The hotel itself is fairly small and quiet. The only noise I heard was when a large party got off the elevator. Overall, a nice visit and I would stay here again.", "title": "Spacious Room", "user": "MBinSea", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148057116}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We just spent four nights here at the Portland Paramount Hotel in the heart of Downtown.", "title": "Treated Like Royalty !!", "user": "CrCAROLYN", "date": "December 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147918727}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Easy walking distances to shopping, restaurants, and theatres. The hotel staff was attentive, professiomal, and took a personal interest in assuring our comfort. They even assisted us", "title": "Perfect \"De-Compress\" Trip", "helpfulness": 1, "user": "usatran", "date": "December 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147844294}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "in making an unplanned, midnight trip to the Hospital Emergency Room. Unlike that venue,", "title": "Boutique Hotel Close to Shopping and Art Museum", "user": "Connie M", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147637569}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "our hotel room was well-located --in a top floor corner !! Gorgeous, nearly 180°views!", "title": "Really nice experience", "user": "wheatgrower", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147576915}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My family traveled back to The Paramount in August after a quick trip in January. This time we spent a week to relax and enjoy the city and this property. The staff was very helpful from the front door to the maintenance staff. This trip we took the train, two short blocks from the hotel and when we arrived the staff quickly checked us in and we were able to get settled in for our vacation. This hotel is located in the center of the city and close to all the action....we walked all over the city and enjoyed all the outside activities. Our favorite is Director's Park where there is always something going on. I would highly recommend the property if you are looking for a small and friendly hotel property.", "title": "Perfect Location", "user": "Vegastravelr", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173270382}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Located between the beautiful Art Boulevard and a City Square, a block away from gorgeous library and a 2 block walk to city's great transportation system, this hotel is a gem. The rooms were very nice, plush and quiet. The staff is remarkably delightful where Ed and his fellow concierge will make amazing recommendations and reservations for you at some of the nicest restaurants in the area. For breakfast, you can have the delight of congee, salmon, miso soup and such delights of the Orient if you wish or stay with your regular bacon and eggs fare, what a treat for the adventurer. Again the staff here is wonderful. Anytime I am in Portland I will return to this great hotel that provides quality, warmth and adventure at a most reasonable price.", "title": "So comfortable, perfect location and staff", "user": "Mike K", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173162703}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I loved this hotel and can't wait to go back. The ambiance as soon as you walk in is elegant and casual at the same time. It's clean and comfortable. I stayed in one of the corner King rooms and had a view of the courtyard on Taylor St. This was perfect. From the second I arrived, the doorman was very helpful and he addressed me by name every time I came and went. He was very personable. The front desk agent was also personable and while we were talking, realized we were from the same little town in Washington. I went there alone just to get away for a weekend and explore Portland and the suggestions that the staff gave made my stay unforgettable. For my first time traveling anywhere alone, I felt at ease. The hotel staff knew why I was there and were very accomodating.", "title": "Perfect from top to bottom!", "user": "Jennifer D", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173007705}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The room itself was clean and comfortable. I slept well on the comfortable bed and loved the big bathtub (although I didn't get a chance to use it). I wanted to try staying in the Pearl district next time I'm there, but I think I'm going to go with Paramount again and just cab it to Pearl Dist. I love this hotel too much to not go back!", "title": "a beautiful hotel in a beautiful city", "helpfulness": 1, "user": "sans265", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172355695}, {"rating": 4.0, "title": "Perfectly Content at the Paramount", "text": "A warm friendly hotel located in the ideal surroundings. It has the perfect location with all stores located in close proximity. The views from the Hotel are great and the staff are super friendly to their guests.", "helpfulness": 1, "user": "suzyjacuzzi", "date": "August 14, 2013", "id": 172287057}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband & I attended a wedding an hour outside Portland, OR & decided to spend a couple of nights in downtown Portland afterwards. The Paramount is perfectly located 1 block from the train - which is free anywhere inside the downtown area! Across the street is a lovely quiet park where folks play chess on a giant board, there's a fountain/sprinkler for little kids to run around under in summer & parents & anyone else can sit on a bench & dip your feet into the shallow water.", "title": "Comfort, luxury & great location in downtown Portland, OR", "user": "msdrum", "date": "August 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172275594}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "there's a great Asian restaurant on the ground floor. the rooms are beautiful - we chose a room w/a jacuzzi bathtub (the jets aren't as strong as a spa/health club, but good) & a shower. the king size bed was extremely comfy. Starbucks is 1 block away. the famous food carts are a short walk.", "title": "Paramount is a good choice in downtown Portland", "user": "sconner28", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171888593}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "It's not cheap - 2 nts came to $451 with taxes.", "title": "Best hotel in downtown", "helpfulness": 1, "user": "fridani", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171751970}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "(Note: re the cable TV: go the the \"tv guide\" channel to see listings. We only found out about this as we were checking out.)", "title": "Great place to stay in Portland!", "user": "britborn52", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171069224}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed in this hotel for three nights during the wedding events for our friends' daughter. The hotel had blocked a group of rooms for friends of the bride. The hotel has a great location in the downtown area, less than two blocks from the light rail train that goes out to airport, convenient shopping, museums, etc. The rooms are very nice;beds are comfortable;rooms are modern and clean, bathrooms are adequate. We were able to sleep well; noise is well insulated; AC works well, etc. Lobby restaurant offers meals until 10 p.m., which we found convenient and helpful. Lobby staff was mostly helpful.", "title": "Exceptional hotel", "user": "ItineraryLady", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170782894}], "location": {"country": "United States", "city": "Portland"}, "stars": 3.5, "variance": {"poor": 18, "average": 40, "very good": 190, "terrible": 7, "excellent": 284}, "aka": "Paramount Hotel Portland", "slim_ranking": 0.0769230769231, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "“As personable as Portland,” The Paramount Hotel offers guests professional and efficient service with genuine care and concern. Located in downtown Portland, Ore. the property combines the personal touch of a boutique hotel with comfortable and contemporary touches."}