{"user_rating": 4.0, "review_count": 2142, "name": "Paradise Point Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We were so apprehensive about staying at this resort after reading all the reviews but decided to give it a try because we wanted to stay very close to SeaWorld and the beach (and Fodders rated it one of the best family resorts) . Well, I have not one bad thing to say about this place and we would definitely stay there again. We had a beautfiful bayside bungalow suite with the beach just outside our back patio (complete with lounge chairs and a working chimenia). The room was beatiful and very clean (especially the bathroom) and quiet too! Our room was exactly as pictured on their website and it was perfect accomodations for our family of four. The grounds are well kept and gorgeous and our kids especially loved climbing the lookout tower. Service was terrific and prompt- room service was delivered within 20 minutes (used them for our breakfast and dinners) and were always accomodating to our special requests. We stayed one week and the staff was always friendly and helpful. I highly suggest going with one of their hotel packages - we did the Seaworld package which included accomodations (we upgraded) Seaworld tickets, free parking, and a $39 food credit daily. The best part is, it is less than a mile from SeaWorld and we had a great beach right at our door step. Definitely a great place for families. We highly recommend it!", "title": "Great Location, Great Accomodations, The kids loved it!", "helpfulness": 5, "user": "aznycmama", "date": "March 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4824663}, {"rating": 2.0, "title": "Not a good value for the prices!", "text": "Resort is not the 5 star resort it's cracked up to be. Rooms are on the small side and unexceptional, lacking enough comfortable seating in the \"average\" rooms, carpet stained and worn, bathrooms are spartan, can't believe they have the nerve to charge $18 per night to park outside your room. I can do that @ Motel 6 for free! Everything on-site is ridicuously expensive from meals at the restaurants to take-out coffee and tea at the Island Market. Service at the restaurant is slow -- staff is fine, just not well-staffed at high visibility times. Service seems a bit uneven across the board -- if you're in the low-rent district, 600 block of rooms, don't plan on getting your newspaper before 9AM, if you're lucky enough to get one at all.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4727072}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "On the positively exceptional side, the staff is extremely well trained, friendly and helpful at every turn. The grounds are lush and beautifully kept up.", "title": "Pleasantly Surprised!", "helpfulness": 10, "user": "Christy M", "date": "March 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4693791}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "For the money, I wouldn't stay here again -- choose the Dana across the water in Mission Bay!", "title": "Beautiful, peaceful family resort.", "helpfulness": 6, "user": "leflef", "date": "March 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4591157}, {"rating": 2.0, "title": "Terrible service, food - for a fortune", "text": "Don't let the reviews stop you....I surprised my husband with a trip to San Diego and was VERY nervous after reading the reviews here. We've stayed at resorts all over the US and found this to be a very beautiful visit.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 6, 2006", "id": 4588841}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Just returned from a 4 day stay at Paradise Point and truly loved it! The grounds are", "title": "Heaven on earth!", "helpfulness": 9, "user": "ggarlic", "date": "April 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5008218}, {"rating": 5.0, "title": "Hope to return", "text": "absolutely gorgeous. Everyone is very friendly and the service was all you could ask for. Would highly recommend it and can hardly wait to go back....so relaxing!!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4998321}, {"rating": 1.0, "title": "Disappointing Nasty Nightmare", "text": "We loved this resort and nearly had to drag the kids away each morning to visit San Diego area attractions! They loved the pools, beach, observation tower, tame ducks and walking paths. They loved breakfast at the Barefoot Grill, where Harry the heron hangs out ready to dive at plates. They loved hitching rides around the property on golf carts.", "helpfulness": 139, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4994365}, {"rating": 4.0, "title": "Nice place for a family to sleep and enjoy the pool", "text": "Room 364 was just across the sidewalk and within sight of the main pool's hot tub, so close that my husband and I could sneak out after the kids were asleep at night. Yet the room was surrounded by lush gardens and was very quiet. The room had two queen-size beds, a large armoire with a TV and mini-fridge, a table and two chairs and another bench in a small alcove. The dressing room was large, with two sinks and a large closet. Showers were hot with great water pressure. We had a small porch with chairs, and a small group of ducks waddled by each morning begging for handouts. The room, nicely decorated in bright yellow and navy, was larger than most four-person rooms we encountered in California.", "helpfulness": 32, "user": "A TripAdvisor user", "date": "April 21, 2006", "id": 4992387}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "What really stood out was the service. Our first night's reservations were lost (which we discovered just before leaving home.) The management put us up at the Catamaran across the bay and covered our taxi transfer the next morning. That seemed sufficient to us, but they also paid for breakfast at the Barefoot Grill AND paid for our tickets to Sea World. I was very impressed with that show of concern.", "title": "It was Paradise!", "helpfulness": 21, "user": "Jenny V", "date": "April 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4989797}, {"rating": 5.0, "title": "Expensive but worth it", "text": "Just returned from several days in San Diego, half of which was spent at Paradise Point. While it was pricey, and they do charge you for everything ($20 for parking is just an example,and the cost of the mini-golf at $9 per person is just silly), the resort is breathtaking. Rooms are large, beautifully decorated and spotless. It's extremely convenient to be able to park adjacent to your room. Our teenage sons just loved the facilities including multiple pools, tennis courts and basketball. I'd rather spend fewer days at a memorable place like Paradise Point than a week elsewhere. When you check out, be sure to doublecheck your bill.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "April 17, 2006", "id": 4983368}, {"rating": 4.0, "title": "Will return to Paradise as soon as possible...LOVED IT!", "text": "Wow! What a great little getaway! I booked this hotel, THEN read the reviews & was sweating all the way down to San Diego...but what a pleasant surprise! The resort itself is GORGEOUS & well-kept, lovely pools, very family friendly yet quiet! The beaches are perfect for sand castles, shell hunting, splashing, & overall running around; the grounds have a really cute little putting green course with little putters for kids & ducks & fish which the kids loved feeding; and the Barefoot bar & grill has an awesome breakfast buffet. We also ordered food to go for dinner one evening from them which was made very quickly & was very good. My picky eaters ate it all!", "helpfulness": 25, "user": "A TripAdvisor user", "date": "April 15, 2006", "id": 4974474}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We had a room that was a king size bed with a queen pull-out couch & had just the right amount of room for us (2 adults & 2 kids ages 2 1/2 & 5). We have stayed in very fancy hotels (several Ritz Carltons & others) & quite honestly this room topped the Ritz Carlton in Laguna Niguel where the walls were thin, we had 2 double beds crammed into a little room + furniture crammed in without a fridge or coffee maker. I was very disappointed at that Ritz. We'd come back down to this hotel in a heartbeat. It reminded me of the vacations we used to take as kids ourselves where we parked our car in front of our little bungalow at the beach! So much fun.", "title": "Thought it was Great!", "helpfulness": 5, "user": "Ed E", "date": "April 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4956436}, {"rating": 3.0, "title": "Good family resort - needs a remodel", "text": "We also found the service to be super-friendly & very accomodating. No complaints here!", "helpfulness": 9, "user": "cougarmountainfamily", "date": "April 8, 2006", "id": 4950251}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "We stayed for 2 nights on March 30 and 31. After reading all the negative stuff on this site I was a little apprehensive , but our travel agent assured us she had good things. She was right. The grounds are beautiful, the service we received was excellent. Had a problem with out HVAC unit and it was taken care of in 15 minutes. The rooms are a little old, but they were clean and spacious. The bed seemed to be brand new and was incredibly comfortable. Don't be turned off to all the negativity --the place was wonderful---not the Four Season but you are not paying for the Four Seasons", "title": "High maintenace hotel", "helpfulness": 4, "user": "grayling", "date": "April 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4828349}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "We spent the last four days of a whirlwind two week tour of southern California at Paradise Point. Our first week, we were at the Marriott Residence Inn in Hotel Circle which was a perfect base for all our amusement park hopping. Then up to Irvine's Hyatt Regency for a karate tournament. I will review these properties too, but suffice it to say that they met or exceeded our expectations. Unfortunately, Paradise Point did not.", "title": "A total letdown after a great trip", "helpfulness": 13, "user": "nrh", "date": "June 12, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 5333927}, {"rating": 5.0, "title": "Loved IT!!!!!", "text": "Our plans had been to spend the last few days of our trip lounging in the deck chairs in front of our beachfront bungalow next to a pristine (or at least well maintained beach) while our preteen boys played on the beach and in the water. When we arrived to check in, we were soooo excited. The grounds were lovely. The pools were pretty. The ponds were great and we loved the fact that there were sweet little ducks swimming around everywhere (we didn't know that we'd spend the next four days yelling at other people's kids not to throw rocks at the ducks, but I guess that's besides the point!).", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 5, 2006", "id": 5301419}, {"rating": 4.0, "title": "Great for kids", "text": "Our room wasn't quite ready for us, so we took the map the girl at the front desk gave us and went off to check out the general area where she told us our room would be. The first thing I noticed was that the \"beach\" in the picture wasn't exactly what I expected, it was more of a manmade cove - no waves - big drainage pipe spewing who knows what into the water with a warning sign not to swim within 72 hours after a rain - one stretch with no sand, just a huge wall of boulders. I became concerned about the specific location of our room (i.e. was it going to be near the sewage pipe or the boulders?) and went back to the desk to ask. The clerk didn't know, but when I told her that putting my two pre-teen boys near those boulders was a trip to the emergency room waiting to happen (I'm sure she heard \"lawsuit\" although I didn't say it) she said she'd put in a request in the back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 1, 2006", "id": 5289890}, {"rating": 5.0, "title": "Great Resort...bring walking shoes", "text": "When they called us to tell us our room was ready, we picked up the keys to Unit #526 (located comfortably between sewage pipe and boulders) and were pleasantly surprised to find that our room was quite lovely. The bathroom was set up so the kids needn't wake us in the middle of the night to potty (unlike the Marriott). The masterbedroom didn't have blackout curtains, but the thick shrubs shaded the windows nicely for late mornings. (On a side note, the thick shrubs only lasted two nights. For some reason they sent the lawn guy with a ladder and an electic trimmer to cut them down at 7:30 a.m. the second morning we were there. We spent the next three nights hanging every available towel in the room in the windows trying to block out the glaring parking lot lights!)", "helpfulness": 5, "user": "candgfun", "date": "May 5, 2006", "id": 5036704}, {"rating": 5.0, "stay_parameters": "Stayed July 2003", "text": "No matter, the kids hit the beach and we hit the deck chairs and that's when I started noticing the trash...everywhere. Pizza boxes, beer cans (and bottles), wrappers, all sorts of nasty stuff, old, moldy towels, abandoned shoes, and so on. I called the front desk to ask them what time of day they came by to clean the beach and they said that it was a, \"public beach\" and they weren't responsible for cleaning it. Funny how the beach in front of the Hotel Del Coronado is public too, and yet the Del manages to clean it anyhow. So, not wanting to spend the next four days looking at a gross trashy beach, we cleaned our section ourselves. I even picked up a maxipad! #^$^%#%@^%!!!! GROSS!!!! I must have used a whole bar of soap washing my hands (which was never replaced - I'm glad I snagged some from the Hyatt!!)!", "title": "Loved it", "helpfulness": 4, "user": "cw_123", "date": "May 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5026678}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 218, "average": 305, "very good": 552, "terrible": 205, "excellent": 862}, "aka": "Paradise Point Resort And Spa", "slim_ranking": 0.351851851852, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Tucked away on gentle Mission Bay, this luxurious 44-acre island resort features comfortable, California bungalow-style rooms amidst lush, tropical gardens and lagoons. Here at this AAA Four-Diamond San Diego hotel, you can explore one mile of beach, five swimming pools, and enjoy various amenities including tennis courts, an 18-hole putting course, beach cruisers, bonfire pits, and a private marina equipped with sailboats, jet skis, and kayaks. Dine at one of two waterfront venues, then relax and refresh at the plush spa with a treatment from Hawaii, Fiji, Thailand, or Bali. Secluded yet centrally located, the hotel is minutes from top attractions including SeaWorld, Old Town, the San Diego Zoo, and Gaslamp District."}