{"user_rating": 4.5, "review_count": 221, "name": "Paradise Cove Lodges", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "5 stars!", "title": "Great place to relax", "user": "mcmullig", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146173498}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The bungalows are right on the beach, ours came with our personal coconut tree through the porch. It all looks like those computer screen wallpapers: A white beach, water in shades of turquoise, and coconut trees. The atmosphere is very relaxed and casual, the watches usually come off after a few hours.", "title": "This is definitely Paradise!", "user": "landlocked_12", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146168919}, {"rating": 5.0, "title": "best place to stay on the island in this price category", "text": "The bungalows aren't huge but well designed and clean. They come with cooking facilities and a fridge. There is no AC but with the screened windows open, the sea breeze, and the ceiling fan, we slept well through the nights.", "user": "greentravelwriter", "date": "November 23, 2012", "id": 146038150}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The staff is very friendly and helpful (just like everyone on the island). Tere and his staff always have time for a chat and I learned a bit about life on the Cook Islands from them. I even learned how to peel a coconut from the husk.", "title": "Basic, good location but zero privacy", "helpfulness": 1, "user": "Jon W", "date": "November 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 145616450}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "There is an uninhabited island called Maina, and Tere has a house there that can be rented. It's a bit rustic and well worth it for the adventure to be alone on a tropical island ( I recommend Robinson Crusoe for reading :)", "title": "Home in Aitutaki", "user": "kiwi020", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144176896}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We stayed on Aitutaki most of our time in the Cook Islands...best decision we made the whole trip!", "title": "Cute bungalows, spectacular sunsets, beautiful beach!", "helpfulness": 1, "user": "Noracn22", "date": "February 11, 2013", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 151863597}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We had a great stay at this little secret gem on the island. Referred by another establishement which was full during the dates we needed, I will forever be grateful they sent us their way. Paradise Cove is quite, peaceful, locally owned (which is HUGE for us), friendly/helpful management, and it has the most amazing sunsets! By the end of our stay we had established somewhat of a community between all the guests in the other units, expect to do the same...it makes the adventure that much more fun.", "title": "Really a paradise", "user": "dsatosek", "date": "February 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151733782}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "It's definitely an island lifestyle here and everything moves a little slower and more laid back. Be ready for it when you get there or it'll drive you crazy.", "title": "Paradise in paradise", "user": "TAGSTERSydney", "date": "January 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149697408}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Management was great! They carted us to and from the airport, brought us leis and fresh drinking coconuts on arrival, pointed us in the right direction for food/water, even on Sunday when most things are closed, suggested great places to eat, etc. They were also helpful in connecting us to the best lagoon tour ever!", "title": "Great experience", "helpfulness": 1, "user": "abctrhg", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 148038370}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We attended the Wednesday night BBQ held on site with many people staying at other resorts throughout the island! Great way to meet people and great local food.", "title": "Perfect!", "user": "cmsrosa", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147960078}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Paradise Cove was the cheapest of the three beachfront bungalow accommodations we stayed in while in the Cooks, and at least half the cost of the other two. Being so cheap on a notoriously expensive island, we adjusted our expectations and only spent 4 nights there in case it was a disappointment. Well, it was absolutely lovely and not at all disappointing.", "title": "Great value for money", "helpfulness": 1, "user": "ChilliCat16", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158998460}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I spent a lot of time researching beachfront bungalows before we went and think that, for the price, you just can't beat Paradise Cove. Most other places you won't get change from $300 for a beachfront bungalow, but for $150 including breakfast on Aitutaki, you really can't beat this for value. I've bumped it from a 4 to a 5 rating based on the value for monty factor - the fact that it's the only place I could find where you can get a beachfront bungalow for this price, and on a nice beach.", "title": "So great! Sad to leave", "user": "Kaper13", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158528407}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The bungalows were smaller than others we stayed in, which you would expect at half the price, but were big enough for two people to comfortably spend four nights, with a good wee kitchen area with everything we needed and a decent sized bathroom.", "title": "Perfection", "user": "Bravedeew", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157144596}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The breakfast was fairly basic, but again, for the price it was more than adequate.", "title": "Amazing place", "user": "Deb m", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156481292}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The location was ideal, with a beautiful beach area, and several options for eating in walking distance, including the budget option Puffy's right next door and the more expensive Pacific Resort about 15 minutes walk down the road.", "title": "Friendly, perfect location, relaxed, affordable", "user": "Tracey M", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153743149}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Beautiful setting and super friendly hosts make this a perfect low key place to stay. You can even swim out front during high tide which is a bonus (at many places you can't). Great service and very clean- it is no frills and NOT a big touristy resort. The kitchen facilities are basic but have everything you need if you wish to cook meals at 'home'. We stayed there for 6 days on our honeymoon. You can rent a scooter on site, arrange any fishing or snorkeling tours on site and they have wifi. You can get to Ootu beach in 5 mins on a scooter for breath taking views, deep clear water and white sand. If you have a chance I would do the island night, its fun and the food is good. There is a good fish and chip place next door to grab takeaways one night too. Highly recommend! We will be going back next year.", "title": "Low key Island Paradise!", "helpfulness": 2, "user": "Trysomething", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147755846}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Paradise cove is a typical simple beach bungalow just a step from the water. Don't expect anything fancy or upmarket. But the price is great for what you get. Clean comfortable, but small rooms on a lovely beach close to some great place's to eat. Nothing is too far on the Island so hire a scooter and go check out other parts of the Island. This is a good base.", "title": "Very tropical", "user": "Tracey G", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147593555}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This place is awsome !!! Stunning location right on the beach with stunning sunsets. The rooms are clean and comfortable. I would hight recomend a beach front room, for the view and just for relaxing on the balcony looking out over the ocean. All the staff go above and beyond, Tere even showed me how to de-husk a coconut.", "title": "Island Paradise", "user": "scouser27", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147146555}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "They can sort fishing, lagoon cruises, bike hire, moped hire and everything else at the drop of a hat. The island night there is great fun and the food was amazing. I also loved how proud all the staff are about there culture and there island.", "title": "Paradiso!", "user": "Nina K", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146401788}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I would stay again and again and again if it wernt so far away from the UK. This is a great place to stay for all travelers. I would highly recomend it as I do every week to all my clients (travel consultant).", "title": "Cool little place if you can overlook a few things", "helpfulness": 1, "user": "DasBinky", "date": "November 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 146322406}], "location": {"country": "Cook Islands", "continent": "South Pacific"}, "stars": 2, "variance": {"poor": 5, "average": 15, "very good": 67, "terrible": 13, "excellent": 121}, "aka": "Paradise Cove Hotel", "slim_ranking": 0.166666666667, "description": "Paradise Cove is located on one of the best sandy beaches on the island of Aitutaki, Cook Islands, with great swimming and snorkeling areas. Paradise Cove is locally owned and operated by the people of Aitutaki. We offer self-catering bungalows right on the beach. Our philosophy is to share our beautiful culture and unique island with visitors from all over the world. We have 10 Beachfront Bungalows right on the beach for singles or double/twin travelers and 2 Garden Suites (just right behind the beachfront bungalows) suitable for families of 4 persons. From the balcony of your private beachfront studio take in the magnificent lagoon scenery. In the evenings relax as the sun sets, giving you the most breathtaking scene in Aitutaki. Experience great hospitality at Paradise Cove with warm and friendly staff that will enhance your stay on the island of Aitutaki. See the whales in all their splendor going past the reef of Paradise Cove Lodges from your balcony during whale season. Meet Terepai Junior (the owner) for some fishing or snorkeling excursions.Every Wednesdays is 'Buffet Night' of delicious local food for $29 NZD per person."}