{"user_rating": 4.5, "review_count": 1782, "name": "Paradisus Playa del Carmen La Perla", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Dates: 10-17 December 2012", "title": "Nice new and modern resort with need for food improvements!", "user": "pelun", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148572804}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Webb: paradisuslaperla.com", "title": "Royal Service Highly Recommended", "user": "Elizabeth E", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148563105}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Wifi: Free of charge and good working.", "title": "Attention To Detail Required Food Poisoning Contracted At Pool BBQ Stand", "user": "Ali B", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 148551335}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Style: All inclusive luxury adult-only modern design resort.", "title": "Great Place!!!", "helpfulness": 1, "user": "GenS_13", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148545866}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Situation: By the sea, close to Playa del Carmen (10 minutes with taxi).", "title": "Paradisus La Perla Plops", "user": "teamhunterms", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 148534320}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I stayed at the Paradisus La Perla from December 11th thru December 19th of 2012.", "title": "The Best AI resort we have stayed in!!!", "user": "BeatriceL", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148088543}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The service, the quality of the food and the all around vibe of this resort is top notch! We booked a junior suite but were upgraded due to some kind of plumbing issue with the unit below us. Since it was our 10th wedding anniversary they did not want to inconvenience us by having workers coming into our room all day so they upgraded us for the rest of our stay. We were given a swim up room and it was beyond amazing! Now, please keep in mind that even if we had stayed in our junior suite for the entire stay my review would have been the same. In my opinion there is no bad room in the resort!!! The upgrade was just a lovely and very considerate gesture on the part of guest service, special thanks to Julia and Francisco.", "title": "Luis Marcelo", "user": "Kimberly M", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148041484}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "We ate at every restaurant but Passions. Food is one of those that is truly subjective, if you do not like seafood you may not enjoy 1 of the restaurants that have a seafood heavy menu or if you are not a carnivore you may want to skip The Market which is there rodizo restaurant where meats reign supreme. **My tip is to go by each of the restaurants and check out their menus which are always posted outside the doors.", "title": "Great Vacation!!", "user": "floydtrane", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148029014}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We only experienced bad service one evening out of 7, at Mole where we had the worst service I have ever experienced while dining out. The waitress spoke almost no English and seemed to have no server experience at all, now this is NOT acceptable for a resort of this caliber at dinner. She should have worked the buffets until she had a better grasp on being a good server and picking up a little more English. When we finally got our entrees my husband like the steak (small portion) so much he asked for another one, the waitress looked at him slightly confused and came back with the Chef. It seems she thought my husband was complaining about the steak so we had to uncomfortably explain to the Chef that it was delicious and my husband was actually asking for a second helping of the steak. It took almost 3 hours to have a 3-course meal in a restaurant that was only 40% full. Other than that horrible and inexcusable experience on our anniversary no less, every other server was beyond reproach, from the staff at the Sunset Grill (outdoor pool area), the bars, buffets to restaurants themselves. I consider our one bad dining experience as nothing more than a fluke in an otherwise stellar 7 days!", "title": "The best hotel we have ever been to in my life", "user": "Rossgonza", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148011581}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I knew the beach would not be wide which is fine but the loungers are really jammed in very close together so you better like your beach neighbors as you are inches from them. The resort cannot help nor should it be held against them that there are rocks and boulders in the water as this is NOT a man made beach. There is however a beautiful spot on the edge of the bay toward your left (see picture!!). That you can lay down a towel and go for a swim in the crystal clear turquoise water!", "title": "Almost excellent", "user": "Vik83", "date": "December 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147975054}, {"rating": 4.0, "title": "Beautiful resort, good food, friendly staff", "text": "Stayed here for 3 nights before visiting another highly rated resort, and was very sad to leave almost wished we stayed longer at La Perla. We arrived for checkin and were greeted with a cold towel and welcome drink. there was a bit of a wait as the checkin process is quite lengthy but we didn't mind too much, gave us a chance to take in the beautifully designed lobby. Our room was not ready but a concierge reviewed the various restaurants and activities in the meantime. So far so good!", "helpfulness": 1, "user": "jellyfish506", "date": "December 28, 2012", "id": 148203145}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Since we were celebrating an anniversary they were so kind and gave us an ocean view room which was spectacular and made our stay special. Room was clean, modern, especially loved the comfortable beds and dual showers! Housekeeping service was thorough and timely, but never intrusive,", "title": "Delivered on expectations", "helpfulness": 2, "user": "taknev24", "date": "December 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148171547}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Pool area was beautiful, ample loungers and a couple of palapas which I suggest you wake up early to get. Water was chilly, but we still went in and enjoyed the swim up bar. Service by the pool was great. We also used the gym which was good enough, but maybe could use a few more machines. Enjoyed the nightly entertainment, though La Perla lacks a large stage/theater area so it felt a big cramped.", "title": "Best all inclusive in my life", "user": "Mfernanda00", "date": "December 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148158510}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Overall food was very good with a few misses. Did not especially like the need for reservations, but had no problems. We had dinner at Fuego, Mole, and La palapa. Recommend the various ceviches and veal chop at fuego, the seafood stew appetizer at mole, and scallops or duck appetizer and steak at la palapa. Not sure if there was a language issue, but service at Mole was the worst we encountered. For lunch, we surprising really enjoyed Naos - definitely not your typical buffet! Desserts in general were not great. For an AI, the food was pretty good, but could be even better and then would make this a 5 star resort!", "title": "Everything you need", "user": "whagwarning", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148141505}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The beach was nice, not the best we've seen in our travels in Mexico and the Caribbean. Luckily we were more than happy relaxing by the pool and other lovely common areas throughout the resort. We are so glad we got to experience La Perla, a bit of paradise in Mexico!", "title": "Royal Service: Hit or Miss", "helpfulness": 3, "user": "BonoAJ", "date": "December 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148090330}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I enjoyed the modern look of this hotel. It is all about texture and looks like a Hotel out of a Crate and Barrel or PotteryBarn Catalog. The food was mediocre, but the staff was fantastic! I found my favorite staff in no time and would like to recognize them both...First was Daniel from the South Bar. He made me my morning coffee, every day, and was always pleasant and friendly...full of conversation. I enjoyed the company of another South Bar employee, named Guillermo Delcarpio...also very friendly. These two made it feel like home. Thank you!!!!", "title": "December 2012", "user": "tu_pdx", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 148459076}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My favorite restaurant was the sushi bar, but my favorite restaurant employee can be found in, Naos. His name is Juan Reyes, and he is the type of guy who just makes you smile. He has an enormous smile on his face, all the time, and is such a friendly guy. I'm smiling now, just as I think of him!!", "title": "Not really impressed", "helpfulness": 1, "user": "Melawell", "date": "December 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 148442081}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The Hotel has gorgeous rooms, amazing entertainment and plenty of friendly staff. The down side is that the beach area is very small, almost non-existant. If you don't mind the pool, or venturing out on excursions, to get in beach time...this is a fabulous resort.", "title": "A great resort, but with some misses", "helpfulness": 1, "user": "Pibba", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 148388183}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Spent 5 days here in December. As everyone says, the resort is beautiful, modern, and eclectic - which I love, but it lent a cold, detached air to the whole place which felt strange to me for Mexico. The food was fine, but nothing was really overly impressive. The service was fine, but Ive never experienced bad service in Mexico ever. Saying it was over the top great would be a huge overstatement -- it just is what it is. The beach was rocky and very disappointing. The volleyball court was tiny and when the ball went into the water, there was no choice but to wait for it to float back, because the rocks were so bad you couldn't go in after it. Walking down the beach in either direction was nice, especially going toward town. There was a funky little beach bar that was nice to visit in the afternoons just as you were getting into town on the beach called Canibal Royale. Take a chance and go visit it!", "title": "Wowed by the Food and Service", "helpfulness": 1, "user": "Cheeseheads", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148274068}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The pool area was nice but the water was really cold, and other than the daily water aerobics, nothing much happened there. I've read reviews that talked about the pool party on Saturdays, and this is what happens: dancers come out. Dance a few numbers. The activity staff puts a huge float in the pool. Staff and drunks climb up on it and push each other off of it. That's it. While I'm discussing the pool, I must mention that the practice of saving lounge chairs and beds was the worst here that I've ever witnessed. There was nowhere that wasn't saved by 9 or 10AM. I've also never stayed at resort that didn't have a drink menu at the pool. Less work for the bartenders? The really need to have a few signature drinks by the pool.", "title": "5* Plus", "helpfulness": 1, "user": "Alan11855", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148248011}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 25, "average": 106, "very good": 296, "terrible": 22, "excellent": 1333}, "aka": "Paradisus Playa Del Carmen La Perla Hotel Playa Del Carmen", "slim_ranking": 0.030612244898, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Located in a spectacular tiny bay, the Paradisus Playa del Carmen La Perla is a hotel for adults only, and one of the most luxurious hotels in Riviera Maya. Combining a prestigious Caribbean setting with world-class facilities, including Royal Service, the ultimate in spa treatments, a relaxed ambience, and flexible meeting spaces with state-of-the-art equipment. This elegant resort has a Mayan ecological feeling, and an oceanfront location surrounded by a lush tropical mangrove preserve and with views of Cozumel Island. Take your senses on a culinary tour through eleven remarkable restaurants serving delicious cuisine from all around the world and ten bars serving unlimited international Premium brand drinks. Enjoy life-enriching experiences such as tango dance classes, sushi-making, and sensorial experiences.This luxury All-Inclusive Adults Only Resort is located 45 minutes from Cancun International Airport very near the magnificent beaches and attractions such as the Playa del Carmen 5th Avenue, Xcaret, Akumal and Xel-Ha."}