{"user_rating": 4.5, "review_count": 333, "name": "Parador de Carmona", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed here two nights mid november, very comfortable room with stunning view over the plain at sunrise and sunset . Food excellent, easy to overindulge with dinner dessert buffet! Staff all very pleasant and efficient.Overall a 5 star wonderful stay.", "title": "amazing views", "user": "John e", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146200748}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "Enough has been said here about the wonderful hilltop location, the beautiful garden, the wide view across the plains, the stern castle-like building, and the charming historic towncentre of Carmona itself. But....the hotel itself oozes a certain middle-class atmosphere. Is it the fact that the hotel is apparently in use by travelling parties and company-meetings? Is it that the staff at breakfast, dinner and bar seems a bit uninterested and tired? Is it the smallish rooms, with bathrooms that need a spot of modernising, and the tired furniture? Is it the fact that you indeed do hear a lot of the doings of your neigbours. Is it the narrowish beds?", "title": "Location is not all", "helpfulness": 4, "user": "meijerr", "date": "November 22, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 145982127}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Being a Parador means that standards of upkeep, food and the like are good. Being a Parador in Carmona also means a stay in style, with a Moorish patio plus fountain, with huge dining and sitting rooms and high ceilings, and an atmosphere of good old chivalric times. But....as a hotel it could be even better.", "title": "Amazing building, great views, nothing much in the town though!", "user": "mky337", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 145635745}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The building, lounges, courtyard, views & grounds are amazing. The room was comfortable although soundproofing seemed to be an issue, we think from someone walking in heels upstairs! There also seemed to be an issue with flies and local dogs barking. We chose not to eat at the restaurant but tried to find somewhere in town.. which proved fruitless after 9.30pm and so we ended up with peanuts for dinner! Glad we were only here a night and if you are considering it as an alternative to staying in Seville, I would seriously think again.", "title": "Awesome.", "user": "Worldstar44", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145042324}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Wow! Wow!Wow!. The Parador at Carmona is a Palace and the word Grand does not do it justice. It's magnificent. It's perched on top of hill but think small mountain with breathtaking views across the plains. Just imagine sitting on the terrace, the top of the world, enjoying a cold Cava, and soaking up the sun. Wander around the cool interiors. Wonder at the magic of the moorish courtyard with a fountain gently setting the mood. Enjoy dinner in the wonderful restaurant with stunning views. We had a magnificent room on the same floor as reception. Absolutely brilliant, and again, those fantastic views. Lovely staff, super welcome. It was wonderful.", "title": "Somewhat remote but dramatic setting", "helpfulness": 2, "user": "EmmaWines", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144423332}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This was our first stay in one of the Parador hotels in Spain, but we sure enjoyed it!", "title": "You feel like a king in your castle!", "user": "OstendTraveller", "date": "November 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144386852}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I must admit that prices are above average (not to say expensive) and that service isn't always up to the same standard, but the location, the scenery and the fine food make it worth a while.", "title": "Paradise Lost?", "user": "James205", "date": "October 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143696117}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The room was very spacious and well maintained, but the bathroom started to show some 'wear and tear'.", "title": "Beautiful (not just the view)", "user": "KHPL", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143523183}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Breakfast was abundant and the 'afternoon tea' on the outside or inside terrace made you feel 'royal'.", "title": "Unbelievable views", "user": "FionnSE", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143016615}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "A pity that the swimming pool was already closed at this time a year (end of October) although the weather was still very nice.", "title": "What a fantastic experience- go, you won't regret it", "user": "Alexandra D", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143000676}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There is nothing better after a day exploring the surrounding towns and the city of Seville, than to climb up through the lovely town of Carmona to the Parador de Carmona and surround yourself with peace and luxury. A stroll to the pool for a refreshing swim or an afternoon spent on the terrace with a cool drink are the perfect ways to end your day and begin your evening. The staff are excellent and the beautifully restored buildings are delightful. Well worth a stay but not particularly child-oriented. There is a childrens pool but little else to amuse youngsters on-site.", "title": "An oasis of calm and luxury.", "user": "Sue O", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142677651}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "My husband and I stopped off here with our friends for a drink at the end of a long uphill walking tour around the town. It was an oasis of calm with stunning views out over the surrounding counytrside. I have no idea how much it might cost to stay here, but if you can afford it then it might be worth checking out. We just had beer and soft drinks.", "title": "Stop off for drinks on our visit to Carmona", "user": "Jillian M", "date": "October 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0}, "id": 142505874}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We drove up to Carmona from Malaga for our silver wedding anniversary over the August bank holiday. The plan was to stay in the Parador for two nights and go into Seville on the day in between. We never made it to Seville. Carmona is so beautiful and really interesting and the Parador was so restful. Even though we'd booked on a real bargain offer we had a most opulent room and well designed bathroom. The wooden shutters were beautiful onto a lovely little balcony with far-reaching views. The room was fully remade each day and the aircon was very good. We didn't eat in the Parador at all - not even breakfast- as the places to eat in Carmona were so good, both in respect of food and atmosphere. Did have a drink in the hotel bar and that was very reasonably priced for a hotel bar. All of the staff were very pleasant and helpful. It was all absolutely perfect but I wouldn't want to go back because I'd be so disappointed if it wasn't that good again.", "title": "Good for the soul", "helpfulness": 1, "user": "CostaCab", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142421108}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was our third and final parador stay (family of five travelling from Madrid to Marbella), and it has to be said, that each one got progressively better! Perched high above the Sevillan plains on the edge of the picturesque town of Carmona, this was the most impressive architecturally of the three paradors and we loved it from the minute of our arrival. Much of the exterior of the building dates from the 14th century when it was originally an Arab fortress and evidence of this parador's Moorish antecedents are everywhere albeit the building has been completely modernized throughout. The communal areas are simply fabulous - dramatic red wall coverings in one reception room, internal courtyard with mosaic tiles and fountains, high ceilings throughout and a pretty terrace overlooking the pool area for relaxing and having a pre or post-prandial drink. What more could one ask for? Some reviewers have criticised the fact that the pool area is quite distant from the main hotel and certainly, you have to negotiate several flights of steps in order to reach the pool, however, these are wooden steps, they are gently graduated and caused us no bother (obviously people with serious physical disabilities would find this an issue and the parador doesn't appear to have any faciities to address this). Once you're down at the pool, it's great. The sunloungers are cleverly set out in such a way as to enable sunbathers to avail themselves of sol y sombra throughout the day - the beds are positioned under a fixed stone-built canopied structure. The pool is great and even though it became very busy during late afternoon, it never felt too crowded. We ate in the parador one night and it was the best meal that we had had during our five-night parador odyssey. The service was a bit perfunctory but we had come to expect that - Spanish standards of service leave a lot to be desired. We didn't eat breakfast on either morning as the first morning we were away at the crack of dawn for a day's sightseeing in Seville (avoid Seville in August at all costs if you can - never again, it's way too hot. We got out when the mercury hit 40 degrees - sightseeing becomes too hard core at that point!). Anyway, back to the Parador. It's a spectacular building, our rooms were lovely and the views over the plains were wonderful. Don't pay any attention to those negative comments about the farm animals disrupting people's sleep - you're in the middle of the country. What do you expect? The only downside on the first night was that I was woken up in the early hours (actually it was probably around 4 or 5 am by some noise overhead. I thought it might be an over-active air conditioning unit or maybe somebody cleaning the terrace which was directly overhead.) Anyway, this was the only nit that I could pick - the second night was fine. It is my intention to go back again to Carmona and stay in the parador during more temperate weather - again, walking around in the high 30s is not very pleasant. This is a wonderful place to stay - very romantic, but even our cynical, hard to please teenagers thought it was great. All in all, the highlight of our trip!", "title": "A fairytale facade and equally impressive interior", "user": "supercritical", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 142387174}, {"rating": 4.0, "title": "Good but not Great", "text": "A beautiful hotel, with an excellent pool and views across the Spanish countryside. We found the food overpriced for the quality of food delivered and the waiting staff were average; not five star. Carmona is a beautiful sleepy town with a fair bit to see and you can get a bus into Serville with relative ease. We found a resturant about 400 meters from the hotel gate - just walk straight as you walk out of the hotel gate keeping the great views on your left hand side.", "user": "Mark S", "date": "October 8, 2012", "id": 142326727}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Once in Carmona, you cannot miss the Parador but there is no way round the narrow lanes of the beautiful town of Carmona. Always take to road upwards and the only place you can get to is the Parador (that is also well signposted). Once there, you can really drive through the old gateway, as inside there is a spacious parking. Reception was friendly and helped move the baggage to the room. We had a room on the top floor with a balcony facing south which had a magnificent view of the plains. The room was actually standard and not as lush as some of the photos in the website suggest. Everything was in good order, including the air conditioning., beds comfortable. But the real charm of the hotel we found at the various castle halls that appear to be reconstructed, salons and the beautiful patio with the famous fountain. Breakfast was excellent and very good service attendance. Dinner also recommended. Smoking is possible on the terrace at the bar, or in the patio. We enjoyed the stay and would return again if in Carmona or nearby. By the way, there is a bus from Carmona to centre of Seville that runs each hour for EUR 2.70 only, bus stop a 1 km walk from the hotel.", "title": "On the top of the hill, magnificent view", "helpfulness": 3, "user": "Frequentvoyager", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151909381}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Really enjoyed our one-night stay at the Parador de Carmona, about an hour outside of Seville, Spain. Our family had an easy check in, reasonably comfortable beds and a nice room looking down the hillside, with a good amount of space in the room (unfortunately we couldn't get a room with a balcony needing two beds). Coming into the hotel via car service was exciting; one felt like he or she was being transported back in time, entering the stone-walled courtyard through a narrow pass.", "title": "Historic castle with some modern upgrades; great for family", "helpfulness": 1, "user": "ladodgerone", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150978335}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The pool was refreshing on a hot summer day (though it took a while to get down the hill to it) and though it didn't have a big menu at the adjacent pool cafe, it was suitable.", "title": "A Piece of Heaven", "helpfulness": 1, "user": "Meiz", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149851775}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Easy walk into the old city where we had a splendid meal at a small bar off one of the city squares. Wifi had good reception in the room, but not so good by the pool.", "title": "Great place to stay", "helpfulness": 1, "user": "ek6347", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148603594}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Dining at the Parador was comfortable and above average for dinner (though hearty with slabs of meat) and pretty good for breakfast (full buffet). Evenings were quiet.", "title": "Lovely place to stay.", "helpfulness": 2, "user": "CalifJ0e", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146496281}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 27, "very good": 108, "terrible": 7, "excellent": 182}, "aka": "Parador De Carmona Hotel", "slim_ranking": 0.125}