{"user_rating": 4.0, "review_count": 3607, "name": "Paradisus Punta Cana", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I will try to make this review sound different then all of the rest that have been written, by I find myself agreeing with so many of the positive things people said about the resort that it is hard to deviate from the most obvious comments.", "title": "A stunning resort", "helpfulness": 27, "user": "kg61083", "date": "May 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5145336}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Let me say that not enough can be said of the beauty of the resort. Everything is stunning (see title.) The beach is just plain amazing. Water, sand, palm trees, palapa huts, tanning beds, ocean breeze, beach bar, etc. The list goes on. I spent most of my week on the beach and never got used to the beauty of it.", "title": "Best place in Punta Cana", "helpfulness": 12, "user": "DCSnt", "date": "May 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5143762}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Pool, also amazing. Great pool bar, very large, volleyball games and boozing in the afternoons...alcohol and swimming...always a good combination.", "title": "A great vacation!", "helpfulness": 7, "user": "divainny", "date": "May 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5077456}, {"rating": 5.0, "title": "This a great place!", "text": "Restaurants were great for dinner! Breakfast and lunches were really nothing to brag about in my opinion, but my girlfriend and I were very impressed with all of the restaurants for dinner. I think our favorite was the Brazilan \"Rodizio\", very delicious meats. French was nice and fancy, Italian good--good for lunch as well and pizza everyday for a late afternoon snack, Japanese was good for all-inclusive standards, mexican was your typical mexican food--can't really mess that up too much, seafood- great grilled lobster...seriously an all-inclusive that serves lobster? I don't want to read anymore poor comments about the food...crazy people.", "helpfulness": 20, "user": "Daisysmama", "date": "May 12, 2006", "id": 5064983}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "Side note, I did not get sick from the food, but by weeks end my girlfriend did. I took acidophilius pills and pepto while I was down there...not sure if it helped, but it didn't hurt. Look into it.", "title": "Nice but wouldn't go back", "helpfulness": 8, "user": "dewybch", "date": "May 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5049540}, {"rating": 2.0, "title": "Don't go during spring break", "text": "I hate whiny reviews, but as I use this website alot for vacation planning, I feel obliged to share our experience. Our family went to the Paradisus during spring break and our experience was pretty mixed. The resort was way overcrowded that week, but Americans seemed to be the minority, so I'm not sure how much of this was due to spring break. It was difficult to get into restaurants that you wanted. There were alot of scenes of very upset people unable to get into restaurants. We kept the same grimy beach towels the whole week because every time we went to exchange them, the hotel was out of beach towels. We had arranged through the hotel to have someone pick us up at the airport and no one came and the hotel had no explanation why and no records of who even was supposed to pick us up. Our room had an adjoining door to the room next door and when the guy next door was on the phone, it sounded like someone was in our room. My husband had fairly bad stomach trouble for over week during and after our trip. Though the beach was beautiful, and I thought the food and service in the restaurants was pretty good, I wouldn't go back. We went to the RIU Negril in Jamaica last spring break and had a much better experience for much less money.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5013440}, {"rating": 2.0, "title": "Paradise Lost", "text": "Review", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4998238}, {"rating": 1.0, "title": "Believe the poor reviews!", "text": "Let me start by saying that this review will be fair and was done without any bias based on our experience. My wife and I travel frequently and have a fair amount of international travel under our belts. I hope that this and the other review will help you when trying to chose a resort.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4994698}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The resort is stunning and is truly paradise. This was our first trip to the Dominican and we would return to the island again in the future. The resort was very well manicured and the staff truly strives to make the guests feel at home when they have the opportunity. They take pride in their resort.", "title": "Fantasy Island", "helpfulness": 25, "user": "Etcglc", "date": "April 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4983908}, {"rating": 5.0, "title": "The Most Perfect Vacation!", "text": "That being said I think we just chose the wrong week for our trip. I would not recommend the week of Spring Break (April 17 – 22) for your stay. This was the week following Easter and the resort was full or over capacity. The other resorts surrounding Paradisus did not appear to be as full as this based on our walks on the beach.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "April 11, 2006", "id": 4964087}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The staff was wonderful, friendly, and oh so helpful.", "title": "Birthday Vacation", "helpfulness": 1, "user": "Travel-n-Buppie", "date": "August 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 18788909}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Although not allowed I tipped the staff and I did receive the \"royal service\".", "title": "Paradisus Reserves TOP NOTCHED", "helpfulness": 1, "user": "explorer127", "date": "August 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18557570, "likes": {"liked": "— pool, beach, bar, all inclusive"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The lobby and beach were beautiful", "title": "An amazing honeymoon", "helpfulness": 3, "user": "Taithediva", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18439594, "likes": {"liked": "— The beach, the service and our amazing view of the beach", "disliked": "— The air conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "There was construction when I visitied.", "title": "July 23-28, Paradisus Punta Cana DR", "helpfulness": 6, "user": "FloridaMG", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18432445, "likes": {"liked": "— Very new facilities. Clean, well maintained. Pool. Staff.", "disliked": "— No elevators. Ups and downs in food quality. Some restaurants had no air conditioning."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "There is always the beach and the activites were not available because of the weather. Other than the beach the activites are limited. So it was more of a realxing vacation as opposed to an adventurous one.", "title": "Wonderfully relaxing!", "helpfulness": 2, "user": "Magnolia48", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 18392755, "likes": {"liked": "— Beautiful beach and water", "disliked": "— Lack of beachside service"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Booked Paradisus Punta for nine nights in a row, expecting deluxe accommodations, service and food. Found none of the above.", "title": "Not luxury service", "helpfulness": 2, "user": "muchomundo", "date": "August 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 19488825, "likes": {"liked": "— The beach", "disliked": "— Service at the restaurants"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Room.- Stayed in the regular part of the resort (not The Reserve or Royal Service). Rooms need urgent renovation, time and use shows in the furniture. TV was not flat or widescreen. Mini bar did not work (staff changed it for another one, which did not work either). A/C was a little noisy. Bathroom was weared off. The room was clean, no bad odors; however not what you expect from a supposed to be a luxury resort.", "title": "Treated Like Second Class Citizen", "helpfulness": 5, "user": "DJG8", "date": "August 28, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 19463347, "likes": {"liked": "— The beach"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Food.- If you are looking for a high end meal you will not find it here, neither in the buffets nor in the reservation restaurants. Been in all the restaurants of the resort, probably Vento is the best of all (which does not mean we were fully satisfied with the meal or the service). Fuego was a beautiful location, however the fish was not fresh, it was pretty obvious it had been frozen several days before it was served. Same with the lobster of the Marino Restaurant. Japanese restaurant was below average, makis were absolutely disgraceful; tepanyaki was just ok, not any fancier than your local Benihana. Buffets were Ok, a bit repetitive though. Probably the best places to eat were the Italian restaurant (which needed no reservation), the pizza was quite good; and the chinese restaurant.", "title": "Loved it. Would definitely recommend! (detailed review)", "helpfulness": 9, "user": "bedhead57g", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19332977}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "In a nutshell if you are used to crisp vegetables, fresh seafood and innovative cuisine, go somewere else!", "title": "Paradisus is GREAT - would go again", "helpfulness": 2, "user": "Britindavie", "date": "August 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 19088335, "likes": {"liked": "— Cleanliness and decor"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Service.- Below average. Waiters are rude and not very attentive. It can take several minutes for one of them to approah your table with the menu and some more minutes to come back and ask for your drinks order, and so on. You might have to wait several minutes between your entree and the main dish. The same with drinks. Since the hotel is huge and there are many restaurants, tipping will not help because it is unlikely that the waiter will see you again, so no incentives for a proper service.", "title": "Relaxing, Fun, Great for kids. Read helpful hints for a better stay.", "helpfulness": 2, "user": "Miley2007", "date": "August 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19047092, "likes": {"liked": "— Beach. Food. Kids club. Fitness room. Friendly staff. Facility well-maintained.", "disliked": "— HOT. Rooms are dated, a bit musty."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I just got back from the paradisus punta cana with my family, and we really enjoyed our stay, and would have enjoyed it even more if not for a little error before we left: we were booked at the new paradisus palma real but they overbooked themselves and we had to go to the older paradisus punta cana. If not for the mindset that we could be at a better hotel right now, the trip would have been great, and it still was very good. Apparently, people got bumped out of the Paradisus Punta Cana also. Anyway, here is an overview of the hotel:", "title": "Great Hotel! Great pool!", "helpfulness": 13, "user": "ryschny", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6573378, "likes": {"liked": "— Pool, dinner selection", "disliked": "— Rooms"}}, {"rating": 4.0, "title": "Open mind, open review", "text": "POOL/BEACH: The pool was absoloutely fantastic...it wasnt heated but the air kept it warm all the time...it was very refreshing. All the cot's were seperated into little groups, so your family could have their own little private area, royal service or not. The bars were convineintly located also. There were also little huts all around the pool to give shade to whoever wanted it. The beach was also outstanding. The sand was unbelievable and the ocean was very nice. The waves were perfect for people to go boogy boarding or windsurfing! The one flaw about the beach was that it was very crowded, as it was filled with cot's, and didnt have its own little family areas like the pool.", "helpfulness": 7, "user": "been-there-seen-it69", "date": "January 9, 2007", "id": 6568222}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "ROOMS: The rooms at the hotel were average...not great, just average. The beds are fine and the chez lounge was quite comfortable for relaxing. The TV got terrible reception and only 2 or 3 channels were in english. Not a good trip for TV watching. The mini bar in my room turned on and off by itself at times, so you never knew if you were going to get a warm drink or a cold drink. The airconditioner in my room leaked for the first couple of days and we could not control the temperature..there was a huge puddle in my hallway and my room was freezing all trip. Also, there is no door to the bathroom, just a shutter, so privacy is limited.", "title": "Paradise at Paradisus", "helpfulness": 4, "user": "JARAN", "date": "January 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6566848, "likes": {"liked": "— beautiful grounds", "disliked": "— bring cash"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "RESTAURANTS/FOOD: The food was mostly good throughout the trip. The selection at breakfast and lunch was limited and the exact same thing every day. I got tired of having the same thing and ended up going to the 24 hour pizza place (also the italian restaurant) and getting pizza for lunch. There was a huge selection and huge variety for dinner. I thought the steak restaurant was by far the best! it had amazing sirloin and tenderloin. the buffet was the same every night but had some outstanding chicken wings. Also, the italian restaurant was great, especially the pasta and the pizza, (but dont over do it on the pizza or you will get tired of it). I didnt go to the chinese, french or seafood restaurant. The japanese restaurant was very nice, and the meat was very good. The give you a variety of sushi, which is not very good. The mexican and brazillian are also very good, and much higher than my expectations..they offer several kinds of meat for you to chose from and are pretty good. Overall, breakfast and lunch wasnt so great, but you made up for the empty stomach with an outstanding diner. Note also that the only two restaurants that require reservations are the japanesse and the french.", "title": "Almost a perfect place!!", "helpfulness": 16, "user": "cindymkali", "date": "January 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6562283, "likes": {"liked": "— Food, beach, pool, rooms were all great!", "disliked": "— Lack of activites for young adults"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "RESORT FACILITIES: The resort was very nice, with tons of nature mixed in. There are ponds containing various wildlife, including flamingos, which were really cool. The resort is huge, and there is a tram that takes you were you want to go. When it passes your destination (i.e. your room) you just say \"gracias\" so the driver can hear you and he will stop for you. The tennis courts were clay, and pretty good, although very hot. You should reserve your courts around 5-6 at night, so it isnt as hot. The provide you with some tennis racquets and balls, although they are not very good.", "title": "Fabulous beach and fabulous time!", "helpfulness": 17, "user": "TerriOmaha", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6520575, "likes": {"liked": "— The friendly staff", "disliked": "— The hours that the restaurants were open"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "CHECK IN:", "title": "Great place to stay", "helpfulness": 4, "user": "level300", "date": "July 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8242792, "likes": {"liked": "— Staff", "disliked": "— can't drink the water"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Checking in seemed to be the only exception to an otherwise outstanding and memorable stay.", "title": "TRUE PARADISE", "helpfulness": 2, "user": "jamrt12", "date": "July 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8229622, "likes": {"liked": "— The Beach"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "It seems that there are set times to check in (posted via sign) as opposed to U.S. hotels where you can check in any time. We did have to wait for our room even though we checked in past the time for check in so the rooms should have been ready. No worries as we were on vacation :). We tried not to worry about waiting around and if TSA has not detained our luggage (we thought it was lost, sent to our room later) we wouldn't have cared. Onward...", "title": "Great place for a honeymoon!!", "helpfulness": 5, "user": "lotlady", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8224438, "likes": {"liked": "— The beach with that powdery sand and aquablue water", "disliked": "— The resort is huge and there is a lot of walking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "GROUNDS:", "title": "Unbelievable experience!!", "helpfulness": 6, "user": "CaribbeanQueen8", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8223313, "likes": {"liked": "— Beautiful grounds", "disliked": "— going home"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Very well appointed, clean and neat. The property was well groomed. The main building (check in) is set appart from the bungalows and beach. So you can either walk or take the shuttle tram. Peds and trams/cars shared the same pathway. This was a little bit annoying. We never felt threatened or unsafe but it would have been nice to have our own sidewalk. We liked to walk to work off all that food and drink :)", "title": "Tranquil, relaxing and gorgeous", "helpfulness": 6, "user": "italianoJersey", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 5.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8210467}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed at the Paradisus Hotel this past month. I have to say that the hotel was definitely a 5 star hotel. The food was amazing, the people and service were excellent,very friendly and the place was extremelly clean. I'm surprised to see all these reviews about people getting sick in general in Punta Cana. Bear in mind that these Hotels are \"all inclusive resorts\" that means \"all you can drink\" ...so yes, if you are boozing 24/7 you will get sick!!! This is common sense guys!", "title": "Great Hotel, Great Food, Great Parties!!", "helpfulness": 8, "user": "Tony49", "date": "February 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6788527, "likes": {"liked": "— Hotel surroundings", "disliked": "— Food was good but can improve"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007", "text": "The pool was great, huge pool! surrounded by trees which was great because you could stay in the shadow if you liked.", "title": "Ehhhh...", "helpfulness": 4, "user": "Moe19", "date": "February 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 1.0}, "id": 6783315, "likes": {"liked": "— Pool/Beach", "disliked": "— Size..HUGE!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The beach was amazing, never seen such blue acqua color anywhere else, and I have to say that we have traveled to Mexico, Costa Rica, and Mediterranean sea, and never seen such a clean and and beautifull beach. The best was the beach bar, Gabi Lounge, the beds on the beach, amazing place, relaxing great ambiance music. The bartenders were super friendly!", "title": "Great Bartenders Lousy Service Otherwise", "helpfulness": 4, "user": "salpal71", "date": "February 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6775506, "likes": {"liked": "— Beach, pool, bartenders", "disliked": "— Service was awful"}}, {"rating": 4.0, "title": "A Great Winter Holiday Spot - End of Jan 07", "text": "We stayed near the beach and yes, we had to wait for a bus or hotel troly to take us to the lobby. The hotel is huge and some things are spread out. We figured that since we were vegging out all week, it wouldn't hurt to walk 5 minutes to the lobby as suppose as taking the bus. This didn't bother us so much as we like to be active even during our vacation. The water sports were great, all incleded in the Hotel package.", "helpfulness": 12, "user": "TennisGuy27", "date": "February 5, 2007", "id": 6746566}, {"rating": 5.0, "title": "The place to stay in Punta Cana", "text": "definetly we'll go back to Punta Cana and definetly will stay at Hotel Paradisus.", "helpfulness": 6, "user": "TravelfanRichmond", "date": "February 5, 2007", "id": 6745512}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Just returned on Sunday 04/30/06. My husband and I are 50 and 51 and have been to all carib islands. This was a first time in PC. Upon arriving the time getting off the plane to checked into our room was less than 1 1/2 hours and that was including the 25 min taxi ride for $25US. We had the Servicio Real. We were in building 19 room 2196, 2nd floor ocean fromt, ocean view. Room was lovely and clean. Our butler was Nelson, he was the BEST. There were tiny ants in bathroom sink, just dump the flower and problem solved. We also has ants above the mini bar, keep sugar packets in the mini bar and again problem solved. Did not get any bug bites. Suggestion, bring Febreeze or oust for the closet as it is a carib country and mildew and dampness is part of that. Spray closet everyday and problem solved. The staff were excellent, friendly and accommodating. The beach was breathtaking and the pool a blast. The food was very good for an AI. I did get sick one night, husband did not. I think it was the vodka, rum or what ever else I drank that day. The ice is bagged ice and I did drink and brush with the bottled water. There is some toplessness, not a big deal, they walk the beach from all the resorts. I say if it bothers you don't look. I never saw anyone nude. I would absolutly return to this resort and gave a 5 star for a 3rd world country. Mind you it is not the Ritz but it was also not the Ritz prices. We also did not have a language barrier as our high school spanish worked for a SPANISH SPEAKING COUNTRY. It is a very diversed resort but this past week we met a lot of Americans as well as a lot of nice people from all over the world. Go, you will enjoy!!!", "title": "If You Go, You Are In For A Treat", "helpfulness": 15, "user": "Rainy", "date": "May 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5028853}, {"rating": 1.0, "title": "Las Vegas", "text": "Las Vegas in the Dominican Republic! The property was nice, although too large. The pool bar was crowded with drunks and smokers by 12 noon so that the kids couldn't get near the bar to order. The food was poor too. All that we could deal with but the beach was crowded and noisy, motor boats cruisng by all day long. The only staff at the resort that were accomodating were at the front desk. My 2 daughters (16, 14) were whistled at by the staff on several occasions. We checked out after one day and went to Club Med! It was a fabulous week at Club Med instead.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5022740}, {"rating": 4.0, "title": "Relaxing vacation!", "text": "This was our first trip to the Caribbean, and we enjoyed the Paradisus Punta Cana. My boyfriend and I visited from April 23rd to April 29th. I guess we missed the Spring Break crowd because the hotel did not seem overbooked to us when we traveled. Our major purpose of our vacation was to relax, and we did just that. We mostly spent the mornings by the pool and the afternoons on the beach. Nights were spent enjoying the restaurants and nightly entertainment.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 30, 2006", "id": 5022550}, {"rating": 3.0, "title": "Well, it was OK.......", "text": "Pool – We found the pool to be very relaxing with seats in the sun or shade. Many people had reserved their chairs early in the morning with their belongings, but we were able to find two chairs in the sun at the beginning of the week and two chairs in the chair by the end of the week.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "April 29, 2006", "id": 5018324}, {"rating": 4.0, "title": "Pretty good time", "text": "Beach - The entire beach is breathtaking at first site. The water is so blue that I felt as if I was looking at a picture. The beach area was very clean, except the cigarette butts that visitors left behind. We also were able to find chairs at the beach. Occasionally we enjoyed the large beds as well. The water was a little rougher than I thought, but we still enjoyed cooling off in the ocean.", "helpfulness": 11, "user": "jenmm28", "date": "April 27, 2006", "id": 5014949}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "After reading numerous reviews, I had my concerns re the Paradisus Punta Cana.....WOW, in my opinion, people do not appreciate an excellent property in the islands. I went with my teenage son and we both had a 6 star experience.", "title": "One of the BEST island resorts!!!", "helpfulness": 7, "user": "Champaign1", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7219808, "likes": {"liked": "— Beautiful grounds and excellent service!", "disliked": "— Some of the staff does not speak English, but work hard to understand you."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "There is so much to do, should you choose or do nothing at all and relax and be catered to for as long as you like. The service is wonderful, and I do recommend Royal Service if you want to upgrade.", "title": "great vacation!!!", "helpfulness": 7, "user": "lisfahey", "date": "March 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7186920, "likes": {"liked": "— Very clean, great location", "disliked": "— Service in restaraunts not so great"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "For an all-inclusive the food is very good, and in general, the food is very good.", "title": "Great beach and food, shame for the rooms.", "helpfulness": 3, "user": "Alex_of_London", "date": "March 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7178936, "likes": {"liked": "— Beach and food.", "disliked": "— Bad mattress"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Lots of diversity of people, and everyone was there to have fun and did!!! We are so so glad we went to the Paradisus Punta Cana.", "title": "Good Value", "helpfulness": 14, "user": "hollywood0815", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 7156751, "likes": {"liked": "— Beach, Golf, Food and Beverages", "disliked": "— No Beach service, rooms a bit outdated"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I have never written a review before but since I had read all the reviews before we booked I thought I should. My 13 year old daughter and I arrived for a week long stay on February 23. We booked with Liberty Travel and could not have been happier-other than some cloudy days. After we landed it was a little confusing trying to locate our transportation to the hotel. The hotel lobby was beautiful and check in was a breeze. I had read some complaints about delays in getting a room but as we did not arrive at the hotel till 5:30pm everything went smoothly.The only issue I had was the \"map\" of the hotel which described all the restaurants, policies and amenities of the hotel was in Spanish. I asked for the English version and was told we don't have one. Kind of annoying. The grounds were impeccable and the grounds keeping staff were very friendly. Our room was immaculate at check in and the following morning I left a $10 tip for the maid asking for bottled water and coffee everyday. Everyday upon return to the room was an overabundance of both as well as a super clean room! The beach was beautiful no issues with cleanliness at all. The place was packed as it was spring break but never an issue of getting a place to sit. The food was okay, my biggest problem was a severe shellfish allergy and all the food descriptions were in Spanish at the buffet. When attempting to explain my situation to a waiter I felt that they did not understand the question and just say yes or no not realizing the implications. The best were Chinese and buffet for us. I think that the staff there want a tip upfront before you are served to kind of\"ensure quality service\" which is not my policy. I will tip you after I am served on the quality and attentiveness of the staff, not before. The regular waiters at both restaurants received generous tips. The only other problem which was not a big deal was on the hotel website and confirmed through my agent, we were told they had wireless internet. I assumed that meant in my room -but it is in the lobby at $5 an hour. Some people still have to work while on vacation and I found this to be a little inconvenient. All in all great trip, would recommend.", "title": "friendly and beautiful resort", "helpfulness": 3, "user": "sandhappy", "date": "March 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7154610, "likes": {"liked": "— beach, pool and entertainment", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Before we left for Paradisus Punta Cana, I read so many reviews and was getting very worried about the negative reviews on cleanliness and overall experience.....but the experience was so amazing and I can't wait to go back! I realized that people's opinions are ALWAYS going to be different depending on their lifestyle, interests, age, etc.", "title": "Incredible resort...miss it already!", "helpfulness": 7, "user": "amt4400", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6817367, "likes": {"liked": "— Everything!", "disliked": "— Leaving!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My boyfriend and I are in our late 20s. We enjoy posh hotels, trendy nightclubs and restaurants... and excellent service is very important! Because of our hectic schedules working in the nightclub business, we desperately wanted to go someone tropical where we could just RELAX and enjoy each other over the week of Valentines Day. Paradisus Punta Cana was the best choice by far! We also looked into the Paradisus Palma Real, which is beautiful and more modern, but we chose Paradisus Punta Cana because it seemed more intimate and authentic for DR.", "title": "A perfect wedding at PPC", "helpfulness": 5, "user": "Hodor", "date": "February 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6809141, "likes": {"liked": "— Location & grounds", "disliked": "— Make beach more private for wedding"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Immediately upon arrival, my breath was taken away by the beauty of the resort. The lobby area was so enchanting with open-aired rooms, comfy sitting areas, and gardens everywhere. We chose to upgrade to Royal Service upon arrival...great decision and well worth the cost!! The resort grounds are beautiful, clean and well-maintained. The trolley is a necessity to get around the resort but there are plenty of them and we never waited more than 5 mins. Even though the resort is huge, it was always very intimate and we never felt overcrowded by other guests.", "title": "Great Staff, Great Guests and Great Tans", "helpfulness": 3, "user": "NYWeLove2Travel", "date": "February 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6803473, "likes": {"liked": "— Everything was expertly maintained; the buildings, grounds and beachfront.", "disliked": "— The air-conditioning in the free-standing restaurants."}}, {"rating": 3.0, "title": "Non-Smokers Won't Be Happy", "text": "Our room was perfect, champagne upon arrival, was VERY clean (no musky smell at all!!) with a nice balcony, Jacuzzi bath and comfy bed. The pillow menu and scent menu included with royal service was a nice touch. And our butler, Nelson, was so helpful to make sure we enjoyed our stay. At our request, he prepared a rose petal Jacuzzi bath for us on two of the four nights we stayed....so romantic! Royal Service also includes use of an adult-only pool area. Loved the music!! The best part was the Bali beds everywhere. We never really had a problem finding an open one...and they're great for napping when you’re tired of being in the sun! The Royal Service beach area has a spa massage hut (with better massage prices that the spa offered) and was so relaxing with the sound of the ocean and breeze. We took a walk down the beach which showed us how great of a choice we had made...although many of the resorts are also beautiful, most of them had loud music and cheesy games going on the beach...not our style at all. (If I'm on vacation, the last thing I want is a guy on a megaphone trying to get me to limbo or play tug-o-war! LOL)", "helpfulness": 7, "user": "Toronto_Don", "date": "February 16, 2007", "id": 6802021}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "My husband and I along with another couple had a great time at the Paradisus Punta Cana from June 2nd to June 7th. I am certainly looking forward to returning for a longer stay.", "title": "Great Vacation", "user": "Berta1010", "date": "July 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8072353, "likes": {"liked": "— The hotel's ambiance and the friendliness of the staff", "disliked": "— The pushy time share sales people"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If you are looking for a truly relaxing vacation this is the place.", "title": "great hotel - loved the royal service amenities", "helpfulness": 1, "user": "scubachick_7", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8072232, "likes": {"liked": "— beach, food, royal service, pool", "disliked": "— wine choices"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The ambiance of the hotel is laid back and peaceful.", "title": "Watch the Time/share Sales Pitch!!!!!", "helpfulness": 2, "user": "SRobey", "date": "July 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8067964, "likes": {"liked": "— Beach, Pool, Decore", "disliked": "— Food/Service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The grounds are beautiful and nicely kept. The hotel is surrounded by mangroves so if you decide to walk from place to place you are on a constant nature walk.", "title": "Did not know what to expect", "helpfulness": 3, "user": "mikesnowman", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8064511, "likes": {"liked": "— Excellent Service", "disliked": "— Kids Club a bit less than expected"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Staff was very friendly and helpful hour \"host\" Luis was very nice.", "title": "Everything you wanted to know, but afraid to ask! GREAT PLACE", "helpfulness": 16, "user": "YO_Boracho", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8055954, "likes": {"liked": "— beach", "disliked": "— people selling time shares"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Stayed at the Paradisus Punta Cana from July 2nd till the 11th. Had my wedding there on the 4th", "title": "Paradisus Awesome Plus Wedding", "helpfulness": 5, "user": "rzurla", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18254937, "likes": {"liked": "— The grounds and cleanliness - the beach - the all inclusive - the trolly cars", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would like to start by saying that I have been on this forumn for over a year planning my wedding and my trip since I had 25 guests attending besides myself and husband. We are in our early 40's and calm and actve at the same time. I had my wedding here and although it wasnt that perfect it was the most unique experience. Awesome actually. I have traveled throughout the Carribean and took a chance on this resort and you really cant go wrong for the amount of money that you are paying for what they have to offer.", "title": "Not for Americans!!", "helpfulness": 2, "user": "NOFUMAR", "date": "July 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 18249709, "likes": {"liked": "— Checking out to go home!", "disliked": "— The service!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Airlines & Airport: we took Delta out of JFK and it was awesome. My office gave me a bridal shower and one of my gifts were a baseball cap that said bride on it. It motivated me to just be such a tourist on this trip that hen we entered one of the most crowded airports for our trip we were greeted with such smiles and congratulations that they actually gave us our first wedding gift and bumped us up to first class. It was awesome as we were greeted with champagne and had breakfast on the plane. Mad the trip theat much more better . When we arrived at Punta - Yes it was a bit frustrating since they had the music playing loud and we didnt understand uch BUT .... let me tell you , if you look there is always someone that you connect with that will do the right thing. I have heard through reviews that they take your luggage 10 feet and that is is. Well, before I even tipped anyone, ther wa a person that took all of our luggage, (5 Huge suitcases) and wheele it behind us the whole time - took us through the line at PrIeto Bus(which is included in most packages) and it was fine. He took our luggage all the way to the bus and loaded it on and we were ready to go. I tipped him 10.00 and worth every penny although he didnt expect anything. (Maybe the trick is to put the money in your hand and just hold it out in the open you will be sure to get the kind of service that you want)", "title": "Our second trip back to Paradisus", "helpfulness": 2, "user": "Texasgirl115", "date": "July 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17909714, "likes": {"liked": "— The rooms in the reserve are like being in your own home. They are very comfortable.", "disliked": "— Lack os restaurants open on a nightly basis."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The bus ride was fun. We looked out the window while we visited two other resorts on our way to ours and it was awesome seeing this as I have been reading reviews on all these other places for so long.", "title": "Would not Return", "helpfulness": 2, "user": "AWS43", "date": "July 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 17875100, "likes": {"liked": "— The Beach", "disliked": "— Rooms, Restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Resort/Hotel: We booked Royal Service Section. This section entitles you to every section/restaurant in the resort to include the Reserve. Our room was 2011 which was building 1 and was perfect. Although when I first entered the room it seemed a bit musty but I stuck it out and a couple days later knew that we did the right thing. When we pulled up in front of the resort that had our names on a sign that read welcome. WARNING: Any brides thinking about booking there wedding here, please make sure you either use a credit card that has your married name on it. Everywhere on signs and welcome letters was my maiden name and it took 2 days to fix that and when we finally met with Miguellina. As soon as we pulled up out of our bus the trolly took us to the royal service section where we were in the air conditioned office and greeted with wet cold towels and flutes of champaigne. It was very cute.", "title": "Beautiful resort with terrible service", "helpfulness": 2, "user": "dl0985", "date": "July 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 17768941, "likes": {"liked": "— The grounds were beautiful", "disliked": "— The poor servic"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "After traveling to Mexico the last five years our family was ready to try something different. I research mostly through tripadvisor and the \"Royal Service\" feature of the Paradisius was very attractive to us. I will begin by saying the resort has many wonderful qualities. Our check out started at the wrong place. I thought after telling them we had royal service that we were at royal service check in but after completing all the paperwork found out royal service check in is in a completely different building. Once at the proper place, a very lovely VIP buiding, we sat down at a nice desk with champagne and air conditioning and did the check in all over again. We made dinner reservations and were then transported by a golf cart trolley to our rooms. We had two rooms as requested side by side. Our bellboy/butler was very informative and our rooms were spacious and clean. We found out during our stay our made Francescia our maid was wonderful! each day she spent time dusting, cleaning, washing the floors and anything else that needed to be done to make our rooms spotless. We were happy to have brought some fun school supplies for her 6(!) kids. The first night we ate at the Hibiscus buffet. Big mistake. the food was horrible!! If you have to eat there order the pasta. Its only thing edible. It did get better after that. We had reservations at the Japensese (great), French (good but you will leave hungry), Chinese (Great food horrible service), and Mexican (great), Italian (great and open until 3am), we had lunch once at the italian and a late night snack once also, the minetrone soup and eggplant parm is delicious. We had breakfast and most lunches in the Royal service Lounge. The breakfast was buffet but they will make omelets if you ask. The lunches were very good especially the chicken marsela. There are no sandwiches though so try another place if you want something on that idea. My biggest complaint though was the drink service at the Royal Service beach. The royal service beach is a bit of a farce. No one checks to see who goes in an out of the royal service beach or pool and people save chairs the night before. There is no drink service on that part of the beach. When I inquired they said there is and introduced me to the \"beach runner\", he however stayed at the pool bar and we had to walk up almost everytime we wanted a drink. When I did complain at the royal service front desk, another guest overheard me and said she was served one drink on the beach the whole week she was there. I did notice the beachrunners on the other side working very hard. Someone from management needs to spend a few hours watching and correcting this situation. Any other resort we stayed at we had drink service and only had to tell them once what you wanted and they served us all day. The beach runners are only hurting themselves because we as many others were tipping consticently for service. This is the most expensive vacation we have taking which would have been fine had we been able to at least been served a drink on the beach.", "title": "Something for everyone", "helpfulness": 4, "user": "AddictedToTravel01", "date": "February 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6836137, "likes": {"liked": "— The beautiful beach and water", "disliked": "— No Royal Beach drink Service"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I would not return to the Paradisus until that and a few other customer service problems were solved. We traveled with our 18&16 year olds who did meet plenty of other teens and had a ball. the shows are very good. The Las Vegas show and Michael Jackson Show were excellent. This is a big resort so you will need to take the trolleys. They ran regularly but when they didnot we walked and that was fine. It also rained for two days. We heard this was unusual for this time of year though. If you have reservations to travel here you will enjoy the wonderful beach and water!! Plan your dinners, stay away from the Hibicus restraunt and be prepared to walk up the beach bar for drinks!! You will enjoy it!!!", "title": "Not as good as expected", "helpfulness": 3, "user": "toastedalmond", "date": "February 24, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 6835356, "likes": {"liked": "— Beach and Golf", "disliked": "— Poor Service and needs building repairs"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We just returned from a one week stay at the Paradisus Punta Cana. We booked our trip using airmiles through their vacation group. We had originally been booked into the Paradisus Palma Real but a few days before we were contacted and told that 30 or so people were bumped from that hotel due to some kind of building issue at the Palma Real.", "title": "Nothing short of excellent!!", "helpfulness": 8, "user": "meulemans", "date": "February 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6822909, "likes": {"liked": "— It was very beautiful and the staff very friendly", "disliked": "— I had a little trouble communicating because I don't speak Spanish, but most of the staff could understand English quite well."}}, {"rating": 4.0, "title": "Overall Good, missed details", "text": "Although we were disappointed the Airmiles people were going to refund us the difference in the rates and give us an additional 200 dollars each for our inconvience. Ok, I'm feeling a little better now and started to pack.", "helpfulness": 10, "user": "Buffalo_Art", "date": "February 21, 2007", "id": 6821943}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Our flight through Air Transat - WestJet was fine and we landed without any issues. We were handed little vouchers on the plane that we would need to enter the country. We got through immigration and then there is another point where the person scans your ticket and lets you go through..or so we thought. My husband got through fine but I was told to stand to the side along with about 20 other people. My husband hastily handed me my passport. We were told that our vouchers were no good and after about a half hour wait we were told that we would have to go back and pay another $10 to get a proper ticket.", "title": "Paradise ...Almost", "helpfulness": 4, "user": "Yosh_Shmingey", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6817837, "likes": {"liked": "— Great service, Great Food, Great Facilities", "disliked": "— Attention to detail, and better upkeep would make this hotel paradise"}}, {"rating": 5.0, "title": "Nothing short of paradise", "text": "Our family of 11, incl. my wife & I, our adult kids , & their 3 toddlers, just spent a week at PPC.", "helpfulness": 5, "user": "stokdoc", "date": "March 11, 2007", "id": 7011508}, {"rating": 5.0, "title": "Gorgeous beach!!!!", "text": "Nothing but rave reviews! Excellent accommodations, spectacular grounds, great facilities, friendly and very accommodating staff, good, and plentiful food... really, just overall a great resort!", "helpfulness": 2, "user": "Doodlegirl03", "date": "March 10, 2007", "id": 7009802}, {"rating": 5.0, "title": "Paradise @ Paradisus", "text": "Chosen an basis ot trip advisor reviews, and was definitely not disappointed!", "helpfulness": 5, "user": "rawalsh", "date": "March 3, 2007", "id": 6906640}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Would be happy to answer any questions.", "title": "Loved it!", "helpfulness": 6, "user": "canadiangirly21", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6840138, "likes": {"liked": "— The unbelievable beach and lounges!", "disliked": "— The restaurant service"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "My daughter and I just returned from Paradisus Punta Cana. It was fantastic! We enjoyed playing in the ocean and relaxing on the beach all morning, and at the pool all afternoon. Only complaints were that we had lukewarm water (at best) for showers and that at the buffet, the hot food never seemed hot enough, and the cold food never cold enough. Staff was very pleasant and attentive - it would have really helped if we had spoken Spanish, though.", "title": "Overall...Ok", "helpfulness": 2, "user": "ilenaosma", "date": "February 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 6836922, "likes": {"liked": "— the beach and pool", "disliked": "— the rooms/bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We just returned from a weeks stay at Paradisus Punta Cana from 4/30 to 5/5. All we can say is WOW. The trip was perfect in every way. We are both in are early 40's and travel a fair amount and must say this resort was one of the most beautiful places we have ever seen. From the pristine grounds that are always being maintained to the breath taking beach you know you are truly in paradise. But more then anything to us were the people of the resort and just how wonderful they were. Everyone we encountered was so so freindly and willing to do what ever to make us happy, and always with a smile. We did not experience any problems with the language barrier as everyone we came across we were either able to get across what we were asking or someone else would come up and help. A little patience goes a long way and remember your on vacation so just relax and enjoy. We did see a few people getting upset if a drink took a few minutes or having to wait 10 minutes to get into a restaruant. Gee I've seen people in the staes wait a hour to get into an Outback Stakehouse or an Olive Garden. Just order a drink and relax in really beautiful waiting areas, no big deal at all.", "title": "Perfect Trip", "helpfulness": 20, "user": "Ray2112", "date": "May 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5044932}, {"rating": 5.0, "title": "Beautiful Resort", "text": "We booked a Royal Service suite and really enjoyed the extras. The VIP lounge was great and we used it all the time. Nelson our butler was just great and hooked me up with a nice suprise for my girl friend as he set up a romantic evening in our room with flower pedels on the floor, a bottle of bubbly and the juccuzzi tub filled and ready to go. My girl friend was so suprised. He also took care of our fair well dinner at the French resturuant and they had a table in the corner covered with rose pedals and flowers. The look on my girlfriens face was priceless and again she was so suprised. Thanks so much Nelson. The Royal Service rooms we great and the location was perfect, right by the Royal Service pool and close to the beach and main resturants. I would recomend the Royal Service if can do.", "helpfulness": 10, "user": "ls_losfeliz", "date": "May 5, 2006", "id": 5035645}, {"rating": 2.0, "title": "Disappointed", "text": "The beach is why we choose this resort and all I can say is WOW. Just beautiful with white sand and clear blue water. Very little sea weed and every morning they cleaned up what wash up on shore. You just can't get that here in the states. We took advantage of the sail boats that we offered to us and took them out on 2 different day's. What a great way to see the entire area. One day up north the next time down south. Very cool. The water is so clear even hundreds of feet off shore you could see the bottom on the ocean and sailing over parts of the coral reef was awesome. You should take advantage of this when your there.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "May 4, 2006", "id": 5034041}, {"rating": 4.0, "title": "Good Time, Beautiful Beach!", "text": "The food was good. Not great but good and so many choices. We really liked the seafood, French and mexican places but all were good. If food is your number thing on vacation then you might be disappointed. There was plenty of booze including some good stuff like Absolute Vodka and Beefeater Gin. Just ask for it and you'll get it. I'm not a beer drinker but after trying the presidente beer I might have to reconsider, it was really good stuff. Try it and I believe you'll be hooked to.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "May 3, 2006", "id": 5032295}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "We went to the lobby bar at night and always someting going on. A great place to just hang out and relax. We did catch 2 shows and thought they we very entertaing with so much energy. It's not quite Vegas but it sure was fun. We stopped by the casino one night. Not all that and we figured we would just wait to gamble when we go back to Vegas. We also enjoyed walking back to our at night, the resort is just stunning when the lights are on the walk help us to relax and unwind before turning in.", "title": "Nice place but if going with teenagers, please read on", "helpfulness": 8, "user": "scoolman", "date": "May 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5030160}, {"rating": 4.0, "title": "Beware of Dolphins", "text": "Beware of the Dolphin Island tour. Soncho the dolphin attacked me and bite me for no apparent reason. The staff poured alcohol on the bites and cuts and refused to let me out of the water until after the dolphins finished their routine. They did not want to confuse the dolphins. Sorry, I was the one attacked. It was my 25th anniversary and the dolphin spoiled the trip. I had to get shots when I returned from DR on Monday June 25th and I am still taking antibiotics. I loved everything about DR and Paridusis except the dolphins. I can't even get my money back. I am planning on posting the attack pictures and my bloody arm, chest and back so as to warn all parents not to allow their children to swim with \"Soncho\" the dolphin at Dolphin Island.", "helpfulness": 2, "user": "DennyTexas", "date": "July 2, 2007", "id": 8040390}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My family just returned from Paradisus. First, I want to thank all the reviewers. Thanks to them, we were COMPLETELY prepared. I really knew what to expect, what to bring and what to do. The place is beautiful. Lush with vegetation and immaculately groomed. The pool is unbelievable. It winds and twists with several \"hidden corners.\" We were able to stay in the shade while the kids, ages 5 and 8, swam around. The bar scene was lively but completely-kid friendly. Bring goggles-the pool's well-chlorinated.", "title": "Beautiful Place", "helpfulness": 3, "user": "swsnv", "date": "June 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7987848, "likes": {"liked": "— The beautiful beach and pool", "disliked": "— The room, I would have preferred two connecting rooms or a suite"}}, {"rating": 4.0, "title": "Can You Say Graet!!!!!!!", "text": "The beach-again gorgeous. Clear greenish-blue water with enough surf to satisfy the sailors in my family. We did grab chairs under the protective cabana/trees after breakfast, but there were always some shaded seats available.", "helpfulness": 4, "user": "stroker", "date": "June 23, 2007", "id": 7971111}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The help, great. Even when they didn't understand us they tried. One service attendent called the front desk and used them as a translator when he was having trouble with our Spanish (or lack there of.) Many spoke English.", "title": "Truely Paradise", "helpfulness": 1, "user": "AprilAF", "date": "June 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7966954, "likes": {"liked": "— It as clean, beautiful, spacious and the people were amazingly friendly and warm.", "disliked": "— Nothing!!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The food. We loved the breakfast buffet. It's sort of a Euro/Latino mix. A roomful of breads and rolls. A large choice of sweet rolls and bread as well. Inside an a/c room, sliced meats, cheeses, fruits, eggs cooked to order (tell Bernardo the omelette guy we say hi), hot cereal, potatoes, plantains, bacon and the like. My spoiled American children had trouble with the milk-it's all ultra-pausterized. Very safe to drink, but thicker and sweeter than our pasteurized milk. Luckily, with the help of some wonderful servers, they discovered the pleasures of cold limonada and hot chocolate. At lunch, we feasted on salads, roasted meats, pasta and fresh fish cooked to order. This is where my kids got their big meal at the cooked to order pasta station. Dinner was a bit of a let-down. None of it was great. The steakhouse was probably the best followed by the Mexican. Skip the Chinese, not my favorite. Except for grilled meat and the chicken strips at the steak place, there was little for the kids or anyone who prefers to eat simply. Fill up at lunch and take dinner in its stride.", "title": "Absolutely paradise!", "helpfulness": 4, "user": "Burg86", "date": "June 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7963996, "likes": {"liked": "— amazing beach!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "The resort is beautiful with all the nature and flowers everywhere. We went for a wedding and stayed in the \"Reserve\" side of the resort. We had to pay an additioal $100 for the week & it was well worth it! The Reserve has it's own pool and swim up bar and it is much nicer than the other side. It also has lunch right there & they'll bring it to you by the pool. The rooms are new and big. The are all marble with flat screen TVs & jacuzzi baths. When you stay on the Reserve side only people there can use the facilities, so you never have a problem getting towels or chairs. It is farther from the beach, but it's a quick walk or easy golf cart ride.", "title": "Beautiful Resort Horrible Food", "helpfulness": 1, "user": "LLPigpen", "date": "August 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 18954136}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We did get a couples massage and it was very relaxing & one of the best I've ever had.", "title": "Nightmare in Paradise !!!!!!!!!!", "helpfulness": 1, "user": "sb177", "date": "August 14, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 3.0, "cleanliness": 1.0, "rooms": 2.0, "location": 3.0}, "id": 18950033, "likes": {"liked": "— ABSOLUTELY NOTHING", "disliked": "— EVERYTHING.. SERVICE"}}, {"rating": 1.0, "title": "Not even close to \"impeccable service\"", "text": "The only disappointing part was the food, we think. We went down with a large group of 50 people and by the end of the trip almost everyone had become sick with stomach problems. Some lasting days. We assume it was the food which really is not that great. The best lunch food is Pizza and believe it or not the best restaurant is the Chinese place, which does not require reservations. If you want to go to the Japanese, Mediterranean or Island fusion restaurant you need to make reservations where you have to stand in a long line, so I recommend getting it over with on the 1st day.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 14, 2008", "id": 18938445}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff is very friendly & nice, but when you ask them to do something they don't usually you always get a No.", "title": "Beware of Theives.....", "helpfulness": 2, "user": "ic2133", "date": "August 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 18901741}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Overall I don't think I'd go back b/c I am a food person & that's an important part of a trip for me. But the resort is clean beautiful & relaxing.", "title": "Stay in the Reserve Section", "helpfulness": 2, "user": "JVMHammer", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18856049, "likes": {"liked": "— Brand new rooms - clean and comfortable", "disliked": "— a 10 minute walk to beach unless you want to wait for transportation"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Background about us: we are a traveling type of family from humid Houston, Texas and have been to numerous carribean resorts, this was our first time to the DR, Punta Cana. Please note that we are hardly picky and very easy to please and do not require much. We booked our trip through Carson Wagonlit Travel on Gessner/I-10, our agent was Bette P.--her service was excellent and I do highly recommend her ---we missed our flight to the resort and wanted to stay an extra day due to the foulup--she even spoke to us via her home/cell phone and also contacted Go Go Travel and the resort to ensure all would be acceptable, which it was----took a load off my shoulders.", "title": "Better than Expected with a Toddler Too!", "helpfulness": 12, "user": "LawDude", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8204627, "likes": {"liked": "— Beach and Pools, service", "disliked": "— That we had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Me--(36 yrs old) traveled to the Paradisus Punta Cana, along with my wife (31), monster-in-law (55), and my two (2) year old son. We stated there from July 8th through July 16, 2007.", "title": "Fantastic Place", "helpfulness": 3, "user": "cbkm5564", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8132087}, {"rating": 4.0, "title": "Paradisus is Paridise", "text": "We booked two rooms: Wife and I in Room 2011 which was an Oceanview Royal Service Jacuzzi Suite (OV) and the monster-in-law and my son were in Room 2198 which was a Family Concierge Suite (FCS--the FCS allows the adults to use the Royal Service facilities) . Although the rooms were no larger in size than the other rooms (from what I observed), we did have a great kingsize bed in the OV room and the balcony was a tad larger as it was an oceanview. Greatfully, as we had requested, their was a nice crib in the FCS awaiting my son.", "user": "Beauty2", "date": "July 8, 2007", "id": 8076768}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Even though the Royal Service pool and beach are to be exclusive to adults and those guest is the royal service rooms, no employee nor guest complained that our 2 yr old accompanied us to both. Thank god! I also noticed that the royal service beach and pool were, in fact, exclusive to royal service/FCS guests. We did not try to bring my son into the Royal Service lounge, except for our check-in, but did bring him to our room for a few nights.", "title": "Heaven on Earth", "helpfulness": 4, "user": "WWJD_John_316", "date": "July 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8075492, "likes": {"liked": "— Scenery", "disliked": "— Humidity"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I cannot say enough about the royal service and the family concierge service---very speedy and extrememely pleasant and helpfull with room service, romantic bath setup, pillow menu (fun), and in the RS lounge there is great food, internet access and the Miami Herald for US news:", "title": "Paradisus is Paradise (especially for honeymooners)!!!", "helpfulness": 1, "user": "BoilermakersOhio", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8072956, "likes": {"liked": "— The Royal Service Amenities", "disliked": "— The buffet"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "When I pay a premium for a hotel, I expect a premium vacation...umm, not here! The scary thing about the entire scenario is tht everyone that goes to Punta Cana loves it....I think thay they dont know better. My idea of a vacation is relaxation, not aggravation. DO NOT TAKE THE COMMUNITY BUS TO THE HOTEL, YOU WILL RUIN THE DAY AS THIS WILL TAKE 3 HRS TO STOP AT EVERY HOTEL, TAKE A CAB FOR $30! By the time we got to the hotel our \"Royal Treatment\" welcome was a \"Royal\" flush, it to the hotel 45 minutes to check us in and figure out where we were to go. Where is my \"royal\" room on the beach? Ok, as we we were walking to the room our concierge recommeded I surprise my wife w/ flowers and candles in the tub....eek, I think that would have ended up in a one year anniversary divorce. How do you say \"ants\" all over the floor and yeah, um candles/flowers, no thank you! Wash that bathroom and seal those windows up...and wear slippers in the shower...so much for \"royal\" rooms, dont pay to upgrade.", "title": "Welcome to Hotel California......not a lovely place, justa dirty place", "helpfulness": 6, "user": "Pepino_78", "date": "January 29, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 6714716, "likes": {"liked": "— Grounds and trolley", "disliked": "— Ants in rooms....food....cleanliness...food.....ocean in March was cold....what else can be wrong"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled with friends", "text": "Moving on...all you can eat....horsemeat and clam chowder! Oh that was chicken...ouch!", "title": "OK", "helpfulness": 4, "user": "LondonJetski", "date": "January 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6698665, "likes": {"liked": "— Size", "disliked": "— Bed linnen"}}, {"rating": 4.0, "title": "HONEST review of the paradisius", "text": "Oh well, what started as a celebration in Newark end up w/ the reality that we missed The NJ turnpike. Food/Sun poisoning and a horrible experience really makes you feel sick when you see your credit card bill a month after...Best of luck, take me to Bermuda please!", "helpfulness": 22, "user": "beachluvr77", "date": "January 16, 2007", "id": 6606889}, {"rating": 4.0, "title": "It's All About Luck", "text": "The hotel is very old and i think it needs some \"upgrading\", especially the safe in the room :) The bed linnen i actually hated, because it is never ironed and the housekeeper constantly put the pillow case inside out. The covers were dirty and so were the curtains in the room (they actually smelled). I have no idea when was the last time they washed them. The room is big though, which is nice, but something was always missing, like a towel. So i had to constantly ring the house-keeping do get what i needed and what should have been in the room in the frist place. There is a coffee machine in the room though, which is great :)", "helpfulness": 16, "user": "studenttravelerCt", "date": "January 16, 2007", "id": 6606120}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The beach is the best feature of the hotel, its flawless.", "title": "Good place to stay but don't get pressured into buying a time share", "helpfulness": 10, "user": "manhattanmom", "date": "January 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6589364, "likes": {"liked": "— The garden settings of the bungalows", "disliked": "— The bugs in the bathroom"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 244, "average": 364, "very good": 897, "terrible": 224, "excellent": 1878}, "aka": "Paradisus Punta Cana Hotel", "slim_ranking": 0.425742574257, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Discover the unpretentious luxury of Paradisus Punta Cana Resort. An extraordinary island retreat offering a super balance of natural and man-made wonders. Open-air architecture, featuring indigenous organic materials like raw coral and exotic hardwoods, houses an impossibly sumtuous gallery of luxury Suites and an exclusive Garden Villa. All-inclusive and all encompassing, Paradisus Punta Cana Resort is an ocean front playground for all ages. Tennis, championship golf, every non-motorized water sport imaginable, a magnificent array of restaurants, our own Casino, an incredible Spa For Kids, an exquisite full-service spa and health club and personal world-class service all seamlessly unite to deliver you the relaxing, romantic, carefree, fun-filled experience of a lifetime. The Resort features 688 oversized suites including 143 Royal Service Suites and 4 Ambassador Oceanview Suites, plus a one-of-a-kind oceanfront Garden Villa."}