{"user_rating": 4.0, "review_count": 594, "name": "Parco dei Principi Grand Hotel & SPA", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "To call Grand Hotel Parco dei Principi a 5 star hotel, is a truth with modifications. We would probably rate it as a 4 star hotel, but it's a very nice hotel. We got a very good deal - only 780 € for 4 nights - through an internet site, so we got no reason to complain. We had our doubts regarding the distance to all the attractions, but it really wasn't any problem. We walked every morning through the beautiful park Villa Borghese - 10 minute walk to Via del Corso. At night we didn't want to walk through the park, so we just got a taxi (between 5 - 8€ from Piazza di Spagna)", "title": "Even Manchester United Football Club uses the hotel", "helpfulness": 1, "user": "HHHCopenhagen", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7645548}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The breakfast was quite good compared to what you normally get in Italy - a nice, large buffet.", "title": "Excellent hotel in great location", "helpfulness": 3, "user": "Clark1000", "date": "May 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7550230, "likes": {"liked": "— Superb service and great room.", "disliked": "— Cold coffee"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I guess we were not the only one to discover this hotel - the first morning we met a lot of policemen in front of the hotel and realized that the players of Manchester United stayed at this hotel after their meeting with Roma in Champions League.", "title": "Bipolar at the Parco", "helpfulness": 3, "user": "MadameO", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7381370, "likes": {"liked": "— Location (the park is divine)", "disliked": "— Location (a little too far from the heart of town)"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "Next time we visit Rome, I think we would look for a hotel that is closer to the attractions! It would be best, if you could drop by your hotel during the day to drop of things you have bought, change your clothes etc. - and Grand Hotel Parco dei Principi is a bit far away to do just that.", "title": "beautiful hotel,wonderful staff, next to Borghese park amazing", "helpfulness": 1, "user": "Sandy99", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7277930, "likes": {"liked": "— beautiful hotel, lobby and free interenet", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Room was of average size, clean and well-appointed. Calm, relaxing urban view of demi-villas in the area. In June, the oleander and bougainvillea are in bloom, giving the whole area a light flowery scent. Very nice.", "title": "Decent Room, Quiet Location", "user": "Jim K", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168633956}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Decently-sized bathroom with standard amenities, but doorstop made getting in and out a little awkward. Bathroom had a bidet, which was a nice touch, if a little out of place for an unmarried American guy.", "title": "Beautiful hotel, but not so kid-friendly", "helpfulness": 1, "user": "jmmd73", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167805127}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Very quiet at night, scenic surroundings. Near the zoo, so expect some peacock calls and the occasional animal sound at dusk and dawn, but this just adds interest and charm.", "title": "Beautiful hotel, lots of spa facilities, lack of staff, unprofessional spa receptionist", "user": "CelloB", "date": "July 13, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 167393610}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "General perimeter security good enough to leave the patio door open without concern.", "title": "Beautiful hotel, but not as kid-friendly as some", "user": "Calgaryfamilyof5", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167257291}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Multi-level grounds are very nice. Pool and spa are above average. Plenty of conference room space.", "title": "Hotel with Everything!", "user": "SadieTO", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166447022}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Have just spent a week in this hotel and cannot recommend it too highly. The accommodation is spacious, the service excellent and the attention to detail second to none. From the hotel to the swimming pool is just a short walk and once you enter this area for your pool towel, you are actually shown to your sun-bed with a choice of parasol, sun or shade, and from then on waited on hand and foot for drinks, food etc. The sun shone all the time we were there and the pool was very refreshing.", "title": "Fabulous Hotel", "user": "suzieDevon", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166003005}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "It is a 10 - 15-minute walk from the Hotel into the Centre of Rome, and once in the City the prices rocket so take plenty of euros with you.", "title": "Enjoyed stay at this comfortable hotel", "user": "hendrob", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165973095}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My wife and I stayed here for five days at the commencement of our European trip. The hotel is relatively expensive but public areas are very comfortable and our room in a corner of the hotel with windows on two sides was light and airy and a reasonable size as was the bathroom. We had room service twice with excellent service, on the second occasion we were provided with complimentary wine. The dining room is also expensive but with a high standard of food. Breakfast is sumptuous.The hotel is a little removed from downtown Rome but the area is quiet and proximity to the Villa Borghese gardens is a plus. We stayed in many hotels during seven weeks in Europe and this hotel rated equal first.", "title": "FILTHY, MOLDY, HORRIBLE HOTEL!!!", "helpfulness": 1, "user": "KayD81", "date": "June 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 165265698}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We booked a Junior Suite 9 months in advance, and confirmed by email one month and one week before we traveled to Italy. We even received emails confirming they were looking forward to our arrival. We arrived at the hotel only to be told they had no room for us. They said they could ‘try’ to find us a room for one night. When they showed us the room I literally cried. The pictures will show why. The room was filthy with food on the floor, mold in the corners, bathtub broken, toilet broken, bathroom door didn’t close, stains on the carpet & walls, paint chipping, no shower curtain, and furnishings resembling a thrift store. This hotel claims to be a 5 star, but could not even be considered a 1 star compared to what we are used to staying in. When we inquired as to why the pictures on their web site looked nothing like the rooms or the hotel, Marco at the front desk actually told us they sometimes use other hotel’s pictures on their web site. We were shocked! When we asked why they took the reservation but couldn’t hold the reservation, they told us they weren’t obligated to hold a room for us even though we had a confirmation number and numerous emails from them confirming our stay. We tried explaining the concept of taking a reservation vs. holding the reservation to no avail. When we asked if we could sit in the lobby and try to find a hotel to stay in they said only if we paid them 25 Euros for wifi, even though it was their fault we had no place to stay for our vacation. We had to stay one night at this disgusting hotel but we eventually found a fabulous resort, the Gran Melia in Rome, and spent our vacation in a resort that was actually a 5 star resort with a beautiful infinity pool and views of Rome. We ended up paying twice as much because of the late booking but it was worth it to stay in a hotel that was clean and beautiful. SAVE YOUR VACATION! DO NOT BOOK OR STAY AT PARCO DEI PRINCIPI IN ROME! IT IS A FILTHY, MOLDY, HORRIBLE ONE STAR HOTEL!!!", "title": "Staff could take a lesson in being polite - especially concierge", "helpfulness": 1, "user": "explorerlala", "date": "June 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 164683981}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This is a high end hotel, so one would expect that the staff is polite. The only staff I found truly polite and attentive was the maid service as well as those that served breakfast.", "title": "Marvellous place", "helpfulness": 1, "user": "dimetrius1612", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164666629}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This hotel was chosen specifically as it was a special birthday present for my mother.The hotel arranged transportation from the airport for us in a standard Merc. I was pricey at about £60 one way but worth it. The reception staff I found to be courteous, if a little aloof. Our bags were transfers immediately to our room. Upon entering our room you had a long hall way that had a bathroom entrance to one side at at the end what would be the living room. As there were 3 of us sharing, the living room was made into a bedroom with a not too uncomfortable pull down bed.It also had tv, writing desk own minibar etc. I door lead to the main bedroom which was a very good size and had its own entrance to the bathroom. It had full built in wardrobes, tv, another minibar and a king size bed. As we were at the side of the hotel we unfortunately did not have a view over to St Peters (which the rooms at the back do - request this when making your booking). Breakfast was more than adequate, with full range of pastries, cereals, fruits as well as cooked items such as sausage etc. As we had booked the hotel on a half-board basis we ate in their restaurant for 2 nights of our stay (the rest of the time in various restaurants on the Piazza Navarone). The waiting staff were excellent, and although it was not a full al la carte menu, the choice was very good, well presented and very good to eat. The swimming pool was excellent, and also very private. Full marks to the cocktail waiter who even made up his own cocktail for us. All in all, we had a very pleasant stay in this hotel.", "title": "Fantastic rooms, bit out from the center", "helpfulness": 3, "user": "Something-Different!", "date": "July 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 8065384}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I would however point our that it is quite some distance from the Via Veneto although it is walkable. Not for those who are looking for loud nightlife etc.", "title": "Terrible service..Avoid", "helpfulness": 8, "user": "SimonLancaster", "date": "July 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 4.0}, "id": 8034725}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "I must have stayed at a different hotel to my fellow British citizens who have recently reviewed this hotel.", "title": "Excellent hotel in Rome", "helpfulness": 1, "user": "Tim2000", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7855606, "likes": {"liked": "— Pool", "disliked": "— Price of water"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "1. Booked directly with the hotel. When I arrived they had no reservation for me.. wonderful. With this omen I should have said ok and moved to the Via Veneto.", "title": "Saved Rome for us!", "helpfulness": 1, "user": "carletone", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7833950, "likes": {"liked": "— food,furnishings,beds, room sizes and decor,swimming pool,, room views,of city, Borghese park,marvellous staff and superbly attentive manager,"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "2. Arrived by car (Ferrari). Ignorant doorman only interested in getting hold of my car keys and parking the car. Luggage(expensive) Pulled from the car at an allarming rate and dumped in reception. Other lighter items like camera case, DVD cam pulled from car and dumped on roof of car. So unproffessional. Doorman repromanded and told that if the car roof was scratched I WOULD HOLD HIM responsible. He never spoke to me or my partner again for the next 5 days.", "title": "perfect luxury", "helpfulness": 1, "user": "Simon_Cheshire", "date": "May 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7666015}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My wife and I stayed here 3 nights post-cruise. Loved the location next to Villa Borghese. It was located in a nice quiet area out of the mobs of tourists but still within walking distance of the heart of Rome. Very elegant hotel.", "title": "Nice hotel in a quiet area", "helpfulness": 2, "user": "jonnight", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164076769}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel advertised that the rooms have air conditioning but when we got there there wasn't any air con in the rooms. The hotel tried to pretend that it was broken and then finally admitted on the last night of our stay that they don't put it on until May. The temperature outside was 24 degrees and I would consider this to be warm enough for air con but the hotel had the heating on instead. The room temperature was up at almost the highest level regardless of whether the heating/air con was on or off. The hotel claim they can't put the air con on because Italian law prevents them for doing so. I've stayed in two star hotels which are able to provide this service so I'm unsure why the Parco Dei Principi refuses, other than to save money on their energy bills. When you pay a premium, you expect the company to provide the services they advertise.", "title": "False advertising - no apology", "helpfulness": 1, "user": "carsickchris", "date": "June 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 163066497}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The service was unfriendly and the staff unhelpful. The hotel have refused to provide any compensation for the fact we were unable to sleep for the four nights of our stay.", "title": "Great hotel, nice location", "user": "DencBristol", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 162944564}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed here over ten years ago and was pleased to see its still a good quality hotel with improved facilities. I had a room for single occupancy which was tiny and dark, i was only staying for one night so it didn't really matter. I did have a balcony, it was nice to be able to open the door as I found the room to be very hot. The bar staff and service was excellent and I was amazed by the array of complimentary snacks give to us with our drinks - delicious! Breakfast was varied to a high standard, shame the room doesn't have natural daylight. The gym and spa under the hotel was quite a surprise, its like an underground city!", "title": "Friendly service", "user": "Andrea R", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 162885992}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I attended a conference here and was surprised by the staff's good command of English. Unfortunately I fell ill- but was very pleasantly suprised by the staff driving me to a pharmacy, translating to the pharmacist and driving me back. Room Service was very supportive with my requests. The service was really fantastic.", "title": "Watch your valuables in this hotel !!!", "helpfulness": 5, "user": "CarolynM36265", "date": "June 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 162674959}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is excellent, the staff courteous, the rooms have a balcony to sit out on and the restaurant similary a terrace. There is a spa and pool and the hotel is locted on the edge of a large park in what appears to the casual outsider a very expensive part of Rome.", "title": "Not if you are on a budget", "user": "HKPlum_Bum", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 170077876}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "So what is there not to like? Well, 1. when one is paying in excess of €400 per night for the romm one finds it a bit galling to have to pay an extra €17 per day for wifi internet access: 2. After a long hot day of doing the tourist trail about Rome being we were never able to get a spa massage booking; and 3. Location, location, location. This last one may in part be our own fault as newbies to Rome but apart from teh Galleria Borghese in the park opposite then all other Rome attractions are around a €10 taxi ride away.", "title": "Great Hotel!", "user": "Allenmuck", "date": "July 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169788555}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I would recommend that if you are visitng Rome to concentrate on visiting the toursit sites then it would be better to get a hotel nearer the attractions. This hotel is more like a resort for those that wish to sit by the pool and make use of the spa facilities and excellent restaurant. And as said in the title line, whilst the hotel itself is very good it does come at a price. Not for those on a limited budget.", "title": "Very relaxing", "user": "nine52", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169601099}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We booked a suite with view of Borghese gardens and St. Peters. The view was great, the location was quiet. hotel is nice and has great facilities. Very large pool and nice grounds. The spa was also very nice and relaxing. we were very happy with the room and the location was good for us as we wanted a more relaxing quieter spot. I don't know what the regular rooms are like but ours had 2 flat panel tvs and a large mural painted on the wall. bathroom was spacious and had a bidet. Hotel is surrounded by embassies so its a nicer part of town. we took nice walks through the park which will take you right to Via Veneto. the cons were the sheets are not so soft. the concierge cant be bothered. I called down to see when the next shuttle to Via Veneto departed and it sounded like I woke the guy up. He said the shuttle was finished for the day even though it was early afternoon and the book in my room said it runs until 6. when I told him that he said, \"ok, I call you if it come back...\" whatever, so we just walked through the park and it was fine. It was more funny than annoying. we took taxis most places and coming back the hotel was never a problem because all the drivers know this hotel. Our room included breakfast and it was great. This was perfect for us with our 6 year old who loved to swim in the afternoons. Overall we were very pleased and would gladly stay here again. Its great for people who want to sight see but also relax at a nice hotel/spa away from the crowds but still close enough.", "title": "Saved by the Spa.....", "user": "PippiMiddleton", "date": "July 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 169486667}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The hotel is far form the main shopping and the main attractions (except the villa Borghese which is just across the street). But the taxis ara always available, not expensive and can take you wherever you want. So some fresh air from the cyprus, the nice swimming pool and the beautiful spa are very rewarding after a long day walking in the heaét of Roma", "title": "Poor service for a spectacular hotel", "user": "Diane P", "date": "July 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168924630}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 5, "variance": {"poor": 51, "average": 96, "very good": 176, "terrible": 36, "excellent": 235}, "aka": "Grand Hotel Rome", "slim_ranking": 0.289763779528, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Grand Hotel Parco dei Principiis superbly located on the border of the historic Borghese Gardens. The hotel has been painstakingly refurbished, recreating the opulence and richness of the patrician villas owned by Rome's nobility in the late 17th century. Beautiful wood paneling in the lobby, precious stuccoes and fabrics, valuable furniture pieces and classic artwork combine to make this a fabulous Roman hotel. The delighful guestrooms offer spelendid views over the city and Borghese Gardens."}