{"user_rating": 4.0, "review_count": 4390, "name": "Parc 55 Wyndham", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The overall experience was fine. It was the little things about the hotel that make me feel that it was not a 4 star hotel. There was a tear in the shower curtain. The front desk people were...not the friendliest. The view and location were great. Across the street from a BART station and very close to Union Square. Lots to do in the area. Some advice for a traveler on a budget, it cost $45 plus 14% tax to park at the hotel. If you are not looking for in and out, there are two public garages, both within 2 or 3 block, that are much cheaper ($30 max incl. tax).", "title": "Good Location, Fair Price, Not a 4 Star", "helpfulness": 1, "user": "the_admiral_MB", "date": "April 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 15440775, "likes": {"liked": "— Location", "disliked": "— Hotel Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "First I’ll start out with the good…For our recent trip to San Francisco, we really wanted a hotel with a good view and in a good location. This hotel had both. We paid extra to be on the club levels (27th – 32nd floors) and we requested, and received, a corner room after reading advice on this forum. The room had a good view of the city, but I was hoping for more of a view of the Golden Gate Bridge and the water. The room was spacious and clean, but the hotel is majorly in need of updating before it can be considered a four star.", "title": "It was just ok...", "user": "3travelers3", "date": "April 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 15237077, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The location was good – close to shopping and public transportation.", "title": "Valet Broke my Mirror", "user": "foxdog40", "date": "April 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 15134492, "likes": {"liked": "— The room.", "disliked": "— The valet damaged my vehicle."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "We had a pizza and beers in the hotel sports bar one night. Our waiter was great, but the pizza was just so-so. We were hoping to watch a boxing match but the sports bar didn’t have HBO! We were going to have a drink in the lobby bar but it was freezing in there & it was on the 2nd floor with a view of Burger King so we decided to go down the street instead.", "title": "Loved the hotel, but very poor service", "user": "travelbound42", "date": "April 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15085504, "likes": {"liked": "— location, rooms with large windows and cityscapes", "disliked": "— service! they could have cared less if i was there or not"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Now the bad…the service was terrible. When we arrived, we wanted to check in and drop off our luggage – then return our rental car around the block. (We had driven down to Big Sur for 2 days and then drove to Parc 55 for 2 nights.) The bell man told us that our luggage would be brought to our room in 5-10 minutes so we could park there briefly and wouldn’t be charged. After getting into our room, we waited 20 minutes and our luggage still hadn’t arrived. We called the bell desk and asked for it. We had to describe our luggage to them, then they brought it 5 minutes later. The person who brought it just threw it on our floor and left. After all that, we were charged $10 for the short time we were parked there. Other hotel employees that we encountered just seemed to have the attitude that they could care less about the guests or their jobs.", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "trumptonfireman", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14803119, "likes": {"liked": "— Location", "disliked": "— Nothing really!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Great Location. Nice clean hotel close to Cable car terminus. Very reasonably priced Thai restaurant on property.", "title": "Great Location", "helpfulness": 3, "user": "therealnickpark", "date": "August 23, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2483941}, {"rating": 4.0, "title": "A Very Good Hotel", "text": "I stayed one night recently at the Renaissance Parc 55 hotel. The service was excellent. Staff was very pleasant and helpful even though this hotel is very busy and they are constantly being deluged with requests and questions. The room was very large, nicely decorated, very clean, and had great views of the city. I like smaller hotels, so I decided to change to the Stanford Court Renaissance on Nob Hill. This was a personal preference, however, and not a reflection on the hotel itself. The hotel is in a great location although some of the area is a little \"urban\". However, this is a great hotel and you can usually get good bargain rates through Expedia or Priceline.", "helpfulness": 3, "user": "Mid_West_Traveler", "date": "August 11, 2004", "id": 2440248}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "After three days of being \"pampered\" at nice inns and b&bs on the road, the Parc 55 Renaissance was slightly disappointing. As with any big-city, corporate hotel, the little things were missing or cost extra. No coffee maker in the room, no robes, no free continental breakfast, no pool, no free Internet. Local calls cost $1. There was free coffee/tea in the morning on the 2nd Floor. By the by, concierge was rude to us when we asked about airport transportation. :(", "title": "Basic Corporate off Union Square", "helpfulness": 3, "user": "cruisingbug", "date": "August 10, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2437716}, {"rating": 5.0, "title": "Very Nice Hotel. Great Service!", "text": "This hotel sits right on the line of the Tenderloin. If you go out of the hotel one way (east), you will encounter panhandlers. But on the other side are some nice restaurants and the very short walk to Union Square. Easy to get to public transportation on Market St.", "helpfulness": 4, "user": "Christelyn", "date": "August 9, 2004", "id": 2431826}, {"rating": 4.0, "title": "Book it through Priceline & it's worth it", "text": "The view from our 24th floor window was nice, although other buildings blocked out the Bay Bridge and other SF landmarks. The Parc 55 did have a sauna (seemed like no charge - didn't get a chance to try it) and fitness center. Nice Bath and Body Works brand toiletries. This hotel has Air Conditioning, which not many in SF have. We did use it the first day - it was about 70F outside but the sun was shining in (!!!!) and made our room quite warm during the day. Of course it cooled off at night.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 2, 2004", "id": 2362196}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This is the perfect location for seeing all of San Francisco. We had never been and the concierge was extremely helpful. We could walk or take a trolley almost anywhere. Pricelined for $115, it was worth $250. Parking was expensive ($45 per day).", "title": "Perfect location, great hotel!!!", "helpfulness": 2, "user": "RobAshleyS", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17167809, "likes": {"liked": "— The concierge", "disliked": "— Price of parking"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I booked this hotel for one day to go into the city for my birthday. When we got to the hotel we booked a view room, but when the reception found out it was my birthday, they upgraded me to the club rooms which was nice. The club room comes with access to the club lounge which you can get appetizers, desert, and breakfast. The overall hotel was nice, our room was on the 29th floor and we had an amazing view of the city. If you are going to stay here (which i recommend) then I suggest you book the Club rooms because they are much nicer. When you walk into the hallways of the other floors (not club) the walls are very plain and boring. But when you get into the club rooms. you have nice wood pannels. Overall this hotel was very nice and a wonderful birthday stay!", "title": "Wonderful Stay", "helpfulness": 1, "user": "wakenswimmin11", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17165372, "likes": {"liked": "— The nice service/ reception, and the club lounge", "disliked": "— Kind of far from North Beach, that was a LONG walk"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We had a perfect stay here on our family vacation to SF. The hotel is in a great location--next to the cable car turnaround (buy the 3-day pass) and a block off Union Square with shopping my teenage girls only dream about. The concierge was particularly helpful, giving us great restaurant recommendations (not the same old tourist traps) and getting us preferred seating at a very popular rooftop restaurant overlooking Union Square (which made for a perfect last night in SF). The rooms were clean, roomy and best of all had a great view of SF. We stayed on the club level which is a great value as it included a lovely breakfast (Starbucks coffee), snacks and dessert, and just that added space so all four of didn't have to be in the room at the same time. The Hertz desk arranged to have our car brought from another location to the hotel so we could begin our drive down the coast. I'm an experienced traveler (Million Miles on Delta) and it is not easy finding a good hotel for a family with two teenagers without buying a second room. This was a perfect hotel. Be sure and take the Alcatraz tour (book ahead) and we loved the Movie Tour that shows you clips of dozens of movies made in SF while you visit them. We saw more on that tour than on the double decker bus tour. Pick up at Union Square convenient.", "title": "Perfect Family Stay in SF", "user": "rchasewms", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17152727, "likes": {"liked": "— great location", "disliked": "— no free wifi in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I stayed at the Parc 55 for 5 nights in September. Upon arriving into San Francisco (for the first time), I caught the Bart Train (Bay Area Rapid Transport) into Powell Street. I got off the train - walked upstairs and out the doors - There was the PARC 55. A 2 second walk across the street and I had reached my accommodation. This was very convenient for me as I was traveling alone at that stage and was a little worried about being in such a big city (well, bigger than Auckland that is!!). I need not worry at all. It was in good proximity to Union Square and also the Powell Street Tram (turnaround just over the road) as well as local restaurants & bars. Good shopping in the area too! I ended up walking down to Fishermans Wharf (took around 45 mins and a few steep hills) but was really nice! From here we rented bikes and biked over the Golden Gate Bridge !!! That was fun. I recommend this property to all of my clients for convenience reasons. It was well furnished (Modern) with a bit of a few of the bay!! Was a tad on the expensive side at the time we went as it was peak time due to a conference in the area but I liked it and would definately stay here again!! I did not thing my room was run down in anyway and wasn't concerned at being on a higher/lower floor at all!!! Loved it!!", "title": "Loved my stay!!", "helpfulness": 1, "user": "AnnaFlighty", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17117574, "likes": {"liked": "— Location, Location, Location!!!!!!", "disliked": "— A wee bit pricy!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I stayed there with my friends one night after having stayed at other 4-star hotels in the area on previous nights for a conference. What a difference!! Everything seemed new/or newly renovated. The decor was simple and modern. The carpet was very cush. I don't understand some reviews complaining about water spilling on the floor blaming on the shower curtain lining as we did not have this problem (and there were 3 girls sharing the room!). Yes, there is a $14 a day for internet if you choose to use it, but that was the case in every other hotels that I stayed at. The best thing was the well-equipped gym free of charge! They even had fresh fruit. The treadmill and the elliptical machines were new and gym-quality.", "title": "Excellent", "user": "jibichae", "date": "June 19, 2008", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17054724}, {"rating": 4.0, "title": "Great hotel, and location, location, location!", "text": "My friend and I have never been to San Fran. We picked the Renaissance Parc 55 via Expedia.ca and we were not disappointed at all... we loved the hotel, the services, and most of all its location. We had a corner room (with a lots of windows) on the 26th floor with an amazing view over the city (west side). The staff at the front desk at our arrival were very nice and tried to give us the best room available based on what we paid (deluxe with King bed). The hotel provided free coffee everyday on the second floor. Ok, it was not Starbucks, but still good!!! We had a fridge in the room, which we had to pay a bit extra ($25) for our stay. But God it was worth it...At the end of the day after walking all day, you need your cold beer to relax! The staff were very helpful, especially the front concierge where they can book tours for you. They were able to get us some tickets for Alcatraz.", "helpfulness": 3, "user": "Samtroteur", "date": "August 2, 2004", "id": 2361989}, {"rating": 2.0, "title": "An average Renaissance", "text": "You can book tours at the front desk but there is a $5.00 fee; brochures can also be found at the desk where you can browse and select a tour yourself. Overall great location, great services, nice staff.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2329728}, {"rating": 4.0, "title": "Feel Neutral About Experience", "text": "The large 1980s marble lobby is probably the nicest part of this hotel. The 4 star rating should be 3.5. The room was large and clean with an ok bath (not luxurious by any means). We had a high floor so no city noise. Corridors are bright and newly carpeted. Our dealings with the hotel staff were minimal, so I cannot fairly comment on the service. Superb location near the Powell Street Cable Car, Nordstrom (and 2005 the new Bloomingdale's), Abercrombie, Gap, and two blocks away from Union Square with almost every luxury retailer you could want. BART within 30 yards and one block away is the Market Street trolly. However, San Francisco is loaded with beggers, panhandlers and homeless people. Interestingly, NONE of them are of Asain descent...ponder that. They seem to congregate near the subway area (big shock!) but are not aggressive. Not a plethora of restaurants near the hotel, and the doorman did advise (read: warn) us not to venture onto the streets toward the rear of the hotel. We took his advice and had a great safe trip. Fisherman's Wharf is little but T-shirt shops and mediocre tourist restaurants. Don't miss the cable car...even if there is a long line. One other item: The bus tours to the wine country are little more than sales pitches at the wineries to get you to buy their wines; highlight of that tour was 2 hours in the town of Sonoma.", "helpfulness": 6, "user": "Brian C", "date": "July 21, 2004", "id": 2312206}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "We knew little about the city before we went. We were concerned about some of the postings that rated hotel average---and homeless a problem.", "title": "Pretty Good - For the Money", "helpfulness": 7, "user": "bar01", "date": "July 19, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 2307947}, {"rating": 4.0, "title": "Overall a very good hotel", "text": "Here is what we learned:", "helpfulness": 5, "user": "Calif-FloridaBoy", "date": "July 7, 2004", "id": 2273260}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Nice hotel, rooms on the top floors have a nice view Receptionists and concierge were very nice and helpful. The only minus I can state is that parking for guests is pretty expensive - 40 usd per 24h.", "title": "Nice hotel, near the center of the city", "user": "Ilia T", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7973286, "likes": {"liked": "— Location, rooms size and quality", "disliked": "— Parking fees"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Stayed here for 5 nights from June 5 -June 9. We booked through the hotel web site and got a great deal. It appears that the only problem here is the check-in staff. We had reserved a room the same day that our friends had reserved their room, we chose the same catagory and requested in the comments that we be placed on the same floor near each other. When we checked in we were on two different floors. This was handled quickly and changed so we could be near eachother. This is not a big deal at all however, the employee that checked me in was quite rude and either inexperienced or just didn't care. The employee that checked our friends in was quick and friendly and resolved the issue. Our check in was pretty quick, about 15 minutes, however this hotel caters to the airlines it seems and there was always a large amount of flight crews there. Numerous days we saw check-in lines at least 20 deep and only 2-4 employees working. We heard numerous people complaining about waiting over an hour to check in. So only problem seems to be the check in.", "title": "Great Location, Great Rooms", "user": "se2121", "date": "June 23, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7971187, "likes": {"liked": "— Location", "disliked": "— Check-in staff/experience"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We had a room on the 27th floor with amazing views of the city. There was noise in the room but what do you expect when you are in the middle of a large city. We heard police sirens all night long but once again what do you expect! The room was amazingly clean and we always had turndown service with a chocolate and the next days weather left on our bed. This was wonderful. The shower had awesome water pressure and it seems that they are still using the Marriott soaps and shampoos.", "title": "no problem parc 55", "helpfulness": 3, "user": "RL2", "date": "June 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7967872, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Our room included free breakfast and afternoon snacks. The breakfast was simple but great. Always had free juice, water, and soda. There was always fresh bread and some pastries. There was meat to make a sandwich and lots of cereal with fresh fruits. The afternoon snacks were not bad. We only went up there twice, once was chicken wings which were ok and the next time there were little pizzas. I thought that alcohol was included in the afternoon snack but it isn't, they have an honor bar.", "title": "Great location", "user": "verymerry", "date": "June 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7967676, "likes": {"liked": "— Location", "disliked": "— No refreshments in room"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The workout facility at the hotel is not bad. An area of barbells and a couple multi exercise machines. Several treadmills. Nice towels to stay clean and that have a steamroom. THe only thing that is missing is no pool or hot tub.", "title": "Great hotel if discounted", "helpfulness": 2, "user": "UNR91", "date": "June 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7958962}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Stayed three nights 4/20 to 23. Very nice hotel, Well worth the price. Very large , Very clean, Great location (steps from BART). Would stay again if not in San Francisco. Every where you go there is Homeless Begging. I did not see one uniformed policeman the whole 4 days we were there. I hope they are all undercover. At Fishermans Wharf we watched a \"three card monte\" game going on for hours. They took a lot of money from a lot of people. No Police in sight. BEWARE. Took a tour on a double decker bus for 2 days and also a ferry to Alactraz it was very nice and worth the price. Glad to be home ALIVE.", "title": "First Class Hotel, Rough city", "helpfulness": 1, "user": "DavyGGG", "date": "April 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7479917, "likes": {"liked": "— Large clean room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Was pleasantly surprised and pleased with the quality of this hotel for the price. Parking is costly, but the need for using a car is limited because of location.", "title": "Great Hotel, Great Location", "user": "Okie37", "date": "April 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7478799, "likes": {"liked": "— Service and location", "disliked": "— Cost of parking"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Very nice lobby and rooms. Will stay again.", "title": "Good Value", "helpfulness": 1, "user": "OsideMom2three", "date": "April 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7472151, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Sayed here April 9, 2007. Great location for shopping. Room was very clean, though a little worn around the edges. The parking was $47 (for an SUV) for a 24 hour period but you do have in and out privileges and that is quite reasonable for SF. Valet staff were very courteous. Overall for what we paid, it was a great deal and I would stay here again.", "title": "Wonderful Hotel", "helpfulness": 1, "user": "Jaeger_10_08_05", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7394914, "likes": {"liked": "— Location", "disliked": "— No fan in the bathroom."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "We only stayed here two nights, but it was a great hotel for the great deal we got for it on Expedia. We booked a non-view room, but upon check-in, asked for a view, and was given one on the 21st floor. The room was spacious and the beds were very comfortable with many pillows. I would highly recommend this hotel and if you are looking for a deal, this is it! Also, as everyone has stated, the location is awesome. We took the BART from the airport and we stepped out of the station and the hotel was right there. Very convenient!", "title": "Great location", "user": "auttapol", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7392843}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Great hotel, excellent location. Next to a BART station, so a direct and easy connection to the airport. The little pastry shop at the left side of the hotel has great coffee and sandwiches. Large room with a large, comfy bed. The rooms may be starting to get a bit worn down, but at least the are clean! Recommended!", "title": "Good place to stay in SF", "user": "PBNL", "date": "July 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8075360, "likes": {"liked": "— Location, bed", "disliked": "— back side of the hotel at night (homeless people)"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed 4 nights in a Club room at a rate of $155 per night. After our flight from Las Vegas we caught the Bart from the airport to Powell Street Station and it was quick couple of minute walk to the hotel. We were lucky when we arrived that not too many people were checking in so we were promptly allocated our room on the 21st floor.", "title": "Location,Location", "helpfulness": 1, "user": "mole", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8075339, "likes": {"liked": "— location", "disliked": "— internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The room was extremely well maintained and cleaned to a high standard. Very comfortable bed with lots of pillows, easy chair and desk. The bathroom was quite small with a shallow bath and overhead shower. Although the hotel is no longer part of the Marriott chain the bathroom amenities (soaps,shampoos etc) were stil the same as the Marriott use and were replenished frequently. A coffee/tea maker was also in the bathroom and supplied daily with coffee/tea bags.", "title": "reservations needs work", "helpfulness": 1, "user": "midliferDallas_Texas", "date": "July 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8063020, "likes": {"liked": "— location", "disliked": "— reservations"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "The club lounge had nice views of the city and was a relaxing place to have a drink. Breakfast was continental but rather limited and the lounge was closed from Friday evening until Sunday evening. We got the room for a good rate so werent too worried however would not pay a significant amount to stay in the club room as the lounge facilities are not great. No internet access in the club lounge or the business centre although you can pay for internet at an area near the bar on the 2nd floor. There is a good little coffee shop located next to the hotel great for grabbing a quick coffee/hot chocolate and a donut etc and very cheap.", "title": "Great Location, Great Hotel", "user": "Italianissima73", "date": "July 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8039055, "likes": {"liked": "— The bed was really comfortable", "disliked": "— The homeless people in the area - but this turned out to be all over San Fran."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The location of the hotel is fantastic for accessing transport including the cable cars and the Bart system and lots of shopping nearby and a quick walk to Union Square. There are a lot of homeless around the area and in San Francisco in general however we never felt threatened.", "title": "$40+ tax parking", "user": "nanasf", "date": "July 2, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8037968, "likes": {"liked": "— VIEW", "disliked": "— CUSTOMER SERVICE, PARKING CHARGE"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We picked up a 3 day passport , 18 $, to be used on , muni, cable cars , trolly cars for unlimited rides..good bargin.", "title": "Great rate and location", "user": "Wiserblond", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7958271, "likes": {"liked": "— location", "disliked": "— No free Internet or Wi-Fi available."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed there 3 nights , no problems what so ever, staff was friendly, instead of the concerierge , ask the BellMen for directions, info, etc.. they were very accommodating .", "title": "Awesome Hotel with a couple quirks", "user": "allisontebbe", "date": "June 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7938922, "likes": {"liked": "— location", "disliked": "— Internet Access"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "Excellent room, great location. The deal via Hotwire was exceptional (less than $100) so the value was superb. Shame the high speed net isn't free.", "title": "Excellent room, great location. Good value via Hotwire", "helpfulness": 1, "user": "korokoro", "date": "September 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8866130}, {"rating": 4.0, "title": "Loved the Place", "text": "We went for our 40th anniversary on Sept 5, 2007 for 4 nts. and had a wonderul time. The location is ideal for any transportation. Took the Bart right from the airport and only cost $5.15 each. It is practically out the door from the station. The Cable, trolleys,buses etc. are across the street. We were only a few blocks from the theatre and Union Square 2 blocks away with all the shopping you could want.", "helpfulness": 4, "user": "mahenry", "date": "September 21, 2007", "id": 8841501}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The service at the hotel was excellent, we had a real sweetheart at the desk that could not have been nicer. Stayed on the 26th floor with a gorgeous view of the city. The room was spacious, nicely decorated and very clean. The bed was comfortable. I would recommend staying above the 19th floor because there is city noise and construction noise that may bother you. We had breakfast at the Club room each morning and it was wonderful with great service, they also had drinks etc. in the evening with a fabulous view from the 31st floor.", "title": "Great Location", "helpfulness": 4, "user": "colkiwi", "date": "September 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8825852, "likes": {"liked": "— Cleanliness and views of city", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The concierge desk is very helpful with all your needs and directions for what to see being taken care of.", "title": "Great Location", "helpfulness": 4, "user": "colkiwi", "date": "September 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8755904, "likes": {"liked": "— Cleanliness and views of city", "disliked": "— n/a"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The only down side was $40. a day to park. We flew in so that was not a problem and after our stay we headed back to the airport rented a car and finished our trip to Napa,Reno and Tahoe. We figured we would not need a car in the city. Also if you will be there a few days or more get a pass for all the transportation for a flat rate. It was $18 for 3days, where as just a cable car ride one way was $5. so a very good deal.", "title": "Never again", "helpfulness": 1, "user": "sweetka", "date": "September 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 8739089}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We just returned from a 3-night stay at the Parc 55 (March 15-18). Let me say first that I pride myself on finding travel bargains. I'd much rather spend my money on good food and wine than on a hotel room. San Francisco has always been an expensive city for travelers, and finding an above-average room at a bargain price can be a challenge.", "title": "Good value and excellent location", "helpfulness": 9, "user": "CrabGuy", "date": "March 22, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 7201860, "likes": {"liked": "— Location and access to shopping, museums and transportation", "disliked": "— No in-room safe for valuables"}}, {"rating": 2.0, "title": "Charged for no-show when I had cancelled", "text": "I began researching SF hotels back in December and found the Parc 55 on Trip Advisor and Expedia. I always book directly with the hotel, as the rates are often equal to or lower than the travel websites and you can always cancel the reservation if you find a better rate elsewhere. I booked a king deluxe room on a high-floor and requested an early check-in (1:00pm). When I originally booked in January, the rate was $149. In mid-February, I re-checked the hotel’s website and found the same room for $95, so I rebooked and cancelled the first reservation and saved enough money to buy my wife and I a very nice dinner.", "helpfulness": 1, "user": "Rea27", "date": "March 13, 2007", "id": 7155016}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I called the hotel 3 days before our arrival to confirm, and informed them that our flight had been changed and that we now expected to arrive around 10:00pm. They assured me that our room would be held. When we arrived at the hotel at about 10:10, the desk clerk informed me that they had no record of our arrival time change and that my king room was no longer available, but that they could put us in a queen deluxe on the 20th floor. She did not apologize, or offer some kind of complimentary perk. After a long day of travel from the east coast I was too tired to negotiate with the manager, so I accepted the offer.", "title": "Perfect Location", "user": "sfbness", "date": "March 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6940899}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The room (Room 2001) was clean, comfortable and very spacious for a big-city hotel, with lots of windows and great views. The closet was large, with plenty of hangers, but no safe for storing valuables. The bed was great – firm mattress, lots of pillows and nice linens. The bathroom was large and clean, and included a one-cup coffee maker. There was no mini-bar fridge (which I would never use anyway). Internet access was available (for a fee), but I carry a Blackberry for emails and leave my laptop home when I’m traveling for fun.", "title": "Very mediocre", "helpfulness": 1, "user": "Nicole R", "date": "March 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 6936283, "likes": {"liked": "— View from room", "disliked": "— Noise, cost, dated"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I noted that some travelers complained about the city noise, even on high floors. Folks, this is a large city, and you’ll hear police and fire engine sirens, as well as some street commotion. If you want silence, go camping. Otherwise, use the free earplugs provided by the hotel.", "title": "I love this hotel", "helpfulness": 2, "user": "someseesee", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6927278, "likes": {"liked": "— Customer services", "disliked": "— None"}}, {"rating": 4.0, "title": "Parc 55 still a walk in the park", "text": "I had stayed at the Parc 55 (and its predecessor, the Ramada Renaissance) perhaps a half dozen times during the eighties and early nineties. I always enjoyed the location and found the rooms to be clean and comfortable. I was a little worried when I read some of the reviews here in Trip Advisor which warned of indifferent staff and aggressive panhandlers, but decided to book a room anyway. Even though there were a bunch of people waiting in line to check-in, the process was surprisingly quick and efficient. The room (and bed) was very comfortable, the street noise only minimally audible, and the staff was fine. Barring bad weather or physical problems, SF is a great city to walk around in ... Parc 55 is a great location ... I recommend walking to Bocadillos (Basque Restaurant) in the shadow of the Transamerica Building for a good walk and excellent (but casual) meal!", "helpfulness": 3, "user": "Flankster", "date": "October 28, 2007", "id": 10406305}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We booked this hotel because the rate seemed reasonable for San Francisco but we feel we would have been better off paying a bit more for a better hotel. The room is not too bad but our bathroom was in the need of some updating and the plumbing needed some work. We waited for so long for our luggage to be delivered that my husband ended up going and getting it himself. When we approached the conceirge with a question he was rude even though he had been standing doing nothing at all. Don't plan on eating breakfast at the hotel as the prices are ridiculous.", "title": "Skip this hotel", "helpfulness": 2, "user": "Ontario_Sun_lovers", "date": "October 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 10218609, "likes": {"liked": "— location", "disliked": "— rude staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The best part about the hotel was the location for day travel. It is close to all means of transportation which is really important because you should avoid coming in by car if possible. The valet rate is $40 per night! There is really good shopping nearby however I do feel that this area is not safe at night. We went for a walk but returned very quickly because there were many, many beggars and street people as well as teenagers fighting in Union Square.", "title": "Great Location, as long as you don't stray off the beaten path", "helpfulness": 7, "user": "melglaz", "date": "October 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10175782, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I just stayed at the 55 Parc for a conference in October 2007 and since I travel fairly often to SF I wanted to note that this was was one of the better hotel experiences that I've had in the city, despite the hugeness of the hotel.", "title": "Not fabulous, but pretty nice....", "helpfulness": 3, "user": "Minivern", "date": "October 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10112161, "likes": {"liked": "— Location", "disliked": "— Noise, Dated Decor, Not as Clean as I'd Like it to Be"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The hotel rooms are kept up quite nicely and the staff is very helpful. The lovely rose in my bathroom and the gourmet chocolates at", "title": "In like Flynt", "helpfulness": 3, "user": "spoon47", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10101341, "likes": {"liked": "— location", "disliked": "— Quiet bar area"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the Parc 55 the week of 4th of July. We had one minor bump in our check in process - they had our last name spelled wrong (most likely an error in transferring the reservation from Expedia) so it took an extra minute to locate our reservation, otherwise this place was top notch! It couldn't be more convenient to public transportation around the city and to the airport. You are right in the heart of Union Square. We had breakfast each morning from the small coffee shop on the corner - it was cheap and easy. The only hotel restaurant we ate at was the pub - a little pricey, but what do you expect?", "title": "Loved the Parc 55!", "user": "goRedSox1", "date": "July 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8232148}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We found the rooms to be very nice and the beds comfortable. The only thing was the bathroom didn't have a vent so it got quite steamy in there.", "title": "Good hotel, but don't park at the Parc!", "helpfulness": 1, "user": "IndianaDan", "date": "July 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8193062, "likes": {"liked": "— Location and value", "disliked": "— Valet parking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I would definitely stay at the Parc 55 again - it is a great hotel for a great price!", "title": "Parc 55, awesome views & great rooms", "helpfulness": 4, "user": "Ileftmyheartinsf", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8176576, "likes": {"liked": "— Great views and room", "disliked": "— no free internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "Hotel was reasonably clean, but the room was a bit dated and the carpet was pretty old. Staff friendly, but carry cash for frequent tipping! Breakfast at the hotel restaurant was good, but rather pricey (almost $20 per adult). I do not recommend the valet parking at the hotel- - it is also somewhat costly and you have to often wait for a long period while they retrieve your car. I recommend parking at one of the nearby garages if you don't plan on driving in and out frequently. I paid $15 for overnight parking a block or so away, versus $40 plus tax and valet tips in the hotel garage.", "title": "Great location", "helpfulness": 2, "user": "savtrav22", "date": "July 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8141461}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Check in was great and front desk was extremely helpful. Stayed for 3 nights at a summer promotion of $99/night with my fiance. I would suggest confirming reservations a day or two before you arrive to avoid complications other people say they have. The view we had on the 26th floor was awesome. The bath amenities were lovely and housekeeping was great. We were very happy with the location of this hotel. Minute walk from BART, cable car turn-around, muni buses. Highly recommend getting a passport for 3 or 7-day from visitor center a block away that lets you have unnlimited rides. Yes there are LOTS of homeless people, but there are EVERYWHERE in union square so don't act surprised tourists. Our experience was that they were not too aggressive and some were actually nice. The only thing I wish was that internet access was free (in the room (as it should be in an area like that) and a refridgerator would have been nice and convienient. Another thing was that walls were surprisingly thin, we could hear regular conversations in the next room, but it was more personal enteratinment hearing the person singing in the shower next door. Other than that LOVED Parc 55 and will stay again for the aforementioned rate!", "title": "Still suffering", "helpfulness": 1, "user": "tim150978", "date": "July 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 8134250, "likes": {"liked": "— Nothing", "disliked": "— Staff were unable to do their jobs"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed 4 nights at the Parc 55. Easy access to BART, cable cars and easy walking to the Embarcadero. The noise at night was disconcerting even on the 20th floor, even with a sound machine going. Lots of city noise but hey, we are in the heart of the city- what else would we expect? The concierge was very helpful. The staff at reception was funny and friendly. The room was very clean and a nice size, much larger than the boutique hotels where we have stayed before. The amenities were from Lather, all natural and from a local company. The hair dryer stopped working and they replaced it quickly. We were with friends. They had only one complaint- coffee in the room. Oh there was a coffee maker but evidently, the coffee was blech. We don't drink it so I couldn't say. No honor bar, no mini fridge but very soft, dreamy linens, comforters and pillows.", "title": "Wonderful staff, big rooms", "user": "edhodge", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7840264, "likes": {"liked": "— Location", "disliked": "— city noise"}}, {"rating": 1.0, "title": "Horrible", "text": "I stayed at this Hotel to attend a Major Conference at the Moscone Centre. This hotel double-charged me for my stay. It is not so much the mistake itself that leaves me with a poor impression of this establishment, it is their unprofessional and incompetent handling of the problem. I have now returned home and called the hotel three days in a row, and the staff seem unable to comprehend the problem. They keep asking if they can call me back, taking my phone number and then I dont hear from them. I have been double-charged before, but high-quality hotels usually deal with problems like this quickly and with professionalism. I am very dissappointed in my experience with this hotel, and I dont feel that I could recommend a stay with them to anyone.", "helpfulness": 1, "user": "astroToronto", "date": "June 8, 2007", "id": 7807487}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed at Parc 55 for 2 nights in June of 2007 (booked via priceline at $150 a night).", "title": "Nice price, large rooms", "helpfulness": 1, "user": "Gina M", "date": "June 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7806727}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "First basics:", "title": "Good for the price", "user": "leggsworth", "date": "June 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7804020}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "1. The hotel used to be a part of Renaissance chain-- expect standard decor and larger than usual rooms.", "title": "Parc 55 Is Perfect!", "helpfulness": 1, "user": "croletter", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7803568, "likes": {"liked": "— Location", "disliked": "— Parking rates"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The reviews are right, the location of this hotel could not be any better. You are surrounded by everything you need. It is located 1 street over from the cable car line and BART station. The is a mall one street over and the hotel is surrounded by numerous stores of all varieties, all within walking distance, if you enjoy shopping. For dining there are 2 restaurants located on the 2nd floor of the hotel or there is a Burger King and a Carl's Jr directly across the street if you prefer fast food. The hotel offers a nice 24 hour fitness center on the 5th floor.", "title": "Great hotel, excellent location!", "user": "shelma", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16442747, "likes": {"liked": "— The location", "disliked": "— High cost of valet parking"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "The staff is very friendly. They normally charge additional for 2 queen beds instead of 1 king but upon request at check in we were given the 2 beds at no additional charge. We did rent a car so did take advantage of the valet service. It is $44 + 14% tax a day. I believe that is an excessively high price but you have all day in and out privileges and it never took longer than a couple of minutes for them to bring our car up and they were always very friendly and courteous.", "title": "it was perfect!", "user": "thirstytraveller1", "date": "May 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16305346, "likes": {"liked": "— it's near evertthing. Even the BART subway station."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The rooms are decorated nicely and the beds were really comfortable with lots of comfy pillows. Do be prepared that you are in a city and will hear city noises! There is a fire station located within a few blocks of the hotel so you will hear sirens in the night or very early morning. Ear plugs are provided with their toiletries. There also is an extremely large homeless population in San Francisco and the hotel is surrounded by them so do be prepared to be begged for change. These are things to expect at any hotel in San Francisco however are not vacation spoilers.", "title": "Solid choice, great location", "helpfulness": 2, "user": "CrystalVancouver", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16221291, "likes": {"liked": "— Clean, spacious rooms, nonsmoking hotel, excellent location, decent value for money.", "disliked": "— No fridge/minibar in room, Internet connection variable."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I would definitely stay at this hotel again! For the great service and very reasonable rates I would highly recommend this hotel.", "title": "Good Hotel, Good Location", "helpfulness": 2, "user": "MichelleNSam", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16205850, "likes": {"liked": "— The bed and the view"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Hotel was very cheap for the location ($99 US/night and we were there on weekends too). It's right beside the San Francisco Shopping Centre. A hop away from Powell line cable car station, a block away from Union Square... what more would you want?", "title": "Excellent Hotel", "helpfulness": 1, "user": "davidmcl", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16148428, "likes": {"liked": "— location and standard", "disliked": "— none"}}, {"rating": 3.0, "title": "Good, but nothing special", "text": "It's your basic corporate hotel; it is not a luxury hotel. However, there are luxurious touches; the bedspreads, linens, and pillows were nearly top-notch in comfort and quality. (The sheets had a high thread count.) The carpet was in excellent shape. The room actually was quite large; for San Francisco, that is a rare thing. The bathroom seemed a tad dated. All in all, the place was spotless. Common areas were in excellent condition. The marble lobby gives a patina of elegance, but, in fact, it really is your basic corporate hotel. Not as nice as the nearby Hotel Nikko, but then you'd pay more for the Hotel Nikko.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 27, 2004", "id": 2604317}, {"rating": 3.0, "title": "Not so good.", "text": "I found it through Priceline after making a bid for $75 per night--an INCREDIBLE deal. (On Priceline, you make a bid for an area of the city--in this case, Union Square--but don't know where you'll actually be booked until after the binding reservation is made.) I don't believe the room is worth the advertised rack rate of $180/night--for that price, I'd rather stay at the Hotel Vintage Court or another boutique hotel. (My philosophy is that, unless it's a special occasion and really want to handpick your hotel, you can save a bundle by booking a room through priceline.com.)", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571526}, {"rating": 4.0, "stay_parameters": "Stayed August 2004, traveled on business", "text": "If there is a problem with the hotel, it is the immediate neighborhood. It's a little, but just a little creepy. Fact is, nearly every block around Union Square has a creepy feel to it.", "title": "Above average", "helpfulness": 2, "user": "FromGB", "date": "September 9, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2520286}, {"rating": 5.0, "title": "Loved Renaissance Parc 55", "text": "More like a 3 star hotel - terrible beds, old bathrooms, broken safe, and worst of all - $40 a day for parking - stay away!!!", "helpfulness": 4, "user": "RWlover", "date": "September 5, 2004", "id": 2514401}, {"rating": 5.0, "title": "A Touch of Class", "text": "I spent nearly a week in this hotel in August. It's well situated for the shops and the cable car. The rooms are large, clean, the usual standardised chain room. The bathroom was a bit disappointing, small bath, integral shower. No coffee maker in the room and no safe were other downsides.", "helpfulness": 6, "user": "PaHunter01", "date": "August 30, 2004", "id": 2502016}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I were a little nervous about staying at Parc 55 b/c the rates were so low. (we paid only $120/night) All the reviews on trip advisor seemed fine, and by the pictures it looked to be a nice hotel. They were right! The hotel was recently renovated, and so all the furnishings were up to date and very nice. It seems like it was an old Hilton or Hyatt that was bought and updated. It's not the 'boutiquey' hotel you typical see in San Fran, but it was a very nice and clean place to retire at night. We would highly recommend it!", "title": "Shockingly, A good experience", "user": "runandbehappy", "date": "August 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18584208}, {"rating": 3.0, "stay_parameters": "Stayed July 2008", "text": "Visited San Francisco for the first time and based on the", "title": "enjoyed my stay at the Parc 55", "user": "pjdc8082", "date": "August 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 18557988}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "price, location and overall good reviews on Trip Advisor", "title": "Plain Vanilla, Overated", "user": "Mercboy", "date": "August 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 18551272, "likes": {"liked": "— Location", "disliked": "— Honesty"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "decided to stay at the Parc 55.", "title": "Better Options Nearby", "helpfulness": 2, "user": "herbkim", "date": "July 26, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 18289237, "likes": {"liked": "— location", "disliked": "— superslow internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Overall grade C ..... Paid a little more and got a corner", "title": "Nice Renovations!", "helpfulness": 2, "user": "SLCMoneyMan", "date": "July 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18246359, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "This was a very nice hotel. Convienent location, clean, nice staff and decent service. The only problem I ran into was, no one knew anything at the helpdesk. We asked how far a restaurant was from the hotel and if it was walking distance. They told us it was a 8 to 10 minute walk. As we were walking to the restaurant, we noticed that we had been walking for a good 20 minutes. On top of that it was extremely cold outside. We were very upset with the poor judgement of the hotel's help desk. There since of direction is VERY poor, so if you don't know where you are going, find out before you stay at this hotel. The area of the hotel is REALLY shady. Homeless people on every singel corner harrassing you at any second they get. I was surprised that a women at the front desk gave directions using the back door, then told me to ignore what ever is happening outside that door. Outside that door was serval homeless people sitting on the stairs bothering bypasser's. If you want to stay in a quiet, nice area, I suggest you stay in Nobb Hills!", "title": "Nice Hotel, but Bad enviorment!", "helpfulness": 1, "user": "RACQUEENS", "date": "May 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 3.0}, "id": 7722760, "likes": {"liked": "— Cleaniness", "disliked": "— The enviorment right outside the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "This was my 2nd visit to this hotel. The last time was when it was called the Renaissance Parc 55. Both times I was there for one night, and it wasn't obvious in seeing the difference between the two stays. I was given a low-floor again, probably the floor above the health club. The 6th floor of Parc 55 is about the 10th floor of some hotels and there was a decent view of downtown Market & 5th Streets. While I was checking out, a huge tour group was packing the elevators. I guess now that the hotel has dropped the Renaissance affiliation, it is catering to budget tourists. Still, my rate of $113 including tax, on Expedia, is a bargain given its location so close to the cable car on Powell, subway to airport and the Westfield shopping mall. But $12.95 for using the Internet for 24 hours is not, when you consider at most hotels it is free. Also, the double lock on my door was out of order, so had to rely on the chain. And after I had checked out, I wanted to use the restroom on the ground floor but it was only open to guests with keys.", "title": "Good rate", "helpfulness": 1, "user": "hydepark", "date": "May 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7636534, "likes": {"liked": "— Location", "disliked": "— Internet is not free"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I'm not sure why I had such a different experience from the recent reviews, but I had a fantastic experience at the Parc 55. I took the BART from Oakland Airport. It was a breeze. And just right outside the stop at Powell Street was the Parc 55. It took about 45 mins from the airport to the hotel (door to door). Who needs a car? There was a line at check in, but the man who helped me knew I had been patiently waiting for about 10 mins and easily accommodated my request to be on a higher floor (I paid for the cheapest room in the place). He put me on the 27th floor with a view of the bay and Transamerica building. I had a fabulous room. Too bad I was just staying for one night for a seminar the next day. I was just steps away from the best shopping (including H&M)! The room was a good size (especially for San Francisco) and had clearly been remodelled. The bed was extremely comfortable. I'd go back in an instant. Also, I thought the bell desk was really helpful. I needed to leave a bag (being in a class all day) after checking out. They were nice enough to let me add things to my bag after I went shopping and before I needed to go to the airport.", "title": "I'd stay here again and again", "helpfulness": 2, "user": "ddetravel", "date": "May 17, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 7635764, "likes": {"liked": "— Location", "disliked": "— Size - a lot of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We found this hotel through Expedia.com. They gave us a great rate for 3 nights. Our hotel was ideally located just one block from the Powell Cable Car station near Market Street. There is a great coffee/breakfast place 50 feet from the hotel with great prices on their food and drinks. Upon check in we were taken to a wonderful corner room that was very spacious. The room had lovely bed linens and two lovely windows with views. The staff were really great, and they have a rent a car service right in the hotel, which came in handy when we wanted to rent a car for one day to travel to the Muir Woods. During my 6 nights in San Francisco, I stayed in 3 different hotels (different events). However, the Parc 55 was my absolute favorite! I would definately stay there again.", "title": "Loved the Parc 55", "helpfulness": 2, "user": "LovetotravelABQ", "date": "May 14, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 7615766, "likes": {"liked": "— it's location in San Francisco", "disliked": "— nothing."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "While the location is very central and convenient, the hotel is very poorly managed and will make mistakes at every possible opportunity with no apology. We booked via their website, no middlemen, but were assigned a much cheaper room when we arrived. We had booked a Club level room, which was about $45 more than the room they were going to put us in. Worst part, he didn't say anything about not getting the right room type. Had I not mentioned anything- we would have been taken advantage of. Instead of an apology, he gave me attitude. We did end up getting the right room, but it took over 15 minutes when checking in.", "title": "Needs Help", "helpfulness": 4, "user": "TheMightyTrev", "date": "May 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 7615709, "likes": {"liked": "— Location", "disliked": "— terrible service, tons of mistakes, work being done"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had a great view of southwest San Francisco (we were on the 17th floor), and the room was in excellent condition. No extra or hidden charges, pleasant hotel staff and the entire stay was stress free. We are staying there again next week for the Fillmore Jazz Festival and anticipate another great weekend. The convenience of the location and the quality of the hotel and the $99 rate featured on travel websites such as Hotwire, Orbitz and Expedia makes it a steal of a deal! Try it out!!", "title": "At the Heart of San Francisco Shopping", "user": "SanDiegoLarry", "date": "June 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7938844, "likes": {"disliked": "— The lack of a pool or Jacuzzi."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "When I transferred to San Francisco, my company put me in the Parc 55 Hotel for 20 days. For 20 days, you'd better like the place you're staying! And it turns out, I did! The location is perfect. Parc 55 is located right on Market Street, across from the best mall I've ever been to (Westfield). It's like Vegas for shoppers.", "title": "Great Location", "helpfulness": 1, "user": "LAStravel", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7900190, "likes": {"liked": "— Location", "disliked": "— The walls are a little thin and you could hear people in the hall, but everyone was mostly quiet."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The actual hotel is really nice. My room had an amazing view of the Grace Cathedral and the sunsets were priceless. The room was very clean and the staff was amazing.", "title": "Not Impressed", "helpfulness": 1, "user": "KGrrlRox", "date": "June 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 7841138}, {"rating": 4.0, "title": "Great for the Price", "text": "The Parc 55 is a great hotel for the value. We took a gamble and booked on Hotwire, but were pleasantly pleased with what we got for $110 a night. The checkin was smooth, room service was good and the valets were fast and helpful. The concierge was a bit snotty, but hey, it happens.", "user": "TxAggieGirl", "date": "April 16, 2007", "id": 7374353}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "The only bad thing was the Friday night we were there, some drunk morons were down in the street yelling and doing their best to get hit by taxis at 1 a.m. We could watch them from our room and wished we could have thrown water balloons at them or something to make it more interesting...", "title": "Great location", "helpfulness": 2, "user": "krissydorset", "date": "April 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7342065, "likes": {"liked": "— location", "disliked": "— A little impersonal"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Even though we were nine floors up, it made sleep tough for a while. No wonder they have complimentary ear plugs in the bathrooms! Overall, a nice hotel with a great location.", "title": "Adequate but not an upscale hotel", "user": "travelbunnorita", "date": "April 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7331842}, {"rating": 5.0, "title": "Great location, great value", "text": "Booked two rooms online, based really on position, and were delighted. Large clean rooms, helpful staff, would not hesitate to recommend. Central to all we wanted and handy for transport to airport (BART), trolley buses and trams. Aware of homeless but not intimidated by any.", "helpfulness": 5, "user": "UKKJ", "date": "April 8, 2007", "id": 7293387}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at Parc 55 over the weekend and found it to be a fair hotel in a central (but not nice) part of downtown SF. I would echo some of the other reviews in saying that while the rooms were clean and the staff were professional, DO NOT come here if you are expecting a 4 star (i.e. Westin, Sheraton, Hilton) type hotel. Having stayed at multiple large-scale business hotels in downtown SF, Parc 55 is on the very bottom of that range. Definitely doesn't deserve its AAA four diamond. Come here if you want a central location and if you can get a much lower rate than from other hotels, but given the choice, I'd definitely recommend going elsewhere.", "title": "Mixed Bag at the Parc 55", "helpfulness": 5, "user": "Ojaigal", "date": "April 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7292815, "likes": {"liked": "— Location, view room", "disliked": "— Staff were not friendly; room was not well cleaned"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Although the Parc 55 is one of SF major hotels, I have never hear great things about it so I was just a bit skeptical. Because it is a large hotel, the room was a bit hard to find, it feels almost like a beehive. However, the room we got was a pretty large room with floor to ceiling windows on one side of the room. Even so, the room looks very much dated and in need of renovation. The carpet looks old, the furniture, the curtains, even the television. The windows also need cleaning. Although I was happy enough with the room, I would hesitate to rate it higher than 3 stars as shown on Expedia, and even their rates seem to high to me. The location of the hotel is both good and bad. It is right in front of the BART station, across from Westfield shopping center, down the street from major theaters and restaurants. But if you walk the opposite way, you are right in front of the Tenderloin area and should be very careful of walking around there. Unfortunately, there is not much the hotel can do about this except to warn you. Check in was quick and efficient. This was really the only interaction I had with the staff so I can not comment on them.", "title": "Nice large room, in desperate need of renovation", "helpfulness": 2, "user": "travelSanFrancisco", "date": "November 11, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 10755710}, {"rating": 4.0, "title": "Lovely 4* hotel close to everything", "text": "Stayed at this hotel for £102 a night though priceline. arrived at 11.30am and was checked in immediately sob a great start. We were put on the 13th floor ! im not suspicious luckily.", "helpfulness": 2, "user": "willowy74", "date": "November 10, 2007", "id": 10739514}, {"rating": 3.0, "stay_parameters": "Stayed November 2007", "text": "Lovely reception area ~(very gold/brass) with six lifts. Gift shop on 2nd floor - open from 7am-9pm which sells soft drinks/gifts/stamps/sweets etc. Adequate health club and a bar and grill on the 2nd floor (sports bar type).", "title": "Nice hotel with OK service", "helpfulness": 2, "user": "Dad0fTwins", "date": "November 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 10690843}, {"rating": 3.0, "title": "Okay Hotel but nothing special", "text": "Staff friendly, especially concierge/bell staff.", "helpfulness": 4, "user": "Mandy7162", "date": "November 6, 2007", "id": 10644962}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The hotel is at the bottom of Powell St near the start of the cable car lines. Tickets can be brought at that point. You are in shopping heaven here - the westfield shopping malls house Bloomingdales/Abercrombie/eateries plus lots more).", "title": "Good price for location and accomodations", "helpfulness": 4, "user": "OCruiser", "date": "November 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10627448, "likes": {"liked": "— Location, price, and up-to-date accomodations", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I would like to give the Parc 55 credit for being a nice place to stay in SF. The higher floor view rooms are wonderful. This is one of the nicest bed and linens in a hotel that I have found so far.", "title": "great two years in a row", "helpfulness": 2, "user": "mistyt", "date": "July 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18223149, "likes": {"liked": "— The views and bed", "disliked": "— The location can be dicey"}}, {"rating": 4.0, "title": "Great place, worth every penny", "text": "I would suggest that you try to get breakfast outside of the hotel, it is too pricey for what you get.", "helpfulness": 3, "user": "joshkspa", "date": "July 17, 2008", "id": 17986901}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "Also, one needs to be careful in the area. The hotel is very close to some unsavory activities. The staff can and will help you with that though.", "title": "Best Location in San Fran", "helpfulness": 2, "user": "NikoNZ", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17937395, "likes": {"liked": "— Location", "disliked": "— Can't think of anything"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Got a great deal on priceline for 109 a night. The location can't be beat. The outside of the hotel is a little ugly (who cares?) but the inside is great. I will attach pictures. Rooms are quiet, nice flat screen TV's. GREAT views. Ask for higher floors. I plan to stay here whenever we visit SF.", "title": "Pretty good, but for goodness sake, take care of the little repairs!", "helpfulness": 1, "user": "Scapegoat512b", "date": "July 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17889306, "likes": {"liked": "— The location in Union Square", "disliked": "— The room, with two double beds was small"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I have stayed in a few hotels in San Fran, and this by far was the best.", "title": "Above Average--Good location but nothing fancy", "helpfulness": 3, "user": "bmfc1", "date": "July 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 17852288}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The hotel is located right close to the main public transportation, including cable car, BART and Muni subway. Check in was smooth but no one offered to take our luggage up or to show us where the bedroom was. Our bedroom was a king size club room located in the 27th floor. There was no grand view, just some buildings. The room was small and not 100% clean (dust on top of furniture + hairs on corner of bathroom floor), there was also no mini bar.", "title": "Nice location, good hotel", "helpfulness": 1, "user": "santamonica2006", "date": "October 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 10081072, "likes": {"liked": "— location", "disliked": "— club room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The breakfast was nice at the club lounge but as there were a lot of people there was at least a 10 to 15 min wait for you to get to a table. The buffet was small but very nice. You can also access the lounge in the evenings when they have a big selection of drinks and it isn't at all crowded so you can relax.", "title": "Great location, great hotel", "helpfulness": 1, "user": "windvalley", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10068062, "likes": {"liked": "— Location, rooms, sports bar downstairs (great bar food and reasonably priced)", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "Overall it was a nice stay but I would expect more of the club room especially as you do pay more, so maybe it would be a better idea to have stayed in a standard room.", "title": "Turn left...", "helpfulness": 2, "user": "Marmont", "date": "October 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10066131, "likes": {"liked": "— Zombie secure", "disliked": "— Somewhat sterile"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "San Francisco is trully an amazing and beautiful city, lots to see. It is essential to get a MUNI transport passport as it is a good money saver. Just one ride up the cable car will set you back $5 so the passport is definately good value.", "title": "A few problems, but never the less, a good experience", "helpfulness": 5, "user": "Musclebearnz", "date": "September 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10004926, "likes": {"liked": "— location", "disliked": "— some surly and rude staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My bf and I stayed at the Parc 55 Hotel for 1 night while exploring the city for 2 days. The front desk and concierge were fantastic and helpful, check in wasn't until 3pm but they gave me a room at 11am. The room wasn't huge and our view wasn't great but it faced away from the street (8th floor) so didn't have that much street noise. The location was superb, just steps from BART, shopping and Cable Car. I can definitely recommend this hotel.", "title": "Great first experience", "helpfulness": 2, "user": "badbadsal", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10003237, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Paid 115$ for each night thru a special on their website and for that money we got every penny out of it. Nice comfortable beds..great shower quite rooms and a great location. Check in was quick and they gave us a corner room on the 16th floor so we had a 2 window veiw of the city and only 1 neighbor! Like any facny hotel you pay for everything from 40$/night parking to 4.50 for bottled water. We parked at a lot down the street 2 blocks for 20 bucks instead. I helped a couple who spoke only Italian with their mixed up reservations and the front desk gave us free breakfast which was REALLY REALLY nice. The breakfast buffet was fantastic and I would recommend it but I have no idea what it costs....free to us :) Would absolutly stay here again.", "title": "Great hotel in a great location", "helpfulness": 2, "user": "TBegay", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17705200, "likes": {"liked": "— nice place near union aquare", "disliked": "— you pay for any extras"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "My friends and I were beginning a trip from LA to Seattle with San Francisco being the 2nd night. We chose the Parc 55 through Priceline and were excited to get a pretty good deal with naming our own price. We normally stay in 2 or 3 star hotels, and were excited to try a beautiful 4 star hotel! After our flight was delayed, we arrived at the hotel late and checked in, only to walk in to a room that was already occupied, with the occupants in bed! After returning to the front desk, we got a new room but no sincere apology for the mistake and were disappointed once we were settled in. The rooms with two beds are very cramped, the windows were broken and we had to keep the shades drawn the next day because of window washing. The bathrooms have horrible lighting and almost no ventilation. I believe the fee for internet access was around $15, and although they did offer two large bottles of lukewarm Aquafina in the room for $4.50 each, there was no mini-bar or refridgerator. The beds were comfortable, but it was a little gross to find long blond hairs on the bedspread in the morning, considering that everyone in our party is a brunette. Also the fee for parking with tax is $50/night which we thought was pretty steep. All in all, we were disappointed with our stay. The location is OK, but definitely not the reason to stay at this hotel...... as far as the rest of the trip, we stayed at Ramadas and other common hotels where the rooms were clean and spacious, with amenities like free internet, parking and fridges. We ended our stay at the Westin in Seattle for two nights, and I highly recommend it. Try the Westin in San Francisco.....you'll be happy you did!", "title": "Totally disappointed", "helpfulness": 1, "user": "pepdawg33", "date": "July 6, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17570138, "likes": {"liked": "— Hmmm.....nothing really", "disliked": "— The unapologetic nature of the hotel. They were made aware of the problems and didn't really try to resolve anything."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My review is somewhat late, my girlfriend and I stayed there last Thanksgiving 2007. But I've been meaning to write since then. You get what you pay for, but Parc 55 offered a really good rate which was well worth it...you'd pay the same price staying in a 3 star and I'd say the hotel was well above a 3 star and a little below a 4 star. I'm only saying that because the furniture and decor were a little dated and somewhat worn but it added to ambience and the hotel and room was very comfortable. The hotel is centrally located and walking around the hotel I thought it was in a central location and felt safe to walk the city. With that being said, I would stay here again.", "title": "Above average, good for the price", "user": "JaxAnn", "date": "July 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 17423051, "likes": {"liked": "— Centrally located, clean and comfortable room", "disliked": "— The furniture and decor were a little dated"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Very convenient location in the city; catch the cable car less than half a block away. Our room had recently been remodeled. Very spacious. Great bedding. Bath nicely done. Only complaint was that noise (just normal conversation on a phone) carried too well from the room next door, via the connecting door (which we weren't using, of course). Fortunately, our neighbor went to bed at the same time we did, so no sleep was missed. Struck me as odd, though, that among the amenities provided in the room (nice soaps, coffee, etc.), there were earplugs! Fortunately, we didn't have to use them!", "title": "Great location, spacious room", "helpfulness": 1, "user": "gottagettabreak", "date": "June 30, 2008", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 17386938, "likes": {"liked": "— location", "disliked": "— sound traveling from room next door"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Would book again!", "title": "Great Location", "helpfulness": 2, "user": "AlistairCoy", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 17181454, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We paid only $133 per night for a \"renovated view room\" and were in a corner room on the 27th floor which offered really amazing views in three directions. For the price we paid, I would definitely return to this hotel even though I much prefer a more boutique, stylish feel to a hotel.", "title": "Great location with a great corner room -- feels very business though", "helpfulness": 2, "user": "FLcs", "date": "May 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15906454, "likes": {"liked": "— The views from the corner room", "disliked": "— The corporate feel"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Upon checking in, we found out that parking was $45 plus tax per night (more than a third of our nightly rate!) so we parked down the road at a parking garage for $20 flat per night. The lobby is fine, though very bland...reminds me of a typical business hotel. Everyone was very courteous and business like. At the front desk, I requested a corner room due to previous reviews of such rooms being larger, and the woman was very helpful in pulling a high floor for me and reserving it even though it had yet to be cleaned.", "title": "Above Average, Great Location", "helpfulness": 1, "user": "grobma", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15862940, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Later when we were able to get our keys, we walked into the room and it felt more like a suite. Upon walking in there is a small room without furniture and a very large bay window. To the left around the corner is the large bathroom, next is the closet, and then beyond is the bedroom with a bay window at the end of the room and a very large bay window over the desk. There were views in every direction. From one window you could see the transamerica building, from another you could see the very top of the golden gate bridge, and from the other you could see the southern part of the SF bay.", "title": "Don't Stay Here!", "user": "beckybr", "date": "May 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 15772334}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The room itself had been renovated nicely, though it felt very corporate. Still, the bed was very comfortable and the furnishings were fine. They advertised a plasma tv in the room, but it was a standard box tv (not that we cared much).", "title": "Good Location", "user": "KevinBlackman", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15506536, "likes": {"liked": "— Location", "disliked": "— Slightly small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The bathroom was spacious with good amenities by lather, and the shower had excellent water pressure.", "title": "Great Location", "helpfulness": 1, "user": "Noodle73Uk", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15441078}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Check in around 1pm was quick and easy, and got a room right away. We did see long lines at the desk at times, and several large flight crews from Singapore Airlines checking in.", "title": "For the money, Parc 55 couldn't be better", "helpfulness": 6, "user": "BostonVince", "date": "July 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8111029, "likes": {"liked": "— Spaciousness, cleanliness, value for money", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "It isn't possible to get any closer to BART or the MUNI, a godsend for travelers using public transit. As previously stated, proximity to shopping is superb.", "title": "Location", "helpfulness": 3, "user": "Hombresg33", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8103360, "likes": {"liked": "— Location, Rooms, View", "disliked": "— Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "There were homeless people and some panhandlers around Powell Station, but they were totally harmless. Traveling frequently to NYC, we probably look more streetwise than some of the other reviewers not used to the city. No one ever approached us, even walking through the Tenderloin towards Civic Center. I do not recommend this area to anyone not used to being in major cities.", "title": "Wonderfull Staff, Great Hotel", "helpfulness": 1, "user": "FightOn", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8102712, "likes": {"liked": "— Service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Room on 29th floor was great. Nice and large and very clean. Good bathroom products by \"Lather\". Bed was extremely comfortable. Fresh air vents were great (but of course give you a little more noise). At times we turned off the AC and just opened those vents. Noise level really was minimal, even with the building going up next store. Besides, noise is intrinsic to cities. Anyone who can't stand noise should take a country vacation. Housekeeping does like to knock a lot, to check whether the room is ok. It seemed like overkill to us.", "title": "Great Hotel", "user": "Sharon098", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8079655}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Breakfast in club lounge was adequate. Fresh fruits, meats and cheeses, hot and cold cereal, bagels, breads and danish. Starbucks coffee was a real kickstart in the morning. The afternoon snack was ok, no where near what other hotels put out in their concierge lounge, but the Parc 55 also cost a fraction of what those other hotels charge. The evening dessert was a nice touch, and perfect since we usually don't have room for dessert at that evening's restaurant. Speaking of restaurants, we tried the Siam Thai Noodle both in the hotel (many restaurants were closed for the 4th of July) and across the street. Both were fantastic.", "title": "Great Hotel", "helpfulness": 1, "user": "Sharon098", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8076037}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I stayed for 6 nights at the Parc 55. Check in was relatively easy. I requested a top floor but got floor 15. Room was relatively large with views out two sides since it was on the end. Room was clean and staff was acceptably friendly. Be forewarned that they are constructing a large building next door so the noise starts pretty early. I use earplugs so it didn't bother me. Lots of homeless all around but it still seems safe as they were harmless. Just don't go very far to the immediate west from the hotel because that area is not safe. Very convenient to cable car and subway (BART). Major disappointment was not the hotel but the amount of homeless begging in a major tourist area. SF leadership really needs to clean up their act. Very little police presence noticed anywhere around the city and that was very disappointing. Saw more homeless begging on the 100 yard walk from the subway to the hotel than 2 days in NYC. Not the Parc 55's fault though. I think eventually this will come back to bite tourism there.", "title": "Great experience Here But SF Needs to Clean Up Area", "user": "ManUtdinOK", "date": "July 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8036086, "likes": {"liked": "— Location", "disliked": "— Homeless in vicinity"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had an excellent stay at Parc 55. We were put in a handicapped room, but were moved immediatly with our request to change. Big bathrooms, and good sized rooms. There is a great little pastry-type shop located at the bottom of the hotel which was great for breakfast (donuts, muffins, etc.). There is a burger king and carl's jr. across the street and a subway and walgreens 1 block up. There is no better location for the cable cars and muni transportation. This hotel is very clean, comfortable and convenient to everything! No complaints here, would definately stay here again!", "title": "excellent choice", "user": "thomasons", "date": "July 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8035056, "likes": {"liked": "— location", "disliked": "— they charge you for internet use"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "I spent last night at the Parc 55. I was watching for certain problems that have come up in some of the recent reviews--most especially the issue of rude or incompetent staff at the front desk. I was greeted by a young women in a very friendly manner, and check-in was smooth. I had reserved via Hotwire and got a rate of $99. I'm always concerned that I might not get a nice room because of booking through a discount service, but my room was nice. It was fairly large by SF standards; the bed and pillows were very comfortable; the bathroom was spacious and well-stocked and the shower was great--good water pressure and plenty of hot water. Among the toiletries were some ear plugs--not a good sign. I was on the 5th floor and I did hear street noise, but no more than at any other SF hotel I've stayed at. My only complaint is that $12.95 for the Internet connection is too much. I saved money by parking at the Ellis-O'Farrell garage nearby ($30 for overnight) instead of using the hotel's valet parking ($40 plus 14% tax and a tip or two would have been about $48). I would stay at this hotel again.", "title": "Parc 55: nice, comfortable hotel", "helpfulness": 2, "user": "PGdenizen", "date": "June 26, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 8002066, "likes": {"liked": "— comfortable room", "disliked": "— expensive Internet usage fee"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Great location for cable cars, shopping, dining. I had a lovely room with a great view (18th floor). Check-in very busy on the afternoon I arrived but quiet when I left at the same time two days later. Staff at reception very efficient and helpful. Had arranged a package to be waiting for me on arrival. It was waiting for me at the bell desk. Accommodation, clean, spacious and comfortable. Have stayed in many hotels in SF including the Westin St Francis, Hilton, Crowne Plaza and City Quarters. I would certainly recommend the Parc 55 above those mentioned.", "title": "Great Location", "user": "heb999", "date": "June 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7999738, "likes": {"liked": "— location", "disliked": "— BAgag"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed here for one night, ten days ago and found it to be a great hotel for the price ($135 incl tax).", "title": "Great hotel, excellent location", "user": "LadyLong", "date": "June 26, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7998625, "likes": {"liked": "— Location", "disliked": "— Staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Stayed at the Parc 55 for five nights this month, at the end of two weeks in California and Nevada.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "carrliadiere", "date": "June 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16816720, "likes": {"liked": "— The quality of the room", "disliked": "— The fact that Tenderloin is perilously close..."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "First impressions on walking in: amazing! A huge lobby, bustling with people and activity. Had to queue to check in, but it only took about ten minutes. Check in desk was fully staffed and everybody was polite and helpful.", "title": "Parc 55 is a great hotel", "user": "craignsandra", "date": "June 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16697619, "likes": {"liked": "— The large room, lots of space and great view.", "disliked": "— No refrigerator in the room we had."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Room was fantastic! Paid for standard room on Expedia, and we got a corner room on the 7th floor, huge room with a massive bed and enormous bathroom. 32\" flatscreen TV and coffee making facilities (which seem to be rare in the US) topped it all off perfectly.", "title": "Nice Hotel, Few Issues", "helpfulness": 1, "user": "Travelinsider", "date": "June 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16682894, "likes": {"liked": "— Shopping location", "disliked": "— Borders bad area"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Tried out room service on the first night, and it was seamless. Was referred to by name on the phone, they knew exactly who I was and which room I was in without asking, taking away a lot of the awkwardness associated with room service. Food arrived in 15 minutes and was very good indeed.", "title": "Too Much Noise", "user": "smacthayer", "date": "June 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16625802, "likes": {"liked": "— Water pressure", "disliked": "— NOISE!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Tried out the hotel bar, which is a fabulous setting. Great service and ambience, although I think the same piano music every night might get to the people who work there eventually.", "title": "Excellent Hotel and Location", "user": "jclittle94", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16607094, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The rooms are small, but nicely appointed. Views are above average, but not the best in the city. No complaints about the room.", "title": "Good location, shame about the front desk service", "helpfulness": 4, "user": "sheree99", "date": "May 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7592816, "likes": {"liked": "— The comfortable bed", "disliked": "— The service"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Upon checking out, we had been tremendously overcharged. I pointed this out, and they said that this was the rate in the computer and I needed to prove that i had booked at a lower rate. Thank goodness I had my laptop to show them my confirmation. Again, no apology.", "title": "Lovely room, expensive extras", "helpfulness": 4, "user": "chris036", "date": "May 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7583034, "likes": {"liked": "— Location & room size", "disliked": "— nothing"}}, {"rating": 5.0, "title": "great", "text": "We really enjoyed our stay at this hotel. Our check in and check out was done so quickly, the room was nice with very comfortable beds and pillows. The view was great. This was my 4th trip to San Francisco and I will deffinitely stay at this place on my next visit to SF", "helpfulness": 4, "user": "nireno", "date": "November 4, 2004", "id": 2805202}, {"rating": 4.0, "title": "A Great Hotel", "text": "I've just returned from a wonderful trip to San Francisco (Oct7-11) and enjoyed my stay at the Parc 55. The rooms are large and even the bathroom was spacious. The bed was very comfortable, with a lovely comforter and lots of fluffy pillows - especially welcome after a 7 hour flight! We didn't see any homeless people in the immediate vicinity of the hotel - saw some on Powell, but no one bothered us. We didn't eat in the hotel, but there are lots of good places to eat close by (Puccini and Pinetti are right across the street, Daily Grill just a block away, Kuleto's on Powell about 2 blocks away). We did have coffee one morning on the 2nd floor lobby and you can buy fruit cups, yogurt, cold cereal there as well.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 13, 2004", "id": 2701476}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "I liked the fitness centre, although its a little crowded with equipment. There were 6 treadmills, 4 cross trainers, stationary bikes, free weights and a couple of machines. Everything worked and the room was clean and bright.", "title": "Servicable Hotel with Priceline deal", "helpfulness": 3, "user": "cocogrove25", "date": "October 12, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 2699247}, {"rating": 3.0, "title": "great location, staff, bed.", "text": "The front desk staff were very helpful and our room on the 20th floor had a view of the bay and the Transamerica Pyramid. We didn't hear anything from the rooms on either side, but heard some noise from the street.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2696916}, {"rating": 5.0, "title": "Wonderful Hotel Stay !!!!!!", "text": "It was a great holiday and the Parc 55 helped make it that way.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 4, 2004", "id": 2618961}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We booked on the hotel website directly. Got what I thought was a decent rate. Called the hotel directly and spoke to Jenny at the front desk the day BEFORE we arrived to discuss the need for adjoining rooms. We were traveling with our children. I also advised her that we would be a late arrival as our plane landed after 10PM. I was told it would be no problem, and she was blocking our rooms as we spoke.", "title": "Great location...reservation problems galore", "helpfulness": 7, "user": "SunnySanDiegoMom", "date": "April 4, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7279310, "likes": {"liked": "— location", "disliked": "— front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "You guessed it...when we arrived at 11:25 pm...we were told our rooms had not been blocked and there was no indication that I had told them about the late arrival. We ended up with ONE room that night as the only others rooms available were on a different floor. I was able to give a name of the person I spoke with...but nothing seemed to be happening and they did not even seemed very concerned. Other than to say that the hotel was booked that night and they could do something about it in the morning. I then asked for something to compensate the lack of follow thru and was given a few breakfast coupons.", "title": "Good Value", "user": "vonroad", "date": "April 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7278679, "likes": {"liked": "— Nice decor and friendly staff", "disliked": "— $40 Parking!!"}}, {"rating": 4.0, "title": "A great Hotel in sfo", "text": "We were told when I called in the morning that if we packed up our bags, they would move us automatically to our requested rooms. This was important because we had important plans for our day. When we arrived back at the hotel at 4:30 PM, no one at the front desk seemed aware of the situation...and they could not be sure where our baggage was.", "helpfulness": 1, "user": "ret777", "date": "April 3, 2007", "id": 7276417}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "After speaking to the manager Mr. Mussleman we finally got our rooms. When we went to open the doors, only one key worked. More importantly, we could not see our baggage anywhere. After checking BEHIND the CLOSED closet doors we found the luggage.", "title": "Heavenly Parc 55", "helpfulness": 1, "user": "Muffy24", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7269708, "likes": {"liked": "— The comfortable beds and cleanliness.", "disliked": "— The lower floors have not so great views."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel is in a PERFECT location. It is clean, comfortable and other than the mess ups with our room it would have been a", "title": "Excellent Hotel, Outstanding Value", "helpfulness": 2, "user": "MaukC504", "date": "March 28, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7238194, "likes": {"liked": "— Location", "disliked": "— Lobby"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 227, "average": 697, "very good": 1726, "terrible": 114, "excellent": 1626}, "aka": "Parc 55 Wyndham Hotel San Francisco", "slim_ranking": 0.246808510638, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}