{"user_rating": 4.5, "review_count": 345, "name": "Paresa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My partner and I stayed here for 7 nights over New Years. We were upgraded to an Aqua Suite with stunning views of the ocean and a private plunge pool. The room was large and comfortable. The bathroom has a large bath and indoor and outdoor shower. There's a TV with many english channels, espresso machine, good mini bar and 24hr room service.", "title": "Private and Chic, with a real Thai feeling", "helpfulness": 3, "user": "discerningdane", "date": "January 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91672152}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The resort is build into a steep cliff with beautiful views where ever you are.", "title": "Like a giant super posh tree house", "user": "cornejita", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91419332}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "There are one large restaurant serving both a Thai and an Italian menu - the Thai food is far superior to the Italian, as you would expect.", "title": "We loved Paresa so much we got married there", "user": "Aerolamb", "date": "December 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90193349}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The spa is first class.", "title": "Excellent Hote for relaxing with High quality Service", "user": "Alitahtah", "date": "December 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90059345}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The staff organised various excursions for us, including a visit to an elephant resort (inc. trekking), private yacht tour.", "title": "A slice of heaven on earth", "user": "Flynne", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89962314}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Stayed 30 december-7 January 2011, Aqua pool suite 231.", "title": "Breathtaking scenery and beautiful eco-friendly resort but…", "helpfulness": 1, "user": "pelun", "date": "January 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94021279}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Paresa is physically one of the better resorts in Phuket. Beautiful design, eco friendly, romantic, tranquil location (but quite remote) with some of the most stunning views! Our villa was excellent and had plenty of sun all day, a fantastic sunset and wonderful scenery. Large bedroom/living room, a huge bathroom with indoor/outdoor shower and bathtub. Coffee machine, dvd and Ipod dock. Sufficient private pool next to the terrace with comfy sun loungers. The bed was very comfortable. Enough bottles of complimentary water are provided in the villa in the morning and in the evening. Both Thai and Italian dishes at the restaurant are really nice and prices are decent for the quality. The setting only is worth paying for!! Fabulous! Breakfast was ample and not overwhelming. They have a great modern fitness room and a spa (never tried). Main pool area is good with sun loungers and breathtaking views. Never felt the hotel was crowded despite some days it was fully booked. The beach club at Kamala beach is enjoyable, although they don’t have toilette or shower. There is a public restroom with showers couple hundred meters away. They have their own comfortable sun loungers, towels and offer complimentary water (and replenish it throughout the day!). Drinks are available and think it was possible to order food as well but not necessary since plenty of restaurants around on the beach. Think Paresa had one of their best staff members at the beach club; really friendly and service minded. Kamala beach is ok, but not the best in Phuket. Sand is not as soft (large granular) although water is good (shallow and sand bottom). Paresa is pretty young (2009) so still room for improvements. Here are the low downs:", "title": "really wonderful", "user": "albaneze", "date": "January 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 93854253}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "- Service at main pool appalling. Rarely staff present and not at all service minded. No help with sun loungers, towels and water. Had to go and find the staff or make front desk/GM aware of the non-existing service. Since no telephone around the pool it made situation even more difficult. Couple times they tried to charge for water claiming they had run out of the complimentary water. After that I opposed to this complimentary water was served 5-10 minutes later. Bizarre. Difficult ordering food (no staff!). No cold towels or afternoon refreshers as had been mentioned by hotel. Think they also lack a shower by the pool.", "title": "Average", "helpfulness": 2, "user": "ParisCookie", "date": "January 18, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 93528865}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "- Agree with other reviewers that service can be much more improved. The “Angels” team tries their best, but seems to be a lot of confusion and mix up partly due to the language barrier. Yes, sometimes you referred to ask for something or make comment purely because no one would understand.", "title": "Amazing view", "helpfulness": 1, "user": "dubaimaldivesdubai", "date": "January 17, 2011", "detail_rating": {"cleanliness": 4.0, "service": 4.0}, "id": 93314409}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "- As mentioned in other reviews the transport situation is a big problem. Taxi prices from the hotel are a royal rip-off. Taxis always charge Thb 100 less than the hotel car. So obviously they follow the hotel prices. The minimum charge is Thb 300 which will take you to Kamala beach 10-15 minutes away. To Surin and Patong (about 20-25 minutes away) the charge is Thb 700. In Bangkok taxi fare for one hour is about Thb 100!! The hotel must start negotiate with the drivers (there is no negotiation today!) The hotels in the area as a group or the hotel organization in Phuket should have a joint strategy. It’s not good for tourism! Even if Paresa is beautiful, it may result in guest choosing other hotels which are less remote or having better transport options. The hotel offers a shuttle twice a day to their beach club (at 10 and at 1 pm). It should definitely be offered more times during the day.", "title": "Best hotel in Phuket", "user": "PSA88", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92188684}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I read the jetsetter.com and tripadvisor.com reviews and booked the Talay Suite and shared with a family who seemed to semi-permanently occupy the upstairs and downstairs suites. Downside: they had kids who woke us up every morning at 7:45am. Upside: the family stayed upstairs and the kids came down only to sleep so we had the pool more or less to ourselves.", "title": "Beautiful hotel with no privacy", "helpfulness": 2, "user": "moneynoobject", "date": "December 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 89142450}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We checked in on Friday and were told that there would be a wedding on Sat night and that the Infinity Pool area would be closed for the reception. The receptionist gave us a choice of a very, very remote suite (only accessible by car, which mean that we would have to call for car to go eat, to go to the spa, etc. everytime we wanted to leave the room) or the suite closest to the restaurant. The hotel didn't seem very full, but apparently, there were no other Talay suites to be had...?", "title": "Fantastic hotel and location just a bit of improvement on service", "helpfulness": 2, "user": "simonpope2", "date": "December 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89055490}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We chose the closer suite and didn't think much of it until the wedding, when the guests were taking pictures of us and our room. We also didn't expect the noise from the reception to make us feel like we were at the party. That was when we started appreciating the Four Season's policy of renting out the entire hotel for a wedding if the event /noise couldn't be contained.", "title": "LOST IN TRANSLATION", "helpfulness": 13, "user": "HongKongTrojan", "date": "December 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 1.0}, "id": 89048904}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "To go anywhere outside the hotel costs a fortune. It costs THB400 (including airport surcharge) for a metered taxi from the airport. To get to the beach (which is 15 minutes away) cost THB300 on a private taxi, because no metered taxis are available. We took a private car back to the airport and the fare was THB700 (go figure).", "title": "I have been to paradise and back", "user": "marxusboy", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88565341}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Expensive private cars are not the hotel's fault, but we would have appreciated more transparency and assistance from the concierge to with bargaining for taxi rates and giving us an idea of what \"market rate\" is for various things. We would have also appreciated more knowledge of the local area. I had read about the Kamala Royal Thai Spa and some restaurants by the beach and the concierge had no idea what I was talking about. We eventually found both, but no thanks to the hotel. When we asked for retaurant recommendations on a separate occasion, she could only recommend the hotel restaurant , which (was nice, but we had already eaten there 4 times and wanted a little variety) or a couple of restaurants on the other side of the island... The hotel also raves about its \"Angels\" who can answer any question, but half the time, the Angel we spoke to had no idea what we were talking about.", "title": "Best in Kamala, but not perfect", "user": "Minna1228", "date": "November 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 88476630}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Absolutely breath taking views from cliff villa with amazing infinity pool, very romantic with outdoor toilet and shower. However it is a little far away from the main attractions and night life and unfortunately they do not provide a taxi for the town which is very expensive, besides the hotel being expensive, which is definately worth every penny of it", "title": "gorgeous hotel especially cliff villa", "user": "allavol", "date": "November 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 87523695}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I have been lucky enough in our jobs to travel and stay in some of the nicest hotels in the world. This place puts all of those resorts to shame.", "title": "Would go again in a heartbeat!", "helpfulness": 1, "user": "parisaz", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87285361}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We stayed in the Aqua suite for 7 days, and I have to say I had a hard time going back home. The beds were enormous and unbelieavably comfy, and the styling of the rooms was simple and elegant.", "title": "Absolutely stunning slice of paradise", "helpfulness": 2, "user": "NewYorkdaniela", "date": "November 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85816902}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "Our angels through out the week were very attentive and helpful, and gave us a number of suggestions for excursions around the island. My husband and I kept joking that they must have bugged our room, because they knew what we were doing for the day and always greated me in the morning with...\"so I hear you are going elephant trekking today Mrs. Zander\"...\"Oh you are doing the infinity dinner tonight Mrs Zander\"...it was wonderful that they were so tuned into what we had going on.", "title": "Superb", "user": "Shahirah84", "date": "November 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 85519985}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Then we get to the food. Breakfast was included in our rate, and the food was fantastic.", "title": "The room was excellent and clean, the view is wonderful, highly recommended!!", "helpfulness": 1, "user": "nussss", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85369236}], "location": {"country": "Thailand", "continent": "Asia", "city": "Kamala"}, "stars": 5, "variance": {"poor": 13, "average": 26, "very good": 54, "terrible": 4, "excellent": 248}, "aka": "Paresa Hotel", "slim_ranking": 0.12, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "All guests rooms have uninterrupted views of Andaman sea.."}