{"user_rating": 4.0, "review_count": 6869, "name": "Paris Las Vegas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "We are just back from 5 nights in the Paris. The hotel is really spectacular and service was excellent both in the restaurants and at the reception desk. The pool area is very well laid out and easily accessible.", "title": "Excellent Stay", "helpfulness": 1, "user": "Snedders", "date": "August 11, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 2440788}, {"rating": 5.0, "title": "A really great hotel!", "text": "Not as many restaurants or shops as some of the other hotels but the restaurant Mon Ami Gabi is great especially if sitting outside as you get a great view of the Musical Fountain display at the Bellagio.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 3, 2004", "id": 2379100}, {"rating": 5.0, "title": "We loved Paris Las Vegas", "text": "The Paris is a wonderful hotel! Our stay was for three nights starting July 29. We had none of the problems described in some of the earlier reviews. The location is perfect, right across from the Bellagio and Caesars, and next door to the Aladdin and Bally's. The themeing is very good, with most of the shops and several of the restaurants located on a very pretty and nicely detailed faux boulevard, complete with cobble stones! There are several \"living\" statues (actors in full make-up poising as statues along the street, moving every so often to the delight of passers-by). The french elevator music WAS annoying, but then, so is most elevator music! The staff was always pleasant and helpful, though a few seemed a bit rushed, none were rude or abrupt in anyway. The wait staff in all the restaurants were especially good.", "helpfulness": 3, "user": "Sofia", "date": "July 28, 2004", "id": 2327822}, {"rating": 4.0, "title": "Nice", "text": "The room is large and nicely decorated, it feels elegant without being stuffy (the whole hotel feels this way), and the king bed was comfortable. We had a very partial view of the fountains at the Bellagio across the street, even though this wasn't a \"P\" room. The marble bath is huge, with a shower separate from the tub (the tub is a little shallow though, but we didn't care as we didn't use it). The sink area has plenty of counter space, and the mirrors are fog-free. The maid service was good, the room was always clean. One day the maid even laid out my hair brushes on a towel on the sink in the bathroom. We always left a few dollars as a tip, and upon check out left a tip and a few candies from the stash I had brought with me for the trip. These ladies work hard at a job most of us would never do, and I always like to show my appreciation.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 24, 2004", "id": 2318688}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "We ate at 3 restaurants during our stay, the Village Buffett, the Le Cafe, and the Artistes Steakhouse. The Buffett was by far the best. We had breakfast there each morning, and though a little pricey compared to other Vegas buffets ($14 per person for breakfast), the extra cost was worth it as they have very good quality food that you'd actually want to eat. They had made to order eggs, omelettes and crepes, and plenty of fruit, pastry, danish, cheese, yogurt, sausage, bacon, and anything else you can think of for breakfast. The cheese is especially good! Le Cafe was also good overall, especially the service. The only down side was the prime rib, it was a bit tough. The Steakhouse was also excellent, but for the price paid, my filet minogn was again a little dry (very tender though). The Paris seems to have a problem with either getting good quality beef, or they don't know how to prepare it. My companion had the lemon pepper chicken, and said it was excellent, and we both loved the chocolate mouse desert.", "title": "Quite Good but not Great", "helpfulness": 1, "user": "Gary C", "date": "July 20, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 2311312}, {"rating": 2.0, "title": "Very nice hotel", "text": "We made reservations for 3 rooms at Paris last April for a big pre-Christmas shopping trip to Vegas. I had confirmed the reservations the week before and called the day that we traveled to do advanced checkin. Each time I stressed that this was a family gathering. When we arrived there was no line and we were checked in right away. Unfortunately instead of getting 2 king rooms and 1 queen, we got 1 king and 2 queens. In order for one of the family to have a king room they had to go to the 6th floor when all the rest of us were on the 30th. I wish I had made a bigger fuss about it. The rooms were very spacious and well maintained. The bathroom was lovely with tub, toilet and separate shower stall. We didn't gamble but did eat at several restaurants which were all fine. The service was fair - not great, not terrible. 2 of our rooms adjoined and they were cleaned by different members of housekeeping which was interesting. One would be cleaned before noon while the other would still be unmade at 3:30 PM. We also found that the housekeepers left different amenities. I never saw a shower cap and got a different type of shampoo from the other room. I would stay at Paris again with a good rate. Since I like to try different hotels I would probably try another hotel next time. This should not be taken as a negative. The hotel was lovely but watch the checkin.", "helpfulness": 4, "user": "swatts1", "date": "December 24, 2004", "id": 2943031}, {"rating": 4.0, "title": "Very very Nice...However", "text": "1, Check in at the airport...easy and uncrowded.", "helpfulness": 4, "user": "Seattlesun", "date": "December 22, 2004", "id": 2919535}, {"rating": 5.0, "title": "Paris Las Vegas -- our new favorite", "text": "2, Upgrade to a premier room...better view and great room", "helpfulness": 11, "user": "LeMasseHammer", "date": "December 16, 2004", "id": 2886135}, {"rating": 5.0, "title": "First rate", "text": "3, Casino small enough to get around", "helpfulness": 3, "user": "hottoddy0", "date": "December 14, 2004", "id": 2879167}, {"rating": 2.0, "title": "Not wonderful", "text": "4, Good restaurants and choices.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 9, 2004", "id": 2874142}, {"rating": 5.0, "title": "Picture-pretty Paris", "text": "We took a short weekend trip and stayed at the Paris. Our flight was scheduled to get in early, and in fact got in even earlier - we were at the hotel by 9:30 AM. With the official check-in being 3PM, we were pleasantly suprised that they found a room for us right away, exactly what we requested (high floor, away from the elevator) with a bonus view of the Bellagio fountains. We were at the very end of the hallway, but because the hotel itself has three \"arms\" the walk wasn't very long at all. I liked the fact that there were separate banks of elevators that served different floors - we never had to wait long for an elevator and the rides were very quick. The hotel itself was laid out very well and the sidewalk effect was charming.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 22, 2004", "id": 2841645}, {"rating": 2.0, "title": "Arrogant Customer Service ....", "text": "Be sure to sign up for their players club if you stay - you get a discount at the Paris shops if you show your card! We found out about the discount accidentally on the last night when we got a discount at the Bally's buffet (not so good but by then we were spoiled - felt a little better about the choice given the discount!). I'm not sure if you get a similar discount at the Paris buffet, but even without it's a bargain at any price. The breakfast was wonderful (even compared to the Bellagio gourmet buffet we'd had the night before) and the seating areas were beautiful.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 20, 2004", "id": 2836432}, {"rating": 5.0, "title": "right in the middle of everything", "text": "Last but not least, the drink service in the Paris casino is generous, even if you're playing the penny and nickel slots. We were in and out of most of the hotels on the strip and I have to say, we'll probably stay at the Paris again!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 10, 2004", "id": 2818352}, {"rating": 4.0, "title": "Nice, clean rooms", "text": "The front desk clerk at the Ambassador Check-In window was ARROGANT and less than satisfactory. First, she told me that I would have to wait in the check-in line (thus defeating the whole purpose of Ambassador check-in). I told her that I had already pre-registered and was instructed to go to the Ambassador check-in window upon arrival. At that point she began to process my check-in with an attitude like she was doing me a great favor. I asked for a quiet room but was given one closest to the elevator. On top of that, both keys didn't work and I had to go back down to the lobby. Fortunately, I received far better customer service from a different lady which made up for the first one. I've stayed at many upscale hotels in the world and expected much more from the Paris Hotel (I've received better service at the Holiday Inn Express)!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 8, 2004", "id": 2813336}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "We attend a convention here every year.The rooms are neat,clean and spacious.The price is reasonable.The staff are very helpful and polite.I love the eateries and bars.The self park is large and close to the hotel.A great place to stay!!", "helpfulness": 2, "user": "Jemuk1", "date": "November 4, 2004", "id": 2805322}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Stayed at the Paris for 4 nights for a conference that was held at the hotel. Waited in line over an hour to check in (despite them knowing they had several thousand attendees arriving, they had 2, then 3 staff working the front desk in the hour I waited. Several colleagues waited more than 2 hrs to check in). The smoke was overwhelming from the second I walked in the door. My floor was non-smoking but it didn't matter - the air quality was just as bad as the casino. Disgusting. I wheezed, sneezed, and coughed the whole 5 days I was there. It was awful.", "title": "Smoky, disgusting experience", "helpfulness": 5, "user": "mjm629", "date": "April 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 28969327}, {"rating": 1.0, "stay_parameters": "Stayed April 2009", "text": "Rooms were worn and not very exciting. Bath was quite lovely, though.", "title": "Blood on the Drapes....Yikes!", "helpfulness": 5, "user": "Riverat99", "date": "April 28, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 28952833}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Staff were rude and not helpful. Maybe they're trying to really recreate the experience of the REAL Paris. Well done. I disliked the real Paris, and now I hate fake Paris too.", "title": "first trip,not bad", "helpfulness": 4, "user": "KansasBeenthere", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28830781}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The only great food was at the Creperie. Delicious crepes. Buffet was busy and not great. Burger Brasserie was average.", "title": "Amazing Hotel", "helpfulness": 3, "user": "edhellab", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28818646}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Meeting accommodations were a joke - a tiny business center serving both Paris and Bally's that could not deal with conference attendees' needs. Very expensive wireless internet ($14.99/day), and very expensive business services.", "title": "The Paris-Vegas", "helpfulness": 6, "user": "soonergirl23", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 28814942}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The best thing about the Paris hotel in vegas is Mon ami gabi restaurant... other than that stay far away from the casino where staff and bosses love to make up new rules with every hand that doesn't suit them... their \"take it or leave it\" attitude is disgusting... it is wornout and old... best thing would be to tear it down and start again... including their self-righteous and rude employees.", "title": "Casino rip off", "helpfulness": 1, "user": "bobcrisp", "date": "February 27, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 125313418}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is our second time staying at Paris. Again, not to be disappointed! It is a lovely property and very clean and high class without being over the top. The location is very convenient to both the Bellagio and Caesars. We did not experience any problems with noise either this visit or any past visits.", "title": "A great stay in Vegas!", "helpfulness": 2, "user": "AWBW2011", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125245744}, {"rating": 2.0, "title": "Good location, tired, worn out rooms", "text": "I enjoyed the decor and the nice eateries. There was live music in the evenings and plenty of restaurant options. We enjoyed eating at Mon Ami Gabi outside watching the fountain show at bellagio and also outstanding people watching. I would definitely stay here again, and again!", "helpfulness": 2, "user": "stacyfletcher", "date": "February 26, 2012", "id": 125241107}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Experienced Vegas traveler disappointed with the accommodations here. Tired, faded, disrepair all sum up the guest room. Faded and stained carpet. Torn furniture. Broken light fixtures. Bedsheets with little pills and towels with fraying edges. The fun theme and great location make this a desirable choice but the condition of the rooms takes this one off the list for us next time. Check out Bally's right next door for same location and newly renovated rooms.", "title": "Nothing Special at the Paris", "helpfulness": 2, "user": "Stv50", "date": "February 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 125238635}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We reserved a king bed weeks in advance, only to be told upon arrival that there was none left! They ended up putting us in a handicap accessible room that had a king. Not exactly what we had in mind. When we reserve a room, we expect to get what we order. or I would have booked the room elsewhere. The room itself was ok for a 4 day stay, but the furnishings were pretty dinged up. We loved the location, right across from the Belaggio and its fountain and easy walking distance to most of the big Casino's. The restaurants in the Paris were really busy and we needed a reservation in order to have dinner at Mon Ami Gabi on our last night there. (Mon Ami Gabi was very nice) We found that overall the Paris is not as big as some of the other Casino's and that we spent a lot of time at New York New York, which had a better selection for food and entertainment.", "title": "Paris Las vegas Very Clean and Affordable", "helpfulness": 1, "user": "fpump", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125236030}, {"rating": 4.0, "title": "Great location and no resort fee", "text": "The Paris resort is in great location ,opposite Bellagio and just up the strip from Caesars palace.the rooms are still in good condition ( its our second stay) and the hotel has no resort fee charges.car parking is handy and there is lots, at the rear of the hotel.", "user": "BarryJ_100", "date": "May 8, 2012", "id": 129608582}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The hotel also has walk through to Ballys and if you enjoy Blackjack, the choices are often better there.", "title": "Great hotel!", "user": "April C", "date": "May 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 129557009}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We loved our stay at Paris. We felt like it was really easy to get in and out of because of the casino being smaller than most other hotels in Vegas. We liked how quiet our room was at the end of our long days. We will definitely stay there again. We loved how central it's location was and the restaurants in the hotel were very good as well. Great value for the price!", "title": "great stay at paris", "helpfulness": 1, "user": "Michael I", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129556747}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "My wife and I just stayed 5/2 to 5/6. At check in we told them we were celebrating our anniversay and they offered us a stay in a parlor suite room. This room had a pool and eiffel tower view. I also recommend you pay extra and add on le rendesvous lounge. we had breakfast each morning and an evening reception for 3 hours which included beer, wine, and select mixed drinks. they have some food there as well. very worth it. They also printed our boarding passes for us there. Overall it was very nice and will stay there again.", "title": "the paris las vegas college reunion", "helpfulness": 2, "user": "arimat", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 129555966}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "nice hotel. great view if you get room 2225P (not 2225, which is also a room). view of the strip in front of hotel in one window, and view of eiffel tower, paris pool, and bellagio fountain out of other window. no problems other than a random (occasional) knocking/ leak noise in the ceiling of the bathroom. If there is a party on the roof of the cosmopolitian hotel, or the roof of the paris (club chateau upstairs), you will hear the music beating in the room, but I was so tired it didnt matter. I slept like a baby. decent (not great) breakfast buffet. not worth the $, but all of the hotels are expensive. buffet at Rio (off the strip) and Bellagio were the best. I only ate at both on weekend days, so take that into consideration. They put out more and different food on weekends.", "title": "Nice room, a little dated", "user": "WhollyHeretic", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129532903}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I booked the red room at a discounted rate for my bachelorette weekend. Personally the decor was not my taste but the room did its job, clean, comfy, etc. Houndstooth carpet, lots of red and old wood...but the room was very comfortable. Also, when I told the front desk what the occasion was, he mentioned he gave me a room with a nice view...which was a bit of an understatement. It was in front of the Eiffel Tower, the pool and the Bellagio Fountains!", "title": "Liked more than I thought I would", "helpfulness": 1, "user": "stimpee525", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129825639}, {"rating": 3.0, "title": "Very good, solid hotel.", "text": "Housekeepers were super nice and accommodating when I asked for extra towels, cups, etc. Also, we called asking for extra hangers. I expected a hotel this size to be super slow with such things but they were very fast.", "helpfulness": 1, "user": "joburkholder1", "date": "May 12, 2012", "id": 129823614}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "The service quality is GREAT for a Vegas hotel Might stay here again if I snag a deal :)", "title": "Extremely beautiful room; will definitely be returning to Paris LV again!", "helpfulness": 2, "user": "baseballdc", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129787005}, {"rating": 4.0, "title": "Good value and very comfortable", "text": "This place isn't the newest, biggest, sexiest or hippest place but, it is well kept, clean, and a good value for the location. Our room was clean. Bathroom was large. Toiletries and linens were nice. I would definitely stay again.", "user": "dukeclu", "date": "May 11, 2012", "id": 129782049}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Checked in on a mid-Thursday afternoon and stayed through the weekend; am a Diamond Member, so for me it was a breeze! Very nice and gracious registration hostess. Checkout also a breeze!", "title": "At least the room is clean.", "user": "donna b", "date": "May 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 129772440}, {"rating": 5.0, "stay_parameters": "Stayed March 2004, traveled on business", "text": "We stayed at Paris back in March while my husband attended a conference. I was immediately impressed when the front desk clerk upgraded our room to a junior suite free of charge! Our room was absolutely gorgeous -- very spacious, luxurious bathroom with a separate marble shower, comfy bed and great view of the strip! The shopping area had lovely shops as well as a working French Bakery and Pastry Shop. The onsite restaurants were very good and definitely worth trying. My one complaint is that the pool area was very crowded and in need of some reorganization. Overall, Paris was a very pleasant Vegas experience.", "title": "Wonderful Experience", "helpfulness": 2, "user": "Shelly P", "date": "July 20, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2309344}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "I attended a convention here in early July. Check in at the airport was a breeze. You can't beat the convenient location of the Paris on mid-strip. I also found the Paris more comfortable and not as overwhelming as other larger Las Vegas hotels. My room had a comfortable king size bed and marble bath with a separate stall shower. The toiletries provided were 5&10 quality, not commensurate with the quality of the rest of the hotel. It didn't really matter however for me since I always travel with my own.", "title": "Paris Fantasy", "helpfulness": 6, "user": "Chita44", "date": "July 15, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 2301547}, {"rating": 2.0, "title": "Captures the Essence of France", "text": "I speak French and have lived in Paris, France. Paris, Las Vegas is a charming fantasy of a Paris that no longer exists, perhaps never existed, with strains of Piaf and Aznavour wafting through the cobble stone street, Le Notre Patisserie, la Boulangerie and various boutiques and restaurants.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 15, 2004", "id": 2301112}, {"rating": 3.0, "title": "Hot time in vegas", "text": "The public rest rooms were so beautiful that some women were taking photos of them.", "helpfulness": 6, "user": "vegascalling", "date": "July 14, 2004", "id": 2295387}, {"rating": 4.0, "title": "wonderful relaxing hotel with great food.", "text": "I had a fabulous lunch buffet at Le Village with representative dishes from different regions of France with an array of fabulous pastries and desserts, one of which would cost $8 or $9 in a NYC restaurant, all for $17! I never had a bad meal at any of the restaurants in the Paris and the cocktail lounge, the gorgeous Napoleon had a happy hour special of free high quality sandwiches with the purchase of even a $4 beer.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 11, 2004", "id": 2288612}, {"rating": 5.0, "title": "Do not miss!!!", "text": "This is a wonderful hotel, beautiful room, amazing foods. I thought I was actually in Paris! DO NOT MISS the show We Will Rock You at the Paris. We can't wait to see it again.", "helpfulness": 4, "user": "hollydeed", "date": "December 8, 2004", "id": 2872939}, {"rating": 4.0, "title": "SATISFIED", "text": "First of all this was the 3rd hotel I stayed at in my 6 days in Vegas from Nov 23 to the 29 and if you have allergies this hotel seems to have the best filtering system. My husband and I noticed right away. I had been bothered with allergies since I left Va. and I noticed quite an improvement when I stayed in this room. The room was very clean,and adequate,we had a p-room on the 17th floor, overall for the price it was a good deal. The Village Buffet was great for breakfast, the atmosphere walking thru the mall and the downstairs was very beautiful and busy. The model was great to watch, the experience was quite pleasurable. This was my 2nd time at the Paris, I was there 4 years ago and most definetely I will be back. Why? because I was satisfied.", "helpfulness": 3, "user": "JudyE65", "date": "December 5, 2004", "id": 2863557}, {"rating": 3.0, "title": "Lesson in Paris", "text": "We stayed at this hotel the week of Thanksgiving and it was ok, but nothing to brag about. I think it was over stated and the prices were high in the places you had to eat at. Waiting line to eat at times were from 1-1 1/2 hours long.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 1, 2004", "id": 2858247}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "There were no coffee pots in our rooms and we wonder why and after we went down stairs we found out why? The coffee was 2.25 .", "title": "Loved Paris Las Vegas", "helpfulness": 4, "user": "Mary A", "date": "November 30, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2855099}, {"rating": 5.0, "title": "Paris Hotel the Best!", "text": "D/Oklahoma", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 23, 2004", "id": 2842462}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Unless you want serious 5 star accommodation I would definitely recommend Paris and would stay again.", "title": "Great location and good value", "helpfulness": 4, "user": "Riesling", "date": "February 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125414592}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Large rooms, well kept. The decor is european style (... Paris...) and as good or better than any 4 star I have stayed at in Europe or Australia, except the rooms are huge. All very clean, comfortable beds, lots of pillows and towels, basic bathroom kit supplied (not luxury or branded).", "title": "depends what you're looking for.....", "helpfulness": 1, "user": "leslie232", "date": "February 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125400272}, {"rating": 2.0, "title": "Noisy, Street Noise, Pool Noise", "text": "The gambling area itself is small to medium sized. What we really liked, as 3 friends in our 30s, was the variety of (reasonably priced) bars, restaurants and cafes, so if one person wants to gamble, or gets up very early, there's plenty here. The only casino's to match this feel are New York New York (reasonably priced) and the Bellagio (higher prices).", "user": "ogottogo11", "date": "February 28, 2012", "id": 125328342}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Going up the Eiffel Tower is a must for everyone. Fantastic views of all Vegas, and especially the Bellagio fountains. Be sure to get. 2for1 coupon from one of the many Vegas booklets you can pick up at various receptions.", "title": "Great location but not what it was.", "helpfulness": 6, "user": "McGeepers", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125326761}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "We had three rooms - 2 red rooms and a standard blue room. They were much the same, except the red rooms were on higher floors. One had a view of the Bellagio which was nice, but not make or break.", "title": "Not what you would expect from one of the big 4", "helpfulness": 1, "user": "meeshnips", "date": "February 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 125325815}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I was simply disgusted!!! The lobby is awe inspiring, it took us no time to check in- our room wasn't immediatly available but we were offered another room that was. Elevators as well as corridors - really, really nice! When we entered our 2 queen room this is where everything went wrong! Carpeting was completly ran down, there were holes in the bed shams, the bathroom door knob fell off in my hand, the lamps attatched to the wall in the restroom had pieces broken and the bulb was not tightened which made it flicker. And to top it all off at 8am on the morning of check-out, the house keeper knocked on the door, not waiting for a response, she opened the door walked in and asked us what time we were checking out!!! I was completley dumbfounded...needless to say all of this was reported to management and the only thing I was offered was a late check out! I do not recomend this hotel at all...there are alot nicer hotels for the money!", "title": "DREADFUL!!!!", "helpfulness": 2, "user": "toptraveler5", "date": "May 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 29302345}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "I arrived on Tuesday- was able to check in right away. I had a room with not much of a view. It seemed like the room had seen better days (large dings in the furniture, worn grout in the bathroom, slightly stained carpeting). The bed was very comfortable. Had a strange notice left on the table stating they would be shutting off power from 12am to 5am in the hotel so that they could do updates. They warned only a few elevators would be working and left light sticks to use. It was supposed to happen on 5/1. Interestingly, I the power never did go off?!? Room service and housekeeping were very attentive. The Mandara Spa I give mixed reviews. I got a massage and a facial. The massage was good- I think his name was Ovid. The facial was done by Elena who, of course, tried to sell me at least $100 dollers worth of product. As I was dressing after the facial, I noticed a slight rash on my upper chest where she had massaged in some product. When brought to her attention, she stated she didn't think it had anything to do with the facial. I disagree, but it was not very noticeable and has since gone away. The one major issue I had with the ladies spa area were the showers. Not very clean, on the dark side and I noted in more than 1 shower some grout that appeared to be moldy. Finally, there was one shower that had a faceplate about to fall off as well as the shower head was leaky and looked like it was on its last legs. While these appear to minor issues, the fact is if you charge as much as they do, I expect excellence. Probably won't use spa or stay at Paris again.", "title": "Not bad.", "helpfulness": 2, "user": "pltslp", "date": "May 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29209134}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My mom and I spent a weekend in Las Vegas and although I had had my heart set on staying at the Mirage I simply could not deny the great deal we were offered at Paris.", "title": "Paris? Oui!", "helpfulness": 9, "user": "LittleTigerLily", "date": "May 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29196385}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Once we were there I never regretted my decision for a minute. The location was even better than my last stay (Treasure Island) and the only con I could find compared to Treasure Island -- which I love -- was that the beds were not nearly as comfortable. But the bathroom was great!", "title": "5 stars for the peeps", "helpfulness": 2, "user": "palmbriez", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29164278}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We even did the touristy thing and went up the Eiffel Tower Experience. I think the 12 dollar price is reasonable and if you come across one of the 2-for-1 coupons around then it becomes an obvious no-brainer. ABC Store is conveniently located at the Miracle Mile shops right beside you and, even better than the ABC store at Fashion Show mall, it's open till midnight so you can grab some bottled water and breakfast for the next morning for cheap.", "title": "Wonderful stay at Paris", "helpfulness": 11, "user": "nanwdwnut", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29057303}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "First of all the location of the Paris is the best thing about staying here. Right in the heart of the strip and most things to see are in walking distance. If not, you can catch a bus right out the front to places further away (Stratosphere, shopping outlets etc...). On arrival a non-smoking room was not available, we were offered a smoking room for the first night and then be moved to another room for the remainder of our stay (4 nights). We took this offer but it was disappointing that booking months in advance hadn't secured us a non-smoking room. I suppose the 'first in, best dressed' rule applies in hotels as big as this? We stayed in Red Room 2997 for the four remaining nights which had a part strip and Bellagio view.", "title": "Location is the key!", "helpfulness": 3, "user": "Faylou", "date": "May 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129727148}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "PROS", "title": "Nice Hotel with AMAZING Views!!!", "user": "Emma D", "date": "May 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129723187}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "- Good size room with very comfortable beds", "title": "The rooms are dated but still nice looking and clean.", "helpfulness": 3, "user": "surrealus", "date": "May 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 129710605}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- Lovely Parisian feel hotel", "title": "Great location, great food, everything else is so-so.", "helpfulness": 7, "user": "mgur1", "date": "May 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129672698}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "- Mon Ami Gabi restaurant - you have to eat here at least once. Not as expensive as I had expected and the food and service was fantastic. If you are a meat eater, try the 'Steak Classique - maître d’hôtel butter' - absolutely delicious!", "title": "Problem with disability accomodations", "helpfulness": 2, "user": "D S", "date": "May 8, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 2.0}, "id": 129614822}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed here for two nights at the begining of a trip touring the canyon and national parks. Check-in was very quick but very pushy in trying to get us to upgrade to a suite - not very happy when we declined.", "title": "Very Nice Hotel - Tres Bien!!!", "helpfulness": 2, "user": "Maeboyce", "date": "May 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129945523}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I had read some reviews of the hotel needing a refurb and was a little concerned. However, our room was charming, a decent size, nice decor (if a tad dated) and very clean. The beds were very very comfortable and we had a great rest.", "title": "The amazing charms of Paris", "user": "jamey s", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129942579}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The pool area is very well run with friendly staff although the pool was more than a little cold....brrrr. We also took a trip up the Tower at night and the view was amazing.", "title": "Excellent Location & Selection of Restaurants", "helpfulness": 1, "user": "amuenk", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129929572}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "While at the hotel we tried their crepes - fantastic, bakery - again cakes gorgeous. Sadly however we could not recommend their breakfast buffet. This costs about $5.00 less than the Bellagio and the difference in the two was night and day - could not recommend this restaurant to anyone - spend the extra and go to the Bellagio or Wynn - you will not regret it.", "title": "Great Location", "helpfulness": 1, "user": "jokerpoker_1", "date": "May 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129922995}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "All in all though, a hotel I would be very happy to return to in the future.....", "title": "Rooms gettting a little tired but the location is fantastic", "user": "Chris B", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129882994}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I know it's Las Vegas, I know casinos have been smoky places since the dawn of time... but... this was pretty disgusting. Stayed on a non-smoking floor, but it didn't really help. One of the smokiest bar areas on the casino floor is right next to the main bank of elevators - you have to walk by it to get anywhere.", "title": "Non-smokers, people who like clean rooms would be happier elsewhere...", "helpfulness": 2, "user": "lola_loveridge", "date": "May 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 29799229}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Our room had a thick layer of dust/dirt on the carpet all around the perimeter of the room (you could see it very clearly as the carpet was blue). I guess the maids haven't heard of that crevice/corner attachment.", "title": "Great position, one of the best places to stay in Vegas!", "helpfulness": 5, "user": "Welshsheep101", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 29760484}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Based on prices alone, you'd think Paris was right up there with Bellagio, Venetian, etc, but we visited those places during our stay and those properties were much more nicely maintained, and the air quality was MUCH better. (People smoke plenty in those hotels but they must work hard to filter/ventilate, because you hardly notice it. When you walk into the Paris, your throat starts to tighten on that first inhale. It's very disturbing.)", "title": "just booked again for 14 night stay", "helpfulness": 2, "user": "lindajackson", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29703004}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "On the bright side, the location can't be beat (center of the strip, across from the Bellagio and next to Planet Hollywood and great shopping), and we had a nice time around the pool (good music, friendly waitresses). However, unless Paris upgrades their air filtration, or Vegas laws crack down on smoking in casinos (unlikely), I'd avoid this place, especially at the prices they're asking -- even with the economic downturn.", "title": "Nice stay at Paris", "user": "Reddleigh", "date": "May 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 29693259}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed here for the first three days of our honeymoon and I must say that it was fantastic. We initially chose Paris for its location and were not disappointed-if you want somewhere that's bang in the middle of the strip then this is it.", "title": "you get what you pay for a quality hotel", "helpfulness": 1, "user": "maprak", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29680167}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "My 3 girlfriend and I from the UK stayed her for 3 nights at the end of January 2012. We cannot recommend this hotle enough!", "title": "Excellent", "helpfulness": 3, "user": "Zoe D", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125226578}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The rooms were hugh, each of our rooms having 2 queen beds. The rooms were clean and the bathroom was excellent!", "title": "Paris! with ooh la la at it's best!", "helpfulness": 1, "user": "Eric R", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125223908}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The location of this hotel is excellent for all things! If you are doing sightseeing trips all of the pick up points for our trips were only a few steps away which was handy!", "title": "Great location but no free wi-fi!?", "user": "KTandP", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125216541}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The only thing lacking in the room were tea/coffee making facilities, however the hotel has a lovely bakery downstairs where these can be bought along with freshly baked breakfast every morning! Yummy!!", "title": "Great location, common areas, service attitude lacking", "helpfulness": 2, "user": "Walter K", "date": "February 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125193451}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We found the staff to be very helpful too. We would def stay here again and would recommend staying here on location alone!", "title": "Paris needs help!", "helpfulness": 4, "user": "Bossea", "date": "February 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 125180799}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "booked this hotel and flights on expedia for 6 nights and got a really good deal. me and my hubby went to vegas for the boxing at the MGM, so booked early before the tickets went on sale and got a really good deal. paid £40 for the room per night for the basic room. must have been a special deal the night we booked as came out a lot more expensive in the following days, but this may have been due to the boxing tickets going on sale. we stayed at the excalibur last time we went to Vegas. but the Paris is far superior and a much better location for us.", "title": "vegas vacation!", "helpfulness": 2, "user": "MrsTScotland", "date": "May 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 29659149}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "we arrived at 9pm after a very long flight, no queue at reception and the nice lady asked how we were, i told her we were very tired after the long flight. she asked if we wanted to upgrade to a \"red room\" for $40 per night. we declined as we were not planning on being in the room much, far too much to do and see and more important thing sto spend our $ on, so i said no thanks, she said she understood how we felt after a long flight as she had recently been on a trip to the uk said she would upgrade us from the luxury room to a premium room for free. both rooms were still the old style furnishings but the premium room had a better view. so we were very happy with our first impressions of the hotel and the staff.", "title": "Right in the middle of everything", "helpfulness": 2, "user": "tk4683", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29568214}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "our room was nice enough, clean and had a spacious bathroom. we couldn't have asked for a better room for £40 per night, we had a full view of the pool, eiffel tower and partial view of the strip and bellagio fountains.", "title": "Disappointed with Room", "helpfulness": 3, "user": "JenABQ", "date": "May 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 29465226}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "we eat at Cafe Ile St Louis a few times, we had to queue for 15 mins once, but quick service and good food. we didn't eat at any other places at the paris as I am a fussy eater and found some of them a bit fancy.", "title": "We thoroughly enjoyed the Paris Hotel!", "helpfulness": 2, "user": "Here There and Everywhere", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29425106}, {"rating": 2.0, "title": "Can you say we need coffee!!", "text": "it's worth going up the eiffel tower for the veiws, but use the 2 for 1 voucher found in most of the free coupon booklets.", "helpfulness": 1, "user": "MikelFallCity", "date": "May 5, 2009", "id": 29422174}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Stayed in Paris for 4 nights. Was very impressed by the \"Parisian\" feel to it. Similiar to the Venetian with the sky above, it really makes you feel like you are outside walking along sidewalks. We had a Strip View room but opted not for the \"red rooms\" (we were visiting our son who is in the Air Force and it did not seem appropriate since he would be staying 2 night with us...) Our room was clean, had a great view, and other than not liking the pillows, everything was fine. You can't beat the location, right in the middle of everything. We did ALOT of walking, be prepared!! One of the negatives is being directly across the street rom the Bellagio fountains. Although we had a great spot to watch the show, it is LOUD! Sounded like thunder booming. And no matter what hotel you stay in, Vegas is not for sleeping.", "title": "Quaint Parisian \"shops\"", "helpfulness": 2, "user": "mmgm", "date": "February 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 125176204}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "This is my fourth time staying at this property. It is centrally located on the Strip and is in walking distance to the other Caesars owned properties (except Rio). The rooms are very big, especially their suites. There are three types of suites and each type offers great views, regular rooms facing the Strip can be noisy with the Bellagio's fountain shows (loud booms can be heard during the show). Service is great, although Housekeeping will call you if your Do Not Disturb sign is up all day to make sure you need the room serviced. Room service is very good and tends to be on the fast side (under 40 minutes). This property is one of the more relaxed casinos, gamer friendly casinos- dealers and supervisors are friendlier than the other CZR properties (except for Ballys- they share dealers with Paris and are just as nice.)", "title": "Excellent property at the center of the action", "helpfulness": 5, "user": "DanBau", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125155527}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This our ninth trip to Las Vegas and second stay at Paris. The location is perfect to walk the strip in both directions. We found our room to be clean and plenty big for the short amount of time you spend in a Las Vegas room. We had a clogged sink, called maintenance and it was fixed by the time we returned to our room. Front desk was very nice and informative.", "title": "Perfect location, nice room for money", "helpfulness": 1, "user": "Moose26", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125145139}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Enjoyed sitting outside at Mon Ami Gabi, enjoying a good meal and watching the Bellagio dancing waters. Also had delicious pastries and coffee from the cafes each morning.", "title": "Beautiful surroundings , bad service", "helpfulness": 5, "user": "ech_zed", "date": "February 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 125140130}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "If you want a nice room, at a perfect location, with a fair price, I recommend staying at Paris.", "title": "Had a lovely stay", "helpfulness": 6, "user": "YorkBarney", "date": "February 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125138444}, {"rating": 3.0, "title": "Pretty good but it's not Paris France", "text": "Our group had annual gathering over July 4th. Checked in and got room keys at the airport so went straight to room without having to go to reception at hotel; office of group including Paris located behind baggage claim #1.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 10, 2004", "id": 2286954}, {"rating": 4.0, "title": "Nice Rooms", "text": "We were on 19th floor. Room was fine but nothing exceptional, like most hotel/motel rooms. Comfortable king bed. Easy chair plus loveseat with coffee table. Internet connection available. Iron/board. Excellent elevators, fast and quiet, unlike some conventions where eveybody complains about slow ones.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 7, 2004", "id": 2281570}, {"rating": 4.0, "title": "It was a good, clean room", "text": "Atmosphere tries to emulate a Paris street with some success. Changing \"sky\" overhead according to time of day, cobblestone sidewalks. Gorgeous outdoor pool and good cafe on 3rd floor at base of \"Eiffel Tower\". This is a huge place, lots of walking. Several restaurants and they were all crowded. We ate at Ile St Louis and Provencal (French and Italian), good but somewhat expensive. and of course there is the gaming area . Had live music on a stage.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 1, 2004", "id": 2249500}, {"rating": 2.0, "title": "Needs Re-furbishing", "text": "Very impressive and we would stay here again if forced to go to Las Vegas (but actually we prefer the real thing.)", "helpfulness": 1, "user": "gtmFt.Thomas", "date": "June 30, 2004", "id": 2230901}, {"rating": 5.0, "title": "A Number One Spot for Vegas", "text": "We stayed at the Paris in May of this year. Check in was very long - there was quite a line and it took us over 30 minutes to check in. We ended up having to change our dinner reservations because of it. Additionally, the king we had booked was not available so we had two doubles. When we got to our room we were concerned as it was next to the maid's closet. However, noise was never a problem and we ended up staying in that room despite the hotel's offer to move us the second night. The rooms were comfortable, bathrooms were a nice size, and housekeeping seemed to do a great job.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 30, 2004", "id": 2230185}, {"rating": 5.0, "title": "We can't wait to go back!", "text": "My husband and I went to Las Vegas for our honeymoon, and having enjoyed our last trip to France we decided to stay at the francophone friendly Paris hotel. I have to say that I am surprised at these negative reviews! Maybe these people expected too much! We didn't expect anything but a good time and we were thrilled with our stay. The staff was very friendly and even upgraded our room! The food is delicious and we never ran out of choices of what to eat. The pool is beautiful and a pleasure to spend time at. And the Paris is in the middle of everything! It is so easy to get everywhere, especially with the monorail. I would highly recommend the Paris to anyone who is going to Las Vegas. We are even planning on going back for our first anniversary!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 1, 2004", "id": 2799224}, {"rating": 1.0, "title": "Another money hungry Vegas hotel", "text": "Earlier this month I had reserved a room at the Paris. Unfortunately I needed to change my reservations to one day earlier. Paris claimed they had no rooms available that night (I later learned that was untrue). I then informed them I would have to cancel my original reservation. They said that was fine but the penalty would be a charge for one nights stay. This was even though I sought this change three days before my arrival date. Three days notice is not enough for the Paris. Do I even need to say that I will never again consider staying at this hotel?", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 31, 2004", "id": 2797576}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "This is the 4th time, we have been to Las Vegas. And I prefer Paris to the other hotels. It is beautiful and cosy. The large rooms are decorated very nicely and the buffet is ...mmmhh! (the best belgian waffels and lots of other items). The hotel is situated on the other side of the Bellagio, near Cesars Palace, so you are in the middle of everything. And the show \"We will rock you\" is very worth seeing it. (but don't miss the cirque de soleil!!).", "title": "wonderful rooms and a georgous buffet", "helpfulness": 2, "user": "sweetmarie", "date": "October 29, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2794500}, {"rating": 4.0, "title": "This Place Was Great!", "text": "We stayed at Paris from Oct 21-25. I had called the hotel directly to make my room reservations in August for a deluxe king smoking room. Since our flight was due to arrive much earlier than the 3 pm check-in time, I was instructed to do embassitor checkin over the phone before we left Atlanta Thursday morning. The helpful attendant said that our room would be ready whenever we arrived if we did that. There was no extra charge for using this service. Once we arrived in Las Vegas, we were able to walk right up to Paris' embassitor checkin area and get right into our room by 11:15 am. There was no wait. The room was above average in space and the furnature provided, specifically the combination armour and entertainment unit, was an added bonus. Very large and spacious bathroom with large vanity area and choice of free-standing tub or shower. Accessing the highspeed internet service from your own personal laptop computer was a breeze as well and far easier than other hotels where we have used internet service in the past. I also feel the $10 per 24-hr fee was quite reasonable for high speed access. Maid service for Paris was well above average. And the pm turndown service and spot clean, complete with chocolate left pillowside, was an additional added plus not seen in my typical hotel stay experience. The only negatives were first the bed pillows. I found them very uncomfortable. And also the keycards getting corrupted and not working (the cause is a magnetic clip on a woman's purse or key being stored near a cell phone. So make note not to have your room keycard near either during your stay). Otherwise, I absolutely loved this hotel, it's staff and the service we experienced during our stay. I will definitely want to stay here again when I return to Las Vegas in the Spring.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 27, 2004", "id": 2789473}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Stayed for 3 nights in a twin room in October. Wonderful location in the centre of the strip with easy access to Bally's next door and the Bellagio across the street. We had lunch in the buffet on the first day which was actaully the best we had our whole stay in Vegas (the Bellagio buffet included). Our waitress needed few lessons in service, but the food quality was impecible. We were impressed with the bars and shops within the hotel. The tour and show desk staff were very helpful gave us valuable advice on where to go to do our laundry without paying the high hotel laundry fees. Room was quite large and the huge bathroom impressive with marble tiles, seperarte bath and shower and quality fittings. We were given a nice room overlooking the strip and were impressed that we were checked on within half an hour of arriving by a staff member to ensure our room was to our liking. No Mini bar in room - but the ice machine was just down the hall with a snack machine also.", "title": "Spectacular Vegas Hotel", "helpfulness": 8, "user": "msmegmog", "date": "October 25, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2784045}, {"rating": 1.0, "title": "Very deceptive!", "text": "I have read some up and down reviews of the Paris before but took a chance booking a jacuzzi suite for a 4 day stay just recently with my boyfriend. We accessed the site through the Ballys-Paris website with full descriptions and prices. We very clearly booked this type of room with a view of the strip for a specified upgrade in price over the basic room. Upon arrival, we were presented with a xeroxed sheet of price upgrades for suites. When we expressed confusion, we were told that the Paris never guaranteed a specific type of room to an online booking only a basic room that you could upgrade. We asked why there were pics and different price categories then online.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 29, 2004", "id": 2229146}, {"rating": 4.0, "title": "Educate", "text": "She kept assuring us we were wrong about our info and that we only paid for a view of the strip and we got a discount for that online. Well according to her sheet of prices we got a discount, but upon later accessing the web again (surprise the website had changed its info, is it possible they were losing money on the deal?), we indeed found the room with the strip view was quoted at almost 20 dollars lower online. Now remember we were supposedly getting a deal already.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 27, 2004", "id": 2224688}, {"rating": 5.0, "title": "What is French for \"Muy bien?\"", "text": "Needless to say we were not going to pay another $125 for the same room we thought we booked but were forced to stay since it was after 10 pm. The desk attendant kept quoting rack rates of $800 a night to prove what a deal we were being offered. Upon arrival in the room small and basic at best, I booked a suite at NYNY for about 20 more than our basic room price. I was not disappointed either, only kicked myself that I had not followed my instincts in booking the room in the first place at the NYNY.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 26, 2004", "id": 2222824}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Back to the Paris review, yes the halls and the check in area were beautiful, but the room was small for the money. The air conditioner barely worked, bed was not comfortable, and the shower handle fell off when touched. Inadequate soap supply. And the one upgrade they explained we payed for, the view of the Strip, was through a very dirty window. All in all, I would not stay here again, I work in Vegas often and have stayed at various resorts, this was by far my most disappointing experience.", "title": "Nice hotel in a great location", "helpfulness": 5, "user": "MrTed", "date": "June 15, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 2190753}, {"rating": 4.0, "title": "Great location, clean hotel", "text": "I think the biggest mistake anybody can make when going to Las Vegas is thinking that everything is free and that the casinos just give things away. First of all if people did research on hotels and Las Vegas they would understand. The casinos give away \"comps\" based on how much you gamble in the casino and how long you gamble, just like any business every comp given out must be justified, we all have superiors to report to. Secondly, when you book a room at a hotel in Las Vegas you should probably read the fine print. What you pay for is a room not the type of room. 100% of the time you will see that PREFERENCES ARE NOTED BUT CANNOT BE GUARANTEED. So if you are planning to visit Las Vegas and you think that because we have 3000 room hotels and we will give you whatever you want for free (i.e upgrades, food, amenities or anything else) you're wrong. Do some research and educate yourself before coming to Las Vegas. NOTHING IS EVER FREE", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 10, 2004", "id": 2180155}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 465, "average": 1195, "very good": 2767, "terrible": 291, "excellent": 2151}, "aka": "Paris Las Vegas Hotel Las Vegas", "slim_ranking": 0.27037037037, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Combining the old-world charm and style of the City of Lights with the excitement of Sin City, you won’t find a more romantic spot than Paris Las Vegas. Dine 110 feet above the Strip in the Eiffel Tower Restaurant or go all the way to the top and enjoy a stunning view of the city. Back on the ground, guests can enjoy French-inspired cuisine at Le Artistes Steakhouse or a fun twist on an American classic at Le Burger Brasserie Sports Grille. Le Boulevard hosts a variety of shopping, dining and entertainment choices including Le Village Buffet and Napoleon’s Dueling Pianos. In the Paris Theatre, legendary singer/songwriter Barry Manilow takes the stage with passionate performances. And newly added to Paris, the sophisticated Chateau Nightclub & Gardens is the latest \"see and be seen\" hotspot while Sugar Factory welcomes guests into a confectionery heaven where MTV meets Willy Wonka – right on the Las Vegas Strip."}