{"user_rating": 5.0, "review_count": 80, "name": "Parkfield Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have stayed at parkfield on a number of occasions over the years and would rate this guest house as first class. John and Sue always make our stay in the Lakes memorable even when the weather is foul.", "title": "We would not stay anywhere else.", "user": "Susan U", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146676661}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We have just returned from a lovely weekend stay with them and wish we could have stayed longer. Looking forward to our next visit. What more can I say.", "title": "Another fantastic stay!", "user": "Angie F", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144661594}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We have just returned from our second stay at Parkfield Guest House and have thoroughly enjoyed every aspect of our visit. The hospitality of the hosts John and Susan is second to none; going out of their way to make our stay special. It is the personal touches which make all the difference, such as helping with luggage, parking our car, remembering all our names and making restaurant bookings for our evening meals. The rooms are immaculately presented and are a warm and cosy haven to return to at the end of the day. We stayed in the double suite at the front of the house with amazing views out of the window over Crow Park and the distant snow topped mountains and our two sons (17 and 21) shared the twin suite. Both are highly recommended! With an excellent location to boot, what more could you ask for? Don't hesitate to book this little gem, you won't be disappointed!", "title": "a great find", "user": "holiday186560", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144167721}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Just had our first visit to the parkfield guest house last week-end, but it won't be our last. Such a comfortable house and friendly hosts, we felt welcome from the minute we arrived. Lovely spacious bedroom with great views. Parkfield is in such a good location for everything we wanted to do, and parking was an added bonus.", "title": "Great location and customer service", "user": "Vivian_03", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141194970}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We spent two nights at this B&B. John, the owner, unloads your luggage and parks your car for you in the private carpark at the back of the house. He offers to carry your luggage up to your room (which we declined because we wanted to stay in shape!) The home is well cared for and the room was very nice. It was spacious and had several chairs so you didn't have to sit on the bed if you wanted to rest. The mattress was comfortable. The bathroom was clean with plenty of towels, soaps, etc. Cooked breakfast was available daily as were cereals, fresh fruits, juices, yogurt, etc.", "title": "The best in Keswick", "user": "JaniceBec", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140502144}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My last visit to Keswick was a disaster and if I never returned it would not have been a problem. However, returned for a quiet and pleasant weekend and I have to say this was a great experience. No complaints at all the experience was exceptional and Sue and John were the difference as you cannot beat exceptional hosts with an exceptional breakfast. If you go to Keswick do not accept second best stay at the Parkfield Guest House.Sue and John you are amazing hosts thank you.", "title": "Wow Great Experience", "user": "markdunlaoire", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160481269}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Due to a short notice booking our usual guest house was fully booked, so Parkfield Guest house was recommended. We were met at the door by John, who wasted no time in parking the car in the secure car park round the back and carrying the heaviest of the luggage up to the most beautiful room. Spotlessly clean, and with a view to take your breath away. Having had chance to view a couple of other rooms, we found them all to be of the same high standard. Nothing was too much trouble, and Sue's breakfast's are legendary. Parkfield Guest House will be our first choice in the future. On that weekend in May, we found the best Guest House in Keswick, looked after by two of the most friendly and welcoming people, who made our stay extra special. Thank You Sue & John.", "title": "A weekend of discovery", "user": "RobertDakin", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160167078}, {"rating": 5.0, "title": "We'd love to return.", "text": "From the first moment we arrived, we knew this was going to be a great visit. John met us at the door, introduced us to other guests and fixed us a nice cuppa tea before he moved and parked our car for us and helped us with our bags. He was always ready to help us in any way, from parking the car to cleaning muddy shoes. Our room, though small, was a treat, nicely decorated and with a comfortable bed and tea fixings. Just nice little touches, from the nice soaps to the snacks and bottled water, every comfort was anticipated. Breakfast by Susan was excellent, too. The location is a very easy walk to the park and lake, theater, and downtown with its pubs. Overall, I was just disappointed we couldn't stay longer!", "user": "Ed M", "date": "May 6, 2013", "id": 159842998}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We came across this guest house a couple of years ago and could not believe our find! We visit a couple of times a year ! We would highly recommend this for position, round corner to centre of Keswick, spotlessly clean and Susan n John really nice people. The rooms modern n cleaned each day, breakfast brilliant and sets you off for the day! Nothing is too much trouble, they just go the extra mile to ensure your stay is the best! Car parking is at the back of the guest house and room for all cars.", "title": "The best guest house in Keswick!!", "user": "mandydavid", "date": "May 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159825158}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I would not hesitate to recommend this guest house to anyone! Some of my friends now visit and they thank me for telling than about this special find !", "title": "Ace Place", "user": "Brock2012", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159379916}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "we stayed at john & susans guest house at keswick.Not a 2 min walk from the town where there are load of shops and restuarants,and a lovley chip shop.the lake was a lovley walk.good job there is a lovley cafe there to get a cupa and a cake. we have never stayed in the lakes before,what a lovley place to stay for our first time.The guest house, well to start john&susan you have a beauitfull home ,you made bob and me feel very welcome and relaxed.Thanks to john for helping bob to park the car. That is a god send that they have FREE parking at there guest house. susan showed us to our room and john helped with the bags.The room was very cosey clean and warm, tea coffee and botteled water ready for us. also susan made us a lovley hot drink and biscuits.......The breakfast was was delicious. you could help your self to fruit,yoghurts,cerales,jucies,then susan will cook a breakfast and toast to your likeing.plenty to eat.....thank you.......We had a relexing, cosey , two day stay at parkfield guest house we will be going there again. Thank you to susan and john you made the break so lovley with your relaxed way,, and your good food,,and your lovley home. see you soon .", "title": "\"A comfortadle clean and fantastic food,stay\"", "user": "marie b", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154072338}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Just arrived home from a wonderful 4 days in Keswick staying at the Parkfield Guest House with my partner. Well what can I say, this was the best place I have stayed in.", "title": "A fantastic stay", "user": "KKaren W", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154000776}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The room... Beautifully presented, very comfortable bed and a very clean and spacious room with a view to die for. Our room was facing a beautiful park and golf course.", "title": "Amazing rooms clean and comfortable", "user": "Janice B", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153400488}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The food... Just delicious. We had a choice from plenty including a full cooked breakfast. Cooked by the owner Susan herself. Fantastic. My partner was impressed with the quantity as well as the quality.", "title": "Brilliant Guest House", "user": "Paul S", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151939405}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The location... Brilliantly situated just minutes walking distance from Keswick Town Centre where there is a range of shops / cafe's / restaurants etc. A great location for the lake and great walks too.", "title": "No better about!", "user": "fredskitz", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148728432}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is a very elegant guest house in a great position for enjoying the lovely town of Keswick. Our room was large and elegant and extremely comfortable. John was a great host and promptly served us a lovely cup of tea in the lounge. Breakfast was the best we have had in a guest house and we have stayed in many. We couldn't fault this place in any way.", "title": "What a great place to stay", "user": "heaneyra", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158771803}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed three days in September 2012. The room was wonderful, only exceeded by the friendly and attentive service provided by John and Susan. They helped with dinner reservations, travel advice, and with parking, etc. While hiking I took a tumble and got mud all over a sweater - somehow they were able to extract the mud and return it to me in perfect condition without having to send it out to a cleaner. Personal service, great breakfasts, and a great room - what more can you ask! Tom and Judy Ginn", "title": "This is the best", "user": "Thomas G", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158454830}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed at the Parkfield once again over the Easter break, we have been regular guests over the past few years years and cannot recommend it highly enough.", "title": "A Little Gem", "user": "flossylil", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157906762}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "John and Susan are the perfect hosts, making all their guests feel very welcome. They are also really helpful whenever any restaurant advice or suggestions are needed. The rooms are spotlessly clean and very comfortable and the Parkfield is in a perfect location, quiet but right in the centre of Keswick, with all its amenities close by. Breakfast is excellent, with a choice of fruit juice, cereals, fruit and yoghurts plus a full cooked english breakfast, tea/coffee and toast are plentiful.", "title": "Fabulous stay in the Lakes!", "user": "Carly J", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155925458}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We always have a thoroughly enjoyable and relaxing stay whenever we visit the Parkfield and look forward to our next visit soon.", "title": "Nothing was too much trouble", "user": "UKSteve", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155579983}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 78}, "slim_ranking": 0.0621468926554, "description": "Parkfield Guest House is situated in an enviable position in Keswick, being a short flat stroll to both the Town Centre theatre,and Derwentwater, \"Queen of the Lakes.\" Six en-suite rooms, including double, twin and king size, all recently refurbished - most have stunning views. We also have a large guest lounge with mountain views and soft seating for guests to enjoy. Parkfield has a private car park so guests can have a stress free stay."}