{"user_rating": 4.0, "review_count": 302, "name": "Parkdean - Ruda Holiday Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Visited this site last week courtesy of a Sun Hoiday deal. Pleasantly surprised to be allocated a Ashford caravan on arrival (despite only paying the basic price) which had 3 bedrooms (double and 2 twins) which had plenty of space for us (2 Adults, 2 small children). Despite the weather being pretty awful for the duration of our stay, we still had a wonderful time. Although we were grateful for the heating in the bedrooms and gas fire in the lounge.", "title": "Really impressed with Ruda!", "user": "sammi-loves-shopping", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143063138}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The caravan and park were wonderfully clean and well maintained. All the staff were extremely polite, friendly and very helpful. And although the entertainment wasn't of a stellar standard, my children were more than happy with Sid & Lizzie and the entertainment on offer each day.", "title": "Good lodge, nice and warm when the weather was not great", "user": "seanpearce78", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142984450}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I have visited Croyde for many years (since 1996) and have never stayed at Ruda. Although I can imagine it being a bit frantic in peak season, I would have absolutely no hesitation in returning again for another short break and hope to see the team at Ruda again next year.", "title": "Another brill holiday!", "user": "Emmadunn1988", "date": "October 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142801169}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "If I had one niggle, it would be the selection of drinks in the bar areas. It would be nice if they stocked more local brands rather than the type of stuff you can buy in any Wetherspoons pub throughout the country.", "title": "Peaceful, a land that time forgot!", "user": "rachel t", "date": "October 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 142654313}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This was our first holiday as a family, we rented a Rosemoor Lodge. The booking in process was swift, and easy, when we got there, we had no hot water, or heating. I asked security who sent maintenance over immediately. It ended up being my fault as I had not read the instructions properly!", "title": "Clean, well maintained and friendly", "user": "Ian S", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142535976}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed on a \"Sun Holiday special\" in July. We had the most basic caravan, which concerned me slightly as the last holiday park we stayed on in a basic caravan was a totally disgusting experience and I vowed never to say in basic again! However, I have to say we were very very surprised, the caravan was lovely, spotlessly clean and very spacious, the upgraded caravans must be like palaces!! The facilities on site were great, Cascades pool was a big hit with my 2 year old, you have to pay a small charge to go in, but this was no problem at all. They also had a small amusement arcade, and little soft play area, we made use of nearly all facilities on site, as the weather was total pants, rained every day. The location was superb, couple minutes walk from the beautiful beach, you could walk to the small village, I reckon it would take about 20 mins, but we were lazy and drove.", "title": "Fantastic stay", "user": "hobbs1e", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140618247}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I highly recommend The Thatch pub in the village centre for food, we ate in there and it really was delicious.", "title": "nice little site", "user": "karonrichards", "date": "September 14, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 140277460}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The village of Croyde is lovely, and well worth a visit, we have booked to go back to Ruda next year for a couple of days, just hope we get a bit of sunshine.", "title": "A fab caravan park in a great location", "user": "John A", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140135795}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "have been here once before,great beach for surfers, Nice clean site,some of the caravans could do with a bit a good clean and a bit of paint inside.great for children but found the entertainment a bit of a let down for adults with most of the shows finishing at 10.30pm.leaving just a disco to finish off.", "title": "Lovely location but awful beds", "user": "Lynn H", "date": "September 10, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "location": 5.0, "service": 4.0}, "id": 139953567}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I went to Ruda Holiday Park with my wife, two daughters (2 year old and a 12 week baby) and my parents on a Sun Holiday (Mon-Fri) in early September. Having been to the Parkdean sites at Trecco Bay and Pendine Sands we knew the standard of Parkdean sites tended to be high in our experience and Ruda was no exception. We were very fortunate to begin with, as we probably had the best weeks worth of weather of the year which was fantastic. The holiday had cost us £166, by the time we had upgraded to a 3 bed non-smoking caravan. This was definitely a blessing as we would have struggled in a 2 bed caravan for the space. You can imagine the amount of rubbish you need with a toddler and a baby!", "title": "Ruda Park caravan and lodge holiday", "user": "holtroad", "date": "September 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139144735}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I have been here with my now 12 year old daughters four years running, always for long weekend breaks and have always had a wonderful time. This weekend just gone was yet another lovely break for us. We had booked a 'Putsborough' caravan and for some reason we were upgraded at no extra charge to a 'Braunton'. We were suitably impressed with what it had to offer. Home from home with plenty of room, two toilets, roomy shower, a fridge freezer, flat screen TV etc....The temperature dipped in the evening but the heating soon warmed the caravan up. to a cosy level!", "title": "Fourth visit here and just booked my fifth....", "user": "mandiecb", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142510479}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "As ever, the children's parks were of a good standard. Ruda Park was spotlessly clean and the splash pool was great for the children. The on site chippy serves good food as does the restaurant.", "title": "An exceptionally clean & tidy site", "user": "jigglycornwall", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142070534}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The only thing that stopped me giving this review an 'excellent' rating was the onsite club. Having visited here for the past four years with family and friends and have always enjoyed the entertainment at the club and thought it was of a higher standard than that of other Parkdean sites. However, on this occasion, we were extremely disappointed. We were served overpriced drinks in dirty glasses, sat on ripped and dirty chairs at dirty, unclean tables and listened to what can only be described as tired entertainment voiced on a terrible sound system. On a Saturday night in the past, this club would be full but on this visit I can honestly say there could not have been more than 30 people in the room. Thinking the entertainment would improve as the evening wore on, we were proved wrong.", "title": "stress free camping!", "user": "merch16", "date": "September 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 141239866}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The place looked tired, dirty and untidy....COME ON PARKDEAN.....PAY SOME ATTENTION!!", "title": "Atlantic Apartments Ruda Holiday Park Croyde", "user": "billbobaggins999", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 141000501}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Croyde Bay has a lot to offer families Ruda's on site facilities and well kept parks, the beautiful beach (great for surfers), pretty town and surrounding countryside.", "title": "Rip Off Price!", "user": "jayne808", "date": "September 23, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "location": 5.0, "service": 4.0}, "id": 140969064}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I have just returned from Ruda touring caravan pitch, the pitches were of a good size but we could not use most of the pitch due to the lack of grass, muddy after rain or if you were really unlucky you had your own paddling pool. The only good thing about the shower block was that it was kept reasonably clean but it was definatly not 21st century. With such a big company charging high prices it is about time some of the profits were reinvested. The evening entertainment for the children was very lack lustre and lazy.", "title": "Not 4 star", "user": "glenys b", "date": "September 1, 2012", "detail_rating": {"value": 2.0, "location": 5.0, "service": 3.0}, "id": 139072888}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "We camped here from Friday to Monday. To be fair the weather hadn't been great running up to the weekend but the pitches are so over used the we were literally sleeping on stinky slimy mud patches. Very unpleasant. The shower blocks by us were filthy and the ones further up we're not much better. The volume of guests requires a full time toilet attendant. This is not the case. I think they are cleaned once maybe twice a day. Considering the site is mostly mud I would think this is not adequate. Entertainment was cheesy. They only good thing about the site is the location. It is about 2 mins from a great beach. It is full of surfers and families. My advice is go to Croyd but avoid ruda park.", "title": "Stinky, don't go there", "user": "Angela C", "date": "August 29, 2012", "detail_rating": {"cleanliness": 1.0, "location": 5.0}, "id": 138799050}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "we have stayed at ruda many times in our tent, there are 3 camping fields all with very large pitches our tent is 27ft we have plenty of room. The location is perfect you have a wonderful view of the ocean from your tent.", "title": "great for camping", "user": "endeara", "date": "August 29, 2012", "detail_rating": {"location": 5.0}, "id": 138777332}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Rudas touring facilities are good with a small shower block always open and a large shower block on the top field open when the fields are busy, lots of washing up sinks and plenty of water taps.", "title": "Great location", "user": "Cowboy358", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 138699208}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "When the weather is fine this is truely my favourite campsite because the beach is a very short walk away the location of the park is second to none, it's great for surfers but it can be very windy at croyde because it is very exposed, we had a bad weather week at whitsun and along with most of the campers had to pack up and leave early, we had gale force winds coming off the ocean not good in a tent!!", "title": "Wonderful location- lovely park!", "user": "haziec", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138196278}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 12, "average": 54, "very good": 119, "terrible": 12, "excellent": 105}, "aka": "Ruda Holiday Park Hotel", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 5.0}, "description": "Take a beautiful golden beach...Add in a generous helping of rolling surf, a sprinkle of thatched roof cottages, and a traditional village pub serving home cooked food... and you've got all the ingredients for an amazing holiday.Ruda Holiday Park is set right by Croyde Bay beach, a magical place with miles of rugged heritage coastline to explore, spectacular views of Lundy Island and, if you venture into the village, the most delicious Devonshire dairy ice cream! * Set right by the golden sands of stunning Croyde Bay * Surf School and hire shop on park * Direct access to South West Coastal Path * Amazing Tropical Adventure Pool on park * Fantastic Showtime Entertainment"}