{"user_rating": 4.0, "review_count": 382, "name": "Park Inn by Radisson Stockholm Hammarby Sjostad", "reviews": [{"rating": 4.0, "title": "Perfect for Ericsson Globe", "text": "A really nice good priced hotel ideal if you are going to the Ericsson Globe as it is only 3 stops on the tram, we stayed 3 nights and the room was comfortable, quiet and modern. The staff were friendly and helpful. Breakfast was nice, and unlike some other comments on here i felt it was a reasonable selection of cold and hot food.", "user": "Thealbones", "date": "May 4, 2013", "id": 159605750}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel is in a pretty residential area and very little around it just a couple of small restaurants. This was our first visit to Stockholm and I was happy with hotel choice for closeness to globe, but if you want to be right in the hustle and bustle of central stockholm this is not the perfect hotel as its a quiet area and everywhere is a pretty long walk - although the tram stop is just up the road and the tubes and trams are clean and safe, although a little pricey. We decided to walk everywhere and walked right into the north island, all around the old town it was great as we wanted to walk around and the weather was lovely - but we walked a pretty long way!. If you fly into Arlanda I recommend booking a taxi through the hotel as it is 450sek from airport to hotel - it costs virtually the same as the price for the Arlanda Express 250sek (my daughter is 11 and travelled free) and taxi from Gullmarsplan to Hotel 180sekl! So would work out much cheaper for a cab if there is a group of you. We will probably be staying here again in November for another event at the Globe.", "title": "Swedish Reunion", "helpfulness": 2, "user": "jokels", "date": "April 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 159250565}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The hotel is a mid range establishment In a new part of Stockholm. It is a simple but nice hotel and the size of the family room was AdequateThe breakfast was not extensive but acceptable. We did not eat any other meals in the hotel. The beds were comfortable and though we were 4, 2 adults and 2 children, we fitted in well.", "title": "Great for Hammarby", "helpfulness": 1, "user": "D72189541", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 158935768}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The proximity to the train station helped and e could easily access the city. I would probably return to this hotel as it is good value for money.", "title": "Great - enjoyed staying here", "user": "glyncoy", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 158152451}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Stay at this hotel on a regular basis and for Hammarby is great location, would not suit if you want to stay in Stockholm, Very friendly staff that cannot do enough for you, great rooms with amazing views... my only issue is the food on evening menu not the best, but surrounded by good restaurants and a good breakfast.", "title": "Couldn't have asked for much more.", "user": "Liv", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157910832}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Very good middle Class! It was our first time in that Park Inn Hotel in Stockholm (recommeded by some of our Friends) and during this Trip, we did spend there 2 Nights. all was fully ok and we did liked this Hotel and especially their friendly Employees there. Breakfast Service was also fully ok, with good Choices of hot Beverages. Staff did give us also good Recommendation for some Restaurants nearby.", "title": "Nice and fresh Design (Stockholm)", "user": "martinDULCEicecream", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169915035}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "We booked this hotel as part of our honeymoon stay for 5 days in Stockholm in May. Unfortunately, we were caught up by some emergency matters and knew only 3 days in advance that we would not be able to reach Stockholm as scheduled.", "title": "Good Hotel Room but Bad Service!!", "user": "juzzbe", "date": "July 28, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 169444916}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We proceeded to contact the web agent(which helped us to book the room) to request for an urgent cancellation for one night of our accommodation and refund (in part or full). However, they were not keen to help us and wanted us to contact the hotel direct.  We then proceeded as told but was advised by the hotel that they were also unable to help us as the cancellation and cash refund were dependent on the web agent. The hotel also advised that they would still 'checked us in' on the first day (without our presence) since we had already made full payments.  We were extremely exasperated! We then proceeded to contact the web agent for the second time, highlighting what the hotel advised.", "title": "Very good but hence it seems to attract holiday groups", "user": "Flyanand", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166587519}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Unfortunately, the agent again highlighted that all was up to the hotel concerned. After much request, the web agent finally agreed to call the hotel, only to come back shortly to inform us that our request had been rejected by Park Inn!", "title": "Just Excellent", "user": "costis_nic", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166087521}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "As we believed that our Skype call reception could have made the communication unclear, we proceeded to email both the web agent and Park Inn the next day. However, to date, both the agent and hotel did not reply to our emails.", "title": "Good hotel - recommended", "helpfulness": 2, "user": "amazingmuppet", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 163462645}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Have just returned from 3 nights at this hotel where I stayed whilst attending an event at Globen Arena.", "title": "Great hotel, would happily stay here again", "user": "misspink34", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178342434}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Hotel was perfect for our needs...clean, helpful staff, welcoming, great breakfast, free wifi, decent quality and fairly priced evening meals and really easy to reach via the city's public transport links. Rooms weren't massive, but perfectly ok for 2 people and the beds were comfortable.", "title": "Just an average 'nice' hotel", "user": "Maui-mango", "date": "September 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 176941704}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Would happily stay here again", "title": "Very nice", "helpfulness": 1, "user": "P T", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 173070978}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "The hotel is located in a nice neighborhood outside of downtown Stockholm (located via closeby Tram with connecting subway transit). The property has a small lobby with adjacent restaurant serving \"average\" food. There is a good restaurant about one block away. The rooms were nice, comfortable and quiet. There was a gym on the top floor with a nice view. So if you are not in a tour group, the hotel does not offer any extraordinary amenities and is not close to any of the main Stockholm attractions. Its just an average \"nice\" hotel.", "title": "Fresh design but details need work", "user": "Kanaman", "date": "August 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 3.0, "value": 4.0, "rooms": 3.0}, "id": 172845630}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was a very nice place with a GREAT breakfast. Staff was excellent. Nice room with an OK view. Only draw back was it was had to find originally from the transit stop. Fortunately, there were some Americans at the stop who knew where it was. It is a about 200 meters from the #22 tram (currently the #22 bus while work is done on the tram line. The bus ran frequently - no problem). Tram is a short ride to a T (subway) stop.", "title": "Nice hotel", "helpfulness": 2, "user": "Thunder_Horse", "date": "August 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170337365}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here as a part of a 10-day trip to Norway and Sweden. It was one of those modern, \"different\" no frills urban hotels that cater to groups and professionals, but we were fine as a family. its in a newly developing part of stolkholm, and it was a short drive to the attractions, and an itailian restaurant opened up the day we went there just down the street and it was excellent. Breakfast was good and while the groups were a bit loud, there was plenty of food and no lines. The shower was weirdly constructed, so you have to adjust water to avoid flooding.", "title": "Nice staff, no frills, large groups, new neighborhood, ok...", "user": "A L", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163190948}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed for 3 nights in June 2013 while visiting a local company. The hotel is modern and the rooms decent, very minimalist but comfy.", "title": "Decent hotel in a nice neighbourhood", "helpfulness": 1, "user": "alexander_lakey", "date": "June 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162997868}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Hammarby is now a nice (but quite quiet) residential neighbourhood, with a pleasant waterfront, cafes and restaurants. It is relatively close to central Stockholm, but if you intend spending time in the City centre you'll want to take a cab. There is a ferry, or the tram (and then Metro) but that might not suit some.", "title": "Park Inn in a park area", "user": "Azad690", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 162814371}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The rbg restaurant is excellent for breakfast with a really good selection of food, self service. I ate twice in the evening, and while the food is good, I think the service is slow. They just aren't attentive enough (and I'm a Brit, prepared to give the benefit of the doubt). I did mention my feelings to the hotel, who were very open to my comments, so they might take heed!", "title": "5 min walk to the tram/metro system", "helpfulness": 1, "user": "kwestLA", "date": "May 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161997489}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Overall, a good place to be based, especially if you are travelling on business to a company in one of the converted warehouses 10 minutes walk away.", "title": "very modern hotel with nice rooms", "user": "Bernd v", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160174264}], "location": {"country": "Sweden", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 41, "very good": 179, "terrible": 2, "excellent": 147}, "aka": "Park Inn By Radisson Stockholm Hammarby Sjostad Hotel", "slim_ranking": 0.142857142857}