{"user_rating": 3.5, "review_count": 39, "name": "Park Hotel Latgola", "reviews": [{"rating": 5.0, "title": "Great place!", "text": "Fantastic hotel. Absolutely stunning inside even if it is a bit of a concrete block outside. It has everything you need. Theres not a lot to do in the town but its a good place for a relaxing few days.", "helpfulness": 14, "user": "amjamwe", "date": "March 13, 2006", "id": 4606543}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Located in the very centre of Daugavpils. Got a room on the 9th floor (building have a total of 10) - view of the city was magnificent! Nice service, clean rooms, very enjoyable breakfast in the rooftop restaurant. Nice, but a bit noisy lobby bar (maybe because it was Friday night). Yes, and you can get a DBL room for as little as EUR 40! Probably the best place to stay in Daugavpils.", "title": "Great views!", "user": "Lexx_Naxxx", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115566267}, {"rating": 3.0, "stay_parameters": "Stayed September 2010", "text": "Stayed 1 night as part of a tour, didn't arrive until 21:30 and left the following morning at 08:30, so didn't get a chance to see the locality. Rooms were very good, spacious and clean. Lovely views from the restaurant over the main square. Our meal on arrival was a set menu, 3 courses, quite nice, but possibly not to everyone's taste. Breakfast was pretty basic, but adequate. The bar closed at midnight, but the beer was relatively cheap at £1:90 for half a litre.", "title": "Cheaper beer than Russia", "helpfulness": 1, "user": "exwetherby", "date": "January 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 95088413}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Had super experience at this hotel. Located in the very centre of Daugavpils, could not be in a better location. Rooms large and very clean. Large super market attached to the hotel. Large high standard sports complex with an excellent pool located within walking distance. Hotel has the best views in the area from its roof top bar and restraint. Excellent food but variety a little limited. Most staff speak English. I would definitely recommend this hotel.", "title": "Easily one of the best hotels in Latvia", "helpfulness": 4, "user": "MikeDUBIRL", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63189352}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed for one night as the Latvian Speedway Grand Prix was on the Saturday evening. We arrived at the hotel and the receptionist was very friendly and helpful with parking and directions information. We had booked a suite but it wasn't available when we arrived but they gave us a business class room instead. This was very basic and the carpet was stained. However it was clean. The best thing about this hotel was its location and friendliness of the reception staff. The bar area was good but the bar staff couldn't cope with the amount of guests arriving for the speeday and were sometimes rude.The worst thing was the breakfast . They had carrots peas and cauliflower and frankfurters. They ran out of coffee and bread. It was horrid. I would suggest that they update their rooms with a bit more luxury and get a new chef ! All in all fine for one night and not much to see in Daugavpils. We stayed in Riga the previous night which was a completely different experience.", "title": "Weird", "user": "Jodiedol", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 19598436, "likes": {"liked": "— location and nice friendly receptionist staff. Bar area was good.", "disliked": "— the food and room was ok"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "Stayed for four nights at the Latgola hotel.", "title": "Wonderful Hotel", "helpfulness": 2, "user": "reviewed", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5932718, "likes": {"liked": "— The location and friendly staff", "disliked": "— Small rooms"}}], "location": {"country": "Latvia", "region": "Latgale Region", "continent": "Europe", "city": "Daugavpils"}, "stars": 3, "variance": {"poor": 3, "average": 17, "very good": 14, "terrible": 0, "excellent": 5}, "slim_ranking": 0.25, "description": "Rooms:Park Hotel Latgola offers 118 facilitated rooms in the very heart of the town for the convenience of our guests:• 66 double standard rooms• 45 double business rooms• 6 double deluxe suite rooms• 1 apartment All rooms are made in the laconic Scandinavian manner. There is a TV-set, phone, hairdryer and the Internet connection in each room. Rooms for smokers and non-smokers are available. 2 rooms are fitted for people with special needs.Restaurant PLAZAThe main advantage of the restaurant PLAZA is the unique panorama view of Daugavpils city from the perspective of the bird’s flight, because it is placed on the 10th floor. The quiet, leisurely atmosphere, the original interior, attentive service and dainty dishes will favor every client with unforgettable moments. The restaurant can receive up to 100 people at a time; therefore it is a perfect choice for organization of corporate parties, balls, wedding festivities and other social activities.Conference Hall and Seminar HallsThe hotel offers halls of different area for conferences and seminars. Their capacity, a wide choice of modern equipment, various types of arrangement, as well as the light pastel shades and free atmosphere will allow you achieving the expected results. We offer:• 1 big conference hall for 180 people• 2 seminar halls for 25 people• 2 seminar halls for 15 peopleCoffee pauses, dinners and suppers, as well as the banquet organization are offered for the convenience of the guests.Sauna and Jacuzzi.We would like to offer our guests the opportunity of healthy relaxation at our hotel after an intense day, therefore we offer to improve their feeling of comfort in the sauna and in the bubbling Jacuzzi. The lounges can accommodate 20 people with comfort. They may be used for birthday parties and other less official events’ celebration. The view from the 10th floor of the hotel on Daugavpils will supplement the leisurely atmosphere of that evening!Tourism OfficeIt is important for every client to receive as much information as possible together with qualitative tourism services, which is our main task.The tourism office offers:• Excursion around Latgale, Latvia and Baltic countries• Flight tickets• Bus tickets• Visas to the Russian Federation and Byelorussia • Insurance of different kinds• Relaxation trips to the health resorts of Byelorussia. • Transport servicesBilliard HallBilliard is a nice way, how to spend free time! Therefore we offer to forget everyday cares and to spend a good time playing billiard with friends and colleagues in the hotel billiard hall, which is placed on the 1st floor. We offer 8 Pool tables, 2 Russian and 1 Snooker table.Lobby BarThe Lobby Bar on the ground floor is a perfect place where you can discuss business matters during coffee break, or just watch through the big windows at the city daily life. SouvenirsAfter you have spent good time in Daugavpils City we offer you purchasing original souvenirs, which will remind you of our hospitable city and the hotel. The range of souvenirs is very wide – you can find here the Latvian ceramics with the symbols of Daugavpils, leather goods and amber goods, knitted figured socks and mittens."}