{"user_rating": 3.0, "review_count": 253, "name": "Park Inn by Radisson Nice Airport", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Had 2 nights accommodation as part of Cosmos Tour. We were given room 117, before we entered the room, there is this terrible smell at the entrance. When we open the room, it was even worst like sewage has flooded the room. I knocked on next door room 118 to check if that is the latest French Perfume used by the hotel. Room 118 was alright. The guests in Room 118 agree that our room smell horrible. I went down to the reception to report the problem and ask for a room change. The girl at the counter told me the hotel is fully booked and they cannot change the room for me. There are 151 rooms and all fully occupied in mid-Oct!!! She offer to fix the odour problem by spraying more chemical. I mentioned that if this can be fixed, house-keeping should have done it when they are cleaning it today. The manager then offer to go to the room to check it out himself. He agreed that there is the bad odour and again ask me to put up for one night as they are fully booked and they will give me a new room for my second night. I refuse to sleep in the room and ask the manager to move the bed to the corridor, I am quite happy to sleep by the lift. Finally he make a phone call and told me there is another room available and he show me room 123 which is fine like any hotel room.", "title": "Smelly room and poor service", "helpfulness": 1, "user": "LovTravelOz", "date": "October 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 119883562}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Very poor service, expecting the guest to put up with the sewage smell. Poor standard.", "title": "Very average hotel!!!", "user": "Wez-0", "date": "October 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 119132085}, {"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "I have stayed in several Park Inn's before and previously liked the brand, but this particular one I was extremely disappointed by. The carpets in the room were filthy and stained and the shower had black mould in it. Don't stay here!", "title": "Ok for flying out but not for anything else", "user": "dancingvolleyballmom", "date": "September 20, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118350005}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Mold in shower but otherwise clean. Few outlets. Shuttle to airport runs only hourly which is a problem because cabs won't take you to airport since it's too close. Find another hotel if you are doing anything but flying out.", "title": "Only if want to be close to airport", "helpfulness": 1, "user": "KR2303", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 118051001}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Front desk girl was helpful with train info. Close to a train station.", "title": "Not bad........but, again.....", "user": "Vnvet68", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117981307}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "Im not a one to complain, but, we rang twice for the shuttle bus and they never sent it for us so we made our own way there.", "title": "Ok as a stop over hotel", "user": "Amc-diva", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 117924953}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Breakfast isn't fantastic, tinned fruit, scrambled egg with sausages and soggy mushrooms, croissants. Not worth £10 a head.", "title": "Basic and clean.", "user": "Julie P", "date": "September 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117919631}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Rooms were clean but a bit shabby.", "title": "bumps in the middle of the night!", "user": "Anonwhite", "date": "September 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 2.0}, "id": 117585814}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We choose it for the pool which was good but it does mean that you are a bit out of Nice and have to get the bus in which finishes at 9pm and a taxi back is about €20-25", "title": "Excellent start or end to a holiday if travelling on from Nice", "user": "KtebDevon", "date": "August 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117186802}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We stayed for five nights and it wasn't bad. Room was cramped and very basic, but it was clean and the bed was comfortable. The shower was also good. Swimming pool and sun beds were very good. Nice large towels supplied for the pool too. Breakfast wasn't very good. We tried the restaurant near the pool one lunch time and it was very expensive and very poor quality. I found this very offensive that they thought it acceptable to dish up such poor food. They didn't even comment when I pointed out that part of it was burnt. Needless to say, we avoided it thereafter. Wifi was also very overpriced so we never used it. Staff were quite friendly. Bus service was very good from airport Terminal1, 4 euros for a day pass. I think I would try another hotel next time.", "title": "An excellent choice for budget minded travellers", "user": "EmmanuelleDubai", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116649723}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Do not expect anything fancy, but at least the rooms are big enough and clean", "title": "Good enough if you need to be close to the airport", "user": "alvatrip", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126737556}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "You should be able to find prices around 90-100 euro which is OK for nice, you have the airport within 5mins walk and also you can take buses there towards the old town but remember buses stop very early (9pm or so) therefore you will probably need a taxi to head back to the hotel (around 20 euro from the old town)", "title": "Well done, super comfortable bed", "helpfulness": 2, "user": "FoodieWoody", "date": "January 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123198893}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The swiming pool area is nice and the pool is great for summer", "title": "Disappointing....", "helpfulness": 1, "user": "KateTosh", "date": "January 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 122848358}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Park Inn hotels are owned by Radisson Hotel Group and i must admit i have never actively wanted to stay in what i used to class in the same group as holiday inn or Premier Inn but i ended up in Park Inn, Nice France by pure chance (secret hotel deal) and i couldn't be happier so much so we stayed there 2 days later when returning to the airport.", "title": "A few drawbacks but nothing major", "helpfulness": 1, "user": "dextervhc", "date": "November 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121204546}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Although there colour logo is not wonderful there service was, we were given full access to all the facilities (most importantly we were told what all the facilities were).", "title": "The staff is outstanding!!", "helpfulness": 1, "user": "traveljball", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120396767}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here the last night of a two-week trip because we had to be at the airport at 5 AM the next morning.", "title": "Helpful staff - fine as an airport hotel.", "helpfulness": 2, "user": "hcajones", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130068387}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "We drove our rental car into the hotel's parking garage (a harrowing experience even with our small car), planning to have to pay the 15 Euro parking fee even though we planned to (and did) drive the car to Hertz at the airport within an hour so we wouldn't have to deal with car return the next morning. The front desk clerk graciously buzzed us out of the parking garage without making us buy the 15 Euro token. After I returned to car to Hertz, I called the hotel from the airport and their shuttle picked me up within about 15 minutes. (Their shuttle runs at least twice each hour, 24/7.) The shuttle also took us to the airport the next morning. The trip is only 5 - 7 minutes, at least when traffic is normal.", "title": "The pick of a bad bunch", "helpfulness": 1, "user": "olamicus", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129347949}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The only significant complaint about the hotel is that the front desk is understaffed. The front desk clerk was incredibly efficient and helpful, but he was trying to check people in, answer phones, help people make international phones calls, etc., all at the same time and all by himself. But he did it all graciously.", "title": "Great lunch", "user": "GeorgieSmith", "date": "April 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 127625264}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our room was pretty small for a 4-star hotel. Basically a nice room, but as others have noted there are areas of peeling paint, etc. The room was far too warm and the air conditioning would not adjust even though it was supposedly adjustable. We had absolutely no problems with aircraft noise or any other noise.", "title": "Not a 4 star!", "user": "sunnybun", "date": "April 8, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 127461278}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "I think this hotel gets 4 stars more because it's a full-service hotel than because of quality. We paid an advance, no-refund rate that was very reasonable. I would have been very unhappy had I paid the rack rate of 140+ Euros.", "title": "Does what it says on the tin", "user": "Kiwipeach021", "date": "April 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 127094388}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 38, "average": 76, "very good": 93, "terrible": 25, "excellent": 21}, "aka": "Park Inn By Radisson Nice Airport Hotel Nice", "slim_ranking": 0.568075117371, "description": "The Park Inn Nice Hotel is ideally located a few steps away from the famous Promenade des Anglais and St Laurent du Var Marina, close to Nice-Cote d’Azur International Airport and Nikaïa Concert Hall and offers the quiet and comfort of a 4* business hotel with upscale service.The hotel has 151 spacious rooms, all equipped with air conditioning, safe, cable TV and broadband internet access."}