{"user_rating": 4.0, "review_count": 2964, "name": "Park Inn by Radisson Berlin Alexanderplatz", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Park Inn is a old skyscraper from GDR times which has been completely renovated. Rooms are quiet small but very nicely done, in a modern way! We had a stunning view over Berlin and just that was actually worth the price. Breakfast is wonderful with a lot of choices, but a bit crowded due to very many bus tourists. Staff are friendly and very helpful.", "title": "Great room, great staaf, great breakfast", "user": "Travellerwithstyle", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21545089, "likes": {"liked": "— The view", "disliked": "— The crowded breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "I did not have much of a choice of hotels for my one night stay in Berlin. There was some kind of protest taking place in town and everything was booked. A few days before I left for my trip, this room popped up online and I grabbed it.", "title": "Just OK", "helpfulness": 1, "user": "alwaystraveling72", "date": "October 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 21301031, "likes": {"liked": "— This hotel was close to transportation", "disliked": "— Small rooms, small beds, and the Shower was not in the bathroom, but next to the beds seperated only by a curtain."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The room with 2 beds we recieved was small but managable. The one thing I hate about traveling in Europe is the small beds they give you. The room we were giving had a seperate bathroom with a toilet and a sink. The shower however was in the bedroom and was seperated from the beds and tv only by a curtain. Yes, I did feel that I had privacy while showering, but if anyone wants to leave the room or use the toilet at the same time, it would have intruded on privacy. The shower and toilet area were decorated with marble and the fixture were nice as well, except for the showerhead that would not stay up and continued to fall without holding it up. (yes I tryied to tighten the knob.)", "title": "Perfect Location!", "helpfulness": 2, "user": "badly1004", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 21279205, "likes": {"liked": "— The Location", "disliked": "— Bit of a rip-off on the roof terrace,"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel is in the eastern part of town. Alexanderplatz in convienently near the metro, just steps from the hotel entrance. There is also a city bus tour that allows you to get on and off all around the city, that stops right outside the hotel. The negative about the area is that is is probably the ugliest plaza in the city.", "title": "Loved It", "helpfulness": 1, "user": "Eur0pe08", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20739971, "likes": {"liked": "— Room and location", "disliked": "— That the men have to wear a tie to the casino. Which we were not informed about"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "If I were to go back to Berlin I would find a hotel in a more \"happening\" area of town.", "title": "Mixed Feelings", "helpfulness": 1, "user": "taoben", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 1.0}, "id": 20606841, "likes": {"liked": "— Service", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "I stayed at the Park Inn from July 2nd through the 6th. My father booked this hotel through his travel agent and we paid 109 Euros a night.", "title": "I'm still dreaming about their breakfast.", "helpfulness": 12, "user": "SusieGirl7", "date": "July 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5513324, "likes": {"liked": "— Location and breakfast.", "disliked": "— Crazy bathrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I think the location of the hotel is absolutely perfect. The S-Bahn and U-Bahn are just a few steps away (you're on the S-Bahn line to Schoenenfeld), as are the 100 & 200 bus lines. If you feel like walking, Unter der Linden is about 10 minutes away. Museum Island is about a 15 minute walk, or just take the bus. And right outside, there is a department store plus several places to eat or grab a snack.", "title": "its not perfect but good (great room)", "helpfulness": 5, "user": "deemps", "date": "July 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 5478583}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We must have paid the business rate because were were entitled to the free fancy breakfast - omg, what a spread. Eggs, sausages, fresh fruit, yogurt, jams, random veggies, muesli, cheeses, meats, all sorts of drinks and more varieties of delicious breads than I have seen in a while. The service was pretty good and I could have stayed there all morning. Seriously, I would go back just for the breakfast.", "title": "Ideal base for discovering Berlin", "helpfulness": 13, "user": "vermilion_red", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5436397}, {"rating": 5.0, "title": "Fab hotel & location", "text": "The people at the front desk were polite and helpful. There was some problem with our reservation (I blame the travel agent) but it was quickly resolved and we had rooms next to each other, despite arriving on different dates. Plus, they let me check in at 10am and the check-out went smoothly (we also lets on different dates). FYI - the front desk staff speaks perfect English.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 29, 2006", "id": 5407381}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We were on the 33rd floor. While our view was not of central Berlin, I still enjoyed looking out at the night lights. The bathroom set-up with the shower/toilet in the room was a bit odd, but the closets were nice and there was plenty of storage space. If the hotel had fluffy towels, I would have given them an \"Excellent\" rating. I enjoyed the built-in lamps by the bed and the nice comforter. Plus, the cleaning staff folded my pajamas for me. My sense was that the hotel gets lots of large groups, but it also works well for the individual traveler.", "title": "Good location, good breakfast,but!", "helpfulness": 11, "user": "SBlue", "date": "June 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 5333130}, {"rating": 4.0, "title": "great stay", "text": "Stayed at the Park Inn during February 2005, had a fantastic time.", "helpfulness": 4, "user": "peterhouse", "date": "March 20, 2005", "id": 3288714}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Rooms are fantastic as is the location . . .", "title": "Great location, great rooms but shocking service", "user": "Courts22", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 49915518}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "However I was spoken to so rudely by the restaurant manager that it has led me for the first time to complain on trip adviser - she shouted at my husband at breakfast and tried telling my husband and i where we could stand - i felt i was at school! When we asked to speak to her boss at the reception desk she came over and said she had done nothing wrong. I have never been so shocked at such lack of client understanding or failure by her to even try and appease a client", "title": "Central location, but missing the x factor", "user": "Paulrhodes16", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 49902335}, {"rating": 5.0, "title": "loved it!!!", "text": "In summary i would recommed hotel based on other factors but watch out for the female manager", "user": "kostasicebar", "date": "November 22, 2009", "id": 49832597}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "The hotel couldn't be easier to find, or more central.", "title": "The perfect place to stay in Berlin", "user": "Seagreen75", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49764275}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "You get a very warm welcome, and this carries over to the room which was too hot - and couldn't be cooled. I'd recommend asking for a room on a high floor (there are 37 to choose from) to get the benefit from it's lofty position. We were staying on floor 9, and the view was unremarkable.", "title": "Lived up to high expectations", "user": "George M", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49653748}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We had seven nights at Park Inn. We found it a wonderful hotel - very convenient to public transport - and shopping. Good food - and lots of cafe's nearby. We enjoyed being able to walk to lots of different parts of the city. The room was small and the clear shower was a bit strange but it was so clean and comfortable we managed. The staff was so friendly - and especially as we were from Australia and did not speak the language.", "title": "convenient clean and friendly", "user": "wattle07", "date": "November 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22015767, "likes": {"liked": "— convenience to public transport - very clean room", "disliked": "— not being able to make a cup of tea in our room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "On my first visit to Germany, earlier in the year ( May-2008 ) I stayed two nights in this Hotel. I understand it was originally an East German Hotel, but completely renovated. The room I was in was simply just about big enough for a single bed, with a toilet and separate shower, as reported on other reviews, both had frosted glass doors, so OK on your own no problem, but in a larger room, if you were \"shy\" could have been embarrassing...!!", "title": "Good Hotel, in a good Location", "user": "Allyone", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 21980086, "likes": {"liked": "— Location", "disliked": "— Size of the Room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "This was a room to sleep in no more, so not a big issue.", "title": "seethrough shower!", "user": "donnaHampshire", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 21930808, "likes": {"liked": "— rainforest shower", "disliked": "— transparent shower cubicle"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "It is in the heart of Alexanderplatz, with the U-Bahn and S-Bahn right on the doorstep, with a good selection of Restaurants and Bars within walking distance, indeed the walk up the Unter Den Linden, to the Brandenburg Gate passing some Historic sites on the way was no more than 30mins.", "title": "Nice hotel with a good location.", "user": "knsv", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21812353}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Bar in the Hotel was very pleasant, with a Piano playing, great to relax in, Breakfast was very good, if not a wee bit pricey ( 17 euros ) but filled you up for the day, very \"European\" rather than British/American, but hey it is Europe..!!", "title": "Good base", "user": "MandMM", "date": "November 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21586010}, {"rating": 5.0, "title": "Great Hotel", "text": "Newly remodeled. Easy location to find. Very close proximity to the subway and the historical downtown of Berlin.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 30, 2005", "id": 3723693}, {"rating": 5.0, "title": "Best place to stay in Berlin", "text": "Great buffet style restaurant located within the hotel with lots of food to choose from. Ask for a room up high facing the west - it will be worth the view.", "helpfulness": 2, "user": "rockchick22", "date": "July 1, 2005", "id": 3628100}, {"rating": 4.0, "title": "Don't need a map to find it!", "text": "Easy to find ...didn't need a map. Rooms basic and clean. Staff friendly and helpful.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3580676}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Went sightseeing and there was no way you could get lost. Would definately use this hotel again.", "title": "Fantastic!", "helpfulness": 2, "user": "Floski", "date": "June 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3573592}, {"rating": 4.0, "title": "Loved the hotel", "text": "Recently stayed there as part of a group of 21 blokes on a stag trip. Very convenient location to explore the eastern side of the city. Rooms are functional and business-like, with amazing views over the city (I was on the 16th foor).", "helpfulness": 4, "user": "Jayezz", "date": "May 8, 2005", "id": 3448928}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Park Inn for three nights on the 34th floor and were very happy with the accomodation and service for the price. Comfortable beds, great view (as good as the TV tower and free), super convenient. You can walk to many of the main attractions and there's an S-bahn / U-bahn / overland train station just steps from the hotel (Alexanderplatz). Transport-wise, you couldn't do better. We opted not to pay 15 euros for breakfast, bought pastries at the station instead.", "title": "Great value", "helpfulness": 4, "user": "SwissMrs.", "date": "March 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4692741}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Would not recommend this hotel if you are travelling with someone you're not intimate with. Toilet and shower separated by a lightly-frosted glass barrier that does not reach ceiling or floor. In short, there is no visual or auditory privacy...", "title": "Surpassed my expectations", "helpfulness": 3, "user": "z28r4cer", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4688981}, {"rating": 5.0, "title": "Great Price, Great Location", "text": "Lots of construction in the area right now, but noise was not a problem.", "helpfulness": 6, "user": "travel-walrus", "date": "March 6, 2006", "id": 4588347}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My girlfriend and I stayed at the Park Inn for 3 nights and I was impressed with the hotel. The staff spoke English well and were courteous and helpful. The room had a beautiful view, and I found it had enough space to be comfortable, and was decorated very tastefully. The best part of the hotel is its central location in Alex. The underground station is just a few yards from the hotel entrance and you can easily get about to where ever you need. It is also an easy walk to Unter den Linten. Also something useful to know is a taxi ride from the hotel to Tegel airport is around 20 euros, I paid 17.50 I think. Also good to know is there is a Burger King attatched to the lobby. Yes, as others have stated, their is a lot of construction around the hotel but it's easy to ignore and I felt completely safe walking in the area at all times. WiFi access was available through a Tmobile hotspot, but is a bit pricey at 18 euros for 24 hours. Both my girlfriend and I agreed we would stay at the Park Inn again.", "title": "Excellent!!!", "helpfulness": 3, "user": "mazztravel", "date": "March 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4584916}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "We stayed at the Park Inn from Feb 18th for four days and thought the room, service and location was excellent.", "title": "Good Good.. GOOD!", "helpfulness": 5, "user": "M_Sahli", "date": "February 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4524318}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This hotel is in a great location with lots of public transportation options, including regional trains (the Schönefeld airport was only a 30 minute ride on the Airport Express), U-Bahn, S-Bahn , buses, trams, etc.", "title": "Great view and location, but old mattress and bathroom privacy issue", "user": "tshellthom", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 52493354}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "Our room had fantastic city view, we could see (on a clear day) all the way to the Brandenburger Gate and the Reichstag Dome, this made for a comfortable and warm viewing of the New Years Eve fireworks display.", "title": "Lovely hotel, excellent facilities, helpful staff, great location, good value for money, what more to say?", "user": "CultureVultureLJ", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52155191}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is a short walk to many popular Berlin sights including the TV Tower, St. Marienkirche, the Rote Rathaus, Nikolaiviertel, the Berlin Cathedral, Museum Island, Gendarmenmarkt, etc. If walking is not for you, several city tour buses stop in front of and across the street from the hotel.", "title": "GOOD HOTEL, PLACE AND VALUE FOR MONEY", "user": "dorothykontonikou", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52085289}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The concierges were helpful in acquiring concert/tour tickets and making restaurant reservations. If you like Spanish food, one of the few good restaurants in the Alexanderplatz area is Las Olas (http://www.las-olas.de/).", "title": "Great Value, but Cozy", "user": "Two-Wheel_Traveler", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51629939}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We did have a few issues with the hotel. First, the mattresses sagged so badly in the middle that we had to flip them over and turn the 2 twin beds width-wise instead of length-wise to avoid waking up with severe back and shoulder pain. The bathroom setup, specifically the toilet/water closet was disconcerting because it is not sound proofed and the glass door (albeit frosted) did not close securely. The hotel offers fast, reliable Internet access at a fee, obviously we would rather free access, but we are willing to pay a nominal fee; 18 euro per day or 6.50 euro per hour is hardly nominal. The hotel advertises a fitness center, which is more like a large closet with 2 treadmills and 2 elliptical machines.", "title": "We enjoyed", "user": "olaopa", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51393796}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Lovely rooms with all you need from minibar to safe.", "title": "Great deal for a superb hotel", "helpfulness": 5, "user": "Baekke", "date": "April 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5009569}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The rainfall shower is the best!", "title": "Immaculate!", "helpfulness": 8, "user": "Emskifletcher", "date": "April 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4985653}, {"rating": 5.0, "title": "Fantastic down duvets", "text": "Paid €99 per night booked directly through the hotel...great price for the location and room quality!", "helpfulness": 8, "user": "solender", "date": "April 13, 2006", "id": 4970214}, {"rating": 4.0, "title": "Centralized location with a view", "text": "Will highly recommend it to anyone!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4954912}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "It was impossible to find something to complain about! We couldn't believe that we got to stay somewhere so contempary, clean and cool for the bargain price that Expedia offered us! We were on the 22nd floor (we asked for a higher room after being offered the 8th for a better view and this was no problem). Lots of shops, cafes, pubs etc nearby. The Alexanderplatz station is right next to the hotel and can take you all over the city although you could walk due to its fab location! Please go - it's great!", "title": "modern hotel in convienient location", "helpfulness": 7, "user": "latte_fan", "date": "April 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4942607}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "I made a reservation through the Hotel's own website for a 25m2 room with a panoramic view, bath, etc. Knowing I would be arriving late; I made a note of this on the reservation. Not trusting Hotels; I called in the afternoon to say I was on my way and to check that they were keeping my room.", "title": "For that true Eastern Block Service experience why not stay at the...", "helpfulness": 2, "user": "megalon", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 5.0}, "id": 51269414}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "So I arrive to find that there is no room you think? No. That would be just incompetence.", "title": "I would definitely return to this hotel.", "user": "MargaretLiverpool", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51240269}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I arrived, and was told that I would have to pay for my room in advance, which seemed strange, but it was late and I just wanted to go to bed so... I go up to my room a little disappointed to see that it was only on the fourth floor, but much more disappointed to find that it is barely 10m2 with one small window, no bath.", "title": "A great hotel in a great location", "user": "laycockk5", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50702605}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "So I go back to reception to point out the mistake, only to be told that this is actually their \"Executive Room\". While I appreciated the \"Executive\" status this gave me; really I just wanted the room that I had made the reservation for (and just been made to pay for in advance). No. Apparently my reservation was for the \"Executive Room\". Which coincidently was the exact same price as the much larger room with the bath and the view but no \"Executive\" in the name. So since it was the same price it would be simple to swap me over to the non-executive room, yes? No? Alas there were no rooms fitting my description available, if only I'd made a reservation... I hadn't expected to have to print out the reservation as evidence, but luckily managed to retrieve an email on my mobile that they had sent me as confirmation, which included the following lines:", "title": "Fantastic Location... bad bed!", "user": "DyanaV", "date": "December 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 50519447}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "Room Type: Business Panorama Room", "title": "Nice Hotel with additional 'rip-offs'", "user": "1777NT", "date": "December 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 50505921}, {"rating": 5.0, "title": "Great location", "text": "My husband and i have just spent three nights in this hotel. It is ideally situated to see all the main sights as it is right across the street from the train station and under ground, which I must say we found to be brilliant as they all seem to arrive on time.", "helpfulness": 3, "user": "shell40", "date": "August 10, 2006", "id": 5597473}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The hotel and the rooms are very clean. The staff are friendly and the concierge are excellent for information about the best way to get to sights.", "title": "The best location in East Berlin", "helpfulness": 2, "user": "YoSpanish", "date": "August 10, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5596984, "likes": {"liked": "— Location", "disliked": "— The surroundings are under construction"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "All in all an excellent trip and I would have no hesitation on recommending this hotel.", "title": "Great for groups", "helpfulness": 1, "user": "teatimefreddy", "date": "August 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5580335, "likes": {"liked": "— location and casino"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We spent 4 nights in this 4-star-Hotel. We booked it through hotelclub---. It has the perfect location to visit Berlin. Close to Museums (a 10-minute-walk), and to the major sites. It's located in Alexanderplatz which happens to be under construction. It can be a little confusing to find your way into the main entrance..But it's not a problem at all. The room was nice but, as mentioned in other reviews, bathroom facilities are weird..YOU MUST BE FAMILIAR with the person you are sharing the room with..But again not a problem at all. Breakfast buffet was a little crowded at times. Take the hip on/hip off bus. It's 20€ and it's worthy. Also we took a taxi from Tegel airport and it was just 19€.", "title": "A good all-rounder - would recommend to all.", "helpfulness": 11, "user": "Povemeister", "date": "August 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5558090, "likes": {"liked": "— Casino on the 37th floor with excellent 360 degree views!", "disliked": "— Only a minor point really, but the front desk staff could have a been a little friendlier."}}, {"rating": 4.0, "title": "Great location!", "text": "I booked this hotel through Vaughan Edmonds at totalstay ([--]) for our group of 24 and you got us a brilliant rate.", "helpfulness": 8, "user": "pugsleythedog", "date": "July 31, 2006", "id": 5532751}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Stayed in the Park Inn Alexanderplatz 20-23 april 2006. We had 3 fantastic nights in the best location. We were upgraded to a suite on the 34th floor - so absolutely no complaints there!!", "title": "Very nice hotel and the best location", "helpfulness": 12, "user": "CSCfan", "date": "May 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5028470}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "My wife,my 6 year old son and myself have just returned home to Ireland having spent 4 incredible days in Berlin.Putting it honestly if anyone is considering a city break then Berlin is the place to go and the Park Inn is the hotel to stay in. We had a junior suite on the 34th floor which cost us 149euro per night without breakfast.The view of the tower and Alexanderplatz from our huge room was unbelieveable especially at night. The Christmas markets are in full swing now and many are only a very short walk from the hotel. U bahn station is only 50 metres from the front door of hotel.We bought 2 Berlin welcome cards at Schoenfeld Airport which cost us 49euro and this covered all our travel for the weekend and also discounts into museums and zoo etc.It was well worth the cost. Cant wait to return to this great city.", "title": "Fabulous Park Inn", "helpfulness": 1, "user": "muckers", "date": "December 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22523875, "likes": {"liked": "— Biggest bedroom ive ever stayed in", "disliked": "— 25 euro charge for early check in,which i did not pay"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Paul Mooney,Waterford,Ireland", "title": "Great hotel. Great Location.", "helpfulness": 1, "user": "LiamBuck", "date": "November 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22261858, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We stayed in the Park Inn at the end of November 08. It was a trip organised by Citiescapes which included a walking tour.", "title": "Loved the Park Inn Berlin", "helpfulness": 1, "user": "CorkAnnCork", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22246513, "likes": {"liked": "— Access to and from the airport. Also the food. Transport system outside the back door.", "disliked": "— To sit in the bar and have a drink after a day out was so expensive."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The rooms were comfortable and clean. They had comfortable beds, safe, minibar/fridge, shower, WC, sink, wardrobe with trousers press (no iron), and plenty of towels. We didnt really mind the layout with the toilet and shower.", "title": "Good value, great location", "user": "blok_70", "date": "November 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22212188, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "There was a good selection for the hot & cold buffet breakfast including juice, cereals, cheese, cold meat, breads, soup, eggs, fried potatoes.", "title": "good hotel and location", "helpfulness": 1, "user": "uktravelller", "date": "November 21, 2008", "detail_rating": {"front_desk": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 22065064, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I've stayed here twice when my favorite hotel in Berlin were fully booked and it was ok. Truly an amazing view from my room on the 28th floor, but the hotel is a little bit like a big ferry: no charm what so ever and a little bit worn down.", "title": "Great view but otherwise average", "user": "ErikFromSweden", "date": "November 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 49622953}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "One upside though: the price for the room was really good, so it's absolutely good value for the money spent!", "title": "Great hotel, perfect location, great service", "user": "JaapWess", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49232095}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Never had breakfast there but I've heard it was good.", "title": "Basic hotel with some peculiar features that you wouldn't expect from a four-star", "user": "Tieva", "date": "November 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 48762631}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I stayed in the ParkInn Alexenander Platz during TechEd Europe in November 2009. It is a great hotel, the location is good, next to the S-Bahn. Spacy rooms, nice view over the city. Breakfast was fine as well as the bar in the evening. People work hard to make guests comfortable.", "title": "Ok value for money", "user": "Karkrist", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 48515511}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Next year it's a must go!", "title": "Great location, great hotel.", "user": "Anguslass", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48311476}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Stayed here with a stag party in May.", "title": "Ezcellent views and location", "user": "robbier", "date": "October 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20586953, "likes": {"liked": "— Location", "disliked": "— Having to pay to access the view from the 37th floor!!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Excellent Location. Lovely hotel.", "title": "Great place!", "helpfulness": 2, "user": "prikubo", "date": "September 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20451360, "likes": {"liked": "— Great bed and sheets", "disliked": "— The size."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I strongly recommend Park Inn. The hotel is huge and extremely well located, in the heart of Alexanderplatz and a few minutes away from the TV tower. The metro is only a few meters away and there`s a huge mall right in front of it.", "title": "Good for business", "helpfulness": 2, "user": "mikkifr", "date": "September 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 20004861, "likes": {"liked": "— The great location", "disliked": "— The cleaners with OCD!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Rooms are very clean, but small. There`s a table and two chairs. Also a small cabinet to put clothes. Bathroom is a bit different and some people might feel uncomfortable with it. Let me explain. The shower is \"open\"(check the photos) and the sanitary is tiny small. You can easily see someone sitting in the toillet. There`s a curtain that separates the room from the shower.", "title": "Excellent for business and vacationing travelers", "helpfulness": 2, "user": "kodiaktraveler", "date": "September 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19817077, "likes": {"liked": "— Excellent room and location", "disliked": "— Lobby area"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Don`t book breakfast, it`s was too expensive. Eat in the street instead. There are several options very close (Dunkin Donuts and some other local places).", "title": "Great Location", "helpfulness": 2, "user": "Rich_25", "date": "August 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19416999, "likes": {"liked": "— Location", "disliked": "— Bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "This is a conveniently located hotel in East Berlin. There is a casino on the 37th floor. The rooms are modern, and make very efficient use of the space. The shower is completely enclosed with glass, and so you have a curtain to give you privacy from the rest of the hotel room. The rain shower, and underfloor heating in the bathrooms are great! There is a shopping center connected to the hotel. The breakfast buffet is adequate. Mass transit is located nearby. The one tourist attraction right next to the hotel is the TV Tower. You can go up to the observation deck of the TV Tower to view the city sites. Do not miss going up one floor from the observation deck to the revolving restaurant where the food is good, reasonably priced, and you can sit and enjoy the view as long as you want.", "title": "Modern Hotel Near TV Tower", "helpfulness": 4, "user": "susanCalifornia", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7303204, "likes": {"liked": "— Efficient Modern Use of Space", "disliked": "— 37 floors"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Excellent hotel. Took my wife here for an Anniversary break. Managed to book a junior suite - only 130 euros (less than 100 pounds) per night. Room was on 35th floor with great view of the tower.", "title": "Great short break", "helpfulness": 4, "user": "Alex_UK_traveller", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7286336, "likes": {"liked": "— The View", "disliked": "— Limited Room service"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Room was very large with bed (Seemed to be twin beds pushed together athough bopoked as king suite!), minibar, chairs and a great flat screen TV.", "title": "A great stay at the Park Inn", "helpfulness": 4, "user": "Tatie", "date": "April 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7279774, "likes": {"liked": "— Cleanliness, convenience, great comfortable beds and bedding", "disliked": "— Liked it all"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "2 minutes walk from the AlexanderPlatz Sbahn and Ubahn stations.", "title": "Great Hotel!", "helpfulness": 6, "user": "Sam69", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7276645, "likes": {"liked": "— Its location", "disliked": "— The open plan bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Great reception very friendly.", "title": "Great Location", "helpfulness": 2, "user": "Colin F", "date": "April 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7268081, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Have just returned from a 5 day stay in Berlin which we spent at the Park Inn.The hotel is a huge 37 storey high building(casino on 37th floor).My wife and i found it to be just perfect for exploring the city and easily walked from Alexanderplatz to the Brandenburg Gate/Reichstag/Freidrichstrasse and Unten Den Linden.If walking isnt your thing public transport is both cheap and convenient in the city whether it be bus U-Bahn or S-Bahn.The Hotel itself we found to be very good with friendly staff and an excellent concierge.The rooms (we where on 35th floor) are very nice with excellent views out over the city.", "title": "Best/Most Covenient Place To Stay in Berlin", "helpfulness": 13, "user": "britne", "date": "September 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3935796}, {"rating": 5.0, "title": "When in Berlin chose the Park Inn, it's so easy", "text": "The way the rooms are laid out is unusual as the shower and toilet whilst ensuite are housed in a wet area near the door to the room and screened off with tasteful glass partitions.Very good use of space in fact.You have all the usual things in your room including a mini bar(prices the same as hotel bar prices).On the third floor of the hotel is an excellent sauna and fitness centre(costs 5 euros).The hotel restaurant is on 2nd floor and you can choose to eat either a la carte or better yet in our experience go for the buffet which is excellent value at 17 euros per person for a 3 course meal (all you can eat).At the moment the hotel has a lot of building work going on outside it(new shopping complex being built between it and the railway station).the hotel itself is also having an exterior facelift to an all smoked glass exterior.Whilst this may sound a lot to put up with it wasnt.We werent disturbed by any noise during our stay at all.All in all we would heartily recommend this hotel to anyone travelling to Berlin.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 30, 2005", "id": 3815859}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Having flown into Schonefeld as a Berlin virgin with easyJet I was concerned as to whether the Park Inn was the right location. My fears evaporated when I stepped off the s-bahn after the 30 minute journey from the airport. The hotel is the perfect location for travellers new to the city or there for a long weekend. The staff are friendly and rooms clean and functional. A hearty breakfast sets you up for a day of trips. Our room on the 26th floor looked west across the city with views of the \"tooth pick\", Mitte, Reichstag and Sony Center. The hotel is within easy reach of Museum island and Mitte and we meandered to the Brandenburg Gate within 45 minutes. The bars and cafe/restaurants at Hackescher Markt are no distance and well recommended. All in all we had nothing bad to say about this hotel or its location. Excellent.", "title": "Great place to stay", "helpfulness": 2, "user": "pollygw", "date": "August 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 3798100}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Stayed at the Park Inn for 5 days in August 2005. Great hotel, excellent breakfast with anything you could want. Good buffet evening meal too, everything you can eat at 17 euros- but would also recommend the Alex restaurant just adjacent to rear entrance of hotel - good food and friendly staff, we got 25% discount on our third dinner there.", "title": "Great hotel", "helpfulness": 1, "user": "jojo2005", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3729839}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Reception staff were fine, bar staff very friendly, and also shop staff - they made a special effort to get the English version of the Berlin 1939-45 tour book I asked for by the next day.", "title": "modern hotel, in the heart of east berlin", "helpfulness": 2, "user": "WeWantAnotherHoliday", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3729377}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Just returned from a weekend spent at this hotel adn have to say that I was very impressed. Easy to get to via the Airport Express train and the hotel is position right by the exit at Alexanderplatz so easy to find. Rooms are bright and light and beds are extremely comfortable. Glass shower and toilet cubicles take a bit of getting used to though. Hotel doesn't have many leisure facilities but sauna complex is nice and new (as is the feeling throughout the entire hotel). Staff were friendly and helpful (their displayed motto \"please wait for the next smile\" is very apt). Location of the hotel makes it idea for sightseeing and connections across berlin using the underground are frequent, punctual, and cheap (max 2 Euro 10cents ticket each way or day tickets are great VFM. All in all an enjoyable stay and don't think it can be beaten for the price!", "title": "Great Hotel / Great Price", "helpfulness": 1, "user": "AlecCampbell", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4477107}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The hotel has a very strategic location, Alexander Platz is a central hub of the Berlin public transport network. From Tegel Airport, bus TXL (every 10 minutes) takes you straight to the hotel. The hotel is easy to spot being one of the tallest buildings around. Ok, Alexander Platz is undergoing a major reconstruction but that is to be expected as Berlin is one big building site at the moment.", "title": "Good hotel, excellent operating base for exploring Berlin", "helpfulness": 7, "user": "casper53", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4359662}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "The view from our room (26th floor) was spectacular. We could see most of the historic landmarks. The room was clean and modern. Just make sure you go with someone you know well as the bathrooms are not particularly private with all that glass!! The staff in the hotel were friendly and helpful.", "title": "weekend away", "helpfulness": 3, "user": "SallyCumbria", "date": "December 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4308361}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "Excellent breakfast buffet. Evening meals are good, and not overly priced.", "title": "A disappointing experience", "helpfulness": 9, "user": "gojoyce", "date": "November 24, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4142319}, {"rating": 3.0, "title": "Reasonable hotel, watch for floods", "text": "The hotel's sauna (costs 5 Euro) is well designed with friendly staff.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 7, 2005", "id": 3999495}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Hotel was very clean and rooms were very comfortable. Only downside was the absence of door to shower!", "title": "Good Hotel and Location", "user": "Johnboy99", "date": "June 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7757453, "likes": {"liked": "— Clean, comfortable, good location", "disliked": "— Shower. Breakfast prices"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We never ate there as prices were expensive especially for breakfast, however, right outside is the Galeria department store where you can get excellent breakfast for only 5 euros. It is around a 20 25 min walk to Brandenburg gate, Reichstag etc although the underground and overground stations are next to hotel. Alexanderplatz itself is nothing great, however there is an area around 5 mins walk away with lots of nice bars and eating areas. ( Hackescher Market). Reception were polite and efficient. Rooms had excellent view of city and tv tower in particular. Well recommended.", "title": "Good Choice", "helpfulness": 3, "user": "sssss1", "date": "May 31, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7724154, "likes": {"liked": "— Location, shower !"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "We spent 3 nights in the Park Inn and were really happy with our choice. The room itself was small but contained all we needed. It was spotlessly clean. The bathrooms are quite funky and the rain shower is fab ! The beds were very comfortable. The rooms are pretty quiet, we were beside the lifts and heard very little noise.", "title": "Nice interior & great views, but location is uninspiring.", "helpfulness": 6, "user": "ExplorerIreland", "date": "May 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 7487934, "likes": {"liked": "— Decor is nice, and views are spectacular on the higher floors.", "disliked": "— Lack of an affordable (or free) internet access in rooms. Location of hotel is drab and soulless."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The hotel is in a great location for sightseeing. The train station is 2 mins away, Brandenburg gates are about 15 mins walk, passing some great sites (Dom, Babelplatz etc).", "title": "Nice", "helpfulness": 2, "user": "MarkRoddis", "date": "April 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7479461, "likes": {"liked": "— Great location", "disliked": "— Breakfast. The food was fine but you had to get a table first"}}, {"rating": 5.0, "title": "this park.brilliant", "text": "The square itself is fine, based on some reviews I had been quite concerned but these concerns were unfounded. There are a number of shops in the square and lots of little bakeries in the train station which was great for breakfast.", "helpfulness": 2, "user": "morgangeth", "date": "April 15, 2007", "id": 7364192}, {"rating": 4.0, "title": "Awesome views!", "text": "Wow! I almost wonder why folks leave the hotel room at all?", "helpfulness": 1, "user": "Valtpal", "date": "June 14, 2007", "id": 7848763}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "My husband and I travelled to Berlin for an extended May Bank Holiday away - it was our first experience of Germany let alone of Berlin. We made our reservations via local travel agent, but were also able to go to the hotel website to request an up-grade - which we did incidently,because of the reviews on this web-site - which \"raved about the views and modernised rooms\". It was well worth the extra E20 per night - honestly!", "title": "Smart, modern hotel, high tech rooms", "helpfulness": 3, "user": "vanmunchen", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7805249, "likes": {"liked": "— Modern styling", "disliked": "— Small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel location was great - that is once we discovered it was behind a large shopping centre! We had read about the massive height of the Park Inn Hotel and about how you could see it from miles away.... but were bemused to say the least, when we came out of the train station at Alexanderplatz and had no sight of any tall buildings which resembled the hotel at all!", "title": "Great value for money", "user": "Turisti", "date": "June 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7790521, "likes": {"liked": "— Everything very clean, abundant breakfast, location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Thankfully just a 2 min walk around the corner and it was there - I must be honest though and tell you that the building was infact so tall that we din't actually see it for a few seconds!", "title": "Fantastic Location", "user": "PirongiaJo", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7771203, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "It was obvious that this hotel was classy from the moment we walked through the door. We entered from the \"Platz\" side vis shoppping area and proceeded through to the hotel lobby. Following the directions we passed a smallish shop and made our way to the checkin - professional and eay - with an abundance of porters. We went tdirectly to our room (2 floors from the top) and hurried in to compare it to the photo's which we had viewed on the website - Bingo! We had views from 3 sides of the room, and we were pleased to see that we had the \"glass panelled state of the art bathroom ensuite - view the pictures and you will see what warrants the \"Awesome\" comment.", "title": "Wonderful!", "user": "TravelbugUtah", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7769250}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The peope staying here were a wierd mix of oaps, tour groups and tourists its not a trendy boutique hotel at all.", "title": "Excellent", "helpfulness": 9, "user": "Simon0965", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5331878}, {"rating": 3.0, "title": "Not so impressive", "text": "We stayed at the Park Inn at the end of May 2006 and were less impressed than other reviewers. The area, though convenient to Alexanderplatz railway station, resembled a building site - indeed on one morning we were woken early by the sounds of construction. We had booked (via Expedia) a room on floors 26 - 35, and paid extra for this (£233 for 3 nights) but our reservation did not confirm this in writing and we were assigned to a room on the 14th floor (we were refused an upgrade on the grounds that the hotel was full, which seemed unlikely), so the views were average. We were disappointed that there were no tea or coffee making facilities in the room. The room rate did not include breakfast and we did not try the hotel breakfast, but ate locally instead. The room itself was small but stylish (lots of mirrors, glass, chrome, marble) and comfortable - wonderful beds and cotton bedlinen! Other reviewers mentioned steam-jet showers, but these weren't in our room. Perhaps we expected too much after all the rave reviews...", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 4, 2006", "id": 5297974}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We chose to stay at this hotel because of the good reviews. They were not wrong, and we were not disappointed.", "title": "Excellent choice", "helpfulness": 10, "user": "Kay14", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5287570}, {"rating": 5.0, "title": "Great Hotel!", "text": "The location was perfect, with access to the S and U-Bahn right opposite the hotel. Gettting around the city was cheap and easy.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 10, 2006", "id": 5047419}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Our room was on the 30th floor with spectacular views. The room was extremely quiet and yes the bathrooms are a little quirky (frosted glass cubicles in the room) but not a problem for us. Although not so sure that they would be to everyone's taste.", "title": "Excellent location, avoid the hotel breakfast", "helpfulness": 11, "user": "mandy28", "date": "May 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5035738}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Stayed at the Park Inn Alexanderplatz in Feb 2007. Arrived at the hotel late at night (Around 30 Euros from Schoenefeld airport by taxi) and were checked in really promtly. First impressions were that it was a nice hotel, lobby with bar/restaurant looked very modern and newly refurbished.", "title": "Superb value, excellent room", "helpfulness": 4, "user": "Stappers", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7973816, "likes": {"liked": "— Clean and new feel to hotel", "disliked": "— Lots of building work in Alexanderplatz at the time"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We asked to upgrade but were advsied not to as the room we had was also newly refurbished and so on a par with an upgrade so we decided not to. When we got up to the room we weren't disappointed. The room was quite a decent size and the fittings were very new. The bathroom also was a plus with a large walk-in rain shower. The only disappoinment was that we were on a lower floor so didn't have a great view.", "title": "Much Higher Quality Than Anticipated", "user": "Andioo", "date": "June 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7853226, "likes": {"liked": "— Room", "disliked": "— Public spaces"}}, {"rating": 4.0, "title": "Can confirm other reviews", "text": "The TV tower which is a few minutes walk away through Alexanderplatz station and was well worth visiting for a drink and even breakfast/lunch/dinner as it was quite reasonable.", "user": "Elparaiso", "date": "June 15, 2007", "id": 7852189}, {"rating": 5.0, "title": "excellent hotel, excellent location", "text": "Alexanderplatz station, aswell as having tube lines running to the former West Berlin, also has overland trains. These go to airport which we used on the way back for a few Euros each. They also run to the Hauptbahnhof, which is within walking distance of the Brandenburg gate and the Reichstag, aswell as West Berlin with a station opposite Berlin zoo making it the easiest way to get around. We bought a card to get around, which I can't remember what it was called, but cost about €20 each for a few days and included all travel on the metro/overland trains/buses and trams. It also included discounts on attractions.", "user": "jelmer", "date": "June 15, 2007", "id": 7851166}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "There are quite a few restaurants around the Park Inn and all are very resonable and really nice. Most seem to specialise in steak or italian food. Te hotel bar was a little pricey but had a good atmosphere and always seemed busy so was a good location for a drink.", "title": "Brilliant!", "helpfulness": 4, "user": "laura1006", "date": "June 15, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 7850990, "likes": {"liked": "— Cleanliness, Views", "disliked": "— Nothing"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 158, "average": 580, "very good": 1425, "terrible": 58, "excellent": 743}, "aka": "Park Inn By Radisson Berlin Alexanderplatz Hotel", "slim_ranking": 0.298350824588, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}