{"user_rating": 3.5, "review_count": 5020, "name": "Park Central", "reviews": [{"rating": 5.0, "title": "I♥NY", "text": "What I loved best was its proximity to Central Park. The service and the amenities were excellent. I would highly recommend this to anyone who needs a place to stay in Manhattan.", "user": "DianePou", "date": "December 8, 2009", "id": 50853349}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "From start to finish, I had a completely awful experience at the Park Central New York. The first thing we were greeted with was a room that smelled pungently of urine. When we returned to the room, after being cleaned by staff, it still had a hideous odor of urine covered by bleach. We spent the rest of our two day stay wearing coats indoors as we could not be in the room without feeling faint without the windows being open. Next, as I painfully discovered in the shower, the washcloths were covered in hair. Finally, when we requested a blanket (as the windows were open and we were freezing), it took close to an hour and a half to finally receive a blanket.", "title": "Worst Hotel Experience of My Life", "user": "selective_focus", "date": "December 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 50765268}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "What I found to be most offense of all was the fact that when these complaints were brought to the attention of the hotel staff, in the form of a phone call and an e-mail to the manager, I was completely ignored and, to date, my issues have gone completely unaddressed by staff or management. What kind of business operating in the hospitality industry finds it acceptable to treat guests in this fashion?", "title": "Disastrous hotel !", "user": "krishnaindu", "date": "December 5, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 50713607}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The rates are cheap--but beware. In the end, you may be better off spending another couple of dollars and staying at a hotel that treats its guests with a little more respect.", "title": "Amazing location!!!", "user": "focculare", "date": "December 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 50628919}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "PArk central has a wonderful name but lot to be desired. THe rates are excessive for what it is worth. The reception staff are very rude and unhelpful. The maids knock on your door early in the morning asking whether you are checking out today. The rooms are small and if you are in even numbered rooms you will get a horrific view of the concrete yard below. The services are very poor and they seem to be thriving on their name and location alone. If you are looking for hotels in the Times Square area, please look at other hotels such as Sheraton, Marriott and even smaller hotels before you check into this dungeon!!!!!", "title": "Very Rude Staff, Misleading Photos, Good Location", "helpfulness": 1, "user": "WillieCapeTown", "date": "November 30, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 50347084}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Cannot beleive the bad reviews. Stayed one night May 12. Had a very large, clean room on the 14th floor. Could not ask for more. Would come back again. GREAT LOCATION", "title": "GREAT for the price", "helpfulness": 8, "user": "DavyGGG", "date": "May 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5065869}, {"rating": 4.0, "title": "Would Recommend", "text": "After thoroughly reviewing hotels for a five-day trip to NY (I'm from Chicago), I finally settled on the Park Central. I didn't want a shared bath or a room with no A/C, as I had read in many other reviews. I also could not afford a luxury hotel. I was not the least disappointed with my choice. I wanted to take the bed with me! I slept like a log in the extremely quiet 7th floor room, overlooking bustling 7th Ave. And the location could not be beat. Theatres all around, Times Square a short walk away, as well as clothing stores, restaurants, and souvenir shops galore. The first day, the tub was clogged in the morning, but fixed when I returned at lunch time. That was the only problem that I encountered. This is the only place that I want to stay on my return visits to NYC.", "helpfulness": 6, "user": "BroDarius", "date": "May 13, 2006", "id": 5064817}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Having read some of the terrible reviews of this hotel we were a little worried about what we would find, especially when it isn't cheap to stay there. We arrived late but were immediately upgraded without asking to a suite as a non smoking room was unavailable. The room we were given the next day on the 19th floor was modern, clean and had great views. (This was a superior room with a king bed as booked) We asked for a coffee machine and it was provided, same goes for an extra blanket. The staff all over the hotel were pleasant, helpful and courteous (makes me wonder when I read other reviews now). The hotel is in a great area for Central Park, Times Square and 5th Ave. Plenty of shops and deli's nearby. As it is near Times Square it is in the hub of the tourist district and the crowds on 7th can be a bit intense at times so not for those looking for a quiet area although there was no problem sleeping. All in all we enjoyed staying there.", "title": "Pleasantly Surprised", "helpfulness": 9, "user": "Wilbur1994", "date": "May 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5048163}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The great thing about the hotel is the location and having read some of the previous reviews I knew what to expect. The rooms do need redecorating and the bathroom is dated but on the plus side the beds are very comfortable and basically you get what you pay for! I didnt eat at the hotel so can't comment on the food but to be honest we spent most of our time sightseeing and eating out. Overall - not too bad and I have stayed in much worse places!", "title": "Actually not too bad - get what you pay for!", "helpfulness": 5, "user": "Cread1974", "date": "May 9, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5044031}, {"rating": 3.0, "title": "Decent... in the end!", "text": "Stayed at the Park Central for 4 nights in May 2006.", "helpfulness": 3, "user": "kansel", "date": "May 8, 2006", "id": 5042653}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Talk about being \"nickled & dimed to death\"! We arrived early about 1 pm...room was not ready...ok that I can understand...but they actually charge $4.00 for each bag you want them to store!!! We finally were able to check in at 4pm to our room....really blah! Needs a complete overhaul. Paper thin walls...you can hear everything from the adjoining rooms and hallway. Oh and be very careful not to bump into the base of the beds covered deceitfully with a bed ruffle...there is a metal platform for the base that my husband proceeded to bump into & broke his toe. And for them to charge $14.99 per day for WIFI in this day and age is sooooo wrong!!! The only positive thing going for his hotel is the location...but there are so many other better options...don't stay here!!!", "title": "Mediocre at best", "helpfulness": 1, "user": "tulip52", "date": "December 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 52054203}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel was suggested by some friends and it has been a really pleasure staying at this location during my recent trip to New York.", "title": "What a surprise!!!", "user": "Gianni_482", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52043515}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Quick check-in, nice room, clean and with a beautiful view.", "title": "Above and Beyond", "user": "Pa_TravlerPittsburgh", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52013904}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The experience at the restaurant was great at very affordable price and a very good preparation.", "title": "Never Dissapointed", "user": "G113", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51941700}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I really suggest this hotel also keeping in consideration the greaT LOCATION.", "title": "Great Choice", "helpfulness": 1, "user": "carloverLasVegas", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51709593}, {"rating": 3.0, "title": "Not to shabby depending on your needs...", "text": "I just returned from a trip to NYC and stayed there with my girlfriend. While we chose this hotel for the location and the price, we got what we paid for. The hotel's public areas were always clean and the staff was very pleasant whenever I had a question or a request, although there was a touch of mold on the shower curtain (room 1030)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5015186}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "That being said, this hotyel is VERY popular with tour groups and school groups. There were literally HUNDREDS of kids between the ages of 14 and 17 hanging out in the lobby at all times. Could it be that because of the hotel's close proximity (across the street) to Carnegie Hall? Perhaps...but after a long day of walking around Manhattan or coming back from a great dinner, the last thing you want to hear is hundrerds of teenage girls shrieking about or the guys just lounging about taking up space.", "title": "A real dump, with the rudest staff ever", "user": "sae724", "date": "April 27, 2006", "detail_rating": {"value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5013605}, {"rating": 1.0, "title": "Terrible staff attitude and no hot water", "text": "Anyway, if you don't mind distractions I described above this hotel is in a perfect location and provides rooms at a rate that is not as astronomical as other hotels in the city.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4998355}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "This must rate as one of the worst hotel experiences of my life. Horrible rude staff at every level: from receptionist to backroom officers. No interest in their customers. Extremely expensive for very underwhelming facilities.", "title": "Loved New York, But Park Central Hotel ?", "helpfulness": 12, "user": "Allen From Virginia", "date": "April 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4976872}, {"rating": 5.0, "title": "Much more than I expected.", "text": "We booked a package on-line for a king room with continental breakfast for 4 nights. That package costs US$140 more than just a king room. Upon checking in, we were told we cannot have any breakfast because the on-line booking agency did not tell the hotel breakfast is included. We showed them our bookingg sheets and payments but still the hotel refused to provide breakfast. Their words were \"it is something you have to sort out with your on-line booking agency, it is none of our business\". After much negotiations with the manager on duty and another staff on the reservations desk and showing them all the paperwork, they reluctantly said they would issue a breakfast voucher. There was not even a hint of apology for the hassle for the guests.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 11, 2006", "id": 4957620}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Housekeeping is surprising good but the rooms are in terrible need of renovation. Old shabby looking furniture with depressing dark curtains. The lobby has the feel of a train station. The bedding is new and crisp but the beds are on the soft side. New York is very expensive so it's almost impossible to fnd a good location hotel for less than $350. (what we paid at Park Central on a reduced rate). The location is outstanding... walking distance excellet restaurants, ($$-$$$$), a nice walk to Time Square, Broadway theaters and Central Park. There are numerous great hotels near by but all $$$$! Stayed their 7 nights and really got to see a lot the city on foot. I don't suggest staying there more than 3 days tops and that's only because of the location. I've been to NY many tiimes (before always stayed with family on the upper east side or on business in a higher rated hotel. This was on my nickel). A must do is Time Square just when it's turning dark with all th signs lit. A true treat and let's you know you're really in \"The Big Apple.\"", "title": "Clean rooms, shabby appearance, great location", "user": "Karen W", "date": "November 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 145166097}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "Elizabeth from the front desk was extremely helpful and friendly!! Thanks for the great job! The hotel is well located and the price is worth. The room has a good size and is clean. The bathroom has a very good size and the shower is great. The room has got a great view of times square, fantastic!!!!!", "title": "Excelent!!", "user": "Joaquimpaes", "date": "November 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145159876}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Since the entrance, passing trough the lobby, the attitude of all the employees of Park Central, everything makes us think one simple but complete word: kindness!", "title": "Kindness", "user": "andremarques1", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145144215}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The reception that was given us by Elizabeth (5), at the frontdesk, was nothing but the most attencious treatment that someoen could offer to a family in a vacation trip, after 2 nights not sleeping well, in this long journey fromo Brazil, including all the preparatives moments for this travel.", "title": "Galia", "user": "GaPa_12", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145140446}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Thank you very much for this kindness, an keep this mood!", "title": "Excellent location, but very overpriced.", "user": "Victoria B", "date": "November 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 145131696}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Regrettably, I was compelled to stay at the Park Central during Hurricane Sandy. I understand it was a stressful and difficult time for all of the region, and although conditions were improved in Midtown Manhattan compared to New York's more unfortunate areas of town, other burroughs and neighboring New Jersey, our stay at the Park Central only added to the overall distress for many reasons:", "title": "An unfortunate situation, but a WORSE hotel.", "user": "AliasLA", "date": "November 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 145110161}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "1) After confirming with the front desk that the hotel was fully operational, upon arrival two hours later, we were told that there would be no hot water or heat during our stay. Again, I understand the timing of this could have been a pure coincidence, and that these utilities may have been compromised between my phone call and my arrival. However, the Reception agents were rude, cold and did nothing to acknowledge the inconvenience -- literally shrugging off our questions regarding the water/heat -- or allay concerns about the overall functionality of the hotel. They were also not willing to make any concession for the outrageous room rate, even though the hotel was without basic amenities, nor did they offer any other kind of concession of hospitality (food/bar credit, for example).", "title": "Overpriced and worn", "user": "Boarder49", "date": "November 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145076379}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "2) We were offered no assistance with our bags -- our party of three had six in all. There seemed to be no one staffing the bell desk or any valets at any time inside the hotel. All guests were forced to lug their bags up to their rooms on their own.", "title": "Great Stay", "helpfulness": 1, "user": "Julie R", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145051535}, {"rating": 3.0, "title": "Past it's best", "text": "3) The internal condition of the hotel, beyond the lobby, is quite grim. The halls are dingy and banged up. Seemingly abandoned vacuum cleaners and housekeeping carts are left strewn through the halls at all times of day, blocking the corridors.", "helpfulness": 1, "user": "Englishman-x", "date": "November 9, 2012", "id": 145042835}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "4) The rooms are dirty. In addition to obvious pubic hairs on top of the bed, there were dirty tissues crumpled behind the night stand. After seeing all of this, one couldn't trust anything in the room to be clean.", "title": "Poor service; too many fees", "helpfulness": 2, "user": "kekeman", "date": "November 9, 2012", "detail_rating": {"value": 2.0, "location": 3.0, "service": 1.0}, "id": 145033395}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My boyfriend and I stayed for an overnight getaway. We were pleasantly surprised at the size of the room. It was very clean, comfortable and roomy. The lobby was modern and the bar/lounge was perfect to relax after walking the city and seeing a show. We would definately stay here again.", "title": "Great room and price for NYC", "user": "Denise S", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144662484}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I recently stayed in this Hotel a trip for my daughters 21st with my sister and her daughter. This hotel is location, location, location however, it is a hotel which needs some renovations. We had a couple of issues with the Hotel firstly they take €100 off your credit card even though you have paid in full??? Breakages I was told but had we of broken anything it would have been because it was about to break. Safe instructions incorrect had to get someone to help, light switch broken, cable coming out (leaving a hole in wall). We had to bring these to attention of the hotel as we didn't want to be charged for them. Towels/bathmaths weren't replaced (4 girls in a room) toiletries very scarse still using small soaps thrown out and being replaced the next day. Because of weight restrictions on planes I dont bring these type of items. Then the toilet got blocked last straw. I rang down and was told it would be a while but the Manageress Ruth was very apologetic and would have changed us had our daughters not been out at the time she also compensated us with breakfast for the rest of our stay. When I went to reception to get the vouchers the girl on reception (cann't remember her name) wasn't as nice same girl who checked us in (€100 issue).", "title": "Shopping trip for daughters 21st", "user": "Parkcliff", "date": "November 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144574012}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Service in the restaurant was very good.", "title": "great", "user": "GoodManNYC", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144571019}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Basic hotel in need of upgrading great location.", "title": "Good Location and Good Attitude", "helpfulness": 1, "user": "mortonshw", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144442659}, {"rating": 3.0, "title": "Just okay ....nothing fancy", "text": "During the super-storm Sandy they were very accommodating.", "user": "carson0911", "date": "November 3, 2012", "id": 144414516}, {"rating": 5.0, "title": "A Great Alternative", "text": "With an early-morning meeting the next day at a hotel a block or so away, I was in need of a more budget-friendly, but still nice, hotel in the vicinity. After reading very mixed reviews here, I was very interested to experience the Park Central for myself. I am glad that I did. The room was exactly as reserved online with a king bed. The LCD TV was a very nice touch. For New York City, the size of the room was above average. The location is excellent and I found no issue with noise level where I was staying. The front-desk staff tends to recite a standard speech upon checking in, so while I would not give them the award for most outgoing and friendly, I didn't find them rude either. Truthfully, checking in at the end of the day, all I really wanted is to get my key. I guess I could pay another $100-$150 and get perkiness from the staff of a neighboring hotel, but I was very satisfied with the accommondations and location of Park Central.", "helpfulness": 4, "user": "dopplersmash", "date": "May 7, 2006", "id": 5040579}, {"rating": 1.0, "title": "Never Again", "text": "The Park Central Hotel is in a great location. You can walk practically everywhere. That is really, unfortunately, the only kind thing I have to say about this hotel. Although our 9th floor room was spacious (as far as New York hotels go) it was rather, well, kind of gross. I really believe that the overwhelming stench of bleach that greeted us when we first entered our room was supposed to make it appear as if our room had been cleaned. After we spent a little time in the room, it was quite clear our room had NOT been cleaned.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 2, 2006", "id": 5029525}, {"rating": 4.0, "title": "Excellent location", "text": "The bathroom was the worst. The base of the toilet was covered in hair and urine stains. There was dust, hair and dirt around the baseboards and in the corners. There was hair in the shower. Once used, they never replaced the glasses with clean ones. There were pink, sticky looking stains on the wall above our bed. One day, they didn't even make up our room despite the fact that we had the \"please clean our room\" sign on the door. For all we know, we were sleeping in a bed with dirty sheets. I can't even let myself think about it. I believe some of the upper floors have been remodelled, so I'm thinking whatever positive reviews you read about this hotel are from people who stayed on these floors. The plasma TV was nice. Again, I think it's there to distract you from the grime. And the elevators were wacky the entire time we were there. Sometimes we had to go up in order to go down. Also, the pictures they show of the lobby, well, the lobby doesn't look like that anymore. We didn't eat in their restaurant. Way too expensive and let me tell you, we hardly ever saw anyone in there. If you want a great breakfast, you've got the Brooklyn Diner over on 57th, just west of 7th, and the Europa Cafe on the corner of 57th and 7th. There are just so many other food options. And hotel options. Shop around. You've got both Sheratons, the Dream Hotel, the Essex House, the W. and a lot of other reputable hotels in the midtown area. Spend a little more, stay somewhere else. Unless of course, you don't mind having someone elses hair in your shower.", "helpfulness": 5, "user": "lynseyH", "date": "May 2, 2006", "id": 5028053}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The best feature of this hotel is it's wonderful location, just 2 short blocks from Central Park, only a 5 minute walk down the street to Times Square and a subway station right outside. This was the second time we've stayed there and have been impressed both times. Staff were friendly and the rooms were a really good size and clean. Only problems we've had both times was the heating - it doesn't seem to be controlled in the room and it's quite cold in winter. No tea/coffee facilities but there's a starbucks right next door so we didn't mind. Would definately recommend staying here", "title": "Loved It!!", "helpfulness": 6, "user": "sandiegotravelers7", "date": "April 30, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5020869}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "Two of us stayed at the Park Central in mid April. We had some concerns before we arrived based on some of the reviews. Fortunately, we did not find any of the issues that others complained about. The lobby area was very spacious and clean. The desk staff was polite and helpful. The room was spacious and clean. The closet was a nice size and loved the flat screen TV.", "title": "In a word, Yukkk!!!", "helpfulness": 3, "user": "cassboett", "date": "April 29, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 5019067}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Room was in need of renovation. No coffee maker in the room and all nearby coffee places didn't open early.", "title": "High priced Hotel with no amenities", "user": "DarylandSherry", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144805546}, {"rating": 4.0, "title": "Great room at the right price", "text": "They said they had hot water but then they didn't. Just didn't feel it was worth the price. Was in a good location.", "helpfulness": 1, "user": "mam2233169", "date": "November 6, 2012", "id": 144735987}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Last minute booking at a very competitive price. The hotel rooms are small but were clean and well appointed. I was happy to be able to watch Monday Night Football on a flat screen TV.", "title": "Very happy", "user": "Drmukt1", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144697371}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Also, the staff was very professional and curteous. I saw the bellman refuse a tip from an elderly lady bacause it was her birthday.", "title": "Not Impressed", "user": "pontalba", "date": "November 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144695930}, {"rating": 1.0, "stay_parameters": "Stayed November 2012", "text": "I would definitely stay there again if I need to crash in the city.", "title": "The most overpriced over rated dirty rude staffed hotel I've EVER stayed in", "helpfulness": 2, "user": "cheekimaddi1", "date": "November 5, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 144668385}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Dear Representative:", "title": "Location, location, location", "user": "AndiAdelaide", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144973328}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I am writing to express my disappointment with Park Central Hotel and its policies.", "title": "peter brighton", "user": "799peter", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144954610}, {"rating": 3.0, "title": "Not sure i would return", "text": "We were scheduled to stay two nights at your property on October 28 and 29, 2012. We arrived at your hotel front desk at noon on 10/28; the day Hurricane Sandy was due to arrive. We signed in and had requested early check-in, but no rooms were available.", "helpfulness": 3, "user": "Sarsm", "date": "November 7, 2012", "id": 144887521}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Shortly after that, our Sunday night show was cancelled due to the incoming hurricane. We went to our Sunday matinee and learned afterwards that the Monday performance we were scheduled to see at Carnegie Hall was also canceled. We made the very wise decision to evacuate the city while we could still drive back to Massachusetts ahead of the storm.", "title": "A light in the hurricane darkness...", "helpfulness": 1, "user": "CWOA_13", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144848577}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We enjoyed staying here. It was only a 4-5 block walk to Times Square, but it was away from all the hustle and bustle. A Starbucks and a subway station were right at the same corner. The rooms were clean.", "title": "Great location, very clean", "helpfulness": 1, "user": "cgreno", "date": "November 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145235283}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Very clean, spacious rooms. Great view of Times Square if you have a room looking out that way. Good attention, and Elizabeth (Manager) at the front desk was of great help with specific requests, as are most of the people. We were there just after Sandy so it wasnt an easy time!", "title": "Good Location & Good Rooms", "user": "MIGUEL N", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145230676}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed here because reviews were decent and good location. Hotel was very shabby! Not sure who would give this place that kind of a rating, they must not get out much. Had to switch rooms because the first room had black mold all over the bathroom ceiling. They moved us to another room. There were blood stains on the curtains, the air conditioner and hair dryer did not work and there was a musty smell in the room. I am NOT a fussy person...but come on people..this is ridiculous!", "title": "No 4 Star Hotel Here!", "user": "Meesh47", "date": "November 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 145228922}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The hotel has a great location, walking distance to Times Square, by Subway, N, Q, R lines, building has a Starbucks, one building to famous deli Carnegie. They have top of the line digitized elevator system, you almost never wait for the elevator. The hotel has an impressive lobby with very comfortable seating. Their concierge services are great. Unfortunately the positives stop here. The front desk services were very poor, the staff was almost rude, always less staff than needed so you wait in long lines. The staff seemed tired and overworked. The rooms are very old, torn and stained wallpapers, stained carpets, doors in need of paint, old bed frames, aged bathrooms, poor plumbing, though large rooms, updated TV and comfortable beds. It has potentials after a good renovation.", "title": "Great Location Lousy Rooms", "user": "Sibelcay", "date": "November 11, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 145188464}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The Park Central is a very busy hotel with a lobby that has almost as many visitors as Penn Station during rush hours. Reading the review here i had expected much worse, but was pleasantly surprised. Room was clean and despite being situated towards the busy street, very quiet, it was pretty okay and spacious enough (although i would probably not take my family here for holidays), no coffee or tea facilities, no minibar, no free wifi. The lift operated fine (it is a somewhat bewildering electronic system that is used to match the lift and your floor), staff friendly. It's location is extremely convenient, of course, but as a whole this hotel is less affluent than comparable places nearby.", "title": "Could have been much worse", "user": "Tilbo", "date": "November 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145168117}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I stayed here for 6 nights recently on my honeymoon and this hotel is perfect!!!! We were upgraded to an amazing suite on the 21st floor. We could see Times Square from our bedroom window!!The hotel is in the most perfect location to access all New York has to offer.. The staff were always extremely helpful and the concierge helped us with any questions we had on day trips etc.. We had a small problem with the heating and within two minutes the maintenance guy was up and had it all fixed... The lobby is really welcoming and the food was gorgeous... This hotel is perfect and brilliant value for anyone travelling to New York and the staff really make you feel so welcome..", "title": "Fantastic Hotel!! Even better staff and management!!!", "user": "LizzieDublinDublin", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50330654}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I would highly recommend this hotel to all my friends and family! Dont be ripped off by overpriced hotels and keep your money for your holiday! Stay in the Park Central!!!!Great Hotel!!!", "title": "Very Good", "user": "Tricky00", "date": "November 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49923320}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Found the staff100% helpful with our situations of early check in, storage , cleaning and help with the in rooom safe. Super service. Very pleasant. Room was clean, beds comfortable, clean, nice linen, and very nice room.", "title": "Old building just covered up existing problems.", "user": "HarryDiggs", "date": "November 23, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 49919123}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Very busy hotel but quiet and very well organized staff. Lots of staff to ask questions of. Elavator was great with the touch screen.", "title": "Perfect location, good value", "user": "ElineLee", "date": "November 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 49905711}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "I missed in room coffee but lots of shops nearby, can think of 3 offhand that sold coffee and econnomical meals and snacks. And the Carnegie Deli almost next door. Great for people new to this city . Very happy with my choice of this hotel.", "title": "Lucky I didn't listen to negative reviews!", "user": "marty451", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49849047}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I booked this room on Hotwire and got a rate of $129/night. Other colleagues of mine had stayed in this hotel, so if figured it would be OK. I checked in after 11 pm and although I had reserved a king bed, only twin beds were available.", "title": "Bedbugs and overpriced breakfast", "helpfulness": 3, "user": "ChitownMomma", "date": "December 21, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 51620353}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "While I was not expecting the Ritz at this price, the appointments were showing their age. The towels were thiner than at other properties, and on the second day they did not replenish my washcloths. I could live with that However my greatest disappointments were to follow. On the last day I ate breakfast at the hotel restaurant. The buffet which was closer to what I have gotten at a Hampton Inn, and while I did not expect it to be free, I did expect a lot more for my $25. And since I have returned, I have been very uncomfortable with the numerous bed-bug bites I received from staying at the property. I travel all over the world, and stayed in many types of accommodations and have never been bitten up like I was last week.", "title": "FANTASTIC", "user": "nino724sfd", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51474551}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Apologies posted online are not enough. The hotel really needs to inspect their rooms.", "title": "FANTASTIC:)", "user": "sazgirl", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51449105}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Read pevious reviews and was a little skeptical until we arrived. Our hotel rate was very reasonable after comparing to other 3 star NY city hotel rates.We had no problems with Valet parking except the price ($43 per day), which is what the Hotel told me the garage charges. After looking around in our travels in the vicinity ,the rate was on par with other parking facilities in the area without valet service. Reception person was friendly and efficient. Check in was a breeze and our room #1043 was clean ,spacious and even had a view of the street below. Maids always asked if everything was OK and asked if there was anything we needed. Never heard any noise and elevators were fast and efficient. The location was terrific as we could walk to Times Square. Subway and buses were within 100 feet of the Hotel entrance.", "title": "Good Value for Great Location", "user": "kdyer1", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 51389125}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I think the bad reviewers expected the Waldorf Astoria or were probably trying to get some compensations from the Hotel.. Some people make it a habit of trying to get something for nothing. I know we will book at the Park Central on our next trip to NYC providing we receive a great rate as we did.", "title": "Smelled like Urine", "helpfulness": 2, "user": "CMMAtlanta_GA", "date": "December 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 51290030}, {"rating": 5.0, "title": "Fantastic Hotel!", "text": "What a brilliant hotel! You walk out of the main entrance and look right, you can see Time Square (5 minute walk), if you go left your 5 minutes from Central Park. The staff at the hotel were polite, kind and helpful. The room was spacious and had everything you would wish for (except tea making facilities!) We were a little concerned about what the room would be like after reading some reviews, but we needn't have worried as it was plenty big enough. We will certainly be coming back to New York and with out a doubt be returning to Park Central!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4956899}, {"rating": 1.0, "title": "Never Again!", "text": "Stay if you would like, but this run down Hotel with way below average service isn't worth ever going back to. Out of towners don't be fooled, you can get service in NY that is 100 times better than what you get at this place! Pay a little more and stay somewhere else!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 5, 2006", "id": 4939375}, {"rating": 1.0, "title": "Shady management staff", "text": "A friend and I were driving to NY to spend the weekend. We called the hotel and put a room on hold. After encountering bad traffic we realized that we would not be able to make it all the way to NY. When we tried to call back to the hotel to remove the hold, we were told that they couldn't cancel the reservation because the reservation center was closed(where we had just made the reservation). We were told to call back the next day. When we called the next day we were told that we would be charged for the room. We have been through a painful ordeal trying to discuss the issue with the hotel management. I highly recommend staying away from this hotel!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 4, 2006", "id": 4896650}, {"rating": 5.0, "title": "a great place to stay!", "text": "This hotel is beautiful! It is located only 3 blocks south of Central Park. 14 blocks north of time square, and a couple blocks away from all of the broadway theaters. right next to the hotel there are several restaurants, and bakeries. the best thing about the hotel is as soon as you step outside and look to your right you can see time square with all of the advertisements. the location of this hotel is acceptional. I stayed on the 9th floor. The room was huge (compared to some of the other hotel rooms in New York). It even had a flat screen tv! I was shocked! I would recommend this hotel to anyone visiting New York.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4740708}, {"rating": 3.0, "title": "Good Enough", "text": "I stayed at Park Central for 4 nights. I couldn't have asked for a better location! To the left (4 blocks) was Central Park where I took a great horse and carriage ride. To the left was Times Square. Right outside the hotel was a subway system which was very convenient. I wouldn't recommend taking the subway too often, as you will miss some great shopping and woderful cafe's.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 25, 2006", "id": 4732055}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed here over the hurricane, the hotel was clean and our room large but there is no tea or coffee making facilities or bottled water. The charge for the wifi is expensive $14 for 24 hours. We had no heating or hot water or housekeeping services for 3 days (no discount on checking out as it wasn't their fault) and they charge you to leave your luggage when you check out. We had a lovely maid but the other staff we had dealings with we found to be rude. However the location is great.", "title": "Great location but could be better", "helpfulness": 1, "user": "250kts", "date": "November 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144374952}, {"rating": 2.0, "stay_parameters": "Stayed October 2012", "text": "I can't really say anything positive about this hotel other than the location is very good. I have stayed in hotels all around the world and this is without doubt the worst value for money I have seen. On top of an expensive nightly rate the hotel doesn't provide bottled water in rooms, free WiFi or free luggage minding service and if you want to order food to your room get the calculator ready to add up the costs. The room was very small but clean and had average facilities. The lobby was very dark and always crowded and we found a number of the staff members to be rude. The hotel had very basic facilities for a 4 star, I wouldn't consider it in the future.", "title": "Good location but a disappointing hotel", "helpfulness": 3, "user": "Mat789", "date": "November 2, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 144337223}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The Park Central Hotel is looking a bit old. The lobby is always very crowded with guests. The rooms are good with a perfect kingsize bed. The hotel is centrally located, close to Central Park and Time Square. The employees are very friendly and excepetionally helpful. A great service to make you feel at home and comfortable. All in all the price/quality is very good.", "title": "big, busy and more than good", "user": "Joost D", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144211257}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Do not book this hotel! Quality is way below the 3.5 star it claims to be and the attitude of the staff is really really poor. Firstly, when we arrived in our room, it smelt of urine..the shower curtain obviously hadn't been changed. the sheet did not fit the size of the bed and therefore we had to sleep half on the mattress protector! Unfortunately our stay was during Hurricane Sandy, and so we understood when they told us that with the limited staff our rooms would not be serviced. When we didnt have hot water, again we understood the situation (even thought we were in mid manhattan where we weren't affected by the hurricane) however when we asked them what they would do to compensate us, they said NOTHING! What makes me angry is that they have taken the full price off all the customers for services they could not provide. All we asked for was to be compensated for the cost of our stay, yet they refuse to understand our situation when we understood theirs! Cannot believe this hotel would reap the benefits off this Hurricane. They didnt service our rooms and didnt provide hot water for days and yet still charged everyone FULL PRICE!", "title": "reaping benefits off hurricane sandy", "helpfulness": 2, "user": "TravelBuddy83aus", "date": "November 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 144191900}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Park Central is in the northern 7th avenue, not far from Central Park, and about half way to Times Square. The rooms are larger than usual in the Big Apple, thestaff is friendly, the cost is high but in the average of this class hotels (4 stars).", "title": "Good area, good hotel", "helpfulness": 2, "user": "wally953", "date": "October 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144082333}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 562, "average": 965, "very good": 1928, "terrible": 460, "excellent": 1105}, "aka": "Park Central Hotel New York City", "slim_ranking": 0.816742081448, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Park Central hotel New York in the world's greatest city, steps from Central Park, Rockefeller Center & Times Square. The Park Central is at the top of the list of Midtown Manhattan hotels for business and leisure travel. Surround yourself with the classic attractions of the Big Apple, museums, dining, & beyond. With spacious accommodations this Midtown New York City hotel invites you to discover the convenience of our landmark setting."}