{"user_rating": 4.0, "review_count": 255, "name": "Park Plaza Trier", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "Overall", "title": "Fine hotel, great location", "helpfulness": 10, "user": "fightinghippos10", "date": "May 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3460520}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "This is a new hotel, in a great location just two blocks from the main town square in Trier. The service is good: non-invasive and as helpful as you wish. My rate was 95 Euros/day.", "title": "Convenient, Quiet location", "helpfulness": 3, "user": "charic77", "date": "May 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3433174}, {"rating": 3.0, "title": "Ok, buth not verry special", "text": "The room", "helpfulness": 1, "user": "s665770", "date": "October 24, 2004", "id": 2782737}, {"rating": 5.0, "title": "Brilliant location, lovely hotel", "text": "Decent size, my room, 211, came with 2 twin beds. I am not thrilled with the beds; I got just a comforter (vice sheet, blanket, and comforter). New Grundig 20 inch TV had about 30 channels and also had a lightly stocked mini-bar (lightly stocked to fit my own drinks/snacks). Generous closet storage for luggage and clothes. Be sure to stick key card into slot near door to activate in room power (similar to Japan). Room came with hot water heater and tea.", "helpfulness": 1, "user": "KAB", "date": "August 12, 2004", "id": 2442437}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "The bathroom", "title": "A great place to stay!", "helpfulness": 1, "user": "Cardio", "date": "June 9, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 2174889}, {"rating": 5.0, "title": "A second home in", "text": "Based in Trier for 2 months, I'd say this is one of the best hotels available in Trier if not Europe. With a roman style mix with modern touches, the lobby to the rooms to the restaurant right down to the carpets has a feel of modern roman influences. All are exactly as the pictures of their webpages.Rooms are spacious, clean and adequate with coffee making facilities, aircon/heater, etc.. Bathrooms are very clean and provided with adequate shampoo, soap, hairdryer, etc.Staffing in hotel is slightly inadequate at times, especially when hotel is full or in the night. There is no bellboy/porter, concierge or housekeeping in the night ie. only the reception. House-keeping are not perfect, sometimes forgetting certain replenishments. English language is slightly better than the below average standard we get on the streets, depending on certain staff/position.Service and hospitality is good at restaurant. Continental breakfast is generous and consists of healthy to heavy foods.Location is very convenient, departmental store/supermarket located next to hotel. It's next to the square where fast food, restaurants and shops are available. 5 mins to Porta Nigra or 15 mins to central train station. Bus stops just outside hotel.Within 2 months, we have travelled to Paris, London, Italy, etc. and we have stayed in > 3 star hotels. I must say this hotel is the best for a 4 star together with the more than reasonable rate and we are glad this is our temporary home. The comparison is almost day and night, the second we reach back to this hotel after a long tour/trip.", "helpfulness": 11, "user": "Pixel8", "date": "April 5, 2004", "id": 1764101}], "location": {"country": "Germany", "continent": "Europe", "city": "Trier"}, "stars": 4.5, "variance": {"poor": 7, "average": 22, "very good": 121, "terrible": 10, "excellent": 95}, "aka": "Park Plaza Trier Hotel", "slim_ranking": 0.234042553191}