{"user_rating": 3.0, "review_count": 502, "name": "Park Lane Mews Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Is this REALLY a 4 star hotel?", "title": "Noisy, dated, shabby but in a great location", "user": "lipschick", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 81981737}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I've stayed here several times in the last few months, it is near my office, this is the only reason. I have now given up. The rooms are very hot, the air con units very noisy, open a window and you may as well sleep outside, talk about noisy!", "title": "The worst ever", "helpfulness": 1, "user": "Edward7London", "date": "September 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 81561646}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The location is superb, Shepherd Market is nice, it is a short stroll to both Piccadilly, Green Park, Hyde Park, Park Lane and Mayfair.", "title": "Flithy Dirty Hotel - AVOID at all costs", "user": "KeithT68", "date": "September 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 80441630}, {"rating": 1.0, "stay_parameters": "Stayed July 2010", "text": "You can get is for £100 ish on Laterooms or similar, never ever ever pay anymore than this. Ever.", "title": "A mouldy dump. And a manager who couldn't care less.", "user": "TinaHarrisment", "date": "September 17, 2010", "detail_rating": {"cleanliness": 1.0, "location": 4.0, "service": 1.0}, "id": 79898542}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "I am recommending it, just for location and the cost factor", "title": "4 Stars - Are you serious?", "user": "klynn48", "date": "September 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 79796910}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "As a woman traveling solo in England, I had the good fortune to stay several days in the Park Lane Mews Hotel. This charming small location had a number of advantages: 24-hour concierge, charming sitting room/breakfast area, and access to Shepard Street right around the corner with at least seven interesting well--priced restaurants--think of Polish-Mexican cuisine, as one example. The people working at the desk all maintained a steady cheerfulness and willingness to help with the smallest details from arranging a tour to making the least expensive international phone calls. Located near Hyde Park in the elegant area of Mayfair, this place provided a respite from the overwhelming crowds in busier parts of the city. I would certainly return to this spot.", "title": "Location, Location, Location", "user": "mmk26", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75827340}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Due to last minute business itinerary changes we had to select a hotel in the heart of London on a pre determined budget....knowing that London is a very expensive city the expectations were not high....we chose this hotel based on location and price ....check in was a bit of a circus with the staff mocking each other as they fumbled through the process of check in....dissapointed customers were voicing their opinions as to the accuracy of the room description and the parade of such complaints during the check in process was a bit embarrassing after a while....the room itself was of course small, the bed was very poor with the most budget mattress available with no pad for relief, add lumpy sodden pillows and you knew the night would not be the best...the bathroom was depressing with the shower head showing horrid brown stains, the ancient wood door showing the years of abuse and cleaning, the lights were weak and few....all in all, the only positive about this hotel was its location....so if you are ready to bear the brunt of the condition and maintanence of this property in exchange for a low price and good location than you may consider it a fair trade....just do not go into the situation with hopes for a comfy, clean, proper British property....", "title": "Budget Accor property in the heart of Mayfair, but do not expect much if anything at all", "user": "Jetlaggard59", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 75284091}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I travelled to London with my son aged 7 to see the sights and see the Thriller show. On arrival the staff were very helpful and pleasant and advised as to what tour bus to use to take in the sites. The hotels is in a fantastic location, 15 minute walk to Piccadilly circus, the same to Buckingham palace, 10 minutes to Green park where the tour buses operate from and 15 minutes to the museums, and the National museum is a must for young children. The rooms are very clean but a little shabby and in need of renovation and the air conditioning is a no, it just doesn't work and the room was very humid. As this hotel is located at the rear of the Hilton it is very noisey in the mornings when deliveries are made and dustbins emptied. Overall based upon cost, location and service I would use this hotel again but request a rear room with air conditioning that worked.4/5 rating due to the location and superb staff.", "title": "Fantastic location", "user": "jacejones20", "date": "August 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 75049085}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Hotels service is a bit shabby - have been chasing an invoice for weeks and they dont seem to respond to emails. I also complained about the lifts not stopping on the 5th floor - myself and another guest were stood for 10 minutes waiting. I rung the front desk who were less than proactive.", "title": "If you booke through Lastminute, dont expect an invoice for expenses - off anyone!!!!", "user": "Chippyqueen", "date": "August 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 74879559}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Shame - as the hotel is in a great spot, can walk down Park Lane to Oxford Street and there are some amazing little restaurants and bars in a pedestrianised area. The Curzon cinema is near by as is Green Park Tube.", "title": "Avoid. Seriously.", "user": "CHD42", "date": "August 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 74647226}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Writing as a former hotel manager and now auditor who is very familiar with the star ratings given by the AA and Visit Britain I’d strongly suggest that this hotel is a 2 star, at a push!", "title": "Not a 4 Star Hotel", "user": "MatthewGreen", "date": "October 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 85241717}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Having read the reviews here I was naturally anxious about staying at this hotel. Initially I was actually very happy as I had been upgraded to a suite which was certainly very spacious.", "title": "Cosy and Comfortable, well situated", "user": "caz6050", "date": "October 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 85167645}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "However, given that this was supposedly the best suite in the hotel then I honestly dread to think what the other rooms are like.", "title": "Mayfair on a budget", "user": "TrvlngFool", "date": "October 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 84790809}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "So, overall quality issues:", "title": "What a dump", "user": "London1953", "date": "October 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 84722586}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "-The carpet was stained in places and appeared very “weathered”. I don’t know if it was actually really dirty or just very old.", "title": "No air-con, no service, no future for this hotel", "user": "pgsnapper", "date": "October 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 82106001}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The hotel was just perfectly located for Business meetings, rooms were not very big but comfortable and had value for money spent in the hotel. Staff was very co-operative and knew the defination of the term HOSPITALITY towards their guests.", "title": "Excellent Location, Very co-operative Staff & Value for Money", "user": "amitsharda", "date": "September 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 79733164}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "The location of this hotel is fantastic; right in the heart of May Fair, Sheperds market; Hyde Park across the street, as in fact is Green Park and Buck Palace and Knightsbridge, all in walking distance. The hotel has a lot of charm, but is quite worn on the edges. I recommend it for a short stay, specifically fi you can secure a booking via one of the many online booking networks, in which case you get value for money. The regular rack rate is overpriced for what is offered,; the rooms are small, as are the hallways, so it can be noisy as other guests leave or come back from/to their rooms. Note: the single rooms are \"cute\" i.e. minute, and you need to be sporty to manouvre around the shower room. For breakfast I recommend one of the \"cafs\" in Sheperds market ..... Considering the surrounding neighbourhood and regular price structure, the service , or lack of, is a little suprising, perhaps guests get treated acccording to booked rate ;-)", "title": "old English charm on a small scale..", "user": "Mucki1406", "date": "September 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 79211235}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "How sad we were when we entered this hotel on 27th august, we had not stayed here for 2 maybe 3 years when it was owned by the hilton chain. Whoever owns it now has not spent a penny on its upkeep!!! The whole place needs a complete refirb now! The rooms are beyond shabby, we couldnt eat the breakfast as it was stone cold even though we arrived 15 mins after start time. Its such a shame that what was once such a lovely small hotel in a great location is now so run down. All i will say is dont spend your large amount of money, because thats what it costs to stay here, on this hotel, there are planty of well kept hotels in this area. What a shame the owners, whoever they are?, seem to be taking the money and spending it elsewhere.", "title": "a sad experience!", "user": "joyOxford", "date": "August 31, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 77649754}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Well, I will start with the positive, The hotel is in a fantastic location, but that is it. All down hill from there.", "title": "Disapointing", "user": "Somersault0", "date": "August 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 77337009}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Check in is a farce, with their own non standard policies, that make checking in a long and hard experience for the business traveller that has pre booked and paid on line. Staff are confused and dont understand basic business practices.", "title": "Dump", "user": "RobertDavis10023", "date": "August 23, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 76448974}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 86, "average": 106, "very good": 148, "terrible": 104, "excellent": 58}, "aka": "Park Lane Mews London", "slim_ranking": 0.553903345725, "description": "The Park Lane Mews Hotel is located in the prestigious Mayfair district, within a short walking distance of the very picturesque Hyde Park adjacent to Park Lane. This 4 star desirable hotel in Central London is within minutes walk to Knightsbridge, Oxford Street, Green Park, Piccadilly, Buckingham Palace, Regents Street and Hyde Park, the heart of London is truly on your doorstep! This 4 star property offers the charm of a traditional boutique hotel with the modern facilities required by today’s most discerning guest. In addition to the comfortable rooms and suites, the hotel also boasts a spacious conference room for meetings and private functions. Dine in our Stanhope Restaurant or simply relax in the Lounge; our dedicated staff look forward to welcoming you to The Park Lane Mews Hotel."}