{"user_rating": 4.0, "review_count": 961, "name": "Park Plaza Wallstreet Berlin Mitte", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My wife and I have visited 20 European cities in the past two years and the Park Plaza Wallstreet was one of the best. The rooms are well decorated, wonderfully laid out and provided a welcome respite at the end of a long day. The location is quiet and safe, yet only one block from a U-Bahn stop on the U-2. The price was more than reasonable and we found the staff eager to help with any request.", "title": "One of the finest hotels in which we have stayed!!", "user": "Micame", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 82452665}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My fault, because we choose a time when there no price reductions, and compared to other hotels we've stayed in, not good value. This is a business hotel.The rooms were clean and comfortable, but small. The breakfast would have been good value at £5 or £6 but not at 26euro. No complaints about the quality, just the cost. The staff were helpful, polite and friendly, and did everything to make us welcome. There were small things which irriated - 5euro to access internet, only decaff coffee and powdered milk for example. Location is OK in what was the old East, but a little bit out of the way for walking out in the evening. Access to Ubahn very easy for sight seeing etc.", "title": "Nice hotel - but not good value", "user": "DWM64", "date": "September 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 81431400}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "There are some pleasant bars & restaurants locally (but don't be tempted by Motte Hoppe - guide book said service offhand, but it was actually plain rude).", "title": "Beautiful design hotel", "user": "TheChadi", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79565159}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "If I'd paid 150 euro for b&b we'd have been recommending this hotel, so if you can that price or better, then fine.", "title": "Great hotel", "user": "thanos_n", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77983229}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This hotel is a beautiful design hotel with great staff in a good location. The U2 station is less than 50m away and takes you to Alexanderplatz in 2 stops. The location is very quiet and the rooms are spacious. The free internet in the rooms is good and I must say the bathrooms are very spacious. I would highly recommend.", "title": "Arty, Trendy & close to everything", "user": "Intelins", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75700228}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed at the Park Plaza for three nights in December going to the street market Gendarmenmarkt (Fantastic) as we have done previously.", "title": "Scott of Antarctic", "helpfulness": 1, "user": "Saggart", "date": "December 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 90205801}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "The hotel was close to a U2 station which was great unfortunately we came up the wrong steps (Two entrances, poor signage, no mention of Park Plaza hotel) on arrival at Wall street and we wondered in the snow for about ten minutes it was like Scott in the Antarctic but we had no ski shoes!.", "title": "Perfect Location for Christmas Markets", "helpfulness": 1, "user": "cb161", "date": "December 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89373997}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Once we parked our sleigh and fed the huskies (Joke) we did not feed the huskies. Reception was bright but not inviting and lacked character, but thats due to the general hotel design modern with a stock exchange theme .", "title": "Not well prepared for a hot summer", "user": "MarkJulia", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 85611221}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Good check in reservation quickly sourced reservation we were sent on our way, no porter. Room was a good size no extras as paid for i.e. bottle of wine for upgrade. Toilet seat was dirty (did not complain at this stage) when lifted which was disgusting,", "title": "Very sympatic Staff.", "user": "JoeNidrum", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83773899}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "They did not clean our room one day said we must have had a DND sign out, we did not!.", "title": "Hot summer has revealed big problems", "user": "AroundGlobe", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 82918001}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The location of the hotel is great if you are planning on using the subway to get around Berlin as it's right down the street from a stop. Just make sure you exit out of the right set of stairs.... For the hotel itself I was rather disappointed after reading some of the glowing reviews and seeing pictures. The rooms look MUCH better in photos than in person. We found them rather tacky and cheap looking which can be easily overlooked. My biggest complaint however is that it was filthy! I had to wipe down the counters in the bathroom because there was hair and soap residue on them. The floor was really disgusting with hair everywhere and stains like someone kept their shoes in there. We asked the front desk if they could mop it quickly the next morning but it was never done in the 3 days we were there. I think they just swept it once. There is so much dust and grime built up that it was really disgusting. It's like they never dusted, even though there are ledges right beside the bed. Sleep quality was poor for myself and my husband. We don't really like hard beds and these were like sleeping on the floor. The good thing was that you don't get any street noise as the hotel is located in a very quiet area. Oh and there is free internet you just need to ask the front desk for some vouchers to get the username and password for 24 hrs. There isn't however free breakfast which was rather disappointing as this was the only hotel we stayed in that didn't provide that. You'll have to go to Alexanderplatz or somewhere else to find some restaurants as there didn't seem to be anything close to the hotel. For a hotel that was recently renovated I expected the rooms to be in better shape. Overall it wasn't a bad price for what you got but I'm sure there are much better hotels out there.", "title": "Decent but could be much better", "user": "Janesse", "date": "January 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 93755960}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Stayed here for three nights, including New Year's Eve, in two Junior Suites. Staff friendly and efficient. I agree with previous reviewers that it is at first difficult to locate your room but the rooms were comfortable with good bathrooms and free wi fi. We ate at the hotel restaurant on one occasion and the food was well prepared.", "title": "Very Good", "user": "Pierre4823", "date": "January 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93087250}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The bar at the front of the hotel is a good meeting place. The friendly staff opened up the business centre on the top floor for us shortly before midnight on NYE and we enjoyed a great view of the fireworks from all around Berlin.", "title": "Good choise in Mitte", "user": "Sogning", "date": "January 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92463423}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We have stayed at only two hotels in Berlin and while the Park Plaza was very different to the Sofitel, I would have no hesitation about recommending this as a good place to stay.", "title": "Hopitable staff, relaxing bar and very comfortable room", "helpfulness": 1, "user": "Gootevos", "date": "January 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91453995}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "We stayed in Park Plaza Wallstreet from Saturday to Monday, and were very pleased with the location and price. Walking distance to Alexander Platz. Nice Indian resturant across the corner and nice breakfast place by the river. Serviceminded staff.", "title": "Well located, good value, friendly and helpful staff, pity about the internet", "user": "MuseumJunkie99", "date": "December 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 90732551}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "A well-located bright boutique-style hotel with great breakfast room – but it's a shame no-one kept a tighter check on the design team. The ensuite bathroom doors are not only only semi-opaque, but don't actually close, let alone lock. Many people seemed not to relish performing intimate functions in full view of their partner/co-traveller and had retreated to the loos adjacent to the bar area. Service is a tad surly.", "title": "Not for those who value their privacy!", "user": "Ottomania", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 75326248}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Nice and well located hotel. The staff is very friendly, helpful and highly motivated. Clean rooms. I can absolutely recommend this spot and I would choose the hotel again for a stay in Berlin.", "title": "Nice and well located hotel. The staff is...", "user": "Riedim", "date": "August 11, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 74706251}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel is located away from the rush of the big city but within walking distance of all the sites. Besides that there are two metro staions at 100 metres distance to the hotel. We stayed here for three nights, had a wonderfull room on the top floor with a view over the city. The room was spacious and nicely decorated, the dollar bill carpet was an eyecatcher. The bar is nice and breakfasbuffet really goor. Very friendly and helpfull staff. Would definately stay here again.", "title": "Wonderfull hotel, great quiet location", "user": "AniqueJ", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73533354}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed here for three nights and were really pleased with our choice. The hotel building was lovely, the bar and restaurant were modern and there was even a private cinema! The room was really modern/minimalist and the walls of the en-suite were all glass (but not see-through!).", "title": "Lovely hotel in a great city", "user": "NWPDWR", "date": "July 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73143877}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "It was only a two minute walk to the metro station, and you could walk to Alexander Platz in 10 minutes. The hotel is on a really quite street, which allowed for the best sleep ever!", "title": "Very Nice Hotel!!", "user": "kkimColorado", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72423934}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 30, "average": 102, "very good": 407, "terrible": 10, "excellent": 412}, "aka": "Park Plaza Wallstreet Berlin Hotel", "slim_ranking": 0.12012012012, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Park Plaza Wallstreet is a four-star deluxe hotel located in the heart of historic Berlin, close to all the main tourist attractions like the Reichstag, Alexander Platz and Branderburger Tor. Reminiscent of the New York Stock Exchange, our hotel in Berlin features a stunning lobby, beautiful courtyards, restaurant and bar, health club, meeting rooms, on-site Business Centre, private screening room/cinema and private parking, as well as a Fitness Centre. For added convenience, all of our Berlin hotel's areas are now free wireless hot spots. Whether you're enjoying a Berlin vacation or visiting on a business trip, you'll appreciate our comfortable accommodations. Our signature attention to detail, professional service and exclusive lodging distinguish the Park Plaza Wallstreet from other Berlin hotels."}