{"user_rating": 4.5, "review_count": 700, "name": "Park Hyatt Sydney", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "If you are not on a budget, this is the only place to stay in Sydney. The hotel has been redone and is stunning and modern with views to die for. And the rooms are well-designed and spacious with stylish furnishings. Loved the large shower in the bathroom, and the separate room off the entry hall for the toilet. Really a practical design when several people are sharing a room. The bed was an extra-large king with wonderful bedding and pillows. I felt totally comfortable in the room...and for me, that's saying something.", "title": "Fabulous room and service", "helpfulness": 1, "user": "kingsroadgal", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173989874}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I was also impressed by the staff. They all seemed very genuinely caring and eager to help. Jonathan, the concierge, was a particular stand-out, but all were great and friendly.", "title": "Doesn't get much better than this...", "user": "Richards279", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173975715}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "My only criticism of this hotel is the cuisine. I just didn't think it measured up to the standards of the rest of the hotel. We had breakfast included in our rate, so sampled three breakfasts. The food was very average. As to the continental breakfast, there is limited selection. Some bread, and some puff pastry-type things, such as croissants, raisin twists and apple turnovers (and jelly donuts). No type of muffins whatever, and the bread selection was limited. There are refrigerators in back of the buffet area filled with some cold cuts and yogurt and fruit, but upon opening these, you are overwhelmed with meat and spice smells, and nothing really is that appealing after that...certainly not the yogurt and fruit (which looks a little dried out). I remembered a great breakfast from my last stay at this property 5-6 years ago, so I was definitely disappointed.", "title": "business or pleasure this is the spot in sydney", "user": "jfulli007", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173887932}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I love this hotel, but I really think that they need to work on the food. When we had to miss breakfast at this hotel because of an early departure, we honestly were not that disappointed, and our breakfast in Qantas business class was better than that at the Park Hyatt. I hate to say that, but it's true. And high tea was a similar experience. Scones need to be improved, and really nothing was very good. And when you consider the price, it should be great!", "title": "Amazing, Stunning view of Sydney Opera House from room.", "user": "Summerbreze18", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173728194}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I did, however, LOVE my Cosmopolitan drink which we had overlooking the Opera House from the lounge. Kudos to the bartender, as I have had many bad Cosmos. And the waitresses were efficient and sweet in the cocktail area.", "title": "Top class", "user": "JpnMan", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173625273}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Was only hear for 2 nights during a convention but this place was out of this world. From views across the harbour to impeccable service if money was no object this is the definitive Sydney hotel. However, if was paying myself this would not be a regular destination", "title": "One of the best in the world", "user": "Davina W", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170533647}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Prime location. Fantastic views of Sydney Opera House and Habour Bridge. Hub of activity with people and ocean cruise liners coming and going. Easy walk to Sydney surrounds. Rooftop pool magical and great place to relax and hangout.", "title": "Great Location and Staff", "user": "Costanza1975", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170188430}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The location of this hotel was purely fabulous! It was amazing. The Park Hyatt is very nice and very modern, as all of them are. So glad I booked this one. Everything is very clean and modern. Staff are super helpful and friendly!", "title": "Fabulous Location", "helpfulness": 1, "user": "HONdominik", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170169633}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed here 8 nights and loved it. Wake up in the morning and the harbour is right in front of you. We stayed in a harbour suite and it was fabulous. Room was tastefully appointed and has great features. Service was excellent and all staff were helpful and polite. It's location in the rocks is excellent and it's only a short stroll away to Circular Quay, Sydney Opera House, City Centre and Sydney Harbour bridge. There are lots of restraunts nearby and their are also a handful of restraunts and bars in the hotel. Breakfast is served at the dining room. Dinner is also great and I reccommend you try the Seafood Platter in the dining room. I would have no hesitation to go here again.", "title": "Great location", "user": "Proholiday10", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169812787}, {"rating": 5.0, "title": "Superb in every way", "text": "We stayed three nights here at the start of a trip, following a 24 hour journey from London, and this was the perfect place to help us get over our jet lag. Wonderful location made it so easy just to go out and walk around the local area or catch a ferry for to other places. Plenty of places to eat and drink within a short distance, but a highlight was having the tasting menu dinner at the hotel one evening, each course paired with wines. The quality and presentation of everything was superb, along with helpful information from the sommelier about each wine. The cost of that, along with other food and drink in the hotel, did not seem higher than other places around Sydney.", "user": "simonbg", "date": "July 29, 2013", "id": 169808444}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "This is a stunning hotel right on Sydney Harbour's waters edge in the Rocks area of the city. It has recently been renovated and oozes opulence and luxury.", "title": "A beautiful, luxurious hotel", "user": "Travelbug49", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169797372}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The rooms are expensive, but are spacious and worth investing in one with the view of the harbour.", "title": "Interesting !!", "user": "Worldtraveller1953", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 169459100}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The roof top pool is small but comes with great views of the harbour and opera house, is heated in winter and has a number of beautiful day beds to relax in and soak up the views.", "title": "Can't beat the location and top notch service", "user": "Steve A", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169318077}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The gym is well equipped and also has great views - from the gym you can gain access to the roof top pool and spa.", "title": "Probably in my top 3 hotels ever", "user": "Peter S", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169217954}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The spa is also well worth a visit - with a beautiful relaxing sitting area pre and post treatments.", "title": "Overlooking the harbour, stunning", "user": "RastanB2", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169074463}, {"rating": 5.0, "title": "The Ultimate special occasion", "text": "Stayed in this hotel septemer 2006. I had just sold my business, so wanted a special few days to celebrate. We statyed in an Opera King Deluxe Suite. It lived up to our expectations and beyond. If you want a view, this is the hotel. The rooms are great. The bathrooms are getting a little tatty there was some peeling wallpaper. But overall theyre marble and massive in size. The staff were beyond helpful without being intimidating. The only thing that didnt live up to the standard of the hotel was the day spa. They seem to have squashed it into some poky little rooms. Overall I would highly reccomend this hotel. The only one weve stayed in thats better is Versace on the gold coast.", "helpfulness": 10, "user": "MissTravelAlot", "date": "May 20, 2006", "id": 5183435}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stayed here for 5 nights with our 6 year old son. The Rolling Stones had checked out a day or two before we arrived. Car transfer from airport worth every penny. The exterior of the hotel is low key almost to the point of dowdy; interiors understated, classy but a little faded. This Grande Dame could probably do with a bit of a makeover but the location is unbeatable and dripping in 'wow' factor. Our room had a direct view of the Opera House. Spacious and well-appointed with plenty of room for an extra single bed. Breakfast in the waterfront restaurant simple but delicious although at times the staff seemed to struggle a bit with the guest traffic (we were there over Easter and the hotel had full occupancy). A leisurely 20 minute stroll round to the Opera House and then on to The Botanic Gardens. 5 mins from Sydney Harbour Bridge. Ferries to the Zoo, Manly Beach and others en route to Opera House. Museum of Contemporay Arts (currently showing the Sam Taylor-Wood exhibition) a short stroll away. The Rocks market on a Saturday is behind the hotel. Fantastic bars and restaurants within moments of the front door. Rooftop pool small but perfectly formed and a great place for bat-spotting at dusk.", "title": "Understated, Classy, Unbeatable Location.", "helpfulness": 12, "user": "!!", "date": "April 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5020024}, {"rating": 5.0, "title": "Xmas and NY Eve Holiday 2006 FANTASTIC", "text": "Cannot recommend highly enough. May not apeal to high-fashion style seekers as low on glam factor but unbeatable choice for seeing the sights and very child friendly. Undeniably pricey.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 18, 2006", "id": 4986518}, {"rating": 5.0, "title": "Five Star View", "text": "By the way, we did notice that there is a very good-looking Holiday Inn tucked in just behind the Park Hyatt - prob won't have the views but also a fantastic location for seeing all of the above and no doubt a lot less expensive.", "helpfulness": 32, "user": "Rocket88", "date": "March 20, 2006", "id": 4717800}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "A trip of a lifetime! Spent two glorious weeks at the Sydney Park Hyatt for xmas and ny celebration! Arriving at 1am, not a problem - easy and friendly check in. Anything needed, not a problem! Best location for NY Fireworks Celebration w/a complimentary bottle of bubbly! Convenient location to all public transportation and concierge well prepared for ANY questions, even for a Harley ride and tattoo shop ;-)", "title": "best location in Sydney", "helpfulness": 10, "user": "cotswoldstraveller", "date": "February 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4452218}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Great Location. I have also stayed at the Intercontinental Sydney and while the Club floor has a great view, the Intercontinental does not compare to the Park Hyatt. My wife and I got an Opera View Suite which was around 600 SF. Two balconies with great views. One of the coolest things was we cam home back from dinner at Otto's (I recommend) and there was a Michael Buble concert at the Opera House. We were able to listen from our balcony while having some wine.", "title": "Best Location - Opera View Suite", "helpfulness": 5, "user": "Ricanth", "date": "November 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4138681}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The food was OK and very expensive. I recommend walking around the corner to Pancakes on the Rocks and getting some Chocolate Pancakes with Ice cream and strawberries for dinner. In addition there are cafe's all over the Rocks District.", "title": "what a view!", "helpfulness": 6, "user": "kazpalms", "date": "October 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3991823}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "The workout facility was clean and while it had limited equipment, there was noone using it, ever.", "title": "Big Disappointment", "helpfulness": 24, "user": "PVTraveler01", "date": "September 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "service": 1.0}, "id": 3940990}, {"rating": 5.0, "title": "Great hotel if money is no object, or you have high status in their loyalty program", "text": "I think this is the best place to stay in Sydney. I also think it's the most expensive. Which means that, from a value-standpoint, it probably doesn't score so high for many customers. But if you don't care about how much you pay, or you have high status in the Hyatt loyalty program and can get some free perks, I think you will be very satisfied.", "user": "Dave's_reviews", "date": "August 21, 2013", "id": 173397534}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "First of all, the location of the hotel is clearly the best in Sydney. Right on the Harbor, with the best view of the Opera House. Keep in mind though that, unless you pay for the upgrade or are a Diamond loyalty member and get upgraded, you probably won't get that fantastic view from your room. If you do get it, it's spectacular, especially from the very nice balconies.", "title": "High tea very average", "user": "RebeccaK150", "date": "August 11, 2013", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 171678291}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Second, the room furnishings and design are excellent. I'm not sure how many hotel rooms I've stayed in (probably over a 1000) and this was one of the top 5 (I did get the nice upgrade, though). Tons of space, modern-tasteful décor, lots of amenities, good bed, weird Japanese-heated/spraying toilet seat, fancy electronic blinds, etc. Oh, and the gave me a nice complimentary fruit platter and chocolates along with a decent bottle of wine.", "title": "beautiful, but the staff is what makes this property the five stars it deserves", "helpfulness": 1, "user": "J M", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171231583}, {"rating": 5.0, "title": "The right decision", "text": "Third, the service was great. I don't always like over-the-top service and, indeed, a few of the staff were a bit obsequious to me, but overall, I was very impressed. Nothing was too much trouble, and the staff always went the extra mile (or kilometer?) to help. Printing out a map with hand written instructions if I asked them to make a dinner reservation, remembering a family member's birthday with complimentary chocolates, etc.", "helpfulness": 2, "user": "KaspXhotels", "date": "August 7, 2013", "id": 171151796}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The only minor disappointment was breakfast. The dining room is beautiful (you get \"the view\" from there) but the food was only good -- not fabulous. Had I been paying the (gulp) $45 per person charge for breakfast, I probably would have been a bit disappointed. (Fortunately, it was comped due to my Diamond status). You get a hot entrée from the menu and then go over to the continental breakfast buffet. Everything was well presented but, as my family observed, \"the food wasn't better than what you get at the Hilton for breakfast.\" My daughter pronounced the pancakes as \"not worth her time -- they're better from the machine at the Qantas lounge.\" I myself was a bit surprised that the orange juice wasn't fresh, the bread selection was mediocre, and the cold cuts far inferior to what you'd get at any 3-star hotel in, say, Germany. Of course, in Australia, one perhaps has to adjust one's epicurean standards. :)", "title": "Room with a View", "user": "Elena J", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170998972}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Well actually 4 and a half out of 5.", "title": "Location, location, location", "helpfulness": 10, "user": "BryceCurdy", "date": "February 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4410484}, {"rating": 5.0, "title": "Cool weekend", "text": "The location is simply unbeatable. I found the staff very helpful despite the comments of at least one other reviewer. Early check in was no problem and I had specifically asked for a good view of the Harbour Bridge which we definitely got. The rooms are excellent. We ate once in the restaurant and had a very nice if slightly pricey lunch.", "helpfulness": 7, "user": "ithaki", "date": "January 11, 2006", "id": 4345291}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Only two criticisms. The rooftop pool is very small. There is only a total of ten loungers. Secondly some of the rooms (about a third) have only very small balconies with no seating.", "title": "Nowhere better on the Opera House side, but make sure you get the right room !", "helpfulness": 37, "user": "LawyerAbroad", "date": "December 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4256272}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Have not stayed here for years but were impressed with our reception. An early check-in was no problem even though an early business meeting meant we did not require this. Divine room with balcony view onto the inner harbour. We stayed a long weekend and it was a delight to observe all of the weddings below when we were at our room. Despite the opening balcony doors the room was so quite and dark at night - easy to catch up lost sleep. Bed was divine and room extremely good value. As we love to walk a lot the bath was really appreciated to soak in at night. Next trip will use the excellent spa facilities. Staff were very helpful and pleasant but unobtrussive. Check in/out was very low key - much appreciated. We dined out with local business colleagues but you would be wise to check out the restaurant menu - excellent choices if you are gastronomically challenged. Looking forward to a repeat stay next month.", "title": "Best hotel in Sydney", "helpfulness": 6, "user": "MasterGee", "date": "December 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4158204}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 18, "average": 30, "very good": 111, "terrible": 11, "excellent": 530}, "aka": "Park Hyatt Sydney Hotel", "slim_ranking": 0.027027027027, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Emerging from a dramatic transformation, the newly redesigned Park Hyatt Sydney offers an intimate, residential-style hotel with architecture, design and art reflecting the Australian landscape.With a coveted harbourfront location between the famous Opera House and Harbour Bridge, spacious rooms feature contemporary interiors, modern bathrooms with dual vanity, wet area, rainshower and deep bathtub, and floor to ceiling glass doors that open to private balconies. A dedicated team of butlers provide personalised service for all guest rooms & suites. The hotel’s restaurants and bar, private dining rooms, day spa and recreational facilities have also been enhanced to reinforce Park Hyatt Sydney’s position as one of Australia’s premier hotels."}