{"user_rating": 5.0, "review_count": 710, "name": "Park Hyatt Hamburg", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I stayed at the Park Hyatt for a long weekend and more than anything else enjoyed the friendliness and helpfulness of their people. The room (a Queen on the 7th floor) was stylish but on the small side. The bathroom is nicely integrated into the floor plan and looks stunning with its designer sink, but that doesn't necessarily mean that it is the most practicable hotel bathroom I've ever experienced.", "title": "Outstanding personnel", "user": "GermanyTraveler", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34603872}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "The team, though, is truly outstanding and has a service-oriented mindset that can sometimes be hard to find in Germany. Never did I meet a single unfriendly face or somebody who wasn't eager to help.", "title": "Excellent Gym+Pool+Spa - Luxury yet still a Business Hotel", "helpfulness": 1, "user": "7DegreesOfWonderment", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34035983}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "As others have mentioned, the breakfast selection is high-class and of excellent quality.", "title": "Big rooms, very comfortable", "helpfulness": 1, "user": "thrall", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30292093}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I have just returned after a two night weekend away of rest at the Park Hyatt Hamburg. On my profile here I have reviewed other Hyatt’s I have stayed at (Grand Hyatt’s in Hong Kong and Tokyo and The Park Hyatt in Istanbul). I had read the other reviews on this site and, given my experience at the other Hyatt hotels, I could not really understand why other reviewers were referring to the Hotel as a “business hotel” as the other Hyatt’s I know are just luxurious and perfectly adaptable to either leisure or business use. I understand now though! I think it is due to the fact that this Park Hyatt was opened 11 years ago.", "title": "Nice Hotel and great Loaction!", "helpfulness": 1, "user": "SharonlondonU.K", "date": "February 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24677658}, {"rating": 5.0, "title": "Great Experience", "text": "I booked an ‘Awaken Package’ for a Club floor King room on the Hyatt website. This gave me a late check out to 6pm on Sunday so that I could fully relax before my return flight. All was high level Hyatt. The staff was very friendly. All was in tones of woods – dark to light. Yet why was I not having the same great feeling I had at the other establishments. Was it just that it is in Germany or is it due to the fact that they view themselves and act as a Business hotel and less as the ‘Resort Haven’ feeling you get at other Park Hyatts. The overall impression of the hotel is quite empty with a vast expanse of a lobby which is aesthetically pleasing in warm tones but lacks a certain atmosphere. Entrance from the street is via a first elevator to the lobby area and then a second in front of reception to your room.", "helpfulness": 2, "user": "Febo17", "date": "February 10, 2009", "id": 24442995}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The Park Hyatt in Hamburg is a great choice for both business and pleasure. I don't usually like to stay in business hotels while I'm on holidays but the Park Hyatt is an exception. (I feel sorry for the poor suits who can't enjoy the experience as I do.) The location is perfect, within easy walking distance to the main train station and next to fabulous shopping. The rooms and bathrooms are spacious, modern, yet warm. The food in the restaurant is divine. The staff are extremely professional. I've stayed there three times within the last year. I ran into a problem with the car rental which we'd arranged through the hotel. We requested an automatic from Avis, but was sent a standard instead. As there wasn't an automatic available in the class we'd needed, we were left with what we had. The concierge followed up and arranged to have another car sent to us in the next city we were staying at. Mistakes can happen anywhere and how they're dealt with is really the litmus test of a first-rate hotel. On another trip, they stored our excess baggage for a week while we took a side trip by train to Berlin. Excellent in every way.", "title": "The Best", "helpfulness": 2, "user": "Cilantro_and_Lime", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20696825, "likes": {"liked": "— The rooms and the service", "disliked": "— That I couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "After experiencing bad service in the Berlin Hyatt I was sceptical, but this one is truly outstanding. Staff is very polite, attentive and friendly. Rooms are spacious and quiet. Breakfast is a real treat and worth the 30 euros a person. They don't save on the ingredients like some other hotel chains... Hamburg's poshest shopping streets are a ten-minute walk from the hotel, the central train station is just around the croner.", "title": "Outstanding Service, Great Rooms", "helpfulness": 1, "user": "Frankie-the-Hun", "date": "August 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19536531, "likes": {"liked": "— The buffet breakfast - a gourmet paradise"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Nice hotel, great service from the moment we arrived, porter is there to help with the luggage and shows us the way to the reception area.", "title": "Nice hotel in the city center", "user": "Wereldreizigster", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18231644, "likes": {"liked": "— Service and the nice room", "disliked": "— Nothing that I can think of"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Reception is at the 2nd floor, we were early but they did have a room ready for us.", "title": "The best hotel in HH", "user": "SwedenLuxury_lover", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17988680}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Receptionist showed us to the room, and gave info about the hotel. Room is spacious and in nice colours, big nice bed, Bang&Olufsen flatscreen, desk, nice big windows with court yard view so quiet :-)bathroom with L'Occitane amentities.", "title": "The place to stay!", "user": "VfB 1893", "date": "May 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15674597, "likes": {"liked": "— the style and location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "Just stayed at the Park Hyatt on a trip that also included the Regent in Berlin and the Kempinski Taschenbergpalais in Dresden, so this comparison is in heady company. The rooms certainly represent a modern take on luxury, so if you like Baroque, this might not be your spot. Personally, I like any style as long as it is well-executed in details, and the Park Hyatt is for sure. The bath is large and luxurious, the electronics are top-drawer Bang & Olufsen, and materials and lighting are first-rate.", "title": "Superb....Worth It For the Gym and Spa Alone", "user": "TurtleCreekTraveller", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 42530147}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "The gym and spa are top-of-class and far beyond the standard of most 5-star hotels, so enjoy them if at all possible. Occasionally the facilites actually look as good in person as they do on the internet, and that is the case at the Park Hyatt.", "title": "Wonderful hotel and great service", "user": "julia6781", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41883100}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I also found the service to be faultless. Hyatt Gold Passport members, even those not at elite levels, enjoy complimentary morning wake-up coffee brought to the door, and I've only had that experience at the Cape Grace, which is Africa's top hotel and almost 3 times the price. I checked out quite early and one of the desk agents went down the lift with me to point me the correct way to the train station, and it is seldom I experience that level of attention and courtesy in a business hotel.", "title": "Fantastic Hotel", "user": "NewerReviewer", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38172540}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "After looking at the Atlantic and the Fairmont, I prefer the Park Hyatt. It doesn't have the benefit of a lake view, but it is just steps away. While in Hamburg, you might enjoy the Fairmont's small outdoor eatery on the Alster Lake in front of the hotel, and if the weather is nice, the botanical garden and park are excellent. I was there on a warm day, and liked mingling among the Hamburgers who were enjoying a chat or a read in the white adirondack chairs scattered among a central water feature.", "title": "Impressive", "user": "ScanDesign", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37828200}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I have stayed at this hotel in August 2008 (yes, I know it is a while ago), but I can only confirm the great reviews received by this hotel so far. The hotel is located downtown in the middle of a shopping area. The train station is about 5-10 minutes walk, and the river is also about the same in the opposite direction. When the weather is good, it is a very nice stroll :-)The service was excellent, the rooms spacious, clean and very elegant. The bed is very comfortable and the amenities are some of the best I have seen in the hotels of this standard. I had breakfast in the lounge, so I cannot say much about the \"standard\" breakfast, but it was very good. Also the idea that I was able to use free-of-charge internet service in the lobby was very helpful for being able to check emails and doing some research on the surroundings. I have also used the services of the spa downstairs - WONDERFUL. The interior is very tasteful, and the massage is also great for a fair price. All in one it is what I would expect from a nice hotel.", "title": "Wow", "user": "pluskat", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35773979}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "This hotel is furnished in Hyatt minimalist modern style and the quality is excellent - unsurpassed in my experience. The hotel is somewhat quiet, I hesitate to say \"little atmosphere\" but that is what springs to mind.", "title": "Impeccable furnishings and service", "user": "Maxing-n-Relaxing", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13607693, "likes": {"liked": "— Excellent decor and service", "disliked": "— Soft mattress and thin towels"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The service is the best I have received in a hotel - attentive and polite without being obsequious. You couldn't walk through the lobby without someone on the front desk wishing you good morning or good evening. Your name is used wherever possible.", "title": "Top of the line, probably the best in Hamburg", "user": "Justanotherguest", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12687300}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Room service was good. In the restaurant, the staff were extremely attentive, and I was conscious that there was almost always at least one person watching our table in case a need arose or a glass became empty.", "title": "relaxing week end", "helpfulness": 2, "user": "nitzca", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10250476, "likes": {"liked": "— All", "disliked": "— price for parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The room was not particularly large, and the bathroom took about as much space as the bedroom area! The bathroom was thus quite a good size, with a \"wet room\" type shower, L'Occitane soaps and AEG hairdryer. However, I found the towels rather thin - an issue I have only ever seen before in a low priced motel. The mattress was certainly not the most comfortable I have slept on. The way you sink into it (it wasn't very firm) reminded me of a worn out 1* motel mattress.", "title": "Great location", "helpfulness": 1, "user": "BabyGray", "date": "September 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8838611, "likes": {"liked": "— Clean and modern", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Overall, I would certainly stay again. It could be the best hotel I've ever stayed in (aside from the mattress and towels).", "title": "Very good, not perfect", "helpfulness": 1, "user": "dutchcouple", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8738411, "likes": {"liked": "— style, class and atmosphere", "disliked": "— old-fashioned crt tv's with a limited number of channels"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 7, "average": 16, "very good": 92, "terrible": 3, "excellent": 592}, "aka": "Park Hyatt Hamburg Hotel", "slim_ranking": 0.00625, "description": "Park Hyatt Hamburg is located in the historic Levantehaus building near Moenckebergstrasse shopping street offering 252 luxurious rooms and suites. The hotel features Hamburg's maritime legacy as well as contemporary design and amenities. A 1,000 sq m area is dedicated to wellness at Club Olympus Spa & Fitness featuring a 20 m pool, a sauna, a Sanarium, a steam bath, a whirlpool, a fully equipped fitness centre and a yoga studio."}