{"user_rating": 3.5, "review_count": 213, "name": "Park Inn by Radisson Birmingham West", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Location is OK - just off the north Birmingham ring road with on-site free parking and easy to find - but traffic morning and evening rush hour is a nightmare, so allow lots of time to get around.", "title": "Needs a makeover.", "user": "Clarissa_Firebucket", "date": "March 29, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7244935, "likes": {"liked": "— Location", "disliked": "— Outdated ageing tatty interiors."}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 60, "very good": 72, "terrible": 12, "excellent": 48}, "aka": "Park Inn By Radisson Birmingham West Hotel", "slim_ranking": 1.0, "description": "A vibrant hotel ideal for both business and leisure guests; providing 168 contemporary styled bedrooms with plasma televisions, climate control, WiFi and comfy cotton duvets. Fully equipped gymnasium including a 10 metre indoor heated swimming pool, steam room, sauna and spa bath. RBG Restaurant and Lounge Bar and 17 flexible meeting and function rooms accommodating up to 180 delegates.Ideally located at Junction 1 on the M5 giving easy access to the motorway links of the M5, M6, M40 & M42. Sandwell and Dudley Train Station is a 10 minute walk from the hotel giving direct access to New Street Station. Only 4 miles from Birmingham city centre, the Symphony Hall and International Conference Centre. 7 miles to Walsall and only 20 miles from Birmingham Airport and NEC. Ideally located for exploring: The Bullring Shopping Centre, Cadbury World, Black Country Museum, National Sealife Centre, West Midlands Safari Park, Dudley Zoo, Drayton Manor Theme Park, Alton Towers and more.......... 300 Complimentary parking spaces for guests."}