{"user_rating": 4.5, "review_count": 331, "name": "Parmer's Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "This place has many good things about it. It's centrally located between Key West and Bahai Honda State Park. It's quiet at night and has a lovely location on the channel. The cabin we stayed in was cute and had a nice front porch where we ate the dinner we prepared ourselves. Good bed and futon and hot shower.", "title": "Cute but strange", "helpfulness": 8, "user": "KathyNewJersey", "date": "January 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4329323}, {"rating": 5.0, "title": "Just what we were looking for!", "text": "We have 2 chief complaints. I see that many reviewers found the owner's tropical birds charming, but we were struck by their central location, how many of them there were (maybe 20?)in cages and how LOUDLY they squawked, whistled and screeched both at sunrise and sunset.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 5, 2006", "id": 4325559}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "Also, the staff and owners are to be commended for such a quick and complete clean-up after the fall hurricanes (which evidently left them under 4 feet of water). However, our otherwise nice waterfront cabin had a strong musty odor and still smelled of new construction (?) Whatever the smells were, I got a bad headache and aggravated allergies from sleeping there, even with all of the windows opened.", "title": "Excellent Resort", "helpfulness": 7, "user": "skyrydr1", "date": "October 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4038937}, {"rating": 5.0, "title": "Loved Parmer's Resort", "text": "My husband and I enjoyed a week in January 2004 and two weeks last January at Parmer's. In fact, we booked the adjoining smaller room next to us for four nights last year and invited our son, daughter-in-law and our grandson to join us. This is a clean, down home type place. The staff at Parmer's could not have been nicer or more accommodating. Granted, there are more luxurious (and pricey!) places to stay in the Keys, but we like Parmer's for what it is...just a nice place to stay and see the Keys from. We'll go back again when circumstances allow.", "helpfulness": 5, "user": "Bosatsu", "date": "September 29, 2005", "id": 3970125}, {"rating": 3.0, "title": "Comfortable hideaway", "text": "We held our daughters wedding reception on the main lawn of Parmer's Resort in May, 2004. The management and staff could not have been more helpful. Our entire family (both sides) stayed at the resort and were more than satisfied. My wife and I shared a two bedroom, two bath cottage with a full kitchen and living area with our other daughter and her husband. Cleanliness was NOT an issue as the cottages and rooms were all spotless when we arrived. The resort's swimming pool was clean and refreshing. The seclusion of the resort (away from the main highway) made it a comfortable and quiet place to stay. The birds scattered throughout the compound added to the ambiance of the resort and made it even a little more tropical. They were quiet at night and were not disturbing even during the day. The continental breakfast was generous. We will stay here in the future as the location and rates are most advantageous.", "helpfulness": 9, "user": "m5165", "date": "June 14, 2005", "id": 3550288}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "My husband and I stayed at the Parmer's only one night on our way to Key West. It was a last minute check-in so the only room left was $89/night and in a building across the street on the second floor. We were actually quite surprised at how cute and clean it was. It had a balcony with a table and chairs overlooking the street. The hotel is on a dead end street so there is not much traffic going by.", "title": "A nice little place!", "helpfulness": 12, "user": "travelmom07", "date": "April 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3420958}, {"rating": 5.0, "title": "Can't wait to return to Parmers!", "text": "Unlike the review below, I quite enjoyed the \"noise\" of the beautiful birds and had fun in the water aerobics class! The continental breakfast was OK - the fresh fruit was nice. The pool is small, warm, and very clean.", "helpfulness": 8, "user": "sunnfun4u", "date": "April 21, 2005", "id": 3396003}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 18, "average": 27, "very good": 85, "terrible": 5, "excellent": 196}, "aka": "Parmer`s Hotel Little Torch Key", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "5 waterfront acres, owner on site, spotless rooms, lush tropical landscaping, regular rooms, luxury suites, villas, crystal clear pool, excellent service, hammocks, barbeque grills, tiki huts, lighted boat basins, great sunrises, huge continental breakfast, yoga, water aerobics, massage, putting green, hot tub suite."}