{"user_rating": 4.5, "review_count": 109, "name": "Paros Bay Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Wonderful position, staff so friendly and helpful. We were delayed due to ferry strike and only arrived at 5am the foll morning. We were met with delicious coffe and the most superb sunrise ever. Breakfast was spectacular and Chenko drove us into town each morning for 1 euro each, together with wonderful laughs and stories aloing the way.", "title": "Magnificent hotel and will definiyely go back", "helpfulness": 1, "user": "vixCapeTown", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116594444}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Strongly recommend and longing to go back.", "title": "best place, best people", "user": "carlosviajando", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116199221}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I organize special trips for small groups. On one of my trips to the greek islands I decided to visit Paros, and on my search for a hotel, having to deal with a lot of requests to have all my clients happy,after a lot of research, I found paros bay.", "title": "Lovely lovely lovely!", "user": "Ammaio", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115792049}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "couldn´t be happier!!!!", "title": "Nice hotel - a good choice to make", "helpfulness": 3, "user": "JohnChrys", "date": "July 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115751254}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It is a must hotel on your visit to Paros.", "title": "Excellent hotel", "user": "Abrahart", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 81820816}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My friend and I spent one week at this hotel. We were looking for a relaxing week on Paros after much site seeing. The hotel staff were friendly and helpful, especially Ester - she was lovely! On the first day, we were a bit annoyed because of the internet. We stayed at this hotel specifically because it had WiFi and were needing to do work during our holiday. The first day the WiFi didn't work at all. We were told \"this happens sometimes\" but I think that the management needs to get the strength of the signal looked at by the company because it would connect to our devices but then no pages would load. Luckily the next day the internet was working so we were relieved. We still had to go to the reception area to use it, rather than our rooms, but we were grateful that it was working.", "title": "Good stay at Paros Bay", "helpfulness": 2, "user": "LauraHutton", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 135931543}, {"rating": 2.0, "title": "Paros Bay - My personal opinion", "text": "The pool is fantastic. We really enjoyed using the facilities there. The location is good - it has a lovely view of Paros. We didn't mind walking to Parikia for dinner but it is a bit of an unsafe walk along a main road. I wouldn't recommend it for elderly people or families with children - so I would get a car if I were you.", "helpfulness": 4, "user": "alex m", "date": "June 5, 2012", "id": 131323409}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The rooms themselves could do with a bit of an update but were comfortable and clean. We were happy with them. The cleaners did a great job tidying every day. Beds were comfortable and sheets were clean etc.", "title": "Great views - friendly staff", "helpfulness": 2, "user": "JCBerkshire", "date": "September 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118780482}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Breakfast was really good, good range of foods so I was really happy with that. The dinner on the other hand wasn't great - the pasta was quite tasteless so I would advise a chicken salad because that was nice!", "title": "Fabulous hotel, wonderful staff, superb views!", "helpfulness": 1, "user": "sue a", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116869423}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The only other thing I can suggest to the hotel is to maybe change up the music a bit! I know it is a minor thing but when you are there for a long period of time, the music was a bit loud and repetitive near the pool and in the reception.", "title": "Controversy", "helpfulness": 1, "user": "Soulslide", "date": "August 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 116863790}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This was one place that you hoped and prayed would be as good as you read and it doesn't disappoint!", "title": "Well priced property with great service", "helpfulness": 2, "user": "NairobiGirlOH", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 162149138}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "My girlfriend came in with her family and were staying at Paros Agnanti Resort. We ended up paying the same price in 1 week that they paid for 1 night!! Paros Bay included a lovely breakfast every morning with quiet grounds and rooms...it truly felt like a resort without the fee.", "title": "Luxury at a great price!", "helpfulness": 1, "user": "Christie W", "date": "October 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 141978150}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Walking distance to the beach and a great bar/cafe on the beach...I highly recommend spending the afternoon at that restaurant but I also recommend checking out Krios beach since it was cleaner and nicer.", "title": "JUST WONDERFUL", "helpfulness": 1, "user": "Jdimos", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140170374}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Staff were friendly and I wouldn't hesitate to go back!", "title": "MAGNIFICO. 100% at optimum price", "user": "pompresse", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139152547}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Overall we were very impressed! We are travelling on a tight budget so to be able to stay in such a gorgeous place for such affordable prices was fantastic. We were picked up from the ferry free of charge and had such a cheerful welcome at reception. We had a sea view room and were given 615 which in my opinion would have to be one of the best as it is right on the end so you have unobstructed views out across the whole point and no one looking in at your balcony. Does mean that the wifi signal didn't always work but you can always sit in the lovely bar lounge area or by the pool to get that. I understand people's comments that the rooms and bathrooms are a tad tired and could do with a spruce but they are nice enough and always cleaned daily. The rest of the resort is lovely everything is modern and so clean. The staff were very friendly and helpful. We were very impressed with the quality of food and drink available and for such good prices. The royal mojito is a must! The food at the restaurant is all around 7-8 euro and very good quality. The chocolate souffle is insane we had it every night and only 3.90!!! Unfortunately as we were there in low season a lot of bars and restaurants were shutting down and hatrojan through without warning the restaurant closed at the hotel which was really disappointing as it was so great! I would definately say a car or scooter is a must walking wouldn't be fun. We got a quad for a really good price through the hotel 17euro a day and it got dropped off and picked up. If you have had some experience on a quad it's better here then a scooter as it can get windy on the roads and many roads are quite rough so a quad gives more stability. We took the quad to naoussa which was well worth it and to some lovely recommended beaches. The small beach next to hotel isn't great as perhaps due to the wind there was quite a bit of rubbish in the sand and water but about 2min drive on the quad is parasporos which was stunning with great loungers. We were blown away by the beaches we went to with the most pristine clearest water I've ever experienced! Also I would recommend cactus Mexican restaurant to the right of the windmill further around the bay in parikia. Also a good self service laundry behind it called wash and go very clean and fine prices and free wifi while you wait! I would absolutely recommend this hotel and would stay there again although perhaps at the beginning of September rather then the end when everything shuts down.", "title": "Heaven on earth...", "helpfulness": 1, "user": "Javier C", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138342665}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This hotel is ideal for anyone wishing to visit the island of Paros, being close enough to the main town/port of Parikia, but without being right in the middle of everything.", "title": "Lovely hotel, and really helpful staff.", "user": "JamesandNichola", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78670382}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Paros Bay hotel is a 20 min walk from the centre of town, situated on a headland overlooking the beach. The walk to town during the day is fine, but not safe at night as there aren't proper pavements/street lighting in places.", "title": "Nice hotel..shame about the service!", "helpfulness": 1, "user": "dubber5", "date": "August 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 77512904}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The breakfast is fine, the rooms have all you need and there's a lovely swimming pool area too.", "title": "Beautiful hotel in a quiet location", "user": "ants27", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 77466289}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The ladies on Reception were fantastic. We had pre-booked for 2 nights, but then couldn't arrive because of a ferry strike. The hotel amended our booking, without charge, to allow us to still have both nights. We were so impressed with the hotel that we ended up staying for 6 nights.", "title": "Charming Hotel, great view", "user": "Pao65", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75304124}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This hotel is a definite recommend.", "title": "Nice, friendly, quiet hotel with walking distance to Parikia", "helpfulness": 1, "user": "Phrederic", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72353875}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 2, "variance": {"poor": 3, "average": 9, "very good": 41, "terrible": 2, "excellent": 54}, "aka": "Paros Bay Hotel Parikia", "slim_ranking": 0.227272727273, "description": "All studios are spacious and the use of a portable bed for childs can be accommodated. Just let us know and we will take care of it!The spacious yard and garden and the lovely verandas provide you with the opportunity to choose where you want to relax, sun, shade, enjoy your meals, or just contemplate the nature and the sea view.Warm and friendly service combined with authentic tradition is provided daily by the Arokaria Team"}