{"user_rating": 4.0, "review_count": 460, "name": "Patra Jasa Bali Resort & Villas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Due to our flight being cancelled 2 days before Christmas, we were put up by the airline at The Patra. (One of the hotels i have always looked at staying at)", "title": "Seemed Great", "helpfulness": 1, "user": "HeidiandKeith26", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155382466}, {"rating": 4.0, "title": "Terrific first impression of Bali", "text": "As it was around midnight when we checked in we pretty much showered and went to bed. The room we were given was huge.We were Upstairs, bedroom had a king sized bed, Bathroom was also very big with corner spa, shower and toilet.", "user": "remeisas", "date": "March 20, 2013", "id": 155140538}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "A very early rise to get our plane the next day we headed down for breakfast where it was packed!! Seating was inside and outside.", "title": "a good family hotel", "helpfulness": 1, "user": "Dom073", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154710578}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The pools looked amazing, i noticed there was one pool for the Villa guests only which i think is only fair! Staff seemed friendly, beach was right at your doorstep!", "title": "Pricey, but a great stay", "helpfulness": 1, "user": "Lamb891", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154473836}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "It is very close to the airport, however did not hear any planes at night - more than likely as we were completely buggered!", "title": "Tranquility and beauty", "helpfulness": 1, "user": "martyandbobbie", "date": "March 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154126845}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We were in transit from Europe on our way home to Perth and our travel agent booked us into this hotel for a night. The first hotel in the world I have been to that charges for ice. We only had enough Indonesian money for our departure tax and taxi ride to the airport but were forced to pay cash for our room service. Why we bothered I don't know as the food was inedible. We had a very old room which wasn't very clean. Would definitely never stay there again. I have been to Bali before on many occasions and have never stayed in worse hotel.", "title": "Don't do it.", "helpfulness": 1, "user": "Kathy C", "date": "July 5, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 166462394}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I stayed at dlx suite room for three nights with my two boys. It was a lovely stay. The room were big enough for the three of us. It well set up and clean. The best swimming pool that I uever seen before with a friendly staff make a great holiday. Also the food was fantastic taste,one of the pool bar facing to the beach. We will definitely back again here.", "title": "Friendly staff", "helpfulness": 1, "user": "Deva28908", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164569730}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "After staying here last year, I returned to the Patra to again be greeted by the same warm smiles and friendly staff.", "title": "The Patra again lives up to expectations", "helpfulness": 1, "user": "GeezerInOz", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 164454246}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I did say that I would be back and I was true to my word.", "title": "I need of renovation.", "user": "Kevin P", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 163833028}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed in a Deluxe Suite and it was as big and spacious as I remember it. The old CRT TV's have been replaced with new flat screens, as the hotel continues to gradually improve things. We were provided with a welcome letter from the Management and a sorong for my wife and myself as a welcome gift. I also noticed that the hotel is in the process of rebadging itself as the Patra Jasa.", "title": "Excellent resort", "user": "Jane L", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163243076}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Due to an overnight canceled flight with jetstar on 27th april 11 oclock at night we were shuttle bus a whole plane full of us it was quick we were given a twin deluxe suite all marble bathroom exquisite loved it were given an evening meal morning time came around far too soon but wait breakfast was first class then we wondered what we were going to do until jetstar had our flightbooked for that night back to Darwin at 11 oclock, swim up bar was just beyond our wildest expectaion so warm and then a lazy afternoon on a day bed on the beach massage (at our expense) the resort was beyond what we would pay but it was the best thank you jetstar wouldn't travel with n e one else very friendly staff bintan 4.50 bit pricey but it was fab", "title": "canceled jetstar flight", "user": "Jennifer C", "date": "June 4, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 162941264}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The Patra is probably one of my all time favourite Hotels in Bali, It is in South Kuta however is away from the hustle and bustle of Kuta. Out of all the Hotels I have stayed at in Bali, and I have stayed at about 5 or 6 now, I have found the staff to be the most friendliest and helpful, nothing is ever too hard for them. The Deluxe Suite is where I stay when I travel with the family, it is certainly big enough for 4 people and is very tastefully decorated. If I have travelled with girlfriends, the Deluxe Room has also been plenty big enough. The gardens are superb, and its more like you are staying in Villas than a Hotel and is very quiet as they are away from each other. It is an extremely large Hotel so if you don't like to walk much, I recommend you ask for a room near the Pool, and the Pool, well that's another thing, it is massive, has a swim up bar and overlooks the ocean. The Patra truly is a beautiful Hotel. The breakfast is very good with a large variety and the Salmon Pizza is the best Pizza I have ever had. There is a kids club however, I find the Patra to be so kid friendly anyway, my two boys have never been there. The staff always have pool activities going on or beach soccer, so there is always plenty to do. You can walk out the back along the beach to the main shopping centre in Kuta and takes about 15-20 minutes, is very hot though. A cab will cost you about 20,000 rupiah or a Hotel car 25,000 or there is of course the free shuttle bus that goes into Kuta every 2 hours, you do need to book this though.", "title": "5 Times Stayed and won't be the last.", "helpfulness": 1, "user": "233Karen", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162049741}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The only problem with the Patra is that there are no other restaurants just outside, so you have to either eat in the Hotel, one of the other Hotels on the way into Kuta or Kuta itself, but that's no problem.", "title": "Good hotel", "user": "Matt O", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161260768}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "See you again soon Patra. :)", "title": "Beautiful Relaxing Resort", "helpfulness": 2, "user": "Michelle B", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160024157}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed here for one night on the way to seminyak and was upgraded as I have stayed before. The pool area is really good with a swim up bar and if you can afford the Villa area has their own private pool.Nice and quiet hotel just out of kuta but you can still walk in.", "title": "There is better", "helpfulness": 1, "user": "saltpan", "date": "April 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 159293336}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "This is not the type of hotel i would normally stay in but thanks to a cancelled flight the airline put us up here. Everything was beautiful. Gardens, rooms,lagoon pool and especially the staff. I only had one day there so could not take it all In. There was a lovely atmosphere from the restaurant as it overlooks the lagoon pool and onto the ocean. Great variety of food provided in the buffet put on for the cancelled flight guests. I did order the duck and vegetable roll for entree and found it be disappointing. The duck breast was dry and the flavour was not as intriguing as promised in the menu. The staff were helpful. Polite and friendly. My room was fantastic and that shower it was like showering under Niagara Falls. Also the luxury of not having to climb over a bath to have a shower. The only disconcerting was the service charge added to almost everything. Watch out for this as it can make something quite expensive once you add the additional tax charge in total 39%. The service provided by the restaurant staff was exceptional without being intrusive. They seemed to appear whenever you needed them but until then you would not know they were there.", "title": "Beautiful resort sheltered from the the hustle and bustle", "user": "Joanne P", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159081008}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "They had rooms to suit everyone but even if i could afford to stay there again i dont think i would i like things a things a bit simpler but no complaints", "title": "Great hotel for families", "user": "Anissa U", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158715766}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband, 2 boys and myself come to bali every year and spend at least 1 week at Patra Jasa, this would be our fourth time here this year. What I like most is the position, it is quiet and peaceful, really pretty and you can still buy clothes, necklaces etc off the small amount of street sellers compared to the rediculous amount of people trying to sell you things in Kuta & Legion. There is great restaurants along the beach front path, Patras food is great too. The rooms are fantastic, nice and clean and comfortable. I recommend this hotel, come and spend your next holiday here, love it. For surfers its great too as Airports left is just right out the front.", "title": "Great Hotel, 5 minutes from Kuta town", "user": "josemoli", "date": "April 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156420169}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We went on honeymoon, we loved the hotel, its garden and cottages, breakfast, swimming pool, guest service.. We also liked that it was 5 minutes by taxi to Kuta and its restaurants and shops. The beach wasnt the nicest one but for being 5 minutes from Kuta it was ok. We also rented a motorbike in the lobby and we had it in 5 minutes for 6 US dollars a day.", "title": "A detailed, balanced review.", "helpfulness": 3, "user": "skiggy", "date": "March 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 156109316}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We (party of 10) managed to get a Travel Zoo deal for a few Deluxe Suites for about AUD92 per night (including breakfast) and for that price it was excellent value for money.", "title": "Great Pool and Gardens", "user": "flashbear", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 155957466}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Kuta"}, "stars": 4, "variance": {"poor": 27, "average": 68, "very good": 166, "terrible": 11, "excellent": 188}, "aka": "The Patra Bali Resort & Villas Hotel Kuta", "slim_ranking": 0.1625, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}