{"user_rating": 4.5, "review_count": 242, "name": "Patria Palace Lecce - MGallery Collection", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Location is excellent in the centre of the historic quarter of Lecce with everything within walking distance including many good bars and restaurants.Hard to find by car however. It's the only hotel with its own signs from the outskirts and they need it. Car was looked after for us(at a charge) by pleasant staff.The first room we were shown to was unsatisfactory being a small bedroom but with a huge conference type room attached. We requested and were given a much better room in line with our booking. Room was very comfortable and spacious. Bathroom had a number of little faults which took the edge off.Breakfast was good but not special but staff were always couteous.Good value for money overall.", "title": "Great location in centre of a wonderful city", "helpfulness": 2, "user": "Geordieboy60", "date": "October 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119365444}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I can't say enough good things about the Patria Palace......old style courteous and personal service, beautiful art-deco style rooms, a window overlooking the most beautiful church in Lecce......and all right in the middle of the Historic center of this charming Baroque city.", "title": "a bit of affordable elegance in rustic Puglia", "user": "Joan M", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118866649}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We were in fact upgraded to a \"jr. suite\" which was incredibly spacious and beautiful; although I'm sure the regular rooms were also very nice. The breakfast buffets were bountiful and delicious; we also had dinner at the hotel one night, which was excellent. We ate outside in a small garden patio, candlelit, romantic...we could see the foot traffic come and go; the bill was slightly more than the usual trattoria, but the service was impeccable and the food delicious. Well worth it.", "title": "Great Location", "user": "1954Elizabeth", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115976753}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The only problem is if you are driving, it's not that easy to find the hotel....however, numerous signs put up by the hotel around the city center help you navigate. Another plus is they will put the car in their garage and bring it out when you need it again. And anyplace in the city you want to visit is just walking distance away.", "title": "Splendid old style hotel in the middle of Lecce. Comfortable room. Good restaurant.", "user": "GuidoF", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115910798}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This is a great four star hotel in the heart of historic Lecce.", "title": "Excellent hotel in the heart of Lecce", "user": "E_travellers_10", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115210653}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Right in the heart of Lecce lies this top notch hotel. A very nice bar is facing you, just past the reception desk, as you enter and a welcoming drink, gratis, was provided. A nice touch as we checked in. The city is a delight to walk through but you can also use one of the free bicycles that are available at the main plaza; and since this hotel is only 3 or 4 minutes from the plaza, the bike becomes a very convenient way to tour. The rooms are clean and the wi-fi user friendly. The only concern we had was that my wife left her sunglasses on the table by the reception desk as we checked in and when we missed them, about 10 minutes later, they were gone. That's not the main problem: We didn't sense any real concern by the staff other than the fact that no one had turned them in. Not a real negative, because things happen, but a little blip on the radar. That said, my wife left her wallet in the safe and when they discovered it they called ahead to our next hotel, confirmed we were staying there, and sent it to us. That is great service!!", "title": "Comfort in the City", "helpfulness": 1, "user": "tojo25", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129787471}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed two weekend nights in early April, perfect cool sunny weather for wandering around the city but the hotel may not have been quite up to speed.", "title": "Grand hotel but not so good out of season?", "helpfulness": 2, "user": "Haemtraveller", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129085506}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel is in th old town centre and driving to it can be disconcerting because one drives through pedestrianised areas. The road in is on the right, just as you come to the end of the castle on your left, from then on, watch for signs, the final jink is to go through a barrier between parked cars. The hotel will park your car for 10 euros a day, well worth while.", "title": "Lecce's best", "helpfulness": 2, "user": "BobConklin", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125422758}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We had a third floor room (302) with a balcony, which was large with good furniture. There was a view of the top part of Basilica Sta Croce, which is about 100 m away but partly obscured by other buildings. The room was fairly standard, clean and comfortable.", "title": "The best Hotel in Lecce", "helpfulness": 1, "user": "Yvonne B", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120856426}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Breakfast buffet was good with friendly staff. Eating in the hotel at 8:30 pm on a Saturday evening was a disappointment; there were no staff and when they appeared we did not receive the best service, the \"local soup\" was good but the fish was average and served on cold plates. A reasonable wine was recommended but I would have liked to see the wine list. One other group of 4 arrived for a meal and it may be that we had a poor experience because we were there out of season and the restaurant was so quiet, it was closed on Sunday but we would not go back again.", "title": "Great location and excellent hotel", "user": "kcwn76", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120295102}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Definitely one of the nicest hotels we've ever stayed in.", "title": "Quiet Ellegance; Lovely Spot", "helpfulness": 4, "user": "GoGirlToo", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148848768}, {"rating": 4.0, "title": "Great location, facility, and service", "text": "Old-fashioned charm, lovely rooms kept very clean by", "user": "Piero M", "date": "January 4, 2013", "id": 148845568}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "sweet housekeepers,very good (though pricey) restaurant", "title": "Great Hotel, Great staff, Great location. Great!", "helpfulness": 2, "user": "Smifffy22b", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145866358}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "and an absolute dream of a breakfast buffet. Not to", "title": "Splendidly positioned for a walk round the old town", "helpfulness": 2, "user": "DavidHBerkshire_UK", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145575766}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "mention a perfect central location just off the central square", "title": "really really nice", "user": "annaritang", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145131174}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Patria Palace is very conveniently located for exploring the old city, which is beautiful. It is approximately a 20 minute walk from the bus station and train station - about half way between. We had booked a double room, the only one I could get when I went online, and were given a pleasant double room with a lovely large bathroom. Unfortunately, it looked out on to a flat roof and walls so we asked to change, which they agreed to only reluctantly, I felt. We had to pay 20 euros a night extra for a slightly bigger room with a very narrow bathroom, which only had a shower. It did, however, have a view of the church and piazza, which was a great improvement. It also had a small balcony. The marble in the bathroom was impressive though the shower was never hot and temperature was inconsistent. The reception staff were not particularly friendly and gave us no information about anything, including when and where breakfast and dinner were. We had to ask and if I hadn't seen on the Internet site that there was a roof terrace then we may never have found it. It was a pleasant enough area but did not have a particularly good view of the city. The information in the room was also poor. Both breakfast and dinner were very good. There was a good choice at breakfast, including fresh orange juice and coffee plus the biggest selection of teas I have seen in a hotel. Dinner was well presented and nicely cooked - and portions generous. The waiters were more friendly and helpful than reception, though the porter was welcoming. Overall, it was a very comfortable hotel, well located in the centre but I wasn't impressed by the attitude at reception.", "title": "Excellent location in old city centre", "user": "bonetDumfries", "date": "October 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141868150}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had three nights here and had an excellent room with enormous balcony and a view.Well worth trying to get one of these third floor rooms.The staff were efficient and friendly.Your car was parked and the hotel well signposted.Breakfasts were outstanding.Neither could it be better positioned.Not cheap but sometimes the extra is worthwhile", "title": "Difficult to find fault", "helpfulness": 1, "user": "S M", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141845361}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed with Patria Palace Hotel for almost ten days and were very happy with our choice. Beautiful building in the very heart of Lecce, spacious and beautiful rooms, superior breakfast and fancy dinner. But all of it was small next to the quality of service we got. Whatever we asked was done fast and efficient. Great work!", "title": "High class service", "user": "Anton H", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141448019}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "My husband and I stayed here for 2 nights as part of put honeymoon. Our room was v comfortable and the location is great. The parking facilities were also very good. The service let the hotel down though, definately not 5 star service. No information was given to us upon check in about the area or general hotel information and there was no information provided in the room. One afternoon we sat by the bar in reception for some time waiting to be served and had to ask someone to serve us after about 15 minutes even though we were in full view of the reception staff. Not really what we expected from a 5 star hotel. Would probably try somewhere else on our next visit to Lecce.", "title": "Not 5 star service", "helpfulness": 1, "user": "LPJcardiff", "date": "September 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 141035884}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Lecce is a lovely city and this is a great hotel right at the heart of it. The room was wonderful. We chose a room with a private terrace with a view of the city's roof tops, which was lovely and provided a nice back drop as the sun set at the end of the day. The rooms were clean and the bathroom spacious and well presented with a good range of complimentary toiletries. The breakfast was varied and good with an excellent range of teas, fruit, bread etc. On the, small, downside I thought the bar area was unappealing and the staff were formal and polite, rather than friendly and welcoming. On the whole I'd definitely stay here again.", "title": "Lovely hotel", "user": "2wheeltravels", "date": "July 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135642130}], "location": {"country": "Italy", "region": "Puglia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 4, "average": 13, "very good": 94, "terrible": 2, "excellent": 129}, "aka": "Patria Palace Lecce", "slim_ranking": 0.391304347826, "description": "Baroque-style Hotel housed in princely palace dating from 1780; original artistic beauty harmonizes with modern comforts."}