{"user_rating": 4.5, "review_count": 125, "name": "Pazo Los Escudos Hotel and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This is a 5 star hotel in all areas. The room was luxury design and decorated to high specification. The bed was big and very comfortable (2 ft * 2 ft) with beautiful bed linen, a large bathroom with Bulgari bath products, Bang & Olufsen electrical appliances, luxury garden furniture on the balcony etc. etc. We dined 2 evenings in the restaurant and the food was excellent. I would recommend this hotel to anyone visiting Vigo. We will definitely be back.", "title": "Pure Luxury", "helpfulness": 1, "user": "pattieTheNetherlands", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69659419}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "Back in 2006 I went to Vigo for a few days and I stayed at Pazo Los Escudos Hotel. When I arrived, I went to front desk and, while I was checking in, I noticed the very modern design and quality of all the lobby. Then I went to my room which was very luxury... Huge room, huge beds, huge bathroom (which was filled with Bulgary products like shampoo, soap, ...). The breakfast of the hotel was also excellent with a wide variety of foods and drinks. The hotel also has a great garden where one can go for a walk. The hotel is not in central Vigo but with a car one can arrive there fast (maybe 10 minutes away). Overall, I recommend this hotel to everyone who wants to stay a few days at a true 5 star hotel.", "title": "Great hotel... Very luxurious", "helpfulness": 2, "user": "Mup3t", "date": "September 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20191573, "likes": {"liked": "— The entire hotel", "disliked": "— Nothing..."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Fantastic hotel, Well equipped luxurious rooms, we stayed in the \"old\" part but were not lucky enough to have a good view. Breakfast had a good selection of foods and we took it out on the terrace for the 2 days we stayed there. We also had 2 good meals in the hotel restaurant which we were told had a new chef and as hotel guests were given a 10% discount which we felt made it good value. The service throughout the hotel was attentive and friendly.", "title": "Pure Luxury", "helpfulness": 1, "user": "pattieTheNetherlands", "date": "July 23, 2008", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18159192}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My boyfriend and I spent two unforgettable weeks in this hotel. We were very relaxed and returned to Poland nice and refreshed, and awed by the delightful landscapes. We were amazed beyond our expectations with this hotel. We couldn't have been pleased enough from the professional service given to us by the hotel's staff (especially the cook who prepared the breakfast and buffet everyday). Also, surprisingly enough, the prices which covered all of these were not bad at all. We would strongly recomend room 306 where we stayed, it was very lovely and had an astonishing views of the river.", "title": "It´s a fantastic place!", "user": "Marzena01", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16079631}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "It has been more than a year since I stayed at this hotel, but I just looked it up and thought it would be nice to have some english comments on the page. I will attempt to add some pictures as well if I can.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "uncleharry79", "date": "February 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 13701562, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}], "location": {"country": "Spain", "region": "Galicia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 4, "average": 10, "very good": 27, "terrible": 1, "excellent": 83}, "aka": "Pazo Los Escudos Hotel Vigo", "slim_ranking": 0.0652173913043}