{"user_rating": 4.0, "review_count": 157, "name": "Peak To Peak Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "For a motel, this is a good option. The actual building and rooms aren't going to win any beauty contests, but it was good value and is only couple of minutes drive from the centre of town. My room was quite big, clean, the bed was very comfy, and it had a TV + air con. The place is owned/managed by a Swiss guy who was very helpful/friendly. If I was being picky, the free wireless was a bit unreliable, and the shower could be a bit more powerful, but overall, I was very happy with my choice (stayed for 3 nights).", "title": "A Good Choice", "user": "Clownf1sh", "date": "July 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 69367482}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I really enjoyed my stay at this lodge! It was very clean, the hosts were friendly and knowledgeable about Estes Park and the surrounding area, and the lodge is conveniently located near downtown. The swimming pool and jacuzzi were clean and very relaxing after a day of hiking! I will most certainly be staying here again!", "title": "Best kept secret in Estes Park!", "user": "sandyf_131", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69143516}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Was greeted by a friendly man and woman at reception, they were very welcoming and without me needing to ask I was given information about where to go for food, information about the national park etc. I was very impressed by this. As for the room, some recent reviews have said the room was dated, although I feel it's more the case they are trying to give the impression of a mountain lodge sort of place. Anyway the room was clean and comfortable, and I think the bathroom was refitted recently. The motel has a nice pool and hot tub, and the Wifi worked fine for me. The only (small) criticism is that you can't reach the toilet roll from the toilet, although maybe Americans stand up to wipe, in which case this would not be an issue! I would stay here again if I needed a room in Estes Park, and would reccomend it to friends.", "title": "Friendly, clean place with character!", "user": "rtl2", "date": "June 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 66928724}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My husband is hard of hearing and was watching a movie with louder volume at 8:30 at night. The owner came and banged on the door and very rudely let him now the TV was too loud. This after we were woken up by screaming children running in the halls! I am fine if if an owner needs us to turn the volume down, but we paid to stay here and would have appreciated a different tone being taken with us. Business owners need all tenants to be happy and we are understanding of that, but we were not aware of the noise issue, and would have appreciated a nicer tone and a please and thank you since we are paying customers!", "title": "RUDE owner and reminds me of cheap, poorly kept apartment!", "user": "coloradococoon", "date": "June 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 66564521}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Also, the sound issue is because the Inn is old and very clearly not insulated for sound the way most motels are. It feels more like an old, poorly kept apartment building as opposed to a nice motel. The room also smells really musty. Pay a few extra bucks and stay where your money and business is better appreciated!!! I can assure you we are not coming back here and the sad thing is, we are not even picky about places, but I don't like a rude attitude from someone I just paid over $400 to! We come to Estes Park all the time, next time I will make sure to pick a place with more appreciative owners!", "title": "Just OK", "user": "traveldoc42", "date": "October 15, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0}, "id": 46965181}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I have to say that I was a bit nervous when I booked -- the motel was less expensive than others listed -- so I only booked for the first night I'd be in town, just in case. What I found was a friendly on site owner and a room that was clean and comfortable and I felt very safe there as a woman traveling alone. There was a microwave and a fridge and of course a TV (cable but not a lot of channels but who cares, I wasn't there to watch TV anyway).Things were freshly painted. It's not brand new or luxurious but it is a solid place to stay. Oh, and I liked it enough to book the rest of my stay there -- and I'd go back. Very convenient location.", "title": "Good value, friendly staff, comfortable, and VERY clean", "user": "Peaceful2009", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 44781889}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We have been spending our two-week August vacations at Peak to Peak Lodge for over six years now and keep coming back because:", "title": "We stay here every summer!", "user": "HikerWestOrange_NJ", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41900805}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "- the place is spotlessly clean", "title": "Very clean and helpful staff!", "user": "TPooch", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39162047}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "- service is friendly and reliable", "title": "Great Place! Very clean, accomodating, friendly and affordable!", "user": "jenkenne", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38665759}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "- location is great, with views on Longs Peak", "title": "Great value for Estes Park", "user": "free_at_last", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 38363433}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "~N40* 22.315 & W105* 30.401~", "title": "~GPS Coordinates Included~", "user": "PikesPeak_63", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77676463}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I stayed here for a couple of days, and played around in Estes Park, for the fun of it, and thought it to be a very reasonable, quiet, pleasant place to stay. WiFi si available here. The employees are all very polite, and courteous. I have no idea where any negative reviews are coming from (Texas is as Texas does I guess).", "title": "A large, quiet room in a nice location, not far from downtown Estes Park", "user": "mtnpacker", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76749960}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I threw in the GPS numbers in case anybody needs help finding this place since it is just about a good mile from the downtown public library with free internet access upstairs to use.", "title": "I will go back there!!!!!!!", "user": "whiner49er", "date": "August 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 76088526}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed in a large comfortable room with a king sized bed at the Peak to Peak Lodge. There was a bathroom with sink, shower and tub. We also had a full kitchen with four burner gas stove, sink, and microwave. The kitchen even came with cabinets, filled with glasses, mugs and porcelean dishes. The unit had air conditioning and heaters to keep the room temperature comfortable. We were able to park our car right outside the unit, which was very convenient. The hotel units form a \"U\" shape, with parking inside the \"U\". The lodge also had a nice pool and hot tub, though we didn't have time to use them, since we spent so much time in Rocky Mountain National Park. The owners were very welcoming and helpful. We slept well here and enjoyed the peace and quiet during our stay. Though this property is older than some hotels in the area, it is well maintained and very clean. We will definitely stay at Peak to Peak Lodge again when we visit Rocky Mountain National Park.", "title": "Unbeatable value", "helpfulness": 1, "user": "tlbond", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 73679156}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Nice clean rooms, comfortable beds, and the nicest owners. What an enjoyable trip. Close to town and very quiet.", "title": "Good value", "user": "AustinHiker", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69597696}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We chose Peak to Peak Lodge because it did not have a 2-night Saturday stay requirement and the rates are reasonable for the Estes Park area. It is on highway 7 - not difficult to find. It is a basic no-frills place but was clean and well maintained. Since we are vising RMNP and not looking for luxury, it met all of our needs where it mattered. The beds are comfortable, the room itself was spacious and the bathroom though small was pleasantly decorated, the bath linens are clean & white and the shower was strong.", "title": "Clean and no frills", "helpfulness": 1, "user": "sarah4nil", "date": "October 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81991651}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Lily Lake is just a few miles south of the lodge. There is also a Safeway grocery store within a few minute's drive.", "title": "Good price, so-so rooms", "helpfulness": 1, "user": "nysingle", "date": "October 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 81820952}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Estes Park rooms are expensive, and Peak to Peak is one of the least expensive options in the area. The motel itself is average. The owners and staff are very nice and obliging. There is a soda machine, laundry (I think), free wifi (very pokey at times), and a pool. Every hotel in Estes Park has a \"mountain view\" so it was nothing special. However, there is a house nearby that seems to be frequented by elk almost daily at sunrise if you're into that sort of thing.", "title": "Quaint place to stay", "user": "70mimi10", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80951600}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I didn't like my room. It was a little small and poorly laidout. Although the microwave and fridge worked fine, there was very little desk space. The TV was old and had few channels (no TBS, e.g.).", "title": "very comfortable, clean and reasonable", "helpfulness": 1, "user": "evets379", "date": "September 19, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 80160044}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I liked the location. It is on rt 7, away from town center, so it's a bit quieter while remaining very accessible (a minute or two into town). There are restaurants and gas stations nearby, but no groceries. You have to drive to get breakfast in the morning.", "title": "One of the very good older motels", "user": "Saber9", "date": "September 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79711164}], "location": {"country": "United States"}, "variance": {"poor": 6, "average": 18, "very good": 68, "terrible": 10, "excellent": 55}, "aka": "Peak To Peak Hotel", "slim_ranking": 0.620689655172, "description": "We are a family oriented, affordable and clean Motel in Estes Park. We have single bedrooms, studios with kitchenette and family units with 2 rooms for up to 8 people. Upstairs we have 3 nice Suites with private balconys and a gorgeous mountain view. Enjoy our heated pool and BBQ Grill area. Our motel is ideally situated, 5 miles to the RMNP and 1 mile to town. We are close to restaurants, golf and Fairground."}