{"user_rating": 4.0, "review_count": 81, "name": "Pear Tree Inn Overland Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Giving the benefit of a doubt by rating very good and not just average. Nice place, decent price and friendly staff. But there are too many small annoyances. Biggest being the soap, shampoo and conditioner in dispensers mounted on the shower wall. Kinda gross and not expected at this level hotel. Bring your own shampoo and use the small bar soap they leave on the sink. The ironing board is the mini compact type that you have to set on a table or bed. Extremely difficult to iron dress shirts. The hanger rack in the closet area is too low and pants touch the floor. The business center has only one computer and you have to go to the front desk to get a key. Most hotels have it so your room key works and you don't need to wait in line just to print a boarding pass. Bed is comfortable and nice pillows but covers are too thin. Breakfast is very nice and well above what you would expect with eggs, sausage, bicuits & gravy among the other basic continental breakfast items. Good coffee! The \"evening reception\" snacks were a bowl of potato chips and a bowl of pretzels. Went for a beer or wine one night and a sign said the bar was open but no attendant. You had to go to the front desk to get a drink. Many good places to eat within a couple miles. A few changes could easily make this place a must stay hotel with an Excellent rating!", "title": "Just Above Average", "helpfulness": 1, "user": "VegasChzHed", "date": "December 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121287501}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I generally stay at one of the larger chain hotels, (Marriott or Hilton), but with a limited budget in my new job, needed to find something much less expensive. After much angst, I select the Pear Tree Inn. I was pleasantly surprised. The room was $65 p/night, and for that price the room was clean and recently renovated. The front desk staff was courteous and there's a free breakfast (including eggs, pancakes, fruit, etc). Also, every evening there is a cocktail hour with free wine or beer. All for $65 p/nt.", "title": "Great Value", "helpfulness": 1, "user": "Owen1607", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119961900}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I would stay here again. Good, simple hotel that is clean and a great value.", "title": "GREAT stay, GREAT price!!", "helpfulness": 2, "user": "GEquakers", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119194294}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "We had a great stay at the Pear Tree Inn in Overland Park, KS on Oct 1-2. Hard to be believe you would find granite counters in the bathroom, beautiful furniture and clean, comfortable beds for only $59.99 a night, followed by a full breakfast the next morning! So easy to get to, as well. They even let us check in early so we could relax and unpack between the wedding and reception we were attending. Wish you had an indoor pool, but we didn't have much time for that, anyway. Thanks for a wonderful time. We will be back!!", "title": "A Nice Hotel for a Nice Weekend!", "user": "DMDavid", "date": "October 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119072838}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The Pear Tree Inn (by Drury Inn) is a nice hotel with quality amenities. I have nothing negative to say about the property.", "title": "Great Hotel with spacious rooms and nice ammenities!", "helpfulness": 1, "user": "sburnell51863", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117980454}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed at the Pear Tree on a Saturday night when a busload of teen soccer players was booked. I was concerned when we arrived that noise might be a problem. The check-in counter had a sign noting the \"quiet hours,\" and my first thought was that, in spite of that, we would be hearing kids running up and down the halls all evening. Either that soccer team was the best-behaved group of kids ever or the Pear Tree enforced their quiet hours. We didn't hear any noise until next morning when people began to leave for the day. The room was very clean. The location was just right for us and close enough to the interstate to be easy to find. The clerk was friendly and helpful. And the price was right. We'll stay here again.", "title": "Quiet, clean, close, and cheap", "helpfulness": 1, "user": "lmihal", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126497435}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My mother and I stayed on a Friday night when the hotel was quite busy. Our check-in was fast and accurate, the clerk was friendly and efficient. Our room was very clean and quite nice. The beds were comfortable. My mom is very picky about mattresses being too firm or uncomfortable, but she was very pleased with the beds and slept well (we had a room with two double beds.)", "title": "Great value for a great stay", "helpfulness": 2, "user": "Shalyn M", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126199540}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The room was fairly quiet during the night (we were on the first floor, near the lobby) and we enjoyed the hot breakfast in the morning. The hotel was close to everywhere we wanted to go and was easy to access from the highway. I would gladly return to the hotel and recommend it to others.", "title": "Always a nice stay", "helpfulness": 1, "user": "VacationsForMe2", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125406466}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "My husband and I have stayed at this hotel many times over the years whenever we come to KC. I almost always choose this hotel because it is in a very good part of town, it's central for where we need to be, it's always value priced, the staff is always nice, breakfast is good, and the rooms are very clean. It always serves our purpose. If I could suggest an improvement, it would be the carpet, please replace it! But everything else always is clean. We've stayed in a 2 room suite with a seperate bedroom and and kitchenette which is super nice, a room with 2 beds, and a king bed room. All of them have microwaves and big refridgerators! We've been very pleased each time. We will continue to come back.", "title": "Great for the money.", "user": "Foodie240", "date": "January 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123662102}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This was the second time I've stayed at this place in the last 3-4 months, but I forgot to review it the first time. The place is owned (has been taken over) by Drury hotels and actually shares a parking lot with another Drury Hotel. The decor is a bit outdated, but is a great place just to relax. I think it was between 50-60 dollars, i had my company book it so I don't remember....and that included a decent bed, fluffy towels (in comparison to most hotels) in the bathroom (which is something I always love), and a happy hour that includes 3 cups of bud light/wine, chips, pretzels, popcorn, and unlimited fountain drinks. The only thing I didn't like was not having a fridge in the room, but since it was one night that didn't bother me so much. They also have a hot breakfast that is supposed to include eggs, biscuits/gravy, waffles, etc...but my room was so dark (love it) that I slept way late and didn't get a chance to eat.", "title": "Fantastic Price! Not bad at all!", "helpfulness": 1, "user": "Lindsey S", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121474432}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have been staying at the Drury Inn in St. Joesph MO, and I wrote a review on that hotel. So far the Drury Inns are exceeding our expecations. We thought we try the Pear Tree Inn in OP, KS, its right next to the Drury Inn. The diff. is we were told the Pear Tree Inn is 30 years old and Drury Inn is 10 some years old. First, you won't belive it being 30 years old. We just stayed the night before at the Ramadia Inn in Saint Joesph, MO. And you have to be kidding. That place ona scale of 1 to 5, 1 being the lowest is a neg 5 for the clean, upkeep facility. Now the staff is awesome dont' get me wrong. Its just a hotel that has been left alone and needs a major update like 5 years ago. The breakfast was great, the lady in the area was extremely helpfull, I didn't catch her name, she was very busy. Back to Peartree, they have undercover parking. I go out at night to walk our dog and talking about lights. I felt very safe with all the lights on at night. Of course I always care my mace anytime we go on trips, these days things happen. The service was outstanding, front desk, to cleaning staff to the breakfast and night snacking staff. We love this place for our first time. Our daughter goes to Missour Western, and we thinking of staying here, thats right driving 2 hours round trip if we cant get a room at the Drury Inn in St. Joe. Its that good. And you don't spend a fortune like at the other hotels. And when are hotels Presidents going to get a clue. Its time to open up your doors and allow pets to stay free. I have seen much more damage done by adults drinking and smoking than any pet could do. I sure hope hotel chain presidents can get away and start staying at these hotes and compare the quality and value to theirs. We would love to start staying at other hotels that become pet friendly. Extremely quiet, now it was a Wed night so it wasn't as full as say a weekend. But the doors that lock out unwanted people actucally work,compared to the Ramadia Inn in St. Joe, MO.", "title": "One of the Best Vaules with full respect to Staff and Hotel", "user": "kcchiefs68870", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117268873}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We just needed a room for the night and this place was a good price & location. We were pleased with the accommodations for the most part. Rooms were clean except a small stain on the carpet. Nice pillows, a little to firm of bed, pretty tile in the bathroom & clean, walls seemed thick didn't hear any noise from neighbors or hallway, parking & access to the rooms was good, TV & it's cabinet were bulky and needed updated along with the bedding, front desk staff could be friendlier and wi-fi worked well. We didn't try the breakfast or afternoon drink & snacks but was available. Overall wasn't bad for a quick stay, wouldn't spend more than a couple nights though.", "title": "Average place to stay", "user": "My1Voice", "date": "August 11, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 4.0, "service": 3.0}, "id": 116575132}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at the Pear Tree Inn for 4 days while visiting relatives. The room was dark and dreary and had a slight mildew smell. The room was clean though. The parking lot at the hotel was torn up and the concrete was crumbling. The room had an old TV in it, which was hard to watch. We had one tiny window in the room which your could not open, and had a view of the freeway. We have stayed at other budget friendly hotels in the past and have had much better experiences. We were very unimpressed and would not stay at this hotel again.", "title": "Yes, it was inexpensive, but the room was small, dark, drearyand dated", "user": "cookerwoman", "date": "July 27, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 115861520}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Very disappointed in this hotel. The outside pool was nice and that was about it. The carpets were dirty and needed a good shampoo job! The water never did get cold from the faucet in the restroom. The shower head was so low I had to almost drop to my knees to get a good shower. The nightly manager treat special as well as the breakfast had alot to be desired (however the solution to this problem is to go next door to the Drury In - who runs the Pear Tree Inn - and eat the nightly snacks and breakfast over there!!! Very disappointed in what we spent for our money. We'll be staying somewhere else on our next trip to KC!", "title": "Stay across the parking lot at Drury Inn!!", "helpfulness": 1, "user": "omahatraveler68", "date": "July 20, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 115589009}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "i was very happy with our stay. we stayed thers 2 different times in june . the staff very friendly and accomidating. would stay there again and we will if back in that part of k.c.!", "title": "wonderful for what we needed!", "user": "McphersonOpie", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114971303}, {"rating": 5.0, "title": "twice in one week", "text": "I was on a 1000 mile drive and staying here was 1/2 way in each direction. It's right off the freeway,", "user": "jon160", "date": "June 26, 2012", "id": 132854327}, {"rating": 5.0, "title": "Fantastic Emergency Experience", "text": "and near lots of restaurants which are good for a solo traveler like me. It was clean and quiet. Free wireless internet and free parking. I would definitely stay here again.", "user": "Rick L", "date": "June 9, 2012", "id": 131633751}, {"rating": 5.0, "title": "Great accomodations!", "text": "We stayed due to an emergency at our house at 1 am in the morning. This was close and knew it was associated with Drury Inns. Staff was very accomodating getting us in that late at night. We needed 2 rooms since we had college kids that were going to spend the night. We had expected it to be a little dated but the rooms were much nicer than you would expect for the price and everybit as nice as a Drury. Even the baths had looked like they had been recently tiled. Breakfast was great with all the hot foods like waffles, eggs, biscuits/gravy, etc. This salvaged a night had looked to be bad. Nice area with a new Mcdonald's, Applebee's, and Panera all within short walking distance.", "user": "jacman51", "date": "May 26, 2012", "id": 130635457}, {"rating": 4.0, "title": "No partridges, but a very pleasant stay at a good price, worthy of the Drury chain", "text": "This is a very nice place to stay \"where the extras aren`t extra!\" The room, although a bit smaller than others I`ve stayed in, was very clean and had the most comfortable queen bed I`ve ever slept on! The room was quiet considering it overlooked the lobby. My room had a new LG flat screen TV! I was in town to see an old classmate, and being freeway-close served my purpose. The staff is friendly and efficient. The breakfast is outstanding! The bathroom is really nice and spotless! On the day of my departure, they slipped my reciept under the under the door early that morning, allowing me to look it over. I opted for \"Express Check-out\", which means if everything is okay with the bill (which it was), I could just leave the key card in the room and not have stop by the front desk. I highly recommend this place to anyone!", "user": "AlanMAF55", "date": "April 4, 2012", "id": 127267725}, {"rating": 4.0, "title": "Nice Hotel, Nice Price", "text": "My overnight stay at the Pear Tree Inn in Overland Park was a very pleasant experience. It was clean, quiet, and relatively inexpensive. Parking was plentiful (some was covered). The desk clerks were welcoming and helpful. The common areas (lobby, breakfast area, hallways) were a little dated, but clean and well-maintained. The standard-sized room was quiet, with a very comfortable queen bed, a stuffed armchair, a desk and chair if you wanted or needed to work, a non-flat-screen TV that was perfectly fine, and a bathroom that, while not palatial, was plenty big enough. The hot breakfast included sausage, eggs, biscuits, gravy, waffles, and so forth, and happy hour featured beer, wine, and chips. I did not use the pool or exercise room.", "user": "JeffTrenton_MO", "date": "March 30, 2012", "id": 126975351}], "location": {"country": "United States", "city": "Overland Park"}, "variance": {"poor": 4, "average": 15, "very good": 32, "terrible": 0, "excellent": 30}, "aka": "Pear Tree Inn Overland Park Hotel", "slim_ranking": 0.25641025641, "description": "A short drive from Kansas City, this beautiful suburb can stand on its own. Consistently rated a Top 10 place to live, we believe you’ll, at least, like to visit Overland Park and the Pear Tree Inn. Pear Tree Inn offers its guests a variety of free extras – take, for example, our free breakfast. We serves free continental breakfast, which includes pastries, toast, cereal, fresh fruit, coffee, tea and juices. Enjoy a refreshing drink to end your day with free drinks from 5:30 to 7 pm. To burn off all of those free extras, Drury has a 24-hour exercise center and a parking lot to jog around. Lastly, Drury’s free wireless Internet and free long distance calls will ensure you can keep tabs on all of your posse back home."}