{"user_rating": 4.5, "review_count": 90, "name": "Pension Lettie", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "What a pleasure it was to eat American style breakfast and have a conversation with someone who speaks perfect English! We enjoyed stammering through common phrases with the wonderful German locals all over Bavaria, but it was also nice to forget about pronunciaitions while talking to Lettie.", "title": "Lettie is wonderful", "helpfulness": 1, "user": "posse4", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7616272, "likes": {"liked": "— Lettie, breakfast, location", "disliked": "— Pillows, cobwebs"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We only had two gripes, unfortunately. One reviewer mentioned the cobwebs, which we found as well. There were also a couple of spiders sharing our ceiling. Although we know spiders are good to have around to kill any pesky bugs, others may be put off by this. The room was clean overall, and we even smelled fresh bleach when we came back to our tidied room at night. The other gripe is the pillows, which are good for stomach sleepers, but not for back or side sleepers. They are downey and very flat, leaving our backs a little achey the next day.", "title": "Coffee, tea or me", "helpfulness": 4, "user": "CoryandLauraJurica", "date": "March 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7227241, "likes": {"liked": "— One on one service"}}, {"rating": 5.0, "title": "Great Place to Stay", "text": "Lettie is a great person and is most helpful. Her breakfast was good, and prepared eggs any way you wished. She helped out with parking (you have to find free dirt lots or pay along the street, neither of which are far away) and was gave us a few restaurant suggestions.", "helpfulness": 3, "user": "Sandra27", "date": "March 11, 2007", "id": 7010660}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I stayed with Lettie in 1999 when a friend and I were in Germany. This time it was my husband and I.", "title": "Good Value", "helpfulness": 1, "user": "Cali_Cal", "date": "February 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6766663, "likes": {"liked": "— Welcoming, warm and friendly. Great price.", "disliked": "— Dirty walls, cobwebs"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Lettie is more like a long lost relative than a business woman. She even went out to dinner and a wine tasteing with us. It was so nice to get the insiders view to Bacharach.", "title": "Great place to stay!", "helpfulness": 3, "user": "pdxtraveler2", "date": "September 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5894110, "likes": {"liked": "— Clean, nice staff, good lcoation", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We chose to stay with Lettie at the recommendation of our Rick Steves travel book. His recommendation is right on. Lettie is super helpful, very friendly and runs a great little b&b. Lettie serves a great breakfast to include excellent waffles. We spent only one night with her in May 2006, but would choose to stay with her again should we return to the area.", "title": "Great host, excellent location", "helpfulness": 5, "user": "ilmanrd", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5624267, "likes": {"liked": "— Service, the owner, location"}}, {"rating": 5.0, "title": "Loved it at Lettie's", "text": "Lettie is a sweet Filippino lady who winters at her other home in Las Vegas. She is very personable and we loved staying one night at her place in Bacharach. Easy to make reservation and reconfirm via email. Very nice room, clean, and spacious bathroom. Also provided hair dryer, which was nice. Nice breakfast in the morning. She wants you to eat a lot of her waffles! Had internet access we used at our breakfast table on her laptop (for a small fee). She loved that I gave her a magnet of our home city and said she collects them. I would definitely recommend Lettie's place and will stay there again if we return to this charming town. The city is so nice, our favorite of the five German (small) towns we visited. Did Rick Steves' suggested town walk, which was had great views of the Rhine and town from the vineyards above. Ate at the wine restaurant. The wine was not so great. Went to what we think is the only bar in town. Had a nice chat with a local guy who's well traveled, and a couple from England. Enjoyed small Bacharach very well. Oh, best Italian meal we had was at the Italian place on the main street. Has a round sign that says \"Pizza\". Had a language barrier, but had a wonderful meal. Don't miss that, and don't miss Lettie's!", "helpfulness": 7, "user": "bamadawg", "date": "June 17, 2006", "id": 5355691}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Loved Lettie, loved her place. She was so nice and gave us great information. The rooms were clean and well looked after. The breakfast was awesome, not the usual European breakfast, which is usually fairly sparse. Bacharach is a lovely, quaint village in a prime location. We highly recommend taking a boat tour of the Rhine. It's all so lovely, I want to go back and I'll stay at Lettie's again!", "title": "Stay at Pension Lettie in Bacharach", "helpfulness": 10, "user": "MsDidi63", "date": "May 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5078787}, {"rating": 5.0, "title": "If you go to Bacharach, stay at Lettie's!!", "text": "We spent two nights at Pension Lettie in June 2005. We had originally wanted to stay at the castle hostel in town (when else can you stay in a castle?) but Pension Lettie came highly recommended by a couple of friends and family members and we are thrilled we stayed there. First of all, Lettie is one of the most effervescent, charming people we met in our travels. She gave great recommendations for dinner, directions to where we wanted to go, and information about the trains we needed. Our room was very comfortable with a private bathroom and shower and a television. If that weren't enough, her breakfasts are SPECTACULAR!! The best waffles I have ever tasted, along with fruit, yogurt, coffee, juices, cereal, sausage, and eggs cooked however you like them.", "helpfulness": 16, "user": "LisaW_MN", "date": "January 31, 2006", "id": 4405540}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Lettie is wonderful. She is a warm and friendly. However, our experience at her pension was disappointing. Our room was really stark and run down. The bed was squeaky. Overall it was far too Americanized and lacked the charm of a German pension. The decor in the hallways consisted of funny sayings and poems(in English) printed off the internet and hung up.", "title": "Disappointing", "helpfulness": 3, "user": "HappyWorldTraveler", "date": "July 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 8123595, "likes": {"liked": "— Lettie was very nice", "disliked": "— Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I think that 99% of her guests must be Americans and it's easy to forget you are in Germany when you step inside. It's great that Lettie speaks English, but if you want to eat an American breakfast and have conversations with only other Americans, why would you bother to travel to Germany? We traveled through Germany for 10 days and every place we went (pensions and restaurants) the locals made every effort to communicate with us in English after we attempted to communicate with them in German. When I travel one of the things I most want to experience is the culture of the country I am visiting.", "title": "great place to stay, very nice woman. avoid the room with shower.", "helpfulness": 2, "user": "SeattleGuy", "date": "July 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8113321, "likes": {"liked": "— good breakfasts with homemade honey, nice operator", "disliked": "— the room with its own bathroom!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "This was one of the few good places listed in Rick Steve's Germany/Austria guidebook.", "title": "Terrific place to stay", "helpfulness": 2, "user": "Steve_Freeman", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7712113, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "The woman who runs it only has 3 rooms so there is no noise usually. She gave us a nice room with breakfast for only 35 EURO a night for two people! She makes breakfast herself for you personally and she even makes her own honey from beehives she has in the back. She doesn't speak hardly any english but makes an effort to understand you. She is very accomodating and let us add on an extra night without warning.", "title": "Lettie's is a great value", "helpfulness": 5, "user": "CMExplorer", "date": "May 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7709430}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Avoid the room that has its own bathroom. We stayed in it one night and when we woke up it stunk horribly like rotting sewage. When we brought her up to see the problem, she said it was \"the canals\" [coming up through the sewer in the hot summer weather.] I cannot overstate the smell, it was so bad we nearly vomited several times. Do NOT take this room.", "title": "Nicest person on our trip", "helpfulness": 3, "user": "nfrymire", "date": "May 22, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 7670911, "likes": {"liked": "— Great service.", "disliked": "— Beds weren't the most comfortable, but they worked."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Pension Lette in Bacharach is an excellent value. It is not fancy but the room was large enough, clean and quiet. The breakfast was very good. For the money, it was an excellent value.", "title": "Very good value", "helpfulness": 2, "user": "Robbed_John", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 10038991, "likes": {"liked": "— value and confort of room and breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "There is also a very good resturant a couple of blocks up on the main street. It does not have a name except \"Cafe Resturant\". It is very good home cooked German food at a very good price. We ate there both nights we were in Bacharach", "title": "Would love to visit again!", "helpfulness": 1, "user": "ud_lilmike", "date": "September 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10023487, "likes": {"liked": "— Location", "disliked": "— Internet didn't work when i was there"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I stayed at Pension Lettie's for a couple nights in late August with my sister and brother in law. I thought it was great. I agree with the other travelers in that it's nothing fancy, but overall it's a great value.", "title": "Enjoyed staying at Lettie's", "helpfulness": 1, "user": "gerausswit", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8864759}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Lettie is a great host. She's friendy and is always available to answer questions and help plan out your day. She cooks a great breakfast as well. She gave us the option of having eggs and waffles or a typical German breakfast with meats, cheeses and breads. Our room was also very clean and plenty roomy.", "title": "Pension Lettie", "helpfulness": 2, "user": "JanHTexas", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8357592, "likes": {"liked": "— Everything was wonderful", "disliked": "— I had no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We stayed with Lettie for 2 nights in September, and would definitely go back. Our room was actually 2 bedrooms, with a private bath. It was clean(slight odor of Clorox), and I believe it was on the 3rd floor. She is located in the \"heart\" of charming Bacharach.", "title": "Enjoyed our stay with Lettie", "helpfulness": 2, "user": "andeesue1", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8355469}], "location": {"country": "Germany", "continent": "Europe", "city": "Bacharach"}, "variance": {"poor": 3, "average": 8, "very good": 23, "terrible": 3, "excellent": 53}, "aka": "Pension Lettie Hotel Bacharach", "slim_ranking": 0.363636363636}