{"user_rating": 5.0, "review_count": 121, "name": "Pension am Schneiderturm", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "What I guy! And I mean Sorin the owner of the Pension am Schneiderturm. Praising Sorin is praising the pension because Sorin has put his heart and soul and perfectionism into this place. The pension has good vibes, spotlessly clean and is shining because of Sorin's good spirit.", "title": "One of the best places, the owner is amazing (and so is the place)", "helpfulness": 3, "user": "stroffs", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143364732}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Why did we like the guy (and the place) so much? Well, He provided us with a map and sat with us for 20 minutes offering routes and places to see, he kept asking if we want anything for our 6 weeks old baby that was traveling with us (the youngest to stay in the Schneiderturm pension!), he invited us for tee and made us discover what a kind man he is and invited us for breakfast although we we've staying in another hotel (we wanted to stay another night but the place was fully booked so Sorin invited us for breakfast the second day we were in town).", "title": "excellent place", "user": "Arie13", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142525716}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Oh ya the breakfast… I mean THE breakfast! Imagine a softly lighted cellar, light music, wooden tables with organic food Sorin buys from the villagers around: home backed bread, sausages, cheese, honey, marmalade, vegetables, pear juice, apple juice, milk… all fresh, organic and of the finest quality! I've traveling around and still, this is one of the best breakfasts I've ever had!", "title": "A hidden gem", "user": "zinfandelSweden", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142070597}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Let's put them cards on the table. What makes you remember a place (and want to come back) is the spirit that resides in the place, how this place made you feel when you've stayed in. Well, Pension am Schneiderturm made us feel great! we're coming again, see you in the winter Sorin :-)", "title": "What a Great Place", "helpfulness": 1, "user": "oldguy78", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141855436}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Very Good location and hospitality -We have had two nice days.The pension is located in old city near the gate you have to pay for parking in the city (15 lei/day). The ownersorin is always on hand, extremely helpful for evry body .", "title": "Great place to start a visit of the old citadel", "user": "CarpatBike", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140132955}, {"rating": 5.0, "title": "Couldn't have been any better!", "text": "We were lucky to get a room in this place - there had been a cancellation on the one night we needed to stay. I'd definitely recommend booking in advance!", "helpfulness": 1, "user": "Hannah1812", "date": "September 3, 2012", "id": 139294350}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "When we arrived we were greeted with complimentary elderflower juice, which was delicious. In the evening we sat on the terrace and talked to Sorin, who speaks excellent English and is very chilled out and happy to talk. He even gave us free glasses of local wine and homemade cherry brandy! And as everyone has said, the breakfast was out-of-this-world.", "title": "Feel like a local", "user": "TassieLondon", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136709521}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The rooms are very nice, and the pension could not be better located. I'd almost recommend a visit to Sighisoara just to stay here!", "title": "What a wonderful place to stay", "helpfulness": 2, "user": "Christina D", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136173977}, {"rating": 5.0, "title": "\"Delightful experience\"", "text": "A lovely pension built directly into the walls of Sighisoara and a perfect place to stay to discover Sighisoara which is a UNESCO world heritage site. It was very hot in July and the rooms are small, but the window let in a nice breeze. The breakfast had 9 different local cheeses and about 6 different salamis, the coffee was good and there was a selection of breads and cereals.", "user": "Hannah1812", "date": "July 24, 2012", "id": 135238086}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "My husband and I have traveled to many different places in the world, the Pension am Schneiderturm is one of our favorite places to stay.The owner (Sorin) is a terrific host who goes above and beyond. The central location is so convenient. Like so many other guests (as you can read in the reviews), we very much liked the breakfast. It gave us the opportunity to taste local fresh food such as elderberry juice, local cheeses as well as salami from bear and boar just to name some of our favorites (delicious). We truly enjoyed the conversations we had with Sorin and the other guests from many different countries during breakfast time and in the evenings on the terrace (with complementary local wine or brandy). Beautiful and relaxing place, definitely the No. 1 !!!", "title": "Look no further!", "user": "estebandepraga", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134959522}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Warmest welcome, convenient location, obliging English speaking host, loads of info about the area, excellent breakfast, clean & roomy. This is one to return to again & again & again! Although I can be very critical, there was nothing to find fault with here!", "title": "A brilliant holiday highlight", "helpfulness": 1, "user": "Bathman", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133855128}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Excellent accommodation and very good value. Host very helpful and friendly. He even cleaned my (very) dirty bike windscreen!", "title": "Excellent good accommodation", "user": "Chuckie1950", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133613951}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Really good service, possibility to park directly inside the old citadel", "title": "That's the one", "user": "carlo b", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132699629}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "the house room was very clean, the shower really good and the overall service absoultely stunning.Bio-Breakfast", "title": "5 star service and hospitality in a beautifully restored building", "user": "Antonyh1952", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132619288}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hasn'got a view to the town.but the position in the citadel is enough to enjoy the old citadel.", "title": "An absolute gem of a B&B. Truly memorable.", "user": "BeemerF650", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132164964}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Pension am Schneiderturm is a unique and charming place to stay in Sighisoara. The host, Sorin, was incredibly welcoming (he even shared traditional Romanian brandy--tuica--with us as a night cap. He was also very helpful in recommending a non-touristy restaurant for dinner and in giving recommendations on things to see along our drive to our next town in Romania. The breakfast spread was lovely, too. Pension am Schneiderturm is unlike any other place I've stayed in its old-world charm. What a wonderful experience in a beautiful town.", "title": "A wonderful place to stay in a beautiful town", "user": "TabithaSef", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132016338}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Wow, what a discovery for me. Every part of my short stay in Sighisoara was excellent and the hotel was no exception. The manager couldn't have been more helpful from a wonderful welcome, to booking a driver to creating an excellent spread for breakfast. The room (opposite reception) was large and had everything you could need.", "title": "Wonderful hotel, beautiful town", "helpfulness": 1, "user": "jtb105", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131847686}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Take the owner's advice and walk down the hill from the clock town to much cheaper and better bars and restaurants near a small park.", "title": "Very pleasant surprise", "helpfulness": 4, "user": "Dackilica", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123509196}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "We had spent only one day here but we had a terrific time. We were lucky to find this place since the entire trip was planned on a really short notice. An amazing thing about this tiny (only 6 rooms) but magnificent place is that it is actually a part of the history itself and one of the important monuments in Sighisoara. The hotel has been completely renovated but retained all of its authenticity and medieval charm. Although being completely restored to match the construction conditions of that time, I highly appreciated the modern bathroom, plenty of hot water and couple of extra sockets for our gadgets.The breakfast was nothing less than pleasant and tasteful. And of course, last but not least, we very much enjoyed the hospitality of our host. He was extremely helpful, nice and welcoming. We are grateful for all the great tips regarding restaurants and places to visit. If we decide to go to Romania once again, we are definitely coming back to Sighisoara and Am Schneiderturm hotel. It is definitely worth recommending as it is worth seeing.", "title": "One Visit is not enough", "helpfulness": 1, "user": "Pauline S", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121920918}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "This was my second visit to Pension Am Schneiderturm & hopefully not my last! Having had a wonderful experience on my first visit, I just had to go back & relive this. Schneiderturm does not disappoint! Second time around was even better. The same high standards have been maintained & Sorin, the owner will do everything he can to make your stay as pleasant & relaxing as possible.", "title": "great little find in a beautiful countryside location", "user": "Denvervacationer2010", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120531211}], "location": {"country": "Romania", "region": "Transylvania", "continent": "Europe"}, "variance": {"poor": 0, "average": 4, "very good": 4, "terrible": 0, "excellent": 113}, "slim_ranking": 0.03125, "description": "The Pension am Schneiderturm guesthouse is located in Transylvania, in the medieval town of Sighişoara, near the citadel's main access gate. This medieval house dates back to 1797 and, through construction and architectural style, it forms an integral part both of the Tailors' Tower and of the citadel's Wall. Traditionally restored, the guesthouse has four double bed rooms, one single bed room and an apartment, all of which are furnished with authentic pieces of furniture in massive wood and have their own private bathrooms, fully equipped. In case the tourists staying at the guesthouse would like to pay a two-wheeled visit to the tourist attractions near the medieval town, they will be able to do so, as the guesthouse offers them the possibility to use, free of charge, its high quality, modern and well-kept bikes. Breakfast is on the house and it consists of local food products, purchased from the farmers living in the villages close to Sighişoara."}