{"user_rating": 3.0, "review_count": 19, "name": "Pensione Elio Pistolesi", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We were on a cycling holiday in Tuscany and the first leg of our trip was from Siena to Radda, which was a long day at approx 45km. The weather was great, but was a bit on the cool side especially after cycling fast downhill for a few kilometres. So when we arrived at Podere Le Vigne, we were happy to see a great little hotel set amongst vistas of vineyards, what looked like a great restaurant (lots of choices for vegetarians – something we’d struggled with on our trip so far) and a cosy feel. We had to wait outside though for a while as the reception didn’t open until 3.30pm and we arrived at 2.50pm, so we were getting a little colder as the minutes passed – but that didn’t matter as we would soon be in what looked like a comfortable little Tuscan hotel.", "title": "Podere Le Vigne this isn’t (although we were told it was!!!)", "helpfulness": 1, "user": "Samkirk9", "date": "October 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20815399, "likes": {"liked": "— Nothing", "disliked": "— Misleading grading system, no facilities, having to be driven to a different hotel for breakfast, the breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "What actually happened is that the man at reception, can’t fault his friendliness, said that we were to moved to one of their other places in town. So we were taken with our baggage in his not very clean car to a place in town. We thought that this wouldn’t be so bad as he said it was a good room with a balcony with a choice of loads of restaurants. The picture you immediately get in your head is some quaint room where you could sit on a balcony pouring with geraniums overlooking a busy street in the old town where you could pass your time watching life go on below with a glass of Chianti in hand. We were speechless as we were led to a small doorway, through a hall where an old Italian lady sat at a tiny desk (remember this was a hallway), which we were led past up a load of stairs and through a room with some old tables and chairs scattered around. We then entered our room, which like the rest of the building was cold, gloomy, very old furniture and very tired looking (don’t be fooled by the pictures on the website which clearly have been dressed and lightened). The balcony may have been a nice addition, but you had to climb to it through some wooden steps that had been placed against the wall to the door, it overlooked other houses to the extent you could see everything people were doing in their houses and it hadn’t been cleaned for I don’t know how long.", "title": "Stayed at better, much better..", "helpfulness": 1, "user": "TravelPad", "date": "October 11, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 20796548, "likes": {"liked": "— Location", "disliked": "— Cold room, dirty grotty balcony, dated"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 5, "average": 2, "very good": 1, "terrible": 5, "excellent": 6}, "aka": "Pensione Elio Pistolesi Radda In Chianti, Italy - Tuscany", "slim_ranking": 0.8125}