{"user_rating": 4.5, "review_count": 491, "name": "Pension Suzanne", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I stayed at the Pension Suzanne July 16-18, 2009. The location of this hotel is excellent for sightseeing, the opera, and shopping. We were pleased with our room and the breakfast was simple but adequate. The internet access was spotty and the staff person on duty the afternoon of July 17 was unable to help us with securing our travel arrangements the next day. However, when we checked out on July 18, we were very surprised to be charged 124 euro instead of the 93 euro we had been guaranteed by email via our travel agent. The staff person on duty explained that the room we had booked was unavailable at check-in so we were upgraded to a room with a kitchenette (which we never used). Of course, we were not informed of the change at check-in and had no idea that we would be paying an additional 31 euro per night. Consequently, we had to scrape together the additional euro to pay in cash (as that is the preferred method of payment for this hotel) and find an ATM in order to have enough cash to take a cab to the airport to return to the U.S. I have mixed feelings about recommending this hotel as I have never experienced this problem before. We stayed at much nicer places with air conditioning for 120 euro in Munich and Salzburg.", "title": "Double check room rate and room guarantee at check-in", "helpfulness": 1, "user": "kathyohio", "date": "July 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 35833289}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "No hotel can beat the location this hotel offers in the heart of Vienna. It was a great help from 'Trip Advisor' site for coming to a decision to stay in this hotel.So I thought of putting my opinion on this hotel & on this website. Honestly breakfast was not so great, rooms were OK-OK.But when you are on holiday you do not look for these, Right? It was the location for which I opted for this hotel and I had no regreats. IT WAS PERFECT FOR THS PRICE I PAID FOR. So friends go for it.", "title": "Keeps you in Heart of Vienna", "helpfulness": 1, "user": "ManojZ", "date": "July 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 35262107}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I found this hotel via google maps as it was close to the 300 euro / night flagship hotel for a convention I was part of.", "title": "Excellent location but no air conditioning with limited wifi access", "helpfulness": 1, "user": "PacoCA", "date": "July 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 35087618}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "Positives:", "title": "Wonderful location - would stay again!", "user": "CandianTravelBugz", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34993680}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "First off, the location is perfect! Right near the opera house, Karlzplatz ubahn (metro) station, shopping galleries and streets and city center tourist attractions. In fact I would say that the location could not be better. There is a small market around the block in the Ringstrassen-Galerien is around the block and has a food market in the lower level, excellent for those long stays! If you like to walk you can make it down to Stephansplotz in about 15 minutes; or more if you stop at the numerous shops. the Opera is just down the street and the city palace complex is just a few blocks from there.", "title": "Reasonable value in an excellent location", "user": "PeterandLeanne", "date": "July 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 34576091}, {"rating": 1.0, "title": "SCORRETTI !!", "text": "They confirmed my reservation (1 triple for 4 nights) but in the morning of the 3rd day we were asked to change our room with a smaller (and more hot) one, practically without notice. No discount for the trouble they caused us: indeed, they asserted we got a special treatment, for they charged the agreed rate for all the nights, even if the first 2 nights we occupied a more expensive room.", "helpfulness": 1, "user": "JorestTrip", "date": "August 23, 2009", "id": 38571419}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Tricks like this are not acceptable, these problems MUST be submitted before confirming a reservation, so that one can decide to accept or to find another accomodation (I had other valid offers).", "title": "Wonderful, helpful staff", "helpfulness": 1, "user": "pattypie51", "date": "August 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38037175}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I would not treat with such people again.", "title": "Excellent location", "user": "travelluver222", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36825751}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "On arriving in Vienna, my husband and our 2 friends went to the tourist info in Vienna looking for somewhere close in the the city to stay for 2 nights. We booked into the Pension Suzanne and upon arrival I was a little surprised to see the condition of the entrance, it looked quite in need of some maintenance, not quite the standard of accommodation we were used to. HOWEVER....once we had booked in, the rooms were spotlessly clean and beds very comfortable, but most importantly the staff, particularly Bridget and Marie were so incredibly helpful. And the breakfast was very nice.", "title": "Perfect Location, Good Hotel", "user": "johnrct", "date": "August 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36527791}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Located right next to the opera house, walkable to all major sights and lots of restaurants, the location couldn't be better. The 8-story building with elevator has about 4 rooms per floor, some of which are privately owned apartments, so it feels more like a small apt. building than a hotel. The rooms are clean and quiet. We opted for a quieter back room, even though it had no view, so we could sleep with the windows open (no air conditioning, although they did provide us with a fan--nights were cool, so it was fine.) The staff all spoke fluent English, and called us a cab for us very early the last morning to take us to the airport (although they missed the wakeup call, so bring your alarm clock). Breakfast was quite adequate--rolls, meats, cereals, soft-boiled eggs, juices, coffee/tea. Note that there is no laundromat anywhere in the area, and the hotel does not do laundry, so pack accordingly! There were two computers in the reception area which were free to use--we did not bring a computer so not sure about the rest of the hotel. We would gladly stay here again.", "title": "Basic accomodation in a great location!", "user": "Traveler121709", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 35873346}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed two night in the Pension Suzanne and were very satisfied. It is an excellent value for the price. The rooms are rather small and dated but very comfortable and the bathrooms are modern and nice. The breakfast was very good. The best feature of the hotel is the location. It is in the old town right beside the Opera House along a pesdrian street lined with restuarants and shops. It is in easy walking distance of all of the major sights. The staff was very helpful and made concert reservation for us. We were catching the Orient Express at night and they let us leave our luggage and use the common areas and bathroom until we left. We went to two touristy Mozart and Strauss concerts. We recommend the Strauss concert in the Kursalon. Get your tickets as soon as you arrive in the city.", "title": "Location, location, location", "user": "Robbed_John", "date": "September 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 44564810}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Great central location for clean, affordable pension. Close to Opera House and walking distance to most sites in city center and near U-Bahn stop. Hearty breakfast included. Couple who run pension are helpful and efficient.", "title": "Centrally-located, affordable Vienna pension", "helpfulness": 1, "user": "BrianF71", "date": "September 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 41380799}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Our family of four stayed in a family room for 6 nights at a cost of 159 euros per night. The location is excellent, opposite the Opera House, and handy to a metro station.", "title": "Great location; some misgivings", "user": "KiwitravellerAkl", "date": "September 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 40538197}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The Pension has about 26 rooms spread over 8 floors of two adjacent apartment buildings, probably built post war, located on Walfishstrasse and Kartnerstrasse. The reception is on the first floor above the street, accessed by stairs or a small lift (holds two people with their bags- quite often not available as there is no service lift in the building and tradespeople etc seemed to hold it) and next to it is the breakfast room. Also in the building are apartment owners/ renters, and businesses and professional rooms for architects, lawyers etc. On the ground level are shops and restaurants.", "title": "Perfect location and excellent value for money", "helpfulness": 2, "user": "Sveino", "date": "September 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40426530}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "Reception operates from 7am to 10pm. It is here that you may use a computer and access the internet free of charge. This is in full view of anyone else at reception, so if you want privacy, you need to bring your own computer, which you may use in the breakfast room and connect to the internet. Our room didn't have wifi, and neither do most rooms according to the staff member we asked about it. This is a distinct disadvantage, especially if you are travelling with teenagers.", "title": "Great Location and friendly staff", "helpfulness": 1, "user": "LondonPalmjet", "date": "September 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 40423662}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We stayed at the Pension Suzanne for 3 nights at the end of August, 2009. What a great little hotel! The hotel staff are as friendly and helpful as any I've seen. Each have their own personalities that added to the flavor of our stay in Vienna.", "title": "friendly staff, fantastic location", "helpfulness": 2, "user": "Keun1963", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 40345606}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The rooms are very clean and he bathroom had plenty of room to move around, with a full bath and folding shower door. The furniture is in an ver nice old viennese style which is we liked veryx much", "title": "Great hotel; brilliant location", "helpfulness": 1, "user": "Strian", "date": "September 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 40117160}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "An Austrian/European breakfast is served every morning and the choices were more than adequate to fill you up. Eggs, yogurt, sliced cheese and meat, bread & pastries, coffee and tea. Their 3 minute eggs were by far the best we had the entire trip. The staff are friendly and the food is very decent.", "title": "Overall not bad", "helpfulness": 1, "user": "rven62", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 39933011}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The location could not be better – You can quickly walk from the hotel to many sights and attractions.", "title": "Convenient Location for exploring Vienna", "user": "KanMacau", "date": "September 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39832158}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "We would cheerfully recommend this hotel to anyone looking for a nice stay and experience", "title": "The most friendly hotel in the city", "user": "oldie54", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38940690}], "location": {"country": "Austria", "continent": "Europe"}, "variance": {"poor": 8, "average": 35, "very good": 192, "terrible": 1, "excellent": 255}, "aka": "Pension Suzanne Hotel", "slim_ranking": 0.0817438692098}