{"user_rating": 4.0, "review_count": 324, "name": "Peppers Beacon", "reviews": [{"rating": 4.0, "title": "Awesome view - Dirty Apartment", "text": "This was our first time to Queenstown so I wanted something with a view and this did not disappoint. The view is without a doubt worth paying for, you wake up thinking you could be somewhere in Europe.", "helpfulness": 5, "user": "MissTravelAlot", "date": "July 31, 2007", "id": 8264076}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Unfortunately the room was not very clean on our arrival. We had a two bedroom lake view. The room itself however is furnished really well and looks exactly like the pictures already posted. Very modern but cosy. I was extremely pleased with the layout and condition of all the fixtures and fittings.", "title": "beautiful views in a very large apartment", "helpfulness": 3, "user": "ermicat", "date": "May 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7654510, "likes": {"liked": "— space in accomodation, facilities in apartment, views", "disliked": "— had to ask for a dvd player"}}, {"rating": 3.0, "title": "great hotel, shame about the staff", "text": "The only thing was the glasses where dirty the doors and walls had marks all over them. My daughters quilt had blood stains on it.. The pillows on our bed and our sofa where stained. There was still dried toothpaste on the taps. When we first got there I just put everything in the dishwasher and wiped down all the benches and doors in the kitchen and this seemed to suffice.", "helpfulness": 2, "user": "ivanengland", "date": "May 1, 2007", "id": 7487228}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Surprisingly this didn't ruin the trip because the views and position where so exceptional. The staff where also very friendly.", "title": "Great apartments with breathtaking views!", "helpfulness": 1, "user": "ColinDubai", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7338476, "likes": {"liked": "— The great views", "disliked": "— leaving it!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "A few things to note if your trying to decide where to stay. This hotel was within walking distance of the main town so you could walk everywhere without the need of a car.", "title": "Stayed twice, rooms great both times", "helpfulness": 3, "user": "SMMB", "date": "April 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7338175, "likes": {"liked": "— Location and room size", "disliked": "— Limited on site services"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "A very clean and modern facility situated right across the road from Lake Wakatipu, an easy 5-minute walk southwest of the town centre. We were a group of six in a very spacious three-bedroom apartment (full kitchen, dining room, living room, laundry facilities, and each bedroom with an ensuite bathroom) on the ground floor, with huge lakefront windows and an outdoor terrace. This worked perfectly for our group. A friend of ours stayed in a more conventional room on the 5th floor, which was a decent size for one or two people, had a small kitchen, and featured a limited view of the lake. This is not a full-service hotel – there is apparently a breakfast lounge (we neither saw it nor went looking for it), but no room service or other similar amenities – that was fine with us, however.", "title": "Beautiful spot in Queenstown", "helpfulness": 4, "user": "TorontoTim", "date": "January 12, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6584397}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed 5 nights in one of the two bedroom apartments - unit 510 to be precise. What an incredible unit and view!!!", "title": "One of best views in the city!", "helpfulness": 3, "user": "caymancaribbeansun", "date": "January 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6552580, "likes": {"liked": "— Best views in the city", "disliked": "— Unit could have been cleaner - cobwebs etc."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The fifth floor is the top floor of the front portion of the hotel (floors 6+ are set a bit further back up the hill). Our unit was a corner unit with a wraparound balcony and unobstructed views of the lake and the Remarkables.", "title": "Very helpful and comfortable", "helpfulness": 3, "user": "megsnan", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6548206, "likes": {"liked": "— Convenient location and very helpful", "disliked": "— Cramped room first night"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Unit included a full modern kitchen, plasma TV with surround sound, internet hookups and a balcony that was were we spent most of our time in the unit. The hotel is a very easy stroll into town and all the restaurants and activities that Queenstown has to offer.", "title": "Fabulous place", "helpfulness": 3, "user": "brianhdc", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6364629}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I would recommend this place in a second!", "title": "Great stay at the Outrigger at the Beacon", "helpfulness": 3, "user": "Suzanne", "date": "November 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6134567}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I can't believe the view from our tenth floor room/suite! Lake Wakatipu and the Remarkables mountain ranges are layed out right in front of us from our panoramic windows and balconey. The view is so stunning that from morning until night, neither my partner or I want to step out of the room. Nonetheless, the fun of Queenstown is just a few steps away from the hotel.", "title": "Awe-inspring View", "helpfulness": 1, "user": "kiwitravelerpdx", "date": "November 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6089995, "likes": {"liked": "— Modern furniishings, comfortable bed, and spectacular view", "disliked": "— Nothing I didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The Outrigger Beacon is a cool place to stay even though it is not a full serviced hotel--i.e. no restaurant or bar (though breakfast is served in a breakfast lounge). In fact, reception isn't even on hand 24 hours a day. At check in we were told reception opened at 7:00A and departed at 10:00P. Guests to have access to a minimally equipped fitness room and free laundry. Parking is also complimentary.", "title": "Ideal location", "user": "saintsontour", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6045059}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The rooms are outstanding--comfy beds, modern baths, and nice sitting areas. And did I mention the views?", "title": "Good Location Excellent Views", "user": "NickSambrook", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5926013, "likes": {"liked": "— Views", "disliked": "— Romm layouts"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If it were possible, I'd spend the rest of my life here! Yes, I'll come again.", "title": "What a view!", "helpfulness": 1, "user": "Reni10", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5795411, "likes": {"liked": "— The View", "disliked": "— The bad sound insulation"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed 2 nights in Oct/Nov 2006 at Outrigger. Overall, we were very disappointed and would not stay there again. Firstly, we were directed to our room to find cleaning staff still preparing the room. Rather than being advised to contact front desk we were left to stand in the car park with our luggage while waiting for the room to be finished. Then, we discovered that our 'deluxe hotel room' was a tiny room which did not include anything to sit on other than the bed nor was there a seat on the balcony to enjoy the view that we had payed extra for. As we were trying to unpack, our door was then opened by a staff member who seemed very surprised to see us there! Staff did eventually find us a chair --- we were informed that rooms at Outrigger are furnished individually and there is no guarantee as to what you will find in your room. Unlike other reviews, when we tried to raise our concerns, we were informed that it had nothing to do with Outrigger and that we would have to discuss it with the booking agents. That night, we enjoyed the sounds (and smells) of our neighbours in the adjoining apartment as they prepared their steak meal and unpacked in the connecting room. We discovered that there was only a very thin door that separated us from them. On the day of our departure, we were awoken by staff knocking on our door at 8.30am to ask when we were leaving. Given check-out time was 10am. we informed them that we would be leaving then. About half hour later, we heard water dripping over the balcony from above, quickly followed by a down-pour of water that lasted for about 10 minutes, causing us to close the balcony door so we wouldn't get drenched. On check-out when we mentioned this to staff (thinking they may be concerned) she pleasantly and unapologetically informed us that the water came from the spa in the apartment above which was being cleaned. Hmmm..... There are plenty of places to stay at Queenstown -- if you're considering one of the hotel rooms rather than apartments, think twice before booking Outrigger at Beacon.", "title": "Very disappointed", "helpfulness": 2, "user": "slowtravellers", "date": "March 31, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7260972, "likes": {"liked": "— the view", "disliked": "— unhelpful staff, small room, noise, spa water from above being dumped on our balcony"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I was quite surprised by the quality of the hotel. I booked a simple one-bedroom room.", "title": "Wonderful Hotel/View", "helpfulness": 3, "user": "GameJunkie", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7228893, "likes": {"liked": "— The View", "disliked": "— Hotel structure is two units, so it requires two elevator rides to get to the upper floors."}}, {"rating": 4.0, "title": "Quite good", "text": "The room was incredibly clean with a nice shower area with really hot water (if you choose that setting) and great pressure. It looked like they even had heated floors which is something I've never seen before. Must be useful during ski season.", "helpfulness": 3, "user": "sinbarambam", "date": "March 16, 2007", "id": 7170945}, {"rating": 5.0, "title": "loved the outrigger - absolutely beautiiful", "text": "The 9th floor room was very spacious with a wonderful view of the bay and the courtyard.", "helpfulness": 2, "user": "cshIpoh", "date": "March 15, 2007", "id": 7163581}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Location is about a 5 minute walk to the heart of Queenstown, so it's a leisurely stroll through the bay.", "title": "Great Stay", "helpfulness": 3, "user": "Stacey W", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6783891, "likes": {"liked": "— Location was great, flat 5 minute walk into town along the lake", "disliked": "— Nothing!"}}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 23, "average": 36, "very good": 99, "terrible": 18, "excellent": 148}, "aka": "Peppers Beacon Queenstown", "slim_ranking": 0.491803278689, "description": "Located on New Zealand's South Island, Peppers Beacon, Queenstown offers stunning lakeside hotel accommodation, just 5-minutes walk from the centre of Queenstown. Known as the \"Adventure Capital\" of New Zealand, Queenstown is an exciting year-round destination with a range of activities and attractions including skiing, snowboarding, tramping through national parks, scenic tours, bungee jumping and jet boat rides to name a few."}