{"user_rating": 4.0, "review_count": 125, "name": "Peppers Moonah Links Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at the Moonah Links Resort for a long weekend in a 1 bedroom appartment. This was averagely sized with all facilities needed. There is a nicely decorated lounge, dining area and kitchen (no oven but does have a hob and microwave) all in one with separate bedroom and bathroom. The appartment was clean with good views across the golf course. If your after a quiet, relaxing gettaway this is a good place to stay with the natural hot springs situated around a 5 minute drive away. This would be an even nicer place to stay in the warmer months.", "title": "Good Location with nice appartments", "user": "Traveller-English", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39384430}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This was our 2nd visit to the property. The first was several years back and we used it only as a stopover. We regretted than not to have stayed longer and this time we made amends. We stayed in a 1-bedroom apartment for 2 nights, which was nicely appointed. The only strange thing about the furnishing was the carpet in the living room which had folds in it, to which I kept tripping over. A tip to fellow travellers who are thinking of booking this property is to monitor the website for last minute deals. You are able to view the availability of the rooms 2 weeks prior to the actual date. We managed to get a AUD$100 off each night we booked by going through this channel.", "title": "This is the place to get away from it all", "helpfulness": 1, "user": "CripTic", "date": "June 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 32574867}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Just returned from a weekend away at Peppers Moonah Links & had a lovely time.", "title": "Lovely getaway", "helpfulness": 2, "user": "Leasha", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7362437}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "My partner & I stayed in a modern one bedroom suite (Room no. 31) & the only fault we could say was that it was a little dusty & only due to my severe allergies could this be noticed.", "title": "Great stay!", "helpfulness": 3, "user": "hmhmhm", "date": "January 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6705803}, {"rating": 4.0, "title": "Nice", "text": "As you can see from our photos it was quite roomy. The suite included:", "helpfulness": 5, "user": "carls888", "date": "January 22, 2006", "id": 4368451}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Stayed at Peppers Moonah Links for 4 nights whilst attending a business conference.", "title": "Nice Golf Resort", "helpfulness": 1, "user": "Jove99", "date": "March 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 59605820}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The resort is very well layed out. The rooms are very large with seperate bedroom and large living area. The bathrooms are huge. It was very clean.", "title": "architectural students be insprired!", "user": "taqueeney", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58874167}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "If you are an avid golfer (which I am not), you would be in Nirvana. As a non golfer, a weekend stay would be more than ample. There is not a lot else to do.", "title": "Great Rooms", "user": "NikkoMelbourne", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 54073642}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The food on-site whilst nicely presented, was fairly average.", "title": "Spacious rooms, fantastic service and very relaxing!", "user": "WelshScott", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51926544}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Wireless broadband access is available but be warned - it only works in the main reception/restuarant pavillion - it will not work from your room.", "title": "Lovely break from the city..", "user": "HappyFamilyMelbourne", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 46966906}, {"rating": 5.0, "title": "Best accomodation near the only natural Hot Springs in Australia and a heaven for Golf lovers", "text": "I've discovered Peppers Moonah Links accidentally while planning my trip to the Peninsula Hot Springs. The Springs do not have their own accomodation yet, but with the Peppers being near by and offering free transfers this problem was nicely solved. During my 9-day stay I have thoroughly enjoyed my spacious modern and very private room with a fantastic outlook to the Moonah Links Golf Course, as well as the services of the friendly hotel's staff. It is a great place to visit for those who enjoy bathing in natural hot springs and playing golf, or simply want to hide away (in style) and reflect on life letting their soul to rest. Also, I think, it would be an inspiring place for an artist. My friend joined me later and we had fun travelling on Peninsula, shopping, dining, picking our own cherries on the farm, unwinding in the springs and the spa...", "helpfulness": 1, "user": "GCtraveler2010", "date": "December 10, 2010", "id": 89544742}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Having stayed at Peppers Moonah Links in the last week, I can only assure you it is a great hotel and worth the trip, especially if you love golf. The service was fantastic, the team there love to look after you at both the front desk and also in food and beverage. I can see why both courses are voted in the top 20 in Australia and how this hotel gets the title \"home of Australian Golf\". The golf pro shop team are very friendly and knowledgable and this place is the highlight of the region. A great stay, great team and great time... I'll be back for sure.", "title": "What a spot and what a shot!!", "user": "HarleyBrisbane", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89101466}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Having stayed here on about 8 different occasions over the past 2 years i continue to go back.", "title": "Frequent stayer here", "user": "powellbl", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 86472081}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "although the resort is a 10 minute drive inland from busy rosebud you are booking for accommodation on a gold resort not a seaside retreat so you understand that if you want shops or restaurants or the beach you need to drive. Far enough!!", "title": "Service was very poor", "helpfulness": 1, "user": "Aussietourist1982", "date": "August 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 74533175}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The accommodation here is great, really clean, well equipped and definately worthy of its 4.5 star rating. Always stay in the nice one bedroom suites overlooking the golf green. A lazy drink or bar snack in the lounge adjoining the resorts restaurant is a must. Great way to spend a sunny lazy afternoon. You can eat dinner in the lounge from a bar/snack menu for half the price of the restaurant and the quality of what comes from the kitchen is fine. i.e. burger/pizza/fish and chips/risotto/pasta (you get the idea). Staff on reception and in the restuarant and bar are great. A really great place to stay away from the hussle and bussle. Grab a bargin on Wotif.com.au you will be glad you did.", "title": "a little remote", "user": "albertst", "date": "June 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 66098185}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed here for a quiet weekend and it was certainly that. Set in the countryside of the Mornington Peninsula and surrounded by 2 18-hole golf courses and the resort is very quiet. The room was excellent, the on-site bar and restaurant were too. The hotel staff were friendly and helpful. The non-golf facilities were disappointing though. The outdoor swimming pool was small and was closed. The \"hotel\" gym is in the next door golf academy but is unavailable when golfers are staying (which seems to happen quite regularly) - during this time a few free weights are available in the \"games\" room.", "title": "Great rural location", "helpfulness": 1, "user": "Kevin B", "date": "June 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 114124217}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was the most expensive hotel during our recent trip and whilst the room was probably amongst the best the facilities weren't.", "title": "Fine but not quite as good as it thinks it is", "helpfulness": 2, "user": "highfly", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 113496503}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Room really lovely (open room) big bath, good shower, comfy bed, very modern, terrace with golf course outlook, dressing gowns, safe.", "title": "Great location", "user": "iainHunter", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107030949}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My gripes would be that I booked here primarily for two reasons - access to a gym and access to free wifi. After staying in a couple of super apartments,but with few facilities we were looking forward to paying a bit more and getting the additional facilities. Wrong. Wifi worked for about 10 mins. Signal really patchy. Queried at reception and they said it was a problem and they were trying to get it throughout resort. Ok if you are on a weekend from Melbourne but if you are half way round the world away from home then internet access is quite important.", "title": "Wonderful, relaxing location", "user": "Scottygirl", "date": "February 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98069984}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Other issue is that gym was not available. Apparently it is in the golf academy and when they are using it then hotel guests can't. They put on a temp gym - without even a treadmill - so basically useless. I have just looked at web site and it does say gym subject to availability - I don't know if that was there when I booked - or maybe I just couldn't conceive of a gym being \"unavailable\" Anyway - they should say that there is no hotel gym but you may be able to access another, subject to availability.", "title": "Lovely golf resort and great for mornington travel stopover", "helpfulness": 1, "user": "Travelwith2kids2013", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 93186566}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 10, "average": 21, "very good": 54, "terrible": 3, "excellent": 37}, "aka": "Peppers Moonah Links Hotel Rosebud", "slim_ranking": 1.0, "description": "Located on Victoria's Mornington Peninsula, Peppers Moonah Links Resort is one of Australia's most unique leisure resorts, featuring luxury accommodation, two 18 hole championship golf courses and an endota spa. Peppers Moonah Links Mornington Peninsula offers guests luxury accommodation in 96 deluxe rooms and suites, all with balconies overlooking the stunning course or putting green."}