{"user_rating": 4.5, "review_count": 70, "name": "Percy's Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I'd been looking forward to this date for a couple of months. My grandfather's 80th birthday and the first time in a good five years or so, that the whole family had managed to get together. We'd all paid the £150 for the night each, and thought it would be well worth it. A night away in beautiful surroundings, with an acclaimed chef cooking organic produce from her own stock, and using vegetables and herbs from their gardens.", "title": "Beautiful lamb, but that's where it ends....", "helpfulness": 4, "user": "ZeusnGoose", "date": "March 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7197748, "likes": {"liked": "— The fact we had our own kitchen", "disliked": "— It was very average"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "There were 10 of us in total, the \"kids\" took the seperate out building, which, granted, had its own kitchen, and each room its own bathroom as you'd hope. It did also home a HUGE living area with sofas and dining table, although I'm not sure you'd want to share with other couples whom you didn't know?", "title": "Loved the setting didnt like the bill !!", "helpfulness": 4, "user": "Stonemasons", "date": "May 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 5187798}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The evening meal was 50/50, the lamb and pork were, I have to admit - out of this world. Tender, organic, melt in the mouth delicious, but the rest left a lot to be desired. Breakfast too, wasn't up to much I'm afraid, and agree with an earlier comment about the sausages and too much garlic!", "title": "The great points far out weigh the negative", "helpfulness": 3, "user": "Iain5Lewis", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5010374}, {"rating": 3.0, "title": "Servcice unbecoming of price.", "text": "The hosts were very disappointing, although I think that could be more to do with the fact they appeared to be socially inept, as opposed to just rude. I think it was probably more ignorance than arrogance.", "helpfulness": 3, "user": "TheClaydon", "date": "April 19, 2006", "id": 4988039}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "We had 5 different rooms throughout the hotel, and unfortunately only two of the 5 whirlpool baths \"whirled\" which was a shame, because it's things like this that they add on their website to string you in, and added extras that when dont work, cause disappointment.", "title": "Overpriced", "helpfulness": 4, "user": "janethirtyone", "date": "February 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 4448567}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "Having stayed in a number of Johansens recommended hotels we chose this after having to cancel a trip to the US.", "title": "Not bad", "helpfulness": 4, "user": "Sianiflwog", "date": "January 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 4357739}, {"rating": 5.0, "title": "Peaceful Location", "text": "The location is very rural, very peaceful and just what we wanted. The conversion works undertaken are very extensive and finished to a very high standard.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 28, 2005", "id": 3306314}, {"rating": 5.0, "title": "Fantastic", "text": "Down side - we stayed for three nights and every night the dinner menu was virtually the same! When there are only three choices and one of them is something you don't like it does limit the choice somewhat. The food is excellent, but more imagination required.", "helpfulness": 3, "user": "Mike T", "date": "December 4, 2004", "id": 2863328}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 6, "average": 8, "very good": 8, "terrible": 0, "excellent": 48}, "aka": "Percys Hotel Virginstow", "slim_ranking": 1.0, "description": "Set in 130-acres of stunning countryside, streams and woodland, the panoramic views extend over both Bodmin moor and Dartmoor. This luxury privately owned country hotel offers peace and tranquility in a relaxed and informal environment with extensive organic kitchen gardens and 60 acres of woodland. Unpretentious dining, free Wi-Fi and parking. Dogs welcome in some of the rooms.Hotel awards include South West Small Hotel of the Year for two years running and runner up for Small Hotel of the Year for Great Britain. Each of the 7 en-suite bedrooms has its own unique character. All of the rooms are spacious and are equipped with king size beds, Egyptian cotton linen and fluffy towels and robes as standard. What they do share however is a homely ambiance infused with luxurious touches and comforts. Every room includes complimentary Wi-Fi access, flat screen TV, DVD player, designer toiletries and much more besides. There is a range of room types available, from Standard, Superior and Deluxe options as well as one suite.Among the many restaurant awards, an article written by by Giles Coren gave Percy’s 9/10. Diners are well looked after and are treated to a culinary experience to remember. Specializing in modern British cuisine, everything is cooked to order beautifully presented. Flavoursome rather than fussy, all dishes are made from the very finest locally sourced or homegrown organic ingredients. Lamb & pork are reared on the Estate and the kitchen garden provides vegetables, herbs, salad leaves. The two orchards provide apples which are juiced and offered to guests for breakfast.The peaceful surroundings and excellent grounds make Percy’s an ideal venue for special celebrations and private hire."}