{"user_rating": 4.0, "review_count": 212, "name": "Perdikia Beach", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Rooms are ok.breakfast basic.maid service is good rooms are spot less.our air con didn't work was told someone would come and fix and they didn't.beds are very very hard.round the pool and eating area could do with updating and a good clean. Sun loungers are dirty.do not use turkisk baths there.my stay at this hotel didn't spoil my time in turkey.", "title": "Wouldn't go back", "helpfulness": 1, "user": "Caroline H", "date": "October 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 142230098}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My friend and I returned from the above hotel last Monday and we had a lovely stay. The rooms were very clean - always had clean towels and bed linen and the shower was always hot. The hotel is situated in a good position just off the main strip. We found the staff very pleasant - we stayed b/b and there was always ample also there was a chef that would cook omelettes pancakes eggs to all tastes if you wished. I would certainly stay there again - we had lovely weather and this was my 3rd visit to Olu Deniz", "title": "Perdikia Beach Hotel Olu Deniz", "helpfulness": 1, "user": "pinacoladobabe", "date": "October 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 141973969}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at this hotel for 11nights and the staff were helpful from start to finish!", "title": "Great hotel and location", "helpfulness": 3, "user": "LoraA_11", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141763836}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We arrived at 4am and the man on reception offered to make us both a sandwich, but as we were so tired we decline. Our room was great, a nice double bed and the room was of a reasonable size! I know there have been complaints about the A/C but ours worked perfectly, had to turn it off as we were too cold some nights! Our bathroom wasn't very big but it wasnt as small as some people have made out! We did have a slight drip every so often in our shower, but we shut the door and it was fine.", "title": "Very good value for the money. Recommended.", "user": "MartinaRe", "date": "September 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "location": 4.0, "service": 3.0}, "id": 141575929}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "The food was really very good! We were half board and had planned to go out every so often for dinner, but we didnt once as the food was of such a high quality and was always different!", "title": "Enjoyable Stay", "user": "Gamer_TT", "date": "September 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 141556029}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "First thing you'll notice are the tiny, well worn rooms (thats if your lucky enough to have a room when you arrive, we were sent to another hotel for a night because it was overbooked - just what you need after a four hour flight and a nightmare transfer where the driver had no idea where this place was) Balconys are tiny too, threes a crowd! Expensive pool side drinks and snacks, and its forbidden to consume your own food/drinks purchased from off site. Food average for Turkey but evening meal is late 20:00, stomach thought my throat had been cut. Been to several Turkish hotels and this has to be, by far the most unfriendly place I've ever stayed in. If all this sounds appealing come ahead you'll realise I'm not exaggerating. Oh and by the way no English tv. Forget other reviews that mention spotless rooms, friendly staff etc. its either the raki talking or they're writing their own reviews.", "title": "Tiny ........", "helpfulness": 2, "user": "pj200", "date": "September 23, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 140975599}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Spent a week here in september 2012. First impression was that room was very small and balcony also. Our view of the pool was obscured by large trees but most rooms have a view. Clean and tidy with maid service every day.we were half board but the hotel offered lunches at a good price. The hotel had a annoying policy of not allowing any items bought outside, such as bottled water and snacks etc to be brought in,so you were forced to buy their stuff. Very good location, just 2 minutes walk to the bars, restaurants and shops, but no noise problems. Staff were attentive and polite. You have to run a tab as staff cannot take cash so keep an eye on what you spend,we were surprised to get a £200 bill at the end of the week. Maybe best to settle up at the end of each day. All in all ok for 3 star.", "title": "you get what you pay for", "user": "petmag", "date": "September 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 140865403}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed at Perdikia 24 May for 14 nights. We had never visited Turkey before, I was so unsure, but thought, hey, lets try it (for hubbys sake really). What a lovely holiday, one of the best ever. The hotel was very clean, breakfast good, some people do moan but what do they want? Such a quiet pretty peaceful hotel, would definitely go again. Only problem was the evenings were a bit chilly, not like here of course but the first week we had to buy a jacket for my little boy to wear. Luckily we wore the jackets we travelled in. When we arrived 'Shrek' the security guy had a thick arran jumper on, i thought oh dear! By the second week it was fab, the evenings were lovely NO MORE JACKETS, we never had a bad meal, desperate to go back, even my daughter loved it. Just watch the young turkey guys, they have roaving eyes but after many mommy looks it was fine. The web cam facility was fab at Buzz Beach bar, we text home and they logged on and saw us, fantastic. Billys Beach was good, also the 6 island trip, £7 each, not bad but watch for the 'extras' ice cream, drinks, photos, all in all an excellent holiday, really want to go back!!", "title": "Fabulous", "helpfulness": 2, "user": "poppa2368", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140833332}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "I'm still here in the perdikia and I'm more than happy overall . No complaints even if I tried , location perfect ,food, staff, which I think definitely makes any hotel, hats off to the chef too , I'll stop there or I'll be writing a book, Kev ov grimsby", "title": "Would come back and recommend", "helpfulness": 1, "user": "Kevrobbo", "date": "September 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 140421640}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed at the Perdikia Beach Hotel for the second year running, This time we went end of August into September. We think the hotel rooms are very clean, they were cleaned every day with fresh towels etc, they were small but served the purpose. We stayed half board and found the food to be lovely, breakfast there was plenty of choice from cereals and fruit, a version of a cooked breakfast i.e. eggs, beans, meat etc. They also made fresh pancakes and omelette twice a week. Evening meal was pretty consistent with soup to start, then salad followed by your main meal, with a selection of fruit and desserts to finish, but all was fresh and tasted lovely. The only fault we could find with the hotel was with the air conditioning. There simply isn't one, the one that was there was noisy and ineffective. This made us consistently tired as we never slept well for the entire holiday, leaving us feeling exhausted. In our opinion this needs updating desperately, or they will lose bookings. We will not go back there due to this, which is a shame as the hotel was lovely. We will definately look around for another hotel.", "title": "\"Lovely hotel, ruined by the air con!\"", "helpfulness": 1, "user": "Trace262", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 139934163}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "We stayed in the Perdikia Beach for a week at the start of September. We were quite impressed with our room as soon as we walked in, after reading other reviews and seeing pictures. Our room was very modern and had a nice shower room. The room also had a pool view which I loved! The room was also a bit on the small side but that didnt worry us too much. The only problem was the aircon! It worked but just not good enough! Especially after other stays in Turkey and knowing wat the aircon can actually be like. Although we didnt complain as our room was pretty good otherwise and didnt want to be moved to a room we really didnt like. Our room number was 104, it was on the ground floor so saved us walking the stairs!", "title": "Lovely hotel, good location, but bad air con!", "helpfulness": 1, "user": "Sourzzzzz", "date": "September 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 139864416}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel staff were lovely and friendly enough. The food at breakfast and lunch was pretty basic, most days we went out for breakfast as I just couldnt stomach it myself, but it is just the normal continental breakfasts you would expect.", "title": "perdikia beach hotel", "helpfulness": 1, "user": "grant h", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 139329966}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "The location of the hotel was fantastic, just a few minutes walk from the main strip, but still far enough away that noise wasn't a problem. And the beach just a further couple of mins away.", "title": "Staff not at all helpfull", "user": "Debbaker", "date": "September 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 139196491}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "All in all I would definitely recommend this hotel if they upgrade their air con systems", "title": "Great stay in Olu Deniz", "user": "Debbie M", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 139047417}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "stayed at the perdikia for 11 nights from august 18th, was a tad concerned having read some of the reviews but all in all it was really quite good.", "title": "Fantastic Place in Turkey", "helpfulness": 3, "user": "clive T", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138660829}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Made a late booking through Thomson only a few days before I went and purely chose on price and I wanted to be there Air festival time as the other times I had been to OD it was usually just before or after. I was only disappointed by the weather on the last couple of days but somebody must have upset him upstairs.", "title": "Good value", "helpfulness": 4, "user": "cabby289", "date": "November 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145719099}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Have stayed at Belcekiz before and would have returned again but the price was ridiculous as was most of the other hotels as this time I travelled alone.", "title": "nice for a chill out not ideal for kids", "helpfulness": 4, "user": "scouseWalsall", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142912572}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Was just B & B this time as I thought it was a good chance to use the local bars and restaurants that many reveiwer used and had given glowing reports about.", "title": "ANOTHER EXCELLENT STAY !!!!", "helpfulness": 6, "user": "Adam1100", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142895257}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Room was small but only me and had the luxury of a 5 foot bed so happy and the maid was lovely girl who kept it very clean.", "title": "Another great stay at the Perdikia Beach", "helpfulness": 4, "user": "Debbie L", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142663319}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "All the staff I encountered were very good.", "title": "Back with the ideal friendly hotel/staff", "helpfulness": 2, "user": "margaret80", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142384008}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 3, "variance": {"poor": 6, "average": 30, "very good": 78, "terrible": 7, "excellent": 91}, "aka": "Perdikia Beach Hotel", "slim_ranking": 0.35, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}