{"user_rating": 4.5, "review_count": 202, "name": "Petite Auberge Les Bons Matins", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Our first time staying here; it came recommended by friends who have stayed several times. We spent wo nights in luxury suites (502 & 601) to celebrate our anniversary. There was a mix-up with another guest so we did not have the same room both nights. We are flexible so we were not unduly bothered; they were apologetic and adjusted the rate, also. Loved both rooms. If you really love having natural light, one of the lower-level rooms (eg 502) probably isn't for you, but in winter or for some people it won't matter and the room was just lovely. The many photos on their website really do give you a good idea of what to expect with each of the rooms we booked. We found both beds quite comfortable. The whirlpool tubs really only fit one person comfortably, but because both of ours were basically in the living rooms, it made for some humorous and delightful socializing even while bathing. We enjoyed the funky, eclectic, colorful and cheerful décor. There were amenities in our suites we did not use (music system for DVD's, TV). Alex, at the front desk, was helpful and welcoming and funny. Breakfast was fabulous (as has been noted by every review I read!)", "title": "Wonderful in so many ways -- highly recommended", "user": "40somethingTraveler", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 33494605}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The location is terrific -- there is a lively street scene just a few blocks away, and we enjoyed Ethiopian, Lebanese and Vietnamese food within just a few blocks. We recommend \"Mekdala\" or maybe it's \"Megdala\" Ethiopian on either Rue Bishop or Crescent -- delicious, comfortable, and very inexpensive. Being within a half-block to the metro was very helpful. The block is quiet, surprisingly so, tucked away in an otherwise rather central location. Our rooms were quiet, too.", "title": "Comfort, Comfort", "user": "ChampsNZ", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 32835582}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We look forward to returning sometime when we can have the whirlpool and the fireplace operating at the same time, ideally after catching a hockey game in the nearby Bell Centre!", "title": "Thin Walls-Thick French Toast", "helpfulness": 1, "user": "andylipp", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 30560672}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "We found this bed and breakfast to be well worth the money. The rooms were clean and tidy and very very comfortable. The breakfast was amazing and nothing was too much trouble for any of the staff who were so friendly and went out of their way to make our stay great.", "title": "WONDERFUL TIME at this wonderful gem", "helpfulness": 2, "user": "rmwhitt", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25345645}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "My wife and I stayed here for 3 nights in late May and really enjoyed it. Check-in was a breeze. Ev, the desk clerk, quickly fixed a few minor problems we had (like room temperature) and then gave us meticulous directions to our dinner destination. She also took the time to show us the lay of the land on the Montreal map (as it was our first visit to the city). We found free on-street parking and could easily walk to the metro station at the end of the block. Plus, many of Montreal’s attractions and restaurants are within walking distance from this B & B.", "title": "Wonderful place!", "user": "Carlotta-italy", "date": "December 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22344709, "likes": {"liked": "— breakfast!", "disliked": "— cant think of anything"}}, {"rating": 2.0, "title": "Bait and Switch", "text": "LIES. LIES. LIES. That is what we received from the front desk staff. We booked our room in May for July. When we arrived, we were told that the room we booked was \"out of order.\" There was a plumbing problem and we were being moved to a new room. It amazed me because I had read a review from a previous guest that had the same experience. The room wasn't good enough for us but, they let someone else stay in our room.", "helpfulness": 7, "user": "stlydr", "date": "July 27, 2005", "id": 3702537}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "We weren't happy. I told them what I had read on the internet ,and the lies began. Because it was late, and we were on our honeymoon, we let them show us the \"new room.\" It was beautiful, so we stayed. The gentleman said we could have \"free\" parking for our trouble. He meant \"free\" until we checked out. They tried to bill us for parking, and they told us the city had raised the taxes so the amount they told us we owed was higher than what we were previously quoted. They did buy us fancy chocolate to make up for our troubles...and maybe to keep us from writing a bad review.", "title": "Superb, friendly, artistic and stylish", "helpfulness": 6, "user": "bortiuk", "date": "June 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3534556}, {"rating": 3.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "Having said all this, WE LOVED OUR ROOM. It was room 706. Book that room.", "title": "Great if you're in Montreal as a tourist, not on business", "helpfulness": 5, "user": "AJMurray", "date": "May 5, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3439989}, {"rating": 1.0, "stay_parameters": "Stayed July 2004", "text": "It was spacious and comfortable. The people serving breakfast were charming and the food fantastic. You are real close to subway so you can get everywhere quickly.", "title": "Can never go here again", "helpfulness": 6, "user": "lauri_amber", "date": "April 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 3351370}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We booked after seeing the beautiful photos on their website. It was terrific being able to choose the ideal decor and facilities in advance.", "title": "Great place", "helpfulness": 2, "user": "happytravels28", "date": "March 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3251184}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We discovered this B&B online and we didn't think anything of it at first. When we arrived at this Inn, we were pleasantly welcomed by a warm staff especially Alex and Jacklyn. We had reserved a deluxe suite, the 601 for our Honeymoon which was during the holidays and it was just as we'd imagined but we'd also seen it on the website. The place was clean and quiet. Their breakfast is just to die for, everything is freshly made and the service is very friendly.", "title": "AMAZING!!!!!", "helpfulness": 2, "user": "Montrealmagnet", "date": "February 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3105281}, {"rating": 4.0, "title": "Alright, but not fantastic.", "text": "After reading the glowing reviews, my new husband and I booked our honeymoon stay here. Our reception was pleasant, but not warm. Our room was lovely, complete with canopy bed and jacuzzi tub for two. The breakfasts were plentiful and the waitresses lovely. The front desk staff, though, was disappointing. They weren't able to recommend any thing we asked about -- take out food, day spas, local attractions. Luckily, the internet access in the lobby came to the rescue!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 28, 2004", "id": 2606359}, {"rating": 4.0, "title": "Great place.", "text": "My wife and I stayed at Bons Matins over Labor Day Weekend 2004. After a nightmare at the Montreal airport getting into Canada, we finally got to the hotel after 9:00. The man working reception was very nice and helpful, showing us around the buildings and to our room, and even suggesting places to eat at the late hour.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 8, 2004", "id": 2518614}, {"rating": 5.0, "title": "Two big thumbs up.", "text": "The room was extremely nice, and very tastefully decorated. The breakfasts were wonderful, with a great eggs benedict (I don't even like eggs benedict).", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 3, 2004", "id": 1762963}, {"rating": 5.0, "title": "Highly Reccomended", "text": "The only complaint we have is that the maid service could do a better job. They never gave us clean glasses, and left our door unlocked after they were finished on two different occasions.", "user": "Jimisurf", "date": "March 12, 2004", "id": 1722614}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I felt right at home at the Les Bons Matins!", "title": "home away from home", "user": "lovejoypeace", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16600544, "likes": {"liked": "— everything", "disliked": "— stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The shared kitchen stocked with all the suppplies and soda were a bonus to this stylish B&B. We grabbed some glasses and plates and utensils to enjoy our wine and dessert, while soaking in the jacuzzie for two in our room.", "title": "Great Bed and Breakfast", "helpfulness": 1, "user": "krcSpringfield", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15106593, "likes": {"liked": "— People, location and food", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Speical Place in our Hearts", "text": "The staff was very helpful with directions and suggestions on where to eat and what to see. We absolutely loved this place and it's people and food!", "helpfulness": 1, "user": "DreaminofTravell", "date": "April 16, 2008", "id": 15080624}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We spent 4 days/3 nights at this charming B&B. The staff were incredibly helpful in making reservations, giving directions, answering questions. The room was just like the photo and very comfortable. We were under the reception area in 502, but weren't bothered by noise at all. Great room at a great rate. Both my husband and I loved the jacuzzi tub for two especially after a day walking everywhere. The breakfast was everything everyone has said. The cold buffet of cheese, quiche, fruit and breads was fresh and delicious. The waffles and french toast were excellent along with the sauces (although I had mine with syrupe). I had Eggs Benedict, once with bacon and once with ham. Delicious but I like lemon in my hollandaise. Location is fabulous! Can't say enough good things about this place. Will definitely return!", "title": "Very nice indeed", "user": "abe11", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14376382, "likes": {"liked": "— Location and staff", "disliked": "— parking is tricky and a gamble, yet fully disclosed."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My husband and I are former Montrealers (once a Montrealer, always a Montrealer!) and currently live a two hour drive away. We have stayed at Les Bons Matins many times over the past five years and just love this place. It offers us a home where our heart remains. The decor, the attention to detail, the helpful staff, the location and the incredible breakfasts are what we love. If we could live in one of the suites we would retire there. All that to say I highly recommend Les Bons Matins.", "title": "Not the best...", "user": "Bri_8", "date": "February 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 13769389, "likes": {"liked": "— breakfast", "disliked": "— noise, lack of sleep"}}, {"rating": 5.0, "title": "Fantastic", "text": "We stayed here in July 2006 for two nights, using it as our base to explore the fabulous Montreal. And I would highly recommend. They have a wide variety of rooms and suites, we stayed in a deluxe suite, and it was very private, large, super comfy bed, lovely furniture, fantastic, big whirlpool bath. We had our own key to come and go as we pleased. I found the staff to be really friendly and efficient. Breakfast was lovely with a nice choice of food.", "helpfulness": 1, "user": "picalil", "date": "July 24, 2006", "id": 5502811}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Equally as important and impressive was it's location - just a 2 minute walk from the very popular and lively Crescent Street, with its many bars and restaurants, and the extremly long and bustling St Catherine Street - the shopping mecca of Montreal.", "title": "Good value, great location", "user": "tapny", "date": "July 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5459320}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "It is also 30 seconds from Lucien L'Allier metro station. But because the weather was so nice we didn't end up using our 3 day metro pass, but walked everywhere, even down to the old port.", "title": "Great location and felt right at home", "helpfulness": 1, "user": "ChicagoAbraham", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5437141}, {"rating": 4.0, "title": "Great place to stay", "text": "In a nutshell - this B & B was very excellently located, and of very high standard. Thoroughly recommended!!", "helpfulness": 1, "user": "Bunco1", "date": "June 17, 2006", "id": 5356361}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We stayed only one night at this B&B. It was located right next to the metro stop, had free internet access (if one of the 2 computers were free), friendly staff, community fridge available (although someone else drank my bottle of water), was clean, comfortable, had a nice breakfast- lots of variety, pleasant decor and quiet. Minor complaints: I didn't like the tiny shower and bathroom -you couldn't adjust the water from outside the shower without being in the stream itself or keeping the floor dry. The tv was tiny (fine by me, not fine by my hubby), we had a laptop and they would have charged us $5 just to use their wireless service.", "title": "Recommended!", "helpfulness": 2, "user": "OnEwOrLd", "date": "May 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5236995}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I went to Montreal (from Boston) to celebrate our wedding anniversary. A friend had told us about Petite Auberge Les Bons Matins, so we thought we would give it a try. What a beautiful place. This B&B is different from usual B&Bs in that instead of the rooms all being in a house, it is comprised of several buildings along a block of row-houses.", "title": "A wonderful place!", "helpfulness": 1, "user": "Emm781", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47248921}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed in a suite (605), and it was like having our own little apartment. Our suite was on the first floor (up some stairs from the outside, so not on the ground level). We had a living room, bedroom, and gorgeous bathroom with whirlpool tub. There was a corner cabinet which housed a small fridge, microwave, toaster, plates, glasses, utensils, etc. The couch was very cozy, the bed nice and comfy. The room had some very unique and colorful furniture and artwork.", "title": "Quaint B&B near metro", "user": "DavNSueFM", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 46686573}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The breakfast was amazing. They have a lovely dining room where breakfast is served. The staff were very attentive and nice, and started us off with coffee or tea and fresh-squeezed juice, choice of waffles, french toast, or raisin french toast (or any combo thereof). Then they will make eggs to order, and you also have buffet tables with various breads, mini quiches, scones, jams... I could go on and on, but it's making me hungry. Suffice it to say it was wonderful.", "title": "Lovely Time in Montreal, QC", "user": "knufflebunny", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46469483}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We took advantage of the Metro which was just steps away from our door.", "title": "Excellent, sweet, we miss it! =)", "user": "OlgaMo", "date": "July 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36217530}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed over a weekend, when free parking is easy to find on the street. However, if parking is not available, they offer lot parking for $12 per day.", "title": "an odd little gem w/best breakfasts of any B&B", "user": "jerseyjazz", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34871375}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We went at Les Bons Matins about 6-7 times. In fact, since we have been there the first time, 3 years ago, we always stay there when we go to Montreal. All the walls are painted with bright colors like orange, yellow, blue... The decoration is very nice, with big paintings from a parent of the owner. The rooms have a lot of charm. Some are bigger than others. The web site of Les bons matins is very helpful to choose the room. It's true that you're not in a modern high standard hotel, so the floor may crack a little and the insonorisation is not perfect. The staff is very friendly. They welcome you with a free drink that you can take with staff and people from other rooms in the lobby or bring to you room. In this lobby, they offer free internet access (2 computers). The breakfast in the morning is very good. They serve fresh orange juice, eggs like you want (even benedict with smoked salmon). Their waffles, with passion fruit sauce, are delicious, Mmmmh! We tried their apartment option once because we were two families with children and it was great to have a kitchen with all commodities. In this option, the breakfast is not included, though.", "title": "Nice place, good breafast", "helpfulness": 7, "user": "Capucino", "date": "April 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4964257}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "Hi There", "title": "Not 5 Star Quality", "helpfulness": 5, "user": "TanjaB", "date": "March 26, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4735294}, {"rating": 5.0, "title": "Excellent B&B", "text": "We stayed at this B&B in 2002 and loved it very much. We had the opportunity to stay again this past weekend and I am very disappointed with the changes. In 2002 it was only a small place and since then they have bought several more townhouses and converted them over to their B&B. They used to have homebaked cookies for their guests, now they have store bought, the towels are dingy, and the overall cleanliness is poor to name just a few things.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 26, 2006", "id": 4522765}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed our first night in one of the rooms at the B&B and the next 3 nights in one of their Apts. Our breakfast was good. The breakfast we had in 2002 was terrific, there was a ton of food and they offered french toast and waffles on top of the eggs, bacon or ham. We were given 1/2 of a waffle with our eggs this time and we either got 1/2 slice of ham or just a couple pieces of bacon not to mention that the wicker place mats had mold on them which is very nasty first thing in the morning.", "title": "Wonderful Place", "helpfulness": 3, "user": "em1234em", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4124214}, {"rating": 5.0, "title": "Montreal Charm and Sophistication", "text": "We checked out of the single room and moved over to the Apt. the next day. The front entrance outside the Apt. had 4 piles of dog poop in front of the steps, the toilet tissue holder in the bathroom upstairs was ripped off the wall, the towels were very dingy actually grey looking, the place needed a very serious cleaning, the cupboards in the kitchen were sticky, there was old take out food in the frdge, there was the old shower stacked up on the patio outside the back door from the upstairs bath, there are holes in the wall going down stairs to the bedrooms, the bedding was cheap and old, there was caked dirt behind the bathroom door upstairs, etc. etc. etc.", "helpfulness": 2, "user": "jdebord", "date": "August 18, 2005", "id": 3787908}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "A really good little hotel. Very friendly staff and a family atmosphere. The breakfast was really first class, cooked fresh in front of the guests. Has a bohemian feel about it. Good location a few minutes walk from downtown. Only one problem that the floors are all wood so you can hear guests going up/down stairs, in the room next door and from the room above. Not a huge problem but given the age of the building it could sue some internal sound proofing. But I would definately come back!", "title": "Funky Bohemian in a central location", "user": "Pepysp", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20708359}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "the decor was so creative and beatuful with so much detail to everything. very comfortable, great bed and cozy room. service was also amazing. really nothing bad to say about it.. great great stay cant wait to go back!", "title": "Amazing In Every Way*", "user": "melly8", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20422068, "likes": {"liked": "— the room!! it was just beautiful!!! everything about it was perfect", "disliked": "— nothing, it was seriously all great for a B&B"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We (3 of us, Mum and Dad with 16 year old son) stayed for 2 nights while touring in Ontario and Quebec. The organisation was excellent, with computers provided in the reception area for the guests to use and a small kitchen area near our accommodation so that we could store food or drinks in a refrigerator, make tea, coffee, etc. (handy as my husband is a coffee addict!!). My only complaints are that the bathroom was a bit cramped for my men who are both 6ft plus and built like tanks and that our bed squeaked whenever my husband turned over. This kept son and I giggling for about an hour on the 1st night (mind you I had drunk most of a bottle of red wine with dinner!) We had a good sized room with a queen sized bed and a single. Breakfast was excellent, plenty of it, both hot and cold. Again, very well organised and efficient. All the staff were pleasant and helpful. There's a subway station at the end of the street and parking outside, although much of the city was easily within walking distance. We would happily return for another stay.", "title": "Good standard, good value", "user": "MrsBE", "date": "August 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 19503505, "likes": {"liked": "— Efficient, friendly, value, location, computer access", "disliked": "— small bathroom"}}, {"rating": 4.0, "title": "Return Visit", "text": "My husband and I returned to the same room again after 4 years. We were happy to see that everything stayed the same- the beauty of the decor, the pleasant and helpful staff and the GREAT breakfasts. We will def return in the future.", "user": "GivemeaTfortravel", "date": "August 12, 2008", "id": 18897353}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "We just returned from a trip through Canada and this was one of the B&B's we stayed at. They own about 4 buildings next to each other. The office is in one , the breakfast is in another and the rooms are in those two buildings and two others.", "title": "Great Place to Stay!", "user": "FloridaJunebug", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 18825196, "likes": {"liked": "— clean rooms, great food", "disliked": "— parking, stairs"}}], "location": {"country": "Canada", "city": "Montreal"}, "variance": {"poor": 6, "average": 12, "very good": 57, "terrible": 4, "excellent": 123}, "aka": "Petite Auberge Les Bons Matins Hotel", "slim_ranking": 0.175675675676, "description": "This charming inn is located in a magnificent early 20th century residence and offers guests the utmost comfort and service. Attention to the tiniest of details and unparalleled comfort bear witness to the perfect union of know-how and quality, providing guests with an unforgettable stay in a unique and charming establishment. Guests can enjoy the peaceful atmosphere of the inn, while making the most of its excellent location at the heart of downtown Montreal."}