{"user_rating": 4.0, "review_count": 462, "name": "Petit Palace Marques Santa Ana", "reviews": [{"rating": 4.0, "title": "Lovely hotel, great location, good deal for money", "text": "You can tell that even though this isn't a 4 star hotel, they take a lot of care to make the surroundings quite lovely. Really interesting modern decor and a lovely airy lobby with beautiful arches and a sun roof were especially nice touches. The free internet was a huge bonus, and the staff were helpful. The room, although a bit small, was clean and completely adequate. Shower was a bit hard to get to (sort of in a corner of the bathroom too close to the sink). Overall, we were very pleased.", "helpfulness": 2, "user": "boonyc", "date": "August 7, 2006", "id": 5575728}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I had high expectations for this hotel, it looked great on the website and was pleased that I could book a family room as so many hotels do not seem to offer 4 bedded rooms. However I feel that the hotel is far from high tech; the renovation is very Ikea-ish and has been fitted out cheaply with a disgusting tatty blanket masquerading as a throw on the bed. As others have said the sound proofing is non existent and although we had a room at the back overlooking a drab rooftop we had very little sleep. The conversations of those in the room above and next door were clearly audible and I am not really that keen on listening to other people 'at it'!", "title": "High expectations..poor performance", "helpfulness": 5, "user": "RomanNose", "date": "July 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 5528704, "likes": {"liked": "— The noise"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The bunk beds were hazardous as the top bunk did not have a gaurd rail so I had to fit a 5 and 7 year old into the bottom bunk each night and fold back the top bunk.", "title": "Great City – Great Hotel.", "helpfulness": 6, "user": "Geoff A", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5435325}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Breakfast is a complete rip off, we had it included in our rate so took advantage of it but don't expect anything appetising. On the first morning we went to breakfast at 10am with service due to finish at 10.30, the eggs and bacon had finished and there were no pastries left, another guest asked for more but the request was ignored. There was plenty of cold meats and cheese and a huge chocolate cake but perhaps surprisingly the orange juice was not freshly squeezed.", "title": "modern hotel in great location", "helpfulness": 4, "user": "Tilehurst Traveller", "date": "June 23, 2006", "detail_rating": {"rooms": 4.0}, "id": 5377913}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The rooftop is a missed opportunity, it would be great to have sun loungers and parasols to relax but instead just a few plastic benches.", "title": "Stop searching and book this hotel!!!", "helpfulness": 7, "user": "tangek", "date": "June 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5357071}, {"rating": 4.0, "title": "nice hotel, would recommend but betware if you are driving", "text": "One of the main reasons we booked this hotel was because of its location and garage. However upon arrival we were told their garage was full - they only have 15 spaces for the entire hotel. If you are driving and need parking make sure that you are guaranteed one of those spaces. Other than that we found the hotel perfectly quiet, comfortable and modern - would certainly recommend to others. The breakfast is very expensive though and not worth 12 euros per person.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739450}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Hotel was in an excellent central position with a nice central courtyard area. There was a bar but every time we visited it there were no staff present or it was shut. Did not eat breakfast in the hotel so cannot comment.", "title": "Disappointed", "helpfulness": 2, "user": "coppernob", "date": "June 14, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 3.0}, "id": 5349134}, {"rating": 4.0, "title": "Great choice for Seville", "text": "Disappointed with room. Very small and pokey. Later realised it must have been a single room; hence the lack of space. Bed was uncomfortable and noisy when ever you moved. There was air conditioning, but again this was noisy and would wake us up during the night when ever it switched on or off. Because the rooms are located around the central courtyard and the decor is marble and tiles, noise easily travels around the building leading to distrubed nights.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 15, 2006", "id": 5075630}, {"rating": 5.0, "title": "Best hotel in Spain Petit Palace Marques Santa Ana", "text": "Bathroom was poorly designed. Fixed shower door on the side of the bath meant there was limited access to get into the bath - had to squeeze throgh a small gap between toilet and bath. Huge glass sink which looked good but was highly impractical.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 15, 2006", "id": 4974482}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "This hotel is in a fantastic location, within walking distance of all the sites yet is really peaceful. On recommendation from another tripadvisor review we requested room 204 (we booked direct on the hotel's website). The room overlooks the internal courtyard so there is no noise from traffic. We didn't hear any of the other residents either. The bathroom is great (glass sink and double jet shower), the room was clean and comfortable. The minimalist design means that it feels a bit souless compared to the glamour of Seville, but it is a reliable choice - from what I have read about other hotels the rooms can be variable within a hotel so it was good to know that you were getting. If you turn left out of the hotel and left at the end of the road there is a great cafe for breakfast and lunches opposite the cathedral (Il Horno Buensomething).", "title": "clean, central, friendly", "helpfulness": 4, "user": "Laura_in_Spain", "date": "April 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4966289}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "I would definitely stay there again, but if I was going in the height of summer I would choose a hotel with a rooftop pool. Even in early May we would have welcomed a swim at the end of each day.", "title": "Fantastic Hotel", "helpfulness": 3, "user": "seangriffin", "date": "April 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4948418}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 45, "average": 86, "very good": 196, "terrible": 15, "excellent": 120}, "aka": "Petit Palace Marques Santa Ana Hotel", "slim_ranking": 0.446428571429, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 5.0}, "description": "Description: EXCELLENT LOCATION IN THE HEART OF THE HISTORIC QUARTER OF SEVILLE. ALL ROOMS ARE EQUIPPED WITH FREE WIFI AND LAPTOP! Hotel recommended in the Michelin Guide. Boutique-Hotel located in the city center, near the Cathedral and shopping area, from which all major tourist and historical zones are within walking distance: the City Hall, the Real Alcázar, La Giralda… Emblematic building dating from the middle of the XIX Century. The Petit Palace Marqués Santa Ana is a little piece of elegance and modern style tucked away in the historic city centre of majestic Seville. Vibrant colours invade this avant-garde boutique hotel whose décor breaks away from the traditional style that prevails throughout Andalusia. A modern proposal in hospitality, this hotel is a unique way to discover the magic of Seville in style and comfort. They also come with a full array of modern commodities, such as high-speed internet access, and there is also a highly efficient business centre, making this hotel an ideal choice for not only leisure vacationers but business travellers as well. The hotel offers the following FREE services: - Laptop in all rooms- WIFI connection in all rooms and communal zones.- Daily Press- Safety boxes (with capacity for a laptop)- Hydro-massage showers or bathtub in all rooms.- Information on local excursions, city maps, reservations for shows and restaurants.- Two internet points for public use.- Free bike rent ( subject to availability)- Luggage room.- Cots and buggies for kids on request- Complementary bedding and food bowls for your pet- XXL rooms and King size beds on request. - Flat screen TV with TDT- Disabled facilities. - Openbar (coffee, tea, juices and mineral water) More information:- City centre, next to “El Corte Inglés” department store.- Hotel parking- Show room for small meetings."}