{"user_rating": 4.5, "review_count": 517, "name": "Petite Auberge", "reviews": [{"rating": 5.0, "title": "Warmth and charm", "text": "We loved the Petite Auberge! We stayed there for 3 nights during our Honeymoon and were treated to a stay in the Petite Suite. We enjoyed walking down to our private entrance, relaxing on our garden deck, and savoring the fireplace inside the suite. The staff was very helpful and kind, especially with their assistance in helping us successfully find a bag we had mistakenly left in the taxi. The Petite Auberge is so conveniently located that it was easy to walk or take a cable car to all destinations. Do check out this Inn and you will not be disappointed.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3460013}, {"rating": 5.0, "title": "Service Beyond Compare!", "text": "I brought my wife to San Francisco for her first time for our anniversary from April 21-25, 2005 and selected the Petite Auberge based on the pictures and reviews I found online. Our experience with the Petite Auberge was EXCELLENT. We were very pleased with the friendly, helpful, and thoughtful staff, from the front desk to the maids, to the food servers at the free breakfasts. The room was beautiful, the extras provided by the staff for our anniversary trip (wine, Happy Anniversary balloons) without being reminded were very thoughtful and appreciated. The location of the Petite Auberge was much better than I had expected. Two blocks from the Powell Street Cable Cars, and two blocks over and three blocks down from Union Square (my only suggestion is that the Petite Auberge advertise this great location better on its website since I think it would be a plus). At breakfast, all the other guests we talked to were also very pleased with the Petite Auberge, I heard no complaints or criticisms of this great place to stay in San Francisco. If we come back to San Francisco, we will DEFINITELY stay at the Petite Auberge. Thanks.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 28, 2005", "id": 3421144}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "We stayed at the Petite Auberge for three nights prior to embarking on a cruise vacation and were simply overwhelmed by the treatment which we received at the inn located in the heart of San Francisco. It is hard to imagine that you could experience the warmth and charm of a bed and breakfast establishment in the middle of this vibrant city but that is exactly what we encountered during our stay. The staff was exceedingly friendly and helpful and the room cozy and comfortable. We particularly enjoyed meeting the other guests from all corners of the globe over breakfast in the morning and at the wine hour in the late afternoon. The Petite Auberge is within easy walking distance of a number of attractions and minutes from the Powell Street cable car. This is definitely a place that we will be returning to on our next trip to San Francisco.", "title": "A fabulous find", "helpfulness": 10, "user": "Meatsea", "date": "April 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3365919}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "My boyfriend and I came back from our trip to San Francisco and still talk about how we wish we were back at the Petite Auberge.", "title": "A perffect spot", "helpfulness": 10, "user": "imagegirl", "date": "April 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3344888}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "The Petite Auberge is tucked away, close to Union Square, Chinatown, and the trolley lines. It reminded us of our stay in Paris -- tiny room, but fantastic ambiance and service. Breakfast is served each morning in a delightfully decorated breakfast room. And I am talking about a full gourmet breakfast. Each evening (at 6 pm I recall) wine and hors d'oeuvres are served in the same area. We booked our room through gayot and got a great rate of $85/night -- in San Francisco!!!", "title": "The Best Kept Secret in San Francisco!", "helpfulness": 6, "user": "AJMF", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5505128, "likes": {"liked": "— Ambiance", "disliked": "— Tiny, tiny room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "There is another small boutique hotel property 2 doors down owned by the same folks, the White Swan, and it is lovely too!", "title": "Looking forward to returning", "helpfulness": 9, "user": "Sandra Levine", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5471279}, {"rating": 5.0, "title": "Small but beautifully formed....reet petite", "text": "Loved it and would love to return!!!", "helpfulness": 9, "user": "sallymarch", "date": "July 9, 2006", "id": 5441649}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We were in one of the rooms with a fireplace, adequate in size for two people, complete with comfortable mattress, reading lamps you could read by, and a clean and attractive bathroom.", "title": "Not the best, not the worst", "helpfulness": 11, "user": "MML2006", "date": "June 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5324951}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Petite Auberge is decorated to a fare-thee-well, but on the side of tastefulness. It truly recreates the feeling of an inn in France, except that here there is a sumptuous breakfast and not just a croissant, or piece of baguette, although these are offered, too.", "title": "Charming Anniversary Retreat", "helpfulness": 12, "user": "B_Pope", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5235397}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We stayed at Petite Auberge for 3 nights to attend a wedding in Chinatown and Union Square. The location was perfect as we could walk to all the wedding events as well as many daytrip adventures. The staff was super helpful with planning our excursions, facilitating our requests and sharing all their local info for restaurants and attractions. The room was certainly what we expected for an older small city hotel-- charming, cozy and quirky, yet very clean and reasonably quiet. The windows opened (love the fresh air!) to a lovely courtyard garden with lots of sunlight which also lets in city noises, but coming from NY that wasn't an issue for us. Breakfast is indeed wonderful, homemade cookies and free access to cold bottled waters and drinks throughout the day and evening was such a nice extra.", "title": "Perfect location", "helpfulness": 10, "user": "Buttongirl", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6002741, "likes": {"liked": "— location, amenities and service", "disliked": "— housekeeping too late in the day"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "While the location of this hotel and overal atmosphere are great, I have never experienced such paper thin walls in my life. I felt the people in the room above me were going to fall through. I heard every step and coversation. Granted, I am a light sleeper, but this hotel could use some updating. Staff were friendly and knowledgable. But I would not stay here again.", "title": "Noisy rooms!", "helpfulness": 5, "user": "winelover15", "date": "October 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5972722, "likes": {"liked": "— location and staff", "disliked": "— noisy rooms!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Stayed 3 nights on way home to Australia. In very spacious fireplace room on my own, despite booking cheapest internet rate on site. Very helpful front desk staff, enjoyed the evening eats and wine tasting. San Francisco greeter also terrific. Great location. Walked my legs off but close to cable cars/bus as well. Very floral for a guy on his own but would happily go back with wife.", "title": "Great location and service", "helpfulness": 7, "user": "MelbTripper", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5959377, "likes": {"liked": "— Location", "disliked": "— Wallpaper"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We hit the Petite Auberge right in the middle of the July heat wave. The room was very small, and hot but that was the only downfall.", "title": "Charming character BB in big town San Fran", "helpfulness": 6, "user": "shanook", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5794743}, {"rating": 2.0, "stay_parameters": "Stayed May 2004, traveled on business", "text": "We absolutely loved the free bottled water (especially during the heat wave) and great breakfast. Also a nice surprise was Aveda products in the bathroom!", "title": "Disappointed", "helpfulness": 5, "user": "mjrjj", "date": "September 8, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 5782326, "likes": {"liked": "— location", "disliked": "— poorly maintained"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We thoroughly enjoyed our 5 day stay in the Petite Suite at the Petite Auberge. The mild November weather added to our pleasure as we were able to savour California wine and cheese on our prettily flowered deck. We made good use of the whirlpool tub too, after our long days of walking up and down the hills of San Francisco. Breakfasts were really good, and it was fun to chat with other guests over wine and cheese in the evenings.", "title": "Exceeded Expectations", "helpfulness": 8, "user": "2COOKS56", "date": "November 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4108224}, {"rating": 2.0, "title": "Just OK", "text": "My wife and I showed up at the hotel to find our Petite Suite was given away to someone with a similar sounding name. Although we were given the first night free (because we stayed in a smaller room than we reserved), our Petite Suite was only an OK experience. In retrospect, we would not stay there again, and not recommend it to friends. I have stayed in many boutique hotels in San Francisco, so I am a fan of this type of hotel, but there were too many problems:", "helpfulness": 6, "user": "mtnbiker0424", "date": "October 26, 2005", "id": 4054744}, {"rating": 3.0, "title": "Too Cutesy", "text": "1. both the beds of the first room and the Petite Suite had a bad smell. We could not tell if it was the pillows, comforters or the mattress,", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 15, 2005", "id": 4024877}, {"rating": 5.0, "title": "Would Recommend the Petite Auberge Any Day", "text": "2. the bathroom has a mildew smell,", "helpfulness": 5, "user": "jenned17", "date": "October 10, 2005", "id": 4004419}, {"rating": 3.0, "title": "Cute and Convenient", "text": "3. although there was complimentary beverages and coffee, the milk is left out all day and is spoiled at night,", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3901342}, {"rating": 4.0, "title": "Great Place!!", "text": "Can’t wait to go back!!!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5040973}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "This place was awesome! It was close to everything. We love to walk the cities we stay in and San Francisco was perfect for walking. We especially enjoyed the wine hour in the evening. It was a great time to chat with other people and get ideas for places to go and places to eat. We met some wonderful people from all over the world. The food was wonderful. Very nice homemade breakfast every morning - delicious and filling. The beds were very comfortable!! I would highly recommend Petite Auberge.", "title": "Twee Hotel, nice location but noisy room.", "helpfulness": 8, "user": "snoplant", "date": "March 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4615973}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "We took a tour of 3 Sonoma wineries and it was just ok. We also rented a car for the day and went to Sonoma on our own to visit wineries and we had a blast. I would recommend this instead of taking a tour. It was cheaper to do it ourselves and more fun. There is a great Italian restaurant around the corner in the same block called Lottavo Ristorante.", "title": "a lovely hotel - with some reservations", "helpfulness": 12, "user": "Mr-Deezel", "date": "January 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 4369047}, {"rating": 2.0, "title": "Noisy", "text": "An average hotel that I'm not sure I would return to.", "helpfulness": 13, "user": "Hates_Flying", "date": "December 5, 2005", "id": 4164433}, {"rating": 4.0, "title": "Not for everyone, but cozy and comfortable, and a good value", "text": "Pros: The staff we found were all very courteous and helpful.", "helpfulness": 9, "user": "Massachusetts_Member", "date": "November 16, 2005", "id": 4122118}, {"rating": 5.0, "title": "Small, Friendly Hotel", "text": "From the moment I walked in I felt welcomed, beginning with the delightful person at the front desk. The rooms are decorated nicely, with lots of \"at home\" touches, such as books that aren't nailed to the shelves -- they can actually be picked up and read! The breakfasts are included and quite nice, and there is wine and cheese in the afternoon. There is a little conversation area downstairs, and a private little patio adjacent to the breakfast room. A very pleasant experience.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 2, 2005", "id": 3629819}, {"rating": 5.0, "title": "Great place to stay in SF", "text": "We just returned from a road trip in California and our first stop was the Petite Auberge in San Francisco. We were not disappointed. The hotel was lovely with just a slightly used feeling (in a good way). The room was very cozy, the staff incredibly friendly and helpful. It was also a perfect location for transit and for just walking around. I was able to access the internet at their sister hotel a couple of doors down and we particularly enjoyed the wine and snacks in the late afternoon. I would definitely go again.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 30, 2005", "id": 3623047}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The Petite Auberge far exceeded our expectations! My husband and I came after a trip driving up the coast and when we pulled in, I went in to find out what we would do with our many various bags. I spoke to an amazingly nice woman at the desk, Kahulia and was impressed enough so that in my jaded New Yorker manner, I walked back out and told my husband \"she's too nice, it's a little scary!\" Well, she continued that way, giving us maps, a route of things to see before we returned our rental car that afternoon and plenty of suggestions. We were able to upgrade our room, luckily b/c I think the poster 2 down may have been correct in their assumption of the room sizes. She said \"you may not fit in your originally booked room with all those bags!\" We had a great room with a fake fireplace, very clean, lots of cozy pillows and really enjoyed the room. The free water/soda at our disposal was so convient, I've never seen this at a hotel, makes starting your day (or coming back after a long one) so much easier, and you save lots of $ on water! We loved the wine and cheese hour, just a nice little touch and helped us refresh before heading out for a night. The breakfast was acceptable, everything good, but the reviews I read led me to have Very high expectations (someone said it was \"the best they've ever had?\"), it was a normal complimentary hotel breakfast. No turn down service as noted, but we did not care.", "title": "We loved it!", "helpfulness": 9, "user": "say1973", "date": "June 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3614500}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "Overall, the staff really gave the place a nice touch. We had one woman at the front desk who was sour and unhelpful, (in stark contrast to Kuhulia) but still better than you get at a major chain. 2 different bell-hop men were very helpful, one gave us extra wine after we missed the end time in the evening and another gave us a great rec for a restaurant for Dim Sum. Location was impressively convient...a short walk to Union Square where we got the cable car to go other places, we thought the neighborhood was a great location for tourists!", "title": "Very disappointing", "helpfulness": 9, "user": "Diz01", "date": "June 14, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 3.0}, "id": 3551667}, {"rating": 2.0, "title": "Petite Auberge was really petite", "text": "We got the price of an on-line service which is part of why we were so satisfied.... I think the regular price if you call them directly is probably much more. We highly recommend this hotel and would definitely stay there again! (ps- we chose it after reading other Trip Advisor reviews, thanks!)", "helpfulness": 18, "user": "A TripAdvisor user", "date": "May 17, 2005", "id": 3478812}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "For the price this hotel is hard to beat. My partner and I stayed there for 5 nights at the end of July and enjoyed every moment in the hotel. The breakfasts are superb and give the opportunity to build friendships, if you want to, with other guests. Similarly, the late afternoon wine receptions were very pleasant and on one occasion only started to break up about 8pm. I have stayed in the Nikko and Crown Plaza before in SF and whilst they have their own merits, the small, intimate, well presented and located Petit Auberge is one I would happily come back to.", "title": "petit and perfect!", "helpfulness": 8, "user": "EdMcC", "date": "August 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3756864}, {"rating": 4.0, "title": "Relaxing Stay at the Petite - Book in Advance!", "text": "We stayed at the Petite Auberge for a week in June. Definitely call ahead and book one of the larger rooms with a fireplace - the smaller rooms are MUCH too small for a couple with luggage and the bathroom only had a stand up shower! We stayed in a larger room with a fireplace and it was absolutely perfect and beautiful. We totally loved it. We loved all the staff (they were unbelievably nice to us) and the food was great too. It is in a great location and it feels like you are coming \"home\" at night, rather than to a big, corporate hotel. It's close to everything, including all types of transportation, and we really enjoyed our stay. Just know what you are getting into when you book a room and make sure you are booking the size that you want. It’s a great place!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3755644}, {"rating": 5.0, "title": "Spoiled at the Petite!", "text": "My wife and I returned from a \"second honeymoon\" a few weeks ago and waited until now to write a review to see if our wonderful memories of our stay at the Petite Auberge would begin to fade at all. Well, they haven't at all and actually as we share our fabulous experience with family and friends, it makes us want to go back for another \"escape\" earlier than we normally would! The best thing about our stay was feeling like we were the only ones at the beautifully decorated and outfitted French boutique hotel in the heart of Nob Hill in San Francisco. They knew our names when we came in the door to check in! How does that happen? Within 24 hours all of the staff knew who we were and they were very helpful in discovering what we would likely want to explore while we were in the Bay Area for a week. I had sent a few packages ahead along with some flowers (a local florist recommended by their staff) to be placed in our room on the day of our arrival. The room looked like I had been there before and arranged everything for my wife. The staff was just so attentive to \"who we are\" that it was like family helping us out. I should mention that our room was in perfect order and clean as soon as we left each day. We even left one morning for a quick snack and returned to a completely cleaned room - it was almost as if they were hiding in the halls waiting for us to leave so they could start cleaning. Many other things about our stay were wonderful as well. The fireplace in our wonderfully decorated room was a real treat. The bathrobes were one of my wife's favorites (so much so that we have two of them hanging in our closet right now!). The full breakfast each morning (comes with the room), was not only delicious but also served in a great little french cafe atmosphere where you could check with other guests to see what they were going to do that day or had done the day before. This was also the primary conversation at the wine tasting (free with the room as well) each evening around a fire in the lounge. Just a few guests would gather at the end of the afternoon and exchange sightseeing and exploring stories over wine (many choices) and snacks. All of this was informal so you wouldn't have to include yourself in the conversation if you chose not to. Sometimes just a good breakfast or glass of wine was all we wanted - and that was all we got. All in all, the value of our room was outstanding. We got so much more than we paid for. There is no doubt in our minds that we will stay at the Petite Auberge each and every time we come to San Francisco! If you are looking for a romantic get-away, you will not be disappointed.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3746027}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "We LOVED Petite Auberge. We had a bottom floor room with a fireplace, which I believe is one of the larger rooms they offer. We peeked into an upstairs room, and saw that it really was teensy! Our room was right next to the kitchen, which was stocked 24/7 with soft drinks and bottled water at no charge.", "title": "Adorable!", "helpfulness": 10, "user": "SafeTravelsGirl", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3674678}, {"rating": 5.0, "title": "Wonderful", "text": "Breakfast was always good - great coffee! Free newspaper and weather report every morning at your door. Front desk staff GREAT - they recommended the best restaurants that we would have never found otherwise. Kitchen staff was also very friendly.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3658134}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 26, "average": 41, "very good": 154, "terrible": 12, "excellent": 284}, "aka": "Petite Auberge Hotel San Francisco", "slim_ranking": 0.229787234043, "description": "Ideally located between Nob Hill and Union Square, Petite Auberge is the perfect small hotel for a trip to San Francisco. The Petite Auberge welcomes you to a world of French provincial enchantment. French doors with beveled glass, a collection of French art, a cozy parlor with a crackling fire and afternoon wine and hors d'oeuvres. Most guestrooms offer fireplaces. We offer a generous breakfast buffet each morning and an evening wine reception. Fresh baked cookies are available each afternoon."}