{"user_rating": 4.0, "review_count": 751, "name": "PGA National Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Overall an outstanding experience from the time we arrived at the resort until we checked out. The professionalism and friendliness of the staff was outstanding and very focused on customer service. You will find the resort to be exceptionally clean and impecably maintained down to the last detail. The location is perfect, golf courses are in excellent condition, the Pool a very relaxing atmosphere with nice background music even and the Spa also one of the best. Definitely upscale but great value for the money if you want a top notch resort. Can't wait to go back!", "title": "Exceeded our Expectations", "helpfulness": 1, "user": "Sunshine5448390", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84149308}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This is our 4th time at the PGA and the resort has become our favorite South Florida destination, even though we now live in Florida. The pool is beyond gorgeous - the decoration is just so breathtaking! Lots of fun things to do around. Friendly staff and beautiful rooms and grounds, and of course, magnificent lobby. Drinks and food are overpriced, but lots of more fair restaurants around. Love it!", "title": "Consistently fabulous!", "helpfulness": 1, "user": "GizelleAnaji", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84013023}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We live 45 min away and love this as a weekend getaway. We stay here a couple time a year with friends and extended family for relaxation and spa treatments. The hotel is fabulous, staff friendly and helpful, great lounge area with lots going on in center of hotel, restaurants on site great. The main hotel pool is large and beatiful. We have never used the highly aclaimed golf course beacause we really come for the spa. Although their pedicures/manicures are just average they have an extensive array of body treatments and they are all are fabulous. Fruit, Water and tea are always available. The spa has a separate pool area/cabana bar where you can relax after treatments with your group and have lunch and cocktails poolside including mineral pools.", "title": "Favorite Stay-Vacation Resort", "helpfulness": 1, "user": "dlaz", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 82823424}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Amazing trip! Felt like another world! Very clean and friendly atmosphere. Beautiful resort pool.", "title": "Amazing", "user": "lily274", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82656905}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Professional staff, rooms are nice, ask for view overlooking pool or spa. Great location near lots of shopping and many, many restaurants including the Resort's Ironwood Grill and iBar. Inviting lobby with evening music.", "title": "It has just about everything", "helpfulness": 1, "user": "flavercraver", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82433926}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The resort was beautiful. The travel to others places was right there at the intersate!! Loved the staff..especially at pool side!! George and Scott at the pool made sure we were taken care of...Great Place!! Valet took time to help us with bags and opened doors...special treatment there!!", "title": "FANTASTIC", "helpfulness": 1, "user": "kimmie61", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79359626}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We recently stayed here and were very impressed with the friendliness of the entire staff. The lobby/lounge area was big, beautiful and comfortable. Enjoying a coffee in the lobby/lounge area from their very own Starbucks coffee shop was a pleasant treat.", "title": "Top notch friendliness", "helpfulness": 1, "user": "MC3Canada", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79067375}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Unfortunately, we didn't have time to enjoy alot of their amenities but I would come back for sure. It was friendly, clean, conveniently located and classy.", "title": "Great Resort with non-friendly front desk staff", "helpfulness": 1, "user": "phila_visitor", "date": "September 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 78551429}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Do", "title": "It was a great getaway.", "user": "JD194807", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78243204}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Nice resort to go if you want to take a golf vacation. Very good deals.", "title": "great for golf... little bit old rooms", "helpfulness": 1, "user": "Checco", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 1.0}, "id": 77834628}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "Excellent facility, very friendly staff and beautiful courses. Stayed with the escape package which is probably the best value for an unlimited golf stay anywhere in Florida.", "title": "Excellent facility, very friendly staff...", "helpfulness": 1, "user": "Reklessabandon", "date": "October 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 82097929}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "From the minute we drove up to the sad departure, our stay was fantastic.. The staff was the best we've experienced. The food was very good from the breakfast buffet to the ironwood grill. The golf was the best. We played all 4 courses on property and enjoyed all of the them. (The champion being my favorite and the Palmer a close second).", "title": "A highly enjoyable experience that we can't give enough praise", "helpfulness": 1, "user": "Rod82", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 80522051}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "We were at the resort from Sept. 13-18, 2010 on our honeymoon. After a relaxing week in Jamaica, we spent the last week enjoying all the amenities of PGA National.", "title": "Golfer's Nirvana", "helpfulness": 1, "user": "breadchick", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80506404}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We can't say enough about our overall experience. Highly recommend it. Can't wait to return.", "title": "Highly recommended; looking forward to a return visit.", "helpfulness": 1, "user": "Ziogigis", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79940827}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I recently stayed at the PGA National Resort as part of a golf outing. This was by far one of the best golf resorts I've stayed at. The facilities were fantastic ranging from several ranges/short game practice areas to the way the cart staff handled us before and after our rounds. There are five courses to choose from (four on site and one off) and they go out of your way to make your play fun and productive, complete with a ranger roaming to tell you conditions of pace of play in front of you. Also, I liked that the ranger didn't get all nasty if your group was less than 5 minutes out of position; something that can easily happen on the Champions or Palmer courses if you find the water or someone in your group loses a ball. Instead, they would stick around for a bit to see if there was a special reason beyond stupid reasons for being out of position, help you move along if you needed a little prodding (our group had a few folks who were high handicappers playing their first big courses) without being horrible about it.", "title": "Good Golf, Nice Spa, Room was disappointing", "helpfulness": 1, "user": "305travels", "date": "September 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 79821923}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Our recent stay at PGA was fantastic. The grounds and hotel are beautiful and perfectly maintained. The staff was enormously friendly and helpful! The lobby bar was always lively and fun. During our stay they hosted a Wine night with live opera singers in the lobby one night and a \"ladies night out\" with boutique shopping in the lobby another night! Both added a pleasant \"spark\" to our stay. The pool and outdoor seating areas are really spectacular! The spa was exceptional.", "title": "We will surely return!!", "helpfulness": 1, "user": "lswg", "date": "November 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 86987338}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "This will be a repeat vacation spot for us!!", "title": "Mostly Exceptional", "helpfulness": 1, "user": "jeffausen", "date": "November 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86770620}, {"rating": 1.0, "title": "Hopefully not a \"once in a ifetime\" experience because I want to do it again!", "text": "The resort is fabulous. People make the difference and here is all about the people enthusiastically making sure your stay will be a great one.", "user": "A TripAdvisor user", "date": "November 11, 2010", "id": 86734181}, {"rating": 3.0, "title": "They like your money !", "text": "The only drawback was to me were the golf courses. I may have been expecting too much in the terms of architecture or the \"WOW\" factor. The courses were in very nice condition, with the usual very friendly staff. I am kind of a golf course snob so... maybe it is me.", "helpfulness": 1, "user": "PhilippeDouvier", "date": "November 9, 2010", "id": 86486990}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "The trip was a nationwide golf tournament hosted by Century Golf. There is nothing in our 4 day experience that we would have changed. Every aspect was thoughtfully anticipated and carried out; from the limo that picked us up on our arrival at the airport to the limo that returned us and everything in between. I only hope that I qualify again next year becasue I want to do this again and again. Thank you PGA!.", "title": "Comfortable and Safe Recovery", "user": "rannsmith", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84678939}], "location": {"country": "United States", "city": "Palm Beach Gardens"}, "stars": 4, "variance": {"poor": 52, "average": 84, "very good": 168, "terrible": 37, "excellent": 410}, "aka": "Pga National Hotel Palm Beach Gardens", "slim_ranking": 0.454545454545, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "PGA National Resort & Spa is a national, premier golf vacation and meeting destination located in prestigious Palm Beach Gardens, Florida. The legendary 369-room Florida resort recently unveiled a $100 million revitalization, including two new dining venues, a new Lakeside Lawn outdoor venue with scenic views of the golf course and lake plus a floor to ceiling makeover of all rooms. PGA National Resort & Spa offers 90 holes of championship golf on five courses, including the famed Champion course, home to the PGA TOUR’s Honda Classic. The resort’s storied golf history includes hosting the 1983 Ryder Cup, 1987 PGA Championship, and nearly two decades of the Senior PGA Championship. In addition to The Champion, PGA National’s award-winning golf courses are: The Palmer, The Fazio, The Squire and The Estates.Other distinguishing features include a 40,000 square-foot European Spa with 32 treatment areas and the exclusive \"Waters of the World\" outdoor mineral pools, a world-class 33,000 square-foot health-and-racquet club with 19 Har-Tru tennis courts, 40,000 square feet of self-contained conference space and nine on-site restaurants and lounges.Conveniently located within easy driving distances to major Florida population centers, the AAA Four Diamond resort is a 15-minute drive from Palm Beach International Airport (PBI), one hour from Fort Lauderdale-Hollywood International Airport (FLL) and 90 minutes from Miami International Airport (MIA)."}