{"user_rating": 4.5, "review_count": 30, "name": "Philip W. Smith Bed and Breakfast", "reviews": [{"rating": 5.0, "title": "Dont want to go home", "text": "A breakfast to die for. The house is execptional. The hospitality is remarkable. One of the best. And the cost (less than 100.00).", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 30, 2003", "id": 1372022}, {"rating": 5.0, "title": "Relaxing Hideaway Found On Business Trip", "text": "I had a wonderful stay at the Philip Smith B&B. I had traveled to Richmond for a business trip. After long days in meetings,it was so refreshing to return to the B&B and find peace and quiet. The innkeeper, Jill, cooked a delightful full breakfast each morning and always left me sweet goodies in the evening! YUM! Her personality was charming which made my stay that much more enjoyable. I felt like I could kick off my shoes and wander the house admiring all the fine art and furnishings. YOU DON'T WANT TO MISS THIS EXPERIENCE!Next time I will take my husband with me! Thanks for everything Jill! Regards,Kelly Richardson Cincinnati, Ohio", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 19, 2003", "id": 859086}, {"rating": 5.0, "title": "Wonderful Stay", "text": "We stayed here to attend my husband's 20th class reunion. We stayed in the Parry House but had breakfast a block away in the Smith house. These are antique filled, lovingly restored homes, that are very comfortable places to stay. Easy communication with owner Jill, and breakfast was fantastic. Would definitely stay again.", "user": "ilona06", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8607268, "likes": {"liked": "— The preserved beauty of the homes.", "disliked": "— That I couldn't stay longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "I've stayed here twice, in the Martha Perry house, and loved it both times. The beds are wonderfully comfortable with luxurious linens. The house is quiet at night and is air conditioned in the summer. The proprietors are always warm and friendly, and the breakfasts are superb. I highly recommend it.", "title": "Wonderful B&B", "user": "beedee2", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5904059, "likes": {"liked": "— Friendly owners, beautiful house", "disliked": "— Small bathroom (but it's an old house, so don't expect it to be modern)"}}, {"rating": 4.0, "title": "Martha Parry B&B- fabulous!", "text": "Just got back from a weekend at the Martha Perry B & B. The early 1900's home is a beautiful jem from this period with fabulous stained glass windows just about everywhere. Kris & Jill (owners) are gracious, welcoming & down to earth. Breakfast both days was yummy! Will go back again.", "helpfulness": 1, "user": "rjmather", "date": "January 16, 2006", "id": 4356478}, {"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "We booked our stay because of the reviews saying the homemade breakfast and how beautiful the B&B was for Richmond, Indiana. What a disappointment. The cinnamon rolls came from the microwave and it went downhill from there. The road was on the road side (the only thing they offered when only one room was booked for the night) and we did not sleep one wink via the truck traffic all night. Don't stay.", "title": "Night to not remember", "helpfulness": 2, "user": "breadr", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4318293}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Travelled to Richmond with my daughter for her basketball camp at Earlham College. Since I am not familiar with the area, I wanted to stay somewhere I felt safe and comfortable...not the usual hotel/motel crowds and activity. Philip B. Smith B & B is fabulous! From the home itself, to the hostess Eileen, the quiet environment.....the breakfasts and the evening desserts were wonderful! I stayed 4 nights and was certainly spoiled when I left and returned to cooking for my family and having not quite as much quiet time. I certainly recommend staying at Philip B. Smith and will be visiting there again if I am ever in the area!", "title": "B&B with my highest recommendation!", "helpfulness": 1, "user": "palmerpaintboss", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3702963}], "location": {"country": "United States", "city": "Richmond"}, "stars": 3, "variance": {"poor": 0, "average": 1, "very good": 5, "terrible": 1, "excellent": 23}, "slim_ranking": 0.5, "description": "Elegant Queen Ann Victorian Family home located in the East Main Street - Glen Miller Park Historic District of Richmond, Indiana. Features four distinctive guest rooms: One with full size bed. Three with queen size beds. All with private baths. Relax in the evening with homemade refreshments amid the beauty of hand carved wood and stained glass windows. Awaken in the morning to the aroma of fresh baked breads and enjoy a complimentary full breakfast."}