{"user_rating": 3.5, "review_count": 305, "name": "Philadelphia Airport Marriott", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Cleanliness is tops, personnel are courteous, free shuttles to PHL terminals, approx. every 20 min., beginning at 4 a.m. So what's not to like? The place is often a zoo. There are often teams or conferences meeting at the Marriott, and some of them are actually meeting there, rather than just staying for one night before an early flight. If there is a bell staff, I didn't see it. They were probably too busy keeping the kids and athletes in line. Nevertheless, it is a good place, and we will be back.", "title": "Excellent choice if you have an early flight", "user": "Maggie P", "date": "July 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166448477}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The Philadelphia Airport Marriott brings high level quality hospitality to PHL, just a few steps from your next flight. Located across a skybridge from Terminal B, the property has all the amenities that you'd for in a Marriott property. A full restaurant, a large bar area, and plenty of places to sit and have a one-on-one conversation.", "title": "Almost a step away from your next flight...", "user": "Point78Mach", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165945597}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The lobby can be a bit hectic with travelers coming and going; if you're a member of Marriot's Rewards Club, look for the 'Elite' line at the Registration Desk to help get you to your room a bit more swiftly. Need to print your Boarding Pass? A computer at the Registration Desk will handle that for you, and a large monitor displays current flight information. The desk staff was attentive and courteous.", "title": "Great Location and nice hotel", "user": "neddyflanders", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165922715}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "If you have a flight departing from another terminal, a shuttle bus is available to get you where you need to go. If your flight is originating from Terminal A or C, it's about a two minute walk.", "title": "If traveling from PHL", "user": "PRFScott", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165641149}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "from the Marriott.", "title": "Not a lot to do...", "user": "meggy1017", "date": "June 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165591330}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "The Philadelphia Airport Marriott is a convenient option when flying out of Philadelphia early in the morning. Attached to the airport, the hotel offers all of the full-service amenities of a Marriott in a good location. I'd recommend taking the courtesy shuttle to your airline rather than walking it as it can get challenging to go to other terminals. Best thing is that there's little to no airport noise.", "title": "Great option when flying out of Philly", "helpfulness": 2, "user": "SBfromNJ", "date": "July 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 168300905}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Great location - easy airport access. Like new property. Great accommodations! Very nice Marriott property ~ would definitely recommend to business travelers! Great rate and breakfast was delicious! Shuttle was prompt for car rental transportation and a friendly driver!", "title": "Very nice, like new and pleasant hotel stay!", "user": "Grace M", "date": "July 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168295315}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is the 3rd time we've stayed at the Philadelphia Airport Marriott, and we've been pleased each time. The service is great, the shuttle driver is always friendly, and hotel is very clean and modern. I ate in the restaurant and had a tasty meal. We'll stay there again when in Philly!", "title": "Great place to stay!", "user": "dotSaltLakeCity", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168111194}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Had to go to Philly for a funeral. My sister and I decided to stay here since we didn't have a car. First big problem we noticed was a sea of teens everywhere - in the lobby, in the elevators - and they did not behave well. Apparently there was some sort of athletic competition going on. These kids were pretty much out of control, but that's not the hotel's fault. We assumed they were the ones (or possibly their chaperones) who made a mess outside the elevators on our floor. And the partying in the hallways woke my sister up on Saturday night. Thank goodness they were gone on Sunday. Again, even though this made our stay unpleasant, I'm not going to factor this into the overall rating of this property.", "title": "some good, but mostly not", "user": "SoCalCouple050", "date": "July 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 167545480}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The good: beds and pillows were great, hotel close to the airport, our room with two double beds was big, corner room had a nice view, and there were free bottles of water in the room. I liked that the air conditioning was quiet, but my sister said it shut off during the night and the room got warm (I didn't notice this).", "title": "It's not the Marriott of old", "user": "MCG3_7", "date": "July 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167379783}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "You can't get any closer or convenient especially when you fly out at 6am. Hop skip and jump to airport. Rooms are nice, but small. Great Marriott bed and conceriege level has great amenities. Lounge was good and convenient. Was very bothered that they would place a platinum member next to elevator shaft. All I heard was whoosh from elevators all night. You never hear airplanes though the windows are so thick. Train to downtown Reading Market also very convenient. Overall you are paying for convenience and that's it.", "title": "Very convenient", "user": "jimbocpa", "date": "July 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 167335688}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I stayed at the Philadelphia Airport Marriott for one night in December before our trip to Colorado. We arrived to the hotel around 8 P.M and the hotel was very quiet. The staff was very nice and was willing to help us with anything. We went down to the Riverbend Bar and Grill which is the restaurant in the hotel. We enjoyed a few snacks and drinks at the restaurant before going to bed. Our room was a decent sized room and the beds were very comfy. We woke up the next morning at 6 AM to catch our flight. The one thing that makes this Marriott so convenient is that it is literally attached to the airport. All you have to do is walk up the stairs from the lobby and walk a few feet and you are in Terminal B near the security checkpoint. This stay was what I expected and my family and I will actually be staying at this hotel again tomorrow night.", "title": "What I expected", "user": "hockeyboy752", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167121207}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "After spending the 4th of July weekend on the New Jersey shore, we needed to be on a crack of dawn flight out of PHL. We made reservations to spend the night at the Philadelphia Airport Marriott. This hotel is very sleek and modern. We were able to check in with ease, despite the large party that was going on in and around the 1st floor ballroom. We enjoyed a drink in bar on the main floor before going to bed.In the morning we jumped out of our comfortable bed and walked across the hall to the airport. Ridiculously convenient!", "title": "Airport Convenience!", "helpfulness": 1, "user": "Celeste M", "date": "July 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166780798}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "This was a last minute trip to Philadelphia so I didn't book my room from the hotel site.I booked (getaroom.com) a double queen room this was the 1st time I was very disappointed in the Marriott because my booking was not granted gave me a king room with a twin size pull out this was unacceptable (for 2 teens) the reason for this 600 people wedding so basically my room was given away so we had no choice but to take the extremely small room the young lady that checked us in was only willing to compensate by offering free breakfast for only 2 people how was this a competition when we had 2children with us also the site that I booked the Room has pictures of a pool at this location there is no pool the hotel got rid of it the young lady stated also not sure why. Although I booked from a different site as the young lady stated several times this really wouldn't have made a difference if I had booked directly threw Marriott.com I still would have been given a king as my original room was given away I even showed her my confirmation sheet stating a double....Nevertheless I was very disappointed and will not book at this Marriott in the future.", "title": "Not the Room I booked 1st time ever disappointed by Marriott", "user": "Hossona B", "date": "July 8, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 166765997}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I had two red-eye flights with a 12 hour layover in Philly. This on-airport hotel offers day room rates but not bookable in advance which is a real pain. My travel agent arranged a day reservation while I was flying and I arrived only to be told my room wasn't ready. For a day rate that isn't exactly cheap (best part of $200) that simply isn't good enough. I ended up in the lobby for three hours of an eight hour stay.", "title": "Ideal location, terrible execution", "user": "TheScotAbroad", "date": "July 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 166715894}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed here just for one night in July of this year on our week long trip out East. I did Priceline so I did not choose this hotel or needed it to be attached to the airport. I got a fantastic deal. We were 2 adults, a teen and a toddler. We had a king bed and a sofa bed. Room was adequate, newly remolded, bathroom spacious. Everything was clean and in working order.", "title": "Clean, Refreshed and Quiet", "user": "jenai23", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173730820}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Never heard a sound from an airplane. Bed was very comfortable. Did not use any amenities in the hotel but the parking garage which was fine, we were in and out several times with no issues.", "title": "average at best", "helpfulness": 1, "user": "Marckypolo", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 173716364}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Only thing that annoyed me was actually having to go into the airport to go to the hotel but it ended up being just fine. I would definitely stay again for the extremely discounted price that I paid.", "title": "Average Marriott - location and convenience best assets.", "user": "ClearwaterJen", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 172091873}, {"rating": 4.0, "title": "Comfortable beds", "text": "Hotel is average at best but location is perfect as it is dead on front of the airport with a bridge connecting to the airport that leads directly to the security check point. Beds are comfortable and room is clean. I just didn't understand why my pillow stink, smelled like someone sweat so bad on it. TV channels were mostly analog, i don't remember watching any HD shows. For business and proximity to the airport is your purpose, yea stay here, it will only take you 5 minutes walk to the check in counters. If you're just on vacation on your own dime and not pressed for time, go somewhere else (hilton family!)... with free breakfast and free internet.", "user": "jgilbert2", "date": "July 30, 2013", "id": 169883497}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "This was an average Marriott - rooms were what you would expect - reasonably clean with very comfortable beds. Lousy little one cup coffee maker, with bad coffee - but that seems to be what I find in the Marriotts today. Bathroom amenities were average, but no bells and whistles to make this place stand out. They also had a surprisingly limited tv channel selection", "title": "poor value", "user": "Dan M", "date": "July 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 169080864}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3.5, "variance": {"poor": 27, "average": 71, "very good": 130, "terrible": 16, "excellent": 61}, "aka": "Philadelphia Airport Marriott Hotel Philadelphia", "slim_ranking": 0.607142857143, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This Philadelphia International Airport hotel is conveniently located minutes away from downtown Philly. The hotel provides comfortable accommodations as well as high speed internet and work areas."}