{"user_rating": 4.0, "review_count": 160, "name": "Phoenix Inn - Bend", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "I've stayed here for about 3 years, but have been disappointed the last two times. Some of this may be because they were being sold in spring 2006 (according to the staff), so it may be better now. Breakfast service at that time was real poor -- they were out of many things all 4 days we were there. The rooms were not real clean. The furniture was showing its age -- the chairs and desk ergonomics are horrible if you have to work in your room. All hotel pools have chlorine odor, but this seemed stronger than it should have been. And they need to replace the pool decking and bottom -- it's very rough and actually blistered my daughter's toes. On a bright note, the family suites are good if you have 2 kids, because there are 3 beds in 2 rooms.", "title": "Not what it once was", "user": "AnOregonian", "date": "September 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5808239, "likes": {"liked": "— Family suite layout, location (is in downtown Bend)", "disliked": "— Breakfast, loud guests in other rooms, bad furniture, rooms not real clean, terrible pool."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We have stayed here in the past and we try and stay here every visit. If you want to spend time in downtown this is the best location to stay. You can walk to everything. When I say walk, this is not like places I have stayed where they say you can \"walk to everything\" but you are expected to be an \"Olympic distance walker\". It’s literally a 1-2 minute walk to a great restaurant at the old Fire House (Staccato). It’s probably 3-4 minutes to make it all the way to Wall St. (Assuming you are a slow walker). Anyway, back to the hotel. The rooms are exactly what I expect for what we paid. Everything is clean and in good repair, but it's not a five star resort. There is no room service, there is no mini-bar, there are not rooms with what I consider a suite (separate living areas), but I am not the type of person that spends most of my time in the Hotel room. The room does have a mini-fridge so you can keep your leftovers and some bottled water on hand. I suggest asking for a room facing west, if you are on the 3rd floor, you will be able to see downtown and a nice Mountain View. I have always heard great things about the complimentary breakfast, but we do not get up very early and we have a few local spots we like to hit. (They are already too crowded or I would share here). So, in summary, you get what you pay for (that’s not a bad thing) at this hotel and the location just cannot be beat. Try it out, but do not expect a $250/night hotel for less than $120/night.", "title": "Great Location/Good Price", "helpfulness": 1, "user": "Shocked1", "date": "September 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5786661, "likes": {"liked": "— The location is perfect", "disliked": "— play lots of Golf ;-)"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "Just returned from spending 2 nights at the Phoenix Inn and loved it. I had a 2 room suite with a jacuzzi. There were 2 tv's, fridge, microwave, a small dining table, 2 phones, a REALLY comfortable, good sized leather sofa, and nice bathroom. The decor could have had a bit more personality, but overall it was nicely done, if kinda dull.", "title": "Lots of space at the Phoenix Inn", "helpfulness": 7, "user": "cozyharbor", "date": "March 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4738954}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "The location can't be beat if you want to walk to town.", "title": "Decent, but misleading...", "helpfulness": 6, "user": "Thylacine", "date": "March 23, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4727764}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We drove into Bend spontaneously on a Sunday night in June 2007 and looked for a room. There are a bunch of chain motels on the horrible commercial strip on the highway leading into town, but we wanted to stay downtown so we could walk easily in the town. Finding a place wasn't easy; there aren't so many hotels/motels downtown, and the one we tried before the Phoenix Inn was all booked for several wedding groups (even on a Sunday night). Luckily, the Phoenix Inn accomodated us for a mere $159 per night for a small suite (would have been $179 without the AAA discount, which the desk clerk offered without us asking, to his credit). I guess Bend is popular this time of year, but the hotel is business-class and not what I would consider a luxury hotel. Actually, we would have taken a smaller room, but I think they were all booked. Other than the price, we really liked this hotel. The desk clerk was very helpful. We liked the fresh cookies at the front desk when we were checking in. The bed was good quality, just firm enough, and had a down comforter. All the usual business-class amenities were there (desk, iron and ironing board, etc.). Also, the location is good, just a couple blocks from downtown, although Bend is so small that you could probably hoof it into the downtown even if you stayed in one of the chain motels just outside of town.", "title": "Comfortable business-class, somewhat pricy", "user": "pbfarfallina", "date": "June 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8030345}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The Phoenix Inn has a decent location, close to the old downtown area of Bend just off of 97. The rooms are on the larger size and include a microwave and refrigerator. The swimming pool and jacuzzi are slightly bigger than average hotel size.", "title": "Nice but overpriced", "user": "Rewrite", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 7271908, "likes": {"liked": "— Friendly staff", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The hotel has a free continental breakfast that is fine, though the egg dish they serve on weekdays looks and tastes awful. They have fresh cookies every evening which is a nice touch.", "title": "great choice right downtown", "helpfulness": 1, "user": "willows88", "date": "January 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6622544, "likes": {"liked": "— location"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "All that being said, this hotel is overpriced at $119 a night. The Fairfield Inn is comparable at under $100 a night, and the Shiloh Inn is excellent, also for $100 a night. For this much money I expect something comparable to an Embassy Suites, with a very spacious room, large pool, and good breakfast.", "title": "Hard Beds", "user": "betsytacy", "date": "October 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 5956021, "likes": {"liked": "— Hotel Cleanliness", "disliked": "— Uncomfortable Beds"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "How this Hotel got to be one of the top five in Bend (as of March, 2007) I don't know, but there are much better values out there.", "title": "Above average", "helpfulness": 1, "user": "alchemilla", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5910860}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Stayed 3 nights whilst exploring Bend and area and this hotel served as a very good base.", "title": "Nice hotel in great central but quiet location. Family Suite", "helpfulness": 2, "user": "LVSaint", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8492017, "likes": {"liked": "— Location, staff", "disliked": "— Hardish beds"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Took a twin queen family room with additional king bedroom for $169 per night (3 adults, 1 child)", "title": "VERY impressed!", "user": "kashka", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8229624, "likes": {"liked": "— The value! The room was wonderful", "disliked": "— the non-blackout blinds in the bedroom, a small complaint for an otherwise great hotel room"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Main room larger than average, extra room very small. Beds a little hard but not bad. Everything clean asn well maintained. Fridge, microwave and nice big flatscreen tv in each room. Comfy leather couch with coffee table and writing desk and chair.", "title": "Just OK", "user": "Boburly_7", "date": "July 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8226724, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "WIFI worked fine and staff were helpful when I had to reset my connection when my P2P software kicked in and subsequently locked me out. Remedied by calling network provider who unblocked me!", "title": "Clean, quiet, renovated, breakfast...", "user": "The3Bears", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8224810, "likes": {"liked": "— Convenient location, renovated, buffet breakfast", "disliked": "— No PETS- but understandable. There should be some rooms designated to those with pets..."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Included continental breakfast very substantial (eggs, sausage, bagels, toast, cereals, fruit, coffee, juice, etc)", "title": "A really comfortable place to stay and a great location", "user": "MaggieWirral_England", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8123191, "likes": {"liked": "— The bed! The friendly helpful service.", "disliked": "— Nothing"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 16, "average": 29, "very good": 58, "terrible": 8, "excellent": 49}, "aka": "Phoenix Inn - Bend Hotel Bend", "slim_ranking": 0.404761904762}