{"user_rating": 4.5, "review_count": 1263, "name": "Phra-Nakorn Norn-Len Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "PN is just a wonderful place - it is quintessentially \"cute\" and the staff is the friendliest and most helpful we met during our 3 week honeymoon. Great organic food at breakfast (the garden is on the roof), lots of color and happy music in every room. The on-site massages were only $10 US and the best of our trip.", "title": "Happy green refuge in crazy Bangkok", "helpfulness": 1, "user": "Nascitur", "date": "August 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37761405}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Also, though we were not travelling with kids - this is a VERY kid-friendly place, games and activities and plenty of places to run around without bothering anyone.", "title": "A peaceful sanctuary", "helpfulness": 1, "user": "dnietzsche", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37641285}, {"rating": 5.0, "title": "Wonderful place for a family", "text": "We had really nothing negative to say about PN - the occasional mosquito at breakfast and the slight challenge of helping taxi drivers find the place on its small street were the only small bothers of the trip.", "helpfulness": 2, "user": "minnie09_9", "date": "August 12, 2009", "id": 37484140}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I should also mention just so no one is confused - PN is not a \"luxury\" hotel - if you want satellite TV and minibar then stay at the Four Seasons. But if you want a charming, lovely, clean, bright, colorful, friendly stay, then this is the only place for you.", "title": "Chilled", "helpfulness": 1, "user": "nix0003", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37429937}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We spent one week in this hotel. It's amazing how a so quiet and harmonious place can exist in Bangkok's turmoil. The staff is kind, attentive and helpful. The food is good and inexpensive. Rooms are calm, day and night. The whole hotel is decorated with good taste and creative imagination. Ecology and organic concerns. Real Internet access. If you use the cheap boat service from the very close Thewet peer, you can reach any part of the town very quickly.", "title": "True gem, amazing staff, singular experience", "helpfulness": 3, "user": "nomnoms", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37389859}, {"rating": 5.0, "title": "Absolutely have to go there", "text": "This place is great for tourism in Bangkok!!! The staff are extremely friendly and helpful (and speak good English, which is not to be undervalued in Thailand), the hotel is clean, nice, charming, and very well located (for tourism, mostly -- not close to the business district). Plus, it's connected to an NGO helping children, so you'll be sleeping with a good conscience. Highly highly recommended!", "user": "jbauchet", "date": "August 10, 2009", "id": 37318072}, {"rating": 5.0, "title": "The BEST place to stay in Bangkok", "text": "This is the best hotel in Bangkok! You'll find bigger rooms or better location but not at this price. The food is great staff are the best in my 31 countries of travel and it's near enough sites while allowing you some modicum of quiet. I won't hesitate to recommend this hotel & won't stay anywhere else in Bangkok. There's a reason it's so high in it's reviews. It's the perfect fit for the frugal savvy traveler.", "user": "R_DogOlympia_WA", "date": "August 10, 2009", "id": 37311103}, {"rating": 5.0, "title": "Magical find in the chaos of Bangkok", "text": "Well, I'm hesitant to even write a review because I want to keep this place a secret, but they deserve to be full all the time. I just hope they have room for me the next time I'm in Bangkok!", "user": "tisman", "date": "August 10, 2009", "id": 37249167}, {"rating": 5.0, "title": "A wonderful place for families", "text": "The place is absolutely gorgeous, great rooms with great bathrooms - a real plus in Thailand - and the food is excellent as well.", "user": "Sawadeekha", "date": "August 10, 2009", "id": 37246893}, {"rating": 5.0, "title": "Absolutely beautiful, relaxing, friendly and something different", "text": "But what really makes this place is the staff. They really made us feel welcome and were extremely helpful when we asked for some help operating in Bangkok.", "user": "georgep29", "date": "August 10, 2009", "id": 37229418}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "What a wonderful place!!! Phranakorn-Nornlen is a simple place but everything surprises you: the courtyard full of beautiful tropical plants, the spacious rooms full of wall paintings, the bar which offers delicious smoothies and thai dishes but overall the kindness of the staff, always smiling and ready to help you. As my girlfirend said, we would like to come back to Bangkok just to stay here once again!!!", "title": "A dream in the chaos of Bangkok", "user": "CarloMilano", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 39485228}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Really enjoyed our 4 days here. The communal spaces were well maintained and really peaceful compared to the chaos that is Bangkok.", "title": "Calm amongst the chaos", "user": "miss_havisham", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 39481305}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Really enjoyed sitting on the roof top terrace in the evening with a lovely view across to a huge Buddha, nicest thing about it was that we were always the only ones up there.", "title": "Utter tranquility; the perfect antidote!", "helpfulness": 1, "user": "OllieC_73", "date": "August 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39205111}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The staff were always really friendly and helpful and the breakfasts were lovely if not a little random (spicy mushroom soup was my favourite).", "title": "A peaceful and serene getaway in the midst of hectic Bangkok", "helpfulness": 1, "user": "FC_Lon", "date": "August 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38671875}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Yes, the hotel lacks some of the luxuries of other places, no TV, no phone but that is totally in keeping with the 'vibe' of the place.", "title": "Quaint and Cute in Chaos", "helpfulness": 1, "user": "MyMichele716", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38200142}, {"rating": 5.0, "title": "The Only Place to Stay in Bangkok", "text": "Having chosen to stay at the PN from reading other trip advisor reviews I was certainly not disappointed. We had arranged an airport transfer with them and our driver waited to collect us from Bangkok airport even though we were an hour and a half later than planned and couldn't have been nicer - buying us bottles of water -v welcome after our long journey and endless queues through passport control! I have never encountered such friendly and helpful staff who made our stay a pleasure and could not do enough for us. They gave us advice both on Bangkok and helped us arrange our onward travels in Thailand and hotel bookings. The courtyard and rooftop terrace are both beautiful and in such contrast to the (enjoyable!) madness of Bangkok. The rooms are immaculate, comfortable, with aircon and charming with their individual hand painted walls - no they don't have all the additional amenities of a 4 star hotel but thats not what its about. Free wifi, free use of iMacs, lovely breakfasts ..... I cannot recommend this hotel highly enough.", "user": "moggieboy", "date": "August 10, 2009", "id": 37225087}, {"rating": 5.0, "title": "Great little getaway", "text": "Stayed here with my wife for two nights after arrival in Bangkok. The hotel is about 20 min. walk to Khao San Road.", "user": "JohnSchot", "date": "August 8, 2009", "id": 37063837}, {"rating": 4.0, "title": "nice place", "text": "The whole concept of the hotel -a quiet relaxed getaway from hectic Bangkok- is done very well and you will find this throughout the whole hotel.", "user": "jasoncarlson", "date": "July 18, 2009", "id": 35055376}, {"rating": 5.0, "title": "The most friendly, beautiful, eco-friendly hotel you'll ever stayed!", "text": "Rooms are basic, but spacious and clean (as was the whole hotel). Mattress in our room was quite hard, but we sleept very well. We loved the CD player with three CD's for morning / afternoon / Nighttime.", "user": "tranman100", "date": "July 13, 2009", "id": 34639679}, {"rating": 5.0, "title": "Stay Here! Nicest People, Most Calming surroundings...", "text": "The little courtyard / dining room is very relaxing and offers free use of computers / internet. The meals they serve here are great! Not a lot of choice, but all very tasty authentic Thai meals. All ingredients come from their roof garden.", "user": "ewoelker", "date": "July 12, 2009", "id": 34520632}], "location": {"country": "Thailand", "continent": "Asia"}, "variance": {"poor": 15, "average": 44, "very good": 271, "terrible": 2, "excellent": 931}, "aka": "Phranakorn Nornlen Hotel Bangkok", "slim_ranking": 0.00680272108844, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "We are a small hotel situated within Phranakorn district ( Old Bangkok), with the concept of slow life, we hope to bring your trip and rest apart from the usual hectic environment. Learning to respect the way of nature and living among real life community are one of experiences you cannot easily find in this rush and bustle world. Here at PN we don't just offer a place to stay, but we offer experience as well."}