{"user_rating": 4.5, "review_count": 957, "name": "Pier House Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My wife and I celebrated our 6 year anniversary with a 4 night stay at the Pier House. We absolutely loved it, we stayed in a second floor garden view room that was recently renovated. The water front rooms were under construction. We stayed the weekend between two hurricanes/tropical storms, I spoke with Pier House front desk at least 5 times, about cancellation/rescheduling polices , they were always pleasant and very helpful. The rooms were very clean and very nice only downfall our room was directly above the Chart Room Bar, we were woke up a couple of times around 6 to the workers cleaning up from the night before. It was OK we just finished sleeping it off on the private beach, we never left the beach until sunset. Capn' Dan at the beach bar was great, full of knowledge and made great drinks. We at breakfast and lunch there once, food was very good. Pool and grounds were always very clean and pool and spa stayed open 24 hours, very nice for the late night swim after doing the Duval Crawl. Another plus was location, you couldn't get any closer to the action of Duval St. Overall the Pier House met and exceded all our expectations, we meet many friendly and fun people while there. We are already looking for the next long weekend we can stay at the Pier House", "title": "Pier House ROCKED", "helpfulness": 4, "user": "BeachedOkie", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23063337, "likes": {"liked": "— Private Beach, premium in Key West, as the key is not known for beaches", "disliked": "— Leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Stayed at the Pier House for two days (Wed/Thurs) for a getaway from the freezing temperatures of the north. Was in Key West for 4 days but decided to stay here the first two as with many hotels, their prices went up on the weekend while the other hotel we chose to stay at on the Island (Casa Marina Resort - see another review) their weekend prices were much lower then weekday rates.", "title": "Great Location - Good Stay", "helpfulness": 4, "user": "SuaveShell", "date": "December 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22884876, "likes": {"liked": "— Location", "disliked": "— No wireless Internet, Lack of room service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "When you first arrive, it almost seems like a motel like many of the western hotels. The parking is FREE which is a huge plus. The location is absolutely perfect for all the night life as it is literally at the very top of Duval Street, next to Mallory Square.", "title": "Perfect Wedding in Paradise", "helpfulness": 3, "user": "Des_623", "date": "December 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22709168, "likes": {"liked": "— The location is awesome. Pool and bearea together is hard to find in that location. A++++ach", "disliked": "— Construction at the time we were there, but not too annoying."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "The hotel has a very small beach (think the size of a postage stamp) that would be great for kids and kids alone. The pool look nice but we didn't utilize it. As other reviewers have said, when you first get there, it can be tricky to find your room as it is kind of a maze but once you get used to the layout, everything is very quick and easy. Take some time to actually walk around this resort as it is bigger then it looks and pretty to look at. The piers go out into the Gulf with a view of Sunset Key Island. If you tell the front desk you have a special occasion a head of time, they might just give you a free bottle of champagne (they did that to us).", "title": "Nice place to stay", "helpfulness": 1, "user": "AJT36", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22597437, "likes": {"liked": "— Nice room, close proximity to night life", "disliked": "— Only complaint: poor sound proofing around room's door."}}, {"rating": 5.0, "title": "First time, definitely not the last..", "text": "However, unless you have an ocean view (which I high recommend), your view will not be that great and you will feel like you are paying too much. I can't comment on the spa but it appeared that it probably would be pretty nice.", "helpfulness": 1, "user": "seashellnj", "date": "November 30, 2008", "id": 22319599}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Expensive hotel - but what makes it worth it is it's location! Close to the action on Duval Street yet very quiet with a sense of seclusion. Be sure to request the Gulf View - it's worth watching the constant motion of the boats in and out of the nearby marina - plus the sunset view is even better than Mallory Square! The private beach is small yet a fun place to cool off. All employees were nice and helpful, and the entire hotel was immaculate! Will definitely return!", "title": "Great Location", "helpfulness": 2, "user": "Educator_10", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70305989}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The pier house is an excellent choice of hotels in Key West. The pool is great, the location is convenient, and the spa services are elegant. The rooms are tiny but I would guess that is standard on this island. The maid services were great, coming back whenever we needed them to. The beds are good quality and the bedding is upscale.", "title": "Excellent Choice", "helpfulness": 2, "user": "clay_10", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70289093}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The Pier House is in a great location...close to everything. The CVS across the street was a great place for snacks and drinks to keep in the room. We were upgraded since I sent an email to the concierge before we left asking for a ground room because my mother doesn't climb steps very well. There was no problem with that upon check-in. We had a garden room that faced the pool. The room was spacious and neatly appointed. The bathroom was very large, with a nice walk in shower. I can't believe that people complain about the small beach...Key West is not known for it's beaches. I thought that it was a total PLUS that there was a small man made beach at the resort. The attendants were great about setting up chairs and getting towels. You can even snorkel there with lots of colorful fish hanging out near the rocks. My daughter and I did this every day, and we were completely entertained! The pool is VERY WARM (something about solar panels), so in the evening, we would swim there when the beach was closed. The food at the Pier House was very good. We had breakfast, lunch and dinner there over the course of our stay, and the cost was similar to what you find outside the hotel, if not maybe less. Portions were huge and for breakfast, we would share two items between 3 people and still have some left. We ate in the Harbourview Cafe and Beach Bar & Grille, and had room service several times, even one night for dinner when we were tired. We did not use the spa, so I can't comment about that, but free parking is a such a bonus when you are near Mallory Square and Duval Street. And the free internet is also a bonus. The Pier House was a great experience for myself, my 66 year old mother and 13 year old daughter.", "title": "Fabulous---Loved Everything About this Place", "helpfulness": 2, "user": "kdjc", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69906787}, {"rating": 5.0, "title": "Outstanding in every way!", "text": "My wife, two teenage daughters, and I just completed a three-night stay at the Pier House. Our experience was outstanding in every way possible. Often, you look at a hotel on their website and you don't get what you see. In the case of the Pier House, the property is much more beautiful than the few pictures on their website can offer. The entire property is very well kept. The hotel location is perfect. You can walk right off of the hotel property and onto Duval Street. Mallory Square is only a block from the hotel, as is the pier area where one can take advantage of a variety of water sports activities. The rooms have tile floors, contemporary island style furnishings, and upscale bathrooms. We had a waterfront room, and the deck was bigger than some hotel rooms I've stayed in! We dined at two of the restaurants there on the property, and I must say they were both very good. Every member of the hotel staff that I met was extremely professional, nice, and accomodating. The Concierge was available throughout the day to help with the planning of all events and reservations. This was our first experience in Key West, and I can assure you, thanks to the Pier House, I will be planning a return trip.", "helpfulness": 2, "user": "Scott049", "date": "July 2, 2010", "id": 69498558}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I stayed at the Pier House with a girl friend the week of 6/7 - 6/11/10. We were a little nervous about any problems with the oil spill but it wasn't in sight! We had the Lanai room overlooking Duvall St and Mallory Sq. - it's not as big as the photo depicts but roomy enough with 2 queen beds. The rooms and grounds were very clean. The Beach is small but nice - they supply chairs, tables & towels. Had breakfast twice in the cafe on the Beach - the eggs benedict were superb! Great Mimosa and Bloody Marys also. The Concierge hooked us up with a Kayak tour. We rented mopeds from the stand in front of the resort - the guy gave us a great deal and very convenient. We ate at Camiles, Bagatelles, Hogs Breath and a burger at Hard Rock. A little muggy this time of year but worth the beautiful waters. Hemmingway House was fun with all the cats. We went on a cool Ghost Tour too.", "title": "Great Location and exceptionally clean!", "helpfulness": 2, "user": "cynwel55", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69485608}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I stayed at the Pier house with my wife in May 2007 after booking out of another hotel in Key West (As it wasn't that nice) and wasn't disappointed. The hotel was very good value compared to what we had been paying.", "title": "Excellent Value/Location/Amenities", "helpfulness": 6, "user": "Stappers", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7973920, "likes": {"liked": "— Excellent location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The first impression was that the room was nice. It was fairly basic but was pretty big and was clean. We also had a nice patio area with chairs which was tucked away and was a sun trap.", "title": "a bit of paradise", "helpfulness": 4, "user": "beachesgalore", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7854355, "likes": {"liked": "— the beach area", "disliked": "— topless beach not secluded from children"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The private hotel beach was excellent and although small wasn't busy while we were there and was nicer than the main public beach on the south of the island. It beat lying around a pool aswell. The bar/restaurant by the beach was good and the staff were attentive in taking drinks orders and providing beach loungers, tables and chairs. Although we didn't use the pool it looked good and had plenty of loungers around it aswell", "title": "Great location, very nice grounds.", "helpfulness": 3, "user": "Vinnie_Vegas", "date": "June 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7817781, "likes": {"liked": "— The Location", "disliked": "— The room's water pressure"}}, {"rating": 5.0, "title": "We had a great time, staff & service were top notch. Grounds Beautiful", "text": "The location was excellent; right at the end of Duval street and at the lively end of the street at that. There are loads of restaurants and bars around the hotel. Also, Mallory park was only five mintues away where they have sunset festivals with street performers and drinks while watching the sun go down. This was well worth experiencing and wouldn't have known if someone hadn't mentioned it very close to the end of the holiday.", "helpfulness": 2, "user": "tvsdelidiner", "date": "May 4, 2007", "id": 7546156}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "The hotel reception were helpful from booking trips/laundry and also questions about Key West generally.", "title": "Great Location", "helpfulness": 3, "user": "LovestotravelfromNJ", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7491824, "likes": {"liked": "— Location and the room", "disliked": "— The Spa, noise outside the room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed in a harbor-view room with sailboats outside the patio. It was kind of other-worldly when I was awakened in the middle of the night by a dog on one sailboat barking at a cat on another sailboat. I've told that story quite a few times since. We also thought it was interesting that so many of the descendants of Hemingway's six-toed cats can be found around the property as we strolled around it. The location was also close to Mallory Square and much of the nightlife.", "title": "Totally different and laid-back.", "helpfulness": 1, "user": "WaterHoser", "date": "March 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26454608}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "GREAT location for one who desires to be proximal to the dining and eclectic shops of Duval Street.", "title": "GREAT Location....noisey accomodations!", "helpfulness": 3, "user": "LMBTraveler", "date": "March 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 25902032}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed in the Spa House, which had fairly spacious rooms, but the view was not appealing, i.e. there was NO VIEW: tree tops, concrete and asphalt. In addition, the noise (music?) from the club next door went on until midnight..very disturbing. Even more annoying was the crowing rooster who awoke us at 4:30 every morning!", "title": "GOOD location, good rooms, good food", "helpfulness": 1, "user": "Ferdis10", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25299085}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Ordered room service once...at 10 p.m. upon arrival. it was cold and unappealing..and over-priced. Best bet is the local restaurants.....fresh food, better value.", "title": "Pier House exceeded our expectations", "helpfulness": 1, "user": "IndySooner", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25216301}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Enjoyed the entertainment on the beach, albiet the private beach a bit small and cramped.", "title": "Excellent place in an excellent location", "helpfulness": 1, "user": "GlobeTrotterLT", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24983715}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We loved our stay. Stay'd in one of the loft rooms. Had no complaints, except the shower door leaks all over the floor everytime you shower. Minor complaint because we loved our unit. It was brand new and even had a tv in the bath. I am sure they are working on this and I would not let this inhibit your stay here. The best location in Key West.", "title": "Great Spot!", "user": "magsmom", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24809691}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Everything about Pier House was perfect. Even when we called to make the reservation. We stayed in the Spa building. Our room was huge and very well appointed. There were two double doors out onto a balcony. The bed was super comfortable and we enjoyed a great nights sleep. It was very clean and quiet. There was even a TV in our bathroom! Unlike other \"upscale\" hotels in the area that would charge for parking, Pier House has plenty of FREE parking. A perfect location for walking everywhere. It doesn't get much better and this is the place for us when we return to Key West.", "title": "Outstanding!", "helpfulness": 1, "user": "wintertraveler05", "date": "February 6, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 24325869, "likes": {"liked": "— Free parking!", "disliked": "— Balcony was nice but no view of anything."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Not only is this hotel in a great location (next to Sunset Pier) but it's also well maintained, super comfortable, has a private beach and pool - great spa and friendly staff. I thought it was pricey but once I got there I realized it was worth the money. I'm not sure I could stay anywhere else in Key West now that I've been so spoiled. I had a hard time finding photos of the hotel as the website isn't great - so I'm uploading a few here", "title": "Worth every dime", "helpfulness": 4, "user": "dalcy3", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23971616, "likes": {"liked": "— location", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The rooms were lovely and the grounds are well kept, peaceful and private. However, the food is priced well over what it should be and the dock at the beach was splattered with bird dung.", "title": "Very nice", "helpfulness": 1, "user": "kashmirohio", "date": "January 14, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23546889, "likes": {"liked": "— Privacy of our room and away from the noise", "disliked": "— Second floor does not have an elevator in our building. Very bad idea."}}, {"rating": 4.0, "title": "Pier House excellent except the beds", "text": "Overall, very nice. (The front desk people are a bit stand offish...not sure why)", "helpfulness": 1, "user": "NYSusan08", "date": "December 30, 2008", "id": 23109217}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Location was perfect, right at duval street and mallory square. It was very quiet at night. Food was excellent. They have a great piano bar. You could even do some snorkeling at the beach. At night on the pier you can see dozens of tarpon jumping out of the water, it was fun to watch.", "title": "Honeymoon at the Pier House", "helpfulness": 5, "user": "jules16100", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 71124475}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Housekeeping will only change sheets every 3 days and towels are only changed if left on the floor! Roosters may wake you up around 8/9am", "title": "Another Great Stay", "helpfulness": 2, "user": "viajeelmundo", "date": "July 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71066213}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Second time here and just as good as the first.", "title": "Best beach area", "helpfulness": 3, "user": "jmestyle", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70407650}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had a harborview room overlooking the water. Great to see the boats and sunsets.", "title": "great stay", "helpfulness": 2, "user": "tarynD", "date": "July 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 70383471}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Our room was a good size with a king bed - very comfortable.", "title": "Perfect", "helpfulness": 2, "user": "fourbehrs", "date": "July 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 70307818}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed in a Garden Room (ground level) so that we could walk in and out of our room to the pool,beach, bar. It was great! We stayed in other nice hotels at Key West and now for the last four years we go to the Pier House! No complaints here! This is a great place for adults.....not for kids.", "title": "The Best Place to Stay in Key West!", "helpfulness": 2, "user": "Chris3051", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28356784}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We had an amazing time at the pier house. We decided 1 month before in advance that we needed a vacation from New England, we were able to book a room for 1 week and it was well worth it. The location is perfect for anything we wanted to do, the staff was very friendly and we cant wait to return. HOWEVER we lost our credit card's the 1st night we were there and when we realized the next morning and went to the front desk for HELP we were met with total non-professional service, the clerk was more involved in her conversation about her personal life with a uninterested fellow employee than helping us. We were very distraught and it just fell on deaf ear\"s. We asked a maintenance worker and were surprised at how quick he responded to our needs and within 1 hour the problem was solved and we were directed to a locale business that was more than helpful in dealing with our problem, when we first could have handled this from the start but due to the front desk employee's superfical attitude we sat in our room trying to figure out the best way to handle this problem 2000 miles from home. We did have to wait 4 days for new cards to arrive but the resort staff was very helpful and made the best of things for us, The employees were extremely helpful from the house keeping staff to the bar tenders and waiters from the beach side bar were were just so helpful and fun to be around, they really enjoy their job and honestly want to make everyone's stay their fun and relaxing . We with out a doubt will be returning to the pier house with our teenage children and other family members next april...The pier house is truly paradise and we cant wait to return.........missing key west from cape cod", "title": "a perfect getaway that we cant wait to return to for many years", "helpfulness": 1, "user": "vakagetaway", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28346174}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Pier House is located at the foot of famous Duval Street in the Old Town section of Key West, a block form Mallory Square and the Harbor Walk. We stayed at a Caribbean Spa room. It was spacious and newly renovated with flat-screen TV (one in the bathroom too), refrigerator, king size bed, wi-fi, plank floor and tasteful furnishings. We could hear a rooster crowing each day. Outside the French doors is a stone terrace with table and comfortable chairs, perfect for morning coffee, screened by tropical bushes and trees. Just enough morning sun filters through the vegetation. The babble of spilling water from the hot tub at the spa drowns out the minimal street noise.", "title": "Great location, updated room, helpful staff.", "helpfulness": 1, "user": "landloper", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28040269}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "As with most things new and untried, there are some features that could be improved. The closet needs a light. The shower is modern and well-designed, but splashed water collects on the door sill and spills out under the half-inch gap below the shower door. Exit the shower and you step into a substantial puddle on the bathroom floor. (I notified the desk when I checked out. Meanwhile, I placed a towel on the floor before showering to soak up the spill.) The lighting at the bathroom mirror could be brighter. The bathroom sink pop-up came apart in my hand the first time I used it, so the water wouldn’t drain out of the sink. I’m mechanical, so I re-assembled it myself and had no further trouble. The TV should have been mounted on a pivot so it could be more easily rotated to face the chairs or the bed. (In its place on a narrow shelf, it faces a blank wall). One set of French doors was a security risk due to defective installation. I found no microwave in the room, and there are no vending machines on the premises I was told, by design I suspect.", "title": "One of the best in Key West", "helpfulness": 3, "user": "kate413", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27613028}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The Harbor View Café, one of four restaurants/bars at Pier House, has excellent blueberry muffins for breakfast and an outstanding key lime pie with meringue topping at lunchtime. Al fresco dining is an option but it was too windy for us when we were there. I observed several guests enjoying the private beach.", "title": "Super Location", "user": "Retailer", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27200770}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I am the pickiest person ever and I absolutely loved the hotel! I would recommend to anyone. Rooms are roomy, clean, and very spacious. Beach is the beach area in key west. the beach water is super clear...unlike the public beach on key west...ick!!! the pool is nice as well. live music every afternoon. GREAT location as well!!!! I was between this hotel and casa marina and i am soooo happy that i chose this one! You won't regret it!", "title": "GREAT hotel!!!", "helpfulness": 3, "user": "dreaming27", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75535102}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Two nights were not enough at the Pier House. It was literally paradise. The landscaping was enough to write home about with plush tropical plants throughout the resort but the view of the ocean, on the sunset side of the island, cannot be put into words. We snorkeled just off their beach and watched boats of all sizes go by. Although we didn't go to the spa on this trip, prior visits were excellent. The location was perfect for Lobster Fest, everything was right there within a few blocks. The room was clean, modern and it had a fantastic shower! It was quiet and a perfect romatic getaway.", "title": "Pier House is the Best Spot in Key West", "helpfulness": 1, "user": "keywestgator", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75446776}, {"rating": 5.0, "title": "Had a ball", "text": "Nice ameneties, grounds well kept, courteous staff, extremely close to the attractions without being in the middle of too much action- will stay there again!", "helpfulness": 1, "user": "kholley", "date": "August 3, 2010", "id": 73641209}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Pier House is the best place in Key West to stay, the rooms were amazingly clean and spacious with great decor. Right at the end of Duval St. you are close to the action without being in the middle of it. The pier located across the street from the resort is a perfect spot to kick off your night! Great friendly staff and amazing private beach, cannot go wrong with the Pier House!!!", "title": "Perfect Place to stay", "helpfulness": 2, "user": "sgtema", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72917864}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The nicest hotel in the Keys! The rooms are gorgeous and have fantastic views of the sunset and water. Great place to snorkel or lounge by their private pool. I would not hesitate to go back.", "title": "Best views of the Harbour! Gorgeous and great service", "helpfulness": 3, "user": "TripQueen2", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71638829}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled as a couple", "text": "My wife and I stayed at the Pier House Resort and Spa for a week in July 2005 for our honeymoon. We booked a Harborview Room and were not disappointed. We had the best seat in the house for the famous Key West Sunsets. We would return every night just before sunset and enjoy and photograph the memorable sunsets in the privacy and quiet of our own room and on our own private balcony.", "title": "We hope to come back soon!!", "helpfulness": 7, "user": "Kenneth O", "date": "January 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6584562, "likes": {"liked": "— Clsoe proximity to the famous Duvall Street and it's own private beach on the Gulf", "disliked": "— that we couldn't stay longer!!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The entire staff at the Pier House was very friendly and helpful - they did all they could to help make the stay enjoyable.", "title": "Just okay....", "helpfulness": 5, "user": "islandhopper2007", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6560013, "likes": {"liked": "— The location, beach and sunset bar.", "disliked": "— The room, particularly the bathroom."}}, {"rating": 4.0, "title": "Love the Spa", "text": "The location is second to none; just a short walk to the bristling excitement of Duvall Street, yet while on the Pier House premises, it is quiet and relaxing. The beach and pool are small, but clean and enjoyable. The Chart Room is a great place to escape the crowds of Duvall Street and sit and have a nightcap before turning it. It's a very quaint, comfortable, friendly pub.", "helpfulness": 4, "user": "lighthouselovertoo", "date": "January 5, 2007", "id": 6555287}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "The price of the room was fair, given the ambience and the convenience to everything - and it was kept very clean. We absolutely loved our stay at Pier House and will return again soon. We highly recommend it!!", "title": "Perfect location, great service", "helpfulness": 4, "user": "Kellielea79", "date": "December 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6438188, "likes": {"liked": "— Location!", "disliked": "— Hard to find rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Ken and Lorie, Westerly, Rhode Island", "title": "Staff Needs PR Training", "helpfulness": 4, "user": "HomerHarley", "date": "November 19, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6153762, "likes": {"liked": "— Spa", "disliked": "— Indifference at Front Desk"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I booked four nights at the Pier House under their “Gourmet Getaway” package for early March 2007. After a horrendous vacation in the Dominican Republic, we booked this trip as a do-over so we could forget about that awful mistake. We were very pleased with the Pier House and hope to return again.", "title": "Great stay at Pier House...too bad it was cut short!", "helpfulness": 11, "user": "triciaanne", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7391609, "likes": {"liked": "— Spacious room, great service, good food", "disliked": "— Having to leave early"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "BOOKING: The package we wanted was only available by booking with Pier House directly and it was an easy process. A few days after I made the reservation, I decided to upgrade to a spa room and it was not a problem. The Gourmet Getaway package is for four nights ($440 per night, plus $50 to upgrade to spa room), breakfast is included every morning along with two dinners at One Duval, their main restaurant. We also received about 15 drink coupons that were good for the various bars at the resort.", "title": "Relaxing resort", "helpfulness": 2, "user": "mgoose", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 7368617, "likes": {"liked": "— Just liked the way it looked and how it was set up.", "disliked": "— rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "CHECK IN: Very convenient and quick. We were in our room in about 5 minutes. There is ample parking and we were able to find a spot within a few feet of the spa building.", "title": "My honeymoon is already off to a bad start", "helpfulness": 2, "user": "GamecockGal13", "date": "April 10, 2007", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 7304658}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "ROOMS: If booking a spa room, ask for a ground floor room that faces the garden path in the back. These rooms have little French doors that open up on to small patios and you will be very close to the spa hot tub. We loved our room...we were just a few steps from the hot tub and were the only guests using it at night. Pier House staffers use the garden path, so they will stroll by every now and then. We weren't bothered by it.", "title": "Rooms are FAR too average for the price!", "helpfulness": 3, "user": "Emerald20", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 7293735, "likes": {"liked": "— Beautiful grounds!", "disliked": "— Horribly over-priced, disappointing hotel room!"}}, {"rating": 1.0, "title": "Pier House -- Never Again!", "text": "The spa rooms are very spacious and nicely decorated, but are starting to show their age. There were some small chunks missing from the Pergo floors (looked like someone had tried to move furniture on their own), the bathtub was chipped, and one of our sinks was cracked, but didn’t leak. Overall, these are minor complaints and they did not interfere with our ability to enjoy the room. But, for nearly $500 per night, I can see how this would bother some people.", "helpfulness": 7, "user": "Paul S", "date": "March 10, 2007", "id": 7010569}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I visited Key West for the first time with my partner and his brother and partner. Lucky for us, his brother had stayed at the Pier House before and knew it was the best location for seeing the sights in Key West.", "title": "Key West is the best and the Pier House is where you need to be", "helpfulness": 2, "user": "paulette90", "date": "June 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68776640}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The hotel is lovely, with a small intimate beach. I encourage you to upgrade to a waterview room as it is worth every penny. These rooms have huge terraces which iare perfect for sitting and enjoying the view with a glassof wine. If you are lucky you can even see the occasional cruise ship docked. One word of caution if you are a bath person, most of the rooms have been renovated and the tubs have been removed. Great shower but I did miss my bath.", "title": "Our New Spot!!!!!!!!", "helpfulness": 1, "user": "PumRunch9", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68663675}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The only complaint I had was the temperature of the pool. It was very, very warm and many people complained but nothing was done. I couldn't understanding why the hotel didn't cool down the temperature of the water by adding cold water. The air temperature was 96 degrees and I'm sure the pool temperature was almost the same.", "title": "Great Relaxing Location", "helpfulness": 3, "user": "RDBerg", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68645287}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Pier House is within walking distance to great restaurants and Key West is spectacular! If I'm lucky enough to go back to Key West, the Pier House is where we would stay.", "title": "Fabulous...exceeded my expectations", "helpfulness": 2, "user": "wendic430", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66664191}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "What a treat! My girlfriend and I stayed here in June 2010. We stayed in one of the Caribbean Spa rooms and had the perfect stay. I used the trip to surprise my girlfriend and not only was she surprised, but we are now only staying there moving forward. The location is awesome especially the private beach to cool off and mingle with other guests. The pool looked nice, but we never went in, we had the ocean! The staff made our stay wonderful and Lee in guest services helped me plan a few other surprises while we were there. Don't hesitate to talk to him or Todd to do some special things or setup a few surprises. A few recommendations that we loved as much as the Pier House: SUP Key West - is a tour on a Stand Up Paddle Surfboard, we went all through the mangroves and saw amazing wildlife. Megan the tour guide is amazing and this is hands down the most fun activity we have done in Key West. On to places to eat: Breakfast - Pepe's & Blue Heaven, Lunch - BO's Fish Wagon, Cocktails - Rum Bar @ The Speakeasy & of course the Chart Room, Dinner - Kelly's & Louie's Backyard (Lee or Todd can get a reservation for this one), and Desert - Better Than Sex is a desert bar and if you have a sweet tooth and miss this your crazy! Besides that enjoy Key West, we always do! Oh I almost forgot - BRING OR RENT BIKES - makes it a lot more fun!", "title": "Unbelievable Stay at the Pier House!", "helpfulness": 1, "user": "katybish", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66319608}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Reading these reviews had me kinda worried about this place to be honest. We stayed in the Caribbean Spa Suite, it was nice, clean and modern. Fairly quiet too, some times would hear the live entertainment at the Rum Barrel at night, but that's to be expected. It had a balcony and the view was of the Hyatt's parking lot. We didn't mind since we're not the type to make an issue of that and we weren't in our room much. The only issue was that my wife is 6 months pregnant and getting out of the deep whirlpool tub was difficult. There was no separate shower. I didn't see a \"standard\" room, but the main building(s) were cinder-block, so assuming other reviews here maybe some what accurate. The pool area is nice with the gardern surrounding it. However, the pool water's temp could have been a little cooler. It was like bathwater and not very refreshing when I came back from fly fishing in the flats. The beach was nice too great view of the keys and bay. Lot of activity in the water during the day, but yet kinda peaceful watching and laying on the beach. The Atlantic side there are public beaches, but not much scenery in my opinion.", "title": "Enjoyed our stay", "helpfulness": 2, "user": "wooman", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6920956, "likes": {"liked": "— The location was great", "disliked": "— No security into our building"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The resort is in walking distance of all the major activities and sites on Duval St., Truman's Little White Hse, the marine north of the resort and Mallory Sq. If you want to be in the middle of everything, but escape to some peace and quiet then this resort is worth looking into.", "title": "Bitterly Disappointing", "helpfulness": 5, "user": "RedmondWicklow", "date": "March 1, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6898556, "likes": {"liked": "— Gadens were nice.", "disliked": "— Bedroom was substandard"}}, {"rating": 4.0, "title": "Great Location", "text": "We didn't have any issues with the staff and Bill (concierge) helped me book a jet boat and was very helpful.", "helpfulness": 3, "user": "odessaphiles", "date": "February 18, 2007", "id": 6807956}, {"rating": 5.0, "title": "Great resort in KW", "text": "I agree that it may be pricey, but if you're willing to spend it then I suggest getting a suite. Not necessarily an ocean view either since they do have a beach, bar and restaurant for your viewing pleasure. Overall my wife and I had an enjoyable time at the resort and would consider coming back.", "helpfulness": 5, "user": "ksukrissie", "date": "February 14, 2007", "id": 6788222}, {"rating": 2.0, "title": "The Pier House needs an \"extreme makeover\"", "text": "Having just left the Gardens Hotel in Key West this was a bitter disappointment. It is not a cheap hotel. We paid $529 per night for an ocean view room but the wash basin was very badly cracked, the ceiling was dirty, the electrical ducting to the ceiling fan was rusting and the bedlinen looked grey rather than white. It took too days for our request to restock the minibar to be completed. It aslo took two days to get a response to our complaint about the wash basin.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 21, 2007", "id": 6633961}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 42, "average": 67, "very good": 238, "terrible": 37, "excellent": 573}, "aka": "Pier House Hotel Key West", "slim_ranking": 0.225, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Perhaps nothing is more \"Key West\" than the Pier House Resort and Caribbean Spa -it's like no other. Elegant accommodations, lush gardens, a private beach, a selection of restaurants and bars, a full-service spa and a for real let-your-hair-down attitude all come together in a tropical escape that simply can't be duplicated."}