{"user_rating": 4.0, "review_count": 117, "name": "Pierre & Vacances Residence Le Moulin des Cordeliers", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I had a great experience at this place. The apartments are spacious - for a \"single room\" I actually got both a bedroom with a good size bed and a kitchen/living room with table, chairs, couches, etc. - really great for having people over and hanging out, which is not always the case with these types of places. Kitchen had all necessary implements (except dish soap and sponges - had to buy these). Bathroom was fine, coat closet, etc., everything you'd need. You have to pay 1.50 euro per day for internet, which wasn't a big deal for me - but for that price, why not just make it free?? Charming view of the river/town. Decent pool but I never had time to check it out. I would have stayed longer if I wasn't on a guided tour!", "title": "Ideal place to stay for a few nights", "user": "pepoling", "date": "June 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132300620}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Not that you're likely to spend every night cooking. The Residence is located right in the centre of town. A modern building (c.2004) but fits in well with the neighbouring medieval architecture. Typical P&V interior - well equipped kitchen, balcony, terrace or garden, and adequate beds/sofa beds. Good - free parking, 2 minutes walk into centre ville, outdoor heated pool, SNCF station walking distance, reception full of useful tourist info. Bad - not a lot. Not suitable for those looking for romantic stay, luxury rooms etc...", "title": "Loche and Loire Valley Self-catering", "user": "robsekun", "date": "October 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119319139}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stated at the Pierre & Vacances Residence Le Moulin des Cordeliers for a week in July with two small children (4 and 8 years old). We used the hotel to visit the Loire sites especially Loches, Amboise, Chenonceaux, and Azay le Rideau. The hotel is a residence inn, where the rooms have small refrigerators and kitchens.", "title": "Great family friendly base for touring the Loire Valley", "user": "wirelessbob", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116717548}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We booked the one bedroom apartment for four people (the Appartement 2 pièces 4 pers option that was 28m2). The hotel web site offered some discounts not found on other sites. The apartment was on the ground floor in front of the pool. The interior had acceptable finishes (about 3 star in the US) and the bathroom looked renovated recently. Like most rooms (except those in the mill or moulin) our room had a patio with a table and chairs for eating. The kitchen was well equipped including a fresh cutting board and utensils such as sharp knives, wine openers (of course!), an oyster knife (wow!), and a fresh cutting board (they provide a new one for each guest). There was no vent in the kitchen above the stove.", "title": "Good and bad - good for a couple of nights, no longer", "user": "Jobaby66", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 28674601}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The pool is a popular attraction as it seems to be unusual for hotels in the Loire. It is partially indoor and partially outdoor and is somewhat heated. They don't have the nuthugger requirement found at some pools in France. The pool was a reasonable size and clean.", "title": "Nice apartmentwith off season rate", "user": "bonnettdc", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10758160, "likes": {"liked": "— roomy", "disliked": "— double bed was smaller than usual"}}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 16, "very good": 60, "terrible": 3, "excellent": 34}, "slim_ranking": 0.333333333333, "description": "The medieval city with its Chateaux de le Loire. Loches - one of the most picturesque towns of central France. The indoor pool leading to a heated outdoor pool with a beach solarium and salon."}