{"user_rating": 4.0, "review_count": 1410, "name": "Place d'Armes Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have visited New Orleans at least ten or more times, and this was our first stay at the Place d'Armes Hotel. Our room was small and very average. However, the courtyard and beautiful surrounding area more then made up for it. The front desk/bell staff was just fine, except for one very stuffy lady. They had a nice little continental breakfast with the price of the room, which was only $75 for us. The location was perfect. We enjoy doing Bourbon Street and then getting away to a quieter place to sleep. Very short walking distance to everything the French Quarter has to offer. Yes, we would go back again.", "title": "We would go back", "helpfulness": 1, "user": "RandBTravel", "date": "March 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59322734}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Overall, the Place d’Armes was the ideal hotel for our long weekend stay in the Quarter. Its location is very good- just off Jackson Square and within an easy walking distance of many neighborhood highlights. (Note: For people unaccustomed to sleeping in an urban environment, a St. Ann Street-facing room may be a bit loud.) The rooms were clean, adequately appointed but a bit inconsistent when it came to the details. For instance, weak water pressure in one room, an air conditioner that never got truly cold in another. Not deal-breakers but worth mentioning. What impressed me most at the Place d’Armes was Lyn at the reception desk. My husband and I travelled with friends for this trip, and they made the hotel reservations. We didn’t realize they reserved an interior double-bed room for us until check-in. (This interior room also had no window, which made it feel too cave-like for me.) We wanted a king-bed room but the hotel was booked solid for an orthopaedic surgeon convention. Lyn was proactive and accommodating. She searched the system for a room at the Armes, then called the Armes' sister hotels to check for availability (there wasn’t any), then placed us at the top of the list for a room change. When a room became available the next day (at 8:45am!) she called us immediately and gave us the switched room at no extra charge. Real, quality customer service has turned into something of a rarity. Lyn at the Place D’Armes is a terrific example that customer service is alive and well. Thank you for making our stay so pleasant. One more thing, their restaurant and bar suggestions (The Green Goddess, Eat and Port of Call) were all spot-on. Great places off the beaten path that didn’t feel like tourist traps.", "title": "Place d'Armes knows how to treat their guests-", "helpfulness": 1, "user": "mrsgodzilla", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58690453}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have stayed at this hotel at least 4 times over the last 10 years. We have always been very satisfied and will continue to go back - we have stayed there each and every time we have been to the city. We have traveled with friends to this hotel and have recommended it to others when they were visiting New Orleans.", "title": "Repeat guest - happy every time", "helpfulness": 2, "user": "MplsTheGoodLife", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58688808}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "It is in the perfect location - 2 blocks off of Bourbon Street, near Jackson Square and the outdoor market Close to all of the action but removed enough that it is quiet at night. Haven't been there during Mardi Gras, but at that point all bets are off! You can walk anywhere in the French Quarter easily, is near to Frenchmans Street (the place to go if you like good live music) and you can catch the trolley on Canal to get to the Garden District.", "title": "Beautiful, fantastic staff, close to everything and cheap!", "helpfulness": 1, "user": "NicSiSi", "date": "March 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58434557}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The rooms are all different and some of the interior rooms do not have windows. However, this is made clear on the website and it is extremely reasonably priced compared to some of the other hotels in the area. And honestly you should not be spending much time in the room except to sleep, so no windows is not a big deal. For the most part it is an adorable hotel, though some of the fixtures and facilities are a bit outdated. Though I feel this only adds to its charm! My experience has been that they assign the rooms as people arrive - so it does pay to get there at a reasonable time to assure that you get a decent room. On our most recent trip, we reserved one of the suites, we were there during the week, and pre-paid at the time we made the reservation - so it was a very good price. Got exactly the room that was advertised and had no concerns at all.", "title": "Wish I could live there!", "helpfulness": 2, "user": "IrshIs", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58389040}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband and I go to New Orleans every year for JazzFest. This was our first time staying at the Place d\"Armes Hotel. We selected it because our usual hotel was fully booked, and the Place d'Armes had availability.", "title": "Get a room with a window", "helpfulness": 2, "user": "Emm781", "date": "May 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 63375242}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "The lobby has old New Orleans character and charm. Our room was okay.. nothing special, kind of old, but clean and functional. The hotel is in a very good location in the French Quarter, very close to Jackson Square. We could easily walk everywhere we wanted to go.", "title": "Great little hotel!", "helpfulness": 1, "user": "JaneM60", "date": "May 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 62949032}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our room was an interior room, which means that it had no windows. It got dark. Very dark. It was the same dark at 9am that it was at 3am. We had set an alarm on one of our phones to wake us, but if we hadn't done that. we might have just slept all day. At 9am, with my eyes wide open, I waved my hand in front of my face, and I could not see my hand. I could just see pitch black. Did I mention it was dark? So my recommendation would be to request an exterior room or risk missing the day entirely!", "title": "Location, Location, Location!", "helpfulness": 1, "user": "SMH71", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62622585}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A couple of reviewers mentioned that the rate at this hotel was $69 per night. Unfortunately, when there is a major event such as JazzFest, hotels tend to triple their rates, and the Place d\"Armes is no exception. For $69, it is an absolutely fine hotel. For what we paid, not so much.", "title": "Great place!", "helpfulness": 1, "user": "ddabh", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62315652}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "A friend and I just spent four days in New Orleans and had a wonderful time made even better by our stay at the Place d'Armes. It has the perfect location, friendly staff and beautiful courtyards! Great price..great stay! Stay at this place!", "title": "Great Hotel, Great Location, Highly Recommend", "helpfulness": 1, "user": "BevCQ", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61994495}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "For a first visit to New Orleans, the location couldn't be beat. Coming back to the room to cool off and then head out to another site was a real plus. The room was spacious, but the bathroom barely big enough to turn around in. Though we had done everything possible to assure an upgraded room that would take advantage of and give access to the beautiful gardens, we were stuck in the back facing a brick wall. Still not sure what a Deluxe room is or what you have to say to get a room that faces the gardens or pool. That seems to be a secret. The staff was super friendly, helpful and efficient. I liked coffee in the breakfast room in the morning. Our room was acceptably but not impeccably clean. Bedspread could be newer, less dusty.", "title": "Great Location", "helpfulness": 3, "user": "CincinnatiKidOhio", "date": "September 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 19890631, "likes": {"liked": "— The historic feel of the property", "disliked": "— Some outdated features and amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I would definitely stay there again because of the price, location and staff, but only wish I could figure out how to book one of the better rooms.", "title": "Relaxing!", "helpfulness": 1, "user": "beautiful-listener", "date": "September 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 19828214, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "My room was clean and comfortable with a private balcony overlooking St. Anne. I was steps away from everywhere that I wanted to be for my 2nd trip to New Orleans. Close to Bourbon, but far away from the noise. The staff was friendly and helpful. I was a little nervous after reading previous negative reviews, but the hotel exceeded all of my expectations and I'm so glad I chose to stay there.", "title": "Location and Staff", "helpfulness": 2, "user": "KYUSA", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 19731689, "likes": {"liked": "— Courtyard", "disliked": "— dated rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I booked 2 rooms for Decadence at the Place D Armes. I have stayed at the hotel before and know it is not the best ran hotel in New Orleans. I knew the rooms would be dated and the staff sub-par. My past experiences all told me no, but due to the courtyard, pool, plus location, I booked. Gustav. I arrived Thursday and got my two rooms. Dated as usual but one kudos for the size of 222. The real story here is how the staff handled the incoming storm. When I arrived, a manager was telling us that we may have to leave on Sunday. Reservations were through Monday. When we went out, no others had heard this info. The staff continually kept us updated. They even posted signs and put stuff on our doors. Again, few others had heard anything from their hotels and several did not make plans to leave. The continuous flow of communication from the hotel staff, who were much nicer this time, allowed us to change our flights and get out with little stress. Additionally, I prepaid for the rooms and they refunded me for the missed day. WOW! That was unexpected since anything other (like passes) were refunded. The staff seemed to go out of their way to help get taxi service also which was hard when the cab companies were closing. All in all...it was not a 5 star room but I knew that going in. What was unexpected was the 5 star treatment of their guests in an uncertain atmosphere. We had more info than most others and that was something most others did not get. Great job!", "title": "Perfection Squared", "helpfulness": 1, "user": "Eula54", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19359129}, {"rating": 5.0, "title": "Two years in a row!", "text": "Before Katrina and after, the Place d'Armes has been always my favorite place to stay when I'm visiting my hometown, New Orleans. Perfectly located, just steps away from Jackson Square, the hotel never disappoints. The staff is courteous and helpful; the rooms are charming and intimate; and the room rates are amazing. Safe, convenient, and a link to the city's pre-casino past, I'm already looking forward to my next visit.", "helpfulness": 1, "user": "AlbertaNana", "date": "August 23, 2008", "id": 19282517}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "In less than two weeks my wife and I will be staying at the Place d'Armes for Mardi Gras. This will be our 4th Mardi Gras at this hotel, and I can't imagine staying anywhere else.", "title": "Repeat Guests at the Place d'Armes", "helpfulness": 1, "user": "FrenchQuarterFan_8", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12887016, "likes": {"liked": "— Location, charm", "disliked": "— No complaints!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Two main reasons we love the Place d'Armes. Location and charm. You can't beat the location! Close to Bourbon, close to Jackson Square, close to Decatur St.... perfect! And the hotel is charming. A 180 from your cut and paste chain hotels. Lovely court yard, a public balcony (it's off a side street), a pool, nicely decorated rooms that softly speak \"French Quarter\".", "title": "Never in your life", "helpfulness": 3, "user": "mjd232323", "date": "January 19, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 12784767, "likes": {"liked": "— location", "disliked": "— Lack of security and a poor staff"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "As for security, during Mardi Gras wristbands are required for all guests (and photo ID to get them when checking in). And there is a security guard stationed either at the main entrance or the lobby 24/7 (during MG). You can not enter the hotel without going through the main entrance/lobby. We feel safe.", "title": "hated it", "helpfulness": 2, "user": "GeorgiaRihanna", "date": "January 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 12483325}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "One word of caution when booking a room: The hotel does have the option of booking an \"interior\" room -- meaning rooms with no windows -- at a reduced room rate. One side of the room will be constructed of 200 year old bricks (or looks like it anyway!) You won't be booked in an interior room unless you ask for one, from what I've seen.", "title": "Wonderful Stay, Location, Atmosphere, Service...", "helpfulness": 9, "user": "trenchie86", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12452285, "likes": {"liked": "— Location, Appearance, Hospitality, Cleanliness...", "disliked": "— I honestly have nothing to complain about."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Overall I highly recommend the Place d'Armes.", "title": "Loved This Place", "helpfulness": 2, "user": "mom2five69", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12411845, "likes": {"liked": "— Location", "disliked": "— Nothing, I loved it all!"}}, {"rating": 1.0, "title": "Poor Customer Relations", "text": "This was our 15th visit to the French Quarter - We love the food and atmosphere of the Quarter and have always enjoyed ourselves while visiting. We always stay in or near the quarter for the convience of walking to all the local spots. This trip we reserved our room at the Place d'Armes hotel- our room was dark but clean and had a great almost private courtyard access. However upon check out - which took nearly 35 minutes- we were brought our vehicle from the onsite parking garage - the passenger's side door had a huge dent! We waited another 20 minutes to see the manager and fill out claim work given to us by the manager. Several photos of the dent and a video of the manager looking at the damage were also taken. After several phone call and emails we began getting a huge run around from the manager. We were NOT compensated for the damages. A year later we have not heard from the hotel or manager and he will not return our phone/emails any longer.", "helpfulness": 2, "user": "tripwork", "date": "April 17, 2008", "id": 15105584}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The Place d' Armes has one of the best locations in the French Quarter, but I had an interior room with no windows and it felt dark and musty. Once outside my hotel room, however, the hotel had character and atmosphere.", "title": "Great Location, but no window in my room", "user": "Fellowtraveler101", "date": "April 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 14968653, "likes": {"liked": "— The location", "disliked": "— I had a room with no windows"}}, {"rating": 3.0, "title": "pretty good", "text": "The location of this hotel is great... Cafe'de Monde right down the street, far enough from Bourbon so you will not get the nightlife... Clean and accomodating. However, make sure you ask about your room first.. Ours had No windows, which was strange, but they immediatly found us another room with windows... The courtyard is very cute, and it probably is the best to get a room facing the courtyard... it really is very pretty. It is a small hotel, do not expect big hotel stuff!! No restaurant, but they serve a perfecly ok continental.. Would stay there again.", "helpfulness": 1, "user": "heidiAtlanta", "date": "April 5, 2008", "id": 14815332}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Decided to try Place d'Armes.", "title": "Very Dark Room", "helpfulness": 1, "user": "siroblio", "date": "April 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 14770318, "likes": {"liked": "— Location", "disliked": "— Dark and dirty"}}, {"rating": 5.0, "title": "Charming and quiet stay in the French Quarter", "text": "Negatives:", "user": "TnChik", "date": "April 1, 2008", "id": 14719898}, {"rating": 5.0, "title": "Quintessential Frenchquarter Hotel", "text": "If you are looking for a hotel with all the charms and delights of The Frenchquarter, this is the hotel for you! An older but clean hotel with all the character and courtyard ambience in a very good location. All the employees, from the front desk to the housekeeping staff are wonderfully helpful people always willing to make your stay a memorable one.", "helpfulness": 2, "user": "magicmardi", "date": "December 12, 2007", "id": 11512261}, {"rating": 5.0, "title": "I will be back soon!", "text": "I travel to New Orleans many times throughout the year for business, and so I try to frequent different hotels throughout the city. The search for me is now over. The Place D'Armes in located right next to the St Louis cathedral and within a very quick walk to some of the best restaurants in NOLA. The rooms are private, and you have your own balcony overlooking their wonderful private courtyards, pool, fountains, etc. It is a very secure facility with parking next door. The rate is very reasonable for the French Quarter (mine was 79 plus 22 for parking). It is close enough to Bourbon St to walk, but far enough away so that the noise is not filtering into your room at 4 AM. I can not wait to return! The news networks would have you believe that New Orleans is on their last legs and still struggling to survive after Katrina, and while I am sure that there are instances, the city as a whole IS BACK, and just as great as I remembered it before the hurricane!! Thanks to the staff for making my stay so wonderful, and I will see you again in February for Mardi Gras!", "helpfulness": 1, "user": "William0070", "date": "December 9, 2007", "id": 11430740}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "John", "title": "Nothing but great!", "helpfulness": 5, "user": "ccrosta57", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11244238, "likes": {"liked": "— Location!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Just returned from an awesome trip to New Orleans. After reading many many reviews on TripAdvisor about Place D'Armes Hotel we decided to try out this classic spooky hotel!", "title": "Great Location", "helpfulness": 3, "user": "pman94", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11228690}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "Let me tell you - we were nothing but pleased! I used the AAA discount on a Deluxe room which gave me great rates. We checked in a little early and there were no problems. I asked if our room had a balcony and they said no, not all Deluxe rooms had balconies. But right away she started looking for a Deluxe room with a balcony and one was available!! Room 302 - street balcony and great room with King Size bed. So be sure to ask for a balcony at the front desk if you reserve a Deluxe room. The room itself was clean as well as the bathroom. No complaints there!", "title": "Perfect location", "helpfulness": 2, "user": "pebblelake", "date": "November 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11112841, "likes": {"liked": "— It's charm"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Considered one of the most \"haunted\" places in the French Quarter, the Place D'Armes may offer just a little extra in the \"ghostly vibes\" you experience while staying here. The rooms are small, many without windows but the courtyard offers a serene oasis in the middle of the quarter whether enjoying morning coffee and croissants or an afternoon bottle of wine from Rousse's grocery. The service and staff were friendly, knowledgeable and helpful. The flickering lights, odd elevator dysfunctions and the sounds of non-existant children running in the hallway seemed to be centered around the second floor. Since this was a fall \"Chick Trip\", we took it all in stride and enjoyed the experience. Maybe it was us, maybe the wine or WAS IT?", "title": "Ambiance with Spirits", "user": "jojosgranny", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 86164996}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Hotel room was clean and staff was friendly and helpful. This was our second time staying at the Place D Armes, and we loved it again. The location is very convienent for walking around the Quarter, only being about 1.5 blocks from Bourbon St. and 1.5 blocks from Cafe Du Monde. The staff was friendly and helpful in fielding questions that I asked. The breakfast wasn't spectacular but adequate with mostly breads, pastries, cereals and fruits. Our room (204, I believe) was an inside room with no windows, (not any musty smell) medium sized and very quiet overall. We didn't use the pool which is small. The courtyard is lovely.", "title": "Great location, Great French Quarter Hotel", "user": "dirtguy55", "date": "November 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86064787}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "I was very impress with a gentlem that work the front desk. He was excellent he seem to know his history and gave each guests a tour of the hotel. We were all excited. Just a great guy", "title": "Damien. South carolina", "user": "bellytoy", "date": "November 3, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 85902588}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Stayed in a streetside, balcony room. Awesome! It's not a busy enough street to bother you. The staff was very helpful. It's not a luxury hotel, but htey make up for it with a beautiful courtyard and great location. Next to Muriels Jackson Square restaurant and near Cafe Du Monde.", "title": "Great location, first NOLA experience!", "user": "leinie61", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84383224}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "It was our first time traveling to New Orleans and we wanted to find accommodations that were affordable, clean and centrally located but not to close to the noise since we were traveling with a 2 yr old. This little precious gem of a hotel fit the bill. The staff was friendly and helpful. Our room was big and clean. It was facing the street side yet we slept soundly every night. The hotel has great courtyards and a cute little pool which was great for our two year old. We had considered renting a car but its so close to everything. We were able to walk to Bourbon or hop on a trolley or bus and head to the garden district any time. This hotel is charming and embodies old New Orleans charm. Thanks for a great experience. We hope to do it again.", "title": "Great first New Orleans experience", "helpfulness": 1, "user": "mokota", "date": "October 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84087146}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This was our second visit to the hotel due to its awesome location and affordable rates. Yes, it's a little worn around the edges but it still has a lot of charm, friendly and accommodating staff, (save for one surly housekeeping staff member) and a large, lush courtyard with small pool and fountains to sit and relax in the morning to plan your day while enjoying their Continental breakfast of coffee, tea, juice, Danishes or croissants. Our room was on the first floor behind the courtyard, which was not the second-floor room we were told we'd get when I reconfirmed our reservation. At first disappointed, especially since it was musty, we had no choice but to accept since the hotel was full. Room itself was easily accessible, large by most standards with windows, clean, with comfortable kind/queen-sized bed. Negatives: mustiness at times, very small bathroom, although sink/counter area is outside from actual bath and toilet, broken room safe on last day which was fixed quickly. You just can't beat the location: it's on the quieter side of the Quarter but so close to everything. A short walk to Cafe du Monde, Bourbon and Royal Streets, Jackson Square, etc. If you park your car it's $28/night. They will hold your luggage after check-out if you have a later flight. We'll definitely stay here again!", "title": "Historic hotel, fabulous/quiet location in Quarter, affordable rates!", "helpfulness": 1, "user": "suemonty1", "date": "October 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119635195}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "My mother in law, a friend, and myself decided to stay here again. I had been there a year before with my daughter and after a good stay then, I figured let's give it another go and we were not disappointed! The staff was super friendly especially when it came to finding late night dinner and giving us menus of who delivered. The rooms are older but in my opinion were very spacious. You can NOT beat the location! It is less than a block to Jackson Square, just over a block to the riverfront, and about two blocks off Bourbon St. Most important, Laissez les bons temps rouler!!!", "title": "Wonderful stay, friendly staff, awesome location", "user": "sailorwife23320", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119564647}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This hotel is a little tucked away which I liked, but it is very close to all of the action of Bourbon Street. We had pretty good service in the lobby and there was someone to help us with the bags. I like the charm of the outside courtyard and all of the plants and trees. Our room was just average, but that's what I expected from other reviews. The bed was pretty bouncy which says old to me, but again, that was expected. I would probably stay here again, especially for the location. If you go in knowing what to expect, I think it's so easy to find the great things about the Place d'Armes.", "title": "Toward the quiet side of the French Quarter.", "user": "tuffy26l", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 119554320}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The Place d'Armes is a clean, nice hotel in a superb location. I loved the history, architecture, and courtyard of the hotel. The front desk was always friendly and helpful... on our last day, we checked out at 11 but had a later flight, so the front desk held our luggage so we could enjoy the day; they also had a cab waiting for us to take us to the airport.", "title": "Can't beat the location!", "user": "cmh621", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119554220}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room itself was okay - it had no windows, but we knew that going in and it was still well worth the price we booked for. The room was a little outdated and small, but clean, with maid service everyday. We were fine with the room b/c we spent little time in it, so keep that in mind when booking.", "title": "Disappointing in so many ways.. but great location", "helpfulness": 1, "user": "annieandnick", "date": "October 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119505137}, {"rating": 4.0, "title": "smooth stay", "text": "the two of us stayed 4 nights mid-April , booked in advance from trip advisor reviews infor. Secured a deluxe room (with windows) -- - some rooms do not have any windows! Found a really nice hotel ,lovely courtyard, clean room whose position just off Jackson Square ideal for all NO attractions yet like a beautiful oasis away from it all .The staff were great , ideal place to be!", "user": "davidcarol", "date": "April 23, 2008", "id": 15250191}, {"rating": 4.0, "title": "Has character and charm", "text": "This hotel is simply amazing. It has old-world style, character and charm. The room was lovely, and we were fortunate enough to get a balcony room that overlooked Jackson Square. The courtyard is one of the prettiest in New Orleans. We found the staff extremely friendly and pleasant. They bend over backwards to accommodate guests. Lyn at the front desk was a joy to deal with.", "user": "Ghostl8y", "date": "April 21, 2008", "id": 15207735}, {"rating": 5.0, "title": "Love the Place d'Armes", "text": "I was amazed at how quiet and peaceful the hotel was. Being just 2 blocks from Bourbon, and literally across the street from Jackson Square, it was amazingly quiet.", "user": "NDK123", "date": "April 21, 2008", "id": 15179520}, {"rating": 5.0, "title": "Fabulous", "text": "My only complaint would have to be that the bathroom area is a bit small, and the doors are basically just louvered shutters. Doors that afford a bit more privacy would be nice- but this is a minor detail, as the room was perfect for our needs.", "user": "wind2730", "date": "April 20, 2008", "id": 15174968}, {"rating": 5.0, "title": "Fabulous Fabulous!!", "text": "We will definitely be staying here again.", "user": "missnmsy", "date": "April 17, 2008", "id": 15114607}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This was my second stay at the Place d'Armes -- this time for French Quarter Festival. Again, the atmosphere was charming, the staff excellent, and the room perect. Our balcony overlooked Jackson Square, yet the room was quiet. Housekeeping were in and out early and almost as though they were invisible. Unlike many hotels, the temperature was steady (and individually controlled by room), the beds comfortable, and the continental breakfast just right. Kudos to the manager, Lynn, who is always out and about -- talking with guests to make sure everything is just right, checking on rooms, greeting new guests. Her cheerfulness and sincerity is clearly reflected in the rest of the staff. If a hotel can have a 'personality\" -- it is hers. This hotel has rooms tucked way in nooks and crannies, all centered around a wonderful shady courtyard. Guests are outgoing and quick to share their experiences and make recomendations. The hotel certainly has the best location in the quarter, just a few steps from Jackson Square. From the warm arrival greeting at the door to reserving you a cab and giving you a warm send-off, this place can't be beat. Try it!", "title": "The Only Choice in N'awlins", "user": "GaryfromDelaware", "date": "April 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61886460}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband,best friend and I stayed for 3 nights. We had two rooms and they were delightful. Our room was at the far end of the garden, we had an entrance, large bath, huge bedroom! We even had a fireplace(it was warm so I don't know if worked). It is close to J Square and Dumont St. Good for me as I have some diff. walking. The breafast is strikly Continental but doable as there is so much food around. We enjoyed coming back in the evening and sitting at our table in te courtyard. The bell man, garage attendant and desk person were all great, special praise to the bell man. It's outside looks are deceiving, but true to NO atmosphere. Enjoy!", "title": "What a great place", "helpfulness": 1, "user": "firehoseM", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61689561}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "This was my 2nd trip to New Orleans, and my 2nd stay at the Place D'Armes hotel. This is a great boutique style hotel with much charm, and the location cannot be matched anywhere's in the FQ. And the courtyard is just gorgeous! Pictures do not do it justice.", "title": "Another great stay", "helpfulness": 1, "user": "porelly", "date": "April 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61668444}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I had a king size balcony room over St Ann street, same as last year, and it was just as enjoyable. There's nothing like having coffee 1st thing in the am out on your balcony, watching the Quarter awaken. If you can splurge, I highly suggest you do so. You do hear a bit of street noise (trucks and what not), but certainly nothing to keep you up all night.", "title": "Laissez les bon temps rouler!", "helpfulness": 1, "user": "RajunCajunFloirda", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61622482}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The Place D'Armes is not a high class, cookie cutter hotel. If this is your thing, you won't like this hotel. But if you want to add to your New Orleans vacation by staying in a place with character, this hotel will accomplish that. Another great stay!", "title": "Perfect place to stay.", "helpfulness": 1, "user": "arcadelover", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 60943428}, {"rating": 4.0, "title": "Enoyed the Place D'Armes", "text": "I had a wonderful five night-stay at the Place D'Armes. The courtyard is quintessenially New Orleans. It was too cold and rainy while I was there to really enjoy the courtyard, but it was beautiful and one of the best aspects of the hotel. My room was huge and clean. The continental breakfast was so-so, but one of the best cups of coffee I've ever had. And you can't beat the location.", "user": "MEPM", "date": "February 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13267102, "likes": {"liked": "— the location and courtyard", "disliked": "— typical hotel bedding"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "The hotel is not sleek or modern, nor is it for the young and hip who are looking for a party. I would recommend it to couples looking for a retreat from the commotion of Bourbon St. and families because of the courtyard and pool.", "title": "Great hotel, great location.", "helpfulness": 4, "user": "sukiro", "date": "January 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13152553, "likes": {"liked": "— Location, atmsophere."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "I just got home last night from a 6-night stay at Place D'Armes. I picked this hotel mainly because of the reviews here on tripadvisor and I would definitely stay here again. The location is perfect, you are in the middle of the French Quarter, steps away from Jackson Square, Cafe Du Monde and the French Market or head in the opposite direction and you're at Royal or Bourbon Streets.", "title": "Another enjoyable stay", "helpfulness": 3, "user": "JetsetTX", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13023793, "likes": {"liked": "— Location and Cleanliness", "disliked": "— The pillows"}}, {"rating": 5.0, "title": "Awesome stay at the Place d'Armes", "text": "I was in room 301, which overlooks St. Ann St. and has a big, private balcony. When I was awakened at 4:30 am on the first morning, by the garbage trucks on St. Ann, I seriously considered trying to change rooms (garbage pickup is most mornings at this time). But I'm glad I stayed because I got to watch two Mardi Gras parades walk down St. Ann St., right by my balcony as well as people watch and enjoy music from the quarter while sitting outside. The courtyard rooms might be quieter but I don't think they would be nearly as entertaining.", "helpfulness": 1, "user": "oops89", "date": "January 25, 2008", "id": 12988285}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "A few notes/observations:", "title": "Nice French Quarter Hotel", "user": "GracieLakeshore", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12926854}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Norma at the front desk is a living doll! No complaints here! The location can't be beat if you want to be near the fun and attractions. Yet, it is quiet, you won't be bothered by noise. A great value. We found all staff to be kind and friendly.", "title": "We will definitely stay here when we return!", "user": "Jossey", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81267246}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We just returned from a 3 night stay at this Hotel. For the price ( $59 for each of the first two and a bit more for the third ), I was expecting a dirty dump of a place.....NOT AT ALL. The entire experience was amazing. The staff was pleasant, helpful and professional. The courtyards with the small pool was clean and well kept. The room was clean and the A/C worked like a champ. The location of the place was perfect....close to everything in the French Quarter, yet quiet from the street noise. We stayed in room 220 which was a windowless interior room with no balcony ( there was balcony access just a few steps down the hall and the other two rooms in our part of the building had their own balconies, so in reality, we did have a private balcony to use). Next time I think I will pay a bit more and get a courtyard room but we were satisfied with room 220......NOW for the \"negatives\"........( actually just a few things you need to realize before you book).....This is a converted set of connected buildings that are VERY old, so even though they have been remodeled, the sound barriers you find in new construction are just not there. You get a lot of noise from the other guests as they leave their rooms, hang out in the courtyard talking and laughing ect. We found it a bit hard to sleep late in the mornings due to the noise. The other thing we noticed was the condition of the furnishings. Most of the items in the room were well-worn and could use replacing. The mattress was comfortable but the head board was pretty beat up. The TV was an old model with reception you would expect to find without cable, although it WAS cable TV. We didnt spend much time in the room anyway but the lack of clear reception and the lack of a flat screen were noticable. All in all, we LOVED this place, the ambiance was amazing, the location was perfect, the room was serviceable and clean, the continental breakfast was spartan but fresh ( enough to hold you over till lunch). We will book our rooms here again the next time we visit New Orleans. Thanks for the great experience.", "title": "Amazing place for the price", "user": "jeffAustinTx", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 81139406}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "We stayed in room 222 and it was very nice and spacious!! The courtyard is just wonderful....certainly gives a tropical feel. As for location.....CAN NOT be beat........steps away from Jackson Square, Cafe Du Monde, River front, Bourbon St, etc......WOW!!!", "title": "WOW....loved the room!!! LOCATION LOCATION LOCATION!!!!", "user": "katlynn59", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81079111}, {"rating": 4.0, "title": "Romantic and near everything!", "text": "Staff was pleasant and courteous...we were greeted with smiles and was given good recommendations concerning restaurants and sights to see....A VERY PLEASANT STAY!!", "user": "WIN84", "date": "September 22, 2010", "id": 80617413}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Ok..check in went went iffy..the woman at the front desk told us we would have to wait 1/2 hour..it was 3:45. The lobby was full of people waiting to check in..not ok.", "title": "Thin-walled beauty", "user": "VisitingRN", "date": "September 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80580506}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The other 2 were the Coco Palms, Kauai and the Brown Palace, Denver.", "title": "One of the 3 most charming places I've ever stayed!", "helpfulness": 1, "user": "YdnarMilwaukee", "date": "April 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 60860322}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We had a wonderful courtyard room, quiet cozy and as everyone has said, the location is outstanding.! How many times have you felt that you wanted to just hang out at the hotel and didn't feel like you were wasting time not seeing the sites? Sitting in the courtyard you could feel the charm of the French Quarter just seeping into you. Cannot wait to go back!", "title": "Perfect Location with gorgeous courtyard.", "helpfulness": 1, "user": "Marcus411", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60492074}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I love the Place D'Armes. I've tried quite a few French Quarter hotels, but this one is pretty much unbeatable. The location is only 1/2 block off Jackson Square, making it by far the closest hotel to the square and to Cafe Du Monde. It is wonderful to be so close to the beignets both in the morning for breakfast, and late at night for a bedtime snack. The hotel's courtyard is one of the best (maybe even THE best) in the Quarter. It is huge, and divided into several sections which gives an opportunity for private enjoyment. The pool is bigger than most in the Quarter as well. There are full-grown magnolias surrounded by lush landscaping, which lends a perfect connection to nature after a long day exploring the city. The morning croissants are wonderful, and I have a sneaky suspicion that they are procured from another Quarter favorite, the Croissant D'Or. Personally, I love the windowless rooms, for the same reason that I prefer interior rooms on cruise ships--- they provide complete darkness for sleeping, and after a typical late evening on Bourbon Street, the darkness can be a welcome friend. Also, these rooms tend to be very quiet. I haven't stayed in a room overlooking one of the neighboring streets, but the hotel is in a quiet part of the Quarter, a full 1.5 blocks from Bourbon Street. But even that part of Bourbon Street is much quieter than the area between Canal Street & St. Peter. I can't imagine street noise being a problem at Place D'Armes. It is only 1.5 blocks to Cafe Du Monde, with access to the the riverfront only another short stroll, and the French Market begins only a block past the Cafe. The amazing new restaurant, Stanley, is only a few steps from the front door of the hotel. Muriel's is next door. The treasures of Royal Street begin 1/2 block away. Like I said, this hotel is in about as perfect a location as the French Quarter offers. I look forward to my next visit!", "title": "Perfect!", "helpfulness": 1, "user": "ALGleek", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60092632}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "The hotel was adorable and in a perfect location in the FQ. We never heard any street noise but we had an interior room with no window (cheaper option). It was a rather small room, but you're not spending much time in the room if you're in New Orleans anyway. There was a very nice breakfast with coffee and croissants in the morning. Above all, the staff was super nice and always helpful. I would definitely stay here again.", "title": "A GEM!!!", "helpfulness": 1, "user": "litebox", "date": "March 31, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 60003120}, {"rating": 5.0, "title": "Outstanding location and beautiful hotel!", "text": "This hotel contains old world simplicity reminiscent of European Hotels. The location captures the essence of old New Orleans, and is right off Jackson Square. The staff is very friendly and personable in their services. I have stayed here before and will stay here again!", "helpfulness": 1, "user": "rgwilliams69", "date": "March 28, 2010", "id": 59770511}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I want time 'to slow' on my vacation. To be not shy, have no worries, and stay in place filled with mysterious experiences. My car drove 3200 miles on this road trip and a shocking elevator ride that places your car to your parking space on upper floor was fully and well deserved. Place d'Armes Hotel is unique and very expensive hotel. And I mean I paid the good price for a very expensive accommodations. The metal speared bed frames, antique writing tables, wall paper filled with incursive hand writing from circa '1700, furniture of all kind, old brick houses, alleys, walkways, and hallways, statues, lamps and lamps and all kinds of lamps all over the establishment filling it with light of 1000's shades. Absolutely stunning. Watch out for ghosts. They are very nice if you play nice. : )", "title": "What do you want?", "helpfulness": 1, "user": "Stefan V", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119460105}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Also one of many holding a forever light(lights that shine and stay on forever to grace the living spirits.)", "title": "Great, safe location", "user": "Mike M", "date": "October 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119371051}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Besides I am a guitar player I also am a hotel manager. I have managed a Hyatt Beach House Resort in Key West and also Historic Key West Inns, just to state my qualifications. I will always remember Place d'Armes and its wonderful staff and inhabitans and I look forward and pray for my next stay with them. Stefan Vranovsky, Key West [--]", "title": "Perfect location to explore the Quarter", "helpfulness": 1, "user": "Mitzi J", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119322603}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This is a wonderful and surprising place that is hidden from the hustle of the French Quarter while being in the heart of it. Built around a wonderful courtyard, it is a pleasant place from which to retreat from the possibly wild. We enjoyed it.", "title": "Real feel for New Orleans....", "user": "BarleyHops", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119322144}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed here after a cruise to do some extra shopping. This hotel is in the perfect location as it is centrally located and close to everything. It is also a beautiful hotel with several small courtyards. The only negative is that the bed we had was not all that comfortable. My husband had an interesting experience the night before we left. We came in early that night as we were tired from all the walking. My husband began to start coughing after we went to bed. He couldn't get comfortable and neither of us could sleep. He finally decided to take a shower and see if that would help. Several minutes after his shower began he abruptly came out of the bathroom and asked if I was ok. I said I was fine. He went back to his shower and soon after came to bed. After we left the next day he told me that during his shower he heard the door to our room open and slam shut and then me call his name and ask for help. I never heard anything.", "title": "Exactly What We Wanted", "user": "swearengen", "date": "October 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119290053}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed in the Hotel D' Armes for the Colts/Saints game. The location is absolutely excellent and the breakfast was very nice. Just pastries, fruit, & coffee, but yet very good. Sat in the courtyard which was very nice. We stayed in a room for only $79, an amazing rate for the location which was only 2 block away from Bourban. The hotel itself was right next to the Cathedral and open park area. 1 block away from Cafe Du Monde. The only issue was that the room we were in was like being in a shoe box. No windows and very very uncomfortable. The shower did not work at all. The TV in the room was from the 1960's. A small 12\" box. It was a very uncomforable feeling from the moment we stepped in the room. Felt like something was in the room with us. Couldn't sleep all night. Next morning asked if we could have a room with windows, but none were available. We decided to check out due to the uncomfortable feeling, and as we were gathering our belongings and about to leave, we were in the bathroom and right in front of us something or someone, sounded like a little boy went pee right in front of us. My husband and I got chills. It was unreal! We knew something was in there.. Come to find out we looked up the history of the hotel, and well, you can figure on your own what was going on. So we left...Have to say though the staff was very nice and as we walked by other rooms they looked nice, ones w/windows, but I will never stay in a room without windows ever again there.", "title": "Hotel D'Armes windowless room", "user": "FuntoTrvl", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 119870010}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "My husband & I and another couple stayed at the Place d'Armes the w/o 10/17. My 4th trip to NOLA and the other couple's first. We loved the Hotel, would stay there again. At first I did not like the location of my room, so they changed it and we were next to our friend's room and each of us had the balcony overlooking Chartres St. and Jackson Square. Every AM, my husband would go get all of us coffee & brkfst and we would sit out there and see the sights, sounds of the French Qtr. It was AWESOME. The front desk clerks and bell boys were so very nice and accomodating. The courtyard was so warm, welcoming and secluded - we met a few people who have stayed there many times. Well, if we return to NOLA, that's where we will be. Also, across the street was Stanley's Rest. Delicious brkfst & food!!!!", "title": "Place d'Armes Hotel", "user": "Marie B", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119863461}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I go to NOLA every June to celebrate our anniversary. We've stayed at the Place d'Armes twice, only because they have been booked the other years. We've arrived at the hotel around 10:30am both times and had a beautiful room ready for us by 12:30-1pm each time. When we arrived this year, the front desk woman was the same as the previous time. I commented to her about that fact and we started chatting, she was very friendly and very accommodating! The entire staff is! Our room this year was so amazing!! Totally different from the first time we stayed there. Each room is different, and charming in it's own way. Our room was very clean both times, as are the grounds. Every morning we would go down and get breakfast to bring up to our room where we would sit on the balcony and watch the vendors set up on the square. If you love what New Orleans is, you will love this hotel. It's not the Ritz, that's why we stay here. It has the charm and class of a historic hotel in the French Quarter. Thank you to the staff, we love the hotel, the location can't be beat, and we'll see you next June :)", "title": "LOVE this hotel!", "helpfulness": 1, "user": "StellaSoo", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119808818}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I was very pleased with this hotel. The room was very nice (balcony room overlooking Jackson Square) and big and it was so conveinient to everything. The continental breakfast was good but keep in mind if you like a big breakfast, you're going to want something more than pastries, croissants and fruit, so this is perfect for a starter or if you are someone who eats light in the morning. There is a restaraunt across from the hotel on the edge of Jackson Square named Harvey's--and they have a spectacular breakfast menu! Anyway, back to the hotel--the courtyard was very pleasant and so was the pool and the staff was very nice and accomodating. I also liked that there were vending machines for snacks/soda/water. Not alot of old hotels have them, and it was a nice convenience. I will definately stay here again.", "title": "Place d'Arms Hotel", "helpfulness": 1, "user": "gazzoo", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119761136}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "We were in New Orleans for my daughters wedding. We worked with the hotel for almost a year. We were assured that everything was done, paid for, etc. Upon arrival we were told that we owed for all 4 rooms for four days (we had 14 rooms total). In addition to that we owed for parking! I had the reciept showing all of this had been charged to my credit card. The lady at the front desk started arguing with my husband while I attempted to get the group sales lady on the phone. When I finally did, she again assured me all was fine and she'd call the front desk to clarify this problem. I thought all was okay for three days until on my daughters wedding day, my husband checked the credit card record where he found that they charged us the total amount plus parking again. My daughters reception cost was being charged this day as well which put us over our credit limit. I was hysterical as my husband talked to the credit card company and I made my way to the front desk. I spoke with this lady who knew nothing nor how to fix the error immediately. Yelling and screaming on my daughters wedding day was not something I thought would ever happen. They had to call the credit manager in on a weekend,then we received a call from the owner of the hotel, who said he couldn't fix it so he ended up giving us cash back to cover the charges. It was a horrible mess, ruined my day with an enormous headache and the need for a Xanax. One week later, we are still messing with this issue! Ican say one thing, we love the hotel, love the house keeping dept, love the location, hate the front desk staff. Word of advice, if you pay for your room ahead of time, you better check your statements!", "title": "Terrible front desk staff", "helpfulness": 2, "user": "Ironman1991", "date": "October 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 119728577}, {"rating": 5.0, "title": "Best in NOLA", "text": "I spent many hours on tripadvisor before my first trip to NOLA in summer of 07 trying to find the perfect hotel. I ended up being swayed into booking at Place d'Armes, though I was nervous about the occasional bad review. My review: perfecto. We loved it. Thoroughly charming. Helpful staff. Clean rooms. Could not have asked for more. My belief - the key is to make sure you don't get one of those no-window rooms. If you avoid that, your stay is going to be great.", "helpfulness": 1, "user": "expeditionaryman", "date": "January 6, 2008", "id": 12369218}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel is truly a gem. I've stayed here 3 times, and I've also stayed in 3 other New Orleans hotels. This hotel is hands down my favorite.", "title": "Charming hotel, Perfect location!", "helpfulness": 3, "user": "TXtravelbug27", "date": "January 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12264572, "likes": {"liked": "— Location!", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Here are the top two reasons you should stay here:", "title": "Wonderful Stay...............", "helpfulness": 1, "user": "yankeefan911", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12156394}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "(1) Location! You could not ask for a better location. Just off Jackson Square, two blocks from Bourbon and Pat O'Briens, a block from Decateur and Cafe Du Monde, absolutely the best hotel location in the French Quarter.", "title": "Enjoyed our one-night stay", "user": "danconia", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11887830, "likes": {"liked": "— combination of old-time charm and modern conveniences", "disliked": "— their weekend rates were so much higher than weekday rates"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "(2) This hotel is unique and gives guests a totally different experience than the average chain. Most of the rooms are decorated differently, and many used to be apartments so many are laid out completely differently from others. No cookie cutter rooms here! There are also two wonderful courtyards all guests can enjoy, a nice (but small) pool, and some rooms even have rod iron balconies overlooking St. Ann and Chartres streets.", "title": "Great Location, Nice Courtyard, Large Room", "user": "jjmarkp", "date": "December 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11561349, "likes": {"liked": "— Location, Large Room, Beautiful Courtyard", "disliked": "— No Hot Water..."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "We recently attended a wedding in New Orleans, and several extended family members booked rooms at the Place d'Armes along with my wife and I. We found the courtyard a wonderful place to spend lots of time visiting. The location of the hotel is perfect, being located at Jackson Square.", "title": "Felt like home", "helpfulness": 2, "user": "Ralph069", "date": "October 26, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 21220371, "likes": {"liked": "— the courtyard", "disliked": "— lack of any fruit with the continental breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The rooms were very comfortable and well appointed. The staff makes you feel very much at home and was always willing to help with any request. We met several guests at the hotel who said they have been staying at the Place d'Armes for years. I will definitely make the Place d'Armes my choice for future visits to New Orleans and would highly recommend it to anyone that prefers more intimate accommodations.", "title": "Lovely hotel and great location", "helpfulness": 2, "user": "Sholum", "date": "October 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21132476, "likes": {"liked": "— room and location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "We just returned from a three day stay at the Place d\"Armes. We had a wonderful room with a courtyard balcony view and thoroughly enjoyed our stay. It was our first stay at this hotel.", "title": "Absolutely perfect!", "helpfulness": 2, "user": "caligalbri", "date": "October 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20851067, "likes": {"liked": "— the location and history behind the hotel, and price!", "disliked": "— lack of room service"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The staff is well trained and helpful. The courtyard is really a wonderful place to enjoy and relax after a long day in the French Quarter. The location is beautiful right next to Jackson Square and close to wonderful restaurants. We booked our room through the hotel's website and were happy with the results.", "title": "wonderful experience at Place d' Armes", "helpfulness": 3, "user": "sisaac51", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20618322, "likes": {"liked": "— location, courtyard, staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This hotel is the only place I will ever stay in New Orleans. It is right in the heart of the French Quarter, a block from the Mississippi River. Bourbon Street is only 2 blocks, a very short walk that gets you just far enough away from the contant stench of the famous street, but can be reached within a couple of minutes. The hotel is next door to the St. Louis Cathedral and Jackson Square, the only hotel I noticed in the area at all. You feel very safe in the hotel vicinity, even late at night, walking back from the bars (we are girls in our 20's that travelled alone and felt perfectly safe in this area). It's quiet and extremely peaceful, and the courtyard is breath-taking. You will not find a more beautiful hotel than Place d'Armes, especially with the location and history this establishment boasts! It's the only place to stay in the French Quarter if you're looking for both convenience and historical beauty, as well as great customer service for your stay... and the bonus is the affordable prices!", "title": "Wonderful", "helpfulness": 2, "user": "Funtime01", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20291604, "likes": {"liked": "— Location", "disliked": "— Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "While celebrating my 50th Birthday, the Place d'Armes was used as our 'home base'. I've stayed at this hotel at least once a year for the past 14 years. But as I had 21 people coming from out-of-town and staying at the property, I was concerned how my friends and family would like the property. Well I should have known not to be concerned The hotel staff was wonderful, and took care of everyone's needs. The rooms were great, and of course I already knew everyone would love the courtyard and location in the heart of the French Quarter. Many thanks to the staff at the hotel (especially Dionne at the front desk) for an exceptional job. You helped make my 50th birthday special.", "title": "Great 50th Birthday Celebration", "helpfulness": 1, "user": "VanNuysBear", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14437404, "likes": {"liked": "— Location in the French Quarter"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I have stayed at the Place d'Armes hotel many times pre-Katrina. My wife and I returned for the first time since the storm. It is still the best location and a hidden gem. The courtyards are really beautiful. There are some rooms that exit directly to courtyard. I generally stay in the cheaper \"no window\" rooms.", "title": "Has some problems, but mostly a great place.", "helpfulness": 3, "user": "dbaughart", "date": "March 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14416276, "likes": {"liked": "— Location, charming courtyards.", "disliked": "— Service, no in-room internet access or fax capabilities."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The owners have newly decorated the interiors and it is comperable to any little boutique type hotel. The interior rooms can be \"dark\", not so much due to the lack of windows, but the lack of bright bulbs in the room. This is a great place for older travelers because of the location. However, older travelers be aware of the lack of bright light in some of the rooms, and some rooms are accesible only via stairs.", "title": "great stay", "helpfulness": 2, "user": "Kennedy311", "date": "March 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14406919, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "New Orleans Post- Katrina March 2008", "text": "This is not a perfect hotel by any means, as some of the reviews may suggest. The building is old, but maintained fairly well. The main problem seems to be lack of housekeeping staff. We arrived at 12pm, checked our bags and the room was ready at 5pm. That is fast for this hotel. On the next three days, there were 15-20 people waiting for their rooms to be ready, well past 6pm.", "helpfulness": 3, "user": "dragyi", "date": "March 8, 2008", "id": 14144778}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Also, when we arrived, there was no remote for the tv. After two calls, one came.", "title": "100% Perfect", "helpfulness": 4, "user": "ofines", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14083370, "likes": {"liked": "— The service we received, its location, and its beauty.", "disliked": "— Nothing. It was perfect."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "No pictures online did this place justice. You walked into the courtyard and you were in taken to a lush oasis away from the hustle and bustle. The hotel has an \"antique\" feel.. and is in no way modern or hip. I felt like I was staying in a guest room in grandma's old house, but with privacy and a surprisingly very comfortable (and quiet) bed. As humid and warm as it was outside, it was such a pleasant surprise when we walked into an ICE COLD room, without any musty or old smells. Saturday morning we were woken up by the church bells (but we're early bird/light sleepers) and just took a few steps down to Cafe Du Monde for breakfast. The convenience of the hotel was amazing for breakfast at Cafe Du Monde, an afternoon stroll down Royal, or a night out on Bourbon Street (but then a quiet night's rest when you are ready to be done partying). We even grabbed To-Go drinks and sat and enjoyed a beverage in the courtyard. At night it is lit up beautifully, and during the day it is lush and peaceful. Amazing. Will be back!!!", "title": "Stunning Courtyard", "user": "Nikki T", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180069223}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Love this hotel! It used to be our \"go to\" in New Orleans, but unfortunately this hidden gem has apparently been discovered - there were no rooms available for our last two trips. :( Perfect location for enjoying the French Quarter - quiet street, but still close to all the action. Rooms are very comfortable - we've stayed in both courtyard rooms and balcony rooms. And the property has such an interesting history! My favorite memory of Place d'Armes is being on a ghost tour, stopping in front of the hotel, and hearing a tale of hauntings - in the room where we were staying!!! No supernatural experiences for us, though. Will definitely keep trying to return to this awesome hotel.", "title": "Great little hotel, perfect location!", "user": "JLRibble", "date": "October 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 179909674}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "I stayed at the Place d'Armes Hotel July 4-7. The hotel in right in the French Quarter , close to Jackson Square. This is a perfect hotel if you want to be in the French Quarter but not in the middle of all the noise and action. The hotel is a five minute walk from Cafe Du Monde, so you can get up in the morning and get your coffee and beignets!", "title": "Inexpensive Hotel in the French Quarter", "user": "Cheryl J", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 179872137}, {"rating": 5.0, "title": "Reservations", "text": "The hotel is quaint and will appeal to you if you like places that have a historical vibe (I think it was built in the 1800's). The room was spacious and and clean. The service in the hotel was very nice. Everyone was always helpful and went out of their way to assist you. Supposedly this hotel is/was haunted. I didn't see or hear anything and I slept like a baby. I also don't believe in ghosts. The air-conditiong was comfortable and the room was cleaned every day. The room could use some updating new beds? (I thought the mattress was a little lumpy). Perhaps some new drapes for the windows. I was sharing the room with another woman and our room was on the ground floor and the windows faced the street. We had to use paperclips bobby pins or whatever we could find to make sure the drapes were shut completely so that we could feel comfortable changing our clothes in the room. The room also doesn't get a lot of natural light , so it always seemed a little dark , even in the day time", "user": "Patti K", "date": "October 4, 2013", "id": 179743011}, {"rating": 4.0, "title": "Attractive...right in the FQ", "text": "There is a pool in the center courtyard of the hotel. The pool is very small, mainly to take a dip and cool off. I wouldn't try to swim laps - I did not use the pool", "user": "AnastasiaAmor", "date": "October 4, 2013", "id": 179719062}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Just returned last week from another fantastic stay at the Place D Armes. I visit New Orleans at least two or three times a year and it is the only place I stay. I've read some of the negative reviews that some people have posted on here, and I have to be honest, I just don't get it.", "title": "Another fantastic stay.", "helpfulness": 2, "user": "RN1969", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82348877}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Let me begin by saying that the staff is wonderful. All of the staff. Front desk, maintenance, housekeeping...they are all extremely kind and helpful. Very quick to help with any extra requests and also very knowledgeable about things to see and do in the area. I always look forward to my trips back because I know I will see familiar faces...Norma, Nate, Chris - all so wonderful.", "title": "Who thought you could have peace & quiet in the middle of the French Quarter?", "helpfulness": 3, "user": "TravelingHillbillie", "date": "October 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82338328}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The property itself is in a fantastic location. It is the only hotel to overlook Jackson Square, and it is just two streets away from Bourbon. Bear in mind, however, portions of this hotel are very old - hundreds of years old. Are the walls thin? Yes. Are some of the rooms small? Yes. If you are expecting the Omni or the Sheraton, this isn't it. This is a small property with a personality all it's own. It is what makes it unique.", "title": "Cheap and in a good location...but far from perfect", "user": "MoverandaShaker", "date": "October 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 82217346}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "As to cleanliness, I have never had a problem. Rooms are always clean, and I have never seen bugs. Although in the New Orleans heat, I can imagine keeping them under control would be difficult.", "title": "Fantastic Hotel - this is a must in New Orleans !!!", "helpfulness": 1, "user": "icemonster", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82074665}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I can tell that between my last two stays that the hotel is undergoing some renovations. They are upgrading to new bedding, newer carpet, and flat screen televisions. But really, who cares about the television? Who goes to NOLA and spends all their time watching TV? The city has far too much to offer to waste time doing that.", "title": "Location, location, location!", "helpfulness": 2, "user": "PVDGA", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81997841}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Our regular \"chick trip\" to New Orleans would not be complete without a stay at the Place d'Armes! Our interior rooms are quiet, clean and well appointed. Almost all the staff is amazing. The Bell Captans are the best! The staff welcomes us back and offers us wonderful advice about bars, restaurants and transportation. Best location ever!", "title": "Another wonderful stay!", "helpfulness": 3, "user": "jojosgranny", "date": "October 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182928049}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "What else can I say that hasn't already been said in the other reviews! We stopped at the Louisiana Welcome Center on our way into New Orleans. We were only planning on a day trip but the woman at the desk told us that the hotels that have rooms to get rid of that day fax over special rates in the morning. Well, she suggested this hotel and the rate was too good to pass up! When we arrived at the hotel, we had garaged, valet parking and it was free. Most hotels in the area charge $10.00 and street parking is impossible in the French Quarter. The courtyard was like something out of a fairytale!! I grabbed my laptop and camera in the evening and sat at the wrought iron table admiring the view and the serenity of the courtyard. Next thing I knew it was 6am! The hotel is close to everything including a bus stop for the on-off sightseeing bus tour. Look for coupons online and in the brochures in the lobby. There are coupons for everything. When you mention you are on the bus tour, most of the merchants will give you 25% off your purchases! This alone is worth it.", "title": "You Know You're in New Orleans!", "helpfulness": 3, "user": "Sherylkat67", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182633451}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel is amazing and a true taste of New Orleans! I highly recommend this hotel. We had an inner room which was fine and I got the first full nights sleep I've had in years. The courtyard balcony rooms are very nice and I will try one of these rooms next time. Inner or outer, it doesn't matter. This boutique hotel is everything and more you could wish for!", "title": "Perfect Location", "helpfulness": 2, "user": "luluinNOLA", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182401311}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "How close can you be to Burbon Street and still have a wonderful \"quite\" hotel courtyard? This is just the place for you. This was my second trip to New Orleans and both times I stayed at this hotel (thank goodness for my girlfriend who told me all about it!) The room we stayed in was an INSIDE room - which is windowless - however quite nice. The bed was truly comfortable - AND I didn't toss and turn the first night (which happens quite often when I am at a hotel) and I couldn't ask for a better location. 1 Block away from Burbon Street - 2 Blocks from the French Market - AND THAT COURTYARD . . . Great. It encompasses all that is great about the French Quarter - the staff were so helpful - they made suggestions - they welcomed us back (yes - two of the staff remembered us from our previous visit) - what more can you say. When I needed to rent a wheelchair they got me all the information I needed - and took excellent care of us. The pool is shaded and very inviting. There is a continental breakfast and it is a nice way to start your day. I would highly recommend this hotel.", "title": "Relaxing stay, perfect location", "helpfulness": 1, "user": "2dkdkd", "date": "October 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181872210}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "This hotel is one block off Bourbon and 2 blocks from the French Market. It was a perfect location for everything we wanted to do. We stayed in one of the windowless rooms - which enabled us to sleep in. The rooms are small but old and beautifully decorated. The bed was comfortable. There are too many great restaurants nearby, so we never tried the continental breakfast. The only downside was that we got a room close to the utility closet and the walls are extremely thin so we heard when drunk people came back to their rooms and when cleaning service started. It was so dark though we didn't really care.", "title": "We loved this gem of a hotel.", "helpfulness": 1, "user": "brenda1984", "date": "October 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181404641}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My wife, sister, brother-in-law, and myself stayed at this wonderful hotel for (3) days during Easter. First off let me stay, i don't care what others say, this is a first class place in new orleans and I have stayed at many places. When we first arrived Easter Sunday, our rooms weren't ready (we were very early) but the front desk checked our bags and we were out exploring. The people at the desk were so nice to us, and when we came back a couple hours later, our rooms were ready. The courtyard is magnificent as you can see history everywhere you turn. I asked the bellman what the hotel was previously, and he told me it was the first school in Louisiana. there is a plaque outside that says it was established in 1725. Our rooms were on the main floor courtyard level. When we walked in, we found our room to be a (2) room suite. The bedroom had a king bed and beautiful exposed brick walls and high ceilings. A large bathroom was in the hall which lead to a large sitting room, again with exposed brick walls, couch, chairs and desks. My sisters room was one large room with a large bathroom. it was a king room with high ceilings and the most beautiful exposed stone wall I have ever seen. There have been several complaints about the continential breakfast, but I can tell you it was just enough to get the day started. Crossiants, sweet rolls (of many varieties), coffee, tea, or juice. We took ours out to the courtyard to enjoy the crisp morning air by the pool. This is a wonderful place to stay, it is close to everything, and we will definatly be back in the future. All I can say is, THANK YOU PLACE D ARMES FOR A WONDERFUL EASTER!!!!!!!!!!", "title": "A wonderful Easter at the Place D Armes", "helpfulness": 1, "user": "IUGrad", "date": "March 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14589016, "likes": {"liked": "— Everything about the hotel and staff", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "This is the 10 or 11 time I have stayed in NOLA, but the first at the Place D'Armes. I chose this hotel for location as we had stayed at The Ambassador last year and liked it quite a bit. This year however, we wanted to stay closer to Bourbon.", "title": "Location!", "helpfulness": 2, "user": "MNtraveler1399", "date": "March 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14582224}, {"rating": 4.0, "title": "Loved our stay at the Place d'Armes", "text": "We arrived approximately 2:00 pm on Wednesday March 19, the valet service was very quick. We were told at check in that our room would not be ready until 4:00 and the bellhop would hold our bags.", "helpfulness": 1, "user": "keyguys", "date": "March 25, 2008", "id": 14534801}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Had just enough time to go to Cafe Du Monde for beignets and cafe au lait, walked up to a couple of shops we always visit, and came back to the hotel at 4:00.", "title": "I wish I could love this hotel", "helpfulness": 1, "user": "Cruze-lover", "date": "March 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 14518499, "likes": {"liked": "— Location, Courtyard", "disliked": "— Dismal Room"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Our room was ready and the bellhop was quick with the bags. Contrary to earlier reviews, there is an elevator, and no need to carry your bags up the stairs.", "title": "Loved Place D'Armes!", "helpfulness": 1, "user": "gogirl1", "date": "March 21, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 14438946, "likes": {"liked": "— atmosphere; great service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My wife and I stayed here the week of Oct 26/'08 having booked a 'superior room' supposedly with a view.", "title": "A good deal", "helpfulness": 3, "user": "goooden", "date": "November 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21591935, "likes": {"liked": "— location, atmosphere", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Upon entering the room, 4th floor loft suite,we discovered the 'view' was a rumor. a very small window that you had to get on your knees to see out of the view a roof a few feet away.", "title": "Wonderful!", "helpfulness": 1, "user": "sensitiveartist", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21546927, "likes": {"liked": "— The courtyard and ambiance of the hotel.", "disliked": "— The matress and shower."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The next morning we requested a change. Lynn, the front desk mgr was very accomodating,and arranged a better room with a nice view of the courtyard and a shared porch", "title": "A Wonderful French Quarter Experience - The Place D'Armes", "helpfulness": 1, "user": "alamocitykit", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21520612, "likes": {"liked": "— the ambience of the furnishings and the surrounding courtyards"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Its a quiet spot, with proximity to all the quarter has to offer. Id reciommend it for those wanting a trues taste of old New Orleans. But if you need a full bar,fine dining, mini bar,room service, its not for you. Stick to the big box hotels with vanilla rooms.", "title": "perfect in every way", "helpfulness": 1, "user": "cfsnow", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21496099, "likes": {"liked": "— the location, high speed internet , the courtyards", "disliked": "— lack of fruit and yogurt for breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "This hotel has real character but at a price of a few minor inconvieniences.", "title": "Location, Location, Location", "helpfulness": 3, "user": "ManfromtheOC", "date": "October 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21376249, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Well we just finished another perfect week (Oct 13-18,2013 ) at the Place d'Armes. We have been coming here at least once a year for the last 8 yrs and have NEVER had a bad experience. Coming to this hotel is like coming home, the staff always makes us feel like family, with a smile and a friendly word. There has never been a problem that the staff has not taken care of immediately and many times they have gone above and beyond to make sure everything was right.", "title": "Location, Location, Location", "helpfulness": 2, "user": "DMSMaven2011", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181369920}, {"rating": 5.0, "title": "Location, Location, Location!", "text": "We usually stay in one of the balcony rooms, either on St. Ann or Chartres St., the balconies are just fabulous ... The one caveat about the balcony rooms is that they are on the street, so you will get \"street\" noise every morning, it is the sanitation trucks, the delivery people, even just people talking loud and laughing ... basicall just normal city sounds, they can be loud at times, it never bothered us, since we are usually up early and watching the city come to life with a cup of coffee is fun for us. If you want it quiet, then be sure to get an interior room, those rooms are quiet.", "helpfulness": 1, "user": "MissAnneZZ", "date": "October 16, 2013", "id": 181262082}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The rooms are comfortable and clean, if you really want to pick you will probably be able to find VERY small faults here and there ... It is a 200+ yr old building, but they have been updating everything .... The water pressure is great and the water is plenty hot .... The A/C is enough to turn the rooms into a freezer if you so desire ... Breakfast is a basic continental breakfast, with good coffee, orange juice and pasteries ... If you want more there are many restaurants within 100 yds or so of the hotel ...", "title": "perfect location!", "user": "cheryllynn3", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181129939}, {"rating": 4.0, "title": "It's Just What We Needed To Unwind!!", "text": "The courtyard and the hotel property are always clean, with staff constantly cleaning up .... Trying to keep the pool spotless is a chore with all the trees and plants overhead, but things are pretty darn good ...", "helpfulness": 1, "user": "Sergnava", "date": "October 14, 2013", "id": 181070945}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The location of this property is the best going ... Within a few 100 yds or so of Bourbon St and Cafe DuMonde .... Within a 100 ft of Jackson Square ... Right off of Royal Ave and all its shops and galleries .... If I had to place a hotel anywhere, this would be the place, cannot get more convenient ...", "title": "Location and Service Excellent", "helpfulness": 1, "user": "nuggetboy", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181016235}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I went there on a quick weekend trip and this was my first time staying here, and this hotel was on my bucket list for a while. The room was small, but quaint, exactly what I expected and was looking for. The bathroom was on the small side, but the shower head was strong and that is a huge plus in my book. The bed was extremely comfortable, as was the pillow. My room was on the 3rd floor in the rear left corner, I think 323. This room had no windows. Some may think that this bad, I loved it because my room was pitch black and I had the best sleep!!! The court yard is very old and cozy, you can tell the bricks have been here for a long time and have seen many travelers and history. The pool is small but good enough for cooling off and was sipping a drink in. I do study up on hotels in NO and know that this is a haunted hotel, even though the staff denies that there are ghost. I was hoping to hear something or see something strange, but nothing on this trip. This was a school for boys at one time and burnt during one of the fires of NO. Several children died as well as the school's headmaster. There are many stories that refer to people hearing noises of children or even seeing the headmaster. As for location you are steps from Jackson's Square and 2 blocks from Bourbon. There are a few other hotels that have a slightly better location, but this one is slightly off the main road to avoid hearing the noises of people partying yet close enough to make it to Bourbon with out your drink getting warm in the process. The bell hop was very nice, and worked hard for his tip, the front desk lady was polite and nice, as was the one who check me out. For the price <$140 you get a very charming and quaint hotel with a nice courtyard for relaxing in. The parting was $30 but you will be hard pressed to find cheaper in a secure location so don't worry too much about it. Now I could not connect to the wifi with my Ipad, but I was not too concerned with that due to the fact I wanted to disconnect and walk the Quarter. I am sure that I could have went to the front desk and they would have walked me through the connection process if needed. This one is still on my list to visit again and will be watching the prices to see when to book it again. The front desk did say that there are balcony rooms but they are not listed on any of the booking sites like Hotels or Orbits, so call if you want to book a balcony, but the total black out rooms are very nice.", "title": "Awesome little gem!", "helpfulness": 1, "user": "Tim O", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181007545}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I love this hotel. Excellent location. Right off of Jackson Square and one block from Cafe Du Monde!!! Breakfast was great. The courtyard is beautiful. The rooms are small. We had a double room and it was a little cramped. No counter space to lay out cosmetics and hair supplies. Despite this I would definitely stay again. The staff was courteous and always helped us out if we needed directions or anything.", "title": "Great place to stay", "helpfulness": 1, "user": "Heather S", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180959500}, {"rating": 5.0, "title": "Great Location... Fabulous People ", "text": "We are at the Place d'Armes right now for the week... This is our 12th visit over the last 10 years and I can honestly say that we have never had a bad experience... The front desk and all the staff has always been above average... Any problems have been addressed and taken care of promptly... The people are great and on more than one occasion they have gone above and beyond to make our stay memorable... Location is the BEST of any hotel in the quarter... Within 300 ft of Bourbon street and Cafe Dumonde... a mere 100 ft from Jackson Square... If you are looking for 5 star luxury, this is not the place for you, if you want a clean, comfortable hotel with great people and service and the best location ever for a good price... The Place d'Armes is IMHO the only place to be in NOLA..", "user": "DMSMaven2012", "date": "October 14, 2013", "id": 180913276}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I have visited new orleans on more than 20 occassions, and I stopped hotel-shopping 6 years ago when I found this one. The atmosphere is terrific -- quiet and private. The price is very affordable -- much less than most of the hotels in the Quarter. Best of all is the location -- just off Jackson Square. The staff is polite, helpful, and friendly. They go above and beyond \"good\" service -- they are exceptional. I can't recommend this hotel highly enough - I love it!!", "title": "my favorite place to stay", "user": "Sally G", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180754730}, {"rating": 3.0, "title": "Good location, but overpriced", "text": "The location was good, and they had a very nice garden. Unfortunately the hotel were under construction during the whole Day. So sitting by the pool was not an option. The Continental breakfast were included in the hotel price, but it was only coffee and cake, so we have to go out for breakfast every morning. Most of the staff in the reception were not very friendly. So the 3 stars are for the location, the nice garden area, and the very nice staff at the parkinglot.", "user": "Diana J", "date": "October 10, 2013", "id": 180531507}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I was shocked when we got to our room.This place must be a hundred years old,and it smells like it.The room smelled like your grandfather's old cedar chest.We had to wash our clean clothes because of the smell on them when we got home.The bed was not nice ,the shower had low pressure,the coffee maker did not work,and there were pennies on the floor.They still use keys and the door could easily be opened even if locked.Use the deadbolt when in the room.We had windows,thank god it probably is aired out sometimes.The courtyard rooms may be nicer,it was pretty back there.I feel like I threw my money in the garbage.Two very nice hotels a short cab ride from the Quarter are the Loews and the Renaissance Arts Hotel,you will be very happy.", "title": "Not Nice", "helpfulness": 1, "user": "harleybonz", "date": "November 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 22095155, "likes": {"liked": "— Leaving", "disliked": "— smell"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "I really enjoyed the Place d'Armes. The location is perfect. The ambiance is old New Orleans (if your tastes run to Marriott Modern this isn't it). And the staff could not have been nicer or more helpful.", "title": "A great place in the French Quarter", "helpfulness": 1, "user": "bluedottraveler", "date": "November 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 22011123, "likes": {"liked": "— location, ambiance, staff", "disliked": "— has a bit of the overripe vieux carre feel"}}, {"rating": 1.0, "title": "Robbed - then stiffed by management", "text": "I wish I could have stayed longer and am anxious to return.", "helpfulness": 2, "user": "StillSteamed", "date": "November 19, 2008", "id": 22010476}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "On a Friday night, a burgler broke into our room and stole several hundred dollars in cash. The burglar did not take credit cards or anything else, just cash from a pants pocket and from a purse.", "title": "Hidden gem in the Quarter", "helpfulness": 2, "user": "Tigergrl", "date": "November 13, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 21818807, "likes": {"liked": "— Location, price", "disliked": "— Continental breakfast could have used some fresh fruit, parking expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Early Saturday morning we reported the theft. We were told repeatedly that there was no manager on duty, and that nothing could be done until Monday. On Sunday, the story was the same - no one from management was available. On Monday we contacted \"management\" who refused to meet with us - agreeing only to a brief, unpleasant phone conversation.", "title": "Will Stay Here Again & Again", "helpfulness": 1, "user": "RIRedGirl", "date": "November 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21654599, "likes": {"liked": "— Charming atmosphere", "disliked": "— no room service, but that's ok"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The hotel is beautiful and the location is terrific if you want to be in the best part of the French Quarter. If you have any desire for sleep make sure to request a room OFF of the street. Also, the continental breakfast literally consisted of bread and some apples and oranges. The price is extremely reasonable for this location and the room was lovely. Again...you DO NOT want to be located on street level or facing the street. It sounded like a drunk person was going to crash through our window....more than once during the night.", "title": "Make sure to get courtyard view", "helpfulness": 1, "user": "saints-girl", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 83745502}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We studied Hotels in the French Quarter and finally decided on Place d'Armes. It was everything we wanted and more. The location could not have been better. The location was perfect because it was close to everything. We did not rent a car - and the hotel was within walking distance of either our destination or of the public transist system or a cab was available within a couple of minutes.", "title": "Awesome!", "user": "RMarshall2", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83734867}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The staff was friendly and eager to meet our needs. When we asked for hot tea or more coffee they were at our door in under 5 minutes.", "title": "New Orleans charm and great location, but................", "user": "c0c0d", "date": "October 12, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 83214075}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The desk clerk during the day was an amazing multi-tasker who could check out 2 guests while answering your questions at the same time.", "title": "lovely place", "user": "jen91", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83067549}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The court-yard is a beautiful place to relax and unwind before heading out to the Quarter for another fun fill day.", "title": "Ideal location", "user": "woodstock5", "date": "October 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82714702}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Our group of 5 ladies returned to NOLA and this hotel for a long weekend. Staff was and is friendly and fantastic. Love the Courtyard for sharing experiences over wine with other guests, a quiet respite steps away from the heart of the French Quarter. Coffee, juice and rolls are a nice plus for breakfast. Rooms are basic but pleasant. We had a few repeats of the paranormal we experienced before but nothing really scary. Just pleasant \"spirits\" all around!", "title": "Return Trip as good as the First", "helpfulness": 1, "user": "jojosgranny", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119959044}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Would not stay here again. Very loud. Uncomfortable bed. No hot water to shower with the day we left and no apology offered. The room was clean and beautiful.", "title": "Place D'Armes", "user": "Crystal C", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 119955769}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We have been staying at Place d'Armes for 25 years. Situated just off Jackson Square, this is one of the most conveniently located hotels in the French Quarter. If you are looking for the cookie cutter convention hotel/one size fits all environment, well, this is not it. No two rooms are exactly alike. A new adventure awaits each time you visit. The hotel features balconies overlooking the street, or if you prefer, the courtyard. We have always found the rooms to be clean, neat and orderly. Bear in mind that the hotel is very old and modernization has occurred over the years on an \"as-needed\" basis.", "title": "Best in the Quarter", "user": "marlinchaser3", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119944338}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Continental breakfast is served each morning just off the courtyard. You can enjoy croissants, juice and coffee around the pool if you like, or take it back to your room. Breakfast staff along with the rest of the hotel staff is always helpful and friendly.", "title": "Rude Staff", "helpfulness": 1, "user": "frau", "date": "October 30, 2011", "detail_rating": {"service": 1.0}, "id": 119913256}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "An absolutely wonderful experience whether for business or pleasure!", "title": "A Delight of a Hotel", "user": "Addisen", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119905445}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 3, "variance": {"poor": 64, "average": 123, "very good": 514, "terrible": 55, "excellent": 654}, "aka": "Place d Armes Hotel", "slim_ranking": 0.18, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Historic Hotel situated in center of French Quarter & comprised of 9 restored 18th century buildings."}