{"user_rating": 4.0, "review_count": 393, "name": "Plantation Hale Suites", "reviews": [{"rating": 4.0, "title": "Pretty good deal at Plantation Hale", "text": "Although most reviews of this hotel were basically positive, I saw a few concerning reviews about the Plantation Hale posted previously here, which led me to some significant concern just before we arrived there for our stay. All concerns were unfounded, however. We were assigned to unit A-16, which is a one bedroom condo unit. It was in good condition, although obviously a lot of things were done low budget, as one would expect for paying a little over $100 on such a touristy island. But everything was very clean. Concerning roaches and other bugs, as one other reviewer wrote a bad review about - no bugs at all, and in fact, the hotel sprayed for bugs while we were staying there. Apparently, Best Western itself owns buildings A-E (those were the buildings sprayed during our visit), and perhaps the later units (F-J) are privately owned as some have noted, and may not be cared for as well. So I guess my best advice is to try to get a unit in A thru E.", "helpfulness": 6, "user": "Dulcinea10", "date": "July 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8034920, "likes": {"liked": "— The full condo for hotel room prices", "disliked": "— Nothing really - really cheap cutlerly in the kitchen??"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Another concern one reviewer noted was crime, as someone broke into her unit. We did not have this problem, but we had a unit right near the conceirge building, and on the second floor, so I guess it would be good advice to ask for one of those units for increased security. Otherwise, just make sure your lanai (porch) door is locked!!", "title": "Great home away from home", "helpfulness": 4, "user": "kenanmt", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7770939}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "here is what to expect in your condo unit, particularly the kitchen so you are prepared:", "title": "Relaxing time here", "helpfulness": 7, "user": "Blake90210", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7672607, "likes": {"liked": "— Value, location", "disliked": "— Can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "3-4 pieces of basic tableware (plate, glass, coffee cup, bowl)", "title": "Great location, mid-level accomidations", "helpfulness": 7, "user": "Balckyball", "date": "May 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7579747}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Basic cutlery, really really cheap but serviceable, 4 pieces each", "title": "Never had a problem at this friendly place, loved the pools and the suites.", "helpfulness": 7, "user": "KauaiVagabonds", "date": "April 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7463320, "likes": {"liked": "— Value, location", "disliked": "— Couldn't stay long enough"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "stayed here for 4 nights at about $144 per night including tax. 4 of us in our 20s. one bedroom with kitchen ( i think all the rooms feature the same amenities) we stayed on the ground floor, convenient because i don't think there was an elevator. would stay here again if we're in kapa'a the hotel is convenient for the area able to get to princeville/hanalei in about 3o minutes as well as po'ipu and waimea canyon. kind of iocated at a middle point on kuhio hwy (major rd on kauai). clean enough rooms. staff at the front desk was friendly, but when we asked the activities concierge to recommend a good swimming beach (since the beach nearest to the hotel is not for swimming) she recommended the baby beach a bit north of the hotel, found out when we drove there and weren't short drive to foodland for groceries and several bars/restuarnts. located right next to the coconut marketplace, lots of food and souvenir shopping available, just beware things close earlier at the marketplace (we were coming from waikiki where everything's open late) and on sundays many of the shops and restaurants/fast food places are closed (we arrived on sunday and were a bit disappointed walking around the marketplace and nothing was really open) not an expert on shave ice but we really loved the ice at the fish hut and for regular food we loved harley's bbq, lappert's ice cream and tc's island grill were satisfying. anyone from ny/nj beware of aloha pizza. i've had not so great pizza in the south and midwest before but our whole group agreed it was THE worst pizza we'd ever had. just an opinion :) free access to internet via ethernet in the room, wi-fi near the front desk only. access to pool and hot tub, we went to the hot tub almost every night to relax. grill and patio area available to bbq. washer/dryer available but not for free. parking is free but when we checked in the girl forgot to give us a parking permit and the second day we received a written warning saying our car would be towed without a visible permit. overall a decent experience.", "title": "would stay here again", "user": "misstina26", "date": "September 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 19630402, "likes": {"liked": "— room was adequate. free parking and internet, pool and hot tub access. location was good", "disliked": "— washer/dryer not free, no swimming beach ( we were aware of this when we booked but it defintely would be more convenient if you could swim right there) , the activities concierge"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My new husband an I stayed here, at the Plantation Hales right after our nightmare wedding reception and honeymoon at the Prince ville Resort. We were so so happy to see that not only was there a working fridge but also a full clean and modern kitchen. The marble bathroom and modern sinks were a nice surprise also! We liked it so much we stayed for a week instead if the one night we had originally booked. The room was clean, no mold anywhere ( the prince ville resort was loaded with mold). We could walk right out to the ocean from out Lanai. Housekeeping was wonderful and we got breakfast in bed for under 20 $ yes, I kid you not. . .", "title": "Much CLEANER than the Princeville Resort!", "helpfulness": 2, "user": "AprilsaPSSDOFFbride", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18402823, "likes": {"liked": "— location to the ocean and Coconut Market and the funky town of Kapaa", "disliked": "— nothing to be honest"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The price was right and the service was great. I HIGHLY recommend the Plantation Hales and the awesome town of Kapaa. The best restaurant we went to on the island was in Kapaa and that was the Blossoming Lotus. Hope you enjoy and dont make the same mistake we did! If you are planning a wedding, call Diana Gardner from Alohana Weddings! We had an amazing ceremony, we only wish we had her plan our reception!", "title": "Absolutely Adequate", "helpfulness": 2, "user": "cindyathome", "date": "July 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18107375, "likes": {"liked": "— It was in Kauai", "disliked": "— Pools were closed, there was some construction/roofing going on and the TVs didn't work properly."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "STAFF: \"Nice\" but nothing to write home about. See comment below regarding TV service.", "title": "Clean Quiet Relaxing", "helpfulness": 2, "user": "ATerrapin", "date": "July 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17675789, "likes": {"liked": "— The cleanliness, internet access & central location", "disliked": "— can't think of a thing"}}, {"rating": 5.0, "title": "Loved Kapaa", "text": "PROPERTY: The grounds were immaculate, with plenty of well-lit parking;however, two of the three pools were closed for maintenance, including the one just outside our room-bummer! The remaining one was very nice and not too crowded at the times we used it - late afternoon.", "helpfulness": 1, "user": "TexasEagle", "date": "April 30, 2008", "id": 15518840}, {"rating": 1.0, "stay_parameters": "Stayed December 2006", "text": "This is a budget property that turned out not to be a budget. Our room was on a busy busy highway with lots of noise and traffic at all hours of the night. No fresh air. We had to upgrade to get a decent room and was charged additional rates.", "title": "terrible", "helpfulness": 8, "user": "travelerseattle", "date": "December 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 6482571}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "After the upgrade, we could have stayed in a much nicer property for the same money. The three pools are located by the hgithway and are noisy and you are breathing car fumes. The room was okay. The staff tried to be helpful, but gave us wrong directions a couple of times. The place was alittle to sleazy for my taste. Would not go back or recommend it to anyone. There are much better properties for the same money. This is our 6th trip to Kauai.", "title": "a decent choice", "helpfulness": 9, "user": "Shi Hu", "date": "November 30, 2006", "detail_rating": {"front_desk": 3.0, "location": 3.0, "value": 4.0}, "id": 6308618}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Plantation Hale is one of the best places to stay in Kauai, and a value to boot!. I booked unit G-7 through a local agency (Garden Island Properties). It was nicely decorated and very clean with wood floors. The unit had everything we needed. We saved a lot of money by making our own gourmet breakfastes - even bought Filet Mignon at Costco and grilled them on the outdoor barbecue - so we had a steak dinner for two for under $20.00! It was just a few yards walk across a grass plain to a beautiful walking beach - a swimming beach is not too far away, and a beautiful snorkeling area (Lydgate Park) is only about a mile to the south. The Coconut Marketplace is only a few yards away, which is nice for evening browsing. There were two grocery stores within walking distance with many other shops. By far, the best place I have stayed in Kauai - and I used to live there, so I know the island quite well. Its about halfway to the north shore or south shore, so it is close to everything. The onsite management was also very helpful. Parking was plentiful and never a problem. A wonderful place to stay!", "title": "Best Value in Kauai!", "helpfulness": 4, "user": "NativeKid", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11020778, "likes": {"liked": "— The location to island activities", "disliked": "— Traffic on Kuhio Highway"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "What a great place! True, it is an aging hotel, but they keep it very clean and neat. The room was very nice, couch very comfy for vegging after a long day of site seeing, the bed was soft and firm - very nice, the a/c worked well, but you often did not need it due to the lovely trade winds blowing in through the sliding glass doors in both the living room and bedroom - first floor guests should think twice about leaving them open at night due to easy access for break in’s. We used the air at night to drown out the noise of the roosters crowing and the road noise [we faced the road] but it was not that bad. The internet access at the lobby was nice to have for quick checks of your emails, the pools were lovely and cool, and the hot tubs were great! The beach just beyond the field was lovely to walk on and great for watching the sunrise and the planes landing at Lihue airport! I would highly recommend this hotel for everyone who is not looking for a spa atmoshpere, but it was truly comfortable when we were there [which was not much!]. We can’t wait to return and will stay here again.", "title": "Great Place", "helpfulness": 1, "user": "cya656", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10381330}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This place was great! Very good size. 2 full beds in room plus a sofa sleeper in living room. Seperate kitchenette & big bathroom. If you're going to cook for yourself you will most likely need a baking sheet (we did & it's not in the room). We did lose power once but it was for a short while. We managed to lock ourselves out of our room & the staff was on it right away. (Upon waking we went out to the lanai. Our chain was still on as well as the deadbolt on the door. When pulling the slider closed the lock clicked into position. Not sure how this happened, but is wasn't a problem for the staff. No broken door or locks due to our incident.) Beach towels are provided at your request with a deposit. Bring your laptop, there is internet in the rooms. Our rooms were made up nicely each day & nothing came up missing. Be prepared for roosters in the day & frogs at nite, none of which bothered us a bit. We were not allowed a late checkout, they said they were at full capacity. If your lanai (balcony) faces the ocean you can watch the sun come up! Walking distance to non-swimable beach (beautiful none the less). Walking distance to Coconut Marketplace where prices are reasonable & selection is great plus they give you coupons. We enjoyed Eggberts for breakfast more than once & hit The Fish Hut for all our shave ice needs. Lappert's is also delicious tho pricey! Overall, great central location on the island.", "title": "Fabulous!", "helpfulness": 3, "user": "clarandelly", "date": "October 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10333419, "likes": {"liked": "— size & service", "disliked": "— not as clean as I like"}}, {"rating": 3.0, "title": "A good value with quiet pools...", "text": "The Best Western Plantation Hale was a great spot to stay to see all of Kauai being centrally located. Upon check-in I was a bit dismayed as they wanted payment for the entire 6 night stay immediately. I thought that a bit odd but with the assurance of the hotel that they would immediately credit my account if I decided to depart early I accepted those terms.", "helpfulness": 5, "user": "catladyaustin", "date": "September 25, 2007", "id": 10004317}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed in a one bedroom unit on the first floor which was totally fine. The unit was nothing fancy but having cooking facilities and a quiet pool to relax at was a big plus. It seems that there a quite a few long term residents so that added to the comfortable feel. The bed was comfortable and the linens clean. Housekeeping was attentive. The only reservation I had about the hotel is the distance of the beach which is about one half block walk from the hotel across an open field. The closeness of Lydgate Beach Park however was a plus as it has a protected beach for swimming. All in all a good value if you plan on exploring Kauai and want to be centrally located without a lot of fuss. We enjoyed our stay and would return to this hotel.", "title": "Great Value/Overlooked Gem", "helpfulness": 4, "user": "Patnmel", "date": "July 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8069172, "likes": {"liked": "— Cleanliness and quiet", "disliked": "— That I had to leave !"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The worst thing one can say is it is 300ft to the beach, but has a wonderful view with palm trees to really set the \"I'm in Hawaii\" mood.", "title": "Great Value", "helpfulness": 1, "user": "Sunchaser99", "date": "April 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15115287}, {"rating": 4.0, "title": "Best Western Plantation Hale", "text": "Nicely furnished, not plush, but fully suitable for a vacation home.", "helpfulness": 3, "user": "BJandAndi", "date": "March 17, 2008", "id": 14337602}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "You can spend more and get a fancier place but you wont get better bang for your bucks.", "title": "Great Price, Great Stay", "user": "OhioMeisje", "date": "March 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14128375}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Just be sure to get an oceanside room. The ones on the roadside are quite close to the road.", "title": "Perfectly Decent Hotel", "helpfulness": 3, "user": "Kfren9", "date": "January 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12984236}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Just arrived home from a week in Kauai. The best vacation we ever had. The hotel is actually renovated apartment building run as a hotel. Huge clean room with full kitchen, balcony and clean pools. No freebie breakfast but we cooked ours daily anyway. Great AAA rate. We stayed in J bldg. Not ocean front but for the money...can't beat it. Our building was quiet except the normal roosters in Kauai. Safeway right down the street. (Don't forget to get the \"loyalty card\") to say $$$ at Safeway. Safari Helicopter tour was awesome. Make sure you go North to Lighthouse, unreal! We had whales everywhere we went North, South,East and west. Not one day of rain which We heard was abnormal. Saw all the sights...BTW, the airport is a breeze...don't go too early!! Another tip if flying Aloha Airlines...book the cheapest flight of the day regardless of time and they will most certainly accept you as a stand-by. They dont assign seats and they were just calling out that anyone traveling to scheduled to fly on a later flight was welcome to board now! We did it and even our checked bags made it with us! Smiths Luau was good for us. Neat grounds and I thought the food was terrific. Spouting horn was neat. All the beaches...Well cannot say enough good about this island experience!", "title": "Nice hotel near Lihu'e airport", "helpfulness": 1, "user": "dukiedrew", "date": "January 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 12944437, "likes": {"liked": "— Location, price, free internet", "disliked": "— close to highway"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 25, "average": 41, "very good": 163, "terrible": 8, "excellent": 156}, "aka": "Plantation Hale Hotel Kapaa", "slim_ranking": 0.25, "description": "Plantation Hale Suites is located in the heart of Kauai on the scenic Royal Coconut Coast and steps away from Waipouli Beach. Enjoy spacious one bedroom suite accommodations (738 sq ft) with the finest amenities such as full kitchens and private lanais. Suites sleep up to six people. High speed Wi Fi,Flat Screen LCD TV's with Cable (60 preimum channels)Blu-Ray DVD, Movie library,350 DVD's. Planation Hale has three outdoor pools,(4)picnic and BBQ areas, whirlpool spas, Shuffle Board. The resort offers several restaurants, full Concierge and Activities Desk, mini market, ATM, and a SPA. Located nearby, Golf, Tennis, Horseback Riding, Wailua River and Kayaking,Opaeka'a Falls, Waimea Canyon, Hiking Trails. Kauai's best location and value. great for a romantic getaway, or a family vacation. Our dedicated staff welcomes you with the true Aloha spirit."}