{"user_rating": 4.5, "review_count": 2203, "name": "Platinum Hotel and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "We stayed here over Memorial Day weekend in 2008 and got a great deal booking directly through the hotel's website using the AAA rate. All the reviews on TripAdvisor were great, so we had our hopes high.", "title": "Stay here!", "helpfulness": 5, "user": "wickidkid", "date": "November 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22014897, "likes": {"liked": "— Non-smoking and non-gaming", "disliked": "— Slow valet"}}, {"rating": 5.0, "title": "Fantastic - worth more than platinum", "text": "The Platinum didn't disappoint. Check-in was a breeze and we got a regular suite on a high floor. Our room faced away from the Strip, but still had a great view. I suspect this was originally going to be a condo tower, but was converted to a hotel. All the rooms are suites, with a full kitchen, living room, washer/dryer and full size bathroom with separate shower and tub. It also had a generous balcony and flat screen TV. The hotel is non-smoking, which was great! Plus, the washer/dryer are perfect for washing the smoke out of your clothes after being in the smoky casinos.", "helpfulness": 2, "user": "Ollie06", "date": "November 17, 2008", "id": 21957540}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The hotel is on Flamingo behind the Strip. It's within walking distance of the Strip (you can cut through Bally's), but I'd still recommend getting a car, because it can be quite a hike after a night of drinking and gambling.", "title": "Love it! Love it! Love it!", "helpfulness": 4, "user": "spagirlLosAngeles", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21936775, "likes": {"liked": "— Huge room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We didn't eat at the hotel or use the pool or spa, so I can't comment on that. But the staff was so friendly and so accommodating to servicing our room at any time of the day or night (you know how off your schedule can be when you're in Vegas).", "title": "Wonderful place to stay in Vegas", "helpfulness": 2, "user": "Gusmoose", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21898808, "likes": {"liked": "— Clean, non-smoking", "disliked": "— Next to gas station"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "I can't wait to stay here again the next time I go to Vegas.", "title": "The best hotel experience in Las Vegas", "helpfulness": 3, "user": "ninja25", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21836545, "likes": {"liked": "— service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Stayed 5 nights in October with husband & 2 children (17 &11yrs). We all loved it here. We booked a one bedroomed \"Solitaire\" suite.Check -in was a painless experience. We were upgraded ( no fee) to a \"Princess\" suite. We were on the 8th floor with a Strip view. If you can, try to get a higher floor.All the staff we encountered were friendly and polite. We didn't have a car and we didn't use the restaurants.The room was exceptional. Much bigger than we expected, spotlessly clean & very well equipped (for any Brits visiting there is a kettle!!) The beds were comfortable, and clean.We had 2 queen beds, so didn't use the sofa bed in the lounge. Plenty of wardrobe space. Bathroom was big, with large whirlpool bath, walk in shower, double sinks, hairdryer. The pool was quiet. We were the only people in the pool each time we visited.You are only a short walk (10 mins) from the Ballys/Bellagio junction on the Strip. On the walk to the strip there are at least 3 convenience stores for basic provisions. At the end of each exhausting day visiting the sights of Las Vegas the Platinum was a smoke free, peaceful haven to return to.", "title": "Heaven- just off the Strip", "helpfulness": 3, "user": "queenmary1", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 21547652, "likes": {"liked": "— Well equipped and clean", "disliked": "— having to leave"}}, {"rating": 5.0, "title": "Platinum it is", "text": "We stayed at the Platinum Hotel & Spa for 3 nights in mid September - what a great place. We booked a Princess Suite - superb as were the staff. A restful, peaceful, central location just back from the Strip. Facilities in every way were great and a perfect place to come down to earth after being in the Grand Canyon area for 5 days. Cannot fault this place - it was perfect for us in every way and one of the most comfortable and certainly the reasonably priced we have stayed.", "helpfulness": 2, "user": "Fred & Denny", "date": "November 1, 2008", "id": 21446564}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Fred & Denny, Perth, Australia", "title": "Horrible Valet service", "helpfulness": 8, "user": "erbeman", "date": "October 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21436188, "likes": {"liked": "— room size", "disliked": "— VALET"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "We recently spent 12 days in Vegas. The first 5 were to be at the MGM signature the last 7 were to be at the Platinum. The first 5 days at the Signature were awesome! Then we came to the Platinum and it went downhill from there. Check-in was fine room was freakin awesome!! Then we decided to go to dinner. Came down ask the Valet to get our car, then proceeded to wait 10-12 minutes till it showed up. In the mean time not one other car came or left to distract the valet. So, when he finally showed, I asked if it typically takes that long to get a car. He responded by telling me that valet was a free service and if I wanted my car fast, then I needed to take care of him then he would take care of me!!!! I was blown away that he said that to my face. I went right in and told the manager. She gave me a pass that kept my car parked in front of the hotel for the rest of our stay. That way, we didn't have to deal with the Valets again. So, we were pleased until the next night when we come back from dinner and the head valet proceeds to tell me that he'll park my car this time, but from now on, I needed to go park it myself on the 10th floor of the parking garage because that's what VIP's do!!! I said that sounds like park your own car to me. He then told me he was there last night and saw the other valet get in trouble and he wasn't going to get in trouble, so I needed to park it myself then just walk back!! I said whatever, We're going to leave in the morning. We told the manager, then checked out the next morning. So, as long as you don't get a rental car, Platinum is great. If you do get a car, DON'T STAY HERE!!!!", "title": "Best Hotel Experience Ever!", "helpfulness": 4, "user": "IANative", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21364124, "likes": {"liked": "— Can't Pick One - Top 2 are EXCELLENT STAFF and VERY COMFORTABLE ACCOMODATIONS!", "disliked": "— ABSOLUTELY NOTHING!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I just returned from a business trip in Vegas in which we stayed at the Platinum Hotel. I've stayed in many hotels; however, I have NEVER had such an EXCELLENT overall experience as I did at the Platinum! I had a late arrival and was extremely tired, the front desk person that checked me in (I think it was REBECCA) was the most pleasant and accomodating person I'd ever met in the service industry!", "title": "Fantastic!!", "helpfulness": 2, "user": "findingkaren", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 21149262}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Originally booked at the Wynn for a convention but decided to changed when searched web and some of the read reviews. The room size which was a suite, was around 1050 sq feet. The room were very luxurious with a 2 person whirlpool tub in the bathroom. The bathroom was bigger than most bathrooms you would get at any casino. It came with a full kitchen that included a refrigerator dishwasher microwave stove and oven and full set of dishes. the living room was nice size with a beautiful view of the mountains and a balcony. It also had a fireplace a large screen high definition screen tv. My room also had a washer and dryer. The bedroom was again nice size with the most comfortable bed that we ever slept on. They gave us 2 luxurious white spa robes to use with no extra charge. they also had a gym and a indoor outdoor pool.", "title": "Hit the jackpot", "helpfulness": 3, "user": "jsandler", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 20389627, "likes": {"liked": "— everythoing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The staff when above and beyond to please you starting with the valet parking down to maids. My wife and I felt we hit the jackpot with our choice of this hotel.", "title": "LOVE IT!", "helpfulness": 4, "user": "chachistef", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20378239}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This hotel is great!... We reviewed all pictures before booking it, but once we arrived to our room.... WOW! .. It was better than the pictures on the websites. The price is decent and since we book a month in advance we got a good deal. Our rooms were nice and clean. I love the fact that we had a big kitchen area. All the kitchen appliances were farly new and modern. Also its a non smoking hotel... so there isnt that ugly stuffy smell as soon as you walk in, like the other Hotels in Vegas.", "title": "Absolutely loved this hotel!", "helpfulness": 2, "user": "julesjay", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20250118, "likes": {"liked": "— The fact it is non-gaming/non-smoking", "disliked": "— No downsides"}}, {"rating": 2.0, "title": "Nice Hotel Bad Service", "text": "The hotel isnt located on the Las Vegas Strip, but it was fine with me. A little walk didnt hurt. It was only one block away from Ballys!", "helpfulness": 1, "user": "Benfrnkl", "date": "September 16, 2008", "id": 20107015}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "So next time try Platinum Hotel!", "title": "Nice retreat close to the strip", "helpfulness": 1, "user": "BGBMO", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20086611, "likes": {"liked": "— Very large condo style rooms"}}, {"rating": 5.0, "title": "the best hotel in vegas", "text": "hi all,im again at my fav hotel in vegas THE PLATINUM SUITES,and im at the hotel now as i write this review.when you check-in to this hotell you will notice how attentive the hotel staff are and its all genuin,when you want anything done they do it with speed and they do it correctly on the 1st goe,and i must give a massive 10 out of 10 to the concierge GITA.now as im from the uk and my fience is from the usa i spoke to gita and asked her to arrange some rosses to be placed in the room and 1 of the rossses to be placed on the bed as a surprise for my fience when we got into the room yesterday,this all had to be arranged by phone---dont forget im doing this from the uk aswell---not only did GITA get this all done she managed to have this all arranged for me on her day off aswell,all i can say is that you can keep youre ceasers and youre mgms----[ive stayed in them aswell]this hotel is fantastick,just behind ballys so the strip is only a 10 minuetes walk and all the suites from the smallest to the biggest are massive in size and all fitted to the highest standard.all i can say is that if you ever wonna stay at a hotel in vegas with luxury and you dont wonna get ripped of by the mgm or harrahs group then stay at the platinum hotel las vegas", "helpfulness": 3, "user": "scott1961", "date": "October 20, 2008", "id": 21030375}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed here for 6 nights on our honeymoon at the end of September. We had booked a Solitaire suite with a mountain view but were upgraded on check-in to a Princess suite (we could pick our view so went for the Mountain view, which was amazing at sunrise). Go for a high floor room.", "title": "Great Hotel", "helpfulness": 1, "user": "JB6878", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21016595}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Check-in was quick and friendly.", "title": "Perfect stay away from the strip", "helpfulness": 2, "user": "waynelaw78", "date": "October 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20870159, "likes": {"liked": "— Quiet, but convenient to all activities", "disliked": "— Carpet was old and dingy in room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel is lovely, the rooms are huge, the bathroom is amazing.", "title": "quiet oasis off the strip", "helpfulness": 4, "user": "adtpny", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 20595362}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We ate in the restaurant for breakfast a couple of times, the service was a bit slow but the food was good. The Hotel bar is nice but was never very busy so you got served quickly.", "title": "Dollar for Dollar, the Best Hotel in Vegas!", "helpfulness": 8, "user": "cttraveler33", "date": "September 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20502149, "likes": {"liked": "— Spacious, clean, modern room with great view of Strip!", "disliked": "— Nothing"}}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 33, "average": 117, "very good": 490, "terrible": 29, "excellent": 1534}, "aka": "Platinum Hotel", "slim_ranking": 0.037037037037, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The Platinum Hotel and Spa is non-smoking with no slots or tables; a sanctuary located near the action (just a block from the Las Vegas strip) with the look and feel of a trendy boutique hotel. Specializing in personalized service and offering an intimate spa, it's own restaurant and lounge, with an indoor/outdoor pool and spacious lounging deck, the Platinum offers only spacious suite rooms."}