{"user_rating": 4.5, "review_count": 1768, "name": "Playacar Palace", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I felt likme we were in heaven. After a couple of stressful years w/out a vacation this was what the doctor ordered. The location, the resort were great. The service from the Staff made it perfect! Eric and Baxter were the best! Elvira got us offto the right start and Juanita started our day, every day, off right! Love it, ant to go back tomorrow!", "title": "Great Vacation!", "helpfulness": 4, "user": "stmaknight_11", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117515616}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This was our Honeymoon.. 8 nights, 5 nights at Aventura Spa Palace & then 3 nights at PlayaCar. I did it that way, because I thought it would be neat to do some diving at the end in Coz & I thought Playacar was a good location, being in the middle. Just want to say that I am a huge fan of Palace Resort, this is my 3rd Palace Resort stay, & my 6th time in Mex, 1st time in PlayaCar. ( btw we loved Aventura Spa 100%)", "title": "Not my Prefrence", "helpfulness": 3, "user": "Dreamsofriveriamaya", "date": "August 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 2.0, "service": 2.0}, "id": 117475533}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Just to be fair, I will start with the Pros:", "title": "The most amazing views of the caribbean beach", "helpfulness": 3, "user": "Roger A", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117375283}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Good location- IF YOU LIKE TO PARTY, OR SHOP ( and do not mind VERY agressive st. vendors) Good location to take the ferry to COZ.", "title": "Me encanta Playacar", "helpfulness": 9, "user": "saelukey", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116951521}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Room- One of the most beautiful Rooms & views I've ever stayed in. ( we stayed in the honeymoon suite) Very comfy bed & pillows.", "title": "Best hotel in mexico! we we`ll be back", "helpfulness": 8, "user": "Tommybw", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116949858}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "More good news about the Playacar; I chose this resort especially due to all the postiive and desciptive reviews on this site - and Tripadvisor is yet to steer me wrong.", "title": "More good review", "helpfulness": 10, "user": "kasey363", "date": "February 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6849573, "likes": {"liked": "— Location and size", "disliked": "— Need more travel/tour/spa booking help"}}, {"rating": 5.0, "title": "Better the second time I stayed there", "text": "Overall - if you read on (not taking space by repeating what been said over multiple times in subsequent reviews) I'll put it in this format:", "helpfulness": 8, "user": "Happy_on_the_road", "date": "February 19, 2007", "id": 6814185}, {"rating": 5.0, "title": "Heaven on Earth", "text": "1. We were first timers to this area of Mexico", "helpfulness": 10, "user": "TravelGirl24-7", "date": "February 19, 2007", "id": 6814109}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "2. First timers to an all-inclusive", "title": "A honest review from a well traveled family", "helpfulness": 9, "user": "Scalise", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6807793, "likes": {"liked": "— The service", "disliked": "— The lack of beach and overall ambiance"}}, {"rating": 5.0, "title": "10 Days of Rest and Relaxation", "text": "3. Seasoned travelers that tend to stay in higher end hotels and B & B's", "helpfulness": 11, "user": "CTmeg", "date": "February 12, 2007", "id": 6784016}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Just recently returned from my stay at the Playacar Palace. Had a fabulous time! The resort is gorgeous, the rooms spacious, and the staff superb! Always polite, friendly and accomodating from check-in to check-out. We were there for a friend's wedding and of course the day of the ceremony, it rained. They found a more than suitable space for the ceremony right next to the reception area. It all turned out beautifully, would never have guessed that having the wedding inside wasn't the original plan.", "title": "Playacar Palace is top notch all the way", "helpfulness": 6, "user": "bluefrog26", "date": "October 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10075161, "likes": {"liked": "— Great staff, very accomodating. Mostly adults, not fighting for space in the pool with a lot of kids.", "disliked": "— Didn't play authentic Mexican music at the pool bar and didn't have a lot of Mexican food on the menus."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "My only area of concern had nothing to do with the hotel, but with our travel agent. We booked through DestinationWeddings.com. Very poor service. Would have been better off booking through Travelocity.", "title": "Poorly Run and Managed property", "helpfulness": 7, "user": "JTrue", "date": "October 5, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 10044315, "likes": {"liked": "— Pretty Resort and a neat pool", "disliked": "— Horrible staff. No customer service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The management at this property is not concerned with the best possible experience for their guests. I have been working with a family agent to book a large group wedding. When I went to this property to review it for my wedding we thought that the resort looked good. There were several other resorts we were considering, but this property promised a bunch of things. (Free receptions, gifts, among other things.) It all sounded great. So I went home and told my travel agent that this was the property for me. When I contacted the resort they informaed me that I would loose everythig they promised if I still used my agent (whom I have used forever and is a family friend.) So I had to choose between all the promised free stuff or my agent. Regretablly I chose the \"free\" perks. Since that time everything has been in my hands. The price for the wedding group keeps changing. I thought this property was nice, but there were others that I saw that were much nicer. I chose this property becuase of the extra promised stuff. So far nothing has been delivered. I can never get a hold of the sales people there at the property. I could always get a hold of my agent. Needles to say before my wedding goes down in a blaze of glory we will be changing resorts. I should have known the moment they pushed my family travel agent out the door. Next place we go she'll be by my side no matter what \"goodies\" are promised. WEDDING GROUPS BEWARE!!!! Not everything promised is delivered.", "title": "Great Honeymoon", "helpfulness": 11, "user": "Lovin_a_Marine", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8726740, "likes": {"liked": "— great rooms with amazing views and of course the staff", "disliked": "— nothing, I loved every single thing about it"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "My husband and I had a perfect honeymoon at Playacar Palace. Our room was fabulous, the food was amazing and the staff was outstanding!", "title": "The Best Service and food!!!", "helpfulness": 10, "user": "cerina", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8509182, "likes": {"liked": "— Everything", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "One night, one of the restaurants (I can't remember which) cooked their \"special\" tableside, and to this day I still talk about how amazing that sause was that they put on the shrimp. We also received a special honeymoon dinner in the Italian restaurant that was also very delicious. It was really hard to come back home and eat regular meals after being fed like that all week :-)", "title": "Great, but beware couples!", "helpfulness": 10, "user": "louis-louis", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8498077, "likes": {"liked": "— location", "disliked": "— kids !"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "My wife and I, our 11 year old daughter and 14 year old son stayed at the Playacar Palace from Dec 16th through Dec 30th. My wife and I, have spent 36 weeks over the last 21 years in Cancun or the Maya Riviera, at 16 different properties. Nineteen of those 36 weeks have been spent at the old Beach (Club) Palace, that had to be tore down and rebuilt after the 2005 hurricanes. We bought a \"Timeshare\" in 1984, from the \"Family\" that now calls themselves \"Palace Resorts\".", "title": "Nice Place, About What We Excepted", "helpfulness": 13, "user": "Laybackone", "date": "December 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6527643, "likes": {"liked": "— How close it was to downtown Playa Del Carmen/5th Avenue", "disliked": "— That you had to be all-inclusive to stay there"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We choose the PP because we prefer smaller resorts, the Xpa-Ha Palace rooms only accommodated three people, we didn't want to spend the extra time and money to get to and from the Cozumel Palace and the reviews on the Playacar Palace were mostly positive.", "title": "Stay away", "helpfulness": 15, "user": "Stephan65", "date": "December 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 6526749, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Check in went rather smooth. Last year at Aventura Spa Palace, they couldn't find our reservation, even though I had a copy, and it took over a hour. However we experienced the same \"room run around\" that others have mentioned. First they tried to put us into one of their worst rooms without a balcony. I knew that even though they said that they were 100% full, that at the time of our check in on Dec. 16th, it could not have been more than 60%. I told the Bellboy that we were members for over 20 years and we excepted a room with a balcony. After talking on his radio for several minutes, he took us to what must of been one of their worst rooms with a balcony. It had a walkout, but it was on the southside over looking a junking area next door and you could not even see the ocean. Of course I said no, several more minutes on the radio and he said that he would have a better room with a balcony, but it might be a couple of hours before it was available. I knew that I would be in the room for two weeks so I was willing to wait. However once I said I was willing to wait, magically a room was available (316).", "title": "Do not stay there.....", "helpfulness": 7, "user": "jimhp900", "date": "December 29, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 6515551, "likes": {"liked": "— close to Playa de Carmen", "disliked": "— over priced"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The only negative that I had on the room was that for the four of us, staying two weeks, there was not a lot of room to store stuff. The Jacuzzi took up a lot of the room and in the only dresser, two thirds was taken up by the liquor dispenser and mini-fridge. The room was kept very clean, we always had plenty of towels and they had a number of other toiletries that they replace, if used, everyday (i.e. razors, toothbrushes, mouthwash, etc.). We tipped the maid weekly.", "title": "Smaller Palace Resort - Still Excellent", "helpfulness": 18, "user": "lonepeak", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6511104, "likes": {"liked": "— Service is outstanding.", "disliked": "— Eroding beach"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The food was good, some very good. We ate a third of the time in each of the dining rooms. After a week it did get a little old, it is true that there is not a lot of variety. This is one reason we don't prefer all-inclusive.", "title": "Good Resort, But not as good as the reviews say it is...", "helpfulness": 10, "user": "ThornhillFamily", "date": "December 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6510728, "likes": {"liked": "— The modern decor", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We originally booked our wedding at the Cozumel Palace for September 10th, but due to MANY flight cancellations resulting from travelling outside peak tourist season, we ended up at the Playacar Palace. It didn’t take long for us to realize it was a blessing in disguise. Flights to Cancun were more plentiful and affordable than Cozumel and the resort was immaculate. Every one of our guests told us that the Playacar Palace exceeded their expectations.", "title": "Amazing trip & wedding at the Playacar Palace", "helpfulness": 3, "user": "kinoxl", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118371655}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The rooms and grounds were kept spotless and the service was unbeatable. The staff engaged guests through activities such as: volleyball, water polo, water aerobics, and other competitions. The nightly entertainment was also enjoyable to most and included: Casino night, Break dancing, Salsa dancing, a Fire show, a Circus, karaoke night, and Michael Jackson Tribute show. Professional pictures were taken of guests during such events and activities in which could later be purchased with your resort credits. Guests also used the resort credits to enjoy the spa (was absolutely amazing), golf (beautiful grounds), the dolphin swim (fun time!), lobster dinner (was ok), and wine upgrades (in which can be taken home).", "title": "Loved it so much !", "helpfulness": 5, "user": "staffscasey", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118323355}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Our guests also enjoyed being so close to Carlos & Charlies, Senior Frogs, the Ferry to Cozumel, and 5th Avenue shopping district. Several of us ventured to Cozumel and visited the Cozumel Palace. Although the Cozumel Palace was equally as beautiful and also had great food and activity options, it doesn’t have a beach, in which we loved about the Playacar Palace. Some said that shopping in Cozumel was also better. However, being on the mainland gave us so many more off-resort options. We went deep sea fishing, which was only about a mile out. Our boat caught a 45lb Wahoo and the resort cooked it for our group. They made ceviche, soup and filets. Each one was better than the next. They didn’t charge anything either. This was a great experience and an excellent addition to our already great dinner in the Asian restaurant. On Sunday afternoon, the Luna Lounge was closed, yet, we were able to set watch the Redskins game while servers brought us beers every 10 minutes, along with wings and anything else that we could possibly want. During the trip, we tipped here and there to show our appreciation, although it was certainly not expected.", "title": "I MUST ADD....", "helpfulness": 2, "user": "tannedmom", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118251267}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "More about the Playacar Palace:", "title": "6oth birthday treat", "helpfulness": 3, "user": "leetanMontreal_Quebe", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118146352}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Breakfast buffet was standard, but good as expected. The sushi was excellent and they even brought you things you didn’t order. The Italian restaurant was amazing, especially the pizza. In the Italian restaurant, we had a wonderful apple dessert, while other guests had a banana one that was made right in front of us.", "title": "The best All-Inclusive Choice near the action of Playa Del Carmen....", "helpfulness": 5, "user": "Conde_brian", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 118109353}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We booked our honeymoon through RCI and were worried that we wouldn't get the honeymoon suite, as you can only request it and is only given depending on availability when you arrive. When we arrived at the resort, the honeymoon suite was booked up. So in exchange they gave us the governers suite, which is an upgrade from the HM suite, at no charge extra! They definitely go out of their way to make you happy.", "title": "Honeymoon Heaven", "helpfulness": 19, "user": "dlphnlvr_25", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10906127, "likes": {"liked": "— Service", "disliked": "— Nothing! It was all great!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Check-in was smooth even though we had a problem with our reservation (they didn't have a record that we prepaid the AI fees) However, after a few phone calls the issue was resolved. They apologized many times for the mix up and made sure we were happy. While we were waiting, they kept bringing us drinks! It only took about 20 minutes for the entire process.", "title": "Playacar Palace is THE hotel in Playa del Carmen", "helpfulness": 8, "user": "SarahBee76", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10787358, "likes": {"liked": "— The cleanliness, the attentive staff, the location, the high standard of the rooms, the ocean view", "disliked": "— The noise from the renovation work - only a few rooms left to complete - so won't be a problem for long!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "We stayed in room 210, the governers suite. It was beautiful!! We had 2 balcony's, a living room separate from the bedroom and a mini bar in both rooms. The place would be a nice apartment to live in, it's that big!! The resort does provide a lot in the rooms, including toothbruse, toothpast, shoe shine kit, mouthwash, full size shampoo and conditioner (biosilk), and many other items. The shampoo/conditioner was a really great product and my hair can be touchy. I wish I didn't bring all that with me!", "title": "Great hotel", "helpfulness": 5, "user": "MonikaB", "date": "November 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10532062, "likes": {"liked": "— Rooms and bar/restaurant service", "disliked": "— Pool activities team noise"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Service is excellent in all the restaurants and the food is amazing. Definitely 5 star. We didn't get tired of the food since there was so much on the menus, we had something different every night. Bartenders at all the bars aim to please and I now have a new favorite drink. They never let your glass get empty. Even on our last day after check-out, we received a day pass so we could still eat and drink until our shuttle arrived. They were still happy to help you and even made us drinks to go for our shuttle ride to the airport!", "title": "Friendly Staff in a nice beach, with some buts", "helpfulness": 3, "user": "Joaldi", "date": "October 25, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "service": 3.0, "location": 3.0, "business": 1.0}, "id": 10318999, "likes": {"liked": "— The front desk manager and staff and the beach.", "disliked": "— The food."}}, {"rating": 5.0, "title": "We had a wonderful honey moon at the Playacar Palace", "text": "The fire show and mexican show are must sees. I would skip the circus show unless you have kids, they might enjoy it. But in my honest opinion, I thought it was a bit cheesy and we were a bit bored with it.", "helpfulness": 10, "user": "amrat013", "date": "October 16, 2007", "id": 10087188}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The Playacar Palace is a beautiful resort. The rooms are very tastefully decorated and VERY clean. Housekeeping does a wonderful job of leaving you an inviting room to return to each day.", "title": "Warm service, relaxing atmosphere", "helpfulness": 10, "user": "matchboxAtlanta", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6629643}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The pool and grounds are clean and well maintained and the staff works very hard in these areas as well to maintain an impressively clean environment.", "title": "Almost Perfect!", "helpfulness": 28, "user": "ditzy007", "date": "January 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6599042, "likes": {"liked": "— The size, the staff, lounging by the pool right on the ocean", "disliked": "— Lack of food choices"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "Being located steps away from the fifth avenue shopping area is wonderful and it is so nice for an evening walk. The lack of a beach is not a problem... We did actually get to swim at the small hotel beach one day, and there are pretty beaches easily accesible on either side of the hotel.", "title": "Enjoyable Destination Wedding", "helpfulness": 10, "user": "mystery11", "date": "January 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6558432, "likes": {"liked": "— Wedding and reception arrangements"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The only thing that wasn't just top notch was the food. For an all inclusive, it was good. I happen to cook alot myself and live in a city full of fabulous restaurants, so I am somewhat tough to please. That said, the buffet has fun choices, breakfast IS great and the sandwiches, guacamole and pico de gallo at the Aqua Cafe are very good. The good aspects mentioned above makeup for the average food.", "title": "A great Playa Del Carmen choice!", "helpfulness": 29, "user": "MLF625", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6556442, "likes": {"liked": "— Location, rooms and room amenities", "disliked": "— Room assignment procedure, food"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I cannot say enough wonderful things about the people employed there. They are truly glad to be there, and it seems as if they enjoy what they do. They are always happy to engage you in conversation and the level of service is outstanding without being overbearing.", "title": "Perfect for us!", "helpfulness": 14, "user": "AlwaysTravelTemecula", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6542243, "likes": {"liked": "— Small and relatively quiet", "disliked": "— Would like the opportunity to purchase higher-end wines with dinner"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Spent a week from Aug 27th. We had a free $1500 resort credit so upgraded to a sea view, a photo session with 15 photo's on a CD, plus two upgrade bottles of wine. Also a beach romantic dinner, just as we sat down the skies opened up and ruined it. Not the hotels fault, but the the romantics got lost as they sat us in the buffet restaurant. Now bear in mind we had dressed the part but were seated in one half of the restaurant with folks in bathing suits. We had our own waiters so my comment would be WHY could they not have taken us to the empty part, separate from all the others it was empty??? with room enough to separate the four couples even, I would have requested a refund had I actually paid cash.", "title": "Pleasantly surprised", "helpfulness": 4, "user": "britex", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 118028568}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I am not a buffet person but pleasantly surprised at what was available, and the willingness to provide additional items.", "title": "Most amazing experience ever!", "helpfulness": 3, "user": "Jennifer S", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117886592}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Both the Italian & Asian were very good, no complaints accept dress code which is non existent. I enjoy dressing for dinner, I do not consider myself a snob but some people have no idea. Had we not just about finished our dinner in the Asian one evening there could have been a problem, either for the head waiter or ourselves, as we do not appreciate looking at the crack of someones rear end as we dine. I will attempt to post a shot of it.", "title": "Fantastic Resort", "helpfulness": 7, "user": "adestination", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117880054}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The greatest asset's of the resort is in it's people, I never came across one that I could be negative about, ALL were appreciated, thanks. The other asset, LOCATION, LOCATION, so easy to go out on the town.", "title": "Average at most", "helpfulness": 2, "user": "kimdc", "date": "September 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117806561}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "One other observation why is it so difficult to get a good Anjeo Tequila in a Mexican hotel. I appreciate not at the pool bar, but it would be nice to sip one after dinner.", "title": "Great Vacation!", "helpfulness": 6, "user": "skiorsun", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117589219}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I just returned on Feb 4 from celebrating our 5th anniversay at this resort. We have travelled to many places on the Mayan Coast and feel this one is one of the best places for service, and location. Don't let the drive up to the resort disuade you, it is not very impressive as it looks like you are entering through a delivery entrance, the hotel is great. The staff is very warm and eager to help you. The hotel is a sea of cream flowing partitions with a comfortable setting for drinks and conversations. You also have a choice of top shelf liquor, for example .. Crown Royal, Absolut Vodka, martinis, and champagne.", "title": "Sun, Fun and Chocolate Monkeys", "helpfulness": 13, "user": "Denstedt", "date": "February 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6780503, "likes": {"liked": "— Location", "disliked": "— Shower"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The resort is small and nicely laid out. The view by the pool is breathtaking.", "title": "Wonderful vacation", "helpfulness": 15, "user": "Poftheo", "date": "February 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6763032, "likes": {"liked": "— The friendly staff made the vacation much more enjoyable.", "disliked": "— Something should be done to make the pool area less slippery"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Entertainment: It was a good mix of activities but the best thing was that it started early! It starts at 8:00 pm. Most nights we went into town.", "title": "Great time at the Playacar Palace..", "helpfulness": 20, "user": "AlisonF143", "date": "February 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6731464, "likes": {"liked": "— It's location and service.", "disliked": "— Lack of restaurant choices, a little too quiet at times."}}, {"rating": 4.0, "title": "Beautiful View,great Location! (But no Moon Palace)", "text": "Pool: The pool is warm and about 3 - 31/2 ft deep. There are a couple of shallow sections that is great for kids. The swim up bar was never busy, and the staff was always ready to serve you.", "helpfulness": 25, "user": "Neuroelf", "date": "January 28, 2007", "id": 6710095}, {"rating": 1.0, "title": "Do NOT Have Your Wedding Here!!!!!!!!! A Brides Worst Nightmare!!!", "text": "The service around the pool was outstanding. We had taken our insulated mugs but soon left them in the room as the ladies were very attentive often serving the \"drink of the day\" on trays before you could ask!.", "helpfulness": 22, "user": "playaweddingsarasota", "date": "January 26, 2007", "id": 6699864}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "This is my first TripAdvisor review and one I could not wait to write it!!!!", "title": "Best All-Inclusive Experience....EVER!!!", "helpfulness": 5, "user": "LizOMontreal", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116944655}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My friend and I needed to take a much-needed girls vacation that included some spa. We originally booked our stay at the Adventura Spa Palace not realizing it was mainly for honeymooners or families with small children (Adventura Cove). We are NOT honeymooners – we are two single girls that wanted to meet people and socialize...on a beach. So after spending ~$600 of our resort credits with a wonderful first day at the spa followed by an afternoon by the pool, we decided to hop over by bus to Playacar Palace the following day for some beach fun.", "title": "Our favorite Palace property", "helpfulness": 6, "user": "LodiDazzles", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116624667}, {"rating": 5.0, "title": "Fabulous honeymoon! Can't wait to go back.", "text": "When we walked into the hotel, we were speechless. It was GORGEOUS! White marble floors... Flowing white curtains... Views of the white sand and turquoise water... Right out of a postcard. We decided right then and there that we wanted to switch hotels to be closer to the action. Playacar is steps away from the trendy nightlife and local shopping strip. It is also beach neighbours with Senor Frogs and right next to the pier that goes to Cozumel. Literally a 5 minute walk. So, expecting some sort of debate, we approached the front desk to ask if it would be possible to switch resorts. “No problem!” she says.....What?! In shock, we enjoyed our beautiful afternoon at the beach and switched resorts the following day, getting upgraded to an ocean view room with two beds and a balcony.", "helpfulness": 3, "user": "ginaandmike", "date": "August 7, 2011", "id": 116400542}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This was the beginning of our best vacation EVER.", "title": "Simply Amazing", "helpfulness": 10, "user": "Susan24Miami", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116361158}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The beauty of Playacar is that there are only 208 rooms, so the service is impeccable. The staff are so well-trained to please their guests that even when we broke some late night “rules” to go swimming in the ocean at 2am, the only reprimanding comment we got was, “Please don’t smoke in the towel hut” as we were borrowing towels to take to the beach (my friend has a cigarette in her hand at the time). Instead of kicking us out of the ocean, a security guard merely observed us from afar to make sure that nothing happened. We felt free. During the day, we didn’t feel pressured to participate in the pool activities.... but they did look fun. We became friendly with the staff and were really impressed at how ‘Super Eric’ and ‘Crazy Gabriel’ – as they like to be called – interacted with the guests. It wasn’t cheesy pool games. It was perfect. The music was also great – a fun mix of hip hop, oldies, and pop – and we went into town with them one night and had a blast. The waitresses were also passing by every 10-15 minutes or so to ask us if we wanted anything... You never had to leave your spot if you didn’t want to.", "title": "Heaven on Earth", "helpfulness": 5, "user": "JyotiMistry", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116208493}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at the Playacar Palace from Nov 29 to Dec 5 (after which we transfered to the Xpu Ha Palace for 5 days).", "title": "Enjoyable Stay (with wedding)", "helpfulness": 7, "user": "Indytech", "date": "December 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11520137}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Playacar Palace was selected by my step-daughter as the venue for her wedding, after which she transfered to the Aventura Palace for her", "title": "Wonderful service, great location", "helpfulness": 7, "user": "howboutit", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11467900, "likes": {"liked": "— Service", "disliked": "— I liked everything"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "honeymoon.", "title": "Our most relaxing vacation ever", "helpfulness": 16, "user": "traveling_poseidon", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11131382}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "It is the closest of the resorts in the Playacar zone of Playa del Carmen to downtown and a short stroll from the main shopping areas", "title": "Great Time Again!", "helpfulness": 2, "user": "preubin", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11106817, "likes": {"liked": "— location and beautiful acomodations", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "/Cozumel ferry.", "title": "Great hotel, great staff", "helpfulness": 7, "user": "mkerk", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 11103893, "likes": {"liked": "— The room and the staff", "disliked": "— Not alot of entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We visited Playacar Palace for a long weekend (three nights) for my husband's 50th birthday. We had not done the \"all-inclusive\" thing outside of cruises and had heard great reviews on Palace Resorts. All in all, we were extremely pleased with this resort.", "title": "A great getaway", "helpfulness": 14, "user": "tracy106", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11985392, "likes": {"liked": "— Lovely rooms and fabulous location", "disliked": "— Restaurants (for dinner) could be better."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The room was beautiful (we chuckled that people on this web site were actually complaining about the shower doors, because the bathrooms were beautiful). We had a fabulous view of the ocean and loved the jacuzzi overlooking the balcony. The bed was also luxurious and super-comfortable. Don't pay too much attention to the complaints about the entrance not looking like much...one you arrive and are inside, it's actually very lovely and unique with its open-air design.", "title": "Loved this hotel! Great wedding!", "helpfulness": 12, "user": "belle4681", "date": "December 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11950716, "likes": {"liked": "— Service, pool, food, great wedding", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The pool area was great, too, although we can understand the complaints about the lack of beach if you are committed to lying on the sand. The swim-up bar was pretty cool and there were lots of chairs and few crowds. We ventured over to Cozumel Palace in hopes of doing some snorkeling (definitely a bonus to be able to use the other resorts, and we would have done so more had our stay been longer). However, the day was windy and their beach was closed. Fortunately, since our stay was so short, we were content with the pool.", "title": "Love Playacar!!", "helpfulness": 10, "user": "Julesplus2", "date": "December 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11673764}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The food, overall, was OK. The buffet restaurant was more than substantial for breakfast and lunch, with a nice variety. However, we travel frequently and enjoy eating at restaurants with high-end food and wine. While the food in the Italian restaurant was pretty good, the wine list was a bit of a joke (my husband is in the wine business)...we were quite surprised to be in an Italian restaurant with virtually NO Italian wines on the wine list! The Mexican was pretty good, too...we didn't like the looks of the menu at the Asian place and opted for our third dinner on Fifth Avenue (which, by the way, is another HUGE benefit to this resort...the location is spectacular, with a five-minute walk to the Fifth Avenue pedestrian shopping zone).", "title": "Luxury & Relaxation!", "helpfulness": 9, "user": "WiAng", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11546092, "likes": {"liked": "— Great food & Comfortable Accomadations.", "disliked": "— Resort Inconsistency"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "A highlight of our stay was a visit to Xel Ha to swim with the dolphins. This was fabulous experience and I was so glad to have done it. The facility is beautiful with lots to do...we had no trouble spending most of a day there.", "title": "Loved Playacar Palace", "helpfulness": 3, "user": "LoveTheSun73", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11532401, "likes": {"liked": "— Spa, Service, Rooms, Food", "disliked": "— Everything was fantastic!!"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 34, "average": 110, "very good": 361, "terrible": 27, "excellent": 1236}, "aka": "Playacar Palace Hotel Playa Del Carmen", "slim_ranking": 0.0816326530612, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Playacar Palace, a trendy beachfront Resort located steps away from Playa del Carmen’s famous 5th Avenue and the Cozumel Ferry Dock. Our amazing Resort features 200 appointed rooms, 3 restaurants and 4 bars. This Resort is considered the perfect spot to relax during the day and enjoy the nightlife and charms of “Playa” at night. Playacar Palace it’s all inclusive, all incredible and all yours…"}