{"user_rating": 3.5, "review_count": 863, "name": "Plaza Pelicanos Grand Beach Resort", "reviews": [{"rating": 2.0, "title": "Loved the local food, the accomidations were fine, the food terrible!!", "text": "My husband and I just got back from PVO last night (October, 6, 2007). We had a great time traveling around the city, going on tours, enjoying the local food. Our room at the Pelicanos was decent, nothing special. I would recommend wearing slippers around the room, because the maids couldn't seem to get the floor clean, and our feet would be filthy. The pools were cleaned every day, but seemed kind of murky. We still had a great time swimming, and one of the staff, hopped in the pool, and organized the game of water volleyball. He talked us into doing some water aerobics afterwards. The aerobics instructor was very thankful, considering nobody else wanted to do it. If your allergic to bees, I would avoid the bar area, they were attracted to the sweet drinks. The food at the buffet was terrible, maybe a few good things here and there. The desserts were the worst of all. I don't think I would stay at this resort again, unless it was highly discounted. Unless you want some deals on excursions, don't do the Shell Vacations timeshare presentation. We did it, just to get some deals, and they were extremely rude, but we were firm with the no. For the Kontiki, the Canopy Tours de los Veranos, a City tour (which was terrible!!), and 2 days all inclusive for 4 people, we only shelled out a total of $50. So it was worth it. I hope this helped, and if you have any other questions about PVO you can email me at fiercevox@yahoo.com Happy traveling!!", "user": "Sgrubbies", "date": "October 7, 2007", "id": 10050710}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This Hotel is a joke! The front counter staff was rude and you had to yell to get anything that you requested. I inquired about a perc that we had paid for and I was told that Expedia had lied about that and it was only stated to get people to stay at this hotel. The rooms were distguisting mold,standing water, cochroaches, stained sheets, towels and a leaking roof. We had to be moved 3 times after I requested to be moved to a different resort. The ammenties that are advertised are false. The pool was merkey and there was slime on the walls of the pool. Don't pay for an upgrade in fact don't stay here! The activities were a joke my wife and I went to Casino night as it was advertisied, 4 teenage kids (Activity Crew)1 deck of cards and a stack of hoyle chips I had to show them how to play blackjack. I must say that we did meet some great people you know who you are! 2 things I highly recomend Blakes Sports Bar Mike was great with his local knowledge. His Chef Luis was great the Beer is cold the food awesome and the American Football even better. Thanks MIke!!!!!!! In closing Please do yourself a favor and DO NOT stay at this Resort pay a little more money to stay elsewhere it will be to your advantage!!!!!!!", "title": "Horrible Worst ever", "helpfulness": 3, "user": "KingcountyCOP", "date": "September 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8737953, "likes": {"liked": "— Alexander the Great ( Bartender)", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "All in all, The Plaza Pelicanos was OK. I give it 2.5 or maybe if I was drunk 3 stars. I didn't expect a 5 star hotel and I didn't get one. In other words, it didn't over promise and since I had low expectations (I read all of these online reviews before I left) I wasn't necessarily disappointed.", "title": "Let Me Be Honest Here", "helpfulness": 5, "user": "AussieBoyUSA", "date": "September 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 8615278}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel is situated on a beach far from \"GRAND\". (They should take that part out of their name) Lots of rocks and little sand upon which to lay or sit...in fact I never saw anyone actually go and sun on the beach.", "title": "Okay Hotel", "helpfulness": 1, "user": "NickyCanada", "date": "August 23, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8489956, "likes": {"liked": "— italian restaraunt, pools", "disliked": "— the front desk staff"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The grounds were well kept...seems like someone was always cleaning and working on it somewhere...but it was not anything spectacular...just your average run of the mill Mexican grounds...This is not Hawaii after all.", "title": "Nice place, Great customer DIS-service!!!", "helpfulness": 5, "user": "BeatDragon", "date": "August 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8465009, "likes": {"liked": "— The hair dryer", "disliked": "— Horrible Service. Bait and Switch tactics..."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "When we arrived we were told that the resort was overbooked so they put us next door at the Canto Del Sol, a nicer property but we had friends staying at the Pelicanos so a hassle going back and forth. Caruso's restaurant is the only really good dinner we had. Tuna at the Sushi restaurant was Chicken of the Sea - no kidding. The resort itself was okay, but it's on an ugly stretch of beach. Brown sand beach with lots of rocks and murky water. Guy at the front desk told me that PVR took a direct hit by one of the hurricanes a year (or 2?) ago and will take time to rebuild. Then it will be a BIG brown beach with rocks and murky water. Take the bus into town, $1 per person, just tell the driver where you want to get off. Staff was very friendly. Workout room had very little equipment and most had seen better days. We went there because we were invited by friends, next time I'm taking them to Bavaro Beach in Punta Cana, DR. They'll think they've died and gone to (beach) heaven.", "title": "Decent Resort, Ugly Beach", "user": "Krellijo", "date": "March 13, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "value": 2.0, "location": 3.0, "service": 4.0}, "id": 14260669, "likes": {"liked": "— hmmmmm", "disliked": "— the beach"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This is a beautiful hotel with beautiful grounds. Our room was very nice- after they changed us out of a room with only twin beds. However, we had a horrible experience. We stayed there earlier this week, and our trip was almost wrecked by 18 year old spring breakers who \"crashed\" our hotel. I would have never expected this to happen at this fine hotel, paying $180US/per night. The hotel didn’t do anything to manage the noise that this group of 200 plus student brought. There was banging on doors and yelling in the halls until 4 am. I felt horrible for the older guests at the hotel who had to deal with this. Topless girls at the pool doing flips and beer bongs. I am not old, but too old for this sort of atmosphere during what was suppose to be a relaxing last couple days of vacation.", "title": "Wanted to change hotels.....", "helpfulness": 2, "user": "thompjac", "date": "March 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 14242463, "likes": {"liked": "— Beautiful Pool and View. Nice room.", "disliked": "— LOUD rude, misadvertising, didnt care about our experience there."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Also, don’t let the advertisements for this hotel fool you. We stayed 2 nights, and were not able to make a reservation for ANY of the restaurants on the premises. There was no room for us. The hotel only allows you to make reservations between 9am and 3 pm. You have to wait until 3 to check in, so we couldnt our first night. So first thing the next morning (actually at 8:30 am), we tried to make a reservation for the 2nd night... no luck. We had to eat at the buffet- which was fine, but not what we were lead to believe we were paying for.", "title": "Get what you pay for!", "helpfulness": 2, "user": "ajmweddinggirl", "date": "March 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 14230652, "likes": {"liked": "— The sun", "disliked": "— The beds"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "I will not return to this hotel, and it was pretty much a huge disappointment. If it wouldn’t have taken too much of our precious vacation time our last two days, we would have changed back to the hotel we were staying at the first few days of our trip in the Marina area.", "title": "What a nightmare!", "helpfulness": 1, "user": "Lissy4033", "date": "March 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 14149210, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "This hotel just really gave me a bad opinion of all inclusive all together.", "title": "Already going back...", "helpfulness": 4, "user": "ILOVEPUERTOVALLARTA", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 14145540, "likes": {"liked": "— Everything!", "disliked": "— dinners at hotel restaraunts were hard to get signed up for"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Just read a review saying the Pelicanos is now a spring break mecca. If you read the Pelicanos ad, they specifically say there are no spring-breakers or people under 21 booking rooms. THAT IS NOT TRUE! Recently stayed there and it was a nightmare! Not bad enough that we had a bad room...but the adjoining room door was held by a NAIL and we could see the people in the next room! Who I might add, were spring-breakers! They partied, banged doors and told us to [--] off when we asked them to quiet down. We couldn't sit by the pool in the evening and security did nothing to stop the partying.", "title": "Big Disappointment", "helpfulness": 1, "user": "Disappointed030", "date": "March 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 14130767, "likes": {"liked": "— The friendly servers and cleaning staff", "disliked": "— Bad room, no beach swimming, smokers and spring-breakers"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The hotel itself is spotless and the staff is friendly. What a shame they choose let a bunch of \" once a year kids \"ruin their name. I for one will NEVER stay there again. Nor would I consider time-share. There are so many other beautiful hotels in Puerta Vallarta, with accessible beaches and rooms with a view...why would someone want to gamble on whether or not they might be wasting hard earned money and vacation time? Keep looking...there are better hotels.", "title": "Cute Resort and Spring Break Mecca", "helpfulness": 2, "user": "jomia32", "date": "March 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 14087645, "likes": {"liked": "— The canopy beds", "disliked": "— The food"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "First time going to PVR, and witha group of single girls ages 27-34.", "title": "Smoker and Springbreaker's Paradise", "helpfulness": 2, "user": "missbmom", "date": "March 5, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 14078565, "likes": {"liked": "— Friendly employees and really clean.", "disliked": "— Smoking everywhere, including restaurants. Springbreakers taking over the place."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The resort was very nice, we stayed on the club side, but was able to hang out at any of the pools, which are on the smallish side, but very clean and each had their own swim up bar. the drinks are very watered down and bottom-shelf liquors are poured, whcih can often lead to that already-haungover headache.", "title": "Great Value -- Great Staff", "helpfulness": 2, "user": "vincohio", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14054566, "likes": {"liked": "— clean resort and great staff", "disliked": "— beach area"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The rooms are clean, facing the ocean as well as the pool. The beds are horrible. Back pain for the whole trip but nothing some 800mg of Advil couldn't relieve for the day.", "title": "\"Grand\" Plaza Pelicanos!", "helpfulness": 1, "user": "JodieVancouverB_C_", "date": "March 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14024286, "likes": {"liked": "— location, location, location", "disliked": "— the foam on the water in front of the hotel...."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Let me preface this review by saying that my group was 10 college age students looking to have a good time! and that we did. we arrived on a friday and were staying in the cheapest part of the hotel which was perfectly fine because we were never in our rooms. the beds were a little hard but otherwise the rooms were great. in the morning we would frequent the buffet closest to our room which had an awesome breakfast! The waiters were so nice and very attentive and polite. we usually laid out by the middle pool which is where most of the younger crowd was. they have games and stuff here which are sometimes annoying but sometimes fun. the bartenders at this bar were amazing! they never complained about the amount of tequila shots we were ordering starting around 11 a.m. and always added extra liquor to our drinks upon request.", "title": "craziest Adventure of our lives!", "helpfulness": 1, "user": "kgerlloff", "date": "March 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7252398, "likes": {"liked": "— Staff", "disliked": "— Beach"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "the beach in our area was kind of sketch and no very pretty, but the water feels good. we mostly stayed by the pool.", "title": "Nice hotel", "helpfulness": 1, "user": "ann12172", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7238192, "likes": {"liked": "— The view, clean hotel room, nice people", "disliked": "— Not a lot of entertainment at the hotel, streets around the hotel stunk"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "there are beds that anyone can lay on that we usually would nap on in the late afternoon. they were awesome and the sunset was amazing!", "title": "Fantastic Resort", "helpfulness": 3, "user": "wpg2007", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7196038, "likes": {"liked": "— Friendly employees, location", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "one of the best parts of the hotel was the special outdoor buffets and entertainment they had 3 nights while we were there. it was alittle chilly but it was so nice to be outside and the food on these nights was especially good.", "title": "Was as Expected, No Surprises !", "helpfulness": 2, "user": "kevbr", "date": "March 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7191062, "likes": {"liked": "— Staff", "disliked": "— Choice of Food"}}, {"rating": 2.0, "title": "You Dont get what you pay for!!!", "text": "the club scene was kind of annoying and trashy but thats where everyone goes. you have to pay covers and for drinks but usually students can find some sort of deal with studentcity or something to get into clubs.", "helpfulness": 2, "user": "oglea", "date": "March 17, 2007", "id": 7179634}, {"rating": 4.0, "title": "From the pickiest person ever - go here!", "text": "I am officially the world's pickiest person (read my other reviews!) and I was really surprised by how much I liked Plaza Pelicanos, especially after being completely frightened by the reviews I read. As a disclaimer, I will say that we went there as part of a timeshare and not just as a regular hotel guest, so there may have been some differences, but overall, I don't know what people are complaining about.", "user": "NicoleandKyle", "date": "January 3, 2008", "id": 12305010}, {"rating": 2.0, "title": "poor staff service", "text": "POOLS - beautiful! The one in Section 2 is nice because even though it is in the shade, it is heated. It also has an infinity pool as part of it and it is a fantastic place to relax. Swim up bar and snack bar with plenty of chairs for sunning or tables/chairs for a quick bite. My favorite pool was the middle pool - they play popular music all day and the activity staff does a great (but unobtrusive) job of offering activities like water aerobics, bingo, and volleyball. Snack bar and swim up bar at this pool too - it's pretty cold, even though in the sun! Adult pool tucked behind the tennis court - you can always get a chair here and it's very quiet. Ice cold pool, but after a hot hour in the sun, it feels great. We didn't go to the pool near Section 1 as it seemed to have a lot of kids. The pools were incredibly clean - I don't know how people thought they were dirty. I saw them being vacuumed every morning. Also, the beach towels they give you are amazing!! Fluffy and huge!!!!", "user": "lizzycLa", "date": "January 2, 2008", "id": 12279803}, {"rating": 5.0, "title": "Great Vacation", "text": "BEACH - not good, but that's pretty much the entire beach in Puerto Vallarta. If you want a nice beach, go to Cancun. The sound and view of the waves crashing over the rocks was so picturesque.", "user": "E.D.", "date": "December 25, 2007", "id": 11947576}, {"rating": 1.0, "title": "Not a 4 stars hotel, More like 3 stars", "text": "ROOMS - In truth, the rooms did smell a bit musty or moldy. However, if you left a window cracked or opened the doorway for five minutes, it was completely fine. It's just from the combination of hot air outside and the constant air conditioning running. Same as you would find in pretty much any other resort. The beds and linens were comfortable, but not luxury. The same went for the bath towels and bath amenities. Our room had a full kitchen which was great for storing alcohol or leftovers and we also had two balconies with chairs to lay out on. We loved looking at the ocean having a glass of wine outside on our balcony each evening.", "user": "Pierremanseau", "date": "December 20, 2007", "id": 11710261}, {"rating": 2.0, "title": "pelicanos pvr...", "text": "HOUSEKEEPING - Our housekeeping was fantastic. We tipped the housekeeper on our first day and every couple of days after that and EVERY DAY - he created a towel sculpture in our room - swans, hearts, snails - liberally laced with fresh flowers and flower petals. He also left a single rose in a water bottle one day. We were supplied with plenty of fresh towels every day and the bathrooms and floors were adequately cleaned. We had NO trouble with anything being taken. He replaced our water bottles every day with two fresh ones.", "user": "linksus5", "date": "December 8, 2007", "id": 11324552}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I myself, try to hold back a lot of my nit picking as I have worked in the hospitality industry my whole life. So I know when things are being over looked, staff are being lazy, or the hotel is cutting costs.", "title": "Pretty dissapointed by the end of the trip", "helpfulness": 4, "user": "numba1goalie", "date": "November 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 10692773, "likes": {"liked": "— Comfortable room, great views, security, decent concierge staff.", "disliked": "— The restaurants were all bad, lack of english speaking staff, construction."}}, {"rating": 3.0, "title": "This place is very nice", "text": "I visited Plaza Pellicanos for my honeymoon from August 27-September 5, 2007.", "helpfulness": 2, "user": "myrtlejo", "date": "November 3, 2007", "id": 10572280}, {"rating": 4.0, "title": "First time visit", "text": "This was the first time outside a Cruise that I had been to Mexico so I wasn't to sure of what to expect.", "helpfulness": 2, "user": "Niagaranomad", "date": "November 1, 2007", "id": 10494987}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I was delighted when we arrived with a very fast and prompt check-in. The front desk staff spoke pretty good English, and explained a lot about the property while he was checking us in.", "title": "Great \"Little\" Place", "helpfulness": 8, "user": "SunPrincess1", "date": "October 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10486594, "likes": {"liked": "— Location was perfect for us.", "disliked": "— Dinner buffet could have been better, but that's most A/I's"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "After check-in, we were greeted by the Chief Concierge of the hotel, who explained more about the hotel and the location, and wanted to find out what we were interested in doing. Take a guess right!?!", "title": "Unbiased, travelled 30 ish couple", "helpfulness": 8, "user": "fremme", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10453890, "likes": {"liked": "— Rooms where clean with a great service", "disliked": "— A tad busy over the weekend so it's great to head out and explore outside the resort"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "My stay here was for 5 days . Our travel agent told us that it was not a spring break resort ,boy was she wrong. We were put in section 1,which was fine but the next day buses of college kids arrived. When I say buses I mean buses. They were everywhere, screaming and hollering. The hotel has 4 pools but the main pool in section 1 was full. The pool bars all close at 5. The lobby bar in section 1 was the only bar open every night . The hotel ran out of beer everyday, which really sucked. Breakfast was always good,the buffets were always the same old thing everynight. Snack bars had good nachos and burgers. The grounds were very pretty and well kept. The rooms were always clean. If your looking for a beach to lay on this isn't the place for you.", "title": "beautiful grounds", "helpfulness": 3, "user": "IowaBojigirl", "date": "March 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 7162817, "likes": {"liked": "— the pools", "disliked": "— the spring breakers"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "If you want to go on a tour I highly recommend the kon tiki tour, it is a day cruise.( booze cruise) . It lasts about 7 hours and it was awesome. We saw whales,dolphins and manta rays. We also went snorkling which was awesome. I have been to puerto vallarta twice now, but I would not stay here again.", "title": "Nice for the money", "helpfulness": 1, "user": "Macktay", "date": "March 13, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7154865, "likes": {"liked": "— Location", "disliked": "— Rooms In Section 1"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I and another couple stayed here from Feb.23-Mar.2. We were told we would have ocean view and did not, our friends room smelled horrible. Had to pay an extra $100.00/u.s per couple to get a better room and ocean view worth every penny though. Stay in section 2, much nicer and quieter. Section 1 seems to have a lot of young adults staying there and much more noisy. Food is okay, nothing", "title": "Awesome vacation...loved it!", "helpfulness": 7, "user": "ZandersMommy", "date": "March 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7148328}, {"rating": 4.0, "title": "Great vacation", "text": "to brag about, you only get 2 bottles of water in your room so you have to take them and get them filled at the bar since the water in the rooms is not filtered. Beach area is rocky and we were told not to swim in the ocean because it is not a nice part of the ocean (things being dumped into it in this area). Grounds of the hotel are very nice and close to downtown.", "helpfulness": 7, "user": "fireboy771", "date": "March 12, 2007", "id": 7122251}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I visited this resort Feb 17-24, 2007. We were new to Mexico and new to the all-inclusive experience. All in all, we enjoyed ourselves immensely at the Pelicanos. We are pretty easy going and we absolutely loved the resort. Your experience with the resort will be what you make of it. We realized that we were staying at a 3.5 Star and that is precisely what we got.", "title": "An easy vacation", "helpfulness": 4, "user": "Maui_monkey", "date": "March 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7009967, "likes": {"liked": "— Drinks", "disliked": "— Restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "After reading many reviews before and after my vacation I feel I owe it to the staff of the Plaza and the people about to stay there. To be honest I was scared stiff about my reservations after reading all the negative comments.", "title": "A bunch of babys", "helpfulness": 3, "user": "okleyguy", "date": "March 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6940776}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "First off let me tell you I am a bit of a clean freak by nature and a princess when I travel. The posters on this site are a bunch of wieners.", "title": "Somewhat Pleasant", "helpfulness": 5, "user": "jenlee", "date": "March 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6927674, "likes": {"liked": "— clean", "disliked": "— front desk staff was not that friendly"}}, {"rating": 2.0, "title": "3 stars...", "text": "This resort is awesome the staff very helpful the rooms where spotless (NO BUGS) and the grounds where meticulously kept... The Pools always had lots going on and had no problem ever getting a lounge chair. What I did notice though that there where some, and not very many, rude people that thought the staff should wait on them hand and foot. These are the people that post bad things about this resort.", "helpfulness": 2, "user": "blessthismess", "date": "March 3, 2007", "id": 6907969}, {"rating": 4.0, "title": "great resort", "text": "We ate in the park most nights and it rocked I will say the line ups are a bit long for the food but what do you expect when you try to feed 600 people all at once. The food was great not Canadian but still good for Mexico. The drinks where always cold and flowed plentiful. And the nights shows where a nice treat.", "helpfulness": 2, "user": "rocknut", "date": "February 28, 2007", "id": 6892174}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I met so many great people at this resort and would not hesitate going back. If you are looking for a safe place to holiday that has allot of Sq footage to roam then do not hesitate to book this place. And to all the people that bitch because they did not get into section 2 go stay somewhere else. For the record I stayed in section 1 and found it fine.", "title": "A Great Experience for a First Time All-Inclusive!", "helpfulness": 6, "user": "kneuroknut", "date": "February 28, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 6891457}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "After reading the last two reviews I've come to the conclusion that the Pelicanos I just stayed at (came home yesterday) was a different place than the one they stayed at.", "title": "I'm Confused!!!", "helpfulness": 3, "user": "wire1", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13990135, "likes": {"liked": "— Very handy", "disliked": "— Wished I had a room with a pool view (Section 1)"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and I found the staff there to be pleasant and I'm suprised that they found the food horrible.....it wasn't 5-star restaurant food but we found it to be very good. The soup they served was always excellent and I had it 5 different times.", "title": "Fun in the Sun", "helpfulness": 2, "user": "kiss78", "date": "March 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 13960061, "likes": {"liked": "— close to downtown", "disliked": "— musty smelling rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The only shortfall I found with the bar service was that they didn't have Clamato juice...so I couldn't have my beer and Clamato drink. Until I found the store on the corner had Clamato and bought some.", "title": "WORST hotel EVER", "helpfulness": 1, "user": "kerrawack", "date": "February 28, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 13917631, "likes": {"liked": "— They had really nice beds on the beach", "disliked": "— Everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our room was very clean and the bathroom was anything but tiny...it was much larger than any bathroom I have in my house....", "title": "Book a nicer place!", "helpfulness": 1, "user": "bchibberd", "date": "February 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 13912403, "likes": {"liked": "— Centrally located", "disliked": "— Everything"}}, {"rating": 4.0, "title": "Plaza Pelicanos - Very nice vacation", "text": "We've stayed at other resorts in Puerto Vallarta and we both agreed that the Pelicanos was the best value for the money.", "helpfulness": 2, "user": "jkwVacation", "date": "February 27, 2008", "id": 13882696}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "I don't know if it was the time of year (April) but there were way too many locals during our stay. Daily activities were dominated by non-english speaking people. We barely took part in any pool activities or socialized with any others at the resort at night.", "title": "Just Ok", "helpfulness": 5, "user": "Doug_19", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11291375, "likes": {"liked": "— Pools", "disliked": "— Lobby Bar and amount of locals"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2006, traveled with family", "text": "We stayed in Section 2. Were able to use all the facilities shared with section 1, only difference was no balcony or ocean view with our room. We also didn’t get access to premium liquors at the bar.", "title": "decent hotel", "helpfulness": 3, "user": "mikcro", "date": "December 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 11254489}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Room was clean and maid service was great. No alarm clock or remote though. Ask at the front desk and they have remotes for the TV. Free pay safe included.", "title": "Plaza Pelicanos Section 2", "helpfulness": 7, "user": "VGardengal", "date": "November 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 11148006, "likes": {"liked": "— The friendliness of staff", "disliked": "— The musty/damp conditions despite the air conditioner."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Pools were nice and well maintained. 3 pool bars. Pool activities were a little disorganized and dominated by locals. No problems finding chairs by the pool. The beach infront of the main pool was nice and sandy free of rocks.", "title": "Puerto Vallarta, never again!", "helpfulness": 4, "user": "animal3350", "date": "November 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 11124675, "likes": {"liked": "— location", "disliked": "— mold"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Lobby bar only exists in Section 2 and it is very disappointing. Not a great place to sit for happy hour or in the evening. It was very uninviting to guests and often empty. Table and chairs were of poor quality. The beach bar in section 1 was also open late. This was a nice quiet place in the evening that sometimes had a one man guitar player. The bartenders and waiters were wonderful.", "title": "Don't Stay Here!", "helpfulness": 6, "user": "MysticalGypsy", "date": "November 8, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "business": 2.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10694249}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We had booked the Pelicanos pretty much at the last minute to go during my school break (I teach), so there wasn't much choice. And I was leery after reading some of the reviews on this site. We just got back and had a great time.", "title": "Good holiday", "helpfulness": 2, "user": "readytoretirecalgary", "date": "February 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13808981, "likes": {"liked": "— location, clean, friendly staff, simple"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The place is spotlessly clean, the beds are comfortable, you've got your choice of 4 pools plus the beach and the drinks were great. We found the staff friendly and helpful (hats off especially to the concierge) and loved the location - you can get downtown for a $4 cab ride or a $.50 bus ride because it's close to the downtown. The food is not terrific, but certainly adequate. We tended to eat breakfast there and then either go downtown for other meals and snacks or to the street vendors for \"real\" Mexican food - I figured that since the Pelicanos was not an expensive place, we could afford to eat out other places - and those meals were great and cheap too.", "title": "grand section not worth extra money", "helpfulness": 3, "user": "sizzleCalagryCanada", "date": "February 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13759337, "likes": {"liked": "— the location to town", "disliked": "— over priced and the fact they triedto put us in a lower class room"}}, {"rating": 4.0, "title": "great people,great service", "text": "We had wanted a relaxing holiday and this place suited us well.", "helpfulness": 4, "user": "oscar04", "date": "February 19, 2008", "id": 13687397}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "First off I want to start by saying i am a travel agent...and i booked this trip at a regular rate as any other person would no special treatment...The grounds are great...spacious and well kept..Beach area is smaller than other hotels due to the hurricane a few years back the hotel has tried to work with mother nature in that they made a small manmade beach on the grrounds above ocean the view is great... Front Desk..The manager was verging on rude unhelpfull and unaccomadateing..we changed rooms 3 times as the first room was not what Aircanada Vacations said it would be...the last room the air conditioner flooded water from it dureing the night I must say this could happen anywhere the maintanence man fixed it asap..Food...Average..Room service for grand section is only till 6pm from the menu in room or you have to pay so in a sense it is not 24hr all inclusive...POOL in Grand Section is very quiet music to put you to sleep by my girlfriend was worried till i told her about the other section accross the bridge.Main POOL;;is the activity pool it also has a swim up bar as well as music played all day and has speratic poolside waiter service..you still need to ask for premium liquor there or they will pour you the cheap stuff.. If a free light bathrobe and slippers is worth the difference in price by all means go to grand section we will be going back but not to the grand section will stay in club section...The GOLDEN CROWN PARADISE ADULTS ONLY is 100 times better and nicer beach trust me i go to vallarta minimum 3 times a year as well as other places in the world and usedto live in vallarta need advice ask me", "title": "Exceeded my Expectations", "helpfulness": 8, "user": "travelin_TNM", "date": "February 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13542301, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We really enjoyed our stay at the pelicanos resort.The staff were all friendly and efficient.As were the accomadations.The resturaunt food was very good and the drinks were plenty.There are three sections,ours being on what is called the common!It suited our needs as the pool was right outside our door and it was the only pool of three that was consistently around 85-90 degrees.Of course the pool bar was never empty.The nightly entertainment was also a good time.We can't wait to return!", "title": "Loved Pelicanos & Puerto Vallarta", "helpfulness": 8, "user": "bridgetn", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13506626}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We have returned from PV this week and had a great week in the sun. We felt satisfied with the hotel for the price we had paid. Coming in with low expectations, we were very happy with the overall package. The staff was very friendly and helpful and worked their buns off all day. Please tip these folks as they are not very well paid by the hotel. The guests at the hotel were mostly Canadians, upper mid west and a few Mexican tourists. It seems you could strike up a conversation with just about any person. We had tried to get in to the section II on our arrival but we were told they had no rooms available, try again tomorrow. They put us on a request list. We did try for the first 2 days to get moved but it just seemed to add stress to our stay so we decided to stay where we were in section I. This part of the hotel is off by itself and has it's own restaurant, bars and pool. A walk of about 150 yds out through the lobby and across the street would bring you to the timeshare section pool area that had a snack bar and swim up bar. Another 150 yds would take you to the section II pool area. In between these two pool areas was a large grass/ garden where they held their stage shows and Mexican fiesta. We never did get a good look at the section II rooms but did peek into a couple when the maids were cleaning. The rooms looked to be about the same size as sec. I but maybe a little newer. We were told by some timeshare owners that the tower was recently built and the first floor rooms were all redone after hurricane Kenna in 2002. They also told us that sec.II used to be called Plaza Las Glorias but then combined with the Pelicanos. Sec.II had a larger pool area and a smaller buffet restaurant which was always a wait to be seated. The restaurant at sec.I you could pretty much chose your own table. We never did any of the a la carte restaurants as we went to old town every evening for dinner, so no help on those. Both sections seemed to be low key around the pools and in the rooms. The only activity was around the timeshare pool area. Overall the hotel was fine but did have a few gripes. First, the lack of pool chairs at all pool areas. We could not get a chair unless we played the game of getting up early and staking your claim with your towels (RUDE). Some people would claim chairs and not show up until mid day or as we noticed, not show at all. Management should put an end to this practice. Second was the walk from the pool back to our room in sec.I. It was quite a hike and you had to walk right through the main lobby. We felt a little awkward walking through in our dripping bathing suits. Third was the air conditioner was too loud to use. It was really unbearable and we decided it wasn't worth using . We slept with the window open which wasn't too bad until the occasional late night partier came back from the bars at 2 or 3 A.M. or the mosquito that would find it's way in to annoy you. Last gripe, the location. You have to taxi everywhere as there is not much for restaurants or bars on this strip of hotels. We did walk to the marina one day but it wasn't easy as the road was under construction. All in all not a bad place, but we are sure we would stay elsewhere (probably oldtown) on our next trip.", "title": "Friendly people", "helpfulness": 5, "user": "dimlite", "date": "February 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6850806, "likes": {"liked": "— The guests", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My girlfriend and I stayed at the plaza the 9th thru the 16th of feb '07..This place is perfect and anyone who says different has issues..The hotel is VERY clean and the staff was so nice and helpful..The pools and grounds look just like they do in the hotel pictures, they are wonderfull..Its only a 4 dollar cab ride to downtown, but still far enough way so its not noisy at night.It is only listed as a 2 1/2 star but it should be much higher.If there a negitive I would have to say the food at the buffets were mostly the same every day, but it was still good.The swim up bars are great and so are the snack bars..If your looking for a fun and relaxing place this is it!!! Its a great place and we are already looking foward to returning next year, I can't wait!!!!", "title": "Perfect!!", "helpfulness": 5, "user": "Frozenfoot", "date": "February 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6813230, "likes": {"liked": "— The pools and the bars", "disliked": "— The buffets"}}, {"rating": 4.0, "title": "An Honest Review", "text": "When we got there, everything seemed to be fine, our room, which was in the \"old\" section (there are 2), smelled a little closed in, but opening the window and blasting the AC took care of that.", "helpfulness": 8, "user": "Becka_in_BL", "date": "February 19, 2007", "id": 6812698}, {"rating": 4.0, "title": "3rd time at the Pelicanos!", "text": "When I went to unpack my bathroom necessities, I noticed a few itty bitty little ants crawling around in the sink. I figured this is Mexico! There are bugs everywhere, and left it at that.", "helpfulness": 2, "user": "Cymru2", "date": "February 17, 2007", "id": 6805866}, {"rating": 4.0, "title": "loved plaza pelicanos", "text": "We went down to eat, the buffet was pretty good for an all inclusive. I've read some reviews about other all inclusive resort buffets and honestly was glad that this place seemed to be better than the competition in that department so that was good.", "helpfulness": 6, "user": "malibu21Calgary", "date": "February 17, 2007", "id": 6805194}], "location": {"country": "Mexico", "city": "Puerto Vallarta"}, "stars": 3.5, "variance": {"poor": 111, "average": 130, "very good": 323, "terrible": 72, "excellent": 227}, "aka": "Plaza Pelicanos", "slim_ranking": 0.258620689655, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "The Plaza Pelicanos Grand Beach Resort situated on beautiful Las Glorias, surrounded by colorful tropical vegetation. facing the Pacific in Puerto Vallarta, close to shops, Teatro Vallarta, Malecon, Caballito, restaurants, and attractions, only 15 minutes from the Puerto Vallarta International Airport (PVR) and 7 minutes from downtown. The layout offers private and quiet areas, as well as active areas for recreation.The hotel offers amenities like outdoor pool, a childrens pool, two aerial Jacuzzis with bay view, a health club, and a childrens club, concierge desk, Spa, Bali beds, wireless Internet access (surcharge) is available in public areas, wedding services and complimentary guest parking is limited, Sky lounge Bar, tennis court, karaoke room, game room, a buffet restaurant and two a la carte restaurant for dinner"}