{"user_rating": 4.0, "review_count": 578, "name": "Plaza Lucchesi Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "I stayed at the Plaza Lucchesi Hotel at the end of June and thought that it was very charming. The rooms aren't huge, but they are large enough. They each have a plasma tv (a nice modern touch). The location is wonderful. You're basically within walking distance to all the main attractions of Florence; the Uffizi, the Ponte Vecchio, etc. We stayed in a suite that had breathtaking views of the Tuscany hills as well as the Duomo. Breakfast is sufficent, a mix of American and European. I think that this hotel is good, but I'm well aware of other hotels that are in the area that seem to be slightly more luxurious. If you're looking for a nice and convenient hotel, this is the one, but if you want a extremely luxurious hotel in Florence, you may want to stay at a different place.", "title": "Nice Stay", "helpfulness": 10, "user": "MeetmeinSanJuan", "date": "July 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3653838}, {"rating": 5.0, "title": "We wouldn't stay anywhere else!", "text": "We have been guests at the Lucchesi for four years now on a regular basis, and have just returned from our latest visit. I just had to write a review as it has been consistently wonderful. We would not dream of staying anywhere else. The hotel is elegant, clean and comfortable, the views are wonderful. But the best thing about the hotel is the staff. They are so genuinely nice, ever-helpful and nothing is too much trouble. We have been directed to the most superb restaurants, they have made all sorts of arrangements for us and we love 'em. Everything you would want to see on a trip to Florence, the Ponte Vecchio, the Uffizzi, Piazza Signoria, Duomo, shopping etc are within a few minutes walk, and the hotel has lovely views of the River Arno on one side and Santa Croce on the other. The Lucchesi really is our home from home in Florence, and we have already booked to return in September.", "helpfulness": 11, "user": "Rocketronnie", "date": "June 15, 2005", "id": 3555327}, {"rating": 2.0, "title": "We have no bananas!", "text": "We stayed at the Hotel Plaza Lucchesi from 28/05/2005 to 02/06/2005. (UK date)", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 3, 2005", "id": 3524032}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "The room was of a good standard, and the public lounge is actually nicer than the picture on the website. The bedroom was comparable to a 4 star Hilton room, slightly larger, and was at the front of the hotel. We didn’t find it noisy, we slept well and the bed was one of the most comfortable ones we have had at any hotel. The wildlife on the Arno river bank was amazing, beavers swifts, turtles and egrets.", "title": "Good, but I think there were better", "helpfulness": 12, "user": "The-Georgia-Longs", "date": "April 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3376861}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "The hotel staff were helpful with one exception, the Maitre d' who was surly, ignorant and unhelpful. We ate at the restaurant on our first evening. I would not recommend the hotel restaurant for an evening meal, overpriced, processed food with your order taken by a man who doesn't listen.", "title": "Expected More", "helpfulness": 15, "user": "TNgal", "date": "April 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3376177}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We just got back and the hotel was great.They gave us a room on the 4th floor over looking the Arno and the countryside.Shower was a bit small,but thats our only complaint.", "title": "Great Hotel", "helpfulness": 6, "user": "Termc9074", "date": "March 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4729365}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "Stayed 6 nights and this Hotel is pleasant. Good alround 4 star (trying hard to be 5 star) Hotel in a perfect setting. Away from the crowd but close to the sights. Reception staff are exceptional, the concierge booked all our museam tickets, well worth the time saved queing, a very courteous service.", "title": "Upgraded to Heaven", "helpfulness": 14, "user": "Firenze22Florence", "date": "March 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4691954}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We had a problem on the first night. Our North American (probably jet lagged) friends in the adjacent room live on a different time pattern than us Europeans. For that reason, when everyone else is trying to sleep (in anticipation of the early start on the museum trail next day) they come awake! Fantastic for them but not so good for us. Next morning we asked the reception staff to move us to a quieter part of the hotel, this was not problem and embarrisingly for us (but not for long) they upgraded us to a suite. Talk about room with a view. We explained that this was not a complaint and our neighbours had not actually done anything wrong it was just a mismatch of sleeping pattern. No problem they said have room 416! wow 'Room with a View'. Our balcony looked straight across to the Duomo, directly behind Santa Croce. Very nice thank you. However that night in come the neighbours, on goes the TV (CNN of course) up go the voices. Think the wall mounted flat screen TV's actually add to the problem as the sound vibrated straight through the wall just above the headboard. This is not a complaint, just a comment, we did actually get used to it after a couple of nights and we loved this hotel. However make sure you do not stay in a room with a communicating door unless you want to! You can hear evey word from next door, clearly. Let's face it girl's unless they have George Clooney or Brad Pitt in the room who want's to listen to the someone elses 'When Harry Met Sally' performance at 3am? when you have an appointment at the Uffizi in 5 hours and your feet are killing you?", "title": "Very good deal!", "helpfulness": 12, "user": "munimaya", "date": "February 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4414138}, {"rating": 2.0, "title": "Credit Card Caution!!", "text": "Ignore the Maitre'd in the restaurant, he is a billigerent little man. The rest of the staff make up for his lack of common courtesy. I don't think I heard him speak once. He just grunts! There is no explanation as to the etiquette at breakfast (every hotel has a different protocol) and when we asked he made us feel stupid and embarrassed. We felt 'in the way' every morning. After one dinner in the restaurant we vowed to eat out, uncomfortable is the word! He even changed the flowers on our table from the dinner to the breakfast arrangement whilst we were eating! We tipped the pretty blond waitress extra as we felt sorry for her, she tried really hard and if anything was over courteous. I can't imagine why they employ him (unless he is the owners son?) He is the rudest hotel employee we have ever met!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 17, 2005", "id": 4247433}, {"rating": 4.0, "title": "A room with a View", "text": "Tip: ask for a room at the back at the top of the hotel. Front rooms overlook the Arno which is great but the back rooms are quieter and you never know you might just get 'A Room with a View' unbelievable.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4138376}, {"rating": 5.0, "title": "Superb hotel", "text": "We have just come back from a 7 day stay in the Plaza Hotel Lucchesi and can't wait to go back. Our room (103) was a duplex overlooking the Arno, and although it was a little noisy at night, the views were wonderful.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 26, 2006", "id": 5224494}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The Lucchesi staff could not have been more helpful and the hotel is within easy walking distance of everywhere we wanted to go.", "title": "Lovely hotel", "helpfulness": 13, "user": "Miramar", "date": "May 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5182733}, {"rating": 5.0, "title": "Great hotel", "text": "Breakfast was more then satisfactory and the veal in the restaurqant was excellent. We highly reccomend the hotel and fully intend to return.", "helpfulness": 13, "user": "calabriavince", "date": "April 12, 2006", "id": 4967695}, {"rating": 5.0, "title": "Fantastic place to stay", "text": "We stayed at this hotel as part of a Tauck escorted tour. This hotel has a central location a few blocks from the Santa Croce church. On a map it can appear to be not so central, but Florence is quite compact and walkable, so in actuality it is quite close to most of the sights.", "helpfulness": 7, "user": "ath17", "date": "March 27, 2006", "id": 4738300}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We stayed at the Hotel Plaza Lucchesi over New Years. We absolutely LOVED this hotel. I work for an airline and do lots of traveling. This hotel was absolutely beautiful and in a great location. Our room was spotless. It was decorated beautifully in yellow and we had a flat screen TV. The bathroom was brand new and spotless. The hotel staff were superb. They were friendly, very helpful and gave great recommendations. The restaurant was very nice. Breakfast was OK (a good breakfast in Europe is impossible to come by). This hotel overlooks the Arno River. It's very close to everything but slightly off the beaten path. It's better to stay slightly off the beaten path because there is much less noise and you can get some sleep. I got a great rate by booking directly off their website. Next time I go to Florence, I will definatley stay at the Hotel Plaza Lucchesi!", "title": "Couldn't ask for more!", "helpfulness": 11, "user": "kerri l", "date": "February 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3195112}, {"rating": 5.0, "title": "A wonderful time", "text": "I gave my husband a 5th anniversary present, a trip to Florence over the Thanksgiving holiday. The hotel was lovely as the staff was friendly, warm and very helpful. The location was within a 15 minute walk to the Ponte Vecchio but far enough away from the crowds. Our room was nicely appointed with a balcony overlooking the Arno River. We had booked a two story suite and the only negative might be that the bathroom and the bedroom were not on the same floor. The breakfast was plentiful and good.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3178145}, {"rating": 5.0, "title": "One of our favorite small hotels", "text": "I would stay here again, when visiting this glorious city.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 2, 2005", "id": 3116295}, {"rating": 5.0, "title": "Right on the Arno, view of the Duomo", "text": "My husband and I were in Italy for almost the entire month of September and we were lucky to stay in some fabulous hotels in Rome, Venice, the Amalfi Coast and in Northern Italy. The Plaza Lucchessi in Florence was, however, one of our favorite smaller hotels. We were warmly welcomed by the staff, and had great help from the concierge in selecting terrific restaurants each evening. Our room was smaller than some we stayed in, but beautifully appointed, clean, quiet and comfortable. The best part was the fabulous view overlooking the Arno River! The gorgeous sunsets and sunrises by the river reminded us of why we came to Italy. The hotel was situated within walking distance to the Ufizzi Gallery, the Duomo and many of the amazing plazas. Another great benefit was that the open air tourist bus stops not far from the hotel and you can jump on, see the entire city to get a perspective of where all the sites are located, then go round again and get on and off wherever you please. It's a wonderful way to get to know a new city at a very reasonable cost. And it's fun! We highly recommend the Plaza Lucchessi and its wonderful staff.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 16, 2005", "id": 3009952}, {"rating": 4.0, "title": "I Got Engaged!", "text": "Hotel is located just a ten minute walk from the Ponte Vecchio bridge overlooking the Arno. The room was spacious with a gorgeous balcony that overlooked the Duomo. It is in a very quiet location, yet close to the major attractions in town. The breakfast was excellent and plentiful and the staff very professional and attentive. I HIGHLY recommend this hotel when traveling to Florence.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 11, 2005", "id": 2999652}, {"rating": 4.0, "title": "Pretty nice hotel.", "text": "Very nice, clean hotel whith spacious rooms and bathrooms. Overall, I have stayed in nicer, but definately a four star for Europe. Most of the staff was pretty friendly, and the location was excellent along the river. Rooms can be a hit or miss. Ours was big, but faced the back alley so there wasn't much to look at. Make sure to request a room overlooking the river. The breakfast buffet was pretty good, and we ate there most mornings. Overall, if you can get a good price on the room, you can't go wrong.", "helpfulness": 2, "user": "ietrvls", "date": "January 11, 2005", "id": 2999312}, {"rating": 5.0, "title": "Great value near Santa Croce", "text": "This hotel exceeded our expectations. We stayed at the Plaza Lucchesi during our honeymoon. Our room overlooking the Arno was clean, bright, and big. The decor and the hallways reminded us of The Palace Hotel in San Francisco. The staff couldn't have been friendlier and offered some excellent suggestions for dining in the area. Although the hotel isn't centrally located, it's in a great location for visitors who enjoy walking and exploring. The hotel is around the corner from Santa Croce and a short walk to great restaurants like Cibreo and La Giostra. It's also close to the best pizzeria in the world--Il Piazzoulo.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 20, 2004", "id": 2906427}, {"rating": 4.0, "title": "Lovely stay", "text": "I stayed at this 4-star hotel with my husband from Oct 12-16. It was a special anniversary for us, and I let the hotel know this at the time of my booking, asking for a room with a balcony. This proved to be a wise move because the hotel gave us a fabulous room overlooking the Arno. The room was very large by anyone's standards, very bright, with a small sitting area in front of our king-size bed with a flat-screen TV. Our balcony spanned the entire room, allowing us some breaktaking views so compelling that we actually shortened our sightseeing on some days so that we could sit on the chairs provided and take it all in. Breakfast in the lovely restaurant was fair. Waiters were dressed formally and tables were set beautifully, but these trappings did not match the rather ordinary selection of food. Service was pleasant and helpful throughout our stay. The hotel is located outside the very centre of town, but we didn't mind the walk, particularly as we looked forward to taking in the view on the Arno at the end of a full day of sightseeing. The hotel could use some sprucing up, but overall, we would recommend staying there. Given the price one must pay for similar properties in Florence, we got good value for our money.", "helpfulness": 3, "user": "Shirley Z", "date": "November 2, 2004", "id": 2801349}, {"rating": 3.0, "title": "Plaza Lucchesi - Just OK", "text": "My husband and I stayed at the Plaza Lucchesi for two nights last week. We were not impressed. I had stayed at this hotel 15 years ago and had a wonderful room - what they call a \"duplex\" these days. I booked a \"classic double\" through the Summit Hotel website (probably a mistake now that I have read some of the previous reviews). For 240 Euros we got a room that was barely large enough to hold a \"king\" size bed that sagged in the middle, a desk and one luggage rack. The shower stall was small--as was the bathroom. No balcony and our \"view\" was of another building. The hotel was remodeled in 2000 and is already showing some signs of wear and tear--perhaps because of the many tour groups that pass through.", "helpfulness": 1, "user": "Coco21", "date": "October 20, 2004", "id": 2759839}, {"rating": 5.0, "title": "Great hotel; great location", "text": "On the plus side, the room was clean and located on the side of the hotel so we did not have traffic noise. There was a computer with free internet and a printer just off the lobby. The hotel phone charges were very reasonable. The breakfast was very nice--tho we did not know about the eggs available on request. We thought the location was great and we found some very nice restaurants only a couple of blocks away.", "user": "SeismicGuy", "date": "October 19, 2004", "id": 2757021}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Stayed at Plaza Lucchesi with 2 friends for 4 nights. From the moment we walked into the hotel we were made to feel so welcome! We were even taken to our room by a member of staff from Reception as well as our luggage taken separately. We had a triple room on the 4th floor, which was one of the nicest rooms I have stayed in in a European hotel. Wonderful view over Santa Croce and the Duomo, we also had a balcony which added to the excitement! The sunset each evening was a delight.", "title": "Excellent hotel, fantastic location in the city", "user": "trisha v", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10005516}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I could not fault the staff in any way. All staff were a pleasure and so helpful.", "title": "Fabulous Hotel : A dream in Florence", "user": "General13", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8664688, "likes": {"liked": "— The situation in the heart of Florence and the room", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "Hotel is in an excellent location away from the busy piazza's and side streets of Florence close to Arno river. Would recommend this hotel to anyone visiting Florence as I know they would not be disappointed. Big thank you to the Hotel Lucchesi for making our stay in Florence so special.", "title": "Disappointed, some issues not compatible with a 4-star hotel", "helpfulness": 3, "user": "steph0208", "date": "August 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8590955}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Excellent stay in Florence ! This hotel is very beautiful. We booked a Room deluxe and the staff gave us a free upgrade for the best suite !!!! The suite was Amazing with a really nice view, two lcd flat screens, wifi connection, luxe bathroom... The staff were really great and friendly during all the stay. This hotel is one of the best hotel in Florence, I recommand it for all couples.", "title": "Fabulous hotel", "helpfulness": 2, "user": "NJPT", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8427790, "likes": {"liked": "— The location", "disliked": "— Bathrooms need some upgrading"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I spent with wife 4 nights at the Plaza Lucchesi. I was disappointed with the following:", "title": "4 Star Price - 5 Star Treatment", "helpfulness": 1, "user": "Jossi081", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8422936, "likes": {"liked": "— Rooms and atmosphere", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Fantastic location and wonderful staff", "text": "My wife and I stayed at Lucchesi for 4 nights. Because I read the tripadvisor's reviews, I asked the hotel to change my room with a better view after I was assigned a room facing the backyard. Upon my request, they assigned me a duplex room facing the Arno. (The bedroom is upstairs.) For 165 euro (standard), I could not ask for more. As for the bed, it was really hard though I expected it after reading the reviews. Afterall, I slept over the bedcover with the extra blanket on. Please note however that my wife had no complaint whatsoever about it. So, it depends. The furniture and utilities were old and need constant mending. But considering the fact that the hotel is about 150 years old, one of the oldest historic hotels in Firenze, you might be able to overlook it. The taxi to/from the train(FS) station cost us about 12 euro. After you put off all the luggages, you can walk around the city without any difficulty. Thank you Lucchesi and thank you tripadvisors!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4050504}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Excellent hotel. Excellent service. Excellent stay.", "title": "Excellent Stay", "helpfulness": 2, "user": "alma_mater", "date": "November 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6085841, "likes": {"liked": "— The confortable bed. The freindly service.", "disliked": "— Maybe they can improve the quality bathroom. Seems recently renovated, but a little old fashion."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I strongly reccoment this hotel in Florence, just in front of the Arno river, next Ponte Vecchio. My room was very big, nicely decorated and with a beautiful terrace overlooking the whole Florence. Very confortable bed. Only the bathroom was not really class, but shiny and clean.", "title": "Our favorite hotel of our trip to Italy", "helpfulness": 2, "user": "dhemmert", "date": "November 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6062988}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We loved this hotel. The rooms are large and clean and well appointed. The staff was friendly. The hotel is within walking distance to San Croce, Uffuzi and right on the river. We could even see the replica of David on the Michelangelo Plaza on the hill from our window. We wished there was Internet connectivity in the room, but we had to go to the lobby for this. We enjoyed the big breakfast spread and, if you are missing American style coffee, there is lots in the breakfast service.", "title": "Loved this place!", "helpfulness": 2, "user": "AnnieTX123", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5920326}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "this is an excellent hotel! It was well worth the extra money for an upgrade. The rooms were beautifully decorated, the bath was very large and everything was so clean. The hotel is right on the river just a few blocks from the Ufizzi and Santa Croce. Breakfast was fabulous-- make sure you ask the staff to bring you a freshly-made cappucino instead of the regular coffee service. The staff gave out excellent restaurant recommendations and even made a personal wake-up call to ensure we didn't miss our flight home. I loved this hotel and would consider going back!", "title": "Well placed hotel", "helpfulness": 3, "user": "Pauper", "date": "September 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5835791, "likes": {"liked": "— The proportions of our room and the view over the River Arno.", "disliked": "— Had a slightly jaded/faded air to the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Hotel is nicely placed in Florence. It is an eight minute walk to the Uffizi and only a short stroll from there to all the other sites in medieval Florence. Our room looked over the River Arno and was nice. Didn't try the hotel restaurant. We ate at the Golden View Restaurant on the Ponte Vecchio - nice food and a lovely view of the bridge at night. In summary, the hotel was nice but had a slightly faded feel to it.", "title": "Fantastic Hotel!", "helpfulness": 5, "user": "WSG34", "date": "September 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5828986}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Staff was friendly and spoke very good English.", "title": "beautiful view, balcony", "helpfulness": 7, "user": "JulieCB", "date": "March 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3312295}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "This was not my favorite hotel of the three we stayed in, but then again, Florence was not my favorite place.", "title": "Good Service and Location", "helpfulness": 6, "user": "Traveler111Stamford", "date": "March 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3308585}, {"rating": 5.0, "title": "Awesome", "text": "We stayed in Florence from April 11-14, 2005 and chose this hotel based on the outstanding reviews on Trip Advisor. The pictures and descriptions looked awesome. We really thought this hotel would be the highlight of our trip through Italy with other stays in Venice and Rome.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3278857}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "It is 10 min walk from the old city and very nice service. Had the river view and it was very nice. I have actually gone back to stay at the hotel again.", "title": "Quiet and nice", "helpfulness": 4, "user": "Lankz", "date": "August 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3790329}, {"rating": 5.0, "title": "Exceptional Hotel Near Santa Croce", "text": "This hotel is exceptional in its decor, service, and appearance.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 3, 2005", "id": 3734733}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "A truly amazing 4 star hotel. I should first say that we booked early through their web-site and received 30% of the entire stay. This made the stay even more amazing because the hotel was not only beautiful but reasonable.", "title": "Royal Treatment", "user": "dturbow", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10118142}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Located just outside the center of town, the Lucchesi is a plush. luxurious hotel. We had marvelous room with a separate sitting room and balcony with views of the Duomo and the Arno River.", "title": "Great Views, Great Staff", "user": "skisail", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10116501, "likes": {"liked": "— location/views and professional staff", "disliked": "— It is expensive and the elevator is small and frequently broken"}}, {"rating": 5.0, "title": "A refuge in Florence", "text": "We will definitely stay there again", "user": "raven20", "date": "October 14, 2007", "id": 10076474}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Plaza Lucchesi is the quintessential Firenze hotel experience - from the location right on the Arno river, to the Murano glass chandeliers in every room, to the incredibly friendly and professional staff. The hotel and the rooms are nicely decorated and the beds and bedding are luxurious. We had two adjoining rooms, which is great if you are traveling with older children. We were here in August and can attest to the fact that the air conditioning works well! The breakfast that comes with the America plan is fantastic - fresh local cheeses, pastries, fruit, eggs, etc.", "title": "A Very Enjoyable Six Nights", "helpfulness": 1, "user": "eremin2000", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10044919, "likes": {"liked": "— We got a great room.", "disliked": "— The weakness of the U.S. dollar."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "What really makes this hotel stand out, however, is the staff. From the moment we stepped into the hotel, the staff was nothing but friendly, helpful, and attentive. At check in, the concierge actually walked us to our room.", "title": "Large hotel, great location", "user": "mpbbarrett", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10040515}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "My single room with balcony overlooking the Arno was beautifully situated, close to everything. The room itself was small but clean and comfortable. The bathroom, however, was small and not terribly clean. The shower (no tub) did not drain properly and was so small that when showering ones nose is pressed against the shower wall. This is not OK when the shower wall is visibly unclean. The breakfast was quite good and filling. The Staff was very pleasant but not especially helpful. I do not consider this to be a 4 star hotel or worth the price. However, the view was worth the other disappointments.", "title": "Beautiful View", "helpfulness": 7, "user": "AnneG20", "date": "October 7, 2005", "detail_rating": {"cleanliness": 2.0, "rooms": 3.0, "service": 3.0}, "id": 4000327}, {"rating": 3.0, "title": "The Beds Are Inhumane", "text": "Hotel is fine, staff are excrutiatingly helpful, but the beds will kill you.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3992341}, {"rating": 5.0, "title": "Plaza Lucchesi - Wonderful", "text": "It doesn't matter if you have a fantastic balcony (as we did) when the springs are a-stabbing (as they were).", "helpfulness": 1, "user": "DianaA", "date": "September 29, 2005", "id": 3976076}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at the Plaza Lucchesi for 3 nights at the end of September. We were given a fabulous room with amzing views and a large balcony. The room was clean and comfortable and very attractive. The staff all seemed very helpful and friendly. While some may find the 10 minute walk(if that) to be a little far, we loved being in a quieter area at night times, and i would say the hotel was central to all sights and attractions. We were very pleased with our experience here.", "title": "Boston Traveler", "helpfulness": 5, "user": "Vacations from Boston", "date": "September 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3935310}, {"rating": 5.0, "title": "The Plaza Lucchesi Was Wonderful!", "text": "We stayed at the Plaza Lucchesi Hotel in mid November. The accommodations and staff were wonderful .", "helpfulness": 3, "user": "PatsyAnn1", "date": "January 25, 2008", "id": 12981477}, {"rating": 5.0, "title": "Loved this hotel!", "text": "Upon arriving they upgraded us to a suite overlooking the Arno river ( at no additional cost ).The room was absolutely lovely with an upper king bedroom and bathroom and a foyer, living room and a 2nd bathroom on the 1st floor. The room had large windows from the 1st floor to the upper ceiling with a beautiful view of the river and hills beyond.", "helpfulness": 6, "user": "dancingqueen_8", "date": "January 6, 2008", "id": 12372573}, {"rating": 4.0, "title": "Excellent location, good service", "text": "Although this was not our first trip to Italy, it was our first trip to Florence. Both the concierge and day manager, Barbara, were very helpful with directions, sights to see, reserving tickets, restaurant recommendation etc. ( if you have the opportunity to dine at Bucca Mario, do so! ).", "helpfulness": 1, "user": "LizardAtlanta", "date": "November 18, 2007", "id": 10891961}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "A decent buffet breakfast was included each day and delicious appetizers were laid out at the bar each evening......which was a nice treat after a long day of sightseeing.", "title": "Great place to experience Florence", "helpfulness": 1, "user": "ginge33", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10609683, "likes": {"liked": "— Location (despite a bit of traffic noise) and the service", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I have been to Florence three times, and this was my favorite hotel. Great location right on the banks of the Arno. Extremely helpful staff. Great breakfast. But rooms do vary. My husband and I took our three adult children with significant others, and the four rooms were very, very different. If you can upgrade and get a room with a balcony on the Arno, do it. It makes a huge difference. Our bed was comfortable, towels were great. Small shower but I didn't care because the view was so amazing, the staff so nice, and the location was perfect - far from the crowds but still within walking distance of all the main sights. Very classy hotel.", "title": "Nice hotel with great location", "user": "caviargal", "date": "November 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 2.0, "cleanliness": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10564568, "likes": {"liked": "— Location", "disliked": "— Overheated and in need of a refurb"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The Plaza Hotel is in a great location,close to most major attractions and things to do.", "title": "Very nice in a great location", "helpfulness": 1, "user": "whatsinitforme", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15644678}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Staff are very friendly and helpful,restaurant is excellent and they do have secure parking on site.", "title": "lovely hotel - breakfast same every day", "helpfulness": 1, "user": "SamanthaJayne06", "date": "March 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14442616, "likes": {"liked": "— River View", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The staff especially restaurant staff will give great ideas on things to do in Florence.", "title": "A wonderful stay", "helpfulness": 1, "user": "krmmahr", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14002063, "likes": {"liked": "— the staff and cleanliless of rooms", "disliked": "— the shower could be awkward"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2004, traveled on business", "text": "Avoid Ponte Vecchio for jewellry,look around in the old town of Florence for better deals.", "title": "Beautiful Terrace, Helpful Staff, Good location", "helpfulness": 1, "user": "Elsiedog", "date": "February 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13887267, "likes": {"liked": "— Terrace"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Visit the gardens just over the river,its a hidden em but will require at least 4 hours.", "title": "Picturesque Tuscany", "helpfulness": 3, "user": "tiki1314", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13107973, "likes": {"liked": "— location and charm", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "Service at breakfast was very attentive and quick. The food, as someone pointed out in an earlier post, was acceptable but not great. The excellent service, however, compensated for this and you can ask for eggs which were prepared without any additional charges--nowhere does it say this so you just have to know. Also, a single computer on the lobby level was convenient with free internet access, complete with printer. We would definitely stay here again--we stayed at 4 great hotels in Italy and this was my daughter's favorite hotel (mostly due to the flat screen tv and the fact that they have MTV!!).", "title": "Wonderful Hotel, Wonderful City!!", "helpfulness": 6, "user": "CariStroudsburg_PA", "date": "March 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3254597}, {"rating": 5.0, "title": "Best value in Florence?", "text": "Along the Arno . . .great rooms . . .great service . . .great breakfast . . .quiet and classy!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3240898}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We book two nights at this hotel for May 2007. We were charged one nights deposit upon our reservation. We have cancelled due to change of plans. Upon contacting the hotel for our refund we were refused. They told us we can use it for a future stay. I called the hotel and asked for management and the gentleman who answered advised he was in charge. I explained what the problem was and he immediately told me that he couldn't help me because their computers were down. Then I asked for the phone number to the police so that I could report them and he replied, \"one moment, I look it up on the computer.\" Ten seconds earlier the computer wasn't working but suddenly it is???? This gentleman did give me the number and was polite but still their customer service is to charge you and even though you cancel months in advance refuse to give you a refund. While I have no experience staying at this hotel, I felt I should share what I have went through months before arriving in Florence. Bad Customer Service.", "title": "Beware", "helpfulness": 6, "user": "Heart10", "date": "September 19, 2006", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 5817430}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed at the Lucchesi for 7 nights in August. We had booked a standard room and without evening asking, they had already upgraded us to a deluxe room with a balcony. The room was actually very spacious with a sitting area. On the website, it's the room with the column. We were also on the top floor with a wonderful view of Florence. This hotel is so clean and everyone at the front desk is so accomodating. The only complaint for me is that the bed was two singles pushed together and also made up as twins. Not good for newlyweds, which we weren't.", "title": "Loved the Lucchesi!", "helpfulness": 4, "user": "amaranga", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5775467, "likes": {"liked": "— Everything about the hotel. Location, service, rooms.", "disliked": "— The bed situation"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The hotel also has their own garage, if you choose to have a car, which we did for excursions into Tuscany.", "title": "One of the best in Florence", "helpfulness": 24, "user": "paoconno", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5505712, "likes": {"liked": "— Location and breakfast", "disliked": "— room size"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The breakfast room was lovely. Fresh fruits, eggs, meats, great granola.", "title": "Beautiful Hotel!", "helpfulness": 4, "user": "Artsy3003", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5504645, "likes": {"liked": "— Its location and rooms", "disliked": "— Far from train station"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Since we've been home, all we can think about is going back to Italy, and Florence. We would definitely stay at the Lucchesi again. We loved it!!", "title": "Wonderful!", "helpfulness": 6, "user": "Dede R", "date": "July 12, 2006", "detail_rating": {"value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5459861}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 59, "very good": 203, "terrible": 13, "excellent": 279}, "aka": "Plaza Lucchesi Florence", "slim_ranking": 0.225108225108, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}