{"user_rating": 5.0, "review_count": 95, "name": "Podere Del Priorato", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were lucky enough to stumble upon Podere Del Priorato on booking.com when we decided we should book our first night in Italy and not leave finding a place to chance. We are so very glad we did! The farmhouse is gorgeous! The rooms are modern and very well appointed with lovely amenities. The area is lovely and the sunflowers, while almost done, provided a breathtaking backdrop. Breakfast was the best we have ever had (and we've had quite a few!) but most of all, we were touched by the efforts made by the hosts to ensure we could watch the Opening Ceremonies of the 2012 London Olympics. My son was competing for Canada and we really wanted to see him march in - they made every effort to find us an English channel and shared their lounge (even though it was quite late) with us.", "title": "Beautiful, delicious and a perfect start to our vacation!", "user": "mmccormi", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137190630}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 8, "terrible": 0, "excellent": 86}, "slim_ranking": 0.0294117647059, "description": "Se cercate un agriturismo che unisca la naturalità alla raffinatezza, che vi faccia sentire graditi ospiti in una bella casa, al Podere del Priorato troverete il comfort di un relais e le attenzioni di un'accoglienza famigliare. Immersi tra campi e vigneti godrete del relax della campagna a pochi chilometri dal mare della Costa d'Argento: L'Argentario, l'Isola del Giglio, i bellissimi tomboli naturali della Giannella e della Feniglia. Nove stanze, un appartamento, parcheggio coperto, produzione energia, spazio conviviale comune, camino, possibilità coltivazione orti, materiali ecocompatibili."}