{"user_rating": 3.5, "review_count": 109, "name": "Point South-Yemassee", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Yikes -- I hate to write poorly of Hampton Inn as we have stayed at Hamptons for many years! Always has been a nice, predictable stay at a reasonable price . . . but not at the Hampton Inn at Point South-Yemassee!!", "title": "One word: Ugh!", "user": "Canne803", "date": "June 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 132560538}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Our family booked a room at this hotel for one night on our return trip from Florida back home to North Carolina in March 2012. We had stayed at it once before three or four years ago and hadn't recalled anything particularly negative. Despite some iffy reviews on TripAdvisor, we pressed on since it was the perfect stop so far as location on this trip.", "title": "southern hospitiality...", "user": "davsbabe", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132276314}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We have high standards to cleanliness and this hotel failed miserably. Truly, this is the first hotel I have ever stayed in the Hampton Inn chain that just blew it. We arrived late at night, but we were alarmed by how unkempt even the hallway was . . . it appeared to not have seen a vacuum in weeks. The smell of the room was simply unclean . . . hard to describe, but given the late hour and with young children, we quickly tucked them in and turned out the lights. I decided to wear flip-flops throughout the room and bathroom at all times, though, because I just was \"icked\" out by the floors. The next morning, as the sunlight flooded in through the window, I noticed that a VERY think layer of dust covered the furnishings . . . bedside table, clock, etc. The bathroom had hairs on the floor underneath the sink area. You get the idea.", "title": "Not The Best Hampton Inn", "helpfulness": 1, "user": "Lovetogoplacesalot", "date": "May 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 129449154}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We ate a quick breakfast . . . standard Hampton Inn fare as expected . . . but we left as quickly as possible to get home. Lastly, the staff, while not unfriendly, certainly seemed apathetic. Somebody has dropped the ball at this Hampton Inn, big-time, and we would not return.", "title": "Don't Expect it to be Clean!!", "helpfulness": 1, "user": "Robert M", "date": "May 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 129419768}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "we were traveling to orlando and always try and stop in S.C.", "title": "OK but needs updating!", "user": "ClaudiaB", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 127121636}, {"rating": 1.0, "stay_parameters": "Stayed March 2012", "text": "My husband and I stayed here one night on the way to Florida. The mattress is totally uncomfortable! I could not sleep at all. The microwave must've been made in 1980 We will never stay here again.", "title": "One of the most uncomfortable nights I've ever spent in a hotel", "helpfulness": 1, "user": "Deb4amberc", "date": "March 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 126180792}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Very difficult to find. Both MapQuest and our GPS directed us to a place that was in the middle of nowhere and about 5 miles from this hotel. Called the hotel earlier in the day to confirm, and the person who answered didn't mention the problem with finding the hotel. Later, it took two additional calls to actually find the place. By then, we were strung out. It also took way too long for someone to answer the phone, every time we called. Our welcome was on the cold side. I'd say that the front desk staff were not there most of the time, and were cool at best. The night clerk played loud games while at the front desk, and immediately returned to his game as I left...as if I bothered him by interrupting his game. Also there is no decent place to eat near this hotel. The signing for the hotel when we got of the interstate was not adequate, resulting in another call to the hotel. This is just not good enough for a Hampton Inn, which we depend on to be always good. Had to move rooms, as the light on the bathroom was flickering and the refrigerator hummed loudly. Even the new room was noisy with paper-thin walls, hearing neighbors thru the bathroom vent. Also heard the noise of equipment on the roof. Just would never stay at this property again.", "title": "Don't Depend on GPS to Find this Place", "helpfulness": 1, "user": "tlscorpio", "date": "February 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 123960611}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "i have stayed in other Hamptons around the USA and found this to be typical of all other Hamptons. NO BED BUGS. Room was a good size. Refrigerator was good. WiFi was good. Room was clean. Bathroom was clean. It was a very convenient place to stop along I95.", "title": "Pretty Good Value", "helpfulness": 1, "user": "FrankKiv", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123872497}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Front desk people were OK. Just a very good place to spend a night.", "title": "Fine for roadtrip stop", "helpfulness": 1, "user": "A_ZuckerMaryland", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122148269}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "We were concerned after reading the reviews, but this was the half way point on our roadtrip. There were no bed bugs, and the place was clean. The fridge was large (which helped with our cooler of things). It did show some age, but for a nights rest - it was perfectly adequate.", "title": "Yuck, smelly.", "helpfulness": 1, "user": "ano0014", "date": "December 10, 2011", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 121591169}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed at the Hampton Inn June 13-18th. Had a problem with low tire asked for referral at desk of who to call for repairs. The guy they told us to call tried to charge us $75 for doing nothing but runn water over tire and put air in it. Finally settled for $50 but had to go into Beaufort next day to have it fixed as it had a nail in it. So ended up paying again but at least it was fixed correctly. So don't call thier referrals...probably a relative or split the take. Told the manager but was just told \"we won't use him again\" Not the greatest Hampton Inn we've been at and are HH members so use them frequently. Also son lives in this area so would be a great place to use if hadn't had problems...Have to thing about staying again or not?????", "title": "Like Hampton Inns but disappointed", "helpfulness": 1, "user": "Carol Q", "date": "August 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 136933069}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The rooms were clean and larger than most Hamptons. For the money, I would say it was a good value. I travel for work quite a bit, and stay predominantly at Hamptons when possible, and therefore, can say that the service was not typical of most Hampton Inns. Registration was not at all friendly on check-in, and even worse on check-out. Surprising to say the least. As a preferred Hilton Honors member, I usually receive a daily paper and my bill under the door so I don't have to worry about it upon check-out. I did not receive anything. Not a huge deal in the grand scale of things, but could have done without the attitude from the workers behind the registration desk.", "title": "Average Overall", "helpfulness": 2, "user": "Breber17", "date": "July 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 135110643}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Overall an average stay, and just glad the rooms were clean.", "title": "A/C Failure and Uncomfortable Beds", "helpfulness": 2, "user": "ChrisnTeshia", "date": "July 15, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 134400624}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We stayed at this hotel for one night on way to Orlando. I was shocked! I am a HHonors member and have stayed at many Hampton Inns. This was the worst nights sleep I've ever had. The A/C wouldnt reduce the room temop below 80 degrees at night and I could not sleep on the bed as it was way to beaten down. My wife and I woke up with sore backs. Hilton/Hampton has a 100% money back guarentee. When I told the front desk of these issues they issued me $10.00 off the nights stay....hardly a 100% guarentee. Only when I reviewed the stay with the survey they sent me via email was I refunded the entire nights stay. Glad I filled it out! On the positive side continental breakfast was nice and the pool came in handy too. They need to train their front desk staff what the 100% guarentee means. It is the first time I've ever disliked a Hampton Inn.", "title": "We like Hampton Inns!", "helpfulness": 1, "user": "pdp2", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133910409}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "With very few exceptions we enjoy staying with friends in the Hampton Inns. Here our rooms were clean and up to their (and our) standards. We use the lobby to play games and this stay was no exception. The bed (mattress) was excellant. We didn't eat breakfast but I did get a coffee to go. Staff on site were very friendly. We recommend this one as well.", "title": "Did not change sheets!", "helpfulness": 1, "user": "toni0308", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132966101}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Upon arriving the young lady at the desk was very friendly and helpful, and the lobby looked nice.", "title": "Not clean", "user": "Dreaming", "date": "November 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 145730857}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We thought we had found a good place to stay on our way up north from Florida. But once in the elevator we got worried. It was dirty and there was a big smudge of some kind of dried up food across the doors. Our room looked okay at first...but then I opened a drawer and found a melted ice cream cone with a napkin stuck in it. The rug was stained and everything had a disconcerting stickiness. The toilet was filthy. The beds were okay. Breakfast was a dismal affair and nothing got replenished. Someone came and looked at the crumbs of dried up eggs and did nothing (it was only 8AM). On leaving there was a real sour puss at the front desk who said \"good morning\" begrudgingly without looking up. I was glad to get out of there. I thought I could count on a Hampton Inn to uphold certain standards...but not this one! They obviously do not have enough staff.", "title": "Nothing special at all", "helpfulness": 2, "user": "James B", "date": "October 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 142238749}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I stayed here so I could attend the graduation ceremony at Parris Island (about 40 minutes away). Can't say I was impressed with the front desk service (no smile at all, and I don't know if eye contact was ever made). The room was below average, in my opinion. From the CRT television (when I'm used to flat screens in Hampton Inns) to the poor sound insulation which led to loud noises from the hallway, every other Hampton Inn I've stayed in was much better than this one. The bathroom was not clean, the shower head needed replacing, and water pressure was not good. The breakfast buffet was pathetic - the eggs were lukewarm and looked unappetizing.", "title": "Worst Hampton Inn ever!", "helpfulness": 2, "user": "gregharpernc", "date": "September 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 141048310}, {"rating": 1.0, "title": "Love Hampton Inn but should have kept driving to New Jersey", "text": "If you are staying in this area, I'd recommend another hotel - and I'm a loyal Hhonors member who always looks for Hilton properties over all others.", "helpfulness": 2, "user": "Laura F", "date": "September 2, 2012", "id": 139151441}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Horrible hotel, requested a different room due to the initial room having dried urine all over the toilet upon our arrival, the second room had disgusting stains all over the carpet, the inside of the entrabpnce door and the bathroom door had some mess splattered on them, the beside he couch there was a used plastic spoon in the floor and some thing that looks like food to tobacco on the floor. Shower had soap or shampoo on the walls. If we had not been so tired from driving from destin Florida we would have checked out.", "title": "Below average Hampton Inn", "helpfulness": 1, "user": "Nicole T", "date": "August 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 138028674}], "location": {"country": "United States", "city": "Yemassee"}, "variance": {"poor": 21, "average": 18, "very good": 34, "terrible": 8, "excellent": 28}, "aka": "Hampton Inn Point South-Yemassee Hotel", "slim_ranking": 0.142857142857, "description": "Our Hampton Inn Point South Yemassee hotel is located just off of I-95 in Yemassee, SC. Offering many great amenities such as free hot breakfast and free Wi-Fi. Relax in our outdoor swimming pool or stay fit in our fitness center."}