{"user_rating": 4.0, "review_count": 1354, "name": "Pointe Hilton Squaw Peak Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Just got back & we loved it. I always like to start with the negatives, of which there weren't many:", "title": "Great resort for young kids", "helpfulness": 1, "user": "krakor", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 27908392}, {"rating": 4.0, "title": "My \"Pointe\" of view...", "text": "1) The main pool is not heated. Certainly not a big deal in the summer in Phoenix, but when we were there it was 55 when we woke up and 80 at midday. It would have been nice if the pool were heated. Note that the lazy river WAS heated and was fantastic during the cooler periods.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 12, 2009", "id": 27832227}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "2) We blew the circuit breaker in our room 3 times in 7 days, without using any irons or hair dryers. Not sure what was up with that, but it was not a big deal. The first time, they sent someone immediately and they gave our child a \"token\" good for a prize. The next two times, we had seen where it was and just popped it ourselves.", "title": "Brochure claims are overstated - but nice stay nonetheless", "user": "mamajojoYork", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 27697324}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "OK, now on to the positive - everything else!!", "title": "Perfect Spring Break Vacation!", "user": "briggs526", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27353210}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "1) Most importantly, the people were great. Very friendly and helpful.", "title": "Unless you have younger kids, don't spend the extra money!", "user": "SpringSun", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 27286748}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We wanted to end a week in Az. with a little poolside R&R and this resort was great in that dept. All of our kids, ages 14,12 and 4 had a blast and were not bored at all at the water facilities. My husband and I also took a short walk from the resort to a park full of trails of different levels of difficulty. You can walk on flat trails around some pretty lofty peaks or you can tackle the peaks and be rewarded with some pretty views. The only real low point came when we bought tickets to the western dinner show on the property. It was HORRIBLE! Both the show and the food at dinner were not worth a fraction of the cost. The food at the Lantana Grill was also below average. Next time, we will probably venture off the property for dinner.", "title": "good family resort", "helpfulness": 11, "user": "deborahd1966", "date": "April 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4830081}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "All suites, nice amenities, excellent location central to restaurants, hiking, spring training baseball. Very accomodating staff, helpful whenever asked. Food was fine, decent prices, good for kids, just OK for adults. Overall, a great place to stay for us and our 9 and 11 year old.", "title": "Great for families with younger kids", "helpfulness": 8, "user": "cubbyboy1991", "date": "March 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4825565}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "This spring break trip will probably be the last of", "title": "Teens outgrowing the Pointe", "helpfulness": 7, "user": "Fe", "date": "March 25, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4733110}, {"rating": 2.0, "title": "Wonderful resort for Children/Famalies", "text": "many previous trips to the Pointe. My 15 and 12 year", "helpfulness": 15, "user": "A TripAdvisor user", "date": "March 9, 2006", "id": 4597171}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "olds have finally outgrown the Lazy River, Mini Golf", "title": "Beautiful resort", "helpfulness": 9, "user": "jackieh8", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4595277}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Stayed at this resort for one week while at a business conference in Phoenix. The one-bedroom suite was very clean and the bedding was exceptional. Probably the best night's sleep I have ever had while staying in a hotel. We ate two breakfasts on site at the Slim Pickens Restaurant. The first was a breakfast buffet on Sunday and it was exceptional. All you can eat for 9.99. Service was excellent. The second time we ate was during the week and breakfast cost more and was not very good. Service was not acceptable. We thought that our young waiter had quit during our meal.", "title": "Very nice rooms", "helpfulness": 14, "user": "SXMChick", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5364513}, {"rating": 4.0, "title": "Awsome place for kids and adults that are \"still kids\" !!", "text": "The propery was very well kept. The only problem was the pool area where we were located. Each area has its own pool. During the first few days of our stay, the pool was in disarray every morning. Towels were not picked up and food and beverage containers were still everywhere from the night before. About Wednesday, things changed and the pool area was spotless. Possibly the person in charge of the pool was on vacation at the beginning of the week. Another problem with the pool was a private company giving swimming lessons to small children. After a day of being in conferences, it would have been nice to just get into the pool, but that wasn't always possible. Last, there are no pool rules posted and children were throwing balls, diving into the pool (there was a no diving sign), and many just being obnoxious. No real parenting going on there. The same could be said for the Lazy River. Luckily I wasn't there for a relaxing vacation.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "June 18, 2006", "id": 5359226}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "While I would consider staying there again because the rooms and staff were so nice, probably I would look for another place.", "title": "Nice property.....", "helpfulness": 15, "user": "rbreaux1", "date": "May 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5189046}, {"rating": 4.0, "title": "A Great Family Vacation Spot--During The Off-Season At Least", "text": "We have custody of our 7 year old grandson and we found Squaw Peak on the Hilton website. We wanted a \"fun\" place to take him and this looked like it was it. After booking, I became concerned after reading some of the TripAdvisor reviews.", "helpfulness": 22, "user": "punkinpapa", "date": "May 20, 2006", "id": 5183672}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Having stayed in a number of Hilton properties, I can tell you that if you have children, this is the place to go. The River Ranch has multiple pools, a long lazy river for use with pool-supplied inner tubes, a water slide, and a kiddie pool. Neat waterfall for kids and adults to play in. There is also a hot tub at the River Ranch. Food at the River Ranch outdoor bar is the same price as any pool resort-a little pricey, but not outrageuos. But there are plenty of \"water stations\" at the pool with large containers of free cold water and plenty of cups along side. The only aspect that bothered me is that through the week, it closed at 8 pm. I thought that too early-especially with the temp hitting 112 degrees...", "title": "customer service was great", "helpfulness": 19, "user": "AANDA'SMOM", "date": "May 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5146777}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "My wife, 4 year old, 8 month old and I had a great time. The bellmen were great and extremely helpful. My 4 year old is still asking to go swimming. The only draw back was the lack of microwave in the room. But we really didn't have much use for one anyway. The food a the resort was quite good. The mexican restaurant about a block away is one of the best. Could not beat the value or the fun for the Fiesta Bowl.", "title": "Perfect for bowl game with kids", "user": "BandTdad", "date": "January 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122850567}, {"rating": 3.0, "title": "Nice Stay", "text": "Stayed here once before, years ago, so I wasn't sure what to expect, but it turned out to be an enjoyable stay. Started off rocky, as I'm an hhonors member and have preferences on my account, and the stay was for my birthday, neither of which were even looked at. They gave me a room that was the complete opposite of my preferences. I thought maybe that was the only thing available, but once I called the front desk, they were able to move me to a much better room location. Not sure what happened there, except the check-in person obviously wasn't the best at their job. The room was nice, clean, and comfortable. It could use some updating and I was shocked to see that where there used to be a stocked refrigerator and snack bar, there is now an empty refrigerator and empty snack bar. The room had a sliding door to separate the bedroom and living area, so that was nice, and a floor length mirror in the bedroom was a nice feature. The food ordered for room service wasn't great. The menu itself is pretty small with only a few dinner options, and one of our orders was incorrect, but it was decent food. The walls must be thin here, as we could hear people talking in other rooms, but thankfully we didn't have noisy neighbors. Nice resort that could use some updating and staff that would pay more attention to details, but I'd stay again for the right price.", "helpfulness": 1, "user": "luv2travel022", "date": "January 7, 2012", "id": 122725292}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We booked our room for the New Years package the hotel was offering which advertised a totally family friendly experience. We arrived early but this was not a problem, they were able to get us into our room immediatly. The \"water park\" was really just multiple pools with various activities in them (waterfall, volleyball net, etc), there was one water slide and a lazy river (which was so lazy the kids wanted out). There was a nice eating area/bar with a ton of variety but very overpriced ($8.75 for a bloody mary in a 12oz plastic cup). The package included dinner at one of the restaurants. They lost our reservation but quickly arranged for us to be seated anyway. To our surprise the dinner was a buffet, which was not mentioned in the advertisement. It wouldn't have been bad execpt there were not a ton of child-friendly options. Me and my husband had the steak (yes, served on a buffet) which was terrible. They had some activities going on in one room of the hotel which was I assume the remainder of what they offered for their New Years celebration but we did not attend, at this point we were happy to go back to our room and watch movies. But when we got back to our room we noticed very loud music coming from behind our room. We couldn't see well enough to know what all the commotion was from but we thought it was part of the festivities that would end at 10 (according to the package deal). At 1:00a.m., when it still hadn't stopped I called the front desk to see if there was anything that could be done about this. They said they would notify security and couldn't even tell me what was going on there. Nothing was done and the music didn't stop until after 2:00a.m.! Turned out we were right next to a ballroom with a New Years party of their own going on. Needless to say, we got the worst night's sleep ever at a hotel. We got up early and left as soon as we could. We chose this place because they advertised a nice, low-key, family oriented New Years special that made it so our family could be together and we weren't out too late. What it became was a negative New Years memory. The hotel should have kept the families together and away from the obnxious parties going on around the hotel. We will not consider this hotel in the future during a holiday weekend, maybe not ever.", "title": "Disappointment", "helpfulness": 1, "user": "crews95", "date": "January 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122684223}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Rooms were spacious suites with private patios or balconies which would have been wonderful if not for the blaring music. The room was clean but obviously an older hotel. Grounds kept nicely. Beds were comfy but bring your own pillows!", "title": "Enjoyable!!", "helpfulness": 1, "user": "Cheryl M", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122667741}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The front desk staff, although not helpful at 1a.m. were helpful and apologetic in the morning. They took a percentage off our bill which was a small consolation.", "title": "Great stay once again", "user": "BLS12", "date": "January 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122630838}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed in a two bedroom casita over Christmas. The accommodations were very spacious, although the decor was a touch dated and the overall finishes of the rooms were only average. The staff were extremely friendly and helpful and provided recommendations on where to eat and shop. It was a bit too cold for us to enjoy the waterpark, but it was quite nice and something that families with children would certainly enjoy. The private pools and hot tubs around the casitas were nice. We would likely stay again if we find ourselves in Phoenix.", "title": "Nice Stay over Christmas", "user": "RLAKE902", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149594010}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "My husband is attending a Physician's laboratory conference, we are scheduled to check out tomorrow morning after a 3 night stay. I called the front dest to request 1 additional hour for check-out at 12:00 Noon. The woman at the front desk replied \"sure, no problem, we'll be happy to do that for you,\" then paused and said \"there will be an additional $35.00 fee.\" REALLY? I have NEVER been asked to pay an additional fee for an hour late check-out. NEVER! I've stayed at properties all over the globe and this is a first for me. I am HANDICAPPED and it takes me a bit longer to get up and going in the morning. I'm packing tonight so I don't risk missing the deadline of the 11:00 AM check-out. This resort property is huge and they have plenty of late 60's style rooms to check lodgers into before reaching our undesirable room, which is waaaaaaaaaay at the back of the property.", "title": "Not up to standard", "user": "Mia T", "date": "January 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 149543952}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Another issue: when we checked in the woman at the front desk stated they were giving us an upgraded room. Nice, right? NOT, we're next to a loud pump that NEVER shuts down. I can hear it all night long. I would rather have a smaller room that is not located above an airplane sized pump that's just as loud. Since Hilton is in the middle of NO WHERE I thought it would be quiet. There is NOTHING out here, no even a convenience store, only their expensive and limited gift shop that closes at 9:00 on Saturday night. Our room could use a bit of an update as well. The ceiling has a popcorn style finish. The sofa is worn and looks like something out of I Dream of Jeannie or Bewitched (remember those old shows?). No kidding, the mattress on my bed is just as old as the sofa and harder than the sidewalk outside my window. If it wasn't freezing weather here I would honestly pitch a tent and sleep outside on the peak. It would certainly be a better view than the multiple, giant, stinky trash cans located just outside our patio door.", "title": "Dont forget the $20 buck a day charge", "user": "Jagurundi", "date": "January 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 149395495}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I will say that they brought up a couple of packets of coffee upon request and a couple of bottled waters. I do, however, feel like it's fair trade because we did not have our room cleaned while staying here and that saves both time and money and is green. Oh well, looks like Hilton has gone to the Coyotes and the Cacti (loud and prickly). Ouch!", "title": "Spacious room", "helpfulness": 1, "user": "neal_etherington", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 149174491}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "Just spent several days and overall it was an ok experience but when you spend $350 bucks a night the little things matter. Like noisy hvac system that kicks and off all night so then you just have to shut off, then your freeze. The infamous bed that curves toward the middle and make it feel like you are sleeping a valley, the mushy pillows, the odd placement of wall light switches that make no sense, found a used contact lens in sink, and then to find out you get charged $20 bucks a day whether you use the internet or pool or not. Picked the place because of lazy river which was nice, Except when it got overrun with kids not following the rules that were clearly posted by swimming in it. Boy I must sign like a whiner who hates and picks at everything. Maybe i should have just got two rooms at an Embassy Suites and then not been disappointed. If I wasnt getting Hilton Honors points probably wouldnt have picked this place. Nothing (starbucks etc) within walking distance. Ok something positive. No noise from neighbors, decent shampoo,", "title": "Just got back!", "user": "kcj0nes", "date": "January 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 149027599}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I am currently staying at the Squaw Peak Resort, however at this very moment I am at home because, well read on…..", "title": "Was a Great Place however it is now a terrible place, go elsewhere, you have been warned!", "helpfulness": 5, "user": "Fishintheseas", "date": "March 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 26568362}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "I live in Phoenix and have stayed at both the Point Hilton Squaw Peak and Tapatio Cliffs Resorts more than 30 times over the past couple of years. I usually stay for a few days to get away or when friends and family visit I suggest they stay at either property and I get a room as well. I am actually bummed that I have to write this review as I have had many great experiences at this property, however be it cut backs due to the economy or just terrible customer service I will not be back. Do yourself a favor and look elsewhere.", "title": "always a pleasure", "helpfulness": 1, "user": "trippingJack", "date": "March 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26323537}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "As a Hilton Honors member I had the worst experience I have ever had at a property in my life. I have a friend in town with his wife and 2 kids and another couple both are staying at Tapatio Cliffs and took the shuttle over to Squaw Peak. We tried to make reservations at the 2 hotel restaurants, however both said they were booked and they suggested Aunt Chiladas which is off property about 1/2 mile away. They said they had a shuttle that would take us there and back. We had 7pm reservations and they brought us over in golf carts, which the kids enjoyed, and the driver was very nice and I gave him a good tip. We were informed just to call the hotel or the restaurant would call for us to request the return shuttle. We asked for the shuttle via the restaurant and after 15 mins were informed the hotel was not answering the phones. I too tried calling, however no answer and I tried calling more than 5 times.", "title": "Great value, but bring your own food.", "helpfulness": 2, "user": "AZkittymama", "date": "March 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 3.0}, "id": 26088931}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "So here we are, 9:30pm and the 2 kids are sleeping (long day, arrived on a 7am flight) and no shuttle. We decided to walk back after another 40 mins of calling and waiting. Not sure if you ever carried a ten year old and a 8 year old for over ½ mile in the dark after a long day, however its not fun. We get back to my room and called the front desk, no answer, bell desk no answer, we tried every extension and there was no answer? What the f%$? Where are these people? This is supposed to be a full service resort. Now my friends are already frustrated because we had to walk back, but now they have no ride back to the Tapatio Cliffs Resort.", "title": "Fab time in Phoenix at Squaw Peak", "helpfulness": 1, "user": "traci_9", "date": "March 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25831893}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I called the front desk AGAIN and the manager on duty was useless. I finally talked to a bellman (10:30pm) and he tells us the shuttle doesn’t run this late and is not guaranteed and we should have called earlier. Are you kidding me? We started calling at 9pm……..So I had to call them a cab.", "title": "Bad experience", "helpfulness": 2, "user": "hickorypete", "date": "March 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 25634080}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This is a well-maintained property, which is what I come to expect from Hilton. Nicely renovated rooms and the complex is great. The staff are very helpful and friendly. This hotel is located next to one of the best Italian restaurants I've ever been too.", "title": "Nice property in a good area", "user": "Mark F", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123267038}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Not sure why anyone would have a problem with this place - it is a great property and in a very good location. It is large and spread out..........so what!! There is plenty of parking and if you are in a casita the parking is right outside your door. The on-site restaurant, Rico's, is a very nice place - good food, nice bar with local beer on tap, friendly staff, reasonable prices. I would definitely stay here again.", "title": "very nice resort", "helpfulness": 1, "user": "BPisReady", "date": "January 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123187822}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We stayed here following a three week tour of the States and it was the perfect end to a perfect holiday. The hotel really had thought of every little details and the adjoining waterpark was superb - would love to go back one day.........", "title": "Fantastic!", "user": "Barbers26", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123178337}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The rooms are nice, the staff is nice, but I resent paying extra for wifi in addition to the premium room rate. And after I did pay the daily fee, it only worked for one device - my spouse was not able to connect his laptop. The restaurants on site are....average. One was closed, and the other was blah.", "title": "just ok", "helpfulness": 2, "user": "wenjor", "date": "January 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122978324}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "My total experience on a one night stay was excellent! I was upgraded to a casita which was very spacious and comfortable. I decided to order room servce because I needed to get some work done in my room. The food was delivered promptly and it was excellent! I ordered a rib eye steak which was prepared perfectly and the caeser salad was very good.", "title": "A great resort with truly excellent service!", "helpfulness": 1, "user": "champagnecaviar", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122975535}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "I'm with the reviewer from Delaware (12/26/05); this place looks a lot better on the website than it does in person. I'm pretty much in overall agreement with that reviewer's comments.", "title": "Not recommended", "helpfulness": 11, "user": "Buben", "date": "March 6, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4588099}, {"rating": 4.0, "title": "Great stay over holiday weekend", "text": "The rooms are dark and average (ours smelled so strongly of room freshener it was nauseating). The decor is standard Hilton hotel room; nothing imaginative or interesting. If you came with kids, you'd probably appreciate the pools and activities. We don't have kids, and aren't really into the Disney-themed plastic decoration (including a fake old western town store front theme). I thought the price of $200 per night was pretty high for what you got.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 24, 2006", "id": 4500340}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The spa is, in my opinion, very misleadingly described as one of the 10 best in Arizona. I don't know what list they are working with, but I can't imagine that is the case. I booked a $165 massage. The massage itself (by Ron) was quite good. But for that kind of money, there's usually a pretty nice spa experience that goes along with it. In this case, I checked in, and the girl at the counter didn't even offer to take me to a locker room and give me a robe! I had to ask for that. The locker rooms are your regular gym-type locker room. There is a co-ed steam room and sauna. No whirlpool. After I saw a man in the steam room stretching his hamstrings in full workout gear (including gym shoes), I wouldn't have gone in the steam room if you paid me! The showers are badly in need of an overhaul -- mildewed, no water pressure. The waiting room is basically on a sofa in the beauty salon -- strong smell of nail varnish. During the massage, the table rocked throughout (it needed some sort of repair), and everytime water turned on in the hair salon you heard it loudly.", "title": "Great family hotel!", "helpfulness": 17, "user": "nville4", "date": "January 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4385968}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "One nice place to hike -- the Phoenix Mountain Park (east on Glendale past Highway 51). Great nice hikes -- although you have to drive about 10 minutes to get there.", "title": "Great Place For Families", "helpfulness": 41, "user": "LOVEMARCO", "date": "January 19, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 4365135}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The Aunt Chiladas place was a good place to grab a bite. The Coffee Plantation (near intersection of Glendale and 16th) was also nice.", "title": "Very nice family hotel", "helpfulness": 22, "user": "pdxgal63", "date": "January 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 4324952}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Slight problem with the reservation. When we called in March the week before we were to arrive, they told us that our reservation change (Made in December) was not listed anywhere in their files. The reservations agent was pleasant, but said he couldnt change the reservation and we would have to check out a day earlier than planned. Since this was a reward trip, we were upset but just had him book a room for one night in Sedona (since we were going there anyway)", "title": "Great time, excellent amenities", "helpfulness": 18, "user": "Statmans", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5030703}, {"rating": 4.0, "title": "Enjoyable Family Stay", "text": "My wife checked in on Monday afternoon with the kids. She asked for and got an upgrade to a casita. She asked when we were checking out, and they had the change in place (Magic?). She didn't say a word, just cancelled the Sedona reservation.", "helpfulness": 14, "user": "Kalena-Travels", "date": "April 15, 2006", "id": 4975168}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I arrived in the evening and was very impressed with the Casita. The ground floor had a full kitchen and dinning room, half bath plus a living room with fold out bed and TV. You walk upstairs to a bedroom and full bath, with a private balcony off of the bedroom.", "title": "Great Family Resort", "helpfulness": 12, "user": "ljayglover", "date": "April 13, 2006", "detail_rating": {"value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4971023}, {"rating": 1.0, "title": "Don't Stay here!!!", "text": "While we did have a car, I dont understand why previous posters said there was nothing within walking distance other than Aunt Chilada's. There was a strip shopping center just across the street with a chinese carryout and some sort of sports bar. 1/2 mile away was a drug strore/liquor store and across the street from that was a supermarket.", "helpfulness": 14, "user": "binkymom", "date": "April 5, 2006", "id": 4939532}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The kids enjoyed the lazy river, tubes and minature golf. We ended up buying the resort package, although the golf would have been free since we were diamond level, but I was sending and receiving large faxes and it made doing this more economical. Both restaurants were open. No complaints about the food.", "title": "Absolutely Wonderful!!!!", "helpfulness": 14, "user": "koalalover", "date": "April 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4933521}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My wife and I stayed here after spending a week with friends at their vacation home in Rimrock, AZ as a sort of break from the previous week to have some or our own time in together. We booked this hotel based upon the fantastic pictures of the resort pools, the lazy river, and the Hole in the Wall BBQ restaurant on the property. First off, the Hole in the Wall wasn't even open. In fact, the entire place was a ghost town. Perhaps because it was the week before Thanksgiving and most folks are just getting ready to go away for the holidays, but it was D-E-A-D.", "title": "Ok, Nothing Special", "helpfulness": 2, "user": "ardmoreflyer", "date": "February 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 151693703}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I believe you have to pay extra to use the massive resort pool with the waterfall, slides, miniature golf, etc. The first day we were at the pool, there were a couple handfuls of people. The second day we went to that pool, there was about 5 people, including us. The slide wasn't in operation on either day. I noticed a lot of seat cushions that were dirty throughout the pool area. A couple people at the entrace to the resort pool area were none too friendly. They ask you how many towels you need when you enter the pool area and when we were slow to respond, they asked again in a louder tone. I don't appreciate that kind of thing when I'm paying money for something. Not to mention that tere was practically nobody there but they acted like they had never seen me before each time I came back inside. Also, we felt like there was way too much security at this resort, particularly in the pool area. The hotel is in a rather nice neighborhood, what's up with a security guy on the property walking around with a badge? Really? Guess what....people PAY to visit resorts like this because they want to relax and have a good time, not feel like someone is watching over them. I found that extremely distubring. We don't like to be eyeballed.", "title": "GREAT HOTEL GREAT SERVICE", "helpfulness": 1, "user": "sedona2003", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151531233}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The property itself is quite beautiful. We loved the landscaping. There were two other, smaller pools closer to the main buildings of the property. Both had swim-up bars. Neither were open. The pool nearest our room was the most happening area. Every night there were couples, singles, and families sitting in the hot tub. Other than that, the place was like a library sans a few business travelers.", "title": "Great Staff, Campus, Rooms", "helpfulness": 2, "user": "KosherConsultant", "date": "January 27, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150709936}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "We went to dinner one night at Rico's, which was ok. Our server was nice but super slow. We went on bourbon night and had the bourbon n burger special. It was awesome.", "title": "Way better than expected!", "helpfulness": 4, "user": "Steve L", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150697364}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We've stayed all over the country and at many Waldorf Properties and outside of one in Boca Raton I have never seen uniformed security officers. Kind of ridiculous. As if the hotel was bordering a bad part of town or something. While the property is huge and the architecture of the older buildings is quite nice and the landscaping is great, we would not stay at this place again. There are much better places to stay......take my word for it.", "title": "The Casitas by the small pool are the best of everything", "helpfulness": 4, "user": "Geojourneyman", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150490987}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "While this property has been around a while, it is extremely well maintained and we had fantastic service from the staff at this Hilton property. We took a baseball team to this property - and everyone had a wonderful time. Overall layout and facilities are very good.", "title": "Excellent Staff - great service", "helpfulness": 1, "user": "Dan S", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150488813}, {"rating": 2.0, "title": "Watch what they say online about rates and discounts.", "text": "The hotel was fine. However, it was very confusing to find our way around initially. The map the front desk gave was confusing. I actually had to ask Security to find my room. However, my real complaint is that when I booked online they gave me a rate and check-out time (AARP benefit). Once checked in, they totally denied there was an AARP check-out time benefit.", "helpfulness": 3, "user": "Kenneth R", "date": "January 24, 2013", "id": 150463306}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My husband and I have stayed here on 3 separate occasions. Each time was great. It is quiet and spacious. There are various pools and restaurants on-site. The staff was always very helpful if we needed information on getting somewhere or about attending a pre-season baseball game. (Hint: check it out online as the tickets are very reasonably priced). When you go, be sure to take in the Japanese Gardens in downtown Phoenix…beautiful and peaceful. Also have a prickly pear margarita; quench your thirst and are very good.", "title": "Wonderful and relaxing", "helpfulness": 1, "user": "SWEETND", "date": "January 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150386068}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "This was a fun resort to stay at with children. There is a neat Lazy River, waterslide & mini golf. The rooms were good & you could also have casita where you were able to eat in if you preferred. There was a sitting area as well as a bedroom which is nice when you are travelling with small children.", "title": "Fun resort", "helpfulness": 2, "user": "lorpar", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150377765}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My son and I stayed here for 2 nights in a King suite and it was more than enough room. Nice front sitting room with a pull out sofa bed, large tv and refrigerator. Separate vanity and shower which was nice so one person could get ready while the facilities were in use. Then the bedroom had two queen beds that were very comfortable, large tv and closet with a light and full length mirror. The staff is very pleasant and helpful. I wish we could have stayed longer to enjoy the pool and other amenities. Guess that means we will have to come back :). Great place!!", "title": "Comfortable and Spacious", "helpfulness": 1, "user": "surgteck05", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150232218}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "This is the second time I have stayed here at the Pointe Hilton Squaw Peak. The first time was last year and the experience was not quite up to the hype. Unfortunately, things have not gotten much better, and I will probably never return again.", "title": "Not Quite A Resort Experience ... Somewhat Disappointing!", "helpfulness": 2, "user": "ccollman", "date": "May 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 31188626}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "Decided to take my wife the first night to celebrate our anniversary, then have our children join us the second night and go to the River Ranch (the waterpark).", "title": "My King Casita Upgrade, better than a standard King room", "helpfulness": 5, "user": "TeamKaeru", "date": "May 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29908122}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "I had made arrangements for an early check-in at 1:00pm. Upon our arrival at 1:00pm, only the King bedroom part of the two-bedroom, two-story casita was ready, and I was told that we could check-in to that part, then when the rest of it was ready, the hotel would bring over the new room keys. We waited until 4:00pm with no word and no keys. I then walked back over to the front desk, only to be told by another front desk clerk that she didn't know if the rest of our casita was ready yet or not, and she would have to call and find out. I waited in the lobby nearly fifteen minutes while someone went to the casita and checked. Apparently, it had been done earlier and nobody told us or brought us the new keys. Strike One.", "title": "Wish I would have saved my money", "helpfulness": 3, "user": "TRIXIE0880", "date": "May 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 29423234}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "While waiting in the lobby, I called room service and ordered dinner to be delivered to the room as a nice suprise for my wife. I ordered one filet, one salmon and a bottle of Pinot Grigio. After returning to the room, I received a call from room service stating that they were out of salmon and would I like to make another choice. Out of Salmon at 4:00pm on a Thursday??? Whatever. So I ordered two filets. Delivery was scheduled for 7:45pm.", "title": "Great family resort", "user": "biggBuffalo", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 28692678}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "My wife and I had a 6:00pm appointment for a couples massage at the Tocasierra Spa. Upon our arrival, we were greeted with signs that said that the air conditioning was broken (late-May in Phoenix ... 102 degrees for a high that day) and they apologized for any inconvenience. We asked to see the actual therapy room first, and while it was a bit warm and the fans were very noisy, which drowned out the background music, the massages were very good. 50 minute couples massage ... $200 plus gratuity. The men's locker room was a mess, though, with old wet towels all over the floor and trash overflowing in the waste paper cans.", "title": "Family fun in Phoenix", "helpfulness": 1, "user": "madkapl", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28657716}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Pointe Hilton Squaw Peak Resort was just what we needed for relaxation by the pool. The grounds are beautifully landscaped and lounge chairs in the main area around the lazy river, main pool, sport pool and water slide are plentiful with umbrellas and little places to tuck yourself away if you get there early to claim the spot you want. We had wonderful breakfasts each morning at the Hole in the Wall Grille. We recommend the Chorizo with scrambled eggs if you like spicy food at all. The American breakfast was also good especially if you have a big appetite. We were pleasantly surprised because we had read negative reviews about the food but we found it delicious. The service was friendly and accommodating. Tasty Indian Fry bread is included too-- each morning we ordered from the menu so we didn't try the buffet but other people commented that it was good as well. It's definitely a resort set up for families but it was relaxing for us to watch when we weren't floating in the lazy river which gently propels the inner tubes along an interesting route which includes an in-pool fountain. Bottom line-- we would go back. The only real negative was lack of internet service in our building AND our cell phones got no reception. More bars -- there were Not. We met other guests who like us had to go out into the parking lot to get any reception at all-- we laughed about it-- but it was annoying and for emergencies one would be out of luck.", "title": "Fine stay at Pointe Hilton Squaw Peak Resort", "helpfulness": 3, "user": "1stFour", "date": "April 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 28527624}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Also if you wanted to go cashless you could charge everything to your room at this resort which is handy when staying at the pool area most of the day.", "title": "Nice family place.", "helpfulness": 1, "user": "osu8993", "date": "April 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28524468}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We went to a Coyotes Ice Hockey game and what a great family event that was!", "title": "Disappointing", "helpfulness": 3, "user": "Eiregirl", "date": "April 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28296084}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Cannot understand any overall bad reviews on this place. It is a clean, family-friendly resort that is in a good location. I would go back or recommend this as a place to stay when traveling Arizona. Please read the following observations.", "title": "Excellent Family Hotel, Except for Food Choices", "helpfulness": 2, "user": "Coolfallday", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28210970}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Pool: Beautiful grounds. Nice space for a family. Lazy river was a good size and kids enjoyed water slide. Main pool was 2.5-3.5 ft in depth. Sports pool was 4 ft depth. Pool by room was 2-6 ft. Main pool was crowded at times; however, we were there during week before Easter. Pool temperature could have been warmer but kids still had good time.", "title": "Great for families", "helpfulness": 3, "user": "MichiganMomof3", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 28100091}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Have attended a meeting here several times in the last 8 years. Sleeping rooms are spacious and nicely equipped; meeting facilities are good. The grounds are lovely which I found helped with the meeting rather than detracted from it. Staff friendly and helpful.", "title": "Good place for a meeting", "helpfulness": 1, "user": "JMJ630", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150207509}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Was there when the weather was unseasonably cold, but the rooms stayed warm and comfortable.", "title": "December at Squaw Peak", "helpfulness": 3, "user": "FamilyGoldstream", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150039920}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The only downside is a fairly small choice of eating facilities on site - with reduced menus from when we were last there, and room service is not brilliant.", "title": "Nice meeting location", "user": "Michelle W", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150016658}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Our family of 6 stayed at this resort for Christmas. We had a two bedroom casita and a studio king just around the corner. The rooms were clean and spacious. Our goal was to have a room to relax and enjoy the holiday with the family. We did just that and enjoyed swimming pools, tennis, mini golf, and the restaraunts at the property. The staff was very helpful providing restaraunt suggestions for our trips around the area. The Concierge Manager, David, was most helpful in making our holiday vacation special. The Valet, Colton, helped us with family photo's and was always fun to talk with. The two bedroom 2.5 bath casita met our expectations. The living room area allowed the family to spend time together as we had hoped. The weather was cool however with an open schedule we were able to enjoy the pool when the sun came out.", "title": "Amazing service....", "helpfulness": 1, "user": "TravellingMan999", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 149995850}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I recently attended a meeting at this facility. It is a huge place with several different sections for lodging and meeting rooms. Be sure to bring good walking shoes! The weather was unseasonably cold, but we still enjoyed walking around the area. They have beautiful landscaping throughout with ponds and pools. A big perk is the fabulous spa right next door. Superb massage!! There are also excellent restaurants within walking distant. Nice place for family stays and business meetings, too.", "title": "A great resort for families", "user": "kdt1972", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149684700}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed overnight on a stopover to Vegas, after checking in and opneing our luggage we found out that the room had not been cleaned in ages, as we opened the sofa bed there was mouse crap on the sheets and yellow stains which we deducted were the same mouse-mice urine.", "title": "Just one night", "helpfulness": 1, "user": "JGL78", "date": "January 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 122608359}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "After calling the front desk they apologized and changed us to another room.", "title": "Wonderful", "helpfulness": 2, "user": "Eveleigh", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121746178}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "Service was very good in the breakfast restaurant on front side of the hotel.", "title": "Awful casitas AVOID", "helpfulness": 2, "user": "rrlondon500", "date": "December 12, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 121664333}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Hotel has lot of great facilities however it seems updated and lacking basic maintainance such as good cleaning.", "title": "The place to stay with kids!", "helpfulness": 4, "user": "mary t", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121559392}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Great rooms, quiet, lots of parking, great staff, awesome pool area (closed a little too early), nothing bad to say. I can't imagine why anyone would rate this hotel less than very good. It's a fairly large property but anyone could walk from one end to the other in less than 10min (most people 5). Clean, didn't see any garbage or mess anywhere on the grounds. I've stayed in better, but not much.", "title": "Beautiful resort , everything you want.", "helpfulness": 2, "user": "rmfVancouver", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 121536528}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The Pointe Hilton Squaw Peak Resort is a must go to!!! The suites are very clean and roomy! The shower was fantastic!!! You should pay more, its a deal!!! Great location!!!", "title": "Great value!!", "helpfulness": 2, "user": "skylane9", "date": "January 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123519230}, {"rating": 2.0, "stay_parameters": "Stayed January 2012", "text": "I came here with my family of four to relax in between visits at a local hospice. The hotel is Impressive from the front and has a nice lobby. I'm an honors member and was offered nothing but a hard sell on paying extra for the use of the lazy river, mini golf and spa and internet is not free. The only reason I picked this resort was so my kids could enjoy the lazy river or mini golf, total bummer... At 25 dollars extra a day I wish I had known.", "title": "Old outdated and a lazy river costs extra", "helpfulness": 11, "user": "LOVEDISNEYLAND", "date": "January 21, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 123402525}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Then our first room was facing a laundry facility or something that was making a huge racket watch out for room 1248. We asked to move and they were kind enough to do so. Next room better but I've stayed in much nicer rooms at a holiday inn. It felt small and dingy. The bathroom is so tight you can't open the door without hitting the toilet so for a family that has to share the space this wasn't ideal.", "title": "Very nice upgrade", "user": "808travler", "date": "January 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123391374}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The location, I don't know but it looked like we were in a business park? No where to eat so we ended up paying too much for room service. The food was subpar and I got severe food poisoning all night... Don't eat the wings or club sandwich.", "title": "Terrific Family Hotel", "helpfulness": 1, "user": "NBere", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123325189}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "All in all just a so so place, I wouldn't stay here again. Save your money and go somewhere else if you want a true resort experience.", "title": "Kind of disappointing", "user": "Winifred N", "date": "January 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123324263}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 103, "average": 241, "very good": 486, "terrible": 55, "excellent": 469}, "aka": "Pointe Hilton Squaw Peak Hotel Phoenix", "slim_ranking": 0.310734463277, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Nestled into the slopes of the Phoenix North Mountains with a Spanish-Mediterranean design, the Pointe Hilton Squaw Peak Resort offers one of the most unique Southwestern experiences in the country. Located on 27 acres, the property is bordered by 3,000 acres of scenic Sonoran desert in the adjacent mountain preserve and features 563 all-suite accommodations, including nearly 80 large casitas. The Pointe Hilton Squaw Peak Resort, known for its family-friendly experience, offers several outdoor activities and features the River Ranch with four acres of shimmering pools, cascading waterfalls, tennis and basketball courts and the Coyote Camp, the resort's lively kids' center. Additional highlights include unique dining experiences at Rico's American Grill and Hole-in-the-Wall, and luxurious services at its fitness centre and Tocasierra Spa and Salon."}