{"user_rating": 4.5, "review_count": 232, "name": "Pointe Santo de Sanibel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We just returned from a week at Pointe Santo and were quite disappointed. The pictures on the internet are deceiving and the complex is quite old. The unit we rented was \"ocean front\" but a dump. In addition, one of the ladies that runs the clubhouse need to find a broom and fly away - she hates kids and has no business running the kids program. My advice to those that are considering this condo complex, is to ask specifically what updates have been done and when they were done.", "title": "Be Careful!!!", "helpfulness": 3, "user": "tmlowe", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 17005691, "likes": {"liked": "— Outdated, dirty unit and mean lady at the clubhouse"}}, {"rating": 5.0, "title": "A Perfect Vacation", "text": "This was our 2nd time at Pointe Santo and we're looking forward to the next. We stayed in unit D26 and had wonderful views of the gulf, pool and lagoon. There was a small alligator and an anhinga keep us company most mornings. The Condo was was spotless and perfect for our vacation.", "helpfulness": 2, "user": "fingerstyle", "date": "May 12, 2008", "id": 15949133}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Pointe Santo is a large complex but it never felt crowded. There are amenities for all age groups. An hour a day is set aside for \"adult swim\" -no kids in the pool. A nice touch.", "title": "Absolutly the best view on the island", "user": "dlind", "date": "May 12, 2008", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "business": 5.0, "rooms": 5.0}, "id": 15947264, "likes": {"liked": "— ocean view and cleanliness, decor.", "disliked": "— no see ums, but they are everywhere so moot point"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Besides the beach and it's shells the condo was within walking distance of the Bailey Tract and Bailey's store, home to a terrific bakery. The Sanibel bike path is across the street.", "title": "A Smidge Dissapointing", "helpfulness": 2, "user": "ZannyInMaine", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 15642438}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "There is no downside to Pointe Santo and our stay in D26 was perfect. Next time -2 weeks.", "title": "Pointe Santo de Sanibel is the BEST!!!", "user": "jj48", "date": "April 30, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 15513901, "likes": {"liked": "— very clean and updated", "disliked": "— n/a"}}, {"rating": 2.0, "title": "Not so nice", "text": "The beach is average. The condo was average. Spent the last 3 days of our vacation with workers removing/ laying new tile and adding new cabinets to the condo above ours. As a result-- noise was a big problem. The condo was not well cleaned when we checked in. The lagoon seemed dirty ---like the gas grills which were caked with months worth of grease. Will not return.", "helpfulness": 7, "user": "reviewNewJersey", "date": "August 13, 2007", "id": 8406199}, {"rating": 5.0, "title": "Been coming to Point Santo for several years, from Indiana!", "text": "I have not stayed at any other complex and probably never will. I can say without a doubt, that each time I have stayed, it is by far the best vacation that I have ever had. I have recommended Pointe Santo to individuals that I work with. None of us have had anything to say but outstanding!!!! I personally have stayed in B46 the year prior to the hurricane and D47 May 2006 & 2007 and will return in 2008. My very first vacation to Sanibel was in 2002, in the 'D' building. I haven't had any regrets, complaints or concerns and I am looking forward to my next visit. The grounds are maintained beautifully! Yes, there was the algae on the beach, (2007), during some of my stay and yes it stunk but the complex and the city are working on this, they don't want this to effect the tourism. The islands are beautiful and there are numerous places to eat. I recommend Doc Fords and Keylime Bistro. Watch the sunset, sit and enjoy the quiet of the evening or the laughter of other guests. But, if you don't like the heat, humidity and no-seeums, you will not enjoy what Sanibel and Captiva have to offer during the warm weather (summer) months = plan accordingly.", "helpfulness": 4, "user": "eerrooss", "date": "August 3, 2007", "id": 8289312}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "As I stated previously, I have recommended Point Santo to others and I am a definite vacation advocate of Sanibel Island!", "title": "We Loved Pointe Santo", "helpfulness": 6, "user": "venicefloridamom", "date": "July 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8248611}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We booked through Royal Shell, which went very smoothly, and had a wonderfully relaxing time in D31. We were still very close to the beach, despite being almost as far away as you can get from the gulf in the Pointe Santo complex. Our condo was clean, spacious and nicely decorated. The free wireless interet worked in our condo without a hitch. The location, close to Tarpon Bay Dr, was very convenient to shopping and restaurants.", "title": "Pointe Santo, phenomenal family vacation, beautiful, better than expected", "helpfulness": 8, "user": "pewaukeefamily", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7472366, "likes": {"liked": "— The beautiful grounds and condos, lagoon, beach, everything~", "disliked": "— wish there was a larger pool that was zero depth"}}, {"rating": 3.0, "title": "Family w/ kids review of PS #E4- Some rough edges", "text": "The clubhouse activities were a big hit with the kids. The grounds were very nicely maintained. Several barbeque areas around the lake were all used by residents/visitors, and were covered up every night. There was even a shell-washing station with a large shell-identification display so that you could clean and identify your finds before heading back inside.", "helpfulness": 11, "user": "bestestes", "date": "February 5, 2007", "id": 6748394}, {"rating": 4.0, "title": "Sanibel Vacation", "text": "We just returned from a spending a week on Sanibel Island at Pointe Santo.", "helpfulness": 5, "user": "SuzyQ213", "date": "January 6, 2008", "id": 12384647}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "This is our 10th time staying here and I must say that the condo we just left, B2, was one of the best! So well equipped and comfortable! All updated with plenty of conveniences.", "title": "E31 - Great Condo", "helpfulness": 5, "user": "Steve_Blueyonder", "date": "November 15, 2007", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "business": 5.0, "rooms": 5.0}, "id": 10839534, "likes": {"liked": "— Comfortable, clean, well equipped, everything worked", "disliked": "— there was nothing I didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We love travelling to Sanibel since the beaches and shelling are superb! The sunsets are exquisite! My husband and 2 sons enjoy the fishing excursions and I love the shopping!", "title": "nothing better", "helpfulness": 1, "user": "toolmstr1", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10039145, "likes": {"liked": "— jjust well kept", "disliked": "— not enough time to just relaxe"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Usually we have day after day of sunny, beautiful weather, however, this year there was a record cold snap!", "title": "Not Happy!!", "helpfulness": 4, "user": "letsgothere_7", "date": "September 4, 2007", "detail_rating": {"cleanliness": 1.0, "location": 2.0, "value": 1.0}, "id": 8653991, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We compromised by shopping, dining and enjoying the nite life!", "title": "Aug 3, 2007. We love Pointe Santo", "helpfulness": 1, "user": "dattman86", "date": "August 22, 2007", "detail_rating": {"business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8470449, "likes": {"liked": "— nothing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We returned yesterday from a great week at Pointe Santo! Our unit A43, was very well maintained, had great views of the gulf and pool lagoon from both the screened porch and rooftop deck, and was extremely spacious. The entire property was lovely. It was a very busy vacation week but the pool policy included an hour each morning and afternoon for adults, which we appreciated. We loved the location as well. It was a very convenient bike ride to Ding Darling Wildlife sanctuary, to Tarpon Bay for kayaking, and the shell covered beach was a great walk in either direction! The Premier Property staff were very helpful with suggestions, a hair dryer to borrow, some flexibility at checkout. It was a great week and we will be sure to be back! We loved Doc Ford's for a casual dinner, and if you want one \"upscale\" dinner we loved the Thistle Lodge.", "title": "Pointe Santo is a great location and property!", "user": "LJSummer", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15453197, "likes": {"liked": "— the great location and the grounds", "disliked": "— sometimes there were a few too many kids!"}}, {"rating": 5.0, "title": "Pointe Santo - an island within an island getaway", "text": "We booked our stay at Pointe Santo B-47 back in April '07 after our first visit to Pointe Santo. We hope to make it a year after year tradition. Pointe Santo has to be one of the best properties on the whole island. It sits smack on the beach. Just walk down the beach and the you'll see that the other complexes just can't compare to this paradise. Our days were filled with relaxation by the pool, playing volleyball each night on the beach and then we'd go back to the unit and up to the private rooftop sundeck for cocktails and appys while watching the sunset into the gulf. The view of the gulf from this unit is simply gorgeous - there just isn't any word to describe it. It far exceeded our expectations. We opened the wall of sliders in the living room that overlook the gulf and welcomed the gulf breeze. Paradise at its best! This unit is an end unit and is one of the nicest we saw (we visited several during both our stays). It was well decorated, very clean, had everything we needed in terms of amenities, plus more, but the view from the unit is what will keep us coming back. The shelling was awesome and dinners were fantastic especially at the Mad Hatter (very romantic), the Island Cow (great food for the whole family), Sanibel Bean for lunch was great, the restaurant inside Jerry's grocery store has to be the island's best kept secret for breakfast, lunch and dinners (very reasonable - great kid's menu and the adult food is very good). Renting bikes was one of the best things we did. We rented them for the week and Finnegan's delivered and picked them up right at Pointe Santo. What a beautiful way to see the island.", "helpfulness": 2, "user": "BeachlvrConnecticut", "date": "April 18, 2008", "id": 15126086}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "What a beautiful property! These condos are the closest to the beach I've ever stayed......we happened to be in Building E, which faces the beach (Bldg. A does too). We booked this through the owner of the condo, who uses Royal Shell agency to complete the booking. When we arrived, the air conditioner wasn't working! BUT, Royal Shell sent a technician IMMEDIATELY on my first call, and kept me posted about the part they needed for repair, etc. They offered to move us, upgrade us, whatever we wanted to do. We loved the property so much, we chose to tough it out for 2 nights without air (which wasn't that bad because it was April, and we opened all doors and windows and used ceiling and floor fans). Royal Shell brought us fans and checked on us and on the third day of our stay, the air was working again. I compliment Royal Shell on their quick service, attention and care for us as their renters. The property was beautiful and well-cared for. I hope I can rent this same condo again (in Building E) because the sand starts about 20 yards from the building! I've never enjoyed a vacation more and a lot of it had to do with the nice property and condo.", "title": "Closest to the Beach I've ever been!", "user": "tell-it-all-girl", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14832135, "likes": {"liked": "— very close to the beach", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This was our first visit to Pointe Santo and our second to the island. The landscaping is beautiful and well maintained. The complex was very quiet and everyone was friendly. I have already made reservations for March 2009. We stayed in C32 which had a beautiful straight-on view of the lagoon/courtyard and the ocean. The only down side was the maintainance of the condo. The condo was clean when we arrived. As the week went on I noticed that the master bath shower had a significant amount of mold on the ceiling, the shower doors in the 2nd bath were off the track, molding in the condo needed a coat of paint to freshen it up, repairs that had been done had not been finished off, ie. a towel rack in the 2nd bath had been moved but the brackets were left on the wall, the toilet paper holder was about to fall off , the top rack of the dishwasher was worn down in several places to where rusty wire was exposed and the worst one was the bird poop/ dead insects that had collected between the outside rail and the screen of the lanai. I called VIP Realty and they immediately sent someone over to fix the shower door and get the model # of the dishwasher. I was told the \"stuff\" on the lanai rails would have to wait until the complex was power washed.This condo definately needs some TLC. As I said, we are going back next year but are staying in a different condo. Aside from the problems I listed, we really had a great vacation. A few more sunny days would have been nice but \"Oh well\".", "title": "Great vacation complex", "helpfulness": 1, "user": "sjmara", "date": "March 20, 2008", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 14418713, "likes": {"liked": "— Complex was very quiet.", "disliked": "— The need for upkeep of the condo."}}, {"rating": 5.0, "title": "Pointe Santo is my favorite on Sanibel", "text": "This was a repeat visit and again was a wonderful stay. The grounds are lovely and the staff friendly. Heated pool is a warm comfortable temperature, which really helps on a cool day.", "user": "handphoto", "date": "March 12, 2008", "id": 14235996}], "location": {"country": "United States"}, "variance": {"poor": 9, "average": 13, "very good": 35, "terrible": 6, "excellent": 169}, "aka": "Pointe Santo De Sanibel Hotel Sanibel Island", "slim_ranking": 0.233333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Pointe Santo de Sanibel is an upscale condominium resort located directly on the Gulf of Mexico. Our family resort features a gulfside pool and whirlpool, a clubhouse, 2 tennis courts, shuffleboard, beach volleyball and a supervised children's program. The grounds feature extensive tropical landscaping along a romantic lagoon crisscrossed by quaint bridges and walkways, Tiki huts and BBQ grills. All individually owned units feature a screenedmlanai with a Gulf view, full kitchens, individually controlled AC, cable & Wi-Fi. Pointe Santo is close to the bike path, \"Ding\" Darling wildlife refuge, theater, restaurants, and golf courses."}