{"user_rating": 4.5, "review_count": 107, "name": "Point of View Suites at Louisbourg Gates", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "As with the previous review, we stayed in an ocean view, 2nd floor room. Found the room to be spacious, comfortable bed & great balcony to sit and relax with the views. One direction is the Fortress of Louisbourg & the other is the lighthouse. We did not eat in the restaurant so cannot comment on the food.", "title": "Good views & great location", "user": "kftw", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46547379}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We reserved a 2nd floor suite with an ocean view after reading reviews of the noisy wood floors. Each 2nd floor suite has its own inside staircase, so it seems very private. The room was beautifully decorated, and had a full kitchen. We enjoyed sitting on our balcony in the deck chairs, and looking out at the Louisbourg Harbor and Fortress. There was plenty of parking off to the side. We didn't eat there, as we used the kitchen instead. I would definitely stay here again.", "title": "Great place", "user": "greecer", "date": "September 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45417966}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Our suite had 2 large beds, but no place to sit other than at a small kitchen table in the kitchen area. The suite was one large room with a small bathroom. The view from the room was lovely, looking out toward old Louisbourg Fortress, but carrying the luggage up a long staircase was not that great.", "title": "Great views, but long staircase.", "helpfulness": 3, "user": "EMTtraveler", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45308374}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Louisbourg itself is rather neat small town, with marvelous history in the Fortress. Spend a day there - it's worth it.", "title": "Clean, new, but odd location", "helpfulness": 3, "user": "travelmom334", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 38107353}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The Point-of-View serves dinner and breakfast for an additional $55/couple. Dinner of snow crab legs were outstanding. Breakfast gave you a choice of eggs, meat, juice and coffee. It was freshly made, but the limited menu precluded our eating there more than one time.", "title": "Spectacular view 300 years in the making", "helpfulness": 1, "user": "ChinookRiver", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 36838164}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We enjoyed our stay here. Great room, excellent location near to the Fortress Visitor Center and a wonderful ocean view including the local lighthouse. Room was really a large hotel room with a kitchen along one wall but very nice. For the price they could have included a roll of paper towels. Would recommend this hotel.", "title": "A Very Nice Hotel", "helpfulness": 1, "user": "califken", "date": "September 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20047381, "likes": {"liked": "— Location and view"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My husband and I stayed at the Points of View Suites for one night at the end of our tour of the Cabot Trail en route to the Fortress of Louisboug. We were very satisfied with the hotel. We paid $125 for a 'suite' which was actually more like a very large hotel room. There was no 'sitting area'. We had a comfortable double bed with a lovely handstitched bedspread. The furniture was obviously brand new and included a table with two chairs, two end tables a large bureau and a writing desk. It also included a coffee maker, mini-fridge and a tv. The entire room was spotless - including the bathroom. In fact it was so clean we assumed the Inn was virtually brand new. We were also impressed with the flooring which was real hard-wood. The bathroom was very big and included a hair-dryer. The tub was large, the water pressure good and we never ran out of hot water. My only complaint was the complementary shower products given were a bit cheap (ie no conditioner or body lotion, no shower cap and the shampoo did not lather well at all).", "title": "Great find close to the Fortress!", "helpfulness": 1, "user": "TravelinDD", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 19667679, "likes": {"liked": "— It was big, bright, clean, spacious and right next to the Fortress of Louisbourg.", "disliked": "— It was a bit pricey for the location."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We were on the second floor with a less than spectactular view of the parking lot, but we did have at least 6 large windows (including one in the bathroom) that let in lots of light and fresh air. The rooms on the backside of the Inn appear to have their own balconys and for a few extra bucks I bet it would be a lovely place to stay. The main facility is right on the water - not open ocean - more of a harbour. We arrived late at night and left early in the morning so we did not have a chance to check out the beach.", "title": "A huge disappointment", "helpfulness": 9, "user": "052706", "date": "August 7, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "location": 2.0, "value": 1.0, "rooms": 1.0}, "id": 18724694, "likes": {"liked": "— The nice server at dinner.", "disliked": "— Too many to list, dirty room, beach, food etc."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "We ate breakfast in the little restaurant - which is not set up like a cafeteria - we sat at a table and a waitress came and took our order. She then delivered it to our table and at the end of the meal presented us with the bill. Not sure where the cafeteria comment comes from in the previous reviewers comments - perhaps they are refering to the buffet - which we missed - but you could see the buffet line they use - but buffets are always set up that way... Regardless, the food was great. Your choice of sausage or bacon served with two eggs and toast for under $4.", "title": "Great place to stay!", "helpfulness": 5, "user": "Fishcat", "date": "October 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5950600}, {"rating": 5.0, "title": "Great location, wonderful hospitality, very comfortable suites", "text": "The location is also fantastic - virtually at the gate to the fortress. The staff was wonderful - true Cape Breton hospitality, both at the front desk and in the restaurant. It is a tad expensive for the area - but I would recommend it and I would personally stay there again.", "helpfulness": 21, "user": "matchtrader", "date": "March 29, 2006", "id": 4771947}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 13, "very good": 26, "terrible": 2, "excellent": 66}, "aka": "Point Of View Suites At Louisbourg Gates Hotel Louisbourg", "slim_ranking": 0.5, "description": "Point of View is perched on the edge of a four acre peninsula that sweeps out to the magnificent Atlantic Ocean. As your hosts to this extraordinary property, we are proud to welcome you with a premier level of service and first-class amenities. We are the only accommodation property in Louisbourg with water frontage and private beach for your relaxation and recreation pleasures. Enjoy retiring at night and waking in the morning to the soothing sounds of the waves on our shore. We look forward to making your visit a memorable experience."}