{"user_rating": 4.0, "review_count": 263, "name": "Point Hotel Taksim", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I stayed at the Point Hotel on business for about one week and really enjoyed it. It is ultra modern. Excellent free internet connections in rooms, quiet and nice location close to Taksim Square and the convention center. The breakfast buffet on the top floor was wonderful. And a KILLER view. Worth stopping in for a bite even if you don't stay at the hotel. It's a little far from the big tourist stops - Hagia Sophia, Blue Mosque, etc. But only about 15 minutes by Taxi and close to the subway. And the Taksim Square area certainly has its own charms. My only complaint was the smoking - elevators, lobbies, everywhere. But, that's unavoidable in Istanbul. Istanbul is a wonderful place to visit and this hotel is a great place. Definitely would stay again.", "title": "Nice and very modern", "helpfulness": 1, "user": "lbmore", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10083771}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We have just spent 3 nights at the Point hotel and having read mixed reviews we were unsure what to expect, however, we were really impressed. The rooms were modern, clean and well cared for and looked just like the pictures on the website. There were nice touches e.g. free internet usage, slippers, dressing gowns, chocolates on your pillow. Breakfast was great with a good variety and great views. We also had excellent service throughout our stay and found all the staff very attentive. The hotel is a good walk from the old town, but very near to the main shopping/eating area which was very lively and we thought was great.", "title": "Great hotel", "helpfulness": 2, "user": "DINKYtraveller30", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10076428, "likes": {"liked": "— Modern rooms", "disliked": "— Distance from old town"}}, {"rating": 4.0, "title": "very good choice", "text": "I stayed at Point a four months ago on a business trip to Istanbul and was very pleased with my choice.", "helpfulness": 5, "user": "diakos", "date": "October 2, 2007", "id": 10030938}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 5, "variance": {"poor": 12, "average": 38, "very good": 118, "terrible": 7, "excellent": 88}, "aka": "Point Hotel Istanbul", "slim_ranking": 0.249708284714, "description": "Point Hotel Taksim is located within walking minutes to Lutfi Kirdar Congress Center (ICEC) and Taksim square which has a lot of shopping and nightlife opportunities. Also very short driving distance (4 km) to Old Town, where the main historical sightseeing places such as Hagia Sofia, The Blue Mosque, Topkapi Palace, etc. are located. Being the first design hotel in Istanbul with a magnificent architecture and interior design, Point Hotel will make your stay a tasteful one. Our rooms and all the general areas in the hotel provide 1 GB internet access which is free of charge. Also, our guests can benefit from Point Spa which is also free of charge and which includes an indoor pool, Turkish bath, sauna, steam room and fitness room. Our View Point Restaurant has a unique Bosphorus view and every Thursday night there is a scheduled Tango entertainment which guests can also participate. On the ground floor Point Hotel Taksim has a high quality Japanese Restaurant called Udonya which has a lot of repeating Japanese guests throughout the year."}