{"user_rating": 4.0, "review_count": 1139, "name": "Pointe Hilton Tapatio Cliffs Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This was an OK hotel, set into a picturesque setting but still convenient to other places. My husband and I travel often, usually preferring to stay in higher end hotels because of comfort and service and high quality restaurants. We are Hilton honors travelers, gold level. I think calling this one a \"resort\" is stretching it. I thought the rooms were small and not especially nicely appointed. The air conditioning, as mentioned by others, would not cool the room. And, the vents are up above the doorways, so they blow directly on the bed and couch. I thought the cabanas at the pool were a nice option, but the water slide wasn't open most of the time we were there. Service by the f&b attendants at the pool was spotty. Had a really nice gift shop with an unusually large variety of items, not just the usual things.", "title": "OK, but nothing special", "user": "KCinKCK", "date": "October 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 45584334}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I, too, find it ridiculous that Hilton charges for internet usage. Just because other hotels do doesn't mean it is OK. If Motel 6 can provide free internet, Hilton should be able to also.", "title": "perfect", "helpfulness": 1, "user": "peggy34bc", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43463062}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Unfortunately, it was \"restaurant week\" in town when we were there, so the Different Pointe of View was extremely crowded with people looking for bargain food. And, they had a weird menu to accommodate those people--part prix fixe and part not. My companions ordered from this prix fixe portion of the menu and all thought it was terrible (we all eat out at high end restaurants often). I ordered from the non-prix fixe portion and my food was very good. Breakfast in Pointe in Tyme was good but expensive, and service was very slow.", "title": "Limited", "user": "melsuu", "date": "September 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 39508455}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed at this resort for a week and couldn't have been more pleased.The one bedroom suite was perfect.We were in building 4 on the 4th floor.No one seemed to use the little pool near us so it was basically our private pool.The resort was big and spread out like alittle village.We had a great dinner at pointe in time one night.We fould it a great location with easy acess to grocery stores,restaurants and the freeways.Parking was abit tight on the weekend but no problem during the week.We got a really great package with Alligiante air and used the resort as a home base to explore the area. The staff were very helpful and friendly. We wouldn't hesitate to go back.Thanksfor a great Arizona holiday.", "title": "Can't fault it for the price we paid", "helpfulness": 1, "user": "Woods49", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39146874}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We did the \"pay $109 a night and get $50.00 food and beverage credit.\" What they don't tell you is you can only use it for non-alcoholic beverages. Cleaning service was knocking on our door at 8:30 a.m. to clean our rooms. The Mexican food restaurant was very univiting and the staff was inadequate and rude. However, Point in Thyme was excellent - food was superb and staff was excellent. The rooms were nice and there is a Starbucks in the lobby. However, for a \"resort\" atmosphere, I didn't feel like I was at a resort.", "title": "We liked it", "user": "pbpman", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38553008}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Last year in Feb., we stayed at the Hilton in Cabo San Lucas and I must admit, when we arrived at the Tapatio, we were extremely disappointed. For the same price per night, you cannot even compare the hotels. First, we arrived early on a Thursday and were informed that our room would not be ready until 4 pm. We basically wasted the first day of our trip (and the best weather day) waiting in the lobby for our room to be ready, even though we were told it would be ready by noon. The front desk staff was rude and sarcastic, which made matters worse. I have never had that problem at a Hilton. While we were waiting, we ate at the outdoor cafe, Cascades, and the food was horrible--stay away from the fish tacos which were merely fried pieces of crunchy batter. The rooms need to be updated and they were pretty drab--old couches and furniture--nothing fancy. The bed, however, was comfortable. The housecleaning servce leaves a lot to be desired. Finally, there is nothing to do at the hotel and they are pretty stingy with any kind of shuttle service. We rented a car for the day just to get off the grounds. On the plus side, there are pools and spas all over which are nice, although most of the lounge chairs are uncomfortable and do not have cushions. They also pass out regular, scratchy, non absorbent towels and not plush beach towels at the pool. There is an exercise room which is average-a few machines. The Point In Thyme restaurant was nice and room service was good. We did not eat at the Mexican restaurant. The Spa was nice and the body wrap was a nice experience but the Spa was definitely average and the place and the rooms were small. The view from our room was really pretty, we stayed in building 8 on the second floor and we overlooked the Falls village. We actually did not mind the walk around the resort but a resort shuttle is available. I am not a spoiled princess by any means but for the price we payed, 279.00/night, I definitely expected more luxury. I stayed at a Hilton in New Orleans, post Katrina, for 99$ a night and had more comfort. We also recently stayed at a Hilton in San Francisco for $119 a night and had a lot more luxury and comfort. The reviews on this hotel are mixed and I can see why and I am generally easy to please. I would not stay at this Hilton again, I also have a friend that stayed and felt the same way. Good Luck!", "title": "Not Up To Hilton Standards", "helpfulness": 2, "user": "historyteacher", "date": "March 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 6898972, "likes": {"liked": "— Lots of pools and spas", "disliked": "— Rooms were drab and service was unacceptable"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "We just returned from a five-day stay at Tapatio Cliffs. We booked the hotel largely on the basis of positive Trip Advisor reviews, and were not disappointed.", "title": "Excellent Experience!", "helpfulness": 5, "user": "GreybeardCanuck", "date": "February 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6837904}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The resort is set out, as noted in other reviews, over 65 acres and is a series of two to four story buildings. All of the rooms are suites (I believe) and have spacious balconies. The suite we had featured a large living room with full-sized couch, TV, mini-bar, arm chair and desk. There were double doors that lead to a divided bathroom, then a sliding door through to the bedroom. This worked very well in terms of providing an environment in which I could work and my wife could sleep undisturbed. The room was clean and well appointed, and featured a comfortable king-size bed and a second TV. The resort also has a large water park with several pools spread over the property.", "title": "Highly recommended", "helpfulness": 3, "user": "iloveolives", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6714892, "likes": {"liked": "— Very quiet comfortable rooms", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "We booked the \"romance package\" for $219 a night - this included a full breakfast for each of us (valued up to $44 combined), bottle of champagne, a two for one coupon for dinner and free use of the workout room (normally $10). A very good value compared to other prices we noted for similar hotels.", "title": "Loved it!", "helpfulness": 2, "user": "travelfille", "date": "January 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6700346, "likes": {"liked": "— Cleanliness, spacious rooms, views, room layout", "disliked": "— Internet access was unstable, lack of lighting seemed unsafe"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The resort is in the northern part of Phoenix (25 min. drive to airport) and is built on a rocky bluff, so some of the rooms are a bit of a hike, although staff will pick you up and shuttle you anywhere you wish to go in the resort.", "title": "Tapatio Cliffs Wonderful!", "helpfulness": 2, "user": "TravelEscape", "date": "January 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6640137, "likes": {"liked": "— The mountain view; The professionalism with friendliness", "disliked": "— Distance to shopping and museums"}}, {"rating": 2.0, "title": "Not all rooms are up to par", "text": "I am a regular guest at Hilton-family properties, and although there were some nice aspects of my Mar 27th stay, it was hardly worth the price paid.", "helpfulness": 1, "user": "wynsnob", "date": "March 28, 2007", "id": 7237938}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Good points: very friendly staff, and terrific restaurant", "title": "Great Place to Stay", "user": "MyTravelLog", "date": "March 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7171397}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Bad points: the room was dated - old rundown furniture, warped bathtub, stained bedding. I was only offered a double-queen suite in the main building, which seems to be the issue - apparently there are much better rooms available - so be careful when making arrangements.", "title": "Exceptional!", "helpfulness": 1, "user": "whosyer12", "date": "March 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7165145}, {"rating": 5.0, "title": "Great place to stay.", "text": "Overall, I've had much better accomodations at Embassy Suites and Doubletrees in the hilton family. Next time, I would stay elsewhere in the area, and just drive over to dine at the Different Pointe of View restaurant.", "helpfulness": 2, "user": "IndianaJackie", "date": "March 8, 2007", "id": 6935443}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I stayed at Tapatio Cliffs while attending a conference at the resort earlier this month. The front desk staff was courteous and check-in was a breeze. I was actually able to check-in earlier than the normal time. Although the grounds are immaculate, they can be difficult to navigate; however, the hotel does offer shuttle service to get around the complex. The hotel isn't situated close to anything so I would highly recommend renting a car during your stay. Although not widely advertised, the hotel does shuttle guests to the mall (the shuttle leaves at 11:30am and returns around 3:30pm). I dined at the Different Pointe of View restaurant which was fabulous with a view to die for. Reservations are recommended especially if dining around sunset. Keep in mind that this restaurant isn't for the budget minded diner. There is also a lounge on the first level with live entertainment. I also ate at the Pointe in Tyme restaurant which had great food at a reasonable price. All in all I truly enjoyed my stay.", "title": "Definitely recommend", "helpfulness": 2, "user": "tripmomSanDiego", "date": "March 6, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 6919441, "likes": {"liked": "— The room set up.", "disliked": "— The noise from the upstairs plumbing."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "We recently completed 4 days at the Tapatio Cliffs Resort. It is a great place to stay with stunning views over Phoenix.", "title": "Great Hotel and Service", "helpfulness": 2, "user": "LeaHJ", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7389144, "likes": {"liked": "— Spacious Rooms with Living Area"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The rooms are a good size with dressing area, separate bathroom and a Lounge Area with Sofa, TV and Internet connection.", "title": "Very Good Value for Families", "helpfulness": 4, "user": "tboyerpa", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7368800, "likes": {"liked": "— Great Pool Facilities, and guest services"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "There is an abundance of restaurants for every taste. If you can afford to splash out a little, I would recommend dining at the Different Pointe of View Restaurant which is perched on the top of the cliff and has an out of this world view of Phoenix.", "title": "crowded!", "user": "SG2007", "date": "April 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 7364861, "likes": {"liked": "— pools", "disliked": "— steep steps."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "Please note that this hotel is built on the cliff side so some rooms have a bit of a hike to get to. [the hotel does provide transport around the complex]", "title": "Fine but not worth a special trip", "helpfulness": 2, "user": "fastrunningmom", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7352174, "likes": {"liked": "— The rooms were spacious and clean.", "disliked": "— It had nothing special to recommend it really.."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The staff are brilliant - special thanks to Gabriel at the Front Desk who couldnt do enough for us.", "title": "Drenched in Sun and Beauty", "user": "gpizzy", "date": "April 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7341704, "likes": {"liked": "— The great spacious suites", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "the pointe hilton hotels offer most probably the best summer deals of all resorts in the phoenix area. check their websites if you plan to visit during those undescribeble hot summer month. adjacent lookout mountain golf course is beautiful, yet challenging. must try. the resort appears like a small spanish/mexican village with narrow streets and their suites built up the hill (phoenix mountain preserve). the suites are freshly renovated and large with a bedroom, a sitting area, balcony and 2tv's. furthermore you'll find a fully stocked minibar and a small wet bar with coffee, tea etc.", "title": "best value under the summer sun", "helpfulness": 1, "user": "griswolds09", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36979033}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "it offers various little hidden pools spread out the resort and 2 mainpools with (snack-)bar and slide in the centre. we tried the mexican and pointe in thyme restaurants, both offer good affordable food. room service is also ok and not too expensive.", "title": "Great place to refresh!", "helpfulness": 2, "user": "sactm99", "date": "August 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 36416673}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "2 supermarkets are just down the road (5min drive) for all extras. overall a fine resort especially when travelling with kids due to the given extras. we'll be back.", "title": "Beautiful Views...", "helpfulness": 1, "user": "OSU22", "date": "July 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 36253424}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "p.s. welcoming and competent check in staff", "title": "I won't go back again!", "user": "zina", "date": "July 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 35118895}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The Pointe Hilton Tapatio Cliffs resort is an elegant resort, perched beautifully on the side of a mountain overlooking the city of Phoenix. Though the parking can be a bit tight, you can't beat the feel of the resort itself.", "title": "Beautiful resort", "user": "lovetoholiday2007", "date": "July 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34560657}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I went to Point Hilton for a \"staycation.\" Overall, it is a very nice resort. The rooms are excellent - comfortable beds, very clean, nicely appointed. The location is fantastic: near hiking trails and North Mountain. The attached photo was taken on a hill just a short walk from the resort. Great views. The woman at the front desk was extremely nice. Our room keys did not initially work but her nice demeanor made up for it. The pools are nice and the waterslide is fun. We did not have dinner at the resort, but did order dessert from room service, which was very good. The only minor issue is that the pools are crowded. They are significantly less crowded than the Pointe Hilton at Squaw Peak, however, which appears to be aimed more at kids. Overall a nice stay. But, if you want peace and quiet by the pool, this might not be the best option.", "title": "Nice Resort, Great Location, Somewhat Crowded", "helpfulness": 1, "user": "eb4309", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37995772}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We just returned from a four night stay in mid-August 2009 at the Pointe Hilton Tapatio Cliffs. As usual, when I read the other TripAdvisor reviews I wonder if some of these people were at a different hotel than I was or if they travel much. First, I find it utterly ridiculous that people complain about internet fees at a full service resort. I've never stayed at a Marriott, Hilton, Ritz Carlton, Hyatt or Fairmont that didn't charge for internet in the room.", "title": "Nice Resort - Great Deal", "helpfulness": 2, "user": "KC_travels08", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37878102}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "As for this hotel, it HAS been remodeled. Our room had flat screen TV's, granite countertops, great air conditioning, etc. Every contact I had with the staff was positive and professional. It is an older resort built on the side of a Phoenix mountain, but that is what makes it different and fun. It has several beautiful pools, ranging from large to small and intimate tucked in between the buildings, in addition to the 2 main pools.", "title": "Noisy and packed mass holiday resort", "user": "harmonie", "date": "August 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 5.0}, "id": 37800392}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The only complaints I can imagine people might have with this hotel are (1) the hills -- since this hotel is on a mountain, people who are physically challenged may have issues and (2) parking is tight on weekends since all the locals use this resort for a weekend staycation.", "title": "Beware - Hidden Fees - VERY DISAPPOINTED OVERALL", "user": "joannieg", "date": "August 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 37769969}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "Overall, a very nice resort -- especially if you find a great rate, which we did on the hilton website.", "title": "Has its good points but badly in need of an update", "helpfulness": 1, "user": "JDSnoho", "date": "August 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 37597992}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Nice suites which are let down by poor air conditioning and terrible natural lighting. The rooms are so dark (at least ours was).", "title": "Squaw Peak is better", "helpfulness": 5, "user": "eaglesrest", "date": "March 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3296392}, {"rating": 2.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "We stayed at the Squaw Peak a few years ago and this is by far the better hotel in my opinion.", "title": "some good, some bad", "helpfulness": 4, "user": "PPop54", "date": "March 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3290645}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "One plus is the readily available transportation around the site and the excellent cliff side restaurant. However, Squaw Peak has a great water park, is much better suited for Phoenix's scorching weather and has some fantastic cabanas!", "title": "It had everything plus a couple of unexpected bonuses.", "helpfulness": 14, "user": "dardo", "date": "March 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3265092}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Stayed here for three days while participating in a business meeting. Didn't know what to expect after reading previous reviews. The good news was that the bed was extremely comfortable (nice linens, mattress similar in feel to comfy beds at W Hotels) and the room was probably one of the quietest hotel rooms I've stayed in (maybe we lucked out with quiet neighbors). When checking in, we did request that our room be in a quiet section of the property and we upgraded to a room with a view -- we were in the cliffside area above the Sunset Pool. Room was spacious, OK decor, but it's obvious that the property was built in the 1970s since bathtub, toilet, etc are all of a rather dated vintage. Our suite had open beam cathedral ceilings, which was nice, so I recommend requesting an upper unit. The downside: The resort seems very tired and dated, elevators run very slowly, everything seems a little bit patched together and in need of paint or a good makeover or remodel (I did notice those painted floor tiles in the lobby that someone mentioned, though I didn't think they looked that bad). Service in the restaurant by the pro shop was slow and food was substandard. Fish tacos at Mexican place were OK. Since hotel is built on a hillside, there's lots of walking involved if you are in an upper unit, but we didn't mind that at all -- a five-minute walk seemed better than being housed in one of the dreary units near the lobby that overlooked the parking lot. Another point (or \"pointe\") to consider: Location of the hotel is not the best for accessing tourist venues (spring training, Scottsdale, etc. ). Overall, the property is dated, but our unit (at least) offered quiet, a comfy bed and a view (albeit of suburban sprawl and hills way beyond). I probably would not stay here again, but the stay could have been a whole lot worse -- at least we were able to sleep.", "title": "Not 5 star but still nice", "helpfulness": 4, "user": "Shelly P", "date": "March 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3265061}, {"rating": 5.0, "title": "great place", "text": "Just got back from 4 enjoyable nights at The Pointe Hilton Tapatio Cliffs Resort.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 8, 2005", "id": 3258197}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "This is the third time my wife three children and I have vacationed in Phoenix. The last twice we have stayed in Scottsdale this time we decided to try the Pointe Hilton.", "title": "Nice....but..", "helpfulness": 8, "user": "Simba-Mark", "date": "July 31, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3725471}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "Location was good, check in impersonal have to go from the main desk to the bell desk to ask for directions to room. We were told we had a parking spot outside our room. What a joke! We had to park down a hill, 10 minutes walk away and that was a good day. The parking in this resort relies on good fortune rather that logic. Why are there no room numbers on each parking spot?", "title": "Great Hotel, OK neighborhood", "helpfulness": 5, "user": "dave5151", "date": "July 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3699767}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "On a positive note the pool areas are excellent, very often we were the only people in the pool.When my sons and I were stuck in the elevator staff were quick to respond , as when we were flooded by the airconditioning malfunction.", "title": "Surround sound air conditioners-yikes!!!", "helpfulness": 11, "user": "TravelinElizabeth", "date": "July 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3645618}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The lobby area itself is sterile with a lack of information, leaflets etc on local attractions. Indeed we had to drive to the hotel we stayed in last year in Scottsdale for leaflets, maps etc.", "title": "dated hotel", "helpfulness": 14, "user": "p0inttravel", "date": "July 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3634564}, {"rating": 2.0, "stay_parameters": "Stayed September 2004", "text": "Unless I got a great rate I would not stay here again.", "title": "Disappointing Stay", "helpfulness": 13, "user": "Bradford J", "date": "June 30, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3621784}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We had a great stay at the tapatio cliffs resort. We have 2 boys ages 5 and 7 and they loved the falls pool area. They also had kids activites going on for spring break. The rooms were nice with a pull out sofa bed in the living area(not all rooms have this). We got a great deal on priceline for this resort. You can normally have access to the Squaw resort but we were unable to due to crowds at that resort. It didn't really matter as our kids were very occupied at the Tapatio. You can hike and mountain bike right from the hotel.", "title": "Great Stay at TApatio cliffs", "user": "lisatsobo", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7302905}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We did not eat at the resort. There is pretty good cheap mexican food at Carolina's, not too far from the resort.", "title": "Great for families visiting Phoenix", "user": "OHCincinnati", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7294964, "likes": {"liked": "— Suite Rooms, Pools", "disliked": "— Hills"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The only con was on the night we arrived there was some convention going on and finding a parking spot took a bit of time. We did not have any problems after that. You can not always get a spot near your room and may have to walk a little. I didn't mind since the resort is so beautiful and I enjoyed the exercise.", "title": "crowded and dated!", "helpfulness": 1, "user": "thehoses", "date": "April 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 7290079, "likes": {"liked": "— the comfortable beds and pillows", "disliked": "— the pools"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Just returned from a 4 night stay at this hotel. This was a great hotel for families visiting the Phoenix area. The hotel has several pools and the one large pool area is great for kids of all ages. The rooms are clean and comfortable and are true suites, net great if you have small kids. We ate at both the more causal restaurants, both were good. As other reviews have stated, other places to eat are within short driving distance. Part of the charm of the hotel is the being built up the cliff. But, it is a strenuous walk from the lobby area to the rooms up the hill.", "title": "Nice for a convention", "helpfulness": 1, "user": "hdblue", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7253045, "likes": {"liked": "— Spacious rooms, great pools, great restaurants", "disliked": "— Lots of climbing uphill, decor needs updating"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Other helpful info:", "title": "Awesome!", "helpfulness": 2, "user": "Juno1", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7247378, "likes": {"liked": "— The desert trail with access to the resort.", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "Nice, older place with a lot of charm", "text": "My husband and I stayed here in April and the weather was perfect. We stayed in Room 4133 with a \"Valley view\". The room itself has a very small separate bedroom and then a little living room. There are two t.v.s. I found the room to be a little dark actually, and I have seen that comment on here before. However, the bed was wonderfully comfortable and we liked our balcony and the sitting area.", "helpfulness": 6, "user": "cathykins", "date": "May 7, 2005", "id": 3446703}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "There are a number of different pool areas and one day we used the very quiet one by our room and the next day we went to the more family oriented larger area which offered drink service. Both were nice in their own way.", "title": "Great Hotel - Need Quieter Golf Carts", "helpfulness": 7, "user": "UCLaw98", "date": "April 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3342667}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "We ate dinner the first night at a \"Different Pointe of View\" and the view is spectacular and the food was excellent. Really recommend it.", "title": "very disappointing - not 5 star", "helpfulness": 11, "user": "vicki1812", "date": "April 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3337342}, {"rating": 4.0, "title": "Nice for families", "text": "The only negative about the place was all the walking one would have to do. Parking is at a premium so you may not be able to park very close to your room. For us, that is no problem but I kept wondering about elderly people. I could see my folks not being happy about it.", "helpfulness": 4, "user": "JJinMI", "date": "April 2, 2005", "id": 3323049}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Overall the service was great (we had two room-service breakfasts delivered hot and on time) and the dinner we ate there was excellent. It is a charming place that meanders up a hillside and we would stay there again.", "title": "Great stay at the Tapatio", "helpfulness": 6, "user": "bakery", "date": "March 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3301693}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We just returned from a 4 night stay. When we arrived rather late on Saturday night, June 11, we asked if we could have a room with a view. We were told there were only two rooms left and they had parking lot views. Upon arriving in our room, it reeked of sewage. Our bellman noticed the smell and offered to have the maids come and spray. They arrived promptly, but we knew spraying the room would not eliminate the odor. We contacted the front desk and were told the only other available room had wet carpet. We were tired from our trip from the East Coast and asked the front desk to find us another hotel. Then, after much discussing among themselves, they found another room. Our very kind bellman, Dick, then drove us up the cliffs and carried our bags again in the heat to a suite with a beautiful view. Hilton certainly has a fantastic employee in Dick. He knew we were ready to leave the Tapatio Cliffs and find something else, but he was so kind pointing out all the good features of the hotel. We were so happy with our suite with the view, all our bad thoughts about the resort quickly disappeared. Dick then called us when he got back down to the front desk to assure us that we could have the suite for our 4 nights and not have to move to less expensive room the next day.", "title": "Beautiful resort, wonderful pools, fantastic bellman", "helpfulness": 14, "user": "Judy1949", "date": "June 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3588010}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "When we return to Phoenix, we will definitely want to stay at the Cliffs, and will probably pay the extra money for the view. It was so wonderful to sit on the patio and drink coffee early in the morning and enjoy that view.", "title": "Beautiful Grounds, Okay Service", "helpfulness": 10, "user": "maroulni", "date": "June 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 2.0}, "id": 3551880}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "Thanks to Dick for sticking with us and seeing we were happy with our room. Hilton is very fortunate to have an employee who represented them very well (unlike the front staff).", "title": "Fantastic!", "helpfulness": 7, "user": "egremont", "date": "June 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3547053}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "We just returned from 6 nights at the Tapatio Cliffs Resort, which were pleasurable, and very reasonably priced, considering the summer rates available at the resort. This resort is very large, however, and the service suffers.", "title": "Wonderful time at the Hilton Tapatio Cliffs Resort", "helpfulness": 8, "user": "pantherfan1", "date": "May 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3494916}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We had booked a rate of $89 plus tax through the Hilton website. Though we had requested a king bed, a standard king bedded room was not available at check-in. Rather, we were put in a handicapped accessible room, which, given its functional necessities, was not as luxurious as a standard room (e.g. awkward shower instead of bath, etc.) We requested a room change for the next day, and were accomodated. Because we were going to be spending the majority of our time off-resort, we requested a room in the main building, which was close to the elevators and complimentary valet, which made for easy exits and arrivals.", "title": "Enjoyed our stay", "helpfulness": 8, "user": "joparke", "date": "May 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3467951}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "I would like to give the Pointe a great review but unfortunately I can’t. I grew up on Phoenix and the Pointe was always someplace nice but I think maybe it is past its prime although the issues we encountered could easily be remedied.", "title": "Room for Improvement", "helpfulness": 1, "user": "vlfair", "date": "October 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 46744410}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Pros:", "title": "Very nice hotel", "user": "marjanmacphee", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46306587}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "1. It is very centrally located and convenient to two freeways and downtown.", "title": "Nice place for the right price", "helpfulness": 1, "user": "BDardeen", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 46261899}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "2. The location itself is beautiful.", "title": "We loved this place", "user": "SuperPags", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 46245462}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "3. The pool seemed nice (but a little small). We did not use the pool but I did check it out.", "title": "Lovely grounds, outdated rooms", "helpfulness": 1, "user": "dkj44", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46238483}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 92, "average": 202, "very good": 385, "terrible": 50, "excellent": 410}, "aka": "Pointe Hilton Tapatio Cliffs Hotel Phoenix", "slim_ranking": 0.38418079096, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "After an elaborate $25 million dollar renovation the Pointe Hilton Tapatio Cliffs Resort has received the distinctive AAA Four-Diamond Award and guests can expect an experience made special through quality accommodations and superior service. Whether visiting for business or pleasure, you will enjoy all-suite accommodations; complimentary access to our expansive water feature; unique dining experiences; championship golf; relaxing spa and salon services; an array of shopping options."}