{"user_rating": 5.0, "review_count": 245, "name": "Poipu Kapili", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We ended up at this gorgeous condo resort after a panic-filled night of looking for new accommodations. We cancelled our previous reservation after reading some really bad reviews and realizing that there was no AC. Let me tell you this: NO CONDO in Poipu has AC unless CLEARLT advertised!!! I had no clue and it really isn't obvious either! We booked a unit at Poipu Kapili that had AC advertised. It is NOT central AC, but an AC unit in the bedroom. To be honest, we used it for two night and gave up. It was loud and the fans and opening the windows/screens does the trick. It will be warmer than what you are used to though! Our unit was very clean, renovated and beautifully decorated. The staff is very friendly and helpful too! Bring plenty of OFF! Our 15 month old son was eaten by mosquitoes the very first hour we got there. I can whole-heartedly recommend this condo.", "title": "Wonderful, clean condo with beautiful view!", "helpfulness": 1, "user": "SOnjana", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165084435}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "WOW! What a wonderful condo. All our needs were met. From hearing the waves, to beautiful sunsets, comfy king sized beds, fully equipped kitchen, and short walks to excellent beaches, restaurants and shops. Cynthia's information pack was invaluable...she has taken all the guess work/indecisions for first-timers. It will be highly recommended to our friends and family and we look forward to returning again one day soon.", "title": "Poipu Kapili #54", "helpfulness": 1, "user": "Fitzy0911", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164447859}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Poipu Kapili is the epitome of Aloha. The property is beautiful, the staff is warm and welcoming and the condo's are comfortable and inviting. Nothing else on the island can compare! Already booking our stay for next year!", "title": "My favorite place in the world!", "helpfulness": 3, "user": "jpobran", "date": "June 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163124276}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed in unit #33 for 10 nights. Excellent view of ocean from unit and pictures of unit on website were accurate. Could also hear ocean from the condo. Unit has been remodeled and has everything you need. Complex has great pool, bbq's and laundry. Staff was very friendly and helpful. Poipu Kapili is close to beach/ocean and centrally located. If you are looking for quiet small complex this is the one for you!", "title": "Perfect Condo and Location", "helpfulness": 3, "user": "Smiley0324", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158517523}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Condo #54 was the perfect condo in the perfect location. From our front deck we could not only see and hear the ocean, but watch the sun set every night. The condo was very well equipped with everything in working order. The owner was very easy to work with. We would definitely stay here again.", "title": "Poipu Kapili", "helpfulness": 2, "user": "ske214", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 158036499}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We have enjoyed a week or more at Poipu Kapili for many years. We always discuss which island and where we would like to spend our time the most--and we ALWAYS decide on Poipu Kapili. The condos are all wonderful but of course we have our favorite--number 42! The location of each condo is great with wonderful views of the beautiful grounds, the sparkling pool and the gor-", "title": "Poipu Kapili is THE BESTplace to relax and enjoy your vacation time!", "helpfulness": 1, "user": "Wendee S", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157725990}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "geous ocean! Buff and all the people who help us are very friendly and helpful. It's just the very happiest place to be! We have also come with our children and grandchildren (12 of us) and it was perfect! We'll be back next year and the next! Thanks to all the staff!", "title": "Excellent in every way", "helpfulness": 1, "user": "m s", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157031793}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Beautiful unit (34), impeccable grounds, perfect location. We loved our stay here and hope to be back soon. Maid service within our 5-night stay was a nice plus, lots of space in our condo, great kitchen, comfortable bed, two bathrooms. Great view, quiet, and private. Liked the Friday morning coffee at the pool. Everything we needed and more. Highly recommend. The Sheraton beach next door is a quick walk away, very nice, clean. The staff was very helpful making reservation and throughout our stay. Other repeat guests commended the management.", "title": "The best place to vacation:-)", "helpfulness": 1, "user": "WalterP575", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156698189}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We have been coming to Kauai for decades, almost yearly, and our choice of were to stay and relax is Poipu Kapili.... it is like coming home when we arrive each time, and a sad experience when we leave! And not only are the accommodations and location offered outstanding, but the entire staff, from the front office to those who provide all the other services that make your stay thoroughly enjoyable, are simply the BEST!!!", "title": "We Pretend That We Own The Place", "helpfulness": 1, "user": "MTrueblood", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156642775}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Kauai is where my wife and I were married on the beach at the old Sheraton Hotel just down the street from Poipu Kapili, way before Poipu Kapili was built, and when it was, that is where we stay on return to the island... and this last trip was to celebrate our wedding anniversary on March 19th..", "title": "Poipu Kapili 54", "user": "BethS132", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156614650}, {"rating": 5.0, "title": "Poipu Kapili is the BEST!", "text": "If you are looking for a quiet and luxurious condo complex on Kauai, look no further than Poipu Kapili. My wife and I prefer condos over hotels for a week or longer stay. We first chose Poipu Kapili in the mid-90's based on my internet search. Since then, we have always stayed at Poipu Kapili when vacationing on Kauai. In the past we stayed in the 2 bedroom oceanfrom condos. This was our first stay in a one bedroom. We chose unit 26 and I would highly recommend it. We found the view to be exceptional and the condo had everything we needed for a comfortable ten days on Kauai. If you are looking for a very positive recommendation, look no further. I highly recommend Poipu Kapili and this is where we will always stay on Kauai!", "user": "Neal E", "date": "March 28, 2013", "id": 155937967}, {"rating": 5.0, "title": "Great stay at Poipu Kapili", "text": "We had a great week at this quiet condo development.", "user": "Bob K", "date": "March 27, 2013", "id": 155828683}, {"rating": 5.0, "title": "Unit 23 - gorgeous!", "text": "Near but not on the beach. Location suited us perfectly, and everything was as promised. Quiet. Comfortable. Convenient. If you prefer a resort with massive pools stay elsewhere. If you want a nice clean and comfortable place to wind down, this is the place", "user": "Tink1234", "date": "March 21, 2013", "id": 155279425}, {"rating": 5.0, "title": "Poipu Kapili #24 Just Perfect", "text": "I do a somewhat obsessive search before we stay anywhere, so we are usually very happy with our accommodations. But once in a while, the hotel or condo truly exceeds my already high expectations. Poipu Kapili was such a place. The condo was beautifully decorated and recently updated, the view was even better than in the incredible pictures, the grounds were gorgeous and the staff unfailingly helpful. The location couldn't be beat and the condo was stocked with everything we could possibly have needed. We were in Unit #23 and it suited us perfectly. The condo was a one bedroom with a pull-out couch with tons of room for my husband and I and our two kids. The view from our lanai was not only an ocean view but it was framed by flowering trees and green grass. One example of the attention to detail - the condo was stocked with two beach chairs, a boogie board, a large assortment of Hawaiian music CD's and a small cooler we used almost everyday. Love, love, love!", "user": "Ted_Fez", "date": "March 18, 2013", "id": 155011657}, {"rating": 5.0, "title": "WOW!", "text": "My wife and I stayed (for the second time) at the Poipu Kapili condo complex, located close to the Sheraton at the western side of the Poipu area. There is a lot to like about the complex. First, the condos are managed on-site, meaning staff are present during the day to take care of any problems. The complex itself is relatively small, but very nice. The pool is small but nice, with good seating and shade. One can stroll across the lawn to the south coast to watch the sun set in the evening. There is a tennis court and a small herb garden, which we took advantage of for meal preparation in the evening (with permission and encouragement).", "user": "2forholiday", "date": "March 2, 2013", "id": 153560104}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Had spent quite a bit of time researching where to stay in Kauai and so glad we found this property. We arrived fairly late on a Saturday so, as promised our key was waiting for us in a lock box outside the management office (we checked in the next day and staff are terrific). The condo was wonderful and overlooked the oean (we left the bedroom doors open to hear the ocean each night). Each room in the condo was beautifully decorated with high end furniture, applicances and all you would need in a kitchen including, thank you very much a coffee grinder! We enjoyed the lanai each morning for breakfast and loved the location, which was a close walk to two main shopping centers with restaurants and lovely stores. While I had read about the small road between the property and the ocean, it wasn't very busy except for evening sunset when some cars chose to blast music. It did however, make for a good walking path and some good whale sitings. If however, you want to be right on the beach, this property is not for you. There is a public beach, a short walk next door which we did not take advantage of at all. Would suggest buying your groceries closer to the airport (Times Supermarket, Costco) as the local gourmet market is crazy expensive. Love Kauai!!!", "title": "Paradise in Unit # 9", "user": "Breezey", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153068316}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The accommodations are great. The unit (27) was very nicely decorated and well kept. The recently remodeled master bathroom with a great steam/shower stall, is excellent. The equipment in the unit (computer, printer, VCR) is great and the kitchen has everything you could need. The view from the lanai is gorgeous-- the pool and the ocean. The grounds are beautiful. The staff is attentive and responsive and very pleasant to deal with. We've been to Poipu Kapili several times and can't wait until December to visit again.", "title": "Message from Paradise", "helpfulness": 1, "user": "Marge C", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149999237}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This was my first time to Kauai and I know I will be going back. My husband I went with another couple and spent 10 days loving our vacation. The condo was fabulous, well laid out, beautifully decorated, with a kitchen outfitted to make the perfect meal. The location could not have been better for walking, beaches and shopping and enjoying the fabulous sunsets. It was the perfect vacation.", "title": "Poipu Kapili #54", "helpfulness": 3, "user": "cas50-19", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148861115}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Mom and I stayed in Suite 34, second floor with a balcony looking out toward the ocean waves, as well as the pool. The grounds are beautiful, the pool is lovely (deep, clean, cool). The road in front of the property makes for a lovely 10 min walk each morning/evening to the Kukui-ulu shopping center for coffee/breakfast/dinner if you don't want to eat in. The wall along the road is also a great place to sit and watch whales, turtles or the sunset. It's a short walk to the beach between the Sheraton and Marriott, which is a wonderful sandy beach with great swimming - some waves to make it exciting.", "title": "Quiet, friendly, great staff and location", "helpfulness": 3, "user": "peg0", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148095196}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The property is peaceful and not as packed as the larger hotel chains.", "title": "Poipu Kapili #51 - The Best Place to Stay on Kauai", "helpfulness": 1, "user": "HawkeyeCruisr", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147133081}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 7, "very good": 27, "terrible": 2, "excellent": 205}, "aka": "Poipu Kapili Hotel Poipu", "slim_ranking": 0.1, "description": "Poipu Kapili is a collection of privately owned condominiums in an idyllic setting on one of the most beautiful islands in the world, Kauai. This private resort boasts spacious 1 and 2 bedroom condos ranging in size from 1120 square feet to 2600 square, all with ocean views and private lanais."}