{"user_rating": 3.5, "review_count": 149, "name": "Poland Spring Resort", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Bed was very uncomfortable. Air conditioning did not work for hours and then finally worked during the night, only to wake up freezing and no extra blankets in room.", "title": "Don't bother", "user": "CEGaulin", "date": "June 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 68200582}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Foyer of Motor Inn done in early 1970's.....", "title": "Poland Spring Resort- you can do better elsewhere", "user": "gwilliams31", "date": "September 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 45273528}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Food was terrible. You get assigned seating ! I asked for a seperate table upon realizing that we were assigned seating with strangers and was met with \"we don't usually do that\", but when I insisted we were given the table.", "title": "Finally found how to relax and get stress relief", "helpfulness": 2, "user": "chicos2009", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41172724}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The food was over cooked. The roast beef was really very thinly sliced deli, and you could only get one thin slice at a time according to the young girl that dispersed the meat. The \"baked\" fish was a 2\" x 2\" piece of fish in a cream sauce of sorts, with a teaspoon of some sort of stuffing on the top. Again, it was dispersed by a young person and you could only get one.....", "title": "Great location, definitely for the 'older set'‎", "user": "swrrly", "date": "September 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 39693203}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We left the following morning before the breakfast , so I can't comment on that other than to say that I can hardly believe that it would be any better than dinner.", "title": "It should be named old people resort", "helpfulness": 2, "user": "bostonbostongirl49", "date": "August 20, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 1.0}, "id": 38307122}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "When I started coming here I was probably the youngest person there. The food has declined a bit over the last few years but is alright. I got the entertainment package for Columbus weekend and had a great time. I had stopped getting entertainment packages as they were rather boring but this one renewed my faith inthe place . I love the place and the fact it is so resonable and so close to towns and cities in Maine that I lve.", "title": "Ihave always loved the place,even though it is not a five star", "helpfulness": 2, "user": "Hypathia2cat", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 98398086}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Phew! After reading so many negative reviews, I was beginning to think we made the wrong decision to book here. We traveled with 5 other couples for the end of the year celebration over Columbus Day Weekend. Friday was Halloween, Saturday Christmas (complete with having b-fast in our jammies and opening presents around the Christmas tree after!) & Sunday New Year's Eve. We had a total blast!", "title": "Phew, Previous Reviews Scared me! Our stay was fine.", "helpfulness": 2, "user": "ChrispyMaine", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 83163060}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Yes, the facilities are a bit run down and dark. We all stayed in the Presidential Inn. I was lucky enough to be in one of the sunny, recently painted rooms. But then again, how much time do you really stay in the room anyway? I guess because we're all campers, we're used to roughing it a bit anyway.", "title": "Can't wait to go back every year!", "helpfulness": 3, "user": "Shirlgov1", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 81309328}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The food was a lot better than I expected. I was on a cruise a couple of weeks ago and I think some of the meals served at the Inn were better. No powdered eggs, we got the real thing.", "title": "Worst hotel / nursing home EVER!", "helpfulness": 5, "user": "DRS2010", "date": "September 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 79047509}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Learning about the history of the facility and grounds was very intriguing as well. The Museum was very impressive. Our friends had a great time golfing as well.", "title": "This review is focused on our staying in one of the cottages", "helpfulness": 1, "user": "Rivertowns", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 77993314}, {"rating": 5.0, "title": "We will be back to \"The Stress Free Zone\"!", "text": "My wife and I spent the Fourth of July weekend here. We were attending a family wedding taking place in town. We really enjoyed our time here! Lots to do between the gift shops, snack bars, pubs, restaurants, dining rooms, hiking trails, lakefront, etc. The Maine State Building from the Chicago World's Fair and the original Poland spring located on-site are quite impressive. We also toured the last active Shaker community near Sabbathday Lake nearby. The grounds are beautiful and well maintained and the area surrounding the resort is very scenic. While we personally don't golf the course looks great as well as the pool near the clubhouse. The huge porches overlooking the scenery and sunsets are fabulous. A very nice relaxing time! I am a little disturbed by the misleading and sometimes hurtful comments by some. Perhaps they were expecting a Scam Vegas or an idiotic Mickey World experience. The Resort may not have all the bells and whistles or fake glitz but it is very comfortable, the food is great, and the hosts are top-notch! We stayed in the least expensive room available in the Lodge building which has all the basic amenities and is very comfortable. There are many choices of accomodations in the Maine Inn, Presidential Inn, The Lodge, and the cottages located throughout if you really need something larger or fancier. The Poland Spring Resort is the epitome of a great country inn and is truly \"The Stress Free Zone\" and I am looking forward to returning when the opportunity presents itself again!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 13, 2011", "id": 115340124}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Curt Carleen and Cheryl Lilienthal, Saunderstown, RI", "title": "Great Place for Older Adults", "helpfulness": 1, "user": "Summerfun00", "date": "July 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 4.0, "service": 4.0}, "id": 115223453}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Just spent 4 days at the resort. It was clean and the people were kind and helpful. It is NOT a place for families with kids. We had 3 kids and we saw only 4 others. It is a great place for peace and quiet - they attract an older population mostly 60 plus is my best guess. . Lots to do in the area and we had a great time day tripping. Food was plentiful but basic. Price is very reasonable. A great place for older adults.", "title": "What you get depends on your expectations", "user": "finegael", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115133075}, {"rating": 4.0, "title": "Enter the \"Stress Free\" Zone!!", "text": "Hubby and I have stayed here twice, both times in 2011 - first over the Memorial Day holiday and then again a shorter weekend in June. We read all the reviews, good and bad, and decided to take a chance.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 22, 2011", "id": 114660184}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "If you are expecting a 4-start experience, then you will be disappointed. If your expectations are not that high, you will probably be satisfied.", "title": "Just had our 10th annual golf focused stay and can't wait to get back", "helpfulness": 2, "user": "red_dog_1965", "date": "June 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 111860132}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "All of the negative comments about Poland Springs Resort made us want to go there - old, comfortable, quiet. Rooms are small but we spent most of our time outdoors. There is a small gym which is more than adequate. Check-in is at 4pm, not earlier.", "title": "GREAT PLACE TO RELAX", "helpfulness": 3, "user": "Cathy023", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 77334589}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I are in the 50-60 year old range and needed a quiet place to unwind after a hectic schedule and this place was perfect. The food is simple but well cooked; staff was friendly and helpful; golf was excellent. Most of the guests are older - the weekend group seemed to be more physically active while the midweek group a bit more fragile. There were a few young families and the kids seemed plenty busy with the pool, games and hiking trails. Several cottages on the grounds provide privacy for family reunions and small groups.Freeport Maine is 20 miles away with great shopping.", "title": "We did not even stay the night!", "helpfulness": 4, "user": "40718Sue", "date": "August 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 76376217}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "We will definitely go there again.", "title": "Avoid the Motor Court!", "helpfulness": 2, "user": "Groverprach", "date": "August 14, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 75148667}, {"rating": 5.0, "title": "supports the troops", "text": "We booked this stay since we had received a generous gift certificate for the inn. My coworkers were impressed by the claims on the website, and gave us the gift. We made a reservation for the Deluxe room in the Presidential Inn, thinking it would have ,more of a bed and breakfast feel. At $147.00 a night, it was not cheap. I can handle old and quaint, but I cannot handle run down, water stained and generally poorly maintained. The owners of this inn obviously feel no need to show pride in the property, When we entered the Presidential Inn, the rugs was water stained, the walls covered in cheap paneling and the deluxe room consisted of a stained headboard with stained tiles in the ceiling. Okay,. so we tried the golf for additional fees, and were hell-bent on trying to be positive about the place. We felt that the dinner that was heralded in the brochure would surely make up for the less than stellar accommodations. What we got was a cafeteria style dining room with an Italian buffet that included soggy spaghetti and eggplant parmesean with their lasagna, the touted highlight of the meal. No table cloths, plastic and metal chairs, etc. Certainly not the wonderful ham, roast beef and turkey that were also a part of the brochure and their advertising. We live less than an hour from the place, and rather than argue about their firm, no refund policy, (no wonder they make that very clear on the phone!), we drove the distance back to our own home and our own bed. We chalked this up to our top 5 worst hotel experiences, and will never recommend this venue to anyone we know.", "helpfulness": 5, "user": "Kjohnson101", "date": "July 24, 2010", "id": 72187471}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Needed a place to stay overnight near our daughter's camp, whom we picked up the next morning. The building, it turns out, is down route 26 from the main resort. No staff at motor court. Very aged structure. Cochroach in the room. No soap or towels in the room. There was an a/c unit in window bit it didn't work. My wife and I woke up at 5:30 am and booked out of there ASAP. Not a good experience at all.", "title": "Changes coming in 2011", "helpfulness": 2, "user": "TravelingCoyote", "date": "July 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 69345776}], "location": {"country": "United States", "city": "Poland Springs"}, "variance": {"poor": 12, "average": 18, "very good": 53, "terrible": 27, "excellent": 39}, "aka": "Poland Spring Hotel Poland Springs", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "Poland Spring Resort offers a stress free vacation in Maine. Delicious all-you-can-eat home-style buffets. Play on our 18-hole championship golf course, grass tennis courts, swimming, boating, hiking, nightly entertainment, min-golf, driving range and much more. Enjoy the sunset with a million dollar panoramic view of Presidential Mountain range and Mount Washington. Centrally located in the foothills of Western Maine and stress free since 1794."}