{"user_rating": 4.5, "review_count": 44, "name": "Pomeroy Inn & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My husband, daughter and I had the pleasure of staying at the Pomeroy in Vegreville a couple of weeks back and we enjoyed it immensely. The staff was very accommodating and pleasant and the room was exceptionally large and very attractive. I travel for work and the high end business hotels have very nice furniture etc but are extremely small, claustrophic in some cases, so it was a real pleasure to have a room with two king beds and still plenty of space. We will stay there again at every opportunity.", "title": "Spacious, inviting", "user": "EllyMae0594", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131450940}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Stayed here for three night. Loved having breakfast in the morning ( flavors for the coffee was an extra bonus), hot tub was great, clean rooms, quiet and attentive staff. Would recommend staying here again.", "title": "Great stay.", "user": "Eskape96", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131168271}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We literally blew in from 100 Mile House, BC around 6:30pm after a bad experience with a motel booking in Fort Saskatchewan. The staff were sympathetic, got us into a wonderful room and we were in time for Customer Appreciation Night~glass of wine, beer and pizza! Our room was immaculate with lovely furnishings, lots of space and the best bed, quilts, pillows EVER! The next morning we had many choices for our Continental Breakfast~cereals, waffles, fruit, juice, coffee, tea, toast, bagels, etc. The rooms were also very quiet, not a running shower to be heard or a slamming door. Highly recommend it. It is pricey (we had Senior's rate at $134~add tax and tourism fee~ for a two queen room with fridge and microwave, plus dinner, wine and breakfast!) but I think the comfort was worth it.", "title": "Amazing hotel with wonderful, helpful staff", "user": "Ogallchobhair", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130908327}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Great hotel, very clean, they have a free BBQ for customers every week. The rooms were meticulous and the conference room was great to work out of. The staff were very accomodating and friendly, would definitely go back!!", "title": "Great stay and friendly staff!!!", "user": "nskath", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130485728}, {"rating": 3.0, "title": "Taking advantage! Expensive, certainly don't get what your paying for.", "text": "We stayed here for 2 nights, biting the bullet and paying 150 a night, we stay in many hotels compariable to this one anywhere from 100 -120 a night. Though the lobby is impressive and the rooms appear clean and nice, the particular room we stayed in we could constantly hear running water, our air conditioning was loud and made a loud noise every time it shut off, making naps impossible for my 18 month old the bathrooms are a bit cramped. The selection for tv was more then poor, maybe 10 -15 channels and no guide, making it impossible to even know what's on. Also they charge 12 percent tax, I didn't know I was back in bc. They call it a \"tourism fee\". The front desk clerk was average not upbeat or friendly just there doing her job. On the plus side the beds were comfy and there is a pool, about 4ft deep with water slide and jacuzzi. Also a fitness center but we never used it. The Breakfest was good, make your own waffles, boiled eggs, toasts, bagels, pastries, fruit, juice and more. Laundry onsite as well. I feel because there is no other hotel or chain hotel they are taking advantage of people. If a lake view, best western or any other chain was in town they would be obsolete.", "user": "Carla S", "date": "May 13, 2012", "id": 129885231}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This is a quality hotel with everything a weary traveller could wish for. Unable to continue our journey from Edmonton to Saskatoon because of snow and poor visibility we literally stumbled on the Pomeroy and were very pleasantly surprised. A year old in June the friendliness of staff, the decor, the free breakfast and just about everything about the place was a wonderful change from the often dingy and drab places we are forced to stay in due to lack of choice.Not the cheapest but by far the best in town and for miles around.", "title": "What a find!", "helpfulness": 1, "user": "irenehelmina", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129411704}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "As a woman travelling alone. I have recently stayed at the Pomeroy on several occasions while in the Vegreville area for business. It's been a delightful experience to stay in such a new, clean, quiet and well maintained hotel with friendly & helpful staff. The rooms are spacious, nicely furnished, and the beds are very comfortable. The gym & the pool are great additions for exercise while on the road. The breakfast buffet (included) was nicely presented and has a good variety of choices.", "title": "A very pleasant surprise", "user": "ontheroadagain006", "date": "April 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128285237}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Oh wow, this very new hotel is lovely. The lobby is gorgeous and welcoming with a huge long fireplace. The front desk lady (Chelsea) was a delight. The room was modern, clean as clean could be and tasteful in design. The bed and pillows were soooo comfortable. Vegreville needed a good hotel and this is it.", "title": "What a treat!", "user": "luvtobemom", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128277397}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Searched for hotels on my blackberry on the way to Edmonton and decided on Vegreville. There were lots of choices, but the Pomeroy stood out because it was a new hotel. I called and the front desk person was very nice and friendly. They only had 1 room left and it was a kitchenette room with 2 queen beds. I felt it was expensive, but kitchenette rooms are generally more than a regular room. As we drove through town, we noticed all the other hotels were old looking, but advertised prices less than half of the price of this room. Not knowing Vegreville very well, I think I should have drove through town first to check rates. Check in was great, room was very spacious with high ceilings. Bathroom was a little cramped. I found the beds a little hard, but the linens were luxurious. Around 5:00 AM came along and you could hear everything that was going on in the room above us. Even a phone vibrating. So, from that point on, I didn't get much sleep. The continental breakfast looks good, and I can't wait to go try it out. Would I stay here again? Probably not, but being that I generally wouldn't go to Vegreville, kind of weighs on that. If I had to stay here again, I'd pick a room on the top floor to avoid any noise issues. Very nice hotel otherwise.", "title": "Nice room, but expensive and thin walls", "helpfulness": 1, "user": "Colin A", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 127019371}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We spent a weekend at this hotel and were very pleasantly surprised. We weren't sure what to expect being in such a small town but everything exceeded our expectations. The beds and linens were comfortable, the rooms are spacious and clean, and the pool was great - the kids loved the waterslide! The breakfast was nice too - lots of options and very well taken care of. If you find yourself needing a place to stay in central Alberta this is it!", "title": "Unexpected, and great!", "helpfulness": 1, "user": "GoGoGoFamily", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125709392}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I generally agree with all the highly ranked comments reviewed by others. This establishment is head and tails better than the other accomodation available in the Vegreville area. Yes it is more expensive, but a cheap price often means shortcuts or shortfalls in my experience. In any event i got a consierable discount because I stayed four nights for business. My only negative observations are pretty petty.....the hand lotion provided is watery, and given they are spending some money on decent coffee (Seattle's Best), please provide some real cream for the Continental Breakfast..those little tubs of Liquid Coffee Mate ruin an otherwise decent cup of joe. I will definately stay here again when business takes me back to Vegreville.", "title": "Pomeroy Inn and Suites 10-14 Sep 12", "user": "a78jumper", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140341621}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "This was my second trip to Vegreville, and the Pomeroy didn't let me down. The room is exceptionally clean and comfortable. Breakfast is better than most places too, and there is a waterslide at the pool.", "title": "Still as good as it was a year ago", "user": "HighTech_Redneck87", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137837381}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This is our second stay here for 2 nights each time, and I have provided a positive review last year as well. This year, we had the opportunity of trying out the swimming pool area, as last year it had been closed for the installation of the water slide.", "title": "Relaxing decor, and still best deal in Vegreville. Very highly recommend!", "helpfulness": 1, "user": "jory29", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135502690}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had booked our family suite a couple of months or more in advance, as we had required a suite that had an entirely separate room for our teen son with special needs (sensory/autism spectrum) to be able to 'unwind.' We had told him for several months he would be getting the same type of room we had stayed in last year, so he would have his own area to relax.", "title": "Great hotel", "user": "Mkraus63", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134381966}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Upon arrival, we were greeted with the news by the front desk clerk that something had happened, and we would now be receiving 2 adjoining rooms with enough sleeping space, with similar amenities (kitchen, etc.) that the family suite had. Unfortunately, we were a family with a Mom and Dad in one bed, my sister who would require her own bed, our daughter who could sleep on the sofa bed, but this would mean that our son would now have to share his room, the other 2 Queen bed room that was the adjoining room, with his Aunt, and he would not get his own 'space.' Difficulty in dealing with change can be *very* difficult for someone dealing with asperger's, and this was the case for us.", "title": "Fantastic", "user": "luvtotravelmd", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133890475}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The lobby is welcoming and bright with a blazing fire to greet every guest. The staff were very polite and made us feel right at home. The room was clean, tastefully decorated and comfortable. We would recommend this Hotel as an absolute must.", "title": "This is definitely a 5 star plus facility", "user": "Laurie W", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122549312}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "After nearly seven months on the road, I have seen my fair share of hotels, inns, motels, etc. This is, without a shadow of a doubt, the most well-kept establishment that I have experienced thus far. Every detail is covered in a crisp and modern set-up. If you happen to pass a community with a Pomeroy; don't pass by, take a rest!!", "title": "Incredible.", "user": "runrunrun247", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121182404}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We stayed in a suite and it had everything we needed and then some. After roughly 15 minutes, the front desk attendant called up to our room to make sure that everything was OK.", "title": "One of the nicer places I've been this year", "user": "HighTech_Redneck87", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120887270}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We are also travelling with our Siberian Husky and she was welcomed with open-arms to our suite. The front desk gave her a \"care package\", which was extremely generous.", "title": "\"Newest kid on the Block\"", "user": "CanuckRedDeer_AB", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118977936}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "All-in-all; warm shower (with ideal pressure), comfortable beds and furniture, great temperature, helpful staff, clean and an overall great night.", "title": "brand new hotel", "user": "libertywillow", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117585178}], "location": {"country": "Canada", "city": "Vegreville"}, "variance": {"poor": 0, "average": 4, "very good": 9, "terrible": 1, "excellent": 30}, "aka": "Pomeroy Hotel Vegreville", "slim_ranking": 0.5}