{"user_rating": 5.0, "review_count": 218, "name": "Pondok Ayu", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I have just returned from Pondok Ayu and had a lovely stay. As with all the other reviews we found the place to be very good value for money - exceptionally clean and comfortable with the rooms lovely and bright and big with all extras included hairdryer, bar fridge, air con, tv dvd, even little soaps and shampoo (which I had forgot to bring) and the staff excellent. The thing I would like to add is that not only is it a lovely place to stay the staff are just exceptionally kind. Unfortunately I pulled a calf muscle when I was in Sanur and couldn't walk. Gede and the staff were so kind and couldn't help enough - even Gede taking time at the airport to make sure that I was OK getting on the plane. We will definately return. Oh and the massages by Wendy were devine by the pool.", "title": "5 STAR SERVICE", "user": "PerthLIz", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98163182}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We are glad we were told about this place, what can I say Beautilful , Beautilful Beautilful.", "title": "Best Kept Secret", "helpfulness": 2, "user": "maxima1953", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98155746}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Gede pick us up from the air[port and our holiday started from there he was so good and helpful,we booked him to take us out one day show us around love it .All the staff is great , we our now planing our next trip to Bali and of course we will stay at PONDOK AYU,", "title": "A little slice of heaven", "user": "Geel0nggirl", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 97909460}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Can`t wait till we go back next time with our friends ,also Breakfast was lovely and the Club Sandwich was the BEST, I COULD TELL YOU MORE BUT I WANT TO , PLEASE KEEP IT A SECRET,YOU HAVE TO FIND OUT FOR YOURSELF.", "title": "Could not have asked for more", "user": "lizg68", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 95724539}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We only stayed 2 nights at the start of our Bali Holiday before we headed off to Gili Trawangan. Our plane arrived from Melbourne at approx 10pm and Gede our driver was waiting at the airport for us with my name on a sign, we had just been hassled by some porters who took off with our luggage so this was a huge relief. From the moment we were picked up till the moment we left everything was wonderful. Friendly helpful staff, spacious clean room, comfy bed, good quiet air conditioning and all so reasonably priced. The other guests were friendly and it was nice to meet over breakfast and get some tips and ideas on where to go and what to see. The hotel is a little out of the way but with free transport or a very cheap taxi ride to the heart of Sanur it was not a problem. We enjoyed all the 3 places we stayed out on our holiday and they were all very different but this hotel is one that we intend to come back to and stay for longer perhaps with our children and grandchildren next time. Well done guys you do it well.", "title": "Excellent, Excellent , Excellent ,Excellent", "user": "carolphillips87", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93760611}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This was our third trip to Bali and again our third time staying at Pondok Ayu. We have 2 young children and were travelling with my sisters family also. We feel very lucky that we have found this little piece of paradise and will continue to come back time and time again.", "title": "Our third time at Pondok Ayu and again ~ amazing!", "helpfulness": 3, "user": "vaitecat", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75239995}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The service is outstanding, immaculate gardens and pool area, huge comfortable rooms and importantly the beds are so comfortable too. The little details like fresh flowers in the rooms, the beds turned down each night, a welcoming smile and the staff are the friendliest in Bali for sure!", "title": "Pondok and the staff have something special that makes you feel so welcomed and special.", "user": "PlymouthSurfer", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74929709}, {"rating": 4.0, "title": "Lovely spot", "text": "Having young children it is great to have the pool literally at your doorstep so no need to make that trek to the pool each day and have to go back to the room for something that is always forgotten.", "user": "albroz", "date": "August 11, 2010", "id": 74703397}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We always feel at home here and as others have said it really does feel like family. Gede and Made you do a fabulous job and to Barb and Steve - it's a gem!! Thank you again for a wonderful holiday.", "title": "Best kept secret - just wonderful", "helpfulness": 1, "user": "BucksMargaretRiver", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71204348}, {"rating": 4.0, "title": "It really as good as the reviews suggest", "text": "We were amazed by the beauty of Pondok and the amazing staff there. The owners were so welcoming that we almost felt we were part of the family, and it felt that we had known them a long time. Pondok and the staff have something special that makes you feel so welcomed and special. 100% 10 out of 10. I cannot praise the quality of our stay high enough. Thanks to the staff and the Benno's", "user": "FreoBob", "date": "June 15, 2010", "id": 67569698}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Thank you, thank you, thank you to Gede (hotel manager) and all the staff at the Pondok Ayu. We stayed there for 10 days this August with our two children age 7 and 10 years. We stayed in the villa (the owners Barbara's when she stays) which was so spacious and on par with five star. We had a large sitting area, a large bedroom, dressing area, mirrored basin area, a sunken bath and large shower all in marble. The best thing was being able to open the curtains in a morning and step straight out onto the poolside. This proved invaluable when we had a day that our son wasn't feeling well and he could lie on the sofa in the air-conditioned lounge while we were on the terrace or in the pool but could still see and hear him.", "title": "A Wonderful Experience", "helpfulness": 2, "user": "MilesFamily_10", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80331327}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Gede was a wonderful guide on trips around the island and always looked after us and made sure the children were enjoying themselves too. He was always very accommodating with our numerous requests to stop and take photos!!! We learnt so much about village culture through him too.", "title": "Fantastic!", "user": "steph_jock", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79722081}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We also ate most nights at Bennos, their restaurant by the sea- the food was delicious and as well as local dishes they also catered for our sometimes fussy daughter! Yes there is a road to cross on your way down to the seafront but we enjoyed the walk seeing the school pick-ups and locals going about their daily lives and if you walk down towards MacDonalds before you cross it wasn't that bad at all! However, there was always someone at Pondok Ayu available to drive you down there if you wanted.", "title": "Lovely", "user": "macsat130", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 78936514}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The breakfast was very tasty every morning and our son is missing the pineapple pancakes!", "title": "Comfortable", "helpfulness": 5, "user": "tankie1", "date": "August 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 75830330}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If you want an extremely good value for money hotel, very clean accommodation, friendly staff and a little piece of tranquility then Pondok Ayu ticks every box!", "title": "Excellent Boutique Hotel", "user": "sherlock1411", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75809309}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Straight from the Airport pick-up this place was one of the easiest places to stay. Everything you want from a major 5 star hotel was here, except the volume of people and over priced rates, which is what we seeked.", "title": "A true find of exceptional value and quality which will be hard to beat.", "helpfulness": 2, "user": "Dirtball007", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91068365}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed in the suite, large enough for a couple and 1 child, but is limited to this, if you have friends or family there is other rooms available which would could provide a great venue around the pool, hidden from the hussle of larger complex's.", "title": "Simply Brilliant", "helpfulness": 1, "user": "nettienut", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88604651}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The service provided was excellent, warm and friendly by all the staff, the breakfast service and options to eat after this time were on hand, if you 'just' wanted to chill.", "title": "Brilliant value for money!", "helpfulness": 3, "user": "Sally_Richard_10", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85449569}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "With the free local drop off, going to the beach is easy, and to the town and isn't a drama to do.", "title": "A little diamond", "helpfulness": 1, "user": "chriscBirmingham", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84195706}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "With this value and setting, there isnt anything to dislike!", "title": "Lovely Boutique Hotel", "helpfulness": 3, "user": "BaliHaiBrightonSA", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83770725}], "location": {"country": "Indonesia", "continent": "Asia"}, "variance": {"poor": 0, "average": 2, "very good": 28, "terrible": 1, "excellent": 187}, "aka": "Pondok Ayu Hotel Sanur", "slim_ranking": 0.0161290322581, "description": "Pondok Ayu is a little piece of heaven located in beautiful Sanur, Bali. We are a small boutique hotel that provides very personalised service by our wonderful friendly staff. Pondok Ayu can be booked on a room by room basis or you can book the entire hotel for a group or family holiday, this can be done direct with us or through a travel agent. We are surrounded by splendid gardens and a wonderful peaceful setting. As we fell in love with Bali many years ago I am sure you will do the same thing with Pondok Ayu and the atmosphere here. Sanur is in a very good position as it is at the start to most of your tours and central to Kuta, Legian, Nusa Dua and Denpasar."}