{"user_rating": 4.0, "review_count": 101, "name": "Poplar Springs-The Inn Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed here on a Sunday night in October. The weather was beginning to cool and the leaves were changing. The Inn is located in the middle of Virginia wine country and has extensive grounds to walk about and enjoy. There are tennis courts and a pond. The hotel portion has a nice lobby area with a living room section and a separate library area. The check-in desk is smaller and more intimidate. Coffee, tea and cookies are set up for guests to enjoy. The rooms are very nice, roomy and comfortable. Our room had a shower that was quite large, but no tub. The sink is located outside the door to the shower/toilet providing access even when someone is in the shower. The rooms also have doors that lead directly to the outside (in addition to the main one that goes out to the hallway), allowing guests to enter the grounds right away.", "title": "Lovely retreat", "helpfulness": 2, "user": "otsthedog", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122724284}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The inn also has a spa that's attached and a detached restaurant. There are some great deals are offered for a night's stay if booking multiple spa treatments. However, these offers seem to be limited to Sunday nights and weeknights. And, the well-regarded restaurant is closed on Sunday night!", "title": "A disappointment given the price", "helpfulness": 2, "user": "29Solenne", "date": "December 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 122262193}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The spa itself is very nice and the treatments were very relaxing. The staff at the hotel were great about advising what activities were available locally and which wineries were open for visits. There were also a number of brochures to local attractions.", "title": "Great place to escape", "helpfulness": 1, "user": "wjones59", "date": "December 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121848269}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Overall, we had a very nice time. However, we did have to drive into Clifton to get dinner.", "title": "Most Beautiful wedding location", "user": "margielm", "date": "October 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 119960662}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I recommend the Inn for Washingtonians looking for a weekend retreat (or a Sunday night retreat)!", "title": "Very relaxing", "helpfulness": 1, "user": "Hannah W", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117956623}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed here for a weekend with the living social offer and really enjoyed it. Great pool area, lovely massages, nice restaurant, good gym! However, I am not sure if we were given a different breakfast because of the living social offer but the breakfast was quite disappointing. We received some ready oat meal out of a plastic cup which we wouldn't even buy in the supermarket. The selection of tea was extremely small and the fruit plate mainly contained some cheap melon. I think this is just not enough for a room that normally costs 450 USD. The staff was very friendly but nobody seemed to be above 18 years old. We would definitely come again because of the lovely setting if there is another offer.", "title": "Nice location, great pool but not worth the regular price", "helpfulness": 1, "user": "Katinska", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117397255}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I stayed here in June for a weekend getaway for our anniversary. We went here because we found a LivingSocial escape deal for the place and it looked nice online, had decent reviews, etc. The website gave the impression of fairly expansive grounds with a wide variety of recreational activity options. While the grounds were indeed very pretty, the \"recreational activities\" amounted to a shed with a couple run-down bikes, some tennis racquets, fishing poles, that's about it. We actually used the bikes and had exhausted all the paths around the Inn within about 15 minutes max. So there's not a lot of trails to run around on the property, contrary to the impression the website gave us. There was a pool that looked nice but we didn't take advantage, and likewise we ended up passing on the spa amenities to do a self-guided winery tour in the area. I hear the spa is quite good so maybe that would have made it better. All that being said, the room was very quiet/nice and clean. Breakfast is delivered to your door in the morning room service style so that was also really nice.", "title": "Nice but not the best option in the area", "helpfulness": 10, "user": "Bosley02", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 116451452}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "As far as overall service...given that this place bills itself as a luxury style inn...the customer service was just so-so. When we checked in, the receptionist was nice but didn't really tell us anything about where things were located, didn't give us a map of the property or anything... we had to come back out later and specifically ask where things were. When we arrived she.just gave us the room key and sent us off with a young man who I assumed would carry our bags to the room. But he didn't even offer to take our bags (not that I'm incapable of carrying my own bags, but it was just a bit weird/awkward!). We are not terribly picky people when it comes to hotel service, but given that the normal price of a stay here runs $600 for the weekend, it seems like these are fairly basic customer service things to train your staff on and things that people kind of expect when they pay that kind of money. If the service we received was sub-par because they knew we had the LivingSocial deal, I would say that's poor business practice as well.", "title": "Relaxing, great pool area, easygoing staff", "user": "sociallyliving", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116361618}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Lastly, to end on a positive note, their restaurant, Manor House, was fantastic and had a gorgeous patio area with live music. The meal was very pricey, even by DC standards, and I'm not sure that I'd go out of the way to Poplar Springs just to come back to eat there...but if you decide to stay there I would say that it's worth checking out.", "title": "Great romantic weekend", "user": "jbwager", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116276863}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Bottom line...if you get a good deal on your stay here, it's not bad, but I would sooner go back to a couple of the comparably-priced bed and breakfasts in Charlottesville or fork over the extra cash to go to Homestead or Greenbrier in WV for a special occasion/weekend getaway. Based on our experience, I feel that this Poplar Springs has a bit of room for improvement.", "title": "Delightful and relaxing", "user": "khboo", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115937197}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "What a charming getaway the Inn at Poplar Springs is. Only an hour from DC, it has an excellent, gourmet restaurant, fabulous spa with fantastic services, and charming, comfortable rooms. We arrived on a Saturday and staying until Tuesday. A good amount of cars were in the parking lot when we arrived, but by noon on Sunday, the place cleared out. We were the only ones there Sunday night, and we think one other room was booked Monday night. For me, it was a little too quiet. And other than breakfast delivered to the room, and lunch at the spa (if you're having treatments), there's no food! For that reason, I think I'd go back, as long as I was planning to arrive Friday and leave Sunday. Really fabulous restaurant - the food for dinner and Sunday brunch was incredible. My husband and I both did a reflexology and Indian message combo at the spa that was just amazing.", "title": "Excellent Weekend Getaway for R&R", "helpfulness": 2, "user": "SGTrvlr", "date": "February 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95434072}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I recently stay at Poplar Springs Inn and did not really enjoy my visit. There was a lady at the front desk, I believe her name is Tammy, she was not very helpful, and had a bit of an attitude when I asked questions about the place.", "title": "Terrible Customer Service", "helpfulness": 5, "user": "njoylife0", "date": "November 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 85561784}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "We stayed for 2 nights and had excellent room service from the boys who deliver our continental breakfast. The housekeepers did an excellent job with the cleaniness of our room and they were very friendly when asked for extra towels and such.", "title": "Enjoyable Overnite Stay - Spa and Restaurant are incredible, the Inn is OK!", "helpfulness": 1, "user": "RIFOSTER", "date": "September 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 81122257}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The Manor house had great food but was pricey. I guess my overall sastisfaction was not great and I do not plan on returning for the price I paid I would have been happier spending it somewhere else.", "title": "Wonderful oasis not far from DC", "helpfulness": 1, "user": "pj510", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67182712}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I stayed at the Inn and did a package that included dinner at the Manor Restaurant and massage at the spa.", "title": "Nice Getaway, but is it worth the price tag?", "helpfulness": 4, "user": "Catsmeow3", "date": "February 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 56464333}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We got wind of this place via Groupon, and bought in. It really was a good deal. We arrived on a Thursday afternoon after making our way from DC (easy) and through some local vineyards (yum). The Inn is new construction and looks a little hotel-ish, but upper end hotel-ish. We enjoyed a nice spring afternoon around the pool with little to bother us. The spa beckoned, but we did not allow ourselves enough time to partake, and our husbands were not eager participants.", "title": "Nice place...... Really nice retaurant", "user": "bryanj1", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115922124}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Dinner at the adjoining restaurant was fabulous.....and the restaurant was not very busy. The wine list was robust, and the only bad thing I might say is the wait staff was a little young for the quality food they were putting out. These were high school kids, not especially trained, but very earnest and hardworking.", "title": "The Spa and Restaurant and Grounds Excellent, Inn was lacking....", "user": "gurlred", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 115455983}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "For the deal we got, I have no complaints. I don't think I would go back and stay given market rates. It would have to be a lot nicer to warrant my unknotting the sock. I would have been happier had I not returned home and reviewed my American Express card bill a month later to see that I was double billed for the experience. I made the call and the error was corrected, I just wish it had not happened.", "title": "Great weekend getaway from DC", "user": "nreyesok", "date": "July 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115199561}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "My husband and I have been to the spa at Poplar Inn and Spa several times and have never been let down. We've always loved the beautiful grounds and were planning to someday eat at their restaurant.", "title": "A wonderful time at Poplar Springs!", "user": "barbarasa", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114718755}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "So, they had a deal with Living Social for half off a room for a night and $60 towards dinner. We tacked on an 80 minute deep tissue couples massage, because you simply cannot go there without getting a treatment at their incredible spa.", "title": "Great wedding!! Horrible customer satisfaction", "helpfulness": 3, "user": "Kymmap", "date": "May 22, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 109395422}], "location": {"country": "United States", "city": "Casanova"}, "variance": {"poor": 12, "average": 8, "very good": 25, "terrible": 9, "excellent": 47}, "aka": "Poplar Springs-The Hotel", "slim_ranking": 1.0}