{"user_rating": 4.5, "review_count": 663, "name": "Porta Faenza", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the Porta Faenza for 4 nights at the end of March 2007. We chose the hotel based on feedback from Tripadvisor. One of the reasons we chose this hotel was that we were advised not to get a hotel on a busy road in Florence, and, when we got to Florence, we realized that this was good advice! The Porta Faenza is on a side street off a busy street close to the main station. We took a train into Florence from Venice, and easily managed the 10 minute walk from the station with our luggage.", "title": "Quaint, cute and comfortable", "helpfulness": 1, "user": "DebSA", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7293775, "likes": {"liked": "— Friendly service and quaint atmosphere", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel is very, very quaint. We found all the people working at the front desk to be knowledgable, friendly and very helpful. They recommended restaurants, made reservations, and were always cheerful and welcoming. A great service offered by the hotel was a computer with free internet access in the lobby area.", "title": "Nice little hotel", "helpfulness": 2, "user": "Cass73", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 7292459}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Our room was small with little space to unpack our clothes, but it was comfortable. It had two large windows which overlooked a quiet parking area - not very pretty, but nice to have some fresh air! The bathroom was small, but had everything we needed (including a towel warmer which was great for drying laundry!).", "title": "Loved Porta Faenza", "helpfulness": 2, "user": "illegallyblonde2", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7245461, "likes": {"liked": "— location", "disliked": "— Only English news on TV, no other English stations, wasn't there to watch tv anyway."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Breakfasts were fine. They offered the usual Italian choice of cold meats, cheese, croissants, pastries, cereal, etc. The choice was not as extensive as the hotels we stayed in in Milan or Venice, but it was adequate.", "title": "Loved the Porta Faenza", "helpfulness": 2, "user": "musicluvr", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7244928, "likes": {"liked": "— Location, friendly service, cleanliness, etc.", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The location was fine, although it was a little far from the 'action' (the Duomo, the Ponte Vecchio, etc.) We enjoyed walking so it was not a problem for us, but if one does not enjoy exploring, you may want to stay a little closer to the river. As mentioned earlier, the location was perfect for proximity to the station or the Mercato Centrale (Central Market). Florence is a fairly small city, so nothing is really too far!", "title": "Fantastic Hotel!", "user": "killiegirl", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7238633, "likes": {"liked": "— Location, staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We had two nights here recently and were very impressed by the hotel and Firenze in general. Our room wasn't large but very comfortable with a small balcony that actually overlooked the glass ceiling of the lobby area!! Breakfast was adequate and the capuccinos excellent. All the staff were excellent and very helpful. We had trouble finding the hotel especially as we drove into Firenze from the Tuscan countryside and had to find parking. There were many roadworks which made it more difficult. After eventually finding a parking garage and dragging our bags quite some considerable distance, we found out that the hotel has a garage quite close by. Our fault for not checking. The hotel is ideally situated close to many of the major tourist attractions and Firenze is very easy to get around on foot. You will go into sensory overload with all the amazing art and architecture. Don't forget to visit the original statue of David by Michelangelo which resides in the Gallerie dell'Academia - my favourite attraction by far.", "title": "Central location", "helpfulness": 2, "user": "CLL040", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10602871, "likes": {"liked": "— Close to many tourist attractions", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Porta Faenza is an ideal base for exploring the sights of Florence - a 5 minute walk from the train station, 10 minutes to the Duomo, 15 to the Uffizi and 20 to the Pitti Palace. The central market and various trattoria are all close by. Desk staff were friendly and very helpful. The room we were given for the first night of our 4 night stay was unpleasant - dark (no windows), double bed (we had requested a king), no bedside tables, etc., but when we asked to be moved on the second day, the hotel obliged and gave us a lovely room on the 3rd floor. Highly recommended.", "title": "Excellent hotel", "helpfulness": 1, "user": "Katharine_7", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10392205}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stayed for 8 days (too long for Florence - overload of sights). Our room was large with a standard sized bathroom complete with bath and shower. Large twin beds with very firm mattresses and pillows. Linen sheets changed every day! Towels beautiful fluffy white and lots of them. Flat screen tv with BBC world and CNN together with italian and french channels. Breakfast good for Italy depends on needs - cereals, bread, yoghurts, fresh fruit (whole), cheeses ham crossants, fruit juices, fresh coffee and tea. Ver friendly and accommodating staff. Location very good for the station and fairly easy to reach all sights. Guide books run down the area as dubious but we did not find a problem. (the top graded hotel in tripadvisor is in a very depressing area).We had problems finding hotel so these directions may be helpful. Exit station at the east end of the concourse i.e platforms to the north, cross over the extreme north side of the bus station immediately adjacent train station and then cross main road via Val Fonda and carry on the in same direction (passed some blue busses in a mini bus station) along a back street via Bernardo Cennini (100 yds) unitil you reach a T junction with Via Faenza, turn right and the hotel is about 100 yds on the right. See previous reviews for suggested restaurants in area although an additional one would be Il Contadino on Via Paluzzulo 71r. Fixed price menu for lunch and dinner mainly locals - no written menu, the owner reads it out - 3 courses €10.50 total for two including wine and coffee €25 simply prepared but as good as other restaurants. For a break from Florence's constant traffic noise try Lucca for the day, walled city with plenty to look at with peace thrown in. Try Paris restaurant fixed price menu near the Palazzo Pfanner.", "title": "We enjoyed the stay", "helpfulness": 1, "user": "ekoleeds", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10216040}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Porta Faenza is in great location and considering we paid 900 Euros for 5 nights in the heart of Firenze, it's almost hard to complain. Its two blocks from the train station and in the heart of the old city.", "title": "Great location and value", "helpfulness": 2, "user": "The_Madcap_Gadfly", "date": "October 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10203937, "likes": {"liked": "— Location Location Location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The room was defnitely large and comfortable with nice furnishings.", "title": "Don't think I'd go back to this hotel", "helpfulness": 5, "user": "sunnylass", "date": "October 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 10165857, "likes": {"liked": "— Good location for sightseeing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "Absolutely superb 3 star located 5 mins from the station and 5 mins from the Duomo.", "title": "Absolutely first class", "helpfulness": 2, "user": "BjGill2", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7196719, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Can't praise it highly enough. Stayed in Room 1 - supposedly a single but with a double bed and huge for the price.", "title": "WONDERFUL March 2-4, 07", "helpfulness": 2, "user": "BSV1823", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7189551, "likes": {"liked": "— EVERYTHING! STAFF, FREE INTERNET, CLEAN", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled with family", "text": "I would urge anyone visiting Florence to check this place out. No point paying through the roof when this place does the job for half the price.", "title": "Great place to be.", "user": "stang05", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7153708, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My family and I stayed in this hotel for 2 nights and booked a quad. The room was spacious, clean and the staff was extremely friendly. They had a nice breakfast and free internet. The location was wonderful near the train station and we walked from the train station to the hotel w/ our luggage. It is also very near the Duomo and the Bell Tower and restaurants. This is a true gem in Florence!! I would highly rec. this hotel", "title": "Very bad service", "helpfulness": 3, "user": "Carrie105", "date": "March 6, 2007", "detail_rating": {"front_desk": 1.0, "value": 3.0, "service": 1.0}, "id": 6919817, "likes": {"liked": "— Nothing", "disliked": "— Their attitude"}}, {"rating": 4.0, "title": "Great little hotel", "text": "We were in Florence in Aug / 05 and the accommodations were the best, great location, we were walking distance to everything. We are planning another trip for Aug /08 and will surely be booking our stay at this hotel again, would recommend this hotel to anyone hands down. Thank you to the friendly staff for all there help. Tony & Carol D. Toronto, Canada.", "user": "fititin", "date": "March 4, 2007", "id": 6908904}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Very nice reasonably priced hotel within short walk to everything you would want to see. AC worked great- important because it was pretty warm the time we visited Italy. Nice front desk, close cafes and trattorias, short walk to train- all in all a really good stay!", "title": "viva Porta", "user": "mwa55", "date": "July 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17751336}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "What can I say? It was an amazing experience. The room was large by European standards. Everything was impeccably clean. We requested (and got) a small balcony. The staff was knowledgeable and had wonderful recommendations for outstanding restaurants. Americans will probably find the pillows uncomfortable, but they are better at this hotel than in most of Europe. Breakfast was a feast; as large a \"continental breakfast\" as I have seen. The location was amazing, right in the center of everything. I know the city pretty well and when we booked the hotel, I did not expect it to be near as nice as it is, given the amazing location and reasonable price, but this is a true deal.", "title": "Great hotel, great price", "user": "Copanthecat", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17692894, "likes": {"liked": "— Everything! Truly, though the location is unbeatable.", "disliked": "— ?"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This hotel was very cute and small, and located on a small quiet street. The front desk staff were extremely nice. We did have to give the room key back to the front desk staff every time we left the hotel due to security issues, but it was not troublesome at all. There was a computer available downstairs for free Internet access.", "title": "Nice Little Hotel", "helpfulness": 1, "user": "DonnaMartinOriginals", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17112173}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "The room itself was smaller but very clean and cute. The bathroom is a good size, but nothing compared to the bathrooms Americans are used to in hotels. The usual conveniences were provided: TV, closets, hair dryer, etc.", "title": "Great stay at Porta Faenza", "helpfulness": 1, "user": "cmhult", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17078145}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The breakfast was decent and included meats and cheese and pastries. The only issue some people may have is that from the hours of about 8AM to 5-6PM, there are construction workers working somewhere around that area, and we could hear them talking and laughing loudly if we were in our room between those times (which was not very often, since we were out most of the day), so it didn't really bother us. However, if people were planning on taking an afternoon nap, then I would not advise that you stay here.", "title": "Wonderful place to stay", "helpfulness": 1, "user": "JAMoUSA", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17078106, "likes": {"liked": "— The breakfast and internet", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I had the pleasure of staying at the Porta Faenza Hotel in Florence in April of this year. The hotel is on a quiet street close to everything. We had a front room and the room was very quiet. The people at the hotel were exceptionally nice and helpful. The hotel has a great breakfast room and internet connection. We ate at a restaurant right down the street and had great meals. We had rented an apartment in Rome, and although we enjoyed our stay, we realize now that when you travel to a new place it is nice to stay in a hotel with a staff that can help you find your way around. We thought this hotel was way above its rating and was an excellent choice in Florence. The hotel is near the train station and we walked to the hotel after arriving from Rome. Very convenient to everything.", "title": "Great stay in Florence, Italy", "helpfulness": 2, "user": "PAPhoebe", "date": "August 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18754769, "likes": {"liked": "— Clean and had a nice bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had a nice time in Porta Faenza Florence. Location is very nice. We could walk from the SMN train station and to all major sites. Very close to Duomo Church, Piazza della Signoria and Ponte Vecchio. Front desk personel was very helpful and kind. They have a PC in the lobby with free internet access. Room and bathroom were nice and clean. They could improve the breakfast which wasn't very good. Overall, we had a very good time there and would come back.", "title": "Nice stay in Porta Faenza", "user": "GeorgeAlbuquerque", "date": "July 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18419212, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This is a really nice hotel - more than a \"bed and breakfast\" that my girlfriend and I expected. Room was relatively spacious, clean-clean-clean. Nice firm queen-size bed as we requested. Air conditioning great. Bathroom also -- nice thick towels.", "title": "Ideal hotel close to train station, tourist sites, inexpensive restaurants", "helpfulness": 2, "user": "MelSnyder", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18385883, "likes": {"liked": "— Comfort/cleanliness/location", "disliked": "— Internet flaky"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Very helpful staff - my girlfriend broke a wheel on her suitcase on the cobblestone street, and the desk person marked the map where she could find replacements at different prices and qualities. Late at night, the desk clerk saw me leaving with a bag of laundry and directed me to a \"nicer\" laundry a bit farther but indeed cleaner.", "title": "Great Place!!", "user": "lipglossjunkie", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18336982, "likes": {"liked": "— The bed", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Just down the block is a great little restaurant \"Nerone\" that we mistook at first for a pizza counter, but inside it was a lovely full restaurant with reasonably priced dishes \"to die for.\" And a Chinese-run grocery that will custom-make delicious sandwiches for you for less than the \"paninis\" available everywhere (and cokes for 58 cents vs. 3+ euros elsewhere!)", "title": "Average place", "user": "DTNJLAW", "date": "July 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17864722, "likes": {"liked": "— Convenient location, reasonable price", "disliked": "— the first room was tiny and the bathroom was dirty"}}, {"rating": 4.0, "title": "Great Hotel", "text": "I would recommend this hotel to anyone. Helpful staff, nice rooms, perks (free internet in lobby, great breakfast)...very accommodating. We stayed here with a 7 months old, and they provided hot water to warm a bottle, crib etc. The area was very centrally located, though maybe not as nice as some of the others, though I would definitely stay here again!", "user": "mecca2425", "date": "February 26, 2007", "id": 6842379}, {"rating": 4.0, "title": "Bed was Best", "text": "Just got back from 5 nights in Florence staying at the Porta Faenza. We booked this hotel after reading all the rave reviews on Trip Advisor. Ideal location if travelling by public transport but you could never find it driving yourself.( Who would want to?)", "helpfulness": 3, "user": "bojitoes", "date": "February 21, 2007", "id": 6822127}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Have to say that it was one of the noisiest hotels we have ever stayed in - unfortunate to get room 101 at the front of the hotel - do other travellers to Florence agree that -forget the bikes, the dogs or the ambulances- the noisiest sound is the sound of cases being wheeled along medieval streets!", "title": "Great hotel", "helpfulness": 3, "user": "cgraves42", "date": "January 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6716643, "likes": {"liked": "— very central"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Anyway bathroom flooded first night which staff soon solved; breakfast was adequate but very boring - particularly on day 5. The staff were pleasant and very,very helpful and the towels were all changed every day. But the best thing was the bed! One of the largest and definitely one of the most comfortable beds we have ever slept in - certainly in the marriott class.", "title": "Superb hotel, stay here if in Florence!!", "helpfulness": 3, "user": "MrWhyte", "date": "January 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6598621, "likes": {"liked": "— Quality of room and location", "disliked": "— Heating"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "So, great for 2-3 days exploring, reputation is well deserved but if offered Room 101 consign it to Room 101!", "title": "Great budget hotel", "helpfulness": 3, "user": "divatravels", "date": "December 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6353067, "likes": {"liked": "— The staff", "disliked": "— small elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed 4 nights at this very reasonable rate hotel in Florence.", "title": "A great deal for the price", "helpfulness": 1, "user": "Minn.Bound", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11067914, "likes": {"liked": "— The location to the train station, easy to get to and get around from.", "disliked": "— It's a little noisy in the morning, but Italy is since they have to pick up garbage and it's right outside."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "It's about 3 blocks from the Train Station so it's very easy to roll your luggage there.", "title": "Great Florence Hotel", "helpfulness": 1, "user": "crazyzete", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11030268}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel is clean, a large bed, great breakfast that's included and the hotel staff went out of their way to help us. The staff speak english. (they booked reservations us for tours in the Wine Country and helped us reserve a car)", "title": "A great hotel", "helpfulness": 2, "user": "rjberry77", "date": "November 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10873004, "likes": {"liked": "— Location and quality for a very reasonable price", "disliked": "— The noisy laundry lorry at 6.30 in the morning"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "There are many wonderful restaurants within a couple of blocks of this hotel, which is always nice after you've been out exploring the city all day.", "title": "Great Hotel in Florence", "helpfulness": 1, "user": "WorldTraveler89", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10770465}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "When we go back, we will stay here again.", "title": "What a find!", "helpfulness": 3, "user": "BettyOxon", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10618420, "likes": {"liked": "— lovely, genuine staff", "disliked": "— nothing - all fab!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "What a great place! My boyfriend and I stayed here at the end of March, 2008. Breakfast was included, a nice mix of cereal, fruit, pastries and coffee. Also, our room was really nice and clean, beautiful big bathroom with a tub! Also we had a little private balcony to relax on! The hotel is really nicely located, a couple blocks from the train station and a couple blocks from the central market. Staff was friendly and helpful. We walked everywhere, no problem! I would totally stay here again, by far one of my favorite spots in Europe.", "title": "Fantastic Find! Highly Recommend", "helpfulness": 2, "user": "hmroff", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15067819, "likes": {"liked": "— outside patio and bathtub", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This was our cheapest stay But probably our most enjoyable! The price was a steal (70 Euro a night) & we informed the hotel that we were on our honeymoon. They were very helpful, courteous, informative & welcoming. They Upgraded us. Our room was beautiful, homey, and spacious. The view wasnt great but florence is a pretty packed city & we dont know if ANYPLACE in Florence has a \"view\". They had free internet & our room came with breakfast-italian style. The Hotel is a small building because its a converted 19th Century Home. But it is immaculately clean & well kept . Gave us a feeling of old italy- with the service & pleasantries of today. Wouldnt trade it in for a more expensive place in florence even if given a choice! We LOVED it & would Definitely go back if the opportunity presents itself.", "title": "What A Gem !!!", "helpfulness": 3, "user": "yaakovyitz", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14664045, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "When I arrived here midweek after lugging my suitcase around the Eurostar and train station, I was surprised to see how close the hotel was from the train station! I could literally roll my unwieldy suitcase to it within 15 mins. And the best part - you don't hear any of the traffic noise once in the hotel.", "title": "Lovely, Lovely hotel", "helpfulness": 4, "user": "Kiran G", "date": "March 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14607777, "likes": {"liked": "— The ammenities in the room, the staff and the location", "disliked": "— There was an odd smell about, but I'm just hyper sensitive about smells."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The front desk was great and they have free wi-fi access here, as well as a computer and printer in the lobby for guests - very convenient.", "title": "Fantastic Hotel!", "helpfulness": 6, "user": "ndcmuna", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14593080}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The room was so nice, with a big bathroom, a flat screen TV (which I never watched, but it was still nice to have) and a little balcony to relax on when the weather is nice. Alas, the weather was not nice when I was there but it was still nice to know that it was an option!", "title": "Excellent location", "helpfulness": 2, "user": "scott s", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13668697, "likes": {"liked": "— Location", "disliked": "— No restaurant!!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Very nice little hotel. Amazing price for Florence. Very clean. Staff very nice and helpful, helped us book tours.", "title": "very nice little hotel", "helpfulness": 1, "user": "adgirlv", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12606516, "likes": {"liked": "— location and service", "disliked": "— shower pressure"}}, {"rating": 1.0, "title": "Avoid!", "text": "I must mention the shower pressure is not great, but the rooms are ok.", "helpfulness": 6, "user": "sfjonathan", "date": "January 7, 2008", "id": 12412942}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Great location.", "title": "Great Hotel and located in the heart of florence", "helpfulness": 2, "user": "dmf379", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12377794}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed here for one night.", "title": "would go back ..", "helpfulness": 2, "user": "ann_tess", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12345298, "likes": {"liked": "— near the station and all attractions and big room", "disliked": "— pipe was a little leaky"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "A few things:", "title": "Charming staff", "helpfulness": 6, "user": "Viaggiatoreinglese", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11597254, "likes": {"liked": "— The staff, the ambience, the convenience of its situation", "disliked": "— The fluctuations in the shower temperature, the tiny wardrobe"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Just returned from two days at this hotel, and wished it had been longer. Our room was on the top floor with a terrace, although we had only booked a standard room. The bathroom was huge (the shower would fit at least 3 people!!). Location is perfect, five minutes from the train station and easy walking distance from all the main attractions.", "title": "Loved this hotel", "helpfulness": 2, "user": "Barbara02", "date": "October 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10072767, "likes": {"liked": "— location, helpful staff, nice rfoom", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Breakfast was very varied, and trattoria Enzo & Piero two doors away is excellent for dinner, though you may need to wait if you have not reserved a table.", "title": "Loved Porta Faenza", "helpfulness": 1, "user": "gmeeei", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10063179}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We would definitely return to Florence and to this hotel.", "title": "Great hotel!", "helpfulness": 1, "user": "jenthefir", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10017219, "likes": {"liked": "— The room and the location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Hotel is lovely, staff very friendly and helpful, the room we stayed in was big,clean and comfortable. Location great we walked everywere, very central but not on a noisy streeet. Very close to the train station.", "title": "Good value and good location", "helpfulness": 2, "user": "Rushman2112", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10013371, "likes": {"liked": "— Location, good staff attitude", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We have just returned from six days in Florence and stayed at the Hotel Porta Faenza. I would highly recommend this hotel. It was situated within walking distance of most of the major tourist places, and very close to the station which serves as a good base for visiting Pisa, Lucca, Rome etc.There are plenty of Trattorias/pizzarias close by and an indoor food market surrounded by outdoor market stalls selling clothes, crafts etc. Our room was a double and we found it to be a good size, clean, comfortable and with tasteful decor. The Michaelangelo prints were a nice touch! Breakfast was great with a good selection. The coffee was fab. We found the staff to be polite and very helpful. We would definately book this Hotel again if we are lucky enough to return to Florence and we thoroughly enjoyed our stay there.", "title": "Fantastic Location - beautiful room", "helpfulness": 2, "user": "CathyC", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10006196, "likes": {"liked": "— Location, clean spacious room, comfy bed"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I stayed at Porta Faenza for three nights in early June. After a long trip there, the hotel was exactly what we had expected based on the reviews read here before booking. The location was perfect, about a block or two from the train station, and a 10-15 minute walk to all of the major attractions. The road itself, Via Faenza, has its own charm and immediately reminds any traveler why they came to Italy to begin with. The rooms were clean, comfortable, and quiet. Free internet access, great breakfasts, and most important, a very helpful and friendly staff that is more than willing to help you out if you need it. I will stay there again on my next visit to Florence.", "title": "Exactly what others have said...", "user": "aphanna25", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7872072, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I was very happy with this hotel. It is clean, nicely decorated and most importantly...air conditioned! (an air conditioner that you can actually feel unlike everywhere else in Florence)....The location of the hotel iwas excellent....very close to the station and very close to the attractions... overall, I was very pleased.", "title": "very enjoyable stay at the hotel porta faenza", "helpfulness": 1, "user": "Michie243", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7837666, "likes": {"liked": "— air conditioning, close location to station and attractions", "disliked": "— no free breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I guess for a three star hotel this is fine, but I've become accustomed to four star hotels so I was disappointed with Porta Faenza. The shower is tiny! I could barely fit and I am a small female. My husband was banging around in the shower everyday because it was so small. Forget about shaving your legs! On another note, the staff was very friendly and helpful, and the location was convenient, and the breakfast was sufficient.", "title": "okay location, nice staff, okay room", "helpfulness": 2, "user": "lbeam", "date": "June 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7741737, "likes": {"liked": "— Very friendly staff", "disliked": "— itty bitty shower"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I recently spent five nights in the Hotel Porta Faenza in Florence and loved it. The Hotel is ideally located - near the railway and bus stations (circa 5 minutes walk) and not more than 10 minutes walk from the Duomo. The staff at the hotel were excellent and very friendly. Breakfast was very good: buffet-style with a very wide range of foods and juices on offer. A choice of coffee was served and the coffee was probably the best I had during my stay in Florence. The breakfast room was authentic & had a cosy atmosphere. The common areas though relatively small, were relaxing with the provision of some couches and books to read and also an internet facility for free use by guests. My bedroom was well equipped, clean & very comfortable. It was quiet at night. There was air-conditioning, but I did not use it, preferring to leave my window open at night. The hotel provided a plug-in anti-mosquito device which I thought was a good touch. The weather during my stay was hot & sunny and I went on two bus tours with a local tour company - offices located on Via Antonio (about 3 minutes walk from the hotel) - to Sienna/San Gimignano and the Chianti Wine District. The guides were excellent, sharing the heritage of the respective areas through stories and anecdotes. Florence provided many treasures - on both sides of the Arno River - for discovery and similar to most cities, the best & least expected discoveries are often achieved while on foot.", "title": "Authentic Italian Hotel in Florence", "helpfulness": 5, "user": "EireMember", "date": "May 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7548467, "likes": {"liked": "— I liked the staff, especially at the front desk & breakfast room.", "disliked": "— I have no complaints to report thankfullly."}}, {"rating": 5.0, "title": "Wonderful experience!", "text": "I read a lot of reviews before booking over Easter weekend April 6-9, 2007 and ended up making two reservations: one at Porta Faenza and one at Santa Maria Novella. I ultimately decided to try Porta Faenza and am so very glad I did. The hotel is located to the left (quiet part of Via Faenza) off Via Nationale from the train station.", "helpfulness": 2, "user": "MartzBoston", "date": "April 18, 2007", "id": 7390639}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My husband and I just returned from a 10-day trip in Italy and this little gem in Florence was one of the best places we stayed. It's very conveniently located to the main SMN train station (literally a 5 minute walk) and easy to get to every other place in Florence. That's the beauty of Florence is that it's a walking town. You won't ever need to use public transportation if you stay at this hotel. We loved having free internet access. The breakfast was fantastic (a nice, big buffet with many options!) And our room was beautiful. The nicest bathroom of all our hotels. The staff was always polite and helpful and overall we just really loved our stay here at Porta Faenza.", "title": "Fantastic Find in Florence!", "helpfulness": 1, "user": "mafitoto", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17025190, "likes": {"liked": "— Location. Free Internet. Great breakfast. Very clean.", "disliked": "— A little more expensive than other hotels but totally worth the slight price upgrade!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Florence was the first stop on our 2 week vacation, and we loved this place. The room was HUGE, and the bathroom of equal size. I will make one comment about the bathroom though. The shower is not like what you would find in the US, but we had no problems with it because we had seen similar in recent travels.", "title": "Faenza was a great hotel!", "helpfulness": 1, "user": "Hokie98", "date": "June 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16950259, "likes": {"liked": "— The staff and its location.", "disliked": "— Nothing!!!!!!!!!!!!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The staff were great and actually pointed us to one of our most memorable dining experiences of our trip (Zsa Zsa). The hotel is not far from the Duomo, the train station, an open air leather market and some really good restaurants and gelato shops. We had no problems walking to all of Florence's main attractions from this hotel. The price was good, and we had a great time here. We would definitely stay here again.", "title": "A real gem of a hotel!", "helpfulness": 1, "user": "taxlady", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16856001, "likes": {"liked": "— Location, decor, size, cleanliness.", "disliked": "— Nothing, no negatives."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Staying at this Hotel was truly the highlight of our trip to Florence. It was very close to the train station, but yet the neighborhood was very nice. I recommend heading east out of the train station, and not out the front main entrance. Head out towards where the bus station is on a small side street, then turn right on Via Faenza you can't miss it on the right hand side. It is at most a five minute walk. Also on the small side street to the back of the hotel is where you will find a mini market, and the laundrymat. We were traveling as a large party of 10, and bookked two quadruple rooms and one double. All the rooms were large, very clean, and with superior linens. The towels were the some of the nicest we could ever hope for, and we were given plenty of towels, and there was a chest with extra blankets, everything very clean and fresh smelling. There was a good safe in the room, and all three of our rooms had a very nice tub/shower combination, plus an extra shower. The hotel was not noisy, and it had a lift. The staff was very professional and pleasant. Alberto was especially helpful to my father as he lost his cell phone and Alberto helped him out the best he could. They also called a taxi for us so we could go to the Uffizi museum and the Accademia, and they did the reservations for us ahead of time to cut down on the lines. The breakfast was the best we had in Italy, with plenty of fresh fruit, delicious breads and pastries, cereals, juices, yogurt. They made you to order your capuccino, and for the children fresh hot chocolate made with real chocolate, not powdered chocolate. At the front desk they have a small bar where you can get a glass of wine or cup of tea in the evening. We had the best dinner at Enzo and Piero which was just a few doors down, and a great pizzeria also a few doors down, and pastries and gelato on the corner. Around a block and a half away was the laundromat where we were able to wash our clothes. The San Lorenzo market was just across the the main street and a short walk. Highly recommend this market it is where we found the best prices. We were so happy we picked this hotel, all the family loved it and hope to come back one day.", "title": "Great deal", "helpfulness": 4, "user": "JPIowa", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 15333488, "likes": {"liked": "— Location", "disliked": "— Small room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I stayed at Porta Faenza while attending a conference at the Fortezza da Basso. The choice worked out great.", "title": "What a find!", "helpfulness": 3, "user": "PamjoHertfordshire", "date": "April 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15125945, "likes": {"liked": "— Location", "disliked": "— Nothing"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 50, "very good": 287, "terrible": 5, "excellent": 314}, "aka": "Porta Faenza Florence", "slim_ranking": 0.141304347826, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Hotel Porta Faenza is situated in Via Faenza - one of the earliest medieval streets in Florence - near Porta Faenza, a gate in the fifteenth-century city walls. It was created in 1997 through the restoration and conversion of Palazzo Pegna, the old residence of a family of merchants, whose original structure has been kept intact. Porta Faenza was part of the city walls and was situated at the end of what is up till now called Via Faenza. It has been so called not for being placed towards the town in Emilia, but from the name of the Nuns from Faenza, who had their convent in the neighbourhood once. Between 1534 and 1537 Porta Faenza was joined to the Fortezza da Basso without being demolished: by watching attentively you can still distinguish its squared profile in the central bastion towards the city or its arch from the inside of the fortress. The Hotel will make you savour the warm atmosphere of the old-time Florentine houses: the tile floor, the exposed beams, the old tools scattered everywhere, together with all the comforts will make it your ideal home in the old Florence. The Hotel Porta Faenza is centrally located, very close to the main railway station (Santa Maria Novella), to Palazzo dei Congressi (the Conference Centre) and to the Fortezza da Basso. The most interesting monuments and museums in Florence are within easy walking distance. For being situated in a pedestrian precinct, the Hotel is a quiet and pleasant place, the ideal point of departure for you to discover Florence and its artistic and cultural life."}