{"user_rating": 4.5, "review_count": 740, "name": "Porto Santa Maria Hotel (Porto Bay)", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I chose this hotel because of the Tripadvisor reviews and as usual with this website the reviews were accurate. The hotel was excellent, clean, friendly and very well located. The local restaurants were good value. I did afternoon tea at Reid's. Wouldn't bother again. Reids seemed very stuffy. The afternoon tea was OK but nothing special- jam still in pots from the supermarket. Only one piece of advice. Do not pay for a sea view. I paid £75 for a week for this. All the rooms have sea views, some better than others. My room was a ground floor room, which was very handy for the swimming pool but not for observing ships, although I could see the sea. Thanks to tripadvisor and all the people who contribute. I have never had a bad hotel since I started using this site.", "title": "Excellent- don't pay for sea view", "helpfulness": 26, "user": "Edinburghtraveller", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3658276}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I feel I must echo the views of early reviwers regarding this hotel and the staff.From the moment you step into this hotel to the time you leave you are treated absolutely wonderful.The bedrooms are maintained to a very high standard, and the view from the rooms facing the sea are terrific.The food is of an excellent standard and nobody could complain about the choices for breakfast!!.I would also recommend a beauty/relaxing treatment with Barbara in the hotel.", "title": "Wonderful", "helpfulness": 13, "user": "Linda S", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3637903}], "location": {"country": "Portugal", "region": "Madeira Islands", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 21, "very good": 167, "terrible": 4, "excellent": 539}, "aka": "Porto Santa Maria", "slim_ranking": 0.131868131868, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Porto Santa Maria lies at the water's edge in the very heart of Funchal's old centre. Its close relationship to the sea, the outstanding and exclusive views over the harbour where the cruise ships dock, its picturesque surroundings and the unique flavours of its cuisine result in genuine urban tranquility. A congenial hotel offering 146 rooms, restaurant, bars, direct access to the promenade, outdoor pool, indoor pool, SPA, gym, parking...all in the heart of the city."}