{"user_rating": 4.0, "review_count": 463, "name": "Portland Regency Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel is very popular and in my opinion it is possibly slightly above average but it is located in an extremely convenient spot. My wife and I stayed in a standard room that shows that it was converted from the armory that it once was. The bathroom had a skylight type window that showed lots of caulking and leak stoppage and the bathroom looked like it was in need of updating. The bed was comfortable and the room itself was okay. The hotel lobby and the rest of the facilities are done very well. The staff is very friendly and goes out of their way to make you comfortable. I would stay here again if the price was right. If you are looking to walk out the door and hit the bars and restaurants in Old Port you cant do much better.", "title": "Great location, average hotel.", "user": "brittdad", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 159940555}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I stayed here from a tuesday-thursday in the first week of April. The hotel has an awesome location - with many restaurants and shops within walking distance. It's in the center of old port, cobblestone streets and all. The room was a good size, had all the standard amenities and some extras (bathrobes, ipod docking radio etc.) and the shower in the bathroom was one of the nicest I've seen for a standard room.", "title": "Great Spot in Portland", "user": "Kitzy22", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159855270}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel fitness area had more equipment than any hotel gym I've seen before. To get to the gym, you have to go through the spa, which means you can use the spa locker rooms, hot tubs and steam rooms, all of which were extremely clean and well maintained.", "title": "Among the Best in Downtown Portland", "helpfulness": 1, "user": "owen8484", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157553476}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We had dinner at the armory lounge one night - it was actually pretty busy for a hotel bar. The food off the bar menu was decent - I especially liked the cheese plate as a late night snack.", "title": "Excellent Anniversary Stay", "user": "TTraveler27", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157083020}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel provides valet parking for about $12 a night, which is really useful since there isn't a lot of parking in the old port district. You can take your car out and have them park it again and they'll still charge you just for the day.", "title": "Nice get away", "user": "deskk", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157078084}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "So the good .... the hotel is ideally located in the center of downtown within walking distance of everything including great restaurants, bars, and shops. The Armory Bar at street level is a lot of fun ... low lighting, dark woods, usually bustling and plenty of seating. Attentive bartenders top it off making it a great hangout - mostly people over 30.", "title": "Good & Functional - Great Location", "user": "wavey38", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 154941153}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "As for the so so .... the rooms. although clean and modern, are nothing to speak of. Our room was quite dark (I am a creature of the sun) and it took half an hour for the heat to kick in once we turned it up.", "title": "Spa for two", "user": "Glenna W", "date": "March 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 154546017}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The restaurant is beautiful blending the perfect mix of modern and historical with plush seating and large windows to let in the sun. Our server was attentive, but breakfast was nothing to speak of despite being pricey.", "title": "Great place and location", "user": "cruises8", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154538928}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My husband was kind enough to book massages at the Regency for my sister and I. The location is fantastic and with sparse parking I appreciated the perk of valet parking. The therapist was super . I would recommend the following: Book as far in advance as you can. I had to share a treatment room with my sister and was not able to have a hot stone massage. I would also recommend that if you are getting anything at the spa as a gift, ask them to run your card with you. I had to sign for the massages and would have preferred to have not seen the price. I have stayed at the Regency before and am never disappointed.", "title": "A terrific spa experience", "user": "ConnecticutCTJudge", "date": "March 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 154051581}, {"rating": 5.0, "title": "Stay here in Portland", "text": "I have nothing bad to say about this hotel. The room was great and very clean. The view from the balcony was a welcomed site to wake up to every morning. All of the staff we interacted with was very friendly and the food/drink/service we had in both The Armory and 20 Milk Street were impecable.", "user": "kcaruso322", "date": "March 5, 2013", "id": 153803476}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I just returned from our second stay at the Regency Hotel. We enjoyed our hot weekend by the waterfront. The location of the hotel is perfect if you want to just park the car and be able to walk to all the great restaurants and shopping that the city offers. The staff is is friendly and pleasant.", "title": "Fine Hotel", "user": "PottDuff", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 162816231}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The only quirk we had this time around was that our room (#311) had such a horrible odor. When we first walked it we chaulked it up to cleaning solutions but the odor lingered for the entire weekend. When I mentioned it to the desk staff I was told that they were totally booked and had no other room to move us into. My son and daughter-in-law joined us Saturday and their room was fine.", "title": "Great Place", "user": "Patricia C", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161728536}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The hotel has a nice lounge that serves awesome martinis and is a great way to end the day if you enjoy a well made cocktail. The bar staff is friendly and make for an enjoyable time.", "title": "Softest bed in Maine", "user": "mERYLnASS", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 161433168}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I recommend this hotel highly and will return again for a great weekend escape.", "title": "Great Hotel, Staff, and Location", "user": "MillieMom", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160507752}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The Portland Regency is a fabulous hotel. Location is IDEAL. Everything is within walking distance. Portland,Maine is the best walking city I've ever seen. Our room at the hotel was large and had everything one could want. People were friendly and very helpful. Gave us tips on places to eat and things to do. The spa is great. Big Jacuzzi, great steam room and sauna. We will definitely go back here.", "title": "Gorgeous Boutique Hotel Set in the Heart of the Old Port", "user": "Elise C", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160355635}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This hotel is spectacular. I can't say enough about how clean it is, how unique it is, and you're right in the Old Port within walking distance of everything good that Portland has to offer. You can't go wrong here.", "title": "Wonderful, special", "user": "whisky3", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156998159}, {"rating": 5.0, "title": "2nd time's a charm", "text": "Stayed here for the second time and it was just as wonderful as the first. Homemade cookies upon arrival in the lobby. The staff is helpful, kind and courteous. Simply a class act staff. Highly recommend for anyone thinking of staying in Portland.", "user": "SalB61", "date": "April 7, 2013", "id": 156932588}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I live in Portland and this is by far the nicest hotel we have here! I've stayed here twice and the the staff is excellent, they upgraded our room for free for the night because they had some open rooms! Nice clean and quite room with a deck that overlooks part of the Old Port. Best sleep I have ever had! The Armory Lounge is right downstairs where the bar tenders are wonderful and the drinks are perfect.", "title": "Great historic hotel, the best in Portland!", "user": "Shannon O", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156891355}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Possibly Portland's nicest hotel. Perfectly comfortable and we enjoy staying there for its convenience to the Old Port and the Casco Bay Islands. Best to try to secure a room on the east side of the hotel since the noise on Market Street can be annoying or distracting. (Fore Street Billiard hall is the culprit.)", "title": "Have stayed here twice and would recommend it to others.", "helpfulness": 1, "user": "BWSiegenthaler", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155926922}, {"rating": 4.0, "title": "2 amenities to take advantage of...", "text": "The hotel is in a historic building, but the rooms have been updated - so, it doesn't have that haunted mansion feel. The rooms were fine and clean, but I have to say, there were two amenities that really stood out to me.", "user": "keepthelighton4me", "date": "March 24, 2013", "id": 155557864}], "location": {"country": "United States", "city": "Portland"}, "stars": 3.5, "variance": {"poor": 30, "average": 51, "very good": 145, "terrible": 16, "excellent": 221}, "aka": "Regency Portland", "slim_ranking": 0.352941176471, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}