{"user_rating": 4.0, "review_count": 64, "name": "Porto del Colombo Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Porto del Colombo is in the old town of Chania; perfectly situated for strolling around the port and exploring this fascinating place. Our room was spacious, comfortable and offered lovely views of the port. But what made this hotel special for us was the amazing help offered by Eleftheria & Roula, the 2 delightful young ladies on reception, when we needed urgent assistance to re-book flights to Athens.", "title": "Perfect location & thank you to Eleftheria & Roula", "helpfulness": 1, "user": "Peter_Joan", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120188565}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Had a Great experience at porto del colombo. The staff was very friendly and informative. The hotel was in the middle of old Chania town and the room was super clean. When you visit this hotel Just be sure to bring your own washcloth for they do not provide. Others complain of the stairs to climb to the sleeping quarters, but there wasnt always a such thing as elevators this building is 600 years old. Loved this charming hotel and would do it again.", "title": "Great Experience", "user": "Rwoodgett", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119690129}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Great location. Friendly service. The only thing is you can't drive to the front door of the hotel because of it's location in the Old Town of Chania. Don't let this discourage you from booking there. Put a little effort in lugging your bags to the hotel. Once you've set up camp in your hotel room, the location of the hotel is excellent. Chania is a great town to base day trips out of too. I'll visit there again and stay at the Colombo.", "title": "Perfect for my wife and I", "user": "Jamiemac99", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117411722}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This hotel is in the lovely old town area. The rooms were nicely decorated, though no balconies. The staff were very courteous and helpful at all times. Even though we were on thye 3rd floor and had 3 flights of stairs to our room it was worth it. The breakfast was ok. The hotel is over 600 years old and has lots of history. We had an amazing view of the harbour from our bathroom! Would recommend thoroughly. Again no tea and coffee making facilities though. Unable to park cars in the old town area, but easy parking close by.", "title": "Charming hotel in a beautiful area", "user": "lyn1954", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114691680}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Cosy hotel with excellent service. Esmeralda was very friendly and helpful, giving us a ton of tips for food & trekking at the Samaria Gorge. Quaint rooms, great location to Old Chania Town.", "title": "Cosy Hotel, Excellent Service", "user": "Lindaa78", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114539219}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I spent a night at Porto del Colombo in late July. The room was on the second floor and had a view of a small road. The room was quite cosy and nicely decorated. Clean and comfortable as well. I wish the bathroom was a more cared of. Although it was clean and with a small tub, i wish it was more maintenanced.", "title": "Good Choice", "helpfulness": 1, "user": "psixitaxidiara", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 73651306}, {"rating": 3.0, "stay_parameters": "Stayed June 2010", "text": "The breakfast was served at a small but very beautiful parlor. It was served and not in buffet and though adequate, did not provide with a large variety . The personnel was friendly and helpful", "title": "Charming but limited hotel in historic Chania", "helpfulness": 1, "user": "LAS021", "date": "June 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 68584658}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "I would describe Porto del Colombo more as a bed and breakfast than a hotel. The rooms are old and very charming, but charming comes with certain limitations. As other reviewers have mentioned, the stairs are probably the hotel's biggest detriment. Rooms on the top floor have wonderful views, but carrying your luggage up that spiral staircase is challenging. Even carrying my body up three flights of stairs each day was challenging! The bathrooms on the top floor also have very, very small showers with glass doors. If you drop the soap, there isn't enough room to bend over and pick it up.", "title": "Loved it! Close to the harbour, very very...", "user": "Alison_cooper", "date": "June 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 67294757}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The advantage of the Porto del Colombo is its location in the historic district. Wonderful restaurants and shopping are in easy walking distance. The staff is very friendly and helpful. Breakfast was good but basic - yogurt, bread & butter, coffee, OJ.", "title": "Amazing hotel in a great location!", "user": "SydneyChocolateGirl", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67207949}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "Loved it! Close to the harbour, very very nice room!! Modern bathroom but antiquie bedroom area. Breakfast rocked!!", "title": "Great little hotel with lots of charm", "user": "JuergenL", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64753768}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Great location in the old part of town near the harbour. Very friendly and efficient staff.", "title": "We loved it and we'll be back", "user": "konstantinakar", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114064915}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "If you are looking for a charming, historic hotel, this is the place. Built in the 1600s, the rooms have original tiny windows and old stonework. However, be aware that there is no elevator, bathrooms are extremely small with tubs/showers that would not fit someone over 5'10\". Also, there are no nonsmoking rooms thus they all smell of smoke. They provide towels, bar of soap and hairdryer in the bathrooms. Rooms are all up at least two flights of a lovely but winding and narrow wooden staircase. We are fit and brought only one suitcase each but were huffing and puffing to get up to our 3rd floor rooms. Thus, if you are infirm, would not recommend this.", "title": "Charming, historic, in central old town but lacks modern amenities", "helpfulness": 1, "user": "MithrilBoston", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 105432050}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Hotel does have great wifi my iphone worked fine to call US with skype.", "title": "Lovely quaint hotel", "helpfulness": 1, "user": "vicky68Greece", "date": "November 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87856899}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "If you arrive at night, it is quite hard to find and needs a walk up a windy stone street with stairs (cars cannot drive to the entrance). We asked our cab driver to take us otherwise we never would have found it in the dark.", "title": "Excellent", "helpfulness": 3, "user": "PressSecretary", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83243079}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The breakfast is included and lovely: greek yogurt with honey, nice big bread basket on each table with cheese, ham and jams, fresh bananas. They will make you coffee or tea but beware greek coffee is very strong and may upset American stomachs (after a day of heartburn I went to the Starbucks in the Chania harbor a 5 min walk the next day).", "title": "Great location, nice hotel", "helpfulness": 1, "user": "GORILLAS63", "date": "September 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78729711}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We spent 3 nights in the hotel. Our room was in the third floor. No lift, and you must climb up 64 steps with your luggage. If you are not enough fit it is not recommended to book second or third floor room. From the room nice view for the lighthouse and to the venetian harbour. The price includes the breakfast, but we didn't have the possibility to try it, because we get up too late or the breakfast finished too early we dont know, but at 9:15 the breakfast room was closed, so we had to go somewhere else to eat.", "title": "Nice but interesting", "helpfulness": 1, "user": "fraula", "date": "January 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12524059, "likes": {"liked": "— The view from the room"}}, {"rating": 2.0, "title": "Very disappointed", "text": "We were very disappointed in the hotel. We arrived very late and had to lug all of our suitcasese up three flights of stairs. The room we stayed in was very unattractive. I had requested a double bed and was told we could have one but ended up in a tiny room with singles. The bathroom was nice. If anyone books this hotel be sure and ask that you don't get room #3. It had a large window above the door that was translucent but the lights from many hall lamps shown in the room all night keeping it almost bright enough to read by. When I mentioned this to the receptionist in the morning she said that I could have gone out and unscrewed the light bulbs!!!", "helpfulness": 2, "user": "tiza", "date": "October 1, 2007", "id": 10026402}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The breakfast while not large was good and adequate. The location was good except if dragging several large suitcases from the road; there are no cars allowed in the old section so we had to lug our cases quite a ways to the hotel from where the taxi let us off.", "title": "Not what we expected", "user": "dreamk", "date": "September 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8690125}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "I would not return to this hotel ever. I am sure there are better ones in the area. They advertise the historic aspects of the hotel such as the rings where slaves were kept etc but don't say that they are in a guest room so we never saw them", "title": "A Great Experience-I'll Be Back", "helpfulness": 1, "user": "prometheus", "date": "April 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7430381, "likes": {"liked": "— A unique building in the heart of the old city and just steps from the sea."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "For our honeymoon in Greece, we originally wanted a room at the Palazzo di Pietro in Chania. But our travel agent told us that was full so would we go with Porto del Colombo instead? On the website it looked like a nice hotel so we agreed.", "title": "Be careful", "helpfulness": 3, "user": "FarVistas", "date": "March 25, 2007", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 7219324}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 12, "very good": 23, "terrible": 1, "excellent": 24}, "aka": "Porto Del Colombo Hotel Chania, Crete", "slim_ranking": 0.358974358974, "description": "Our Hotel, an imposing, tall, 600 year old building, has gathered a rich history over the passing of the centuries. During the days of Turkish Rule, the building housed members of high ranking Turkish military who made many changes to the buildings architecture - even built a Hamam.In the garden and next to that, a room to secure their slaves (where you can still see the metallic rings nailed to the walls). In the beginning of the 19th Century, the building was used as a French embassy and later was inhabited by the great Greek political figure, Eleftherios Venizelos, who also used it as his political offices until his move to Athens, when he took power as Prime Minister of Greece. The Hotel has 10 beautiful rooms - the 2 of which are maisonettes - fully restored and traditionally decorated to provide our guests with an especially warm and welcome feeling. All rooms have modern conveniences (WC, telephone, TV, mini-bar, air-conditioning and Central Heating in winter) ensuring our guests have a comfortable and enjoyable stay."}