{"user_rating": 4.0, "review_count": 27, "name": "Posada Don Luis Hotel", "reviews": [{"rating": 5.0, "title": "Budget Hotel -- Clean & Friendly!", "text": "I RATED THIS EXCELLENT BECAUSE I THINK IT IS A GREAT VALUE FOR THE PRICE. We are going back soon for a second stay here. The desk manager, Alex, is very helpful... so is Consuelo. A light bulb burned out and was fixed IMMEDIATELY! It is not \"fancy\", but very clean and we were comfortable here. We had a room near the front on the upper level.. with a king size bed and cable TV. There are a few apartment-size rooms at the back... a hot tub... and a small swimming pool. It is not located downtown, but it is on the main street. We could walk out front and hail a cab right away for 60c to go downtown. There are a few restaurants nearby; Internet across the street; a laundry; bakeries; and a grocery store.... all within walking distance. If you like walking, downtown is about 1 1/2 miles, I think. Beach is a few blocks away.", "helpfulness": 9, "user": "LovePuertoVallarta", "date": "December 17, 2005", "id": 4246926}, {"rating": 5.0, "title": "Its The best Hotel In Town 5stars for them", "text": "Every time i visit Rosarito, i stay there because the rooms are clean,rates are good,and the steff is excelent.there prices from $35.00 dlls. to $120.00 dlls for the best one they have . I'mean other hotels in town start at 120.00 . The manager Roxana is great speaks very good inglish so theres no problem with getting what you want. Alex the front desk clerk is great and very nice with all guests. i think they should have first place .", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 8, 2005", "id": 4002201}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "My husband and I have stayed in Rosarto before and depending on what you want this little out of the way motel was a treasure! All the big resort hotels are very strict about bringing in your own ice chest because they want you to buy their drinks and they are not cheap.. The other big draw back is not all the big resorts have air conditioning in the rooms so to leave a window open with a fan on all night you don't get sleep with all the big clubs hopping all night long! The final thing with some of those big resorts are the rooms seem dirty, old and need updating.. The beds are concaved and you just don't want to put your head on them... This little treasure, Posada Don Louis has nice size rooms that are very clean, they all have air conditioners which in the summer I find a blessing. The rates are fair priced and I would definately stay again. It is a little out of the way but taxi's worked just fine.", "title": "Enjoyed my stay", "helpfulness": 8, "user": "Yvette G", "date": "August 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3727388}, {"rating": 3.0, "title": "Nice staff and close to the action, but there's better", "text": "It is a small and quaint motel on the north side of town. Once you get inside the complex, the main street noise goes away. There's a very small pool and jacuzzi. Any small group of people could take it over and not leave room for anybody else. They have some noise and horse play rules, but they are barely enforced so a rowdy group of kids can keep you up all night and out of the pool. Not close enough to be walking distance to the night life. Also not walking distance to the beach. It is a decent place to rest in between sight seeing, but not a place to hang out. It is fair priced. However, there's much more pleasant resort style hotels south of town. The rooms are clean, but susceptible to noise from the back streets and cars alarms inside the complex.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3704610}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "We stayed in $75 room on Saturday night and an $85 on Sunday. The $75 room [#24] was quite large & fairly clean ,but a west facing window had no curtain so was very bright early. The shower water came out in one stream. The $85 room [#35] was a little nicer, plus I could park right in front. It came with a coffee maker, but the hotel does not supply coffee or filters! Ww both found the shower heat control impossible to ajust properly. On my next visit we might stay again on Saturday and move to a cheaper, nicer place on Sunday. Don Luis, unlike every other hotel does not reduce [about half most places] prices on Sundays. Hotel staff and everyone I met in Rosarito were very friendly. Hotel Calafia [some $45 rooms on Sunday] is stunning but serves expensive, small and very overcooked lobster. I had a salad and very nasty stomache cramps an hour later.", "title": "Yes, friendly staff but", "helpfulness": 8, "user": "voodoofx", "date": "July 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3659280}, {"rating": 5.0, "title": "Very Happy with my stay!", "text": "I was pleasantly suprised at this hotel. This was my first time staying in mexico over night and I have to say this hotel is American quality. They have room service, maids who brought us towels and cleaned the room if we wanted it. The room came with a small fridge, tv, and a large shower. It was the exact oposite then what I had in mind of what mexico would be like. I will definetly stay there again!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 28, 2005", "id": 3307418}, {"rating": 4.0, "title": "Very good value!!", "text": "This hotel was a pleasant surprise! We weren't expecting much as the price was low compared to other hotels in this area. The room was comfy and clean. Everything worked! Hotel was quiet. The hotel staff is exceptionally polite, friendly, and competent. We would especially like to compliment Alex and Consuelo for very good service. Any service request is taken care of immediately. There is a small pool and hot tub. Maids are pleasant and efficient. I am rating this above average because of the good value and service. Hotel is not in the center of town and has no beach, but taxis are about 60c... so you can walk or ride to the heart of Rosarito. Rooms are not fancy... not 5 star... but we were pleased and would be happy to stay here again! For dining we recommend the restaurant adjoining the hotel for convenience and good food; the Rosarito Hotel in town for great food at a good price; and the Calafia Hotel just south of town for a romantic gourmet meal. Service was excellent at all three restaurants.", "helpfulness": 12, "user": "LovePuertoVallarta", "date": "March 17, 2005", "id": 3279484}, {"rating": 5.0, "title": "Couldn't ask for a better stay", "text": "Staff was very welcoming and helpful in finding good places to eat, shop, party, etc. Hotel was clean and quiet. I would recommend this hotel to anyone looking for a GREAT stay. Vamos!!!!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 9, 2004", "id": 2174477}, {"rating": 5.0, "title": "hidden treasure", "text": "Great prices. The rooms were really nice, with a quiet enviorment. Very pleasent, definetly going back.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 15, 2004", "id": 1787185}, {"rating": 5.0, "title": "Great Place to Stay!", "text": "This is a great place to stay. Family owned, the hospitality is great.", "helpfulness": 12, "user": "lisdiz", "date": "November 11, 2003", "id": 1482072}, {"rating": 5.0, "title": "Great Hotel, Cheap!", "text": "This was such a great place to stay! Quiet, cheap and away from the hustle and bustle of downtown. Still a close drive to all the action. Very Clean and the people are very nice! The Pool and jacuzzi were also very clean. We had a great weekend there!", "helpfulness": 25, "user": "A TripAdvisor user", "date": "August 11, 2003", "id": 1222781}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed here in the week after Christmas, and practically had the property to ourselves. I admit from the outset that as a thirty-something traveler who likes cultural sites, I'm not a huge fan of Rosarito, but at least it was low season. It's an easy drive to the center of \"town\", the room was much bigger and more comfortable than we expected from a motel, and the courtyard is quite pretty. Service was friendly if not very hands-on. But given that Rosarito is best seen as a stop on the way to Ensenada, I'd either push on or stay in Los Pelicanos, which looked like it had more character, and was also removed from the main drag.", "title": "Large rooms in motel setting", "helpfulness": 4, "user": "trilceana", "date": "July 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8234026, "likes": {"liked": "— Large rooms", "disliked": "— No atmosphere"}}, {"rating": 5.0, "title": "Best place ever", "text": "The restaurant next to it is so great, the food is very good, we stayed on room 36, and hot water all the time, the bed was very comfortable, very clean room, it had a mini fridge, nice TV, there is a pool outside, and Jacuzzi, the people are great, the parking is safe cuase is off the street, and there is a garden too.", "helpfulness": 9, "user": "Darkpunk13", "date": "January 19, 2007", "id": 6622460}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I love this place! We have been staying here for the past 9 years! Everyone loves this place meaning all my family (aunts, uncles, friends) everytime one of us plans to visit rosarito we all know the place to stay is at Posada Don Luis! It's sooo relaxing, the staff is wonderful and you just feel at home because it's so private. Truly recomend this place!", "title": "love the place!", "helpfulness": 11, "user": "CinnastickyNote", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5558896, "likes": {"liked": "— It's a very comfortable relaxing place", "disliked": "— pool"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Stayed there for just one night and it was a great nights stay. Spoke with Alejandro there at the hotel and he was a great help with our stay. I can HIGHLY recommend this hotel to all of you looking for a great little hotel at a great price. You can see for yourself how well the property is upkept from the photos I have posted. Thank you Posada Don Louis!!", "title": "Excellent little hotel for a great price!!", "helpfulness": 9, "user": "Marlinjon", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5534932, "likes": {"liked": "— Very friendly service", "disliked": "— Make your reservations early"}}, {"rating": 5.0, "title": "Love this hotel", "text": "I stayed at this hotel in late Feburary and I have to say this is one of the best hotels. First the staff, they were so friendly, helpful, professional. The lady at the front desk gave us tips on where to go to see things and directions whenever we needed them. The grounds are very beautiful, complete with a little garden where they are growing vegetables. The room was very nice. The shower was quite large, there was a refrigerator to keep drinks cold, the a/c worked perfectly. I had read reviews that stated that the water tempature was hard to control but I found no problem doing so. The pool was quite small but it had a good charm. I imagine with just a few it would be very nice, I did not swim while I was there. They have picnic tables around the pool in case you want to eat. The better aspect I believe is that the hotel rooms are in the back of the check in, off the street. Very safe for your vehicles. You can park right next to your room, which is what I did. And because it is off from the street there is virtually no noise. The price was rate fair. About $65 a night for the room I was in but they have some cheaper rooms for $35 if your on a budget. Just as nice except no refirgerator. The hotel had a feel about it. Almost like home. It was quite beautiful. They have an AMAZING restaurant in front. The have the best food, for the cheapest price. (But fair warning don't order anything large size unless your sharing it with someone, they are not joking on those portions) Overall this is a wonderful hotel. I highly recommend it and when I go back it is the hotel I instend upon staying in. It is a shame that they don't have photos of the place for all to see. I was having such a good time I simply didn't take any. But don't let that put doubt in your mind about this hotel. You will not regret staying here.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5332971}], "location": {"country": "Mexico", "region": "Baja California"}, "variance": {"poor": 2, "average": 5, "very good": 3, "terrible": 2, "excellent": 15}, "aka": "Posada Don Luis Rosarito", "slim_ranking": 0.875}