{"user_rating": 5.0, "review_count": 158, "name": "Posada Palermo B&B en-suite", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I had the pleasure of staying here a couple of months ago and I'm still wishing I could walk through those welcoming doors once more! From the moment we arrived Viviana, Franco and Christina were completely focused on ensuring our every need was catered for. The rooms and beds are extremely comfortable (take your pick from about six different kinds of pillows!) and very tastefully appointed . Viviana is an artist/architect and what she has done with an old sausage factory is truly astounding. The place smacks of style and vision and what I love about Vivi is that she is always trying to improve it. How you improve on perfect I'm not sure!", "title": "The Best B and B on the Continent!", "helpfulness": 1, "user": "irvine_10", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81997746}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "When I got ill on my further travels all I could think about was getting back to this haven. So I returned. Viviana gave me a complimentary upgrade to a bigger/better room and offered to get a doctor around to see me. Whilst they were fully booked for one of my return nights, Viviana organised accommodation for me at a nearby hotel. When I needed a room later on near the airport, once again they came through with something ideal. These people really do care!", "title": "You can stop searching for other boutique hotels", "helpfulness": 2, "user": "Monicallaves", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78064205}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Be it restaurant recommendations & reservations for attractions and shows, transport options etc Vivi and her staff go out of their way to make your BA experience as enjoyable as possible. I really didn't want for anything - they have free internet, free purified water, a library of travel and reference books, beer, wine and soft-drinks that you can pay for or replace with supermarket bought items and the best breakfasts of anywhere I've ever stayed. I'm going back in 2011 and I can't wait!", "title": "This unique B&B might just be the best accommodation in Buenos Aires!", "helpfulness": 1, "user": "gingergirl10", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77805932}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I was in a hurry to book accommodations for a last minute weekend trip to Buenos Aires, and although this place was a little out of my price range (being a solo traveler in my late 20s) I called just to see if they had any best-available rates for the night. After speaking with Franco for a few minutes and having him go out of his way to answer any questions I had as well as those I didn't have but should've. Their airport pickup service was easy breezy, efficient and reasonably priced and as soon as I arrived, Viviana, the owner, greeted me as if I were a long lost friend. And then... I saw my room (along with the rest of the house). The pics on the website are spot on but still don't do it justice and you can tell that Viviana and her team understand the importance of the \"little things.\" From the sleek, welcoming decor, to the inviting backyard, to the bathroom towel warmers and the Argentine theme music CD they give you as a parting gift. And I'm not even going to get into the breakfast - just take a look at the pic on the website; enough said.", "title": "Practically perfect in every way", "user": "fester_mower", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73252274}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I had a phenomenal stay and was genuinely sad to leave after such a pleasant experience - I have found my new BA gem.", "title": "we had a wonderful stay at posada palermo", "user": "eulalia_10", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72471053}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I spent 6 nights at the Posada Palermo in October 2010 as part of a 3 week trip to South America. The welcome you get there is amazing. Alejandro, Viviana, Christina and Franco treat you like a really good friend who has come to visit. Yes I know you are a paying guest and it's maybe not the cheapest accomodation you can get in Buenos Aires but it really is worth every penny.", "title": "We can't praise it enough, go there and you'll see for yourself.", "user": "shaycat", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87906043}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The posada has a great location, the rooms are lovely and very clean and the breakfasts are amazing. There is a very comfortable lounge area and a lovely garden. We met many of the other guests and Alejandro hosted a wine tasting for us on one of the nights and then took us to a nearby Pena to hear Argentinian folk music. On another night we went to a football match with 2 other couples staying at the posada.", "title": "Outstanding B&B in beautiful Palermo", "user": "clehong", "date": "November 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86752752}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We got wonderful tips on where to go and what to do in BA and had some really interesting conversations with our hosts and the other guests. If you want to stay in a relaxing place where you will meet interesting people and where the staff will go out of their way to make sure you enjoy your stay then look no further.", "title": "Lovely posada in Palermo", "user": "TravellinJack63", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85998865}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "We just stayed one night at the Posada Palermo and had an outstanding experience... the owner of the B&B, an architect, beautifully renovated the house in the past few years and now runs the boutique and special B&B. We received great recommendations for places to go (e.g. to watch a tango orchestra), had a delicious breakfast, a beautifully decorated room, friendly staff, a little kitchen next to our room and were just a walking distance away from the trendy Palermo Soho. We would definetely recommend this place to any traveller, who appreciates an individual and personal accomodation, that feels like home.", "title": "Excellent place, you will feel at home instantly!", "user": "HamburchMeinePerle", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85776484}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Stayed here 4 nights at the end of a 3 week trip to Argentina. On the edge of Palermo, so you must be willing to walk, but not a bad walk. Must catch cab or subway to central BA. Can get cab just about anywhere for $4-7 USD. Wonderful staff, and cooked to order eggs and hot breakfast ham & cheese sandwiches, plus pastries, fruit and cereal every morning. We got a superior room and the balcony was nice, plus an extra single bed & lots of nice light. Best breakfasts we had on our trip. Staff set us up for cool stuff over and over again. Viviana, Franco and Alejandro rock.", "title": "Home away from home...", "user": "Tikitango", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85415802}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Posada Palermo greeted us like an old friend (despite the fact that we were sweaty and gross from traveling). The location was mere blocks from a Subte stop, making travel easy into the microcenter (and the train station) and other parts of town.", "title": "Amazing house, amazing breakfast, fantastic location", "user": "Alybyzrp", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94201732}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I can't say enough about the helpfulness of the staff, who were always ready to answer questions, chat about local customs (how exactly do we drink mate anyway?), arrange logistics and make reservations (Tango Porteno was brilliant). Breakfast was epic, with homemade breads and jams, plenty of alfajores, dulce de leche on croissants - we were so full we turned down eggs and toast every morning. The Wi-Fi worked wonderfully, the house was beautiful, and this was the best nights sleep we got in the 10 nights we had been in South America up to this point.", "title": "Wonderfully comfortable and friendly, home away from home...", "user": "parisrobb", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94169263}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Highly recommended.", "title": "Truly perfect", "user": "Jon G", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93807054}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Every review of Posada Palermo is exactly right. From the moment you step through the door you are treated as family by Alejandro, the manager and Viviana, the owner. The entire staff goes out of their way to make sure you are comfortable. Alejandro is an incredible asset to this B&B. He can answer any question and he genuinely enjoys talking to guests and getting to know them. Their presence made our stay in Argentina comfortable and fun.", "title": "excellent", "user": "florinda_maua", "date": "January 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92399859}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We had room 5 which was upstairs and included a small patio area off the room. The room was large and decorated nicely. The separate bathroom and closet were also large and spotless. We traveled with our three grown children who stayed in room 1 downstairs where they had plenty of room to spread out.", "title": "Charming B&B Perfect for Buenos Aires!", "user": "alrdenver", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92209703}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "After having read through many reviews of places to stay in Buenos Aires,,we decided to splurge a bit and book this B&B because of the rave reviews. I found it exactly as depicted by many of the previous guests.....friendly and inviting; great staff including the gracious owner, Vivien, and helpful Alexandro, as well as the kitchen staff, Christina & Maria! You guys made our stay so memorable. Ususally I stay at less expensive hostels,,,but since I was travelling with my husband,,decided that bunk beds in a hostel wouldn't be appropriate, so searched for B&B's and couldn't have been more pleased with Posada Palermo. From the secure feel of the neighborhood, with a fruit store directly across the stress,,, restaurants only blocks away,,and a short walk to the metro stop,,,this place really is a gem. Love it....and thanks Vivien and Alexandro for a memorable time in Buenos Aires!!", "title": "the best breakfasts and the best place to spend them mingling with Vivien and other guests!", "user": "maruska99", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91470800}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I only stayed here for 1 night so I'm not going to say too much other than...the guy that checked us in was the friendliest person I've ever met. The owner introduced herself and asked if we were ok (that's what owners should do). The room was very clean and the decor unique. The position of the Posada is close to shops and restaurants. The staff organised us breakfast even though we left before it officially started (they left stuff out) and they saved us some money on a taxi to the airport by using their regular driver. All good no complaints, well done and you deserve to be successful.", "title": "They do things right", "user": "TonyDeeEngland", "date": "December 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 90628433}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Don’t even think twice, you want the luxury, charm, attention, comfort, cleanliness, tasteful and lovely setting and make your stay the most enjoyable and successful one just choose Posada Palermo B & B", "title": "Dont think twice It is THE ONE The best", "user": "carole1961294005", "date": "December 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90511967}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Believe me I tried the best 5 star hotels in New York, Paris, London and Italy and just came from a 5 star Cruise in Antarctica but nothing to compare with Posada Palermo B & B", "title": "Another Wonderful Experience", "user": "bb-starr", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89762213}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Thank you Viv, AlIkhandro and all the team you made us fall in Love with Buenos Aires – Carole Contavelis and Alain Abet (Lebanese and French citizen)", "title": "A home away from home -- the ultimate b&b", "user": "sllevy", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88679562}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "variance": {"poor": 0, "average": 2, "very good": 17, "terrible": 0, "excellent": 139}, "aka": "Posada Palermo Bed And Breakfast En-Suite", "slim_ranking": 0.0808510638298, "description": "In the heart of Palermo, residential neighborhood, old and modern district at the same time, Posada Palermo offers the best choice in lodging. A B&B en-suite you will never forget."}