{"user_rating": 4.5, "review_count": 52, "name": "Posada de Lluc", "reviews": [{"rating": 2.0, "title": "Service without a smile", "text": "We stayed at the Posada de Lluc for two weeks in September 2006. One very obvious asset to the hotel was the private car park just around the corner. It is not easy to park on the streets in Pollenca.", "helpfulness": 6, "user": "Claire G", "date": "September 26, 2006", "id": 5876207}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We stayed in the “Violet” room and whilst this room was very clean and well furnished it was not the most comfortable for such a long period of time. The shower in our bathroom did not work properly as sometimes we struggled to get a flow of water out of it.", "title": "Romantic, Comfortable, Very Relaxing", "helpfulness": 10, "user": "AmandaMcF", "date": "September 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3836505}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The hotel pool was a very useful feature, but the pool area was smaller than it looked on the hotel’s website!", "title": "Relaxing Oasis", "helpfulness": 9, "user": "Hil71", "date": "July 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3683086}, {"rating": 5.0, "title": "Honeymoon delight", "text": "Similar comments have been made on this website in the past, but breakfast was rather disappointing. You get one glass of freshly squeezed orange juice, and if you choose coffee you get one cup of that too. We heard one guest ask for more orange juice and the response he received was not the most enthusiastic. To eat, breakfast consisted of two small slices of meat, two slices of cheese, a croissant or Danish pastry, a bread roll and a small piece of dry bread. Yogurts, fruit and cereals were also available. In addition to the above, eggs were offered on a daily basis, but they alternated between being fried, boiled or scrambled. You could not choose which method.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 19, 2004", "id": 2584607}, {"rating": 5.0, "title": "A charming hotel in a charming town", "text": "Until the last day of our stay we had felt that the accommodation was fine but overall, nothing special. When we approached the manager, Joana, in her office, asking if we could pay the bill, the response was downright rude. She made it very clear that we were intruding on her “afternoon off.” She turned off her TV, slammed her paperwork and books down on the desk and very rudely shoved the credit card slip under our nose for signing without saying a word. At no time during our stay did she ask us if everything was ok. Upon leaving she did not wish us a pleasant journey or thank us for staying. She made it very clear that she did not want to bother with pleasantries but just wanted to take our money. In our opinion, Joana did not make a very good hotelier in this respect. Whilst we will definitely visit Pollenca again, we will not stay at the Posada le Lluc.", "helpfulness": 5, "user": "SimonFLD", "date": "September 7, 2004", "id": 2517116}, {"rating": 4.0, "title": "Gorgeous Hotel", "text": "Posada De LLuc is located in a medieval town house in historic Pollenca.Beautifully appointed rooms and pool area but breakfast was extremely poor for such a lovely property.It consisted of bread rolls,pastries and alternated between a hard boiled /scrambled egg...very odd!!!Service levels varied and sometimes felt a nuisance when asking for drinks/information .Loved Pollenca as some wonderful restaurants..La Font del gall(contemporary cuisine with a Scottish Twist),Clivia and Il Giardino all come highly recommended.Great bus service to Port De Pollenca unfortunately the British pub and fast food culture seem to be creeping in to this once beautiful resort.", "helpfulness": 8, "user": "luibaty", "date": "August 10, 2004", "id": 2438270}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 4, "very good": 11, "terrible": 1, "excellent": 33}, "aka": "Posada De Lluc Pollenca, Majorca, Spain", "slim_ranking": 0.1}