{"user_rating": 3.5, "review_count": 829, "name": "Postcard Inn on the Beach", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Spent 5 nights here & had similar experiences to last few reviewers.", "title": "Good only for Sports Teams & Students NOT more mature travellers!", "helpfulness": 1, "user": "BobblenoseWarwicks", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 153205143}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "BUT can't agree with positive comments about the food! The only breakfast option was the Snack Hut - waiting outside it for our orders in the freezing cold wind was MISERABLE! Too cold to eat at the picnic tables outside, so had to take food back to our room. Only ate in the PIB restaurant once - expensive & smaller portions than nearby eateries. (TIP: there are several good ones if you turn right as you come out of PBI)", "title": "Good value and location on St Petes Beach", "helpfulness": 1, "user": "tellitlikeitis64", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 153149105}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We too were disturbed by the noise. Our stay coincided with that of about 30 teenage boy lacrosse players who spent a lot of time jumping off the beds, moving furniture, bouncing footballs & doing judo-throws - all in the rooms above ours - wonderful! There was a very noisy disco in the Beach Bar at the weekend, & this combined with constant music played near the pool, meant we didn't get the relaxing stay we'd hoped for at the end of a tiring Florida tour.", "title": "Disappointed", "helpfulness": 1, "user": "Elizabeth B", "date": "February 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153115421}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We wouldn't recommend anybody to stay here & were told at Reception that \"our\" lacrosse players were just the advance party - many MANY more would be arriving at PIB as we left! OMG!!", "title": "An Amazing Getaway Stay!", "helpfulness": 1, "user": "fgarayone", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153075113}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed here for three nights just after Valentines Day. My husband and I needed to take a quick trip to Florida and with the ridiculous prices for air alone we opted for this package with sunwing which gave us air/hotel/car. I was prepared to book a hotel somewhere else once we got there but I was pleasantly surprised by the hotel once we got in. Let put a few qualifiers in because I saw quite a few younger people as in college/univ students and was prepared for noise and lots of partying. I left my two teens at home to avoid this. They had a large beach area where we could hear some music at night, not too loud and I said to my husband if it had not been so cold at night I would have gone down for a listen. The rooms were basic but clean and the beds comfortable. The bathroom could be a little bigger,ok a lot bigger,but for the short stay it was adequate. They also had a beach restaurant that served some simple but good breakfast (other meals too but we only ate breakfast and the front desk staff were helpful. The atmosphere is definately casual and as we were leaving I realized that there were quite a variety of age groups as well as families there. Overall a pleasant surprise. Rm#132", "title": "The food was excellent , but overall ...", "user": "rkmahar", "date": "February 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 152948122}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We arrived at 11 a.m. and our room was ready and waiting. I was a little nervous having read the problems other guests have had, but I was pleasantly surprised. Two great beds, extra pillows, extra towels, blow dryer, refrigerator, iron, soap and toiletries were all awaiting us.", "title": "GREAT PLACE", "helpfulness": 1, "user": "martinigirlnj", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154542256}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The grounds were clean and well manicured. There were several weddings going on, but there was no excessive noise noticed. Security was present around the complex (they wear white Security shirts) The pool, snack shack and beach bar were great. The pool was heated with enough lounge chairs to go around and Inn towels were given out in the pool area to be used at the pool or beach (you only had to tell them your room number and then it was honor system on the return to the bin). I had both coffee and the chicken wrap and fries and the snack shack and all were great, hot, fresh and satisfying. We rented lounges on the beach for two days, $12.50 per day per lounge chair, this is not part of PCI, but is offered as a amenity. Would go back tomorrow!", "title": "very stylish and great food", "helpfulness": 1, "user": "Trae N", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154528320}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I loved the decor of this inn. It was well-designed both inside and out. The pool and the beach were beautiful, the rooms were clean and it was great to have the choice of the snack bar or the restaurant for eating (plus, the food was delicious). The gym(s) were small, but workable. You also can't beat the central location! My 2 criticisms would be that the front desk service was a touch patchy and we did have some problems with our keys, but otherwise my family and I had a great time at the Postcard. I see some of the reviews and some of them have to be old...there is nothing old or outdated about the Inn.", "title": "Unsanitary", "helpfulness": 3, "user": "C D", "date": "March 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 154449348}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "A friend and I just returned from a 3 night stay. The loud nights and lack of adequate pillows and any clean towels seem like small inconveniences compared to a non-functioning toilet for 24 hrs. For the toilet that would not flush after we used it, we started calling around 8pm on Sunday and were not told until almost midnight that they could not find the tool to unclog it. The suggestion from the front desk was to call them the next morning when we awoke. So at midnight we trudged from our room located the farthest distance from the lobby to use the bathroom in the lobby. We called the next morning at 9am to say we still needed our toilet fixed and were greeted by an impatient desk clerk. When we returned at 4:30pm after being out all day our toilet was still not fixed. So back to the lobby bathroom we trudged and to demand our toilet be fixed. Shortly after a gentleman came to the room to fix the toilet saying he had received a requisition earlier in the day to fix our sink which he had already checked. There was nothing wrong with the sink! No offer was made to decrease our bill despite the fact that we were staying in an unsanitary environment and had to plan our bathroom breaks for when we were out at a restaurant or when we were in street clothes and could trudge to the lobby.", "title": "Worst experience here yet!", "helpfulness": 4, "user": "Pedals2011", "date": "March 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154427980}, {"rating": 1.0, "title": "Old and outdated yet overpriced!!!", "text": "Like many others have noted a stay at the Postcard Inn is a nightmare. I understand that this is the high season and that all the college spring break crowd that we encountered may not mind the lack of amenities like flushing toilets but at any price this place is to be avoided.", "helpfulness": 2, "user": "PetloverLeesburg", "date": "March 12, 2013", "id": 154393286}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "If you find yourself in St. Petersburg, Florida, head to the beach and stay at the newly opened (10/09) Postcard Inn. What a great hotel! How lucky St. Pete is to have them as a new addition. Very chic, well thought out details throughout the hotel. I definitely want to go back! We stayed in a modest king size room, very comfy beds, and pillows, though, I wished they had an extra pillow in the closet. Missing from the room, a hairdryer, but my call to the front desk, immediately garnered me one in seconds. The bathroom was very tiny, but I didn't mind at all. The courtyard is spectacular as is the pool and the deck that butt up against the beach, really, stop in and check this hotel lobby out, it's amazing! Sadly, we didn't get to eat at their restaurant, but I hear the BBQ food is tasty. Breakfast, in the lobby, coffee/tea/dry cereal/oatmeal/pastries, just enough to get by on.", "title": "I hope they open a hotel in Siesta Key!", "user": "Hawkeye4", "date": "December 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 50649155}, {"rating": 5.0, "title": "Wonderful Stay!", "text": "Took a few days away with my girlfriends to this little piece of paradise. The Hotel well exceeded my expectations. The property was amazing....The beach, bar and restaurant were all one could ask for, for a relaxing, laid back weekend with your girlfriends. The decor was chic and current without being too stuffy. The rooms were inviting and interesting. All in all this place has a great vibe and would definately go back again!", "user": "kdawgNyc", "date": "November 24, 2009", "id": 50009207}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I just stayed with some girlfriends at the newly renovated Postcard Inn and it was fantastic! Everything from the new look of the motel, to the staff service, to the food was amazing. The pool was huge and they had these incredible beds which were extremely comfortable and very chic. The outside bar was great- they had live music on Friday night and again Sunday afternoon- plus they serve a mean bloody mary!!", "title": "The new Postcard Inn is Incredible!!", "helpfulness": 1, "user": "lb151978", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50000547}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The rooms were great- they were really eclectic and the beds were very comfortable. Food was also really good- we loved the BBQ at Wildwood.", "title": "The Perfect Getaway . . .", "helpfulness": 1, "user": "ridgedj68", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49995683}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I stayed here with my family over Christmas, and was very disappointed. The hotel website shows beautiful newly remodeled rooms and fabulous beach views. The reality is that this was a sleazy Travelodge not long ago, and all it has now is a new coat of paint. The hotel has been nicely redecorated, but far less money was spent fixing the building. There are loudspeakers in the courtyard that pump musak throughout the hotel from 10am to midnight. There aren't coffee pots in the rooms, and the free breakfast is only cereal and muffins. Our door didn't latch properly and the alarm clock was broken. But most disappointing to my son was that the pool was unusable. We asked repeatedly for the front desk to turn up the heater on the pool, but we were told that the pool was heated to 70 degrees and they didn't need to make it any warmer.", "title": "Trendy Decor Covers Low Quality Motel", "helpfulness": 3, "user": "F-Dizzy", "date": "January 13, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 53375217}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My advice to management is the following:", "title": "Chic with thin walls", "user": "travelholic27", "date": "January 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 52902240}, {"rating": 2.0, "stay_parameters": "Stayed January 2010", "text": "1. Install pressure valves on the hot water system. In the shower I was scalded whenever anyone in the hotel flushed a toilet.", "title": "Good Looking but No Sleep", "helpfulness": 1, "user": "saraplee", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 52357785}, {"rating": 5.0, "title": "Great place to travel with S/O or Friends. Fun, quirky rooms and awesome BBQ.", "text": "2. Put in individual heat/ac units in each room. There is a thermostat on the wall now, but it is only for decoration. Hotel maintenance decides weather the main AC or heat is on.", "helpfulness": 1, "user": "CAintheBK", "date": "December 25, 2009", "id": 51861047}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "3. Put one or two microwaves in the lobby breakfast area. There are mini fridges in may rooms, but no microwave.", "title": "Unlike any place else!", "user": "trvlbug04", "date": "December 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51581889}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Staff very unpleasant, poor management and ran down and old hotel.", "title": "Terrible...do not book a room at this hotel...", "helpfulness": 5, "user": "Jay S", "date": "March 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 153646425}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Rooms smell old, bathrooms with rusted fixtures...this hotel should be more like a Motel that you pay by the hour.", "title": "our stay", "user": "ellensue", "date": "March 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153541492}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Hard old beds and dirty covers...just disgusting", "title": "It was very ehhh....", "helpfulness": 2, "user": "Daniel M", "date": "March 1, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153446509}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Next door are better hotels by far.", "title": "disgustin", "helpfulness": 2, "user": "friarjoan", "date": "February 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 153411738}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I work in a hotel and I am telling you do not book!!!!", "title": "Winter Break at PCI", "helpfulness": 2, "user": "naynay5885", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 153297131}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My 15 year old daughter and I recently stayed for a extended weekend get a way. We would recommend this property to others, if they are looking for a laid back casual atmosphere.and something other than the typical hotel . The customer service was outstanding, comparable to high end resorts!! I am in the hospitality industry which means I am a bit crtical but the staff was great, from front desk to housekeepers, to pool attendants,to servers, all were great! The only negative was the water didn't get very warm for our showers but I suppose in warmer months that is not a concern. If I could add a suggestion or two it would be to add refrigerators in the rooms, for the room fee I would expect them. Also the weddings are lovely but perhaps the desk staff might acknowledge the weddings to other guests when checking in so we know what public areas will not be available during our stay...only fair. The restaurant service good, food was average, the pasta was cold in the center. It would be cool to add some entres so cal style to match the vibe of the hotel.Overall we rate the hotel very good and will return and recommend to others. P.S. Great for all ages!", "title": "Good Vibe", "user": "LeeAnn M", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154390023}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I had high hopes for the trendy laid back PCI, but once I spent some time on site I was continually disappointed. The walls are so thin that you can hear your neighbors' conversations, and drunken late night/early morning partying was the normal scene on most nights. The rooms got a coat of paint and some new furnishings, but that's about it, and they are in dire need of full refurbishment. The bathrooms are still some 1980's color of old school tile, and the sink and toilet were about as old also. The HVAC system was terrible in the room. On the bright side, the pool and bar area were fine, and the hotel property is directly on the beach, so if that's all you need, you might enjoy it. I paid over $148 a night, which I think is a ripoff for this place...this should be an under $100 a night kind of place. For the price I paid, I expect better and I should have researched more, because for that rate there is better nearby. Would NOT recommend for families with kids, romance, or a relaxing getaway. Would maybe recommend for guys/girls trips that are based on partying and late nights, given an under $100 price point.", "title": "Find somewhere else to stay!", "helpfulness": 5, "user": "Jack T", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 154183019}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "old motel style with blocks of rooms. NO LIFT. Nice pool and easy access to idyllic beach via bar. Lots of youngsters and noise in evening[we are 60+] but quiet at night.", "title": "fantastic spot but not as good as website", "helpfulness": 3, "user": "sandra j", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 154174333}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Grill restaurant with country music serving burgers etc with helpful staff. Front desk staff had local knowledge to share re restaurants.plenty of places to eat but all very busy.", "title": "Great location, grounds! Some drawbacks.", "helpfulness": 2, "user": "ButterflyB", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153974455}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We just stayed at Postcard Inn for 5 nights in early March. We are a middle-aged couple - and overall we really enjoyed our stay. The hotel is in aa great location - right on a beautiful white sand beach and within walking distance of many good restaurants, a good Greek grocery with sandwiches, salads, produce and wine, and lots of other shopping. We enjoyed the lovely grounds and large, pretty pool. The bed was very comfy, and the surfing theme fun.", "title": "Not impressed", "helpfulness": 3, "user": "sarahbearaben", "date": "March 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 153652569}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Stayed here March 7, 2010 in Room 306.", "title": "Good Value", "user": "Sassycruiser", "date": "March 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 58603151}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Room 306 is a poolside room with \"private\" patio with 2 chairs. The room itself is large and very clean. Decorated with modern furnishings and a very, very comfortable bed.", "title": "Stay here if you want a continuous loud party", "user": "ieschw", "date": "March 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 58571421}, {"rating": 1.0, "stay_parameters": "Stayed March 2010", "text": "Did not hear noise from other rooms like many posters. However, the pool side rooms are located in a one story wing attached to the main hotel so that may be why.", "title": "Bad service!", "user": "Elizabethrn2010", "date": "March 11, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 58310490}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Pool is very nice - good service from beach bar.", "title": "Loved the atmosphere!", "user": "Wanderlustographer", "date": "March 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58263863}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I would recommend this hotel to younger travelers on a budget. Overall, it was clean, comfortable and for the the area affordable. There are NO frills - it is strictly a clean, okay place to stay. Beach is beautiful.", "title": "Good and bad", "user": "modernhamlet", "date": "March 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 58141488}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Booked 4 nights for my husband and I after seeing the web site claims. Was disappointed. Rooms very dark. Renovation of rooms means a coat of paint. Air conditioning is managed by front desk and a huge vent belts out cold air whether you want it or not. Finally my husband got up and closed the vent. There is a thermostat on the wall but does nothing, presumably just for decoration. Very loud music from the bar at the weekend, though did stop at 8 pm. Shows as a non smoking hotel but it is U shaped and the grass in the middle is all used by smokers, not good if you have asthma like me. Speakers all around the grass, play all day, very annoying. Walls paper thin and like a herd of elephants above us. Front desk does reply straight away but very bland in answers, not friendly and welcoming apart from the young man who checked us in. Fridge tiny and no microwave.", "title": "Great disappointment after web site claims", "user": "shamul0ver", "date": "March 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 57801953}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Plus is beach is lovely, beds were nice, breakfast basic but OK and served to 10.30 for those who like to sleep in. Price, we paid $79.99. I still would not stay again at that price though. Good central location, plenty of parking.", "title": "Best value for dollar on St. Pete Beach - period.", "helpfulness": 1, "user": "Fussytraveler13", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57045191}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I work in the hotel business and visit and inspect properties for a living. Value for dollar Postcard Inn on the Beach is one of the best properties in the area. The location is fantastic with a spectacular beach with volleyball courts. The pool is large and the landscaping is meticulous. The property is funky and fun and the rooms are extremely clean. The beds are great with down comforters in white duvets with new flat panel tvs. The staff is wonderful and there is an amazing barbecue restaurant onsite open for lunch and dinner. If you are looking for an ultraluxury 4 or 5 star full service resort this may not be for you - but if you want a clean, comfortable, convenient, beachfront resort with a great location, fitness center, swimming pool, and warm staff you will have a lot of fun at Postcard Inn on the Beach. This is the first time I have ever felt compelled to write a review on Trip Advisor.", "title": "Would Not Stay Here Again!!!", "helpfulness": 1, "user": "thetravelers24", "date": "February 9, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 55563225}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My husband and I recently took a trip to St. Petersburg Beach, Florida. I had booked this hotel on Hotwire and had read some reviews on Trip Advisor prior to our departure. Well needless to say all the reviews were very accurate. This hotel is rated a three star and it is a two star at best. The air conditioning does not work in the room and I found from other guests that this complaint was quite the same. The hotel walls are so thin you can hear everything that goes on in the room next door and if you are in the lower level and someone is in the room above you forget about getting any sleep. The shower drain does not work and the tub fills up with water all time. There is no fan in the bathroom so since the air conditioning does not work the room gets like a sauna. The rooms are very dark and the refrigerator is so small why even have one in there at all. This hotel has put a lot of money in retro decor but they need to fix the air conditioning and do something to alleviate the noise problem in the rooms. Also, they may want to invest in a heater for the swimming pool as it is so cold there was never anyone swimming in it. I would not recommend this hotel to anyone!!", "title": "Great place", "user": "travel9009", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 55035159}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I stayed there with my boyfriend and we have enjoyed it immensely - a beautiful beach with just few people around, friendly staff, nice bar on the beach and, above all, great, relaxed atmosphere of that nicely furnished/stylish place. This is the place where you would feel home no matter if you are single or with someone; it is looks like nice people stay there. We forgot to close the room door when going out for the day, and nothing happened...", "title": "Postcard in is a fun small fish swimming among the big fish", "helpfulness": 1, "user": "Dreamin_of_Cancun", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54770740}], "location": {"country": "United States", "city": "Saint Pete Beach"}, "stars": 3, "variance": {"poor": 117, "average": 155, "very good": 230, "terrible": 110, "excellent": 217}, "aka": "Postcard Inn On The Beach Hotel", "slim_ranking": 0.8, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.5, "location": 4.5}, "description": "From décor to dining, Postcard Inn is the Great American Escape. Rooms at our boutique St. Pete Beach hotel feature vintage lamps, surf photos, and old school desks and couches, modernized with WiFi and flat screen TVs. Many rooms have pool and ocean views, too. Postcard Inn offers two main drinking and dining options; the critically acclaimed Beechwood BBQ and PCI Beach Bar & Snack Shack. Enjoy excellent burgers and ice-cold beer all day long. Plus, if you have to mix business and pleasure, or are just looking to explore, downtown St. Petersburg and Tampa are both short drives away from the Postcard Inn in St. Pete Beach, Florida."}