{"user_rating": 4.5, "review_count": 78, "name": "Pousada Poesia", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I am Brazilian and I have been to Salvador before many times. I love the city and its people; in my opinion, it shares with Recife the title of most creative and dynamic cultural capital of Brazil. I chose this pousada after reading the comments at TripAdvisor. Unfortunately, and for the first time, I could not be more disappointed.", "title": "Are you kidding me?!", "helpfulness": 3, "user": "LuizTrip", "date": "January 20, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 93850051}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "- The pousada: Well, for the price they charge, I have known better pousadas in Bahia and elsewhere in Brazil. It is true that it is located right in front of the beach and 500 meters from the center of Itapoa. It has a nice pool and clean but very simple rooms. That’s all for the positives; I found the owners blasés, almost depressed, giving an image of decadence. We felt like they were detached from their role as hosts. They were not impolite, but rather a far cry from the typical warm and friendly Brazilians we have always met. We stayed only one night at a small room in the basement (we were supposed to move up later but we left before). The TV was useless (brokenn antenae), the sheets had holes and there was no hot water. The breakfast was very minimalist, with only coffee, milk, a couple of juices, crackers, slices of bread, ham and cheese and a (not really tasty) cake. In summary, one gets too little for too much.", "title": "Tranquility on the beach", "user": "Pupunhabrava", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71163635}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "- The beach: Frankly, Bahia and Brazil have beaches that are much, much better than this one. I last visited Itapoa 20 years ago and was impressed by how beautiful and calm it was. Nowadays, it looks more like a mix of an open air garbage dump and a nightclub, especially on weekends. The cacophony of dozens of sound systems playing different songs is unbearable, and the volume of trash left by the public is disgusting. I don’t see the point of being at a beach-front room, unless one wants to listen to a thousand different Axé bands at the same time while looking at a garbage dump. Our neighbors played music very loud the whole day since this is the way people like to have fun over there. In the last 5 or 10 years, Brazilians have gotten into oversized sound systems and loud music in the beach. The time of “passar uma tarde em Itapoa, ouvindo o mar de Itapoa” is long gone…Add to this the lack of a decent garbage collection service and you have the worst possible nightmare for someone looking for a peaceful and pleasant stay.", "title": "Excellent holiday, directly on the beach", "user": "Irki", "date": "May 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65510897}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "It breaks my heart but I think Itapoa is a shame to Bahia and to Brazil. I can only recommend this place during the carnival, when the only thing we need is a shower, a decent bed and a warm coffee in the morning. Other than that, don’t waste your money there; go visit the town but move North or South of Salvador for the beaches.", "title": "best holiday", "user": "ales_kolin", "date": "May 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64098671}], "location": {"country": "Brazil", "continent": "South America", "city": "Salvador"}, "stars": 3, "variance": {"poor": 3, "average": 1, "very good": 30, "terrible": 2, "excellent": 42}, "aka": "Pousada Poesia Salvador, Bahia, Brazil", "slim_ranking": 0.171717171717}