{"user_rating": 4.5, "review_count": 717, "name": "Premier Inn Manchester Trafford Centre West", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Checked into the hotel room around midnight on theevening in the UK this july where they were saying it was the hottest July day ever... Well, the temperature in the hotel room was terrible and I quickly found out there was no airconditioning. The window only opened a crack and the room did not cool down. There was no bathtub to cool down in, so after a cold shower, I had to sleep with a cold wet towel on my body to keep my body cold. Worst hotel experience I have ever had. Of course, if it had been the middle of winter, a hot room probably would have been cozy. Overall, the hotel was nice and the location was good for visiting my business' office. But next time I travel in the summer I will always ask about the AC.", "title": "NO AIRCONDITIONING :-(", "helpfulness": 5, "user": "europa00", "date": "August 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 1.0}, "id": 5577487, "likes": {"liked": "— No Air Conditioning"}}, {"rating": 5.0, "title": "Going back again soon....! Lovely place", "text": "The Tulip Inn is a great place to stay. We stayed there in Jan. and have booked to return there again next month! Rooms are lovely. Showers are great...nearly knock you over!!! Buffet breakfast the best I've seen in a long time! The staff is great too! I'm trying to think of something negative...but even the weather stayed good until the day we left!!!! Looking forward to next stay!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5434047}, {"rating": 3.0, "title": "Loads of great 4 star hotels in Manchester £70-80 per night!", "text": "Booked hotel for one night only after reading good reviews on this site. My views differ from the majority posted below. The best price I could get was £80.00 a night. (much better value available at other hotels in central Manchester) My room had the smallest bathroom in the world, although great shower. Rooms appear large because sink is in your room not bathroom. Not very private if with your partner. Carpet was worn and had lots of stains. Staff were great and couldn't be more helpful. Check in has a bar at attached to it so if you arrive around 7pm get ready for everyone at the bar to be staring at you and sharing your conversation with the check in staff. This hotel is most basic, would be ok for £40.00 a night, If you get asked to pay any more look elsewhere. Loads of great 4 star hotels in this area for £70-80 per night", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5231997}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Excellent stay! The rooms are very large spacious and clean. They are modern and well appointed. Large powerful showers. Delicious and plentiful breakfast!", "title": "Terrific Tulip! Excellent!", "helpfulness": 5, "user": "PeacockEye", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4721004}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 63, "very good": 214, "terrible": 6, "excellent": 420}, "aka": "Premier Inn Manchester Trafford Centre West Hotel Trafford", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "An architecturally stunning hotel situated just off the M60, Junction 10. The hotel has 234 newly refurbished bedrooms, a stylish intergral bar and restaurant and six spacious conference rooms. We also have ample complimentary parking facilities. Premier Inn Manchester Trafford Centre West is located at the heart of Trafford Quays Leisure Village which includes some of the countries most exciting atractions and leisure activities. The proximity to both motorway and public transport links makes the hotel the ideal location for both business and leisure guests."}