{"user_rating": 4.0, "review_count": 596, "name": "Premier Inn York City Centre - Blossom Street North", "reviews": [{"rating": 5.0, "title": "Very good ,pleasant , convenient place to stay.", "text": "I stayed in this hotel for two nights at the end of January.Being a solo female I was somewhat apprehensive as this was the first time I had had to travel alone. The staff were very friendly, informative and attentive. I cannot fault the service I received throughout my stay. Dining alone can be a bit daunting and I initially felt self conscious it's difficult to know where to look when you have no one to share your meal with and are surrounded by couples or young families with children. However the young waitress, possibly sensing my discomfort ,came to my aid by offering me magazines and newspapers to read , I appreciated that very much. The young waiter was also very helpful and efficient.", "user": "cwillows", "date": "February 7, 2010", "id": 55381514}, {"rating": 5.0, "title": "Simply the best", "text": "The room was spacious, comfortable and quiet. If you don't like the noise from the air conditioning unit try pressing the \"off\" button I did, the room stayed warm all night despite the freezing temperatures outside.", "user": "risegrove", "date": "February 4, 2010", "id": 55188057}, {"rating": 5.0, "title": "Excellent Staff", "text": "The hotel is very conveniently situated both for the railway station and the city.", "user": "johnthebattery46", "date": "January 29, 2010", "id": 54649259}, {"rating": 2.0, "title": "Terrible parking,Noisy room air conditioning,Nice Food,Battle to get a refund", "text": "It was good to see the manager around asking if everything was ok.", "user": "VulcanSpotter", "date": "January 7, 2010", "id": 52835278}, {"rating": 5.0, "title": "excellent accommodation", "text": "I would definately stay at this hotel again and would recommend it to anyone who wants a reasonably priced room with the convenience of a good restaurant and coffee bar just a stones throw from the attractions of a beautiful city.", "user": "carolamy37", "date": "December 25, 2009", "id": 51841476}, {"rating": 4.0, "title": "Perfect place for a city break", "text": "We have just returned from York having stayed at the hotel for 3 nights. It's in a great location within easy walking distance of the centre of town. The rooms were clean and of a reasonable size, with everything you could need for your stay. We ate in the restaurant on the night we arrived and the food was hot and reasonably priced. Breakfast was a buffet and was hot and well presented. With no exception every member of staff we dealt was was pleasant and helpful and that alone in any hotel these days is unusual.", "user": "Anjef", "date": "December 1, 2009", "id": 50425715}, {"rating": 3.0, "title": "Better value elsewhere", "text": "I booked the Premier Inn, Central York on Trip Advisor recommendations for a business trip for myself and colleagues. The Premier Inn is well located, clean and the rooms are adequate but nothing to rave about - at £79 for the night - it pays to shop around.", "user": "TheSims4", "date": "November 30, 2009", "id": 50351163}, {"rating": 3.0, "title": "At the end of the day it is a Premier Inn - albeit a good one", "text": "Unexpectedly we had to stay an extra night and had to check out of the Premier as they only had one room. I remembered the Hotel Du Vin in York and managed to get beautiful rooms for £99 per night including breakfast. Absolute no comparison for the extra £20 and extra 5 minute walk.", "user": "joaniebinedinburgh", "date": "November 29, 2009", "id": 50294672}, {"rating": 5.0, "title": "excellent hotel", "text": "After the reviews on here I think my expectations were unreasonably high.", "user": "midwife63", "date": "November 21, 2009", "id": 49769728}, {"rating": 5.0, "title": "Premier Break", "text": "Hotel is close to the station, benefit if you are travelling by train, but is a good 10 minute walk into the centre. Staff were pleasant. Our first room smelt of smoke and they were happy enough to move us to another one. The room is just your average standard Premier Inn room, again not a surprise, but for some reason due to the reviews I was expecting something more. We wanted to keep the room heater off during the night and asked for a blanket, and instead were given a duvet with no cover on as this was all they had, not the end of the world of course but didn't feel right to me.", "user": "The_Eleventh_Doctor", "date": "November 16, 2009", "id": 49354146}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "Stayed for 3 nights over the Easter weekend. Bed was very hard had to ask to change rooms was then given a room overlooking the car park. There does'nt seem to be any soundproofing in the hotel there were people shouting in the corridor and banging doors late at night and every sound from the room next door could be heard also alot of external noise from traffic. Staff very unhelpful and did'nt seem to care. Would not recommend this hotel if you want a good nights sleep this is a very basic budget hotel", "title": "Not worth the money", "helpfulness": 1, "user": "caz1949", "date": "April 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 60639255}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "I stayed at this site with my husband and our two children. We arrived before check in but a our room was ready we were checked in early by a very helpful trainee member of staff who was friendly and helpful. Our room was nice, clean and with comfortable beds. The location was a bitnoisy but we did expect that with the central location so it wasnt a big problem. Car parking was fine, though we did overhear others having trouble getting into the small car park though there is an ncp next door which is discounted through the hotel at only £8 for 24 hours. thoroughly enjoyable", "title": "great location, friendly staff", "user": "JoolieMahon", "date": "April 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60636995}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Just stayed at the premier inn for a couple of nights. Impressed with the location as only a short walk from the train station and also the centre.", "title": "Nice hotel in good location.", "user": "Sleekjaney", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 60383089}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Staff all seemed reasonably helpful. Room was absolutely massive, seemed a little", "title": "Hard beds and one overbearing staff member", "helpfulness": 2, "user": "DaveJC", "date": "March 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 59407048}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "expensive but then it is in york.", "title": "Good, clean budget hotel with helpful staff and great breakfasts", "user": "lisacolsam", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59355655}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Top marks for location but as previously stated in other reviews, parking is a big problem. We stayed in the annex part of this hotel which appeared cold and damp, you could visibly see the curtains moving from the draft coming in through the window. Large king sized bed in the room but not much room to move around. The biggest problem was due to the accommodation facing onto a court yard which housed late night drinkers from the pub attached which kept us awake. This was followed the following morning at 5am and 7am by the arrival of noisy refuse collection vans. Will not be stopping here again.", "title": "Ok if you want sleep deprivation", "helpfulness": 1, "user": "Geordie5", "date": "March 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 59345905}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Free breakfast was offered on complaining at reception, however decided not to take up this offer as it would not make up for other travelers experiencing the same problem.", "title": "No Complaints", "helpfulness": 1, "user": "KiwiinBrighton", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 57725108}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I was a bit nervous about staying here after reading several reviews and having never stayed at a Premier Inn. My wife had stayed at one in London and had no complaints. First from the train station its around a five minute walk and only a 10 minute walk to the centre of York. The walk can be done along the walls to either towards the river and museum gardens or the Castle Museum if you go the other way along the wall. Reception were efficient and polite. Room not huge but the king size bed was a bonus. Shower was brilliant. My only bugbear was the liquid soap but we bought our own proper soap. Bed very comfortable, tv tiny but we were there to explore York and not watch tv. Breakfast was fine, we had table service one day and buffet the next day both were fine. Overall I would definitely stay again and we are planning an additional trip to York in the future and will stay here again.", "title": "Great location - excellent value for money", "helpfulness": 1, "user": "catfriend2009", "date": "February 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57192535}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "My boyfriend and I stayed at this Premier Inn, in early February for a 2 night stay. Everything certainly is premier but the price! I was pleasantly surprised to find the room very clean (including the bed linen), it was warm and the quality of the bed meant we had a good night's sleep for each night we were there. The front of house staff were very welcoming and knowledgeable of the area. The only slight problem was that there is only one person manning both the Costa Coffee concession and the hotel bar during the afternoons - long waiting times ensued leaving me losing the will to live on a couple of occasions.", "title": "Not Bad", "user": "ChrisBartram", "date": "February 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 56660035}, {"rating": 5.0, "title": "First class hotel and staff", "text": "The breakfast is good value for money too, lots of cold and hot items to choose from and you could eat as much as you liked! - all for £7.95pp.", "helpfulness": 1, "user": "James S", "date": "February 19, 2010", "id": 56471740}], "location": {}, "variance": {"poor": 25, "average": 62, "very good": 247, "terrible": 8, "excellent": 254}, "aka": "Premier Inn York City Centre (Blossom Street North) Hotel", "slim_ranking": 0.297872340426, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Conveniently located for amenities and attractions including York train station, York Minster, the National Railway museum and the historic city walls. Our York City Centre Premier Inn has everything you'd expect, incredibly comfy beds in every room and an onsite Table Table restaurant for a fresh new twist on eating out. Car parking is available a short distance from this Premier Inn - for which an additional fee may be charged."}