{"user_rating": 4.5, "review_count": 696, "name": "Premier Inn Stansted Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I was visiting Bishop's Stortford (the other side of the M11) and usually stay in Premier Inns whilst on business.", "title": "Didn't Hear the Roar of Aircraft", "helpfulness": 5, "user": "OldVillain", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174282229}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I was a little concerned that the noise from the airport might affect the quality of stay.", "title": "1st class hotel.", "helpfulness": 7, "user": "mitchcornwall", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174166392}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Had I not know that Stansted Airport was nearby, I would never have known from the noise whilst at the hotel.", "title": "A perfect location for a perfect hotel!", "helpfulness": 7, "user": "DottyKams", "date": "August 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174068151}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The room, as ever, was comfortable and I had a good night's sleep.", "title": "up to standard", "helpfulness": 6, "user": "bazzer1", "date": "August 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 173812156}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The restaurants were fine for your typical Englishman and family. The breakfast was very good and set me up for the day ahead.", "title": "Ideal overnight stay for the airport", "helpfulness": 4, "user": "M D", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173797957}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I'm a PI regular and this was one of the best I have stayed in. Customer service and friendliness first class. Didn't hear one airplane over the two nights we stayed. Breakfast was busy but that ensured food was always fresh. I had my 80 year old mum with me and staff could not have been more solicitous of her comfort.", "title": "Very impressed", "helpfulness": 4, "user": "Gailnic", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172576009}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "£8 taxi from the airport to the hotel. £3 on the bus so take your pick depending on numbers travelling. Very impressed with the whole Stansted experience, hotels, trains buses etc.", "title": "could be better", "helpfulness": 2, "user": "tyneen", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 172082286}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Stayed here one night prior to an early morning flight from Stansted, hotel not on sign posts and sat nav directions didn't work but we eventually found hotel. Staff were friendly and welcoming at check in. Unfortunately, as I was about to get a bath I walked bare foot towards the bathroom and stood on an un noticed piece of glass on the carpet which cut my foot. My husband went down to reception with the piece of glass and to get some plasters for my now bleeding foot, staff on reception gave him some plasters and said they were the only staff on in the hotel and no house keeping on duty to come and hoover the room, but one of the reception staff said he would come and hoover the room in case there was anymore glass. Also the bath had hair around the edges which I cleaned before getting in, which reception staff also saw when he came to hoover the room. staff were apologetic. In the morning, we took our car to the long stay car park and waited for the shuttle bus where lots of other people had gathered at the bus stop to wait. When the bus came, everyone crammed into the bus and the racks for the suitcases were full and the bus driver was shouting not to have any suitcases in the aisles but there was no room and people were squashed stood up, I couldn't wait to get off ! I was dreading the return journey to pick the car up but the return journey was much better with plenty of room on the bus. Staff at the hotel wanted to give us a refund for the room after the glass incident, but the bank card we used to book the hotel had been blocked by the bank due to fraud and we were waiting new bank cards to arrive. We sent an email to premier inn customer relations and are still waiting a reply and a refund.", "title": "Ok stay - shame about Premier Inn's poor communication", "helpfulness": 2, "user": "laura W", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 172079412}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stayed here before a holiday.", "title": "Stansted premier inn", "helpfulness": 2, "user": "1985Jac", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172059958}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Hotel is as a normal premier inn. Bar/ restaurant was decent and staff were friendly. Meals were large - not cheap but not too expensive either. Around £11-£16 for a meal. We were upsold to some special chips but these were forgotten - the staff sorted this out for us but by the time they had been brought out we had finished our meal.", "title": "Ideal overnight stopover", "helpfulness": 3, "user": "Sue P", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172028063}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We had an early Ryanair flight the next morning (6.45 am) and wanted to have a bit of sleep before. Returned the rented car and took a taxi to the hotel. The taxi goes at a fixed rate of 8 pounds one-way, the bus would be 6 pounds for two people. So it's worth considering taking a taxi. The bus, which leaves every 30 minutes from and to the terminal, actually only needs 5-10 minutes, so it's an okay option. It's impossible to walk, it's too far and nowhere good to walk. There are two receptionists at all times, they are efficient and friendly. We were surprised to have everything you could actually ask for in any hotel, air conditioning, nice TV, tea making facilities, hair dryer, enough towels, decent shower. We were a bit unfortunate to have a stain on our cover duvet (blood or other?) which clearly showed even after the laundry. It took me one telephone call and to personal trips to the reception to get a new one. They always said \"give us 10 minutes\", but if you get that three times in a row at 11 o'clock at night, you get rather tired and annoyed. They tried to help and were apologetic, but it took too long. Especially since we only had a very short night after all.", "title": "Good stay before flight", "helpfulness": 3, "user": "Martibez", "date": "August 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173770902}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Apart from that I can very much recommend the hotel, I think our incident was an exception. The comfort for a budget hotel is quite high, the price with 30 pounds (booked on their own website) very fair, the short distance to the airport excellent, you just have to add 3 pounds a person for the bus to the terminal (or the other way). Didn't have anything to eat, but half a pint of lager at the bar for 1.60 pounds is definitely not expensive.", "title": "Good airport hotel", "helpfulness": 1, "user": "rv0365", "date": "August 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173765243}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Would stay again.", "title": "Great airport hotel", "helpfulness": 1, "user": "macca28", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173674312}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "A shuttle bus share with holiday inn express will drive you there at a 3 GBP cost one way.", "title": "Easy stay", "helpfulness": 1, "user": "Dan4376", "date": "August 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173588550}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "There is a restaurant and bar inside plus a Mcdonalds and Costa outside.", "title": "Fab start to holiday", "helpfulness": 2, "user": "Larellalou", "date": "August 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173550935}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Stayed overnight on way to a wedding room was spotless, staff friendly and attentive, great food only gripe we arrived late and were told bar was open til midnight went to put bags in room came down at 11.55pm to find bar closed. But well worth the price would go back again", "title": "great value", "helpfulness": 3, "user": "annielow", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173336739}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Having booked a REALLY bad hotel in Basildon that we couldn't stay in despite pre-paying for three nights, this Premier Inn was our saviour. We were met at the desk by Natalie who apparently was 'In Training' but you would never have known. After our horrendous start (at the other hotel), her excellent front of house manner soon put us at ease :) I wish I'd taken note of more names as Jaques (duty manager) was brilliant too, as was Pedro(?) breakfast and Amy(?) waitress. Being so close to the airport, we were expecting a bit of noise, but nothing, we even slept in on our 3rd morning, which really is unheard of! The rooms were clean, comfortable and well appointed. The restaurant food was of a high standard and the breakfasts were amazing. We did have a minor incident with the housekeeping staff accidentally knocking something off the bathroom shelf, but the duty manager sorted this quickly and efficiently. If we are ever in the area again, we will definitely return to this hotel :)", "title": "Lifesaver", "helpfulness": 3, "user": "Pip1964", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173063607}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We had a very nice, clean and big room, the staff were friendly but some of them have a lot to learn. The hotel was huge and unfortunately we had a very long walk to get to our room. It was also easly to get to the airport.", "title": "Very good :D", "helpfulness": 3, "user": "Eline K", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173033933}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Can't fault our stay here (well maybe the parking is a tad pricy!) freindly staff and very clean and comfortable room. We also ate here and had a very surprisingly fantastic meal. I had the vegetarian wellington and it was one of the best that I have had! Would defo recommend.", "title": "Very impressed", "helpfulness": 4, "user": "Ryn26", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172934180}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Used hotel as overnight stop before our flight to holiday destination. Comfortable and clean hotel as we have found other Premier Inns to be. The attached restaurant provided a great evening meal for the family.", "title": "Comfortable hotel", "helpfulness": 4, "user": "B0nB0nJ", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172830658}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 14, "average": 49, "very good": 207, "terrible": 5, "excellent": 421}, "slim_ranking": 0.25, "description": "Ideally situated close to the Mid-Stay Car Park and in close proximity to the A120, this hotel is just 1 mile away from Stansted Airport, coach and train station. Our Stansted Airport Premier Inn has everything you'd expect, incredibly comfy beds in every room and an integrated restaurant serving a mix of traditional and contemporary dishes."}