{"user_rating": 4.0, "review_count": 291, "name": "Premier Inn Milton Keynes Central South West - Furzton Lake", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Well appointed large family room. Only 5 minutes to main shopping in Milton Keynes. Free parking on site with a great view of the lake on a spring morning.", "title": "Good value for money", "user": "tipsy8", "date": "April 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105643692}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Friendly staff and adjoining restaurant is fine for a bite to eat.", "title": "Great value for money", "user": "RomfordClaire", "date": "April 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104656788}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I was taking my children to Gulliver's theme park as an easter treat and decided to book a hotel to make it more special. Luckily I booked it up in advance and got a family room for the amazing value of £29, although I think the full price of about £70 is still worth it. We were greeted by a polite and friendly man and was given the keys to a room that was spotless clean. It was equipped with everything you need, such as hairdryer, tea making facilities, a freeview tv and comfortable beds.", "title": "Hit and Miss", "user": "RX2315", "date": "March 22, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 101134957}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We booked and paid for a full breakfast and didn't have to pay for the kids. The breakfast was fine, plenty of it, hot and had everything it advertises to. In the evening we did eat at the adjoining restaurant even though I had read some bad reviews. It was basically pub grub, We had burgers, chicken and chips and sausage and mash and it was fine. The two waitresses we met were friendly and polite. It's not expensive but if you want a special meal or fine dining then this isn't the place to go.", "title": "Not the best Premiere Inn in the area", "user": "Groovybaby18", "date": "January 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 95026603}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Our room overlooked the bar area but we had a really good night sleep and nothing disturbed us.", "title": "Other Reviews are 'Spot on'.\"", "user": "Awarely", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 94422290}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I spent new years eve here for two nights with my boyfriend. (Both aged 20) It was a cheaper alternative to the others in centre MK and did not cost much by taxi to get to the nightlife. Check in was simple and quick and the room looked just like every other premier inn minus a plasma TV. The hotel was clean and fine, BUT the pub 2 for £10 was AWFUL. I actually refused to pay for meal it was that disgusting. I used to work for Whitbread up until two months ago and i worked in the premier side in head office so i know the standards. The restaurant next door is no way affiliated with premier inn or whitbread 2for £10 is a different chain in its own right, and boy could I tell the difference. We waited 10minutes to be seated even though there was only two tables bein used in the restaurant- the staff were having there own private conversations. We got seated and waited 15minutes for our drinks to arrive and food orders to be taken. An hour after ordering our starter came which i could only describe as heated up iceland £1 buffet selection. The main course came, my boyfriends lasagne was edible but the garlic bread rock hard! my chicken i had to saw like it was a steak, the bacon was bright pink the cheese was jus grated on top and not even melted as a chicken new yorker should be!! AND my chips were stone cold! i sent the food back and just asked for fresh chips as i didn't really feel like eating. Whilst there i heard another two families complain about slow service and another two sent their meals back! I have never ever sent food back or written a review but people need to be warned of this food! I complained to the manager and he just wrote off my bill as it seemed everyone was complaining, and he couldn't really be bothered with an argument! So all in all a good hotel, just a terrible restaurant! AVOID!!", "title": "Great Hotel! AWFUL FOOD!", "user": "goonergal", "date": "January 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 93740318}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Stayed in several Premier Inns and this was not the best - seemed a little tired (although not old). Room was OK, so fine for an overnight in the area. Adjoining pub did OK food, but not exceptional. Not particularly handy for anywhere.", "title": "Basic no frills", "user": "Taymar", "date": "December 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 90723582}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "I have no complaints about the hotel itself, clean, comfortable and good friendly staff.", "title": "Hotel Very Good, Pity about the restaurant.", "user": "hollyarran", "date": "December 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 89434265}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The attached restaurant had a good menu but unfortunately both my starter and main were not as hot ad they should have been. Families on an adjacent table sent theirs back so it wasnt just me. The chicken had the texture and flavour of processed chicken and although breast shape im not convinced it was anywhere near 100% chicken. Desert, when it came was overpriced for the small size of it. Sadly the table opposite neaded a wipe over but this was not done and four separate members of staff tried to seat people at this clearly dirty table. Eventually someone sat there, before realising his mistake. Surely the staff are capable of wiping a clearly dirty table. The saving grace was the Beer that was very well kept. Sadly attention to detail was missing from what could have been a very nice meal.", "title": "good hotel- good food- good times !!", "user": "karaokestokey", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87673944}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 24, "average": 53, "very good": 109, "terrible": 11, "excellent": 94}, "aka": "Premier Inn Milton Keynes Central South West (Furzton Lake) Hotel Milton Keynes", "slim_ranking": 0.352941176471}