{"user_rating": 4.0, "review_count": 668, "name": "Prince D'Angkor Hotel & Spa", "reviews": [{"rating": 3.0, "title": "Lovely hotel; but oh those beds!", "text": "We booked this hotel for a 6 night stop to see the temples and more of Cambodia. The hotel is lovely and the staff are very friendly and helpful but the hardness of the beds came as a big dissapointment to us. Firm beds ok; but these were just like planks and we found the sleep quality at this hotel less than satisfactory. We asked about other room options but were advised that all beds in the hotel were the same. Shame, because this should have been a wonderful first experience and introduction to Cambodia, and Siem Reap in particular. Rooms are very well appointed and immaculately clean.", "helpfulness": 2, "user": "Stozzas", "date": "January 26, 2013", "id": 150668160}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Hotel is very well located. 10 minute walk to the centre town, great eating places in Pub Street and the bustle of the night markets (tacky for the most part but great fun) and far enough away that the noise and traffic are not intrusive.", "title": "Angry/ poor reception staff", "helpfulness": 1, "user": "james f", "date": "January 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150463790}, {"rating": 4.0, "title": "Really great experience", "text": "It is worth paying the extra cost to have a room with a balcony overlooking the very lovely pool and garden (De-luxe rooms). Also ask for a room on the top floor as all the bedroom floors are hardwood timber and any movement in adjoining/rooms above can be quite noisy.", "helpfulness": 1, "user": "Jacqui W", "date": "January 16, 2013", "id": 149837845}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We had planned to have 2 days rest after visiting the temple complexes - which are amazing, but the hotel commenced very noisy buiding works adjacent to the pool which made it near impossible to relax. We were advised that this would be for one day only by the management, but the noise persisted on a second day making it impossible to relax both in our room or by the pool. Management apologised but could do nothing about it. We left early and moved to another hotel nearby for the remainder of our Siem Reap trip. Food and beverage at the hotel is expensive by Cambodia standards so very few people eat or drink there particularly in the evenings.", "title": "Accomodation Siem Reap", "helpfulness": 1, "user": "RMRSydney_Australia", "date": "January 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149538459}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Overall a fantastic place to stay. This was my third stay in the the past 12 months . The reception person (male) was angry never smiled (over my entire 18 day stay) and made you feel insignificant when you requested actions/ interacted. Remember first impressions last !!!!!! and they are your buisnesses first impression to the public! My shower was covered in mould and when i requested action i was made to feel like i was wasting his time and the hotels time (NO APPOLOGY GIVEN EITHER FOR THE MOULD - OR WAS IT EVER CLEANED). You have lost one of your best customers.( i have planned 4 more stays for this year) I have discussed this with the guest relations manager (in the lift) and still haven't recieved an acknowledgement! Remember its very competetive in siem reap and you are loosing your best customer! PS.fix the internet it is rediculously slow when it works, to do buisness.", "title": "A great get away and place to relax", "user": "Oren F", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149336535}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I spent 16 glorious hours in Siem Reap. The first stop was the hotel. We checked in and the service was incredible. They walked us to our rooms and took our bags for us. The rooms were clean and spacious. The balcony overlooked the pool and was a great place to sit and relax at night after a long day of traveling.", "title": "Beautiful, trendy hotel", "helpfulness": 1, "user": "kandirae03", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154536766}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We changed for dinner and it was a fixed menu for us. The local fish was delicious and well prepared. The staff- kind, friendly and had warm smiles the whole time.", "title": "gutted!", "helpfulness": 2, "user": "mason243746", "date": "March 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 154110497}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We finished the night with a dip in the swimming pool which was vast and beautifully lit at night. It was refreshing.", "title": "best location and beautiful hotel", "helpfulness": 4, "user": "davidchef", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153984589}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "It was a great place to sleep, swim and eat. I highly recommend it for it's location, friendly staff and spacious rooms.", "title": "Beautiful Experience!", "helpfulness": 3, "user": "Barb1952", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152628841}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We love Cambodia. But the room service who removed my D&g aftershave and my t shirt from the bathroom ruined our stay. Cambodia hospitality is Next to nothing but we were we gutted about staying at this hotel....Even at $140 a night... We will keep returning to Siem Reap as we love it.... Special place...... CAMBODIA is mega but not the F£$%ers who stole my aftershave!,", "title": "4 Star hotel delivers but nothing extraordinary", "helpfulness": 1, "user": "Susan H", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 152155590}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Attentive and magnificent staff, an torpical oasis of a garden/pool area, and clean superb rooms makes this easy to say: I would LOVE to come back here again! If I have to say something on the minus-side: the breakfast was not that good or impressive.", "title": "Fabulous!", "helpfulness": 3, "user": "Jazzpedal", "date": "February 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152101759}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "In the old French Quarter of Siem Reap, the Hotel sits behind one of the bustling city main streets in its own gardens. Although further away from the Angkor Temples than the new Western Hotels, its central location has the advantage of direct access to the city shops, markets, bars and restaurants.", "title": "Ideal for the Temples and the City", "user": "Paullaird", "date": "February 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152086522}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The only disappointment was the Restaurant. The breakfast was excellent, however the junior staff in the evening didn't seem up to the job and the food, although reasonably priced, was a bit variable.", "title": "Thoroughly enjoyed the ambience of this hotel", "helpfulness": 1, "user": "Sandy897", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151541496}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "All other staff were excellent, and the pool perfect after a long day of sightseeing.", "title": "Good location but...", "helpfulness": 2, "user": "crazii_love", "date": "February 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 151351239}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We didn't use the Spa and the Wifi was free, and accessible throughout the hotel.", "title": "Tough not to love this hotel.", "helpfulness": 6, "user": "Malone2", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 150944207}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This is a lovely place to stay. Rooms are a good size and kept immaculately clean. Public areas are excellent, with a good choice of lounges and bars as well as an extensive outside area around the pool with a bar/café. We found staff to be very friendly and attentive in all areas of the hotel. The food was of a very good standard, with excellent breakfasts (although staff were a little slow to replenish supplies at peak times) and a very good Asian buffet on one evening. Siem Reap itself is nothing special, being a resort developed (and still developing) to accommodate the tourists flooding to Angkor Wat, but the Prince D'Angkor provides a very pleasant haven of peace and tranquillity away from the noise and chaos of the streets outside.", "title": "An oasis of peace", "helpfulness": 2, "user": "Steve-G23", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154935912}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "An very warm and welcoming hotel.....they had organised a free pick up from the airport upon arrival in an air conditioned van. Once we got there we were given cold towels and a drink and as we finished our drinks we were informed that our room was ready.....which was very efficient on their part.", "title": "Excellent stay", "helpfulness": 1, "user": "Mulberry80", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154927687}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Our room brilliant, we had a street facing room, but we never heard any of the outside noise. They had considered all my requests with regards to the room so it was perfect. I was travelling with my friend and we got a king size bed and a single....so ample space for 2 ppl.", "title": "Wow, Siem Reap has changed!", "helpfulness": 1, "user": "Wanderer33", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154907010}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Staff were always pleasant and helpful. Hotel facilities were brilliant including the gym which I used daily during my 3 day stay. The swimming pool was relaxing and makes a difference with the fresh water. Breakfast was brilliant and had a wide variety, especially being a vegetarian. The bar and pool bar were brilliant and very accommodating.", "title": "Wonderful hotel in all ways", "helpfulness": 1, "user": "Minute01", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154824072}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "In terms of location, it was brilliant, we were about a 5 minute walk from pub street were you find all the pubs and restaurants. About a 15 minute Tuktuk drive from Angkor Wat. And 15 minutes away from the airport.", "title": "Excellent and central", "user": "Bettina S", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154776824}], "location": {"country": "Cambodia", "continent": "Asia", "city": "Siem Reap"}, "stars": 4, "variance": {"poor": 20, "average": 73, "very good": 305, "terrible": 8, "excellent": 262}, "aka": "Prince d`Angkor Hotel Siem Reap", "slim_ranking": 0.427884615385, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Recipient of \"Cambodia's Leading Hotel\" in 2011/2012 on the World Travel Awards.Prince D'Angkor Hotel & Spa is a sanctuary for tourists and corporate guests alike who expect excellent hospitality and friendly service. So whether you are here for business or pleasure, the Prince D'Angkor Hotel & Spa offers a luxurious haven, elegantly furnished to provide you with a comfortable stay and all the facilities and traditional Cambodian hospitality you would expect. Experience ultimate luxury and bask in the splendor of elegance at the Prince D'Angkor Hotel & Spa, the perfect base from which to explore the legendary Angkor temples and undiscovered treasures of Cambodia."}