{"user_rating": 3.5, "review_count": 275, "name": "Promenade Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Stay at Promenade for 4 days 3 night during holiday last year with my friends. Reach the hotel around 4pm but we asked to wait for at least 1 hour because our room was not ready. Our tour guide manage to ask some refreshment from the hotel staff. We were served with fruit juice and the SOUR FACE of the waiter as if we owe them money. The room need some refurbishment as it look tired and smells funny. The bathroom was not cleaned properly. My room was situated next to the air conditioning system, so its noisy the whole time.The breakfast buffet is nice. They have a lot of choice ranging from croissant to nasi lemak. Cant wait for breakfast throughout the stay but don't ever try the cakes sold there. When one of my friend hurt her leg and we asked for first aid kit, the hotel staff look dumbfounded by our request and it took them quite awhile also to find the first aid kit. When they finally have found it and we borrow it to our room to treat our friend's wound, to our surprise that the first aid kit is nearly empty. The antiseptic has expired, there is no bandage, not even a Panadol in it. All in all, the staff need more training with their attitude especially the waiter. Last but not least, be careful with China tourist during breakfast. They have no respect for others. They wont queue and they will ravish the foods there as if there is no tomorrow.", "title": "Don't be fooled by the grand lobby", "user": "danny87ngu", "date": "January 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122641196}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My wife, mother and father in laws and I booked two rooms side by side on what we were told were upgraded deluxe non-smoking rooms. At the check in, the staff rudely asked me if my wife and I were married. I was astonished thinking he would want me to whip out my marriage cert next! Then he insisted that we didn't have complimentary breakfasts when our travel agent clearly told us there would be. Only after we showed him the proof on our itinerary did he grudgingly write out the coupons for us. The room was horrible! It stank of stale air and cigarette smoke so much so that my eyes started tearing minutes later. I called the front desk and they swore it was a non-smoking room and yet I saw an ashtray on the side table! Later when I left the room I saw a guest from the other room come out and stub out his cigarette before joining us in the lift down. How can a non-smoking room have an ashtray in it as well as smoking guests in the room next door and a large ashtray just outside the lift? Clearly we were lied to. I had to beg the front desk to at least use some air freshener spray if they wouldn't give us another room as the windows are sealed shut and so we couldn't open them to let the fresher air in. Thank God it was only for a couple of nights! Needless to say I am never ever coming back to this excuse for a hotel again!", "title": "Discourteous Check In Staff & Stale Rooms!", "helpfulness": 3, "user": "fbaptist", "date": "December 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 121692740}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed 4 nights there in late OCt. 11 . The receiption office was very friendly and efficient. Spoke perfect English. The room given to us was perect in every aspect; clean, tidy. lot of toilteris, coffe making etc and with a very comfortable bed.They gave us a room facing the sea, really carrying one million dollar view. Buffet breakfast which was included in the room charge was beyong average. I forgot to bring down the coupon voucher ., and yet the waitress kindly allowed me to go in. Perhaps she was wise enough, as seeing I am an olddy, I wouldn't cheat her. Intillegent girl ! We booked dirct and got a very good deal from the hotel. Domwthere got a chienses resturant. From the menu displaced, food items are very cheap. Understand from locals, they taste nice too. Unfotunately no time to be there. At the front of the hotel (they call it Water-Front) , I went for a stroll in the morning; nice place for a morning exercise with unforgettable view.If ever I go to Kota Kinabalu again , I would definitely stay there again.", "title": "Nice hotel with seaview", "helpfulness": 1, "user": "sepang", "date": "December 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121679775}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I stayed at this hotel before and had a pleasant experience so as a loyal customer, I chose this hotel again for my 2nd and latest visit to KK. I am very disappointed with the hotel. I booked 2 rooms through a Singapore tour agent (Konsortium) who used a small local agent to book my hotel. My package clearly stated that it was inclusive of breakfast. However, at the hotel check-in, they told us that breakfast wasn't included. It was after I showed proof of what was stated on my receipt issued by Konsortium that I finally managed to be issued breakfast coupons for the next morning but not the following morning! The staff claimed that they had to check and would send the following morning's breakfast coupons to our room. I am annoyed that for a simple matter as that, I was made to feel as if I was trying to cheat the hotel. Nonetheless, I was prepared to let it as service staff anywhere in the world can be quite useless.", "title": "Repeat Customer's Utter Disappointment", "helpfulness": 2, "user": "SGPMrsBaptist", "date": "December 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 121503517}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "When I checked into my room, I found it was as if the place just had a smoking party! My parents' room was worse! The towels, sheets and everything in the room smelled of cigarette smoke. We called the hotel staff and asked if we could move to a non-smoking floor or room. Guess what they told us? They insisted that it was a non-smoking room! How can a room be a non-smoking room if there was an ash-tray in the room??? Did the staff take us as fools?", "title": "Promenade Hotel", "helpfulness": 1, "user": "Meanie B", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 121303128}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Head a great experience at this hotel after reading reviews here on Tripadvisor. We booked the 10th floor and paid extra for the Executive Lounge. We actually were put on the 11th floor which was excellent. We had a suite, with two big windows overlooking the ocean, loads of room to relax. The breakfast in the Lounge was good, with plenty of fresh fruit and pastries. Not too much in the hot area unless you like Asian type breakfasts, but generally plenty to choose otherwise. Canapes in the evening are nice and lots of variation, and the drinks flow easily. Sit out on the balcony and take some photos as the sun sets. The bar staff are really good, and the Lounge Bar downstairs has free internet. There is plenty of entertainment in the bar and the nightclub too.", "title": "Great place to stay", "helpfulness": 1, "user": "Marieclaire66", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120549190}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Accommodation was very clean, but very average. Very old furnishings. Staff polite but not friendly. Location was very good. Very close to restaurants, markets and shopping centres. Food in the restaurant was very average. Much better options available in the restaurants on the wharf.", "title": "Average, but goot for what we paid", "helpfulness": 2, "user": "leeannv_11", "date": "November 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120180362}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Was here for a course and the organizers booked a twin-sharing room for me and my colleague. The hotel is located at the end of a major road facing the sea, so most of the tourist spots like the bars, pubs, Phillipine Markets are within walking distance.", "title": "Short stay ok", "helpfulness": 1, "user": "mikaelangelo", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119588315}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel room was clean and spacious enough for 2 persons on a business trip. Staff were attentive and were prompt for their wake up calls. All the usual amenities were there including an ironing board. TV was still the old CRT type. When are hotels going to shift to LCDs? The only problem I had was that they took quite long to make up the room even though I left the sign outside the door from morning. They only cleaned the room at 3pm.", "title": "Mediocre facility three star hotel", "helpfulness": 1, "user": "geojak0", "date": "October 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 118924169}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "As some of the other reviewers mentioned, the pool is located besides the cafe and main entrance. Not a problem for me, but if you're shy, this might not be the best place to be showing off yourselves to gawking diners! :)", "title": "Kudos to all staffs!", "user": "TST_00", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118438769}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The hotel is situated at the extreme south point of the promenade, this isn't such a big problem as a 10 to 15 minutes stroll takes you to the centre or a 2 to 3 minutes in a taxi. The hotel is generally quite good, the sea view rooms provides an excellent sun set. There is a small bar on the second floor that has live music (was good when i was there). The hotel caters for lot of functions happening like weddings so the lobby area and around the function rooms can get a bit chaotic. No complaints with this hotel, was a fairly good place to stay although nothing particularly special springs to mind", "title": "Fairly good hotel", "helpfulness": 1, "user": "S35owl", "date": "January 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 123894406}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "When you walk into the hotel lobby, it looks grand, with personal chairs and receptionist to greet you, but beware he seems not properly trained, when I book for 2 nights, he give me one with one breakfast coupon. You may have to repeat your words a few times because he is not responsive, strange behavior.", "title": "You are cheated !", "helpfulness": 2, "user": "Lee K", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 123776792}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "So I have asked for a non-smoking room, however when getting into the room, funny there is some cigarette smells, although it goes away (or I get used to it) later. And inside the room, the first thing you notice are some disappointing notices on the table, temporary closure of swimming pool, some TV channels disruptions, and refurbishment noises.", "title": "Promenade Club..", "user": "TSI_DSG", "date": "January 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123745049}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The internet connection is sad, it is slower than snail, you have to wait 3 minutes for a page to load, totally useless, when you call to ask what happened, they say they want to go into your room and investigate, that is not intelligent at all, I told them forget it, because they just have a lousy broadband, thats all.", "title": "Stay here only if Le Meridien is not available...", "helpfulness": 1, "user": "DendangPerantau", "date": "January 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123294577}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "The TV is so so small, and room is dim, the kettle looks dirty. The standard room rate RM$250 is expensive with this kind of set-up in Malaysia, really not worth your money.", "title": "In Desperate Need Of An Upgrade", "helpfulness": 1, "user": "delphinus2330", "date": "January 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122954367}, {"rating": 4.0, "title": "Great location, great buffet breakfast", "text": "Stayed for 5 nights at the Promenade. My husband and I opted to pay extra for the Junior suite which I highly recommend. Heaps of space and gorgeous view over the South China Sea.", "helpfulness": 1, "user": "tarynsmum", "date": "February 26, 2012", "id": 125259668}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "One of the biggest buffet breakfasts I've ever seen! Staff were very helpful in organising transport etc. Loved the location, right on the waterfront and short walk to shopping centres and also The Waterfront which has great restaurants on its boardwalk.", "title": "Except for the service, the rest is fine...", "user": "tobex90", "date": "February 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 125223979}, {"rating": 4.0, "title": "Recommended!", "text": "Would definitely stay here again.", "helpfulness": 2, "user": "DiyanaArtemis", "date": "February 21, 2012", "id": 124959176}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "1 incident pissed me off. Checked in 25 feb and supposed to check out on 27th. On 26 feb around 1pm, I was in my room, with my wife. The housekeeping guy just simply opened the door using his key, without even knocking or ringing the door bell. When i asked why didnt he knock, he just simply said sorry and closed the door. When i tried to call and complaint this to the duty manager, someone told me he's not around and will return the call, which did not happen. Then i walked down to find him. I managed to get him, but all i received was \"sorry\" and \"we will investigate this\"...", "title": "4 star hotel 5 star services", "helpfulness": 1, "user": "nonog18", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124378895}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I am supposed to check out on 27th, and i dont have \"please make up room\" sign outside.. So i really dont understand why that guy can just simply opened our door. And i cant even understand more why a dumb, incompetent, insensitive person can be appointed as duty manager for a business dealing with hospitality....", "title": "Extremely good value for money. Recommended for families.", "helpfulness": 1, "user": "Lavy81", "date": "February 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123994063}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 4, "variance": {"poor": 23, "average": 93, "very good": 111, "terrible": 15, "excellent": 33}, "aka": "Promenade Hotel Kota Kinabalu", "slim_ranking": 0.340909090909}