{"user_rating": 4.0, "review_count": 150, "name": "Promenade Palladium", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I did not had a very good experience @ the Promenade. The frontdest was not that helpful, the cleaning wasn´t expectacular and the food did not have a good quality. Sorry but I guess that for the location they have, they could have had a better service!!!", "title": "It could be better for the location!", "helpfulness": 4, "user": "Paul D", "date": "August 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 136478142}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "If you have to have a beach view in Leblon, look elsewhere (and be prepared to max out your card), but this smallish hotel is very close to it and right off the principal shopping street in the best beach community: Leblon. You get excellent value at this hotel; comfortable room, an incredible heavy marble tub (the wife went slightly bonkers!), wonderful buffet, and very friendly, efficient, and helpful staff.", "title": "Leblon gem.", "helpfulness": 1, "user": "CariocaBonito", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135442837}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "And.... NO traffic noise at night.", "title": "Worth the price and more!", "helpfulness": 1, "user": "Shabsids", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134176561}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We'll be back!", "title": "Great Location, Comfortable Room, Friendly Staff", "helpfulness": 2, "user": "Afrocup", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132463389}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Promenade Palladium was one of the hotels pre-booked for the Rio+20 Conference. Upon reading the reviews of the place I decided to opt for this one, and was more than happy of the decision. I stayed there for a week.", "title": "Location!", "helpfulness": 3, "user": "Katris", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128986790}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A couple of blocks in from the beach in Leblon. Lovely neighborhood with loads of restaurants and cafes within easy walking distance. I had been afraid to go to Rio because of stories about violence. Within a day of checking in at this hotel, I felt very much at ease.", "title": "Great location and some outstanding staff", "helpfulness": 3, "user": "Fortunately", "date": "January 31, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 123936705}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "We stayed at the Promenade Palladium at each end of our trip to Brazil. We booked our initial stay through hotels.com. We'd requested a quiet room and were given a room at the back of the hotel, overlooking a large, communal square, shared with many other properties, including apartments and a childrens' playground. Our room was large, though not very quiet. I don't usually like to sleep with the air conditioner on, but used it to drown out the noise from the communal square. Due to some outstanding customer service (apart from our somewhat disappointing room), we booked directly with the hotel to stay another 3 nights following an excursion outside Rio and were given a much nicer room with a balcony at the front of the hotel, overlooking a leafy street. It was quieter than the room at the back of the hotel. I think we may have been upgraded.", "title": "Used to be the best in town, rooms getting old", "helpfulness": 2, "user": "Roberto M", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122965611}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "We had amazing assistance from Edina, one of a handful of English-speaking staff, who helped us book a hotel in another part of Brazil. All of the English-speaking staff (not all staff spoke English and understandably needed to refer us to someone who could) were very helpful. The reason we decided to book at this hotel again for our last 3 nights in Brazil was because of the very helpful staff.", "title": "Great location, hotel is good but it could be brilliant with a couple of minor improvements", "helpfulness": 2, "user": "lolls", "date": "November 12, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 120511636}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Breakfast is buffet-style, with a huge selection. I was particularly impressed with the scrambled eggs, which were kept warm over a bath of hot water so they didn't dry out.", "title": "Small but one of the best in Rio", "helpfulness": 1, "user": "jmusman", "date": "October 27, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119813409}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "A couple of tips: We liked to have a drink at one of the many outdoor bars, overlooking Leblon and Ipanema beaches, up the hill to the right once you reach main road next to the beach. The hotel's pool was not heated when we were there - shame as it is a good size for laps, though not very scenic (not rooftop). Alot of business people stay at this hotel. It threw me a bit when I first showed up at breakfast in tourist garb, but no one seemed to mind.", "title": "Perfect Location in Leblon", "helpfulness": 1, "user": "manu070", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116892046}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We booked a 'Luxurious Double Suite' for 6 nights. It was a very good, spacious room, with kitchen area, sofa, table and chairs (see travellers' photos). Excellent huge comfortable Kingsize bed, linen changed daily. Good bathroom, large shower. All clean and nicely presented. Pleasant and cool (didn't need AC on). Some noise from next door (noisy person!).", "title": "Really good (except for the balcony netting)", "user": "salmoneater", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143779247}, {"rating": 2.0, "title": "Rooms are below expectations but location is perfect", "text": "The balcony was very disappointing. On the rear of the hotel, looking on to apartments and offices (and the pool below) and a kids roof-terrace play area opposite (including floodlit soccer on Friday!), only one chair. But the main issue was that it was netted - why? to stop us throwing beer bottles (or ourselves) into the pool? no - because balconies are netted only on the third floor! Any other floor would have been better. The netting gives a slightly upsetting, imprisoned feeling. Please Palladium - unless there's some very good reason, take it down.", "user": "Pedro and Márci... S", "date": "October 2, 2012", "id": 141862580}, {"rating": 3.0, "title": "mediocre", "text": "Balconies on the front look much nicer - tree-top level, but perhaps with street noise.", "user": "Cool M", "date": "September 29, 2012", "id": 141608611}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The pool is an adult-appropriate lap pool, quite narrow (only just 2 people wide) but good length. Not child-friendly (hooray!), more of an exercise facility than lounging-by-pool. Not heated but fine on a hot day after the little bit of sunshine has reached it.", "title": "Good value for price", "helpfulness": 1, "user": "AlmirNeto", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139848962}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "The neighbourhood is very pleasant - cool, leafy streets. Everything necessary for life is nearby - supermarkets, pharmacies, beauty salons, shops, restaurants, bars and the beach. But it's quite a way to Centro and many of the 'sights' - museums, Sugar Loaf, etc.", "title": "good experience", "helpfulness": 2, "user": "Floyd M", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 137788531}, {"rating": 3.0, "title": "You are only paying for the location", "text": "As per the previous reviews, the location of this place is perfect. Great neighborhood, very safe, even at night. The lobby and staff are also quite nice. The rooms are terrible, another traveller on this board accurately equated them to Motel 6 rooms. I would say at least Motel 6 is cleaner. Rooms here are musty, moldy, and there are bugs. The bathrooms are especially very moldy. We paid $300/night, which is very poor value. You are essentially paying for the safety of the location. We were so disappointed with the rooms we checked out one night earlier. I would not return. Look for a different hotel in Ipanema or Leblon area, there are many alternatives.", "helpfulness": 1, "user": "Luv2Travel120", "date": "August 10, 2011", "id": 116542901}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "As most of Rio de Janeiro's hotels, this follows as being very expensive for what it offers.", "title": "Overpriced, but great location", "helpfulness": 1, "user": "guiafonso", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 2.0, "service": 5.0}, "id": 115822214}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The room is good, but nothing to be of great memory. The service is very courteous, and the breakfast buffet is excellent.", "title": "Excellent choice for first time visitors", "helpfulness": 5, "user": "Br0sie", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111667734}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Location is great, with easy access to Leblon beach and public transport.", "title": "Classy hotel in Rio's safest neighbourhood", "helpfulness": 1, "user": "LeVisitant", "date": "April 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104892849}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Hotels in Rio are notoriously expensive and it's also easy to wind up staying in a dangerous part of town. We therefore spent a long time picking our Rio accommodation for a three day stay at the end of nine weeks of traveling.", "title": "Good choice in a great neighbourhood", "helpfulness": 1, "user": "viajer0mx", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 99322044}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 3.5, "variance": {"poor": 5, "average": 15, "very good": 82, "terrible": 1, "excellent": 47}, "aka": "Promenade Palladium Hotel Rio De Janeiro", "slim_ranking": 0.112745098039, "description": "Situated on the Leblon Beach, the 4-star Promenade Palladium invites you to enjoy the comfort of its rooms and suites just a 2 minute walk from the sea. All accommodations are equipped with air conditioning, cable TV and other amenities. Mostly have a balcony as well. The suites still feature a living room and a kitchen. While you are not enjoying the sun on the beach or exploring the charming neighborhood, you can relax in the small swimming pool or work out in the hotel’s gym. After all this, make sure you stop by the coffee shop to unwind having a drink and snacks before going to bed."}