{"user_rating": 3.5, "review_count": 448, "name": "Protea Hotel President", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "On arrival we were greeted by friendly and helpful reception staff who were quick and efficient. We were two couples and had two rooms on the 5th floor.", "title": "Good...but could do better", "helpfulness": 1, "user": "alwyn1", "date": "February 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152219447}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The rooms were mountain facing and we were pleasantly surprised to find that they were more of an apartment than a standard hotel room. The room comprised a large lounge with laminate flooring throughout. It had patio doors leading a narrow balcony(not wide enough for balcony furniture), a kitchen area with sink, fridge, microwave, toaster, tea/coffee making facility. There was a good size wall mounted TV, a two seater sofa and a single armchair plus a coffee table, dining table and four chairs and three deep storage drawers. The bedroom was separate from the lounge, was again a good size and could be closed off from the lounge, making it quiet during the night. It had a comfortable king sized bed, a large wardrobe incorporating a safe, wall mounted TV and good sized storage drawers. The shower room was separate to the WC. The shower was not very powerful but did the job. There was no bath tub.", "title": "Budget chain hotel trying to masquerade as something better", "user": "Oska", "date": "February 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 152031854}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "A little annoying was that fact that during our 12 day stay we had to ask for hand or bath towels on three occassions as housekeeping had left us with none or only one between us. Why, I don't know as there was never an explanation, excuse or an apology. The same thing happened with toiletries.", "title": "Very happy memories at the Protea President ...", "helpfulness": 1, "user": "ianmac", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151973431}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The WIFI in the rooms is useless and not worth the bother of trying. You are given a complimentary 100mg per room per day and the best place to get on the internet is by sitting on the sofas immediately next to the Reception desk, and even then don't expect a satisfactory outcome. There are a few desktop machines you can use in that area but they are no better and were in fact slower than my own.", "title": "Super position overlooking the promenade", "helpfulness": 1, "user": "centurymotors", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151811372}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "There is a wide variety in choice of breakfast and the food was plentiful and fresh. I spoke to guests who were full of praise for the selection. However, we stuck to the cooked food due to all the other choices being laid out in an uncovered state and this is Africa. The four of us would have preferred to eat a more healthier choice on some days, but didn't. I have read other reviews and have not seen this mentioned, and to some who enjoyed and eaten the wide variety on offer, this may seem a little unfair, but this is my review and the truth is, it did restrict our choice. A note for the management; It wouldn't take a lot to ensure the bread, yogurt, fish, cheese, patries etc are covered behind glass screens to stop what you must know is clearly a problem.", "title": "A Great Stay", "helpfulness": 1, "user": "EmmaMaersk", "date": "February 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151681716}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "TOP TIP. If you are looking to stay at at a Protea Hotel then look into getting a Gold Procard, this can be done over the phone when booking. You have to pay for it but it gives you at least 10% of the room rate and up to 50% of all food. Great value for us. It was cheaper to food the kids in the hotel than buy food from the supermarket.", "title": "Great value for money.", "helpfulness": 1, "user": "ManFromLondon186338", "date": "February 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151654880}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The hotel is well situated for Cape Town. We had two rooms which had recently been redone and were a good size, we also received a free upgrade on one of the rooms. We found the staff to be very helpful. The had a few very good meals in the hotel and the prices were very cheap even before the 50% discount. Breakfast was a buffet but there was always a good choice available.", "title": "Nice hotel, a bus ride away from V&A Waterfront", "helpfulness": 1, "user": "Darbymo", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151602820}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "There were two negatives. One free WIFI connection was very poor in one of the rooms. However, the bigger negative was our boys found the sofa bed uncomfortable and the hotel should look to upgrade these as they are not up to standard.", "title": "Great place to stay", "helpfulness": 1, "user": "John T", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151598113}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Overall we had a very good time and felt it was very good value for money. We thought it was very good value and our kids loved it.", "title": "Enjoyed our stay", "user": "Andrew H", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 151447936}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Conveniently located in Seagate, this hotel is one block from the water and several blocks from the bus that takes you to the waterfront area of Capetown. The Waterfront  has lots of shopping and dining options, in case you wanted to eat outside of the hotel neighborhood. There is a grocery store with a great deli several blocks from the hotel and many local dining options are within walking distance. We were told to be in a group if walking at night. The hotel itself is lovely. Public areas are tasteful. The pool area is well landscaped and offers ocean views. While we were here container ships were always anchored off shore. Often they were lit at night. The only downside was the lack of air conditioning in the rooms. While opening the windows provides comfortable temperatures inside, between the birds and traffic a lot of noise was generated. The rooms were perfectly adequate with comfortable beds, down comforters, refrigerators, and plenty of storage. While small, the bathroom was great. The walk in shower was huge and the tile was newly redone. We were with a tour group and noticed several other tour groups here as well as flight crews. Hotel staff were pleasant and our stay was a great start to our South African vacation.", "title": "Small Room", "helpfulness": 1, "user": "Oscardog1234", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 151001399}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Great suite with lounge, kitchen and bedroom, also had a partial sea view. Good location to pick up tour bus, also easy to get the local bus to and from the v&a waterfront. Breakfast good and hotel facilities just the same. Gantry bay has a nice sea front but not much in the evenings.", "title": "Good location", "user": "Kerzy", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117093915}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I would not stay at this hotel again. The hotel itself is fine. It is not a five star hotel so obviously it was not going to be as nice as the other places we stayed on our trip to South Africa for our honeymoon. The rooms are clean, but reminded me of an out of date slightly dingy Caribbean resort. The one we had was also designed poorly. There was little space between the bed and the dresser so trying to move our suitcases around was difficult. They wasted so much space with the living area. If they had just reduced that by 1 foot even it would have made the bedroom more comfortable.", "title": "Not a great choice-poor service", "user": "sometimesworldtravel", "date": "August 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 117050027}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The area was ok-I felt safe, but it was difficult getting places. We knew this going to into our stay here, but it's important to note. Still there were a few restaurants within walking distance, which we went to. We also enjoyed a walk along the water. Since it was spring,we did not get to take advantage of the pool. The breakfast was extensive and probably the best part of the hotel. My complaint lies with the service. I wondered, are people this unfriendly and disinterested in Cape Town? Knowing several Cape Town natives, I know this to be false. Also, is it imperative to whisper? It was excrutiating to try to extract information from the front desk staff and god forbid they offer any without being asked numerous times. When we first arrived we asked for restaurant recommendations and they handed us a giant binder or menus. Ok. We went back to ask about ones that were in walking distance. That was fine. Next day we ask about a specific restaurant and I ask to see the menu binder. They kept insisting on making a reservation at that restaurant. After a couple of back and forths, they gave me the binder. Next day, how much would it be to take a taxi to the Waterfront? Our shuttle costs XYZ rand, but how much would it be to take a taxi? Our shuttle cost XYZ rand. It took at least 3 times asking a question to get an actual answer. Same with asking about the public bus. No one wanted to tell you exactly where it was or any details about it. It was so simple to take the bus to the waterfront and cheap, but the hotel certainly didn't want to provide these answers. Maybe they are trained not to. The front desk staff was not rude, just terrible communicators and every interaction with them was very frustrating. This was also the case in speaking with the tour desk there. Maybe this woman hated her job, but she was so disinterested in providing us information and had quite the attitude when we asked about certain places we wanted to visit. She responded to us with great disdain. THANK GOD we decided to just go to the V&A information booth. We booked lovely tours with the Wine Desk and Mile by Mile tours. Maybe this place is ok if you are staying with a large group that is making all of your arrangements, but if you need to rely on the hotel to help you with anything, forget it. This is not a place you want to stay.", "title": "Service and views to remember", "user": "Gigika", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116612329}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "This hotel is located in a great area in Capetown. You easily can find everything from here. The beach around the hotel is great to spend time walking and looking for the whales during the season. Walking distance from restaurants and supermarket (the room has a small kitchen.", "title": "Centrally placed and well priced for families", "user": "CharmaineCenturion", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 116595924}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Service was great. Breakfast can take a long way during the day... so much food!!!", "title": "Comfortable", "helpfulness": 1, "user": "Lavisha", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116291075}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed at protea president for two nights at the beginning of our holiday, we found the hotel to be well situated, clean and comfortable. The hotel staff were polite and friendly and nothing was too much trouble. The choice of breakfast was brilliant and very tasty. I have read other peoples reviews but can honestly say that we had a pleasant stay.", "title": "first stop", "user": "jazzmin22", "date": "March 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100854938}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We were fortunate to be upgraded from a non sea facing room to a seafacing apartment. The room was very spacious, clean and comfy. The hotel breakfast is very good, spoilt for choice with every option covered. Whilst not the most centrally located hotel it is on 2 bus routes, one to the waterfront and the other to town centre, so it really is an ideal base for exploring the city, costing only 8 rand each way.", "title": "Great hotel, and well located", "helpfulness": 1, "user": "tomgem_lond", "date": "March 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100619204}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "just can't believe the absolutely shocking experiences i'm having with protea. the protea president in cape town charged my credit card for a night in the hotel even when i cancelled 4 days prior to the date shown on the reservation as the last date to cancel with no charge. i've emailed and emailed an no response. now today, a week after the original reservation had me arriving, i received a second charge from the same hotel for another night's stay.", "title": "SHOCKING inability to cancel per their contract--won't refund deposit", "helpfulness": 1, "user": "geoffengel", "date": "March 16, 2011", "detail_rating": {"service": 1.0}, "id": 100373977}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "DO NOT STAY WITH PROTEA! THEY ARE COMPLETELY UNPROFESSIONAL AND WILL STEAL YOUR CREDIT CARD AND CONTINUE TO CHARGE YOU FOR THINGS THEY SAID THEY WOULD NOT. THEIR PROMISES ON THEIR RESERVATIONS ONLINE MEAN NOTHING.", "title": "Not as good as last year", "helpfulness": 1, "user": "Traveller from UK", "date": "March 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 99920989}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "this hotel chain should be shut down by the government.", "title": "Exceeded all expectations!", "helpfulness": 3, "user": "StephenieKDY", "date": "March 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99123515}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "First stay at this hotel.", "title": "Pleasant hotel with excellent staff.", "helpfulness": 2, "user": "StanleyLivingstone", "date": "February 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152856237}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Check-in was quick and efficient, although I later witnessed a large tour group checking in, which caused chaos in the lobby, with luggage everywhere and no semblance of order. Why not check these large groups in at a separate desk on the ground floor, rather than in the overcrowded reception area?", "title": "Could do better", "user": "ombuds", "date": "February 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 152847670}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My room was fine, despite being next to the service stairs and overlooking a corner of the car park. As it was at the end of the corridor it was pretty quiet. One of the power outlets, the one suitable for international plugs, didn't work. All other amenities worked fine. My room had a shower only bathroom, which I hadn't spotted in the room description. The fridge and microwave were a plus.", "title": "Local Tourist in Cape Town", "user": "Naadia", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 152425429}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The pool area and veranda were pleasant and the service by all the staff was excellent and swift.", "title": "Great All Round Hotel!", "helpfulness": 3, "user": "Rebecca S", "date": "February 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152285747}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I didn't have breakfast in the hotel as the dining area was packed and there were large queues.", "title": "Do not expect too much", "helpfulness": 1, "user": "David F", "date": "February 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 152233058}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Our room didn't overlook the ocean, but we knew it was there, we could glimpse it from the pool. We did overlook the drive-up entrance for tour buses which arrived from about 5 a.m. to midnight and sat idling while they disgorged hundreds of other hotel guests. We had a view of Lion's Head off to the right.", "title": "Comfortable, but very noisy", "helpfulness": 2, "user": "grip652", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "service": 4.0}, "id": 116076137}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "These guests were very evident at breakfast. The acoustics were horrible and when the breakfast area was packed--in most cases with teenagers--the volume was incredible. Too bad, since the breakfast was excellent, the egg cooks affable. It's extremely difficult to get coffee and tea refills in South Africa, or maybe just Protea hotels, so won't hold that against this particular hotel restaurant.", "title": "Great Position", "helpfulness": 2, "user": "Mwingereza", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115246284}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The room was very comfortable with a mini kitchen and sofa. And drawers! We found few rooms with drawers in the 9 hotels we stayed in on our tour. We spent four nights here and, despite the noise, were relatively happy. If we were to stay here again, we'd definitely demand a room on the other side of the hotel.", "title": "Sort out the WiFi please, and change your supplier of prunes", "helpfulness": 2, "user": "Totallyjamdown", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 114891435}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The hotel is situated well for walking on the beach, and short-route buses will take you to the tourist areas like the Victoria and Alfred Waterfront and Table Mountain cable car. Downtown Cape Town offers local history and museums and Greenmarket Square for buying souvenirs.", "title": "A Lot to be desired...", "helpfulness": 3, "user": "babv5", "date": "June 15, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 3.0, "service": 1.0}, "id": 113652366}, {"rating": 3.0, "title": "Okay", "text": "The Protea President is set back from the promenade at Bantry Bay in Cape Town. It is ideally situated, a handful of shops, bars, and a supermarket are just a short walk away, the City Sightseeing tour buses stop virtually outside the hotel, and the V&A Waterfront is a short taxi ride.", "user": "Iluvthe44thpresident", "date": "June 13, 2011", "id": 113231256}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "This was our first stop on a tour of South Africa with Smartours and our first impression of the room was not good. Clearly, Smartours is taking the cheapest rooms they can find at this hotel and we got one that should, perhaps, have been taken out of service. The hotel is renovating rooms, starting at the top floor, but they havn't gotten to the basement yet. When we first arrived there was a terrible odor in the hallway and we found the room to be marginal. The sofa was well worn, stained and not very clean appearing. The table and wicker chairs had seen better days. There were two single beds with fresh, clean sheets, however, and they passed the bed bug test. The bathroom was clean. My wife said the room had a nice \"set up\". The room had no alarm clock, but as we were to find out, none of the rooms in SA had one. A report to the front desk and to our tour director took care of the odor problem quickly (something in an adjacent store room was the cause) and we started to feel a little better about the room.", "title": "Lower level", "helpfulness": 5, "user": "muskrat2", "date": "May 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 110017157}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed four days and the hotel (and room) began to grow on us. The service and included breakfast was good, the location great with a supermarket, eating places and a liquor store within easy walking distance. The hop on hop off bus stop is right down the street and the bus stop to the waterfront a short walk. The area felt safe.", "title": "In the shadow of Table Top", "helpfulness": 1, "user": "DIPU_11", "date": "May 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107457851}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We probably had one of the worst rooms in a pretty nice hotel. If we had been paying top dollar we would not have been satisfied, but as part of the budget tour package we were OK with it.", "title": "Great value in excellent Location", "helpfulness": 1, "user": "Swiss_Springbok", "date": "April 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102957034}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "The service here was excellent and our rooms were cleaned out and the bar re-stocked daily.", "title": "Gorgeous LOCATION, great views, awesome breakfast!", "helpfulness": 1, "user": "MFCNYC", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102607840}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "The suite opened up to the Table Mountain - an awesome sight.There was TVs in both living room and the bedroom. The toilet and shower were spacious. The room had a kitchenette attached which was useful too.", "title": "Stop with the negative reviews!", "helpfulness": 2, "user": "shorechicknj", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101800332}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This is the second time we have stayed here and love it. In Bantry Bay and close to bus stop which is 10 minutes to V&A Waterfont, we used local buses regularly and there are no problems. Hotel is also close to red/blue bus tour bus stop which is handy. We had a room overlooking the pool but I would recommend booking a suite (we had one at time) as there is more space and in room facilities. Staff very helpful, breakfast fab, we also had lunch on last day which was also lovely. Used guest services for tours and this was also good. Bantry Bay is lovely and the hotel allows for some lovely coastal walks. Definitely worth a stay.", "title": "Well worth a stay", "user": "Kerzy", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153577784}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed for 7 nights at the beginning of our holiday and 4 further nights before flying back to the UK. The hotel is in a good location and is within easy driving distance of all tourist attractions. We enjoyed our stay, and the staff were friendly. Our bedrooms were well appointed, and quiet, with good views. There was a good choice at breakfast, and the 'egg lady' cooking the eggs was very helpful, and eggs were cooked to perfection every morning. It was a pity that there was no ramp, only steps to the Buffet area. The pool was a good size, with a good water temperature. It was never too busy in the surrounding pool area. We would return to stay at this hotel again.", "title": "A great place to stay", "helpfulness": 3, "user": "Janet C", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153280377}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Very well situated 10 minutes drive from the Waterfront and a couple of km away from Camps bay, you can even walk to Clifton beach. Pleasant hotel nicely decorated and quite new but it does have a feel of budget hotel. The room was very clean and spacious but I didn't like not having a bath ( just a walking shower), and having a sort of strange kitchen at the entrance of the room with a kitchen sink and a microwave it made me feel like I was in a caravan rather than in a hotel room. The pool was quite nice but the sun beds are the same you get in all Protea hotels which are very uncomfortable, better to go to Clifton beach. I was very disappointed by the gym just a small basement room with only a few weights and static bike not even a running machine. I liked the hotel staff always polite and professional. This hotel is perfect if you are planning to spend most of the time away exploring Cape Town.", "title": "Good value for money, excellent location", "user": "JL24601", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153074080}, {"rating": 4.0, "title": "Prime location, great stay", "text": "Spent 4 nights here with a tour group. It was great. Staff was friendly and helpful. Location is super-one block to the beach, grocery store and laundry nearby. Property is overlooked by Signal Hill and sunsets from the pool area or your room balcony are breathtaking. Easy to get the bus to go to Victoria and Alfred Waterfront. Breakfast buffet was delicious; plenty of variety with an egg/omelette fresh made option. Only had dinner one night and it was just Ok. Dinner buffets are themed around a specific cuisine. Room air conditioner worked great and rooms were nicely sound proofed.", "user": "Globetrottersx2", "date": "February 24, 2013", "id": 152976674}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was our fourth stay at the President in as many years. We do like the hotel and it has many good features but also a lot of niggly things that could be better.", "title": "A nice stay but a few problems.", "helpfulness": 2, "user": "Traveller from UK", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152939805}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 4, "variance": {"poor": 37, "average": 81, "very good": 207, "terrible": 25, "excellent": 98}, "aka": "Protea Hotel Bantry Bay", "slim_ranking": 0.714285714286, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The atmosphere of this magnificent sea-side 4 star hotel in Cape Town’s Bantry Bay area is relaxed, yet professional. For business or leisure there is no better choice of venue. Surrounded by the stunning Lion’s Head Mountain range and Atlantic Ocean, the hotel’s spacious rooms offer all the facilities that one would expect from a world-class hotel. One can enjoy a cocktail in the Senate Bar or a sundowner on the terrace, overlooking the magnificent rim-flow pool to the ocean. Once you have taken in the spectacular view you can let the Islands Restaurant tantalise your taste buds with its sumptuous cuisine. When you are not visiting the famous Clifton Beach, the V&A Waterfront or Table Mountain why not pamper yourself at the Amber Hair Salon, or take in the sites of Cape Town with a tour on the hop-on-hop-off Cape Town Site Seeing Bus. Not only can you purchase these tickets from the Travel Desk but you can also use the bus stop situated right outside the hotel as your starting point. Once you have discovered its remarkable variety of facilities, impeccable service and consummate luxury, you will agree that there really is no better choice of venue than Protea Hotel President, and it’s without a doubt the most eminent Cape Town hotel on the Platinum Mile."}