{"user_rating": 4.0, "review_count": 430, "name": "Providence Marriott Downtown", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "In regards to my title, despite its name, the Providence Marriott is not downtown. It's more like a ten minute walk from downntown. It can be more appropriately named Marriott Providence off the I-95.", "title": "Providence Marriott Downtown-A Little Bit of a Misnomer", "user": "Alden C", "date": "July 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 71888488}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I checked in for a conference that pretty much booked the hotel, so my room wasn't available to me. Luckily, there was free internet in the lobby, so I just pulled out my laptop and did a little bit of work. I was told to check back in at three (at 1:00 p.m.) so my friend and I went out to lunch. While at lunch, I got a call from the hotel that my room was ready.", "title": "I'm looking forward to going home!", "helpfulness": 1, "user": "amckOxford", "date": "July 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 71186767}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The room itself was spacious. It had one of those bathrooms that are two segments: the basin/closet in one segment and the shower/toilet in the other. It was stocked with the usual Marriott amenities, the bath and boydworks ginger and orange aromatherapy line.", "title": "Good overall stay, but we wouldn't do it again...", "user": "ValleyVoyagerMangia", "date": "July 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 70048217}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The king size bed was comfortable and there was a large flatscreen television in the room. There is only free wi-fi in the lobby, so I had to pay for the LAN connection in my room to access (9.99/night).", "title": "Better location than you might think", "helpfulness": 1, "user": "BDfromDC", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 66736518}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "As mentioned earlier, you can get tot he historical center of Providence (state house, river walk) via a ten minute walk crossing an access road to the I-95 onramp. About a half a mile in the other direction is a little strip mall with a Whole Foods, Boston Market and McDonalds.", "title": "Funny how people percieve a nice hotel", "helpfulness": 1, "user": "Panzampa", "date": "May 10, 2010", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 63796046}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Hotel upon arrival was very nice. Had array of employees greet my family. Only to go downhill from there. I called sales to ask for a rate for 30 days or more. I was quoted from 2 different employees that I could have a 129.00 rate and pay nightly. Calls 2 hours later only to inform me that she would not honor the rate that I was quoted before. I informed her we had a verbal contract. Spoke with the Director of Rooms. I thought everything was okay after all I found a cheaper rate on Marriott.com . We stayed 3 days had no maid service found myself wheeling used towels and trash onto a luggage cart to housekeeping. We checked out and went to lunch. Upon coming back to the hotel to cancel my reservation for that night, I was informed that we were banned from the hotel.I asked why?I was told that we damaged our room and my attitude was poor.Which was untrue.We were very courteous and kind to there whole staff.We felt something was not right even to go as far as to video tape our room before we checked out.The Staff was very stand-offish almost like their mistreatment was intentional or being directed by a 3rd party to sabotage or stay.Weird that's how we felt.We were escorted out by a hostile Security Guard and Staff.Why would the Director of rooms create a hostile environment?Slander my Family's name and intentionally inflict emotional distress on my whole family.", "title": "What the Heck.Please stay away travelers", "helpfulness": 7, "user": "apartmentlocator73", "date": "October 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 119022222}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We just stayed there for 2 nights this past weekend. The lobby has been renovated and was nice. Currently, there is free wifi only available in the lobby. The check in was quick. The staff (front desk, concierge, bellboy) was professional. The concierge was helpful with tips on sightseeing, making reservations, and providing printouts of maps. The bowl of apples at the front desk was a nice touch (as well as the water with orange slices-very refreshing).", "title": "Very nice stay at this Marriott", "helpfulness": 2, "user": "syracusenewyork", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118867784}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The room was spacious and clean. We faced the front (street)-you can hear sirens occasionally, but otherwise it was quiet. As a Marriott rewards member I had requested feather pillows-they were soft. The sheets fit well. The a/c worked well but was noisy when it would kick on. The blanket (probably down) was nicely enclosed within sheets (I don't like to touch the blankets-they are rarely washed)-but was very warm. We had to keep the a/c on 65 to be comfortable under the covers.", "title": "Not my favorite Marriott property", "user": "chimera22", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 118842737}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Bathroom: Clean, stocked with toiletries. Towels were adequate-not very soft.", "title": "Okay but some areas need improvement", "user": "travelpatty", "date": "September 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 118666172}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Pool: The weather was warm enough to spend the afternoon lounging by the pool. There is both an indoor component to the pool, then glass doors are open to the outside section of the pool. The pool was quite warm and is open until 11 pm. We saw people swimming outside in the late evening. I noticed an outdoor firepit as well-guests were using it at night. There was a hot tub in the indoor pool area.", "title": "Amazing pool & outdoor space", "user": "beachmamaCt_", "date": "September 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118498084}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "As a Platinum member we got a concierge room. Since it was Brown's family weekend, the hotel opened up the concierge for breakfast. While it was crowded, we were able to sleep well. My only complaint was that we inquired about the shuttle going to downtown Providence and never received a call back. I understand the circumstances of a busy weekend, but that is poor customer service especially from a full service Marriott.", "title": "Good Facility for a Busy Weekend", "helpfulness": 1, "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122709264}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Stayed here in Sept. for a conference, and was not overly impressed. I tend to seek out Marriott because they do not usually disappoint me, but this one was just blah! Staff were not overly friendly, decor is drab. Room is clean and bed nice, but overall smaller than what I am used to from Marriott. Seems like this place is an afterthought! It is not downtown either! You have to risk your life crossing major roads filled with crazy Rhode Island drivers to get to downtown where there are great shops and restaurants. You need a cab to safely get there from here. Felt like I overpaid to be underwhelmed....", "title": "Not what I would expect from a Marriott!", "user": "mary h", "date": "December 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 122240758}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We drove some friends from Cape Cod to the Green airport in RI and we decided to stay over night and watch the Patriots down town Providence. We chose the Marriott for a couple of reasons, it was downtown and it was part of our Marriott Rewards. And one more reason, there was free parking. And one more thing, they drove us to our destination to watch the Pats Game and most important, they picked us up. Noooooo Driving. Awsome!", "title": "Service is not a lost art... Marriott provided service we have not seen in a long time.", "user": "Capecod080", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121997856}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "From the time we walked thru the front doors till we checked out, well, the service was outstanding. Our fist encounter was with Roland on the front desk a recent graduate from Johnston and Wales. We knew after just meeting him for the first time how much he enjoyed working for Marriott and he so was a people person. But he was just the first in a long line of Marriott family we met. Rachael, Estelle and the manager of the courtesy van, (sorry his name slips my memory), all of them showed from their smiles and help that they so enjoyed working at the Down Town Marriott. We both were so impressed with their help and suggestions that we have now booked our New Years Celebration at the Marriott.", "title": "Outstanding!!", "user": "TheFoodLegend", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121702690}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The Marriott should be extremely happy being represented by these employees.", "title": "Good hotel, Convenient location", "user": "FredRNewYork", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121686578}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Clean place, nice staff and a good pool and workout room located right near the G. Salon. We eat at the Bluefinn Grill one night which was a fancy and good restaurant. Location was not 100% downtown, but close enough.", "title": "Nice hotel...", "user": "Llamaman24", "date": "November 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 120504410}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Stayed in this marriott for a fun weekend in providence. This Marriott blew me away and ive stayed in marriotts all over the east coast .Ive been to this particular marriott a couple times. Everytime the stay gets better and better The renovations they made in the lobby are amazing. They made it an excellent area to come sit down and relax you can enjoy a drink or even get a bite to eat all in the lobby. The front desk was very helpful and pleasant. Free wiffi in my room and when i was using my laptop in the resturaunt. My room was so clean and had that smell of freshness to it. Im usually a very picky person when it comes to my rooms. My sheets were fresh the bed was very comfortable. The bathroom was very clean also. I cant wait to come back.", "title": "great marriott hotel great staff", "user": "steven a", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120483101}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Two days on business in any hotel is a long time but I had to spend two weeks in this one and I wouldn't choose anywhere else in Providence. Lets be honest business hotels the world over are kind of the same and in that regard the Marriott is no different. Well laid out, good restaurant, now has wifi across the hotel etc. So its a comfortable and convienant place to stay. But the staff are what make the difference and these guys are great. They did everything they could to make my stay as easy and friendly as possible. From Todd & Pedro on the management team to Doyle, Roland and all the front the desk guys, the shuttle drivers and the lady in the conceirge lounge, nobody could have done more or been more friendly. A really great team and I'm looking forward to seeing them for another long stay in the new year.", "title": "Very good hotel but great staff!!", "user": "deccrv", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120045445}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "As for the rooms they're fine and on the 6th floor very comfortable with good TV and beds. The downtown shuttle is also really useful as is the parking.", "title": "Nice Improvements, Great place to stay in Providence", "helpfulness": 1, "user": "ualsdguy", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119878064}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "If I have any issue after two weeks the chillax piped music in the lobby was getting to me and it would be great if you could just open a window, even a small bit as permanent air-con isn't great. However small concerns for what is a very pleasant and welcoming hotel with a great team.", "title": "Great place to stay in Providence", "user": "JCMass", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119191212}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "the city of providence is fairly empty on a saturday morning. after a long tedious drive on", "title": "lovely quiet and polite-", "user": "hisim", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78157648}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I 95, we were warmly welcomed at the front desk. the parking was free on weekends- a pleasant surprise. the beds were wonderfully soft and the pillows were abundant. nice amenities in the bathroom were special, and 2 bottles of water as well as room coffee and tea were great.", "title": "Extremely pleased with this inner city gem.", "user": "Kathylovesseashells", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77356210}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "we had planned on visiting the risd art museum, but it was closed for august, so we left earlier than planned.", "title": "Pretty bad stay, but good compensation", "user": "yadin", "date": "August 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 73878449}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had a gift certificate for the Capital Grill and planned to make a special night with dinner and Fire Water activities along the canal. The Mariott Downtown was a great location for us. We arrived about 11 a.m. - usually too early to check-in, however, our room was ready and we were able to get setttled in. Receptionist was very pleasant and professional. We also booked the courtesy shuttle for a ride to the restaurant - only 5 min. The driver was very nice in making sure we knew how to walk from the restaurant to the canal and offered us his card to call for a pick-up later that night. Since it was such a beautiful night we walked back. It was good that we booked this early. We love to walk when we visit a city we don't know well. We were able to walk (about 20 min.) to the huge shopping mall. There was a beautiful indoor/outdoor pool that unfortunately we didn't have time to use. Our room was tastefully decorated and very comfortable and quite. We travel quite a bit and appreciate a good mattress and nice bedding when away from home. If we have an opportunity to go back to Providence we will stay at the Marriott Downtown again.", "title": "Nice rooms, not downtown", "user": "TravelCuties", "date": "August 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 73323670}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Well this hotel, as other reviewers have said, is not exaclty downtown but it is a nice stroll to downtown so that didn't bother us. The lobby area looks worn out- crumpled pillows, stains on the walls, no flowers or plants to freshen it up... The elevators in our tower (B) smelled pretty bad- they could use some air freshener. The hallways are old and probably haven't been renovated since the hotel opened. The room was recently renovated in the generic marriott style which was absolutely fine. We had a nice view towards the capitol. The pools were great, although there was a wedding reception on the patio both nights we stayed which made it slightly uncomfortable. The concierge was very helpful.", "title": "Mid level quality--high level price", "helpfulness": 2, "user": "tajgood", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 72089081}, {"rating": 5.0, "title": "Awesome Stay", "text": "From the time we arrived to the time we left the staff was absolutely perfect! They were quick and couteous while checking in and checking out; almost to polite; I wasn't used to that. The room was very clean and everything worked; not like some hotels where you have to call to fix something and then you wait for an hour or two. We used the shuttle service to take us out to a restaurant that night and he was also prompt and courteous; we then called him for a pickup and transportation back to the hotel and he was there within the time specified ........Hats off for a job well done", "user": "Miken1963", "date": "February 19, 2010", "id": 56516049}, {"rating": 4.0, "title": "New Year's Eve...not bad", "text": "A very solid Marriott property. The rooms were clean. The bar was nice. While we didn't use it, the indoor pool was nice. There was plenty of parking. The business center was convenient. Not having to valet the car was a plus. My only complaint is that it is a bid of walk to anyway. 2 miles to Downtown Providence or the East Side. The staff was friendly and great. A very good stay.", "user": "travelin'soldier", "date": "January 1, 2010", "id": 52319275}, {"rating": 4.0, "title": "Friendly staff, comfortable beds, but don't choose it for the indoor pool/jacuzzi", "text": "My husband and I along with our two teenage boys chose to stay overnight in Providence for New Year's Eve. We reserved 2 rooms. We were looking forward to a great dinner in town and relaxing by the pool. I chose this particular Marriott because of its amenities of an indoor pool & jacuzzi. The outdoor pool looks great and there are photos of it on the website. There are no photos of the indoor pool. The indoor pool is small, not a deep pool (max. 5 feet). The jacuzzi was the smallest I've ever seen at a hotel, and the water was not hot -- cooler than bath water. I did complain to a staff member about the temperature and she called maintenance, but we never used the pool or hot tub again during our stay. We had lunch at the on-site restaurant and the food was good. I ordered a drink on the menu, but they were out of the ingredients to make it. I then ordered a margarita and it was not good - tasted like they used a sour mix you buy at the grocery store. The rooms were not large, but the beds were very comfortable and the flat-screen TV was great. Overall we had a mixed experience.", "user": "tyconmom", "date": "January 1, 2010", "id": 52313832}, {"rating": 5.0, "title": "Exceeded our expectations!", "text": "We stayed at the Marriott for 2 nights for my wife's 50th birthday, starting 12/27/09. This is an annual post-christmas getaway for her birthday, just the 2 of us, to relax and do fun things. We had considered the Westin, Hotel Providence, and Biltmore in Providence and the Langham and Fairmont in Boston before settling on the recently renovated Marriott in downtown Providence. We were very happy with our choice. It is not really within walking distance to shops, restaurants, etc, at least not in the winter, but it has free parking and a shuttle that will take you to various locations in Providence. All of the other hotels mentioned charge at least 30.00 a night to park. I had told the hotel that it was my wife's birthday so they upgraded us to the concierge level, which gave us access to the lounge there with an excellent breakfast, cocktail hour, and dessert bar. The hotel also surprised us with a nice cheese and fruit platter, with wine and 2 beers, and a nice birthday card. I can't say enough about the friendliness of the staff. They were all excellent. The facility was obviously renovated recently, and the room had a flat screen TV, mini fridge, and extremely comfortable bed. The bathroom was small but the shower was very strong with Bath and Body Works aromatherapy shampoo. The indoor pool area was very comfortable. In the warmer weather it is connected to the outdoor pool and that area looks like it will be beautiful when it is open. The room service menu was relatively reasonable and the chicken marsala dish I ordered was excellent. I would wholeheartedly recommend this hotel. We look forward to returning in the warmer weather.", "user": "nottnott", "date": "January 1, 2010", "id": 52294129}, {"rating": 5.0, "title": "Excellent Customer Service", "text": "I've stayed at many a Marriott property for business and leisure travel. The staff at the Providence Marriott is one of the best I've come across. Each person at the front desk greets you and answers questions with genuine delight.", "user": "mmcgui02", "date": "December 21, 2009", "id": 51628864}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I'm a little delayed in writing a recommendation - but here goes. We stayed at the Downtown Providence Marriott location when I ran the inagural Rock and Roll half marathon in August 2011. We were VERY warmly welcomed by the doorman who couldn't do enough for us. If ever I met a doorman who enjoyed his job as much as he did meeting new people and ensuring their comfort in their stay - he was it. Even my 8 and 10 year old kids recognized how helpful he was and acknowledged it. Our room was located w/ a pool view. The room was very comfortable and provided us what we needed during our stay from modern amenties which was kept very meticulous. My kids enjoyed the indoor/outdoor pool and mom/dad enjoyed sitting poolside enjoying the contemporary poolside decor. If the hotel didn't have 'downtown' in it's name, you would truly feel you are in a serene getaway with mood lighting, live music and an outdoor tiki bar. On race day, unfortunately the rain came and I was not prepared accordingly with appropriate cover up until race time. An alternative is using trash bags to keep you dry while you wait. I had asked the front desk for a trash bag and she brought the largest trash bag you could find where my entire body was nearly covered and kept dry until the race started. Even funnier was when I went up to my room and came down a few moments later and noticed 50+ runners all in the same plastic attire. This hotel looks out for their guests and truly was a hospitable place to stay. We would definately stay here again!", "title": "Convenience & Hospitality", "user": "IslandGirl713", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121471927}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Just stayed here for three nights with my wife and three kids - this is one of the few hotels that willingly will book a room for five. Had a nice stay. There is plenty of free parking, wifi is free in rooms, lots of free papers (USA, WSJ and Providence paper), the gym is decently sized and equipped and the indoor pool is actually one of the better indoor pools I have been to. Our rate was also pretty great at only $99 a night. Tremendous value. The hotel is even pet friendly, we took out dog for a one-time (not per night) clean-up fee of $49. That part went only ok. The first night while fifteen minutes away at a family dinner of 17 at a Cranston restaurant I was called back by cell \"for numerous complaints from guests of a barking dog in my room\". Well of course, when I got there our dog was totally quiet. Probably our own fault for not acclimating our dog more to the hotel before ditching her for dinner out. Would definitely stay here again and recommend to others. Downsides - bathroom is pretty small.", "title": "Nice Option in Providence", "user": "Circusboyny", "date": "November 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121220536}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Just spent another week at this Marriot. We stay here whenever we go to visit family in Rhode Island. Thanksgiving week was a little slow at the hotel, but picked up on Friday after the holiday. The room was great, with comfy beds. The wake up call was on time. The free wi-fi was appreciated! I used the free hotel van shuttle to go downtown one night to see a play and it was a great perk. Free parking too! Refrigerator in room was also nice. We stayed on the concierge level and enjoyed access to the free snack and water every day. Can't say enough about this place. They recently remodeled the lobby and now have several areas to sit and chat with large tables to put things on, instead of just sofas and coffee tables. Had breakfast in the restaurant one day which was also quite good. You can read my past reveiws for more info.", "title": "Repeat visit - updated lobby is quite nice", "user": "Laura99", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121138178}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The Providence Marriott Downtown has won our endorsement when we visit our son at Brown University. It's a typical Marriott and is much improved since a recent (2011) upgrade. Parking is free though internet is not free. With so many great dining options in Providence, we avoid the on site restaurant. On the half dozen occassions we've stayed there, rooms were super clean, staff very nice, check in fast. There's a Whole Foods less than a mile away. It is very close to Brown and RISD. In addition to being convenient to the schools, it's also just off of Interstate 95. Be sure to book early and/or use points/corporate rates to avoid the relatively high list price.", "title": "Great location for visiting colleges", "user": "sgerlak", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120573184}, {"rating": 3.0, "title": "Horrible location, dated facilities.", "text": "I stayed here for a week and couldn't have been more disappointed. Guest rooms could use a major overhaul and these were the club rooms.", "user": "dba80", "date": "November 12, 2011", "id": 120512717}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "This hotel was everything and more. The staff was very helpful. My kids had never stayed at a Marriott and were very impressed. Their favorite hotel of all time. The location isn't right next to everything but the staff will take anywhere downtown and pick you up.", "title": "Great staff and atmosphere", "helpfulness": 1, "user": "jodi1965", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63193148}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "The service was excellent, we received great service from the time we arrived at the hotel, from doorman to the waitresses. Everyone was FRiendly and helpful. The room was renovated, it was clean, clean and beautiful. The location was downtown so it was close to everything. Free parking.", "title": "Excellent Hotel and Staff", "user": "birthdaygirl89", "date": "April 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60638719}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The service in the bar and resturant was great and the food was unbelievable. They also have a buffet breakfast which was fresh and inviting. I can't say enough good things about this hotel. I read some negative reviews, these had to have been old reviews and before the renovation. This place is a well kept secret and it is was excellent.", "title": "Great Place!!! Staff is wonderful!", "user": "sugboog", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60290423}, {"rating": 2.0, "stay_parameters": "Stayed March 2010", "text": "I would highly recommend the Marriott for anyone heading to Providence! The staff is wonderful, I've never seen so many folks happy about their jobs!!", "title": "Very loud right next to interstate.", "helpfulness": 1, "user": "aimebo", "date": "March 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 1.0, "rooms": 3.0}, "id": 59406079}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The breakfast buffet in the restaurant is fabulous! If you go away hungry there is something wrong.", "title": "Oooo Laaaa laaaa......", "helpfulness": 1, "user": "kjohnsonri1", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57543331}], "location": {"country": "United States", "city": "Providence"}, "stars": 3.5, "variance": {"poor": 21, "average": 77, "very good": 150, "terrible": 10, "excellent": 172}, "aka": "Providence Marriott Downtown Hotel Providence", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Resort-style atmosphere hotel located in downtown Providence. Situated near the state capital and I-95. Free parking, connected indoor/outdoor pools. Outdoor lounge, AQUA(seasonal), voted best outdoor lounge in Rhode Island - see web site. Award-winning Bluefin Grille open for breakfast, lunch and dinner. Inclusive overnight packages available for special occasions - Twin River Casino Package, Ultimate Dining Experience, Family Movie Night, Romance package, Golf Challenge , etc Full-service G Salon & Spa and golf privileges at private golf course. Completely renovated lobby - New Marriott Greatroom - and all new meeting space and ballrooms. Complimentary wireless and shuttle service (by reservation)."}