{"user_rating": 4.5, "review_count": 454, "name": "Puerta de Las Granadas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I booked this hotel because of the good reviews on Tripdvisor. My partner and I were not disappointed, the hotel lived up to all the good reviews (like the great service at receiption and the position) and even to the bad ones. the only bad thing being the size of the room - it was very small as was the bathroom but we expected this from the reviews and as we spent our time out and about in beautiful Granada it didn't really matter too much although we did stay for 7 nights and a little more room would have been good. The staff at reception were absolutely wonderful and spoke English fluently. We came to depend on them for assistance because we found that in Granada (as in Madrid) not many people spoke English and there was also a decided lack of printed information for tourists. Even the tourist office were very unhelpful, unlike the wonderful staff at this beautiful little hotel, the hotel actually had more printed information in English than the tourist office! As we had been travelling for 10 days or so and the weather was unexpectedly cold and wet our few warm clothes were desperately in need of a wash. When I asked for directions to the nearest laundromat I was told that the hotel would do the washing for us at no extra charge - amazing. Of course we left a tip for this service. Also one night we came back to our hotel after a particularly long cold and wet day to find a beautiful tray with on our bed with fresh fruit and and a bottle of wine and 2 wine glasses, but great things like that happen to Aussies when we travel because usually we are friendly and undemanding and undemanding. Our friendliness was returned 100 fold at Puerta de Las Grandas!", "title": "Puerta de Las Granadas - made our stay all the grander in Granada!", "helpfulness": 1, "user": "SuzieBSydney", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 30976047}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We arrived somewhat late at night but were welcomed and given a thorough briefing about the hotel, the area around, what to do etc. It is very well situated for the Alhambra and the main parts of town. Although the rooms are small, so is the price and do you really go to a town to stay in your hotel room? Check out was 12 noon and we were able to leave our bags there and also use the facilities before we left town. It really is a great hotel, one of the best and most welcoming we have stayed in.", "title": "Great Hotel - really pleased we chose it", "helpfulness": 1, "user": "PaulHarvey", "date": "May 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29999938}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We were only there for 2 nights, anymore and the room would have been too small. However, we were there to see the Alhambra and this hotel is right on it's door step. Close to restaurants, tapas bars etc but away from the noise as well. Would highly recommend for a quick weekend get away to see Alhambra. The receptionist spoke perfect English and had some great recommendations on where to eat.", "title": "Small but great location", "user": "JPCEssex", "date": "May 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29915310}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Great location - just off the busy Plaza Neuva yet really quiet! Has good amenities - free coffee/tea all day and a nice sunny courtyard where you can bring your own food. Rooms, yes, they're small, but fine. Both receptionists spoke fluent English and were extremely helpful and friendly, really good. One helped us out when we were stuck getting a cab to the airport on our way back as the roads were shut for various Holy Week parades and she really went out of her way to help us. One tiny suggestion for improvement though - they should warn you, on checkout, about how long it takes to get a cab to the airport during Holy Week!!!", "title": "good central yet quiet location, excellent staff", "user": "andalucia2", "date": "April 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 28201574}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I'm finding it hard to critique hotels in Spain because so far, all of our experiences have been wonderful except for the beds. With Puerta de Las Granadas, you couldn't ask for a nicer looking hotel from the inside and out. The front desk staff has been most hospitable and speaks fluent English. There is a breakfast buffet, but we didn't think it was worth the cost. The rooms were tiny and showing some signs of wear, yet were clean overall. NO ROOMS HAVE ONE BIG BED! If you're planning a romantic trip, be prepared to push two tiny beds together, or get ready for marriage summer camp. We did not know this going into the booking.", "title": "An amazing little gem, but very uncomfortable beds", "user": "grlantrn13", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 27683628}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My husband and I travelled to Andalucia for the first time. We arrived in Granada, stayed for a day, they travelled to Cordoba for 5 days. Finally, a few days before our flight back to the UK, we returned to Granada for the Alhambra and souvenirs. All I can say is that this hotel was like a breath of fresh air after 5 days in a snobbish, top end 4 star in Cordoba. We realise where relaxation comes from, not from fancy rooms and marble bathrooms, but from cordial staff, cleaniness, and proximity to tourist attractions. Yes, the sizes of the rooms here are a quarter of those in Cordoba, but we welcome the ´coziness´ of them. Also the free internet and unlimited tea and coffee are simple basics that are priceless when you have spent the whole day outside. The last thing we want to do, but HAD to do in cordoba was search for a nice cup of ENGLISH tea after a day of sightseeing ( we had to settle for McDonalds in Cordoba!) Yes, travelling should open us up to new cultural experiences like funky mint tea, but sometimes the norm is good as well!", "title": "Great location, genuinely caring staff!", "user": "Khudija_Hussain", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48762527}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Finally, the staff here were very helpful as soon as we walked through the door. The lady booked our tickets to Alhambra plus suggested a few other activities. And she spoke perfect English.", "title": "Would stay again, but check other rooms", "helpfulness": 1, "user": "ozzyh", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 48751858}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Oh, one last thing, the hotel is literally metres from Plaza Nueva, which is full of great shops and eateries.", "title": "Perfect location, great rooms", "user": "julie248", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46774073}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed here for four days in October. Location is perfect at the intersection of the albaycin old quarter, the route up to the alhambra, and main city. Staff was extremely helpful and attentive and gave us some great tips about places to eat and see in the area. Great value for the money, especially since we are from the US and the euro exchange rate is hefty right now. My only downside is that our room (which was the cheapest we could find in the hotel at this time of year of low season at 60ish euros) was on the smallish side (like about a 100 sq ft-ish) which is just enough size for two people but if you're going to be spending most of your time outside visiting the area and only sleeping in the room shouldn't be a problem.", "title": "Modern Hotel, Excellent Location.", "helpfulness": 1, "user": "clee1402", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46573172}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "A quick side note about Granada, I heard from a few people that it is one of the the cheapest city in Spain(which my spouse said was also true based on the souvenirs she looked at in various cities) so I would stock up here if i were you!", "title": "Great service, good location, wonderful views from top floor", "user": "carped", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46264830}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Just a short walk (uphill) from the Alhambra. The staff was kind and helpful. They arranged tickets for Alhambra for us before we got to Granada. They also told us which areas were tourist traps and which were more local. The room was clean but very small. Smallest bathroom I've ever seen in my life, but pleasant nonetheless. Free internet.", "title": "Perfectly located!", "user": "JB0", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53142999}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "You walk out the front door of hotel, turn right, and continue on the same street up a hill, past only a block or two of commercial establishments, before you encounter the perimeter of the Alhambra grounds, from which it's about a 15-minute walk to the visitors' entrance. The front desk staff speak excellent English and are surpassingly helpful (especially the excellent Alexandra). They will likely volunteer to arrange your Alhambra tickets in advance and can also explain where to leave your rental car rather than venture into the old quarter of Granada with it. (There is no parking right at the hotel.) There are generally two computers to use in a lounge area for free internet access (and the most blazing WiFi speeds we encountered anywhere in Spain), but one of the desktops was absent/broken when we were there. The rooms are okay but not a place you want to spend a lot of time - everything is clean but very simple, and the pillows are none too cushy. The breakfast (not included - about 8 or 9 euros/person when we were there) is a bit perfunctory - coffee simmering on a hot plate, some decidedly industrial pastries, some cheese, ham, and fruit, and yogurt and plain-ish cereal. It would take some work and tolerance to really fuel up for a good part of the day with that spread, but it is certainly an acceptable way to grab a quick bite. Despite the limitations of the rooms and breakfast, I would recommend this to anyone not looking for a four-star experience but wanting proximity to the Alhambra, a decent room, and helpful staff. (The four-bullet rating here is NOT intended to be parallel to a four-star rating; this is more like a two-star hotel except for the excellent front desk folks.) No doorman, and a very tiny elevator that three humans or suitcases can ride in at once.", "title": "Terrific location, terrific staff, budget-quality rooms and breakfast", "user": "jujusticks", "date": "January 10, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53142505}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "My mom and I stayed at the Puerta de las Granadas for one night on our 10 day trip through Spain. This was an excellent hotel at an extremely good value. I was a little nervous about the room size based on previous reviews (seeing as I was booking the cheapest room). However, upon arrival, we were up-graded to a more expensive double room, which turned out to be a pretty decent size. The room and bathroom were very clean and comfortable. The location was perfect right off of Plaza Nuevo. Also, i found it very quite and did not have any problems with noise. We were just a 20 minute walk to the Alhambra entrance and a 10 min walk to the Albayzin. Also located right around the corner are some excellent restaurants and shops. The staff was extremely helpful in giving us advice on where to go. They even booked us a fantastic Flamenco show in the caves for us. Everyone we dealt with spoke excellent english. They even had 2 computers with free internet for guests to use. I would definitely recommend staying here and for the location and service the price cannot be beat.", "title": "Excellent location and Staff!", "user": "neverstoptraveling01", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51116495}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This was an excellent hotel and I cant fault it. In November, prices are much lower, so we got a lovely double en-suite for €54. Rooms are a little small, but thats not an issue. They are spotless, bright and very comfortable. The shower was amazing!!! We stayed in room 305.", "title": "Great Hotel, Perfect Location!", "user": "AlanMerrins", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50323043}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The hotel also offers free WIFI which is great, and it will help with parking - they have agreements with some of the public car parks which allows you to park at discounted rates. Also they provide a buffet-style breakfast for an addtional cast (something like €7).", "title": "A fantastic gem of a hotel", "user": "MAR-AM-UK", "date": "November 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50276873}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We chose this hotel based upon the great reviews that we read. The only negative reviews we saw were regarding the size of the rooms. We expected the room to be minuscule but was pleasantly surprised. The room was definitely on the smaller side but was not nearly as small as we expected. Although this was the least fancy hotel we stayed in during our trip to Spain, it was the only hotel with free internet and complimentary coffee and tea. For us, the hotel's highlight was their staff. The staff was excellent and went above and beyond in terms of their service. I exchanged numerous emails with them in advance of our stay. They were incredibly helpful in making suggestions and answering my numerous questions. They booked our Alhambra tickets in advance. We will definitely stay there again when we go back to Granada.", "title": "Excellent staff and wonderful location", "helpfulness": 1, "user": "PAJules", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40039815}, {"rating": 5.0, "title": "Small but excellent", "text": "Rarely do you receive such attention when you stay at any budget hotel but Puerta de Las Granadas should be the new model for all. The vibe is definitley more high end hostel then hotel. Well before we arrived we had exchanged multiple emails with the booking staff and got extensive directions, tickets for sightseeing and other useful tips. Our room was tiny (remember when all hotels in Europe were like spacious closets) and we had two double beds, but it was very new, modern and immaculate. There's access to computer terminals for internet access and a lovely deck for all its patrons if you want to sit outside with a glass of wine or a bite (byob). It's directly at the bottom of the Alambra and close to all else.", "helpfulness": 2, "user": "ArtieBklyn", "date": "September 6, 2009", "id": 39924017}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If we were judging the experience solely on the room, our rating would not be as high. The room was fine, clean, but small. Nothing fancy. And just outside of our room was an outdoor hotel patio where some other guests chatted until late night, so one night it was hard to get sleep.", "title": "Small but super-convenient with great staff", "helpfulness": 1, "user": "naranja23", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 38578047}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "But overall we had a great stay here. Decent price (not spectacular, but the location was just terrific) and no hassle whatsoever. The receptionists were terrific and helped with everything. They spoke English well and helped us with arrangements and questions of all sorts. The short walk up to the Alhambra made it easy for us to visit the grounds 3 times in two days, although other travellers may prefer taking the bus.", "title": "Perfect: friendly, clean, great location", "user": "Hobskis", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38130947}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "FYI, there is a fantastic sweet shop (cakes, pastries, cookies) in the Albaicin - just go up the main hill with all the Moroccan shops and you'll see it on your left after 2-3 blocks. And the Alhambra is simply breathtaking, so you can't go wrong there.", "title": "Excellent Location", "user": "dongola", "date": "June 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 33434783}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 1, "variance": {"poor": 11, "average": 36, "very good": 172, "terrible": 6, "excellent": 229}, "aka": "Puerta De Las Granadas Hotel Granada", "slim_ranking": 0.0687022900763, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The hotel is situated in a building that dates from the 1800s, charming and small, this \"typical\" hotel of 14 rooms has been fully renovated for use as a hotel since 2004. While conserving the architecture from its past, the hotel is equipped with a modern and functional in keeping with todays standards. Magnificently situated on Cuesta de Gomerez, beside the Puerta de las Granadas from where you can access the Alhambra. The hotel is situated in the centre of the triangle formed by the Alhambra., Albayzin and the Cathedral.With maximum comfort, the hotel offers the travelers a stay right in the historical centre of Granada, a short walk from all the most emblematic monuments and most traditional as well as modern areas of the city. Everything you need to know about granada is a short step away, The Alhambra, Albayzin, the Cathedral, museums, restaurants, festivals, tapas....We invite you to enjoy the city and its while resting in our centrally located hotel."}