{"user_rating": 4.5, "review_count": 396, "name": "Pullman Toulouse Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Very pleasant staff, multilingual and knowledgeable of the city. Restaurant is good french cuisine but a little expensive, but many very reasonable eateries in walking distance, also a very lively city, rooms were clean, no bath only shower and TV technology was old, had to wait 30 seconds for a picture to come on, I know it sounds picky but in this age of technology that is a long time.", "title": "Nice boutique hotel", "user": "Brendan G", "date": "April 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158647121}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I've stayed at the Pullman Toulouse Centre Hotel for 8 nights, for business. The location was convenient, very close to city center, easily accessible from the airport by taxi (20 minutes ride). The hotel offers an excellent overall quality, spacious rooms and a remarkably good restaurant on the ground floor. The room itself is as good as I've expected, spacious enough, with a king-sized bed, comes a fairly large bathroom with shower (you can choose one with a bathtub during check-in if you need one). Well equipped, with coffee maker, two bottles of mineral water/day and some juices included in the room rate, large flat-screen TV, free WiFi internet connection. The bathroom was standard for this category, to be honest I would have also expected toothbrush / toothpaste to be available, but it is not the case, although you can request these if needed. One small disappointment for me was to learn that there is no swimming pool (for this price level I would have expected that). There is a gym which is open 24 hours (I wish all hotel managers would understand that it is not OK to close the gym before I get back from the office sometimes, so big plus for the Pullman staff for this one).", "title": "Very good business hotel", "user": "peter_kovacs", "date": "April 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158399868}, {"rating": 4.0, "title": "Good business hotel", "text": "The restaurant is a really good one. The food quality is brilliant, they pay much attention not only to the quality, but also to the presentation. Strongly recommended to try it at least once, but make sure you have time for it. For us the main downside was that they usually need too much time for serving the food. We've had a really tight schedule, so in some evenings we've decided to eat outside the hotel to speed things up, but when we had sufficient time, we've always enjoyed the food.", "helpfulness": 1, "user": "YTee C", "date": "April 15, 2013", "id": 157857989}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We've intensively used their business facilities as well, booking most of their conference rooms for the entire week. These have standard equipment, like large flat-screen TV sets, flip-charts, etc. We've had coffee and tea making facilities, snacks and refreshments available all day long. One thing which needs improvement is the availability of the large cups (for tea or cappuccino), as well as the milk for the coffee. We usually had to ask for these, and then they've provided them immediately.", "title": "An oasis of refinement", "helpfulness": 1, "user": "Ariellemiz", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157252566}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Overall my impression was positive, I would definitely use the same hotel for business purposes next time when I'm in Toulouse. Cannot compare with other local hotels (as it was my first trip to Toulouse), but compared to international standards the hotel provides a good value.", "title": "Trully the best place to stay at in Toulouse", "helpfulness": 1, "user": "Marek B", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153437499}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "You know when you have been on the holiday road for so long that you just wished you had a room were you do not want to leave. WELL THIS IS IT!!!", "title": "Soooo Good", "user": "RogerSkitt", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161920656}, {"rating": 4.0, "title": "Nice-great toiletries!", "text": "The service desk has been fantastic, the bed is to die for along with the decor, lighting, shower.", "user": "HellsBells055", "date": "May 26, 2013", "id": 161888521}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Complimentary Nesspreso coffee machine, juice, and bottled water. The breakfast is also of very high standard. Shame we have to move on.", "title": "a hidden surprise in Toulouse", "user": "SakisSymeonidis", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161628478}, {"rating": 5.0, "title": "Outstanding servce", "text": "This is a nice hotel and better than average for a French hotel. The room service menu is a bit strange and even though I was hungry I struggled to ind anything I fancied. The house is very limited. I chose the duck burger in the end. It was quite nice but a bit strange. The bathrooms are lovely but the shower is a rain shower (nightmare for women not wanting to wash their hair!). The toiletries, robes etc are a lovely touch. The hotel is very, very clean and staff are friendly.", "user": "mikey777icc", "date": "May 1, 2013", "id": 159322354}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Approaching Pullman Hotel in the centre of Toulouse, you see ,a common for Toulouse, building covered by that red bricks giving that characteristic colour to the city. Stepping into the lounge you are surprised by the minimal simple and modern style it is decorated. The surprise is rapidly completed by the warm and freindly staff at the reception. You meet a smiling 'old' freind who makes you feel at home from the very first moment. Concerning the room, they are spacy, confortable, very well equipped.", "title": "Very nice hotel let down by poor service", "user": "Kristjan A", "date": "April 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158760108}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The location is centric, not so good for a road trip, but the property overall is fine with a style you either love or hate, difficult to descibe but modern snazz trying to be cool. Not my taste. But they did the job, valet parking (at a price), free low speed wifi which annoyingly you keep having to log into, clean rooms (passed my mould around the shower test), comfy beds. We ate in the hotel restaurant, in France you cannot go wrong on the wines and I was surprised how good the chicken casserole was. So why average? Because they did what you'd expect for the price. No more, no less. Average.", "title": "No surprises, an adequate & average hotel experience", "user": "jeremyfd", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 163836272}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Front desk staff were welcoming and helpful. The room was lovely, new, clean, and modern. We enjoyed a drink in the lobby bar, served by a very nice young bartender. The breakfast (included) was quite lavish -- large selection of croissants, French breakfast pastries, bread, etc plus yogurt, fruit, cereal, eggs, bacon, sausage, ham, cheese, juices, coffee -- all served buffet style in the hotel restaurant. The free mineral water, soft drinks and juices in the room are a lovely touch. The location is perfect. We had a wonderful stay at the Pullman and highly recommend it!", "title": "Wonderful experience", "user": "L_CLE", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163264022}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I was recently in France for a vacation. I started in Toulouse for a two-day stay, and to meet up with friends. The Pullman Toulouse Centre was in a very convenient location and was easy to get to from the airport for 5 euros on the Airport Shuttle. The hotel staff was very friendly and helpful when looking for places and services in Toulouse. Booking and paying in advance was just 125 euros per night.", "title": "Toulouse Visit", "user": "FrankyXYZ", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162784126}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Overall, the hotel was a modern city hotel that was well maintained - both the building and the rooms. The only comment I could offer is that the lighting in the bathroom could be a bit brighter for my tastes. Tasks such as shaving involved more feel vs. sight. Pretty minor, though. Housekeeping was nicely done.", "title": "Classy, elegant, pleasurable experience", "user": "270766", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162090978}, {"rating": 5.0, "title": "Thank you Mr Pullman.", "text": "Finally, I would definitely stay at the Pullman again.", "user": "Ang1965", "date": "May 26, 2013", "id": 161920874}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The Pullman is a very classy business hotel, but our room had some minor problems that might be indicative of poor maintenance. We pointed out some problems shortly after our arrival and they were addressed immediately. The couette (heavy quilt encased in a sheet-bag) was changed for us to a top sheet and couverture (light-weight blanket). But the floor lamp bulb blew out after a few minutes -- the maintenance man tried to change the bulb twice and it wouldn’t work. The bathroom door squeaked terribly noisily. The bathroom sink drain was not draining -- after a Drano-type product it improved slightly and gurgled.", "title": "Classy, but needs a bit of work", "user": "Chandolin", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167239316}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We had a very good dinner at the hotel on our second night. And the reason they only offer pricey valet parking is that their garage is difficult to drive and park in -- a maze!", "title": "Very good, professional hotel – helpful staff.", "user": "lawmargo", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165918873}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed at the Pullman at the start and the end of our cycling tour.", "title": "Great location", "helpfulness": 1, "user": "BrightonBelle_10", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165764998}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "They kindly kept our bike bags and suitcase safely until our return which was useful.", "title": "Great Time!", "user": "HONdominik", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165609000}], "location": {"country": "France", "region": "Midi-Pyrenees", "continent": "Europe"}, "stars": 5, "variance": {"poor": 7, "average": 19, "very good": 132, "terrible": 4, "excellent": 234}, "aka": "Pullman Toulouse Centre Hotel Toulouse", "slim_ranking": 0.00719424460432, "description": "The Sofitel Toulouse Centre is located in the heart of Toulouse, near the Place Wilson, the Matabiau SNCF train station and just 15 minutes from the airport. The central location is ideal for both business and leisure travel. In between excursions and business meetings, you can savor the world's specialties at the SWCafé restaurant and relax over a drink at the SW Lounge bar."}