{"user_rating": 4.0, "review_count": 473, "name": "Pullman Palm Cove Sea Temple Resort & Spa", "reviews": [{"rating": 1.0, "title": "Certainly not a 5 star !", "text": "Sea Temple claims to be oh so special, luxurious and 5 star. It is an OK resort but certainly not a stylish one. Staff were unhappy, unenthused and uninterested and certainly not busy when I stayed there. I booked one night to check out the place and was intending to stay longer if it was good, but i was glad to be only spending one night at the place. They think they are luxury but just don't get it, the fittings, furniture etc are like a \"fake\" Gucci handbag - just not the real thing, and the very inflated room prices are a scam !! Does a true five star hotel have no stock (at all !) for their mini bars (no wine, beer, choclate etc) ?,does a true five star have more exposed wires in the room than a telephone exchange ? does a true five star have cheap awnings between balconys that allow you to see into next door room ? Gym - whats that ? Very tatty hotel guide in the room. Hard Bed. Valet Parking - park it ya-self mate ! Very basic menu. No desert at all. Very noisy room fans. Lots of screaming kids. Very non-soundproof walls.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3459202}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "Well the Sea temple is gorgeous to look at and the 3 bed appartment was spacious and beautiful. Sadly the service was not up to standard. In particular the house keeping was appalling with 3 sewing needles found in our carpet. Dinner was okay although the menu was a little limited and the service very slow. The front desk staff were great and gave good advice on trips to take. Overall I would go back but mainly for the spacious room at a reasonable price than any other reason.", "title": "Looked good", "helpfulness": 8, "user": "sjwoolnough", "date": "August 20, 2005", "detail_rating": {"cleanliness": 1.0, "value": 4.0, "rooms": 5.0, "service": 2.0}, "id": 3791493}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We just returned from 6 wonderful nights at the Sea Temple.Our 3 bedroom apartment was spacious,very stylish and impeccably clean.The ensuite from tne master bedroom was the nicest we have ever had in any property and we have enjoyed many 5 star hotels around the world.Huge spa bath,split vanity,seperate shower and loads of room.", "title": "Superb Sea Temple", "helpfulness": 9, "user": "Shooshy", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3664335}, {"rating": 5.0, "title": "Best place in Palm Cove or should I say North Queensland", "text": "Pools were very nice but a bit cold!The beach was glorious and the resort is very happy to set up loungers for you right on the beach.We enjoyed the cocktail/lunch service around the pool.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "June 23, 2005", "id": 3607240}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "We have recently stayed at the Sea Temple and found it a wonderful experience. We had a roof top apartment with spa and bbq and made full use fo all the facilities. Although it was the holidays the abundance of children ddn't spoil the service or attention we received. The apartment had all mod cons and everythig you could want in terms of facilities. Spacious and luxurious finishings. THe staff were attentive and when we had delays in our food being delivered (which didn't seem much to us)we had a lot of apologies and complimentary drinks. Would love to go here again - for a 30th celebration it was superb.", "title": "Absolutely fantastic", "helpfulness": 7, "user": "billybean", "date": "February 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4446316}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We recently discovered Palm Cove during our stay at Cairns. We fell in love with the resort and found the Sea Temple by chance. What luck! We only wish we could have stayed longer than we did. The fantastic beach is only metres from the hotel pool and sundeck area. The whole ambience of the place is geared towards relaxation. A short 15 minute walk to the main restaraunt area will give you a bigger selection of food that the Sea Temple.", "title": "Sea of Tranquility", "helpfulness": 3, "user": "happybagger", "date": "December 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 4159635}, {"rating": 5.0, "title": "loving it", "text": "Have recently returned from the sea temple, we had a one bedroom penthouse apartment, with jacuzzi and barbeque on the roof, it was an amazing apartment, the appliances were all in good working order, it was so good to have a washing machine and tumble dryer, we found the staff to be very helpful and polite, we stayed for 6 nights and the reception staff greeted us by name, we only ate in the hotel once which was a really good meal, we booked the tours through the hotel with ease. The swimming pool was very relaxing although it was difficult to find sun loungers. This is a very good place to stay if you do not want to be right in the middle of palm cove as it is quite secluded and has access onto the beach. We really enjoyed our stay and will come here again.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 4, 2005", "id": 4086246}, {"rating": 2.0, "title": "5 star build but 2 star services", "text": "We stayed here as part of an annual company trip. Although the looks, furniture and buildings are great, the service & staff are way below the standard.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4052779}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "After reading a few negative reports after I had booked a 2 bed penthouse at sea temple i arrive feeling a little nervous.", "title": "Suited us to a t...", "helpfulness": 8, "user": "GurusW", "date": "October 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4021861}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "There was no need for concern.. We were greeted warmly, escorted to our room and shown around. The staff memeber noticed my opposite gender children would not be happy sharing a queen bed and promptly arranged a rollaway FOC.", "title": "Not lovin it", "helpfulness": 12, "user": "Kebablover", "date": "August 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "service": 2.0}, "id": 3811671}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 22, "average": 58, "very good": 134, "terrible": 16, "excellent": 243}, "aka": "Sea Temple Resort And Spa Palm Cove", "slim_ranking": 0.416666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}