{"user_rating": 4.0, "review_count": 2232, "name": "Punta Cana Princess All Suites Resort & Spa", "reviews": [{"rating": 5.0, "title": "Great resort and location", "text": "My wife and i just returned from the Bavaro Princess and I have to say we loved it. I am extremely particular and have been to the Dominican Republic several times. The beach, service, food, room and landscape was excellent. The nly complain I have might be that some people were a little noisy on the beach and there were many people from Spain partying in the pool that were very loud. Otherwise it was great. Here are my reviews by category:", "helpfulness": 12, "user": "A TripAdvisor user", "date": "August 30, 2005", "id": 3824536}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Beach: Excellent sand, beautiful water for swimming and scenery.", "title": "We had a wonderful relaxing vacation!", "helpfulness": 17, "user": "bigdtexas", "date": "August 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3823070}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "Rooms: Large suites. AC was excellent. The bed was firm and very comfortable. Cable TV and mini fridge was stocked and included. Room was very clean.", "title": "stay away", "helpfulness": 2, "user": "juegagirl", "date": "August 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3807569}, {"rating": 2.0, "title": "Traveller's Disease waiting to happen!", "text": "Food: Buffet is available for every meal and the selection and freshness was great. Allways a Pasta station and grill where you can have pasta, steak, fish or chicken made to order. In the AM, there is a juice bar where fresh juice is made to order and an omelette bar. There are several ala carte restaurants that are all good that require reservations, however i preferred the selection of the buffet. The buffet dining room was very nice.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "August 25, 2005", "id": 3807484}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Service: Outstading and allways with a smile. Really nice people. Give them a dollar a day since the average wage in the DR is $200 per month. They were allways filling glasses, taking dirty plates away, etc.", "title": "Great Vacation!!", "helpfulness": 25, "user": "jaluck", "date": "August 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3781244}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "My husband and I just returned from the Punta Cana Princess (we travelled from Nov 15-22, 2005) where we were on our honeymoon. We booked 2 weeks prior to our departure and needed to pick up our tickets at the Sunquest counter at the airport. The ticket printer was broken, so anyone who had booked the night before had to have their tickets hand written. This was not the case for us, but we ended up waiting in line for 20 minutes waiting for those in front of us. Normally this wouldn't bother me, but there was another person behind the counter who wasn't doing anything, but wouldn't look at any of us in the line. Perhaps he didn't have the authority to hand out tickets??", "title": "Good resort, great people, great beach", "helpfulness": 24, "user": "JenniferUxbridge", "date": "November 24, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4142191}, {"rating": 5.0, "title": "Best trip", "text": "I had read reviews for this resort prior to leaving and was a bit nervous, however I was pleasantly surprised. Sunquest has rated this as a 5 star, which I don't agree with (more like a 4) compared to other resorts I have been to. I read reviews of other resorts in this area and it seems that they all have similar issues. The two areas I was disappointed in were the buffets and the room cleanliness, but even these were not absolutely terrible. We did have some run-ins with cockroaches in our room...but it is a tropical island, so I guess this can be expected. This resort had been closed for a while so they could upgrade things - I know that the mattresses were new, and they were very comfortable. We were there while they were still filling up the resort, so it was pretty empty at the start of the week. I think they were still working out some kinks as a result of the closure.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "November 21, 2005", "id": 4130285}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "On to the good...the airport is beautiful and it took very little time to get through customs, pick up our luggage, and onto the bus. We were on our honeymoon, so we presented a photocopy of our marriage certificate to get the honeymoon package (rum in your room, bathrobes, extra beach towels, fruit, turn down service, \"romantic\" dinner in the seafood restaurant). The concierge was very helpful as we originally got a room with two double beds (even though our travel agent had specified king bed when we booked). Anyway, we ended up with a king bed that faced the lobby and gardens - a nice view, especially compared to our first room which kind of looked into the back of a building. Ask the maid or front desk for facecloths; they don't seem to put them in the rooms otherwise.", "title": "awesome hotel", "helpfulness": 15, "user": "truematch20", "date": "November 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4112234}, {"rating": 5.0, "title": "I personally thought it was amazing ", "text": "The people (both staff and guests) at this resort were all wonderful, very friendly and helpful. The entertainment staff and bar staff were great and funny. I have read reviews that people don't like when staff doesn't speak English very well...remember you are going to a country where the language is Spanish! Take the opportunity to learn some - the staff seem to enjoy teaching Spanish and learning some English in the process.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4051224}, {"rating": 5.0, "title": "Paradise", "text": "The a la carte restaurants were very good, our favorite was the Tex-Mex steakhouse, the \"Rio Grande\". The filet mignon was fantastic. We found that we liked the restaurants at our resort better than the ones at the Club Caribe, but we were not able to get into the Brazilian restaurant, which we heard was good.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "September 26, 2005", "id": 3939871}, {"rating": 5.0, "title": "A gem in Punta Cana!", "text": "Punta Cana Princess is the sister hotel to Bavaro Princess and Caribe Tropical. What makes this one so much better is that it is smaller and adults only! The hotel staff was amazing! The food at the 4 restaurants was fantastic, as was their buffet. Since it is a smaller property it is not as crowded at all. There isn't a worry of kids playing in the pool or not being able to get a seat in the restaurants. The other properties have attraction such as a disco and a casino. There is a trolley that can take you there and back for free.", "helpfulness": 24, "user": "Girlonthemove", "date": "February 7, 2007", "id": 6752984}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The pool was beautiful and the grounds were immaculate. I think they cut the grass and trimmed the hedges everyday. The bar and wait staff did whatever they could to make you happy and feel at home. I couldn't have picked a better all-inclusive to stay at if I tried. I stayed 9 days and 8 nights, including Christmas and New Years '07, and I would totally go back in a second! Punta Cana Princess is well worth the trip to DR and is very reasonably priced.", "title": "beautiful resort,very quiet", "helpfulness": 14, "user": "acg2111", "date": "January 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6719000, "likes": {"liked": "— the quietness and the beauty of the resort", "disliked": "— the food"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007", "text": "just got back from puntacanta princess, hotel was beautiful,grounds were so clean pool was clean and plenty of room to swim and relax. if you want a good spot on the beach or pool its best to put a towel over your chair to save it and try to do it before 9:00.our room was the best we were near the beach and pool so we had a great view and close to everything. they said no tipping for drinks but to get good service best to tip $2each time you get a couple of drinks to get better service we also tipped the maid each day she always supplied us with plenty of drinks and clean towels. the food was the biggest let down the 1st 2 nights we made reservations at the mediterranean\"mare nostrum\" we had surf&turf not like at home my lobster was smaller than a golf ball and my husband did not even get any and the steak was like rubber. the next night we ate at the rio grande everyone said this was the best ,appetizer was chicken very good steak was horrible after that we ate at the buffet which was okay we never tried the caribe food because it all looked the same. all in all i would return to this resort if they keep it all adults it was so peaceful that you have to overlook the food. if you wanted to see shows you had to go to the caribe, we did a jeep safari ,ride definetly,would recommend you get to see beyond the resort area and its very safe you travel with about 10 other jeeps. so if you want a nice relaxing vacation and you are noy a picky eater then i would suggest this hotel.", "title": "Never again!!!!!", "helpfulness": 3, "user": "NogySvelo", "date": "January 30, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "cleanliness": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6716957}, {"rating": 3.0, "title": "enjoying our vacation", "text": "Rude personal, never available to customer needs, limited English and no sense of responsibility. Extreme liberties are the best description. They may offend the customer out of blue and disrespect", "helpfulness": 11, "user": "mexico62", "date": "January 30, 2007", "id": 6715835}, {"rating": 4.0, "title": "Small, quiet and relaxing place to go", "text": "Americans. My son was trying to reach me on the phone for several days. Nope, never happened, especially difficult to communicate to service desk after 9.00pm. Whoever is at the desk don't bother to transfer all incoming calls, they don't listen to youas soon as you try to speak English and don't make any effort to understand.", "helpfulness": 12, "user": "saxontraveller", "date": "January 28, 2007", "id": 6709977}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Definitely quantity doesn´t mean quality. I would rate this as a 2-3 star hotel, not 4. Although the size of the room, the number of restaurants and the decoration, some important details were missing there and that´s why I would not come back to Punta Cana Princess.", "title": "A good hotel can be identified by the small details...", "user": "Viking_Janaluna", "date": "March 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 59626910}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We had the Platinum Suite package, and were logded in the building # 3, at the ground level, room # 3013. We spent 4 nights there, from March 20th to 24th, 2010.", "title": "wonderful", "helpfulness": 3, "user": "jpdupuis", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59612115}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "OVERVIEW", "title": "WOW... Best Trip Ever... Planning my next trip back!! Solid 4 +", "helpfulness": 2, "user": "iC3Karim", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59541455}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The lobby is comfortable, large and clean. The swimming pool is large and clean and there are beds beside it. The gardens are nice and well maintained. At the beach, there are parasols and beds, as well as hammocks. You have to arrive early (and I really mean early), otherwise you won´t find bed and parasol empty. If so, you can stay on a hammock, under the shadow of a coconut tree (the beach has lots of coconut trees, which can be sparse at other resorts´s beaches, pay attention at this when choosing a resort in Punta Cana).", "title": "Great Spot", "helpfulness": 2, "user": "wackywendy", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59525720}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "What surprised us is that the resort allows vendors at some days and they are very very very aggressive. We had just checked in and were going towards our room when one of them came and \"offered\" us a gift. Then he began to show everything he had and began with the blablabla. I said we were tired from the trip, that we wanted to rest, but he didn´t respected it. We had to let him talking to himself, because he wouldn´t leave us alone. When we went to dinner, we had to take another way just to avoid him. That was embarassing.", "title": "Don't expect too much and you'll be fine", "user": "Jagohu", "date": "March 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59479468}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My boyfriend and I went to Punta Cana Princess (PCP) from the 24th to the 31st of March. We have been to many beautiful 4 and 5 star resorts, but I have to admit that this was by far our favourite destination. This resort had everything we were looking for. It is a small resort (250 rooms) which gives it a cozy/homey feeling. It's an adult-only resort. The average age is about 40 which makes it a quiet resort with just enough entertainment. It is a very secure resort. The beach and pool area were extremely beautiful. The service was outstanding. The rooms are beautiful and spacious with a sitting area. The food at the buffet was very good. Our only disappointment were the Specialty Restaurants. They weren't that good, except for the Asian Restaurant at the Tropical Resort. However, the Animation Crew, led by Garish, was simply outstanding. They are the heart and soul of the resort.....without them, the resort would not be the same. The service with Sunwing was perfect.", "title": "What a place!!!!!", "helpfulness": 5, "user": "OttawaKristie", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60206858}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I won't go into too many details about the resort as previous reviews cover it all, but I would like to underline the following. On Tuesday night, supper was served on the beach. You would not believe all the work that they put into it. They brought all the tables and chairs at the beach. Each table was set up to perfection. They decorated the area - brought in electricity for the lights. There were about 10 counters of food (i.e. salads, fried food, different BBQ, veggies, desserts and so on). This evening was the most beautiful evening I ever spent in Dominican. It was magical. The food was outstanding, the music and entertainment was excellent. I will never forget this evening.", "title": "Clean, friendly and relaxing adult only resort!", "helpfulness": 2, "user": "Boots7111", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60184593}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Throughout our stay, we met wonderful people from the States, Germany, Quebec, New Brunswick, Newfoundland, Ottawa and Toronto. We will definitely be going back. This was one of the most beautiful week of my life. I can't wait to go back.", "title": "Mostly OK, but one word of warning…", "helpfulness": 1, "user": "WillyBToronto", "date": "March 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60024147}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Please don't forget to tip the staff...and don't forget to tip the Entertainment Crew.", "title": "A great first trip for newlyweds", "user": "yasha7686", "date": "March 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 59975631}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our third trip to this resort and what was already perfect showed even more improvements. Very friendly front desk-always smiling and ready to help! Especially Luis! We requested top floor and did not get it, but Luis fixed us up the next day. Beautiful rooms!", "title": "we will return !!", "helpfulness": 3, "user": "iceberg24", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59970801}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We were at the Punta Cana Princess Resort from 24 March to 07 April for a two-week stay. This was our third visit to this resort and it was simply amazing.", "title": "Amazing.....", "helpfulness": 5, "user": "OttawaKristie", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157065569}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "As previously stated, the beach is gorgeous, spacious and kept clean at all times. The pool area is extremely beautiful. The food keeps getting better and better every year. The service is outstanding. The Animation Team is wonderful. The staff is amazing. The rooms are big, spacious and kept very clean.", "title": "Great hotel on the beach", "helpfulness": 1, "user": "TravelinGregSarasota", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 156876567}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "A special thank you to Hector, Raoul, and Jose from La Petite Fondue for treating us like royalties….you are so good to us and we truly appreciate it.", "title": "Good Hotel!", "helpfulness": 1, "user": "Giselle F", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 156827876}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We were highly impressed as well with all the staff. From Jose and Olga from the Animation Team, to the gardeners who keep the grounds immaculate, to the security guards to the reception staff, the cleaning ladies and all the staff at the buffet and A-laCarte Restaurants. A special thank you to the Dominican Trio. They are amazing and are a true asset to this resort. All the staff do an excellent job, which makes this resort so special.", "title": "A Little Disappointed", "helpfulness": 1, "user": "Sasksunlover", "date": "April 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 156818704}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "We had the privilege of visiting the renovated room and I must say it is extremely beautiful - I was quite impressed. We like the fact that they are doing regular upgrades to the resort. They were painting the outside of the buildings - the gardeners are planting new flowers, they will shortly be renovating the rooms and the pool, there are always new food items at the buffet and at the restaurants. The Animation has greatly improved. The BBQ on the beach is such a nice touch - Jose who prepares Crêpes Suzette at the pool, the Animation Team who brings fruit skewers to the guests late afternoon. The Beach Party is amazing - another evening of dancing on the deck was amazing as well. The resort is managed by an amazing team of managers with a great vision and the employees deliver the product.", "title": "Spring Break Girls Getaway", "helpfulness": 4, "user": "Brittwash", "date": "April 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 156536759}, {"rating": 5.0, "stay_parameters": "Stayed January 2014, traveled as a couple", "text": "We were at the Punta Cana Princess from December 29 to January 5th to celebrate my 50th birthday anniversary.", "title": "My little piece of heaven!!!!", "helpfulness": 3, "user": "OttawaKristie", "date": "January 6, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189873659}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Overall, once again, our holiday was amazing. The beach, the pool area and the gardens are as beautiful as ever. The food was very good. The service superior. The renovated rooms are very beautiful and the bed very comfortable. It is amazing what this resort has to offer considering its price.", "title": "Outstanding in every year", "helpfulness": 6, "user": "MaryMeyer_11", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189397636}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We had the priviledge of being there for New Year's Eve and the evening exceeded my expectations. You had the choice of booking at the Italian Restaurant or the buffet. We opted for the buffet. The dining room was decorated in a very elegant manner with a violonist on site. The food selection was endless with unlimited lobster and shrimps and once again the service was excellent. We were then invited to go to the beach deck where we were entertained with live music until midnight, followed by an official countdown followed by fireworks. The evening was a true success.", "title": "I was shot and left for dead", "helpfulness": 3, "user": "rydesa00", "date": "December 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 188847209}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "As for my birthday, Hector went out of his way to ensure that my birthday was as special as could be. Hector is a true asset to this resort - we can always count on him.", "title": "Heading back!", "helpfulness": 3, "user": "JSCraw", "date": "December 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 188706264}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Thank you to all the staff at PCP for making our holiday an amazing experience. Special thank you goes to Hector!", "title": "Good but not a 4-5 star", "helpfulness": 5, "user": "josee C", "date": "December 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 187836070}, {"rating": 5.0, "title": "Excellent and Beautiful Resort!!!!", "text": "We just got back from a 4 night 5 day vacation at the Punta Cana Princess and loved it!!!!!!! Can't wait to get back. When you first get there you are greeted with a cold pina coloda and the resort is beautiful. You must make reservations at the Ala Carte restaurants, the Tex Mex restaurant was delicious , get either the chicken or the steak or both!!!! The buffet food was alright but you will find something you can eat. The weather was nice!!!!!!89 degrees everyday. The rooms were very clean and comfortable. Make sure you do the Jurastic Sufari tour and if you buy anything always negotiate the price, I got a large canvas painting and mask for $100 and he originally told me it would cost $175. Anyway you will have a blast, you can go to the casino by hotel shuttle and you also have access to 2 of their sister properties, the one you want to spend a lot of your time for entertainment is the Caribe princess. The Punta Cana princess is very kid friendly, we don't have any kids, but it was a very quiet resort which we liked. You won't be sorry, our stay was excellent!!!!!!!!!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3663939}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "I just got back from the Punta Cana Princess just a couple of hours ago. I must admit that it was not my favorite vacation although many of the less than satisfactory conerns were not the fault of the hotel.", "title": "not terrible, but not great", "helpfulness": 14, "user": "Fred N", "date": "July 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3650730}, {"rating": 5.0, "title": "Absolute Perfection", "text": "We were scheduled to arrive in the mid afternoon of July 1, but due to problems with the charter airline, we had an 11 hour delay, and we did not get to the resort until about 2:AM. Once we did arrive check in was pleasant. The gentleman at the front desk was very polite, helpful, and efficient. Staff members promptly delivered our luggage to our room. However, the A/C had been turned off in our room, and it was hotter than blue blazes. In fact, even with running the A/C full throttle for the entire week, the room never did get cool. Literally, it was hotter in the room than outside.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 7, 2005", "id": 3645296}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "On a more positive note, after we unpacked, we were delighted to find out that there was an open snack bar. The gentleman working the grill made us a pizza, and it was pretty good, and since we hadn't eaten in many hours, it actually tasted wonderful.", "title": "Loved it! Great for Honeymooners!", "helpfulness": 12, "user": "girlygirljenn", "date": "July 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3635217}, {"rating": 4.0, "title": "Great but not Perfect", "text": "We got off to a late start on Saturday, sleeping in a bit to catch up from the late night. As soon as we could, we went to the beach. The beach at the Punta Cana Princess is very nice. The water has a pretty color, and there are plenty of beach chairs. In fact, of all of the all inclusive Carribean trips I have taken, the Punta Cana Princess is the best in terms of easily accessing a shaded beach chair. No matter what time of day I went, I could always find one.", "helpfulness": 32, "user": "A TripAdvisor user", "date": "June 22, 2005", "id": 3604427}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Just returned from a 7 day stay at this resort. The main reason for choosing this resort was the following: economics, adult only resort, 5 star rating, small, quiet and favourable reviews, and access to both the Tropical Princess and Caribe Club Princess Resorts.", "title": "Small, Quiet, and Relaxing Resort", "user": "JustGoingToSouth", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102790490}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Based on my previous visits to other resorts in Punta Cana of different hotel ratings from 4 to 5, I consider this to be a mid range 5 star and was satisfied with the services that came with this hotel rating.", "title": "worthwhile stay", "helpfulness": 1, "user": "RhiannonManitoba", "date": "April 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102675335}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The following are my comments about the resort and items found in some of the previous resort reviews I read prior to my planned vacation.", "title": "Fantastic", "user": "Digue", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102431837}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "1. Outdated and need refurnishing.", "title": "Would definitly return!!!", "helpfulness": 2, "user": "PMacdonald", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102016364}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Not all things in the world need to be shiny and bright but you should be more concerned about if things are in working order and not if they are new or modern.", "title": "A 3.0 star resort . Don't expect too much !", "helpfulness": 2, "user": "LoveTheSunBut", "date": "March 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 101920089}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Just returned back from our first vacation in DR on Monday. My daughter (18 yrs. old) and I had a great time. We were a bit concerned with weather, sickness and hurracaine issues but turned out had absolutely nothing to worry about.", "title": "PCP Paradise Vacation", "helpfulness": 15, "user": "diamondsuz", "date": "August 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3752615}, {"rating": 2.0, "title": "Will Not Return to the Punta Cana Princess", "text": "Flight by Skyservice went very smooth. Only complaint was how cold the plane was and lack of blankets. Arrived at PC Airport and was quickly transported by Sunquest bus to resort.", "helpfulness": 7, "user": "manateeboy", "date": "August 9, 2005", "id": 3749966}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Check in at resort went quickly. Offered us cold drinks while we waited in line. Front desk greeter was very friendly and met us with a big smile and a bit of personal chit chat. Room was not ready but only a 45 minute wait. Gave us a chance to grab a cold drink at the lobby bar and walk around for our first look at the resort. Bags were brought right to room by Bellboy when ready. Room was exceptionally clean and cool as AC was already running. Room had two double beds, ceiling fan, sunken living room with sofa bed, television, bar fridge that was stocked daily by maid with beer, coke,sprite and bottled water. Had our swimsuits on and were in the pool within minutes of getting our luggage.", "title": "Thanks Trip Advisor", "helpfulness": 23, "user": "MelEdmontonAlberta", "date": "July 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3690581}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The PCP is so quiet and private. Never a problem to get a lounge chair at the pool or beach. No lineups at the bar. \"A la carte\" could be booked every night if you wanted.", "title": "R & R Paradise at the Punta Cana Princess", "helpfulness": 21, "user": "JD17", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3673833}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Food at \"a la carte\" restaurants was great. Especially enjoyed the fillet mignon at the Steakhouse and the Calzone at the Italian. Booked four nights of restaurants, ate buffet 1 night and enjoyed dinner on the beach at the Saturday night Beach Party. Always lots to eat and plenty of selection. Neither my daughter or I suffered any sickness. We did make sure our tetnus shots were up-to-date and got a hep A shot on the advice of our doctor.", "title": "It was great, but....", "helpfulness": 7, "user": "lorochka", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3667907}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We loved the resort itself, we were in the 5000 block which is the last building, closest to the beach. On the 3rd floor which in my opinion had the best view of the ocean, it rained late-night sometimes and the sound on the roof was very soothing. Rooms were nice and big, cleaned well everyday with a 2$ tip, as well as our fridge stocked daily.", "title": "Quiet and relaxing!", "user": "CaribeanCanada7", "date": "April 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103919612}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The staff were mostly very nice and welcoming, EXCEPT for the older bartender at the comfy bar (mare nostrum) beside the beach, he was just grumpy. I noticed that sometimes there were bottles of MGD(miller genuine draft) given to certain people?? Or bottled pop mixed with drinks for some and fountain for the others. Even by showing some green it didn't bring the good beer out or the real pop?", "title": "WONDERFUL SERVICE, WONDERFUL RESORT", "helpfulness": 3, "user": "lynner100", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103828504}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The beach is beautiful, and where we spent most of our time, yes and get up early for a grass hut or a bed/cabana simply by leaving your towel. The actual beach bar was great and he would even bring our drinks to our cabana sometimes.", "title": "So Relaxing!!", "user": "Sweets003", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103679050}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The buffet was ok, and you'll find something atleast to fill the void, we've been to Jamaica twice and enjoyed the food better there. The beach lunch buffet was the best, and nice and close for us beach bums, with yummy BBQ chicken and potatoes.", "title": "The resort others can learn from!", "user": "ShawnH69", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103553550}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "There was one beach party, but the rest of the nights were very quiet. Of course you were able to go to the sister resort next door for some louder night life, or to the casino in Bavaro.", "title": "trip of a life time", "user": "capersinthesum", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103428459}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Booked this hotel as a last minute holiday, hence had very little time to research our options before we booked. The hotel was a class above many of the other hotels in the area (we went exploring and had a little nosey around some other pool/reception areas). The hotel's ground are split with its older sister hotels - this makes for a nice walk in the evening when visitng some of the speciality restaurants.", "title": "Luxurious Peace", "helpfulness": 17, "user": "rhodgreen", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6595705, "likes": {"liked": "— Relaxed atmosphere", "disliked": "— The speciality restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "This hotel mainly catered for the Spanish. Most of the evening entertainments was for them, but was in fact quite small comapred to the main events that occured in the sister hotel.", "title": "Nicest People", "helpfulness": 14, "user": "LAL192", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6575330, "likes": {"liked": "— The beach and the cleanliness of the resort", "disliked": "— The food"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The rooms were very nice (split level), we had a slight musty smell when we arrived so the hotel installed a dehumidifier in our room which stayed with us for the week.", "title": "Poor Food", "helpfulness": 5, "user": "Randola", "date": "January 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 5.0}, "id": 6564708, "likes": {"liked": "— Rooms", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The room was cleaned daily although initially this did not happen until very late in the afteroon when we were returning from the pool area. A quick word with guest relations resulted in earlier service.", "title": "I really liked it!", "helpfulness": 6, "user": "coryj1978", "date": "January 7, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6563512, "likes": {"liked": "— The drinks!!! The variety of them", "disliked": "— Minimum customer service, they did not go out of their way"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The food in the restaurants were very good. The all-inc choice was limited compared to some other hotels we've been to, but the quality was far superior. The speciality restaurants were slightly dissapointing, especially the ones in the other hotel. Superb fish restaurant, don't waste time with the itallian and chinese.", "title": "relaxing", "helpfulness": 10, "user": "sydjord", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6549136, "likes": {"liked": "— staff friendliness", "disliked": "— lack of english"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The following is my review of the Punta Cana Princess All-Suites Resort in Punta Cana, Dominican Republic (I visited this property 8/15-8/22/05):", "title": "I want to go back!", "helpfulness": 19, "user": "Trobers", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3758089}, {"rating": 4.0, "title": "Not the best, but not the worst", "text": "After a great deal of shopping around, my girlfriend Heather (24) and I (23) chose Punta Cana Princess (PCP) All-Suites resort for our vacation. We used the reviews on Debbie's (and another site) and prices provded by our travel agent to shop around for the best value. We specifically wanted a 5-star property.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3755946}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I returned to this location after visiting here last year for our honeymoon. We enjoyed the experience so much that it wasn't much of a discussion as to where we wanted to go for our anniversary - we loved the PCP! And we were not disappointed.", "title": "Return Trip Exceeded Expectations Once Again", "helpfulness": 11, "user": "Jessica B", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118854153}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "Once again we were greeted by friendly staff, this time with a special coconut drink as we were returning visitors. We had our room on the third floor of building 5, and it was great. Cleaning staff was helpful and did a great job. We have no complaints about the cleanliness of the rooms.", "title": "Great beach but don't expect the same treatment as many other hotels.", "helpfulness": 3, "user": "Yazen", "date": "September 26, 2011", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118633941}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The a la carte restaurants were also superb, and Jose at La Petite Fondue went above and beyond to make our anniversary special by setting up special tables for us. This has been our favourite restaurant, and we recommend the shrimp fondue (something that we didn't try until our last day and wished we'd tried it sooner). If you like coffee, ask Jose for his special, Coffee Romantico - it's very strong, but very delicious, and the presentation is really awesome. The Italian Restaurant was also great.", "title": "An honest review from a Brit", "helpfulness": 5, "user": "LindsEth", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118605568}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The staff are very friendly and appreciate dialogue (even if you don't know Spanish). Most speak English, and the ones that don't can pretty much understand what you say to them, so communication is *rarely* an issue. I would recommend looking at Web sites, before you go, to try to learn some common phrases in Spanish if you don't speak the language.", "title": "How is this resort rated #12/96?", "helpfulness": 3, "user": "GTA_G20", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 118531682}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The pool was kept clean and had routine entertainment and game options as well as offering lots of relaxation. The beach is absolutely wonderful!!! In July, when we visited both times, we never had issues in finding a beach bed or chair. There is a vendor by the pool, but once you let him give his speech and tell him politely that you will think about it but aren't currently interested, he will leave you alone (talk to him early so he won't pester you later).", "title": "I liked my stay a *chocolate drops review*", "helpfulness": 10, "user": "SOLSOEUR", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118325822}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "First time in the Dominican here. Just stayed at the Punta Cana Princess for a week, and the resort proved above and beyond my expectations. We had a simply wonderful stay. I read many many reviews for many different resorts before I booked, and was still wary of possible issues others had mentioned. Everything was great though, and I will definitely be back!", "title": "A wonderful stay!", "helpfulness": 10, "user": "Tina D", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118014669}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I will break down my comments for easier reading:", "title": "Unbeatable - Will return for sure!", "helpfulness": 3, "user": "MarcoCricri", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117981506}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "ROOMS: We stayed in building 5, but wherever you stay you will be fine as the resort is rather small and you can go from one end to the other in about 3 minutes walk. Our room was spacious and most importantly, spotless. I am normally quite paranoid about hotel cleanliness, so I bring a Lysol spray with me and wipe everything down with a white towel as soon as I get in. The towel stayed sparkling white! I was extremely impressed. There was no moldy smell that some others have complained of.", "title": "Won't Go Back", "user": "Ottid142", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117948859}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "GROUNDS/BEACH: Wow! We walked down the beach for quite some team and our beach was by far the nicest one. The grounds are well-groomed and clean. You may have trouble finding a chair under an umbrella on the beach if you show up later in the morning/early noon, but it was even better to sit in the sun (always plenty of chairs and beds in the sun).", "title": "Perfect rest and relaxation!", "helpfulness": 1, "user": "L P", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117794339}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "STAFF: Always very friendly and happy to help. Some spoke only passable or even barely any English, but you get by easily. The animation team was great at keeping everyone entertained with daily activities at the pool and the nightly show. If you need something more, take the shuttle to the sister resorts for the disco.", "title": "Just returned!", "helpfulness": 7, "user": "missouritraveler8", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117653063}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We got married at Punta Cana Princess on March 25, 2011. We could'nt have chosen a better resort for the event. Every venue of the wedding was simply outstanding. The decorations at the gazebo were extremely beautiful. The supper at La Petite Suisse (Fondue) was amazing, followed by a visit from the Dominican Trio (musicians), which added ambiance and festivities to the event. My husband and I were extremely pleased with the outcome of the wedding. We would like to sincerely thank Francelina, Raoul, Hector and Jose (from La Fondue) for making our Wedding Day as beautiful and as perfect as it was. We hired the services of a photographer (Won), who is an extremely talented young photographer. The pictures are simply amazing. The Video Tech is also very good. We would highly recommend this resort for a wedding.", "title": "Our Wedding at Punta Cana Princess", "helpfulness": 2, "user": "OttawaKristie", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104404486}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "As for a general review of the resort, it was our second stay at this resort. We were once again extremely pleased with the outcome. The resort is extremely beautiful, clean and safe. The beach and pool are extremely beautiful. The staff is exceptional, polite and provides the best service possible. The food was amazing, whether it be at the buffet or at the Specialty Restaurants.", "title": "not a big sprawling resort- a huge plus!!", "helpfulness": 2, "user": "beachlovercanada", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104364542}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The Animation Team was good but we were extremely disappointed to see that Garish and Johanna were not there. It was good to see Beatrice again. We will definitely be going back again next year.", "title": "Best trip EVER!!!!", "helpfulness": 1, "user": "judy217", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104345491}, {"rating": 1.0, "stay_parameters": "Stayed April 2011", "text": "Again, thank you ever so much for making our Wedding Day so exceptional.", "title": "Hide your valuables", "helpfulness": 6, "user": "joseph1hamilton", "date": "April 16, 2011", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 104290067}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Mucho gracias!", "title": "What can be said that hasn't already", "helpfulness": 4, "user": "pathfinder2001", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104251868}, {"rating": 5.0, "title": "Wonderful vacation", "text": "We just returned from our first 'get away from it all holiday', in 23 years and cannot rave enough about the Punta Cana Princess. We are both in our sixtys, and just didn't realize what an all inclusive, adult only vacation could be. Although my husband ended up with the flu, the size of the Punta Cana Princess was just what we needed. The Princess is a smaller resort and was so easy to get to the pool or the beach without a long walk. Just what the Dr. ordered. There is lots to do if you are wanting adventure from swimming with the dolphins, snorkeling, tubing. We could lay around the pool and tan or sleep in the shade, we could always find a spot at the beach and watch the people or swim. The service was beyond expectations. It didn't matter if it was water, or a drink, the friendly staff was always there to assist. The ala carte restaurants were an adventure in fine dining. Although the language was a small barrier, it was not hard to explain with gestures and a small dictionary that we had a bad stomache and they adjusted my husbands meals accordingly. We had alot of fun at the Domincan Restaurant at the Caribe. The staff was fun to be around and they certainly enjoyed their work. The Steak at the Tex Mex at the Punta Cana Priness would give our good Alberta beef a run for the money. The amount of ala cartes allowed was terrific but we found that we enjoyed eating at the buffet as the food there was also great. The work and effort put on by the resort was greatly appreciated. The whole buffet area was moved to the beach for a beach party one evening and the meal was to die for. The cleanliness of this resort is at least 10 **********. It didn't matter if you used their public washrooms or your own suite, they were spotless. The grounds were gorgeous and the grounds keepers just fade into the landscaping keeping it in beautiful shape. Although my husband was ill for the first 2 days I felt right at home wondering around the resort on my own even going for meals in the evening and never once was worried about my safety.", "helpfulness": 17, "user": "SixtiesLady", "date": "February 26, 2007", "id": 6843235}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We took the trip to Manaiti Park and were treated with the same hospitality as the Hotel. And so handy being picked up at the door and returned in fine style.If we had a negative comment to make it would be the helpfulness of the lobby staff being able to communicate on arrival. As this was our first holiday in along while, being tired from a long \"late\" flight, very hungry from lack of eating due to a poor airline, and in a new country, better explanations of what is going on would have been a great help. The staff knew what they were doing we just didn't. And don't remove the card in the wall when you get to your room. It does not work in the safe, and you will be in the dark in about 15 minutes and trying to locate the phone. But after calling the front desk and trying to understand their explanation of what \"we\" had done the situation was righted promptly. I would also reccommend taking a face cloth as they aren't supplied.", "title": "Fab resort!", "helpfulness": 12, "user": "HamiltonOntarioJules", "date": "February 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6835881, "likes": {"liked": "— Cleanliness", "disliked": "— ground floor - Musty scent"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "All in all we had a wonderul holiday filled with many good memories and lots of wonderful pictures. We will be recommending this resort to all our friends and family if they want a wonderful vacation. If it wasn't for the terrible plane ride, we would be thinking of going back real soon.", "title": "Loved it!", "helpfulness": 15, "user": "MaidO'Mud", "date": "February 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6805319, "likes": {"liked": "— Large, clean rooms and the attentive staff", "disliked": "— Had to leave :-("}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "We have just returned from a one week stay at the Punta Cana Princess. We flew out of Hamilton International - Wow what a way to go! Quick and easy! The resort is beautiful! The grounds are impeccable! There is not a lot of night life however that is not something that we were looking for particularly. The beach is magnificent! The grounds crew maintains it daily. The wait staff and the cleaning/groundskeepers are very friendly and accommodating. Our only issue was surrounding the \"VIP\" package. We tried unsuccessfully to purchase this here in Canada but were told that they were sold out. Sunquest vacations - offers this as an upgrade in their brochures as well as their web site. NO where does it speak to it being limited to a number of clients or rooms. That being said the last response from our - I travel 2000 agent was to try to purchase at the hotel. HMMMM if they are sold out then how can we buy it there? Well you see, we did not have to even ask - They wanted to sell it to us upon our arrival! BUT guess what?? They wanted 22US per person per day - 154 US per week a far cry from 120 Canadian. We still thought it was worth the added bonuses so we did go ahead begrudgingly!", "title": "Will Return to Punta Cana Princess", "helpfulness": 16, "user": "dodieb", "date": "February 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6786922, "likes": {"liked": "— The Staff", "disliked": "— No dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "One of the added bonuses of the VIP package was the beach beds. They are wonderful! We had no issues with getting a bed or a cot either at the pool or the beach even at 10:00 AM", "title": "Perfect Vacation - Amazing Resort!", "helpfulness": 22, "user": "BeachDiva", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6783184, "likes": {"liked": "— The cleanliness, the food and the wonderful staff!", "disliked": "— nothing!"}}, {"rating": 5.0, "title": "Loved Every Minute", "text": "My sister & I just returned from a 5 night stay here & couldn't have chosen a better place. Absolutely agree with every positive comment other reviewers have made. Check-in was a breeze. They had assigned us a 3rd floor room but I have trouble with stairs & they cheerfully & quickly gave us another room on the 1st floor. Grounds, rooms & beach were immaculate & staff were incredible. We did not get the VIP package but brought a few gifts for housekeeping & left $4 a day which resulted in things like turndown service, special minibar requests etc. that are usually perks of VIPs.", "helpfulness": 12, "user": "bc713", "date": "March 11, 2007", "id": 7013564}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We had been a bit worried about food selection as my sister is a vegetarian but she had no problem at all finding excellent choices every night at the buffet. We never did get around to trying the other restaurants except for lunch at Mare Nostrum, the seafood restaurant by the beach.", "title": "Great Place- Mar 4th to the 8th", "helpfulness": 15, "user": "2495", "date": "March 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6965452, "likes": {"liked": "— The resort was very clean and the food good.", "disliked": "— The house wine was poor."}}, {"rating": 4.0, "title": "Well worth every cent!!", "text": "Highly agreed with previous reviewer who mentioned the benefit of this being an adult property. The resort next door (same owners) was much noisier with heavy beat music playing all the time which would have driven us crazy. Fortunately we couldn't hear it from our place. We stayed in building #4 which was very convenient to both beach & pool & short walk from buffet.", "helpfulness": 8, "user": "ajm/rjm", "date": "March 8, 2007", "id": 6936573}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Took the shuttle to the casino one night. Very small. Someone won $3,000 that night but, unfortunately it wasn't us! Would go back again in a heartbeat. -And everyone who sees the photos say they look like a spread in a travel magazine.", "title": "Best Resort we've stayed at in Punta Cana", "helpfulness": 10, "user": "PuntaCanada", "date": "March 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6911832, "likes": {"liked": "— Service & Cleanliness", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Amazing", "text": "We booked with Bookit.com & complete package came to about $1,140 each. Can't beat that for the value we got, including an agent who was available each day to answer questions, book excursions etc.", "helpfulness": 16, "user": "CWTTTW", "date": "March 2, 2007", "id": 6902394}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I really enjoyed this all inclusive. My experience as an all inclusive user is not that extensive. I am comparing this to an all inclusive that I stayed at twice in Jamaica. The room was always really clean, the ladies that take care of your room are excellent. And they are always happy and pleasant when you talk to them. The beach is wonderful, really soft sand and well kept. The only complaint here is that I wish they moved the chairs and raked for people that just drop their cig butts all over. Other than that they kept the sea weed to a minimum and it was always nice to be walking on. Bartenders are all friendly, make good drinks and don't skimp on anything. All the restaurants other than the fondue place were great. The only problem with the fondue place was that it was really hot, no air in that building for some reason, and the one waitress they had working there was rude and very abrupt. No idea what was the problem with her. Everyone else at the fondue place was very nice. We just tipped the others and skipped her. Talked to a few other guests at the resort and that was their same experience there. I had just assumed she was just having a bad day but I guess not. The nice thing about that is that we didn't have to go back there so we didn't. I loved the Italian restaurant. The chicken in mushroom sauce was fantastic. I had it twice :)", "title": "Really nice relaxing place", "helpfulness": 4, "user": "Bakes60", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156148771}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "To sum it up, rooms were great, ambiance is wonderful, beach fantastic, sea was great. I was not disappointed at all!", "title": "We didn't pick it, but they couldn't have been nicer!!", "helpfulness": 6, "user": "RagtopDazed", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 156136452}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We were here over Easter weekend and had made reservations at the Paradisus hotel. Upon arrival there we were told that they were fully booked and that they were sending us to a comparable hotel. Well first impressions were that there was no way that this was a comparable hotel. Having said that, what they don't have in the way of glitz they more than make up for in friendliness and hospitality. As we were here on business, we needed WIFI, clearly something that the average holiday traveler isn't looking for. They were able to arrange wifi for us for the entire stay through an outside vendor. I am usually not a fan of all inclusive travel, but I will say that the options available we diverse and the food was all of good quality. Get to the pool early and place towels, sort of the thing to do at any resort but just figured I'd give you a heads up on that one. We were contacted by Paradisus and they were looking to collect money from us for booking the hotel ... Huh!! We were kicked out of that property because on the day of our arrival they had overbooked by, according to them, 90 rooms!! They tried to bill us $439 for rooms that I found on Expedia for that day of arrival, for 139.00. Still they pulled out the front desk manager to try and pressure us into paying. So another two hours lost thanks to the fine people at Paradisus. The front desk manager was clearly uncomfortable with his situation and offered nothing more than translation. In the end we got the rooms for $169 a night, clearly well below what Paradisus paid.", "title": "Wonderful hotel for the money!", "helpfulness": 3, "user": "greattravelagent1", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156023925}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "But back to the Princess, would I recommend this property to a friend, yes. If they are looking for an reasonable all inclusive place to stay with great staff and a beautiful beach then this would fit the bill. Renalto at the front desk was fantastic, great sense of humor, and can get stuff done for you. But I just wish I could remember all of the staff names, the were all great.", "title": "Family vacation with adult kids", "helpfulness": 2, "user": "Kathy W", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 155994239}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I stayed at this resort last April, & was really impressed with the food, service, beach & the accommodations. The hotel is a \"diamond in the rough\". I have stayed in many of the higher rated hotels on Bavaro Beach; & was looking for a \"deal\"; with no expectations, & was pleasantly surprised.", "title": "Will be back to this resort.", "helpfulness": 6, "user": "Debbie L", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155910629}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the P.C.P. from Mar.21-28 tis was are second time we stayed there last year for 2 weeks and we new we were going back and we will be going back next year the staff are great the rooms are spotless the food is very good make sure you tip these people work hard to make this resort what it is keep up the good work .", "title": "Just Like Going Home", "helpfulness": 3, "user": "RacoonFace", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59965028}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Bravo! Bravo! and thank you to the Hotel and staff! My better half (future wife) and I spent one week at this resort and we had some wonderful times. We even got engaged on the beach. We enjoyed it so much that we are going back next year. The Punta Cana Princess was simply wonderful. The staff is very nice and they salute you as you walk around the resort. The grounds are very nice and well kept. There is even nice low key ambiance music when walking the grounds during the evening. This is a no kids resort and the evenings are calm and quiet which is great for folks like us who are looking for this type of environment. If you want some entertainment, you can go to the main hotel for music or dancing or the sister resort by shuttle. I you are looking to party all night long, this is not the resort for you.", "title": "Fantastic Trip and Excellent Resort", "helpfulness": 2, "user": "Galaxcity", "date": "March 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59963735}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We had no complaint about the food at all. The buffet has lots to choose from and no one should even complain about the selection. Only downside was the wine which was to sweet for our palet but the beer was great. One evening had some grilled lobsters which we missed...unfortunately. You also don't need any reservation to the four restaurants plus four more at the sister hotel (Caribe Princess). The Mare Nostrum (very nice) is great for an evening drink or a nice lunch on the beach.", "title": "Punta Cana – What a terrible let down.", "helpfulness": 4, "user": "stcrane", "date": "March 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 59956285}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "No complaint about the room either as they were clean and spacious and always with hot water (bring face cloths with you and family size soap bars). They even had large size flat screen tv with over 60 channels. A bottle of Ron Barcelo rum with a box of cigar was in the room waiting for us when we got there.", "title": "Great time with some exceptions", "helpfulness": 4, "user": "Capertravellers31", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59945979}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "The beach is pure white sand (powdered sugar!!!) and you can walk endlessy on both side along the green/blue sea. We did some snorkeling, speedboat, and spent a day at the beautiful Sanoa Island (go by catamaran and come back by speedboat). I wasn't a pool person but I actually spent three days by the pool side as it was a big,beautiful, and cleaned pool. Impossible not to get a loundge chair as there are plenty. Bring games with you such as backgammon, cards, etc to relax even more.", "title": "excellent excellent vacation", "helpfulness": 1, "user": "mariocNiagaraFalls", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59928415}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed at PCP from Mar 24-31. When we arrived in our room, there was a bottle of rum, cigars and a fruit basket waiting for us. We liked the rum and cigars but we did not touch the fruit basket. A nice touch but bit of a waste and I think that they should nix it since you can get the fruits from the buffet.", "title": "Great Resort!", "helpfulness": 2, "user": "odmg", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156524625}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Overall a great resort for the price that we paid.", "title": "Great vacation at this adults only resort", "helpfulness": 6, "user": "JosTraceyM", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 156441803}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Pros:", "title": "Great Honeymoon", "helpfulness": 1, "user": "Springtime38", "date": "April 1, 2013", "detail_rating": {"service": 5.0}, "id": 156307381}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Great selection of drinks (loved the coco loco and pina colada!)", "title": "Great Vacation", "helpfulness": 3, "user": "HockeyMom044", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156243273}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Good food with lot's of choices. Breakfast was good and I loved the fresh juices. Unlimited a la cartes with Mare Nostrum being the best....got the mixed grill, yummy! I really loved the grilled calamari at the buffet. The pasta and salad station were good as well.", "title": "How does it get any better?....", "helpfulness": 2, "user": "Janet P", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156179847}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I will begin by saying that this hotel is totally overrated. I have been to several all inclusive resorts and this one was the worse. Not sure whether the resorts in Mexico are superior in general compared to Punta Cana, as this was our first trip to DR.", "title": "Overrated resort", "helpfulness": 2, "user": "Gremio", "date": "October 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119497304}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Check-in:", "title": "Disappointed", "helpfulness": 6, "user": "Ed_Bricker54", "date": "October 17, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119404720}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The trip from the airport is about 25 minutes. The check-in process can say a lot about a hotel and we didn’t have a great experience at arrival. I inquired about a room in building 5 (I had emailed in advance but was not guaranteed if I would get a room in that building) and the reception clerk said he would take care of me. Then he walked us to a room in one of the buildings close to the lobby, with two beds, to show the room that we should have gotten. We kept walking to building 5 and entered a room with a king size bed and partial ocean view. He started to go over the fact that we would have pay a lot more for that room but that he could get us the room if we “helped him out”. After a long trip I was not up for too much negotiation and ended up paying the guy $70. We learned later that the resort was far from being full.", "title": "Fantastic in every way", "helpfulness": 6, "user": "shiv2010", "date": "October 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119391325}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Structure:", "title": "Just returned from PCP.....", "helpfulness": 3, "user": "luv2travel1", "date": "October 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119368801}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The resort grounds are well maintained. The buildings are three to four floors and do not have elevators. There is a very small spa in the hotel and no gym.", "title": "so pleased with the resort-such a relief.", "helpfulness": 7, "user": "Taradactyll", "date": "October 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119192345}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "My husband and I celebrated our 5 year anniversary at the Princess, Sept 2 to Sept 9. On our last day, guests were being moved to the Bavario since the Princess was closing for renovation on Sunday the 11th. The Princess was also very empty.", "title": "Closed for Renovation", "helpfulness": 23, "user": "Sandra R", "date": "September 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3896605}, {"rating": 4.0, "title": "Great place, except for the food", "text": "We are from Orlando, Florida and are big beach people. We thought we could deal with heat. It was unbelievably hot the week we stayed. The night of our arrival we had to eat at the buffet restaurant since we had not made reservations. There are no paddle fans in the buffet restaurant or the lobby and we had to use our napkins to keep the sweat out of our eyes while we ate. My husband also had to wear long pants to dinner once we had made our reservations. It was terrible to see him sweating all the way to dinner at 8:00 at night.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "September 4, 2005", "id": 3842128}, {"rating": 5.0, "title": "Would go back again and again", "text": "Ahhh...the buffet! This is the only bad thing I have to say about the resort. The breakfast buffet was the same just about every day. They have a made to order omlette bar, waffels, etc. But after 2 days the rest of our breakfast was toast and fruit. Lunch was not much better and room service (ham & cheese sandwich) was even worse. The evening restaurants were good. The two (tex mex and Italian) located at the Princess were very good. We also ate at 3 restaurants at the sister resort that were also good (La Cava, Sombrero and Chinese). Our appetites were not up to par since the heat was so bad. Toward the end, we booked any restaurant we could get as long as it was air conditioned.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 31, 2005", "id": 3833224}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "i flew with sunwing and stayed at the junior suites.i always trusted the staff in the dominican.never no more and i will never stay at this resorty again.i will never use a safe again .my money will be with me at all times.nobody is going to rob you at the beach or pool there too many people around.the maid did our rooms twice a day but it was always late in the nig.sometimes she would come in with one can of beer or a face cloth .whats up with that.it was just in case you were there .if you were not in she had a chance to rob you.they had to go through all my things to find my safe key.", "title": "keep your money with you they are robbing the safes.take heed ,this happened to me .i lost a lot of money.", "helpfulness": 3, "user": "newfie49", "date": "April 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 103397993}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Firstly let me say the beach is incredible - you can walk for miles and see a little of everything - the sand is never too hot to walk on, the staff are incredible and the food was pretty good as well.", "title": "Fantastic", "user": "catj21", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103385153}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We had a fantastic time here and intend to return next year. We met several couples from all over (Germany, Russia, Canada, Sweden, US etc who have done the trip here yearly because they say nothing compares - it was a very relaxing trip to our first adults only vacation and we loved it - the crowd is generally between I would say 25 to 60.", "title": "You should not be disappointed", "helpfulness": 3, "user": "eagleeye504", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103167364}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The staff and service we received were incredible and it is amazing how they will go the extra mile when you make any attempt to speak their language (several staff helped us with our sometimes poor attempts - LOL)", "title": "Nice hotel, but customer care didn't seem to be a priority.", "user": "mrjwrightt", "date": "April 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103057580}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The daily activities were always asked but never harassed and we spent lots of time playing beech or pool volleyball or just relaxing at the beech or pool, the lounge bar at night was a great combination of relaxing jazz music and a wonderful breeze.", "title": "This place is beautiful and very relaxing.", "helpfulness": 4, "user": "Michael_Schmitt_11", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 102801597}, {"rating": 1.0, "title": "So Upset", "text": "I got a call yesterday from our travel agent telling us that the PUNTA CANA PRINCESS is under renovations and we will be moving to a different hotel.", "helpfulness": 11, "user": "Cancelled", "date": "September 15, 2005", "id": 3905960}, {"rating": 5.0, "title": "Moved against our will....but enjoyed everything nonetheless!", "text": "We were leaving in less than 20 days and they call to tell us this. This issue here is that it is for a wedding and there is more than 50 people going and now all the wedding plans have to be changed 20 days before the wedding day.", "helpfulness": 55, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3903359}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "WOW, I dont know what to say that hasnt already been said about this Fantastic Resort. We stayed at PCP from March 16-23, 2013. So I am just going to say, Food fresh and plentiful if you cant find something to eat then stay home your way to fussy to be travelling. Rooms, clean lots of storage to unpack, actually my wife and I only used half of the space avaialble, bed cummfy and made everyday. Service is fenominal, if they dont know your name by day 2 they know it by day 3 and dont forget you. I cannot name one person that stood out just a HUGE thankyou to all the staff that made our vacation complete. In closing if you cannot rate this resort a 4 or 5 then you better stay in the country you came from because nothing will please you.", "title": "WOW Fantastic", "helpfulness": 8, "user": "randyk_1963", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155824241}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I were married 7 months ago and Honeymooned at the Punta Cana Princess...we couldn't have asked for more! It's taken me awhile to finally get around to writing this review, but I wanted to make it a point to do so as I used TripAdvisor so often to check out this resort and found it incredibly helpful.", "title": "Perfect Honeymoon Destination", "helpfulness": 6, "user": "Faith_JN", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155753654}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "In a nutshell, please ignore the negative reviews! This resort is amazing and the staff are incredible. Being our honeymoon, we wanted the honeymoon suite; my husband had emailed Victor to make sure that we would be guaranteed the room, he assured us that we would definitely and he was true to his word. We arrived to the resort, were offered a cold drink and quickly given our room key. A staff member had already grabbed our luggage to haul it up to the room beforehand. Our suite was FABULOUS, definitely a dream! We're juggling the idea of going back for our 1 year anniversary and I would HANDS DOWN want the same room!", "title": "Fantastic week", "helpfulness": 5, "user": "LoveVacation946", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155726632}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The food was pretty good, my husband's a big sea food guy, I'm more of a pasta fan, and we both were able to find something to our tastes and more within each restaurant. You definitely get your fill any place you choose to dine.", "title": "Best one yet", "helpfulness": 5, "user": "Tery4564", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155636087}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "As I've seen stated here plenty of times, if you're looking for an active/club/night life kind of resort, the Princess wouldn't be a match for you. Everything pretty much closes around nightfall...although we did see couples (ourselves included) walk around the resort at night or head down to the beach. The grounds/property are immaculate and is even beautiful at night.", "title": "Paradise!!!", "helpfulness": 9, "user": "Garliz", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155518247}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The room was clean. Grounds are well maintained. Food was all right but I would not go back because of the lack of shady spots and chairs. It was a real issue for us", "title": "Needs more palapas and loungers", "user": "parisredog", "date": "March 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59875946}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "we would like to thank kenia,marie,santa,lousia,david and edwin all class aa waitresses and waiters for making our stay at punta cana princess resort most enjoyable. also all other staff(chefs,maids,etc.) your friends from nova scotia canada", "title": "great vacation", "helpfulness": 2, "user": "aus454", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59872780}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have been to Punta Cana Princess 3 times and are planing on going again in November. It's like going home. Staff is the greatest. always happy and smiling going out of there way to make sure your stay is a great one. Food always great wherever you ate. Rooms always cleaned good. Had problem with coffee pot they brought new one right away and customer service called to make sure it was taken care of. Beach is the greatest for long walks. Again staff is wonderful some of them remember us. What a great feeling. We are looking farward to going back.", "title": "Feeling of going Home", "user": "ILoveVacations2010", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59838566}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I have visited the Carribean many times and I am giving my honest review.Our group where between the ages of 37-42. We traveled from St. John's, NL to Punta Cana via Canjet March 18-25. The flight was on time and arrived on time. The plane was dirty and the staff very unprofessional. We where seated by the the back of the plane and the conversations between the staff and the single passengers was not what you would expect!", "title": "All Adult - Geriatric Resort", "helpfulness": 1, "user": "KACoombs", "date": "March 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 59764439}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed here based on the reviews we read on different sites including this one. We all agreed that if we had our time back we would have stayed at the Bravaro and it would have been cheaper with more amenities.The resort is a standard resort with no frills. I would rate it a 4 but not a 5 star. I would not return to this resort and wouldn't recommend it unless you are between the ages of 55-70. It is not for younger adults.", "title": "Would go back again in a heart beat", "helpfulness": 1, "user": "junnipper", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 59660764}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "from Sept.10 to 17th I was in my favourite place on earth! From check in to checkout, our trip was wonderful! Our room in building 5 , was amazing,oh the VIEW! Food was great, drinks wow! (champagne for me, they had ready always)we were lucky to have 2 beach parties and we danced , boy did we dance!! all the staff here are so professional, they work very hard each moment to give you the best care. ( Nancy, my JLO partner, Raysa, our sweetheart, Franchesca,my Aloe savior,Ernestina,so sweet,Miriam,Anna,Luisa,honey and mamawanna!,Luis, Franci,Juan, Manuel,Nelson,Hector,and of course EDUAR)I hope i left no one out but you all were like our family! We will return next time for 2 weeks. A small resort but worth every cent paid.Thanks to Ramon , nice red shirt! Beach delivery by Jose, great too!,", "title": "With Familia once again!", "helpfulness": 1, "user": "Pgrogy", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118315935}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We were at PCP from 8/14-8/21. As everyone mentions, the grounds are absolutely gorgeous. We had emailed Hector ahead of time to ask for Building 5 Floor 3. We were happy that he was able to accommodate us. We checked in within minutes of arriving. When we entered our room we noticed immediately that it was warm. I called and asked the front desk to send someone to our room to check it out. Someone came, banged around up in the ceiling a little, got on the phone, yelled a bit, and left our room. After he didn’t return for an hour, I called and asked if someone could find out the outcome. After another hour, I called again and they said they found nothing wrong with the a/c. The next day we asked Hector if someone could come in and turn the ceiling fan (its about 25 feet up) to high so it might help cool the room. It helped a little but caused havoc on DH’s allergies. I don’t think the a/c was able to handle the heat as it never shut off the week we were there. We also refused maid service on three days as when they clean your room they leave the front door open and open the balcony doors and then it starts all over again trying to cool the room.", "title": "Not the resort for us!", "helpfulness": 12, "user": "twofacelady", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118081509}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I know food is very subjective and maybe it’s because we are Americans but…..After the first two days, we ate all of our meals at the Caribe Princess. I have a real issue with meats, cheeses, and other foods not being handled correctly nor being properly refrigerated. There were huge bowls of uncovered cereal which I am sure were taken back to the kitchen each day and brought back out the next (very stale) . The breads were all exposed which made them so hard you couldn’t eat them. The pancakes and French toast were hard as rocks. The only saving grace was eggs/omelets made to order. It may be a cultural thing but we don’t eat cold cuts, cheeses, vegetables, for breakfast, lunch and dinner. We ate at Nare Nostrum on the second day. When I went to get a piece of apple cobbler, I stirred up a colony of fruit flies. Server had an attitude at Tex-Mex because DH ordered fajitas and I ordered something else. Said it was for two. Sorry, I didn’t want fajitas and DH did eat them all. We had a great laugh over at Mama Mias. DH asked me that if he ordered the cheese sticks as an appetizer would I help him eat them. Sure I said. When the large plate came out, there was ONE cheese stick about the size of my index finger. I also need to mention we got to Mama Mia twenty minutes early. We went in and there were four tables of people. They told me we have to go back outside and wait until our reservation time. There were at least 12-15 open tables!!! There was no way they would be able to serve someone at our table and get them out by tour reservation time in 20 minutes. One more thing-MEN DON’T BOTHER WEARING LONG PANTS AND SHOES. After my DH went along with the program (even though it was 90 degrees) and wore long pants and closes shoes, there were men in the Brazilian restaurant, Tex-Mex, Mama Mias wearing wife beaters, shorts, and flip-flops. Why have rules??", "title": "Okay - it was warmer than Canada in April!", "helpfulness": 2, "user": "LittleOne1979", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 118079651}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Shuttle was an issue. Three different people at the front desk told us three different times the shuttle starts running. Multiple shuttle drivers were annoyed when they had to drive us back over to PCP. Does it really make a difference where you drive when your job is to drive a shuttle around and around? Be sure to tell the front desk you are waiting for the shuttle and they can radio them to make sure they will stop by PCP at least once in a while.", "title": "Good value, good place for my one night stay", "user": "whereisdave", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 118059284}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We knew going in that the nightlife was nonexistent. We took the shuttle (when it finally arrived) to the Tower Casino each night. We play blackjack so it doesn’t matter that it is a quite small casino. Sometimes there were less than 10 people there and that was after 10:00 PM. There were always more people working there than customers. The dealers must have been told NOT to smile because they all seemed miserable to be working there.", "title": "An overall enjoyable experience, albeit, not perfect.", "helpfulness": 9, "user": "fresh14", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 118037365}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 113, "average": 252, "very good": 662, "terrible": 50, "excellent": 1155}, "aka": "Punta Cana Princess", "slim_ranking": 0.366336633663, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Punta Cana Princess All Suites Resort & Spa in an Adults Resort (18 years old and over) where the fascination of an unforgettable holiday is readily available to our clients. Caribbean style and art of living combine in each of the corners and rooms of this pleasant, high-category holiday resort in Bavaro Beach. Five-Star All Inclusive Hotel, quiet and relaxing, on a heavenly beach; that offers all the services and facilities of our sister hotels Caribe Club and Tropical Princess.The charm of the 263 beautiful Platinum Suites, the seduction of the 7 Honeymoon Suites equipped with a thousand and one details and including a full range of services are completed with the careful and selected menu of our 5 restaurants (main buffet, Italian, Tex-Mex, Mediterranean and Swiss), and a functional snack. Wedding packages available. A full range of daytime leisure activities, extensive gym and spa area, a beautiful bright environment, with a large number of evening activities, next to the famous Princess Tower Casino (located at Bávaro Princess Hotel), and Areito Disco (one of the best in Punta Cana); that add the pleasure of some days of rest and an unforgettable holiday at the famous Bavaro Beach."}