{"user_rating": 4.5, "review_count": 429, "name": "Puripunn Baby Grand Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "If you are travelling to Chiang Mai don't doubt to visit this hotel, it's just amazing! The rooms are very beautiful, clean and spacious. The hotel facilities are very nice, lots of flowers, trees...it seems that you are somehow in the middle of a forest! It is a small hotel, so you won't see the breakfast area crowded or the pool full of people, it's a very relaxing hotel just 5 minutes by tuk-tuk to downtown! Close to the hotel you have restaurants and everything but the hotel has free shuttle to downtown or the night market at many hours so it's not necessary to arrange a taxi!", "title": "Fantastic!", "user": "Lorelaina", "date": "July 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36199735}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Service is exellent, all staff is very helpful and kind!", "title": "Great ,Great ,& Great services", "user": "csiri_99", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35242004}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I was there with my family. It was a wonderful place to stay (not too close to busy areas but not far at all from there-- feels like -- right location) and it is very safe too. The really good part is their service. Staffs are attentive and always be there to help. The owner is real nice , he check on the guests every morning during breakfast. I would say that their service is the charm of this impressive place. We will go back again soon.", "title": "Superb stay", "user": "SingaporeBuena", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35216156}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We spent 4 nights at the Puripunn Baby Grand Boutique Hotel for our honeymoon.", "title": "Superb Boutique Styled Hotel", "user": "Iliketripping", "date": "July 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35057076}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "We were warmly greeted by the wonderful staff and upon our arrival we were given a welcome drink and cold towels while we checked in. We were quite early but fortunately the room was ready and we were taken to our 'baby suite' pretty quickly.", "title": "Oasis of Peace", "user": "PiedPiperLondon", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 34830236}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This hotel is a great example of one that looks perfect on the internet but holds a disappointing surprise when you get there. In this case, it is the location. Literally, it is tucked away down two alleyways and far from the places in town you want to be. It was really a disappointment for us in that we couldn't get out and walk anywhere. It was just too far of a walk and not a walk that we felt totally safe making. Safety concerns were primarily from the narrowness of the alleys and streets to walk on. They are made for one car and not for people.", "title": "Nice hotel stuck in a crummy location", "user": "Gone2TheBeachPhoenix", "date": "June 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 4.0}, "id": 32264375}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "They try to compensate for this by offering a free, hotel tuk tuk to the central part of Chiang Mai. The hotel itself is pretty nice. Not great, but nice. Only the rooms are air conditioned, so once you step out of them, you heat up quickly. The staff was very attentive. The rooms were very elegant and well maintained. To be honest, we felt bad for the staff and the owners of the hotel. They have a great thing going, they are just in an awful location.", "title": "Quaint, tucked away luxury.", "user": "mfenglish", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32160135}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "If we had known about the location going into the trip, it would have made our stay less of a disappointment. It was just such a let down to realize we were stuck down some alleyways in our hotel. It took a couple of days to shake this frustration and accept it for what it was.", "title": "Amazing!", "user": "mct2", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31740364}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Slightly outside of the main section of the city the Puripunn offers a quiet respite from the hustle of central Chiang Mai. Beautiful darkwood rooms and nouveau-antique accents offer a warmth and comfort that is often lost with larger hotels. Free tuk tuk service to the nightmarket and am impressively polite staff make this hotel a must stay for those looking to have an upscale stay in the heart of Northern Thailand.", "title": "Great value, friendly hotel, in easy access to central Chiang Mai.", "helpfulness": 1, "user": "OscarRP", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 28646503}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The best thing about this hotel is its seclusion and quiet location. It's outside central Chiang Mai, in a residential district, but close enough to take a tuk tuk or taxi to all tourist sights and airport. In fact, the hotel offers a complimentary tuk tuk service into central Chiang Mai.", "title": "Maybe small but is very grand!", "helpfulness": 1, "user": "Travelessa", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 28539656}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We could not have been happier with our stay at the Puripunn! Cannot say enough about our fantastic stay! The staff were SO helpful and kind the facility and rooms were beautiful!!! I would highly recommend staying at the Puripunn.", "title": "Fantastic!!!!", "helpfulness": 1, "user": "Teresa025", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 28441137}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "The hotel was fantastic and the staff made it a trip to remember - and one I would be keen to repeat. The room was beautiful, clean, spacious, comfortable and importantly - cooled. The restaurant served excellent food with good friendly service. The staff were extremely helpful in organising day trips and organised a car service with driver for the day for THB1,500. I had a fantastic massage in the spa. The only downside would be that, as a lone female traveller I did not feel comfortable walking to an from the hotel into the city down the narrow streets (not that they felt unsafe - just very quiet). However, the complimentary tuk tuk goes into town frequently and taxis are inexpensive and easily organised.", "title": "Superb Relaxation", "helpfulness": 1, "user": "1234London", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 28377197}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Excellent hotel. A real oasis in Chiang Mai. Service is great, rooms are luxurious, spacious and authentic, bathrooms are massive and impeccably clean. Highly recommended", "title": "Brilliant!", "helpfulness": 1, "user": "Mart75", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28336483}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I would have to agree with some of sloanbj's comments about the hotel although I thought the staff spoke english well enough to communicate. In the pictures it looks like a \"grand\" hotel but then you have to remember that they call it \"baby grand\" and rightly so. It had an old colonial style to the architecture which gave the hotel character and an unique appeal. We travelled with a toddler and a nanny and booked the family suite. Little did we know that the bathroom was attached to one of the rooms so that meant the nanny had to walk through our bedroom to get to the bathroom in the middle of the night.", "title": "Quaint but small", "helpfulness": 2, "user": "asia_rocks", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 26794818}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Other than that the rooms were spacious, with lovely balconies off each room and had everything you needed.", "title": "Capturing the Chiang Mai spirit", "helpfulness": 6, "user": "calinnoru", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25119581}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Private, small, quiet, built in traditional Thai style with friendly staff who were always more than happy to attend to our needs. Part of the appeal of staying here was the location, tucked away down a narrow lane way among the locals. It was quiet and very private, our room had a little porch at the front where we could sit or lie and relax, hardly aware of other guests around us. The room was perfect, very comfortable and very cool and very tastefully decorated. The bed was extremely comfortable and we loved the shower! Free transport into the markets throughout the day, otherwise just a short walk down the lane to the main road where a tuk tuk could be hailed very quickly to take you anywhere local. We were so pleased we didn't stay in one of the bigger hotels closer to the shopping areas. Easy to arrange for drivers to pick you up and the hotel staff will happily organise drivers and tours for you. Will definitely be going back!", "title": "Beautiful boutique hotel tucked in among local Thai neighbourhood..", "user": "tenterfield", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34789847}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We arrived in Chiang Mai on a late evening flight, and got to the hotel at midnight.", "title": "A true Boutique hotel", "user": "sidlulla", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34696158, "likes": {"liked": "— The greenery at the hotel", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We were a bit taken aback while the taxi was getting us to the hotel as it went into a by lane, and then were pleasantly surprised with the hotel tucked away peacefully, nestled in a largely residential area.", "title": "Wonderful, we didn't want to leave!", "user": "lizabb", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34370963}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "Next morning, our surprise was replaced with being glad for being where we were. It is located close enough to the nice parts of Chiang Mai and yet not in a busy, noisy section of the city.", "title": "Wonderful Hospitality in a Beatiful Sanctuary", "user": "hojat", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33229571}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "As for the hotel, it speaks for itself ... very aesthetically designed, very nicely thought through and to me, it truly was an Oasis. We spent a lot of our time running around the city all day, but we REALLY looked forward to getting back to the hotel.", "title": "Magical Oasis", "user": "UCanGetThereFromHere", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32326930}], "location": {"country": "Thailand", "continent": "Asia", "city": "Chiang Mai"}, "stars": 5, "variance": {"poor": 5, "average": 13, "very good": 78, "terrible": 1, "excellent": 332}, "aka": "Hotel Puripunn Baby Grand Boutique", "slim_ranking": 0.0305810397554, "description": "Puripunn Baby Grand Boutique Hotel, an intimate small luxury property with a total of 30 rooms is constructed in a contemporary Lanna- Oriental architectural style inspired by traditional homes found in Chiang Mai during colonial period. The hotel is situated in the midst of one of Chiang Mai's centuries-old communities where ancient Lanna treasures, cultural traditions and way of life have been well-preserved."}