{"user_rating": 5.0, "review_count": 174, "name": "Pyrgos Adrachti", "reviews": [{"rating": 4.0, "title": "Great stay in Meteora", "text": "The hotel itself was clean and the staff was quite helpful in terms of tips on hours for each of the monasteries, suggested routes to drive and to hike in order to see them, etc. Perfect location to walk or drive. The room was clean and as advertised. We did not have a balcony and the room was still a good size. The included breakfast was quite extensive and delicious!", "user": "Alybyzrp", "date": "October 20, 2013", "id": 181734219}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "One small complaint, there was a lack of an overhead hook for the shower head - after spending hours hiking through and up to the monasteries, would have enjoyed simply standing in a shower and getting wet. The shower has great water pressure, but the faucet and shower head are both mounted waist high, meaning you need to maneuver the shower head throughout.", "title": "Glorious Meteora", "user": "Judy T", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181585870}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Another note, we had rented a car during our stay in Greece with a GPS, and the GPS had the address for this hotel pre-programmed in. Win, we thought! And then, it took us to the wrong address. Unfortunately, the address given did not help to clarify so we did have to stop and ask a local shop owner. No fault of the hotel, there were plenty of signs in Kastraki pointing the way - just a beware for GPS units if you rent them!", "title": "The beauty of the Greece's country side.", "user": "Ulysses F", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181147564}, {"rating": 5.0, "title": "Perfect perfect perfect!!!!!", "text": "You are made to feel very welcome by the host, who also recommended a great tavern for dinner in the village. The room, bed and piloows were very comfortable, with views of the mountains. Parking is available and it is an easy walk to the village. Complimentary water is provided as is coffee and tea and breakfast, with the best yogurt I have tasted in Greece. This town is a great location to visit the Meteora and the monasteries. Wifi worked very well.", "user": "Tom N", "date": "October 12, 2013", "id": 180663903}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Everything was perfect. Pyrgos Adrachti is located in a very beautiful place, just beside the great rocks that are one of the trademark of the Meteora region. Reach the monasteries from there are very easy. The hotel is excellent, with a great breakfast. The rooms are cozy and the view is amazing. The owners are the staff of the hotel and they are so friendly and helpfull. Its possible to reach the city of Kalabaka in a short pleasant walk.", "title": "best hotel ever", "user": "driscoll_229", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179860982}], "location": {"country": "Greece", "region": "Thessaly", "continent": "Europe"}, "variance": {"poor": 0, "average": 4, "very good": 21, "terrible": 0, "excellent": 149}, "aka": "Pyrgos Adrachti Hotel", "slim_ranking": 0.142857142857, "description": "Pyrgos Adrachti is set in one of the highest points of the village Kastraki in a quiet amphitheatric complex with a backyard view to the Meteora rocks. From any window or balcony of the hotel our visitors get the chance to view these gigantic rocks, green forests of pine trees as well as almond and walnut trees that have the most unbelievable scent/aroma during the Spring season. All rooms have an essence of wood and rock that co-exists with the surrounding environments and exceptional view to the Meteora rocks, while every room is differently decorated in a special style to accommodate. These romantic spaces are fully equipped with up-to-date facilities and luxuries, such as en-suite facilities, central heating, phone, fridge, air conditioning and access to the Internet. Parking facilities are also available."}