{"user_rating": 2.5, "review_count": 69, "name": "Quality Inn Meadowlands", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Don't understand the negative reviews of this hotel. Our room was excellent, the free breakfast was filling, if overly sweet, like all American breakfasts, but there was cereal, eggs and fruit, which you don't often get in hotel breakfasts. The express bus into New York from the front door was most convenient, $3.10 and 15 minutes and you were in the city one block from Times Square. Our internet keyboard didn't work until we realised it had no batteries - a quick visit to the front desk and that was fixed.", "title": "Perfectly good hotel", "helpfulness": 1, "user": "zebliz", "date": "October 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5934472, "likes": {"liked": "— location, bus transport,", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The deli attached to the hotel had a menu which had to be seen to be believed - 48 oz. steaks, a turkey dinner for 2 which would have fed 6 people and the most enormous cheesecakes I have ever seen. Would certainly stay here again if I ever get to come to New York.", "title": "The worst - do not stay here!!!", "user": "travler99", "date": "September 29, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5892099, "likes": {"liked": "— Nothing!", "disliked": "— Stay away from this hotel"}}, {"rating": 1.0, "title": "creppy hotel", "text": "Rooms are dirty.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5418682}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "Staff is not friendly", "title": "not good", "helpfulness": 2, "user": "davjunk", "date": "March 27, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4736465}, {"rating": 2.0, "title": "ok", "text": "Pool was dirty.", "helpfulness": 5, "user": "BROYTRAVEL", "date": "August 15, 2005", "id": 3767330}, {"rating": 3.0, "title": "Take your pets with you!", "text": "My husband and I, along with our greyhound stayed here for one night, in May. The location is great for visiting NYC. There is a bus directly outside the hotel that takes you to the city. It will drop you off at the NYC bus terminal, which is a HUGE bus station. If you exit this bus station, you are right in the heart of NYC. My husband had business in Lyndhurst, so we chose to stay here, instead of in NYC. We were very pleased that they allowed our greyhound to stay in their hotel. There is no weight limit on pets, just a $100 deposit, that was refunded to us upon check out. Their King Sized bed room was good sized, but the hotel could use some updates. The bed was also a little warped in the center, as this is an older hotel. There was a free continental breakfast with bagels, cereal, juice, fruit, and boiled eggs. We got a good rate at this hotel and mainly chose to stay here because of our pet. There is a Courtyard by Marriott across the street, that is newer, but doesn't allow pets. If you aren't traveling with a pet and can afford it, stay in Times Square. But, we were very appreciative to the Quality Inn for their pet friendly policy and will stay there again if our travels take us to Lyndhurst.", "helpfulness": 15, "user": "AlwaysOnVacation", "date": "June 15, 2004", "id": 2191205}], "location": {"country": "United States", "city": "Lyndhurst"}, "stars": 2, "variance": {"poor": 15, "average": 16, "very good": 11, "terrible": 21, "excellent": 6}, "aka": "Quality Inn Meadowlands Hotel Lyndhurst", "slim_ranking": 1.0}