{"user_rating": 4.0, "review_count": 190, "name": "Quality Suites John Wayne Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I stayed here for three nights while attending performances of the Los Angeles Opera. Although the drive to LA took almost an hour in the afternoon, I felt that the accommodations were worth the journey, since I had a very early flight out from John Wayne airport.", "title": "Reasonable rates, comfortable beds, and cooked breakfast!", "user": "maestrolms", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142722085}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The small suite was very comfortable, with a sleep sofa and large flat-screen TV in the front room, and a very comfortable Queen bed in the bedroom, along with another big TV. There was also a small refrigerator and microwave in the front room, plus a large sink/dressing area in the rear.", "title": "There was nothing wrong", "helpfulness": 1, "user": "RMLNewYork", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142680240}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I was most impressed with the breakfast; in addition to the usual offerings found nowadays at many motels, there was also a separate serving line in which two young ladies cooked up fresh eggs, sausages, bacon, and pancakes.", "title": "Pretty good value.", "user": "Marmott44", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141275756}, {"rating": 5.0, "title": "My Favorite Option in OC", "text": "I thought that this motel was a very good value and will return there if I fly into John Wayne (Orange Country) again.", "user": "JTL61", "date": "September 16, 2012", "id": 140456068}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "A really good value. I paid including tax under $90 per night. The hotel has very easy freeway access - just across the street. Each room has actually two rooms - a living room with a sofa bed, TV, refrigerator, coffee maker with free coffee, a desk and free Wi fi and a second room which had a king sized bed and a TV. The cooked to order breakfast was good plus many other choices. The swimming pool did have kids but a great hotel for traveling with kids. There is a little restaurant called Spoons that is a very short walk away. Similar to a sports bar.", "title": "Family Vacay...", "helpfulness": 1, "user": "heckya", "date": "September 5, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 139511213}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed here for 4 nights while at a conference in Irvine. Family came along for a little vacation. Clean comfortable rooms, A/C is very quite (wife loved that!!!). Beds are comfortable (except for the pullout couch bed, not comfortable at all, my son didn't complain much about it, but an adult would not be able to sleep on it, the matress is paper thin, basically sleeping on springs). Loved how big the suite was, door to bathroom and the door that separates that rooms were thick and sound proof. Good breakfast, great service and hotel staff. Location is central to beach, shopping, close to the District. Airplane traffic not even noticeable. Real gem for the price. The only thing that really bothered me was that the fitness room was being remodeled. So I wasn't able to workout. Wouldn't have been a deal breaker, but would have been nice to know.", "title": "Fun, safe, great experience", "helpfulness": 2, "user": "bfab5", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134745944}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I was pleasantly surprised every time I turned around at this hotel. For the rate I paid (on the hotel website) I can't believe the amenities they offer. They are definitely trying to compete with a bigger, more expensive suite hotel next door... and they are winning. The made-to-order breakfast is fantastic and good luck trying to find that at any other hotel in this price range! The staff is friendly and the property is beautiful with lush landscaping that is well taken care of. Having a true suite with a heavy door that you can close to block out noise from the kids watching TV is fantastic. We felt like we were staying in an apartment for the week!", "title": "Nice little gem", "helpfulness": 2, "user": "rcktgirl05", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133853931}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I had a small problem with the a/c condensation dripping in the bathroom and maintenance came right away to fix it. The beds are incredibly comfortable, even to my picky daughter which is saying a lot. The location is convenient to the freeway but not so close that you hear it at all. We didn't use the pool or spa so I can't really comment on it, but it looked nice. My only complaint is that housekeeping came at 8:00am one morning and I was sleeping (I'm on vacation right?), they tried to come in before I could even get two steps closer to the door. I didn't have the privacy tag in the door because we were planning to leave at about 9, didn't expect housekeeping so early.", "title": "HOTEL IS A GOOD CHOICE", "helpfulness": 2, "user": "ron m", "date": "June 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132808641}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Overall, this is one of the best values I have seen as far as quality and amenities for price paid. We travel a lot, probably 30-50 days a year, and whenever I am in Orange County I will definitely be trying to come back to this hotel.", "title": "So Close But Not There!", "helpfulness": 3, "user": "thedeepdogg21", "date": "June 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 132354432}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Stayed for 7 days last week. Prepaid stay back in Feb before the rates increasede for summer.Had a problem checking in but asked for the manager who took care of us. Nice grounds and comfortable rooms. Booked a business executive king suite that was very comfortable. The cooked breakfast was a definate plus. My wife and I have stayeds here 4 times in the last 10 years due to its ideal location. Close to South Coast Plaza and the airport.", "title": "Safe & Fun- perfect for families!", "helpfulness": 1, "user": "chrissie m", "date": "June 18, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 132266773}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "I've been staying here with my family for 12 years. This is a family vacation tradition. The cook to order breakfast is awesome. You can have pancakes, omeletts, bacon, sausage, cereal and more. It's a great place, great location, and great value.", "title": "Great place, location and value", "helpfulness": 2, "user": "AZMesaFamily", "date": "August 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137129515}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "This is a motel with exterior entrances around a pretty atrium. Hotel Terrace is all hotels from end to end. Many major chains are represented. The suites are well maintained, well appointed with nice furniture, a great internet, and good shower and two TV's. (Only the one in the bedroom was a flat screen.) Parking is awkward and crowded. As others have mentioned, breakfast could be improved with a buffet, rather than waiting in a long line for a skimpy cooked to order breakfast. This is a large property and each time I've stayed almost full. Of the three properties I've visited on Hotel Terrace, (Best Western Plus and Comfort Inn also) this is the nicest and the most professionally operated.", "title": "Pretty close to John Wayne airport, one of the best Quality Inns/Suites", "user": "pklerose", "date": "August 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136535109}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is a very nice hotel - the rooms are quiet and clean and just big enough. The king suite with a pull out sofa bed was perfect for my husband and I and our two kids. At check in we were given a room number and keys but when we went to enter the room it was occupied (luckily nothing tramatizing for my kids was going on in there haha). We went back to the front desk and were courteously given a new room. I was quite concerned that we were given room keys to an occupied room - that is just not okay.", "title": "Nice hotel but could be more secure", "user": "Elizabethysmom", "date": "August 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136404749}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "When we came back that night after going to dinner there was no parking but there were two cars full of thug-ish looking guys tailgating in the hotel parking lot! I don't know if they were guests or just locals hanging out - either way there needs to be security cameras and/or a security gard. We drove around for a while and finally someone left and we parked.", "title": "Good value for families", "user": "frequentflyerUsa", "date": "July 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135933564}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The breakfast is good but crowded. I would suggest they take a look at the Ayers hotel - they also serve a full breakfast but it's buffet style instead of cooked to order. The cook to order breakfast was about a 20 minute wait in line. If you want something quick they do offer a small selection of danishes and donuts, you don't have to wait in line for that.", "title": "A good motel", "user": "Dave R", "date": "July 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135780346}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed here for a week four years ago and loved it so did not hesitate to stay again. This time it was just for one night on a road trip and the pool was a big incentive in the hot summer weather. We loved it just as much as before for all the same reasons. Large rooms, clean and well equipped with coffee maker, fridge and microwave. The same lady is still in charge of the excellent cooked to order breakfast and the pool and hot tub clean and inviting. Free wi-fi and use of a computer and printer was appreciated too and the staff were friendly and professional. It was great to see their standards have been maintained. Hopefully we'll get to stay there again some time.", "title": "Four years on and still a great place to stay", "user": "midgejam", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139434897}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "What should be a nice hotel is not run very well. If you have read any of the other critical reviews on this site, believe them. I made the mistake in not believing, and everything I read came true. My biggest concern was the lack of security and VERY questionable people hanging around the lobby and pool area. We had teenage children with us and they do not need to be encountering these type people, especially when they are not staying at this hotel.", "title": "Disappointing stay", "user": "terandboys", "date": "September 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139429946}, {"rating": 4.0, "title": "\"High Quality\" Quality Inn", "text": "The service at this hotel was sub-par to say the least, both at time of check-in and when notified of non-guests hanging around the grounds.", "user": "A TripAdvisor user", "date": "August 28, 2012", "id": 138686139}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The cook to order breakfast is a great idea, but when it takes in excess of twenty minutes to get through the line, becasue there is not ample help, it ceases to offer a value.", "title": "Lots of bang for your buck!!", "user": "Groucho44", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138145926}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Pass on this hotel and stay at the Embassy Suites next door, or find another hotel all together.", "title": "A little disappointing", "user": "GlobetrekGirl", "date": "August 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137642736}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 16, "average": 22, "very good": 48, "terrible": 12, "excellent": 92}, "aka": "Quality Suites John Wayne Airport Hotel Santa Ana", "slim_ranking": 0.28, "description": "The Quality Suites hotel is an atrium-style, 177 all-suite hotel. Hotel offers a courtesy shuttle to John Wayne Orange County Airport, free wireless Internet access and on-site fitness center."}