{"user_rating": 3.0, "review_count": 53, "name": "Quality Inn & Suites", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "I stayed at the Best Inn on Federal Road in Danbury, CT in August 2005 so I could take my children swimming in Candlewood Lake and the Best Inn hotel indoor pool.", "title": "Nice place to stay if you don't use the indoor pool", "user": "jacal", "date": "November 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4081329}, {"rating": 1.0, "title": "Mmm...cow manure!", "text": "I was recently in town to visit some relatives over Easter. Not only did the scent of cow manure sting my nose everytime I walked out of my room (it's near a dairy), but I could hear the conversation in the next room through the paper thin walls. The breakfast was ok at best. Zephyrhills isnt much of a thrill to begin with, and this certainly did not help.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3437168}, {"rating": 5.0, "title": "Best Place to stay in Zephyrhills", "text": "We attended the Zephyrhills Car Auction & Show in Feb. 2004 for the first time and booked rooms at this new property by Choice Hotels. Everything was fresh, clean and new. Having been back twice (in Nov. 2004 and again for the show last week, we are still impressed with how clean and well-maintained this property is. They have an expanded complimentary breakfast, a fitness room, pool, and vending machines on both the 1st & 2nd floors. The beds and linens are fresh and comfortable, clean bathrooms and plenty of hot water. Manager Jay Jivan is doing an outstanding job here and I highly recommend staying here, whether you are a business traveler or with your family.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3240204}, {"rating": 4.0, "title": "Light, spacious, good breakfast", "text": "We checked in to the Quality Inn after a terrible night at the Best Western. Our room was spacious, high ceilings, very quiet. Beds were fine. Breakfast in the light-filled lobby was very pleasant, with complimentary copies of the Wall Street Journal. Housekeeping was exemplary.", "helpfulness": 6, "user": "364santafeguy", "date": "January 31, 2005", "id": 3102091}, {"rating": 5.0, "title": "Very Elegant, Beautiful and Homely Hotel in Zephyrhills", "text": "I travel a lot for business/pleasure and stay at a lots of hotels around the year. One thing I noticed at this hotel is that it can cater best in the industry to both type of travels. The Guest Service at this hotel is A+++, Room Attendants were very particular in changing all the linens everyday in my room whether I used the second bed or not they will still change it (I've never seen that even at 4star & 5star Hotels). I saw cleanliness and attention to detail everywhere around the hotel. Breakfast was the best. I've stayed at lot of other hotels in the area before but this hotel has the best breakfast. Furthermore, the lady that works at the breakfast bar was very attentive, pleasant, and would bring the newspaper to my table, throughtout my stay every morning. I was pampered and I didn't pay the luxury hotel price either. I would recommend Quality Inn & Suites to anyone and everyone that I know will be going to that area. Its the best I could ask for in Zephyrhills.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 2, 2004", "id": 2615354}, {"rating": 5.0, "title": "Quality Inn & Suites -Excellent", "text": "Our stay at the Quality Inn & Suites in Zephyrhills Florida was excellent. The hotel was spotlessly clean, the staff friendly and more than willing to help. Our room was terrific and we were pleased by the amenities offered at this hotel. I would highly recommend this hotel. First class service all the way.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 19, 2004", "id": 2078403}, {"rating": 4.0, "title": "*Spring Break* April 9-11, 2004", "text": "My girlfriend and I stayed at the Ramada over the Easter 2004 weekend.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 23, 2004", "id": 1832489}, {"rating": 1.0, "title": "Not a Good Choice", "text": "Let me start by saying that anyone looking for a quiet relaxing vacation during the warm months in Lake Havasu BE WARNED!", "helpfulness": 7, "user": "SpartanFan", "date": "March 29, 2004", "id": 1750302}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I stayed at the Quality Inn on the edge of Northampton, MA for 3 nights in early Aug. 2011. My room was on the 2nd floor of the newer addition and had a king bed, and a nice couch with coffee table in a small sitting area. All aspects of the room functioned well, including the a.c. The room was very clean and extremely quiet. I didn't use the pool but it looked lovely. The continental breakfast included several kinds of cereal, waffles one could make, bagels, bread for toasting, and Danish; as well as hard-cooked eggs, yogurt, and two kinds of juice. The breakfast area was well kept up and food was replenished as needed. The people at the front desk were friendly and pleasant.", "title": "excellent motel in northampton", "helpfulness": 1, "user": "midwesternerOhio", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116627943}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "But I guess it's the old saw - location, location, location. This place is reasonably close to downtown Northampton (albeit on the wrong side of the tracks, figuratively speaking). But in most any other small town it would not remotely be considered worth the $150 rate.", "title": "So-so and overpriced.", "user": "Saltimbocca", "date": "August 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 116421116}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Finding a hotel that is both inexpensive and walking distance to downtown Northampton is very difficult. However, the Quality Inn is a 10-15 minute to the shops and restaurants of Main Street in Northampton and rooms rarely go over $150 (the other within walking distance is the $300 a night Hotel Northampton). After reading other Trip Advisor reviews, I called ahead to insure we got a room in the new \"executive section\". When we arrived we realized how imperative it was that we called. Most of the hotel is a run-down drive up motel, with about 75 rooms in a separate building off to the side (known as the executive section). Our room deserved 4 stars; large comfortable beds and pillows and a \"spa-like\" bathroom rivaled hotels costing 5 times as much as this one. However, the hotel did not have central air and the fan was incredibly noisy and the Zenith television was older than I was.", "title": "Overall: fine hotel, although details need improvement", "helpfulness": 4, "user": "achrisNewJersey", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116082525}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Quality Inn Northampton would have gotten 4 stars if it were not for the maids: our room only had one thin bottle of shampoo and conditioner (there were four of us in the room) as well as only one roll of toilet paper and no tissues. After the second day, the maids really got on my nerves. They refused to make one of the beds leaving a note reading \"Personal Item: couldn't make bed\" (we had left a small bag on the bed) and our toilet paper and shampoo was not replaced. Early evening on the second day I called the front desk asking for shampoo, they said it would be right up. We waited over 30 minutes (making us late for dinner), then left the room. When we returned at about 10:00 PM, there was no shampoo. I called again, and 45 minutes later the awaited shampoo arrived. At check-out I brought up the issue of the beds not making the bed, the manager shrugged it off saying \"We train the maids to never touch personal belongings\". I have stayed at numerous hotels around the world and never encountered a problem like this.", "title": "must ask for new section!", "helpfulness": 3, "user": "meatslinger", "date": "July 19, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115553097}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Looking at the positives, if you're in the area for just one night and need to be near downtown Northampton, this hotel can't be beat.", "title": "Roadside motel quality", "helpfulness": 1, "user": "Metwo3", "date": "July 18, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 115499072}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We were a little concerned after reading older reviews but since the latest reviews were very good we booked the hotel. There was nothing we can complain about - everything was great. We stayed in the new building which was clean and quiet and our room was large and very pretty. The staff was friendly and helpful. The location was great - a two minute drive into Northampton - 10 minutes from Amherst. We would definitely stay there again.", "title": "Wonderful visit - just what we wanted", "user": "sgtsusan", "date": "July 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115183508}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "I have stayed there a couple times already and found the rooms to be very clean and the newer building is fantastic! I thought the staff were very attentive, especially the GM who really made me feel welcome each time I visited. I read in a previous comment that it is under new management so, I certainly approve of the change :)", "title": "Friendly, clean, reasonably priced and great location.", "user": "Leah_Fusari", "date": "May 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 109892740}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Leah", "title": "It was comfortable, friendly, clean, and a short walk to town.", "user": "tamooze", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107045763}, {"rating": 3.0, "stay_parameters": "Stayed March 2011", "text": "My husband and I recently stayed for 15 nights at this hotel. We had a very reasonable \"extended stay\" rate for a suite with cooking facilities, a gas fireplace in the living room and a separate bedroom. The rooms were bright, nicely appointed with wooden furniture and the beds were amazingly comfortable. I slept so well there! All the staff are friendly and efficient. The breakfast bar was well stocked and had free local newspapers and the Wall Street Journal. There's hot coffee anytime. There's a pool and small gym. Quiet air-conditioning. People running the place were all so nice .. we were sad to check out! Northampton is a short walk away. It was fun to stay at the Quality Inn & Suites. We would recommend this hotel experience very much.", "title": "Not bad", "user": "NycCapegirl", "date": "March 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 101959864}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Okay, so it's a Quality Inn, not the Ritz Carlton. The young woman at the desk was friendly and helpful, and the room was very clean. We left to go to a concert, and upon our return found our smoke detector battery chirping. I called the desk and they were very apologetic and changed it right away. Breakfast room and breakfast was great. Reasonable price, and suited our needs just fine. Great staff!", "title": "Up-market motel", "helpfulness": 1, "user": "roosky", "date": "October 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 84137901}, {"rating": 2.0, "stay_parameters": "Stayed March 2008", "text": "The hotel is like Lake Havasu City - worth avoiding unless you're on Spring Break!! Very little to see or do. Rooms were distinctly average. The free breakfast was disposable - the food as well as the crockery. Go for the cereal!!", "title": "Distinctly average", "user": "smackerel47", "date": "April 8, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 3.0, "cleanliness": 2.0, "rooms": 2.0, "location": 2.0}, "id": 14889041}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "The only reason we stayed here was our fly-drive forced us to.", "title": "Nice Stay - Spacious", "helpfulness": 1, "user": "arlheiill", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 14103951, "likes": {"liked": "— Clean and Spacious Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed in a King bed suite with our 9 month old. There was plenty of room for him to crawl around. The suites are two adjoining rooms. One room has a pull out couch. The furniture looked relatively new. The bed was extremely comfortable and the room was very clean. At these prices, we will definitely stay here again.", "title": "Ideal Stop Over", "user": "Bliss66", "date": "October 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 10085062}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stopped at this hotel/motel as part of a package on the way to LA, and wasn't sure what to expect as reviews had been pretty bad but it looked like they had done the place up and we were pleasantly surprised. When we got there the hotel was quiet, we had the pool to ourselves which my kids loved - especially as it was over 100 degrees outside. The staff were really helpful, the food in the restaurant was ok, loads of it, and could watch the sun go down over the mountains. We had a great evening in the bar, barman was really friendly. The rooms were fine, coffee making facilities and good choice of tv channels, looked clean too. Only downside was the breakfast on disposable plates.", "title": "Refactored hotel now OK !", "user": "eugenol", "date": "October 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10075806, "likes": {"liked": "— Clean", "disliked": "— Door lock was broken."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Despite very bad critics until 2006 here on TripAdvisor, this hotel seems to have been refactored. Front desk is young and nice, rooms are clean and silent. Definitely a good place on the way from Grand Canyon to San Diego or LA. Free in-room wifi internet.", "title": "Absolutely awful don't stay here", "user": "jennypancake", "date": "November 19, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6153383, "likes": {"liked": "— Dont go to this hotel find another one."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The staff was friendly, room was clean. There was a smell in the hallways and elevators. The carpet needs to be replaced. I have had much cleaner rooms.", "title": "OK for a one night stay", "user": "grillzgirl", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103831827}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This hotel is OK if you just plan to stay one night and spend most of your time on the beach. It is right beside the K&W in North Myrtle Beach.", "title": "This was a wonderful place to stay for one night", "user": "bell730", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 72568645}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The pool is SMALL!!!!!!!", "title": "Sub standard cleanliness", "helpfulness": 1, "user": "Trumpet21", "date": "June 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 67495153}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hotel was really nice. It had nice big fluffy beds.Breakfast was nice also. Even though we didnt get in the pool it looked very small however clean. Staff was nice also. Would stay again if in the North Myrtle Beach area....", "title": "Wonderful Experience", "helpfulness": 1, "user": "Pariz", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45419383}, {"rating": 4.0, "stay_parameters": "Stayed August 2009", "text": "We want to find it by ourselves about good and bad reviews from the web. Yes, we stayed 6 nights and tried/intended on purpose to see if they do their job or not. We found out. The elevator floor of both sides are sticky from day one that we were there. Bed sheets were not changed daily. We pulled Electrical cords away from the wall, just to see if any one does vacuum the floor or not. Took a picture of the location. When we come back. They are still in the same location we left in the morning. Pillows and blanket on the couch are not fold and put away nice and neat, as we left. The air is heavy in the room, stale smell because of the rug is not clean and the moisture in the room is so high. My body is so sticky after you stay in a while with AC on. And the last was unacceptable when we come back from the trip of the day. Our room is unlock. We reported to the cooperate head quarter and complaint in writing......They took 2 nights off just to please us. The service desk is okay. This is our first time that I will not recommend to any one to stay there unless they over haul the cleanliness.", "title": "Nice Stay", "helpfulness": 1, "user": "DarkOzzy1", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37022830}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Stayed here on a beautiful Thursday in June. Got a great deal on Priceline. May have the best air conditioning on Earth. Room 321 was like the frozen tundra. Would definitely stay again. If your looking for fun in the area try the Bottoms Up!!", "title": "Put the Q in Quality", "helpfulness": 1, "user": "RodTumble", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17214333, "likes": {"liked": "— The air conditioning unit was amazing.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Me and my daughter stayed at this hotel it was nice, the staff was very friendly. The rooms were clean it was quiet (which was good). The maid service came by every morning to see if the room needed to be cleaned. There was a continetal breakfast but we never ate it, because we couldn't wait to get to the beach so I can't comment on that. There was one thing the jacuzzi wasn't that hot it was luke warm but other than that everything was nice. We had no problems. Just make sure you do have a car because you just can't walk to everything, you definitely need a car. I did like that everything was nearby like (Wal-mart, CVS, Dollar Tree, Beach Shops, Resturants you just need a car). I would recommend this Hotel to stay at. My time there was good.", "title": "Nice Place, Quiet!!!", "user": "sandydee346", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 17098211, "likes": {"liked": "— Clean, quiet, friendly", "disliked": "— Jacuzzi (wasn't hot enough)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My husband and I recently stayed at the Quality Inn and Suites at North Myrtle Beach and were very well pleased with this hotel. The room was very clean and spacious. We enjoyed the fact that the room had two comfortable chairs in which to watch TV. The free breakfast was plentiful. This motel is located 7 miles from the Tanger Outlet and Colonial Mall. We will be staying here again.", "title": "Wonderful Hotel", "user": "rpmElloree_SC", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13443957, "likes": {"liked": "— Clean"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The ground is cleaner than the beds. The beds were so bad and", "title": "Do not stay here", "helpfulness": 3, "user": "rugratrock", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 8090232, "likes": {"liked": "— Staff", "disliked": "— Dirty"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "dirty .... Smelly ! In the lobby it looks clean, but everyone is fooled!!!", "title": "Can't Complain", "helpfulness": 3, "user": "MDTraveler01", "date": "August 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5573969, "likes": {"liked": "— The price - since we were there only briefly and for a specific purpose", "disliked": "— Lack of food on the premises - No complimentary breakfast as promised"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We had had a long and tiring car journey, one of those days when you feel you cannot travel any further. So many US hotels/motels are a gamble for quality and price so we hoped for something good at the end of a tiring day. We had gone up and down the main highway through Montrose looking for accommodation and spied this property by chance behind McDonalds. We could not wish for more after checking in. A receptionist who was helpful and cheerful, well presented in dress allocated us a room on the third floor. The lovely room was very large, comfy beds and quality llinen and furnishings, which made us feel soooo good having chosen well and at a reasonable cost within our budget.", "title": "A great number of US hotels/motels could learn about quality from this property", "helpfulness": 1, "user": "Hitchiker_bear", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67944506}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I have traveled to Montrose, Colorado for the past 5 years between business and pleasure. I have stayed at several hotels but this hotel will get my business again for the next 5 years! Their gentle caring for the guests, clean, beautiful rooms with microwave and frig. Their workout room, heated indoor pool and whirlpool is all well maintained. Wireless Internet through the facility with NO Problems of connection! We slept like babies in their comfortable bed. We even traveled with our yellow lab who was accepted graciously by all. The price is MORE than REASONABLE. No more Holiday Inn Express for us - Quality Inn & Suites is our Better than Home Sweet Home! Thanks for making our trip enjoyable!", "title": "Better than Home Sweet Home!", "helpfulness": 2, "user": "Sjcates", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61093333}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I enjoyed my stay at Quality Inn, But i come every 2 to 3 weeks to Montrose and can't pay the rates in the sommer months.", "title": "staff is nice , Clean rooms", "helpfulness": 1, "user": "Kathleencsa", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47788479}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "This was a very nice Quality Inn, the staff was helpful and friendly, the room was clean, and I had a gorgeous drive through the mountains south of Montrose to get there.", "title": "Really Nice Quality Inn", "helpfulness": 1, "user": "squareboy001", "date": "December 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22966174, "likes": {"liked": "— Cleanliness", "disliked": "— Not sure about this one"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We had a little difficulty finding the Quality Inn as it is set back from the road and not signposted. Our room was clean and functional. It was a bit compact for the 4 of us - just 2 double beds. However the children enjoyed the pool and my son loved the waffle maker for breakfast. For our dinner we walked to Chilis just along the road and had a good meal. We went to the Black Canyon the following morning before travelling to Telluride.", "title": "Good base for exploring", "helpfulness": 1, "user": "Scottishexiles", "date": "August 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18967963}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel was immaculate. The linens and beds/bedding were top quality, new. The breakfast was great- even had southern-style biscuits and gravy. The service was excellent: heard Linda, the manager, offer to come in from home at night if anything needed attention! The young man at the desk at night (name is unique, may start with K) went above and beyond. Outdoor pool is small, but clean- open seasonally.There is an indoor public hot tub. Can walk to bar at Applebees. Convenient to N.Myrtle beach and Barefoot Landing, 20-30 min. to Myrtle Beach & Broadway at the Beach. It had no bad odor at all and believe me, my nose knows!", "title": "I'd Stay Again, Immaculate", "helpfulness": 1, "user": "Jsdrmn", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 28563363}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "I've stayed at the Quality Inn before and again...the value for the money is fantastic. I was able to score this room on Orbitz for $47.99 a night. This hotel is easily in the $80-$100 mid-priced hotel category.", "title": "Incredible value for the money", "user": "LoudTrain2009", "date": "April 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27386931}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The staff is friendly and everything was in good working order. The best part about the room was the bed. What a fantastic sleeping experience. I honestly can't complain about anything. Probably the only *slightly* annoying experience was that the WiFi was a bit flaky. Sometimes it took a couple minutes to get on, but once you did, you were up and running.", "title": "Never again", "helpfulness": 1, "user": "gotsundrop", "date": "March 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 26100882}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "The hotel is located a couple miles from the beach...but who cares? You can be there in a few minutes and save a bundle over similar hotels that are right on Ocean Boulevard.", "title": "I'd stay again", "user": "mom2farfel", "date": "October 15, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20917568}, {"rating": 1.0, "stay_parameters": "Stayed July 2008", "text": "They need to take down the satisfaction guaranteed sign. I was not at all satisfied. The mattresses may be new, but they are hard, and they do not have extra pillows to give out, so dont ask. Cable reception was poor, and the fridge froze our beverages. The front desk could have cared less. I was not satisfied, but I still pd full price for the jacuzzi suite.", "title": "Don't stay here unless you are nocturnal!!!", "helpfulness": 2, "user": "sharpeiluv94", "date": "July 26, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 4.0, "location": 1.0, "service": 3.0, "rooms": 1.0}, "id": 18287957, "likes": {"liked": "— Nothing!", "disliked": "— Everything!"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "From the wireless to the television...NOTHING WORKED....imagine if you will, spending a night traveling on business in a room where the only channel you could get on the TV was the channel that was advertisement after advertisement about the local town and where the wireless network support had you carrying your laptop around the property to try to see if you could find active wireless internet. After hearing \"try rebooting your computer and give me five minutes for maintenance\" and \"try taking your laptop to another part of the hotel and see if the wireless internet works\" 2 or three times, they sorted it out after about an hour and a half. And the TV? The staff was great and they tried but after trying nearly a dozen remotes the tv was stuck on the advertisement channel. I travel extensively for business in New England and this was my first and last time at this place. Staff says renovation is 'in progress'. It shows....Nice try but for me...never again at this place.", "title": "Be Afraid - Nothing works!!!", "user": "Scotland06058", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 118442369}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Clean quiet wonderful service. Trained friendly professionals providing top-shelf service", "title": "It is a special place product excellent staff wonderful home away from home My compliments to the entire staff", "helpfulness": 1, "user": "Faley H", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118178725}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This was a last minute booking for a one night visit to the area. Super easy to find off the highway. Check-in was ready and waiting. The room (#129) was hysterical -- half was taken up with a king bed and nightstand; the other half by a VERY large platform fitted with a red heart-shaped hot tub. Small but clean w/c with shower, a-c, fridge, micro, coffee maker, TV, and a chair. We both thought the bed was pretty comfortable. Easy parking. Short walk to downtown Northampton. They were completely full, so we had to wait a bit for a table at breakfast, but the sole staffer did a great job replenishing the buffet. Can recommend for quick stays.", "title": "Completely adequate lodging", "helpfulness": 1, "user": "Susang8184", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117722419}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Motel type property but not too noisy. Seems to mainly support Smith College visitors. Earlier reviews were rather scary but looks like a recent renovation dealt with some issues of aging. New \"hotel\" addition has suites but we stayed in motel portion in a renovated room with two double beds. Besides preferring queen beds, we were pleased with what we got. Breakfast was fine with fresh fruit (apples, oranges), continental options, and fresh waffle maker. Good coffee all day and fresh cookies in the evening. They had a small but well-equipped workout room and an indoor pool that seemed fine for families. One day our room was not serviced (perhaps because we had \"do not disturb on door\" while we changed and prepped for the day, but that was only til 1130 am. However, the desk clerk promptly brought us fresh towels and toiletries when we complained.", "title": "Acceptable lodging and very convenient. Recent renovation.", "helpfulness": 1, "user": "MP1000", "date": "September 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117534215}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We had two connecting rooms at the Quality Inn at Northampton, MA (5 in family). This hotel has been Completely Reburbished from top to bottom and is now a very nice place to stay when visiting the Northhampton-Amherst vicinity and the price was attractive. The staff was extremely helpful too.", "title": "A Nice Place....Ignore Old Negative Reviews.", "helpfulness": 2, "user": "wcole67", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116938714}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We stayed here for one night after New Year's. We were pleasantly surprised to find the rooms were quite large with comfly beds. For the price and proximity to the Montrose Airport we thought this was a great deal. The free breakfast even included make your own waffles and fresh fruit. Would definitely recommend if you are looking for clean, comfortable, safe accomodations.", "title": "Pleasantly surprised", "helpfulness": 1, "user": "miamifly", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 13511749, "likes": {"liked": "— Convenience to the Montrose Airport and Ute Museum", "disliked": "— No views but I wasn't expecting any."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Recently stayed at the Quality Inn for a wedding my fiance and I attended in Montrose. This hotel was reasonably priced, and also received Choice Hotel's top service award designation, so we thought it would be a good place to stay.", "title": "Just right", "helpfulness": 1, "user": "valor155", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11971722, "likes": {"liked": "— clean, quiet, and comfortable", "disliked": "— small, cramped bathroom"}}, {"rating": 5.0, "title": "Great place to stay", "text": "Pluses: Nice variety at continental breakfast, several newspapers available to read for free, larger than average room for the price, comfy king bed, indoor pool, nice hot tub!", "helpfulness": 1, "user": "mtnlife", "date": "August 13, 2007", "id": 8407794}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Minuses: Small bathroom, toilet flushed poorly, small sink/mirror area", "title": "Very Noisy!!", "helpfulness": 1, "user": "lafolet3", "date": "August 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 2.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5564655, "likes": {"liked": "— Beautiful room, comfortable bed", "disliked": "— Noise level unacceptable"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Overall: What I'd expect from Quality Inn. A clean, comfortable room at a reasonable price with a few perks like a hot tub. It was just what we needed for 1 night. I really have no complaints. There really isn't anything outstanding here, but I would definitely stay here again under the same circumstances in the future.", "title": "Great Hotel", "helpfulness": 3, "user": "Murrieta1", "date": "August 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3734209}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed here for 4 nights. Check in went smoothly. The room was large, clean and comfortable. The lobby needed updating, but it looked like they were working on that. There is complimentary coffee in the lobby, but, contrary to what I have read on several websites, THERE IS NO \"COMPLIMENTARY BREAKFAST\". If I had any complaint, it would be that they were stingy with the towels. They gave me more when I asked ....... I guess I don't like having to ask. Not a big deal in the overall scheme of things. All in all, it was a good stay. Very reasonably priced ($90 with AAA discount). I would recommend it.", "title": "Worked for us", "helpfulness": 5, "user": "KarenSMichigan", "date": "March 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7186659, "likes": {"liked": "— location was good for us", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I stayed at this hotel for a little R&R...it went beyond and above our expectations. The room was not only clean and but elegantly decorated. Everything was clean, the shower felt great, and the bed was as comfortable as our bed at home. Plenty of linens and extra pillows if you want them. They are stocked in the room, with no need to ask for extra. The free breakfast in the morning was very satisifying. The hotel staff was welcoming and friendly, and helpful with directions. There was no noise in the middle of the night, like some places have. In fact, my husband and I thought we were the only ones there, until the next morning when we ate our breakfast and seen all the people checking-out. The resturant Golden Coral is just next door, and really the best place to eat in this town. We would definitely go back. Our only regret was the weekend wasn't longer so we could have stayed a few more days.", "title": "Great Get Away", "user": "jancoo", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 11235299, "likes": {"liked": "— The comfort of the room", "disliked": "— Nothing, everything met our expections."}}, {"rating": 4.0, "title": "Nice place to stay", "text": "Stayed 3 nights --- March 8 thru 11, 2007. Clean, quiet, and safe. Convenient location.", "user": "Travelhelper", "date": "March 13, 2007", "id": 7153974}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "Just returned from a 4 night stay. My room was quiet, clean and spacious. The place was full of young European sky divers and despite the many empty beer cases evident each morning I never heard any noise at night.", "title": "Clean and Friendly", "user": "MMMBoston", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 6596500}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "The staff went out of their way to help me print some needed paperwork from the internet. The printer in their \"business center\" wasn't working but they graciously let me use the computer and printer in their own office.", "title": "Very disapointing", "helpfulness": 5, "user": "karmi", "date": "February 5, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4416233}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Morning breakfast was decent and in a nice little area right off of the lobby.", "title": "Elegant, Cozy & Friendly", "helpfulness": 3, "user": "cosita76", "date": "June 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3522211}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at this hotel, along with 10 others, during April 2012 as part of a 17 day road trip across GA, NC, SC. By giving the star rating I am not saying the hotel is a 5 star but whether it was clean and value for the money and to an extent we have compared then to the other 10 hotels we stayed at.", "title": "A Little Gem", "helpfulness": 2, "user": "Globe-spanner", "date": "May 4, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 129339602}, {"rating": 2.0, "title": "Would Not Stay Here Again!", "text": "Unlike some others this Quality Inn was more like a traditional hotel hotel were you park as near the reception as possible and take your luggage through the reception to a lift to your room. This felt much safer to us than the motel types were your room door is accessible to all from the street.", "helpfulness": 1, "user": "H A", "date": "January 2, 2012", "id": 122422519}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "On arrival we were allocated room 212 which had one king sized bed rather than 2 queen sized beds. This gave much more space and felt very comfortable.", "title": "Good Price Clean Place Very Nice People", "user": "PeteDodo", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119258833}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "The room was top notch for cleanliness and standard of furnishings. Clean towels and lots of hot water. Fridge, microwave and a small outside pool. This was one of the few places on our trip that had a proper wardrobe.", "title": "Ok for short stay, but not really a vacation stay.", "user": "Cupojoe42", "date": "October 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 118816766}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The included breakfast was pretty good with the offering of real butter and real OJ (both rarities) grits (hate them), waffles, bagels, toast, yoghurt, cereal, HB eggs, fruit, danish, doughnuts tea and coffee. There was a good sized seating area so we did not feel cramped as in most other places.", "title": "Good value, but some drawbacks.", "helpfulness": 1, "user": "EMSwan", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 108875951}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "Stayed on a stop over between San diego and Grand Canyon.", "title": "Noisey, but okay", "helpfulness": 2, "user": "eadeser", "date": "May 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3435632}, {"rating": 3.0, "title": "Good value stopover", "text": "Hotel was okay, room was clean. The main probelm is we were put in a room with the door opeing in the corridor between the fron and back. If you get one of these rooms ask to move. The sound of the road echoes all night long. Other than that it had a basic pool and was a short walk away from London bridge and village (very tacky 6 shops and couple of hot dog stands)", "helpfulness": 2, "user": "EDW", "date": "December 29, 2004", "id": 2961677}, {"rating": 1.0, "title": "Don't stay at the Ramada Inn", "text": "Stayed here for one night on our way from Anaheim to the Grand Canyon. Although the landing and stair areas looked a bit tatty our room was fine and overlooked the swimming pool. We ate both dinner and breakfast in the restaurant. We were very happy with both meals especially as we were given two complimentary breakfasts in our room rate which made this a very good value hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 19, 2004", "id": 2835839}, {"rating": 2.0, "title": "needs a overhaul", "text": "My wife and I travelled to Lake Havasu from Phoenix for the 18th Annual Lake Havasu Float Fly and we stayed at the Ramada Inn for one night.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 18, 2004", "id": 2306343}, {"rating": 3.0, "title": "Headquarters for national collegiate triathlon-April 23", "text": "Although the staff were curteous and helpful the building is in need of a serious rennovation. The towels were thin, the shower head was broken, the room was very sparsely furnished and the TV was only 19\". Worse, the noise from the traffic came right through our walls and door. The gap between the door and jam was so large it let in light from the ouside. At $80/ night it was over priced. I'll stay at the Hampton next year.", "helpfulness": 3, "user": "TripInsider", "date": "April 27, 2004", "id": 1843603}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We are choice privileges members & travel frequently using mainly hotels in this group. This Quality Inn apparently has been chosen #2 in the state & seems to have developed delusions of grandeur as a result. The desk clerk was accommodating but brusque and the rooms were no better than we've come to expect of a Quality Inn. They were clean and adequate but nothing exceptional. We were surprised, however, by their pet policies & charges. They have only recently started accepting pets & are charging $20 +tax per pet (we have 2 small dogs) - the most expensive pet charge we have come across in Choice hotels. You also have to sign a full page policy statement of \"do\"s & \"don't\"s concerning pet behavior. (Feed only on tiled bathroom floor, don't wash pet in the tub, etc) We are responsible pet owners & wouldn't do anything prohibited in the policies anyway but the staff's whole attitude toward pets smacks of paranoia. Just wasn't a comfortable atmosphere all around. Although it is possible to connect to the internet, the connection is not wireless. Would not stay here again.", "title": "Don't book here if you travel with pets", "user": "bc713", "date": "February 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 55046033}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "As a Choice Priveleges member, we've stayed at plenty of hotels in the network and liked them all. But, the front desk clerk that checked us in at this hotel (named \"Don\") was the rudest customer service I've ever experienced! While the hotel it itself was quite nice with plenty of room, high ceilings and a clean room, the service from this one employee made the stay one we'd just assume we'd never experienced. This man was argumentative, condascending and extremely uncooperative throughout his shift. When asked to speak with his superior, he claimed he didn't have one; HE was in charge. We've always received above-average to superior service at the other Choice Hotels and we had assumed this one would be no different. While the remaining hotel staff was absolutely fine, this one employee could easily cause them to lose plenty of repeat business. Room was fine, hallways could be recarpeted, breakfast was minimal, but passable.", "title": "RUDEST FRONT DESK CLERK EVER -- Otherwise fine.", "helpfulness": 1, "user": "raceaddict", "date": "October 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 20849895, "likes": {"liked": "— High ceilings, comfortable room.", "disliked": "— Evening front desk clerk very rude; morning checkout clerk was very cordial."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Less that one employee, it would be easy to give this hotel a much better rating.", "title": "Great Place!", "user": "jalexlou", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17658091}, {"rating": 4.0, "title": "Great hotel for the money", "text": "I stayed for 4 nights and I must say I was impressed. The front desk gentlemen was pleasant and very helpful. The room was big and very clean. I would definitely stay here again. I'm actually booking my next stay for November.", "user": "nmjs", "date": "April 30, 2008", "id": 15517987}, {"rating": 4.0, "title": "Excellent value", "text": "This was a great hotel for the money. The room was clean and comfortable. I stayed for 6 days. The free breakfast was nice. I would stay here again.", "user": "Oliver_Twist064", "date": "February 27, 2008", "id": 13883606}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Location is great, ~10-15 minutes from Santa Cruz and away from perpetual costal overcast. Beyond the location we were not pleased overall. We could hear outside noise at night easily but found we could drown it out by running the fan/cooler, which worked fine for us. Pool water looked green from afar but found to be clean just in need of repair/update which was also acceptable for us. Room (#106) was sufficient enough in size but had terrible humidity every time we came back to it, on the last day we identified areas of probable water damage on wall in bathroom near tub. I did not share with office, I felt they were already aware since the fan/cooler was running upon check in and upon a couple returns from daily excursions.", "title": "Secluded from Santa Cruz but close enough to still play", "helpfulness": 1, "user": "kyp_tk421", "date": "August 25, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117249694}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Nice hotel redwoods growing on property, walking distance to restaurants & the supermarket. State parks nearby with beautiful hiking trails", "title": "nice clean hotel", "user": "loislaneNy/nj", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117009647}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Ladies on reception friendly and helpful.", "title": "Good location", "helpfulness": 1, "user": "collette5", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 107793579}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Room was clean and bright.", "title": "Lovely spot", "helpfulness": 1, "user": "MBTLC2009", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 86394688}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Santa Cruz about 10 miles away. Redwoods forest about 5 miles", "title": "Know before you go...", "helpfulness": 2, "user": "xcluex", "date": "September 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80228426}, {"rating": 1.0, "title": "AVOID THIS HOTEL!!!", "text": "Truly awful hotel.", "helpfulness": 2, "user": "Daffodilpatrol", "date": "October 27, 2006", "id": 6016891}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "Very rude staff on reception and grubby sub-standard rooms.", "title": "Sleep in your car!", "helpfulness": 1, "user": "Cisco_kid_0703", "date": "June 17, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5355959}, {"rating": 1.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "Arrived at 5PM and had to wait 15mins for reception to book in one couple before they (2 staff) would serve us.", "title": "Not for those who need sleep", "helpfulness": 3, "user": "ToandLo", "date": "March 17, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4628909}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "Beds were up on bricks in rooms! Tap did not work in basin.", "title": "the worst hotel in the world", "helpfulness": 3, "user": "SteveKellyuk", "date": "November 20, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 4128234}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "All other hotels on our tour were superb and staff so frriedly but this place was terrible. We could'nt wait to check out which like the check in was very slow", "title": "I will never stay at a Ramada!", "helpfulness": 8, "user": "gobeavs511", "date": "May 20, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 3488709}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This hotel was fine, at the edge of the lovely village of Northampton. We stayed in the inside building, but many rooms are more like a motel with the doors directly outside. Because it was new years we had to sign a waiver about routines, which was funny because we were there for a quiet night away. It was a comfortable walk to town. The heat was off when we arrived which was a bit chilly to start, and there was an odd mold in the caulk of the tub. Continental breakfasts was good.", "title": "Fine hotel at the edge if town", "user": "Leaudemiel", "date": "January 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122949312}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have stayed at the Quality Inn three times now, while visiting our student in college nearby. The rooms are clean and the breakfast is convenient and above average (fresh waffles, hot sausage, yogurt, fruit, cereals, baked goods). There is a small but well maintained workout room that I have used (not crowded) and a pool that seems large enough to do laps. Seems good for people with children, to help them work off some energy. There are some more exclusive properties in downtown Northampton but this motel is a very short drive (could even walk) to Smith College. Also, they have a \"hotel\" addition with suites vs basic rooms. We have not staying in that portion of the hotel.", "title": "Good Quality for the price and location", "user": "MPWAnnapolisW", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122694232}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "When arriving at the Inn, late on Nov 2, 2011, the front desk told us that all reservations were gone and computers down due to the snow storm Oct 29. Not so good news after driving from NYC. But with their manual work, patience and happy faces it was no problem finding our room which was big enough for four people, renovated and clean. We really enjoyed the free breakfast and indoor pool-swimming the following day. Parking facilities are fine. Good for travelers. Downtown Northampton is within walking distance and a nice place to be. We stayed for three nights and could have stayed longer. We definitely recommend it.", "title": "Fantastic manual work by front desk", "helpfulness": 1, "user": "Textiform", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121287490}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "This is a fine hotel for travelers. The room was clean and newly renovated. Half the hotel has motel-style outdoor facing rooms, while the newly renovated section is a multifloot indoor facility. We stayed in the indoor section and thought it was a good night's stay. The indoor pool was very nice and is great if you have kids. I thought the price was a little high ($160 per night), but Northampton is not cheap. Free breakfast was nice and Chaz at the front desk was helpful from booking to checkout. Would definitely stay again.", "title": "Good night stay", "helpfulness": 1, "user": "Mike M", "date": "October 15, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 119338772}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed in the suite and found it to be a large room w/frig & microwave. It was very clean with plenty of towels and a comfy bed.", "title": "Very nice, but a little crowded", "helpfulness": 1, "user": "katt51", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 119073312}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We spent one night there after visiting family in Big Basin Redwoods State Park. We stopped on the way to the park to check in. Even though the room was not ready, the front desk agent gave us our 2 keys so it was EZ to get into our room late that night. The room is beautiful, large flat screen TV, comfortable king size bed. The bathroom was well appointed and decorated. Our only comment is that hand rails in the shower, a place to put the soap and a mat on the tub floor would have provided a safer feeling for us seniors. Otherwise, the stay was perfect. We slept in and missed the breakfast. We would not hesitate to stay there again. Everyone that we encountered was friendly and the grounds were landscaped beautifully.", "title": "Beautiful motel in the tall trees", "user": "dburd", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135103259}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel is in the middle of nowhere - route 9 is winding and the drive was nice getting there. The pool looked green and it was too cold to use anyway.", "title": "Pricey but ok", "helpfulness": 2, "user": "michigan4me2", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132440728}, {"rating": 4.0, "title": "Quality hotel", "text": "The one thing that needs to change is the SMELL. It really smells old. An air freshener would help. We all woke up with sore throats the next morning.", "user": "Socalbosoxfan", "date": "April 16, 2012", "id": 127974189}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Man at the front desk was nice. Breakfast was ok.", "title": "relaxing!", "helpfulness": 1, "user": "Cabasf", "date": "January 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122953440}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We were desperate to find a hotel and this was the ONLY one in our budget. We paid 120.00 a night (including taxes)", "title": "Beautiful getaway", "user": "1realitycheck", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119532688}, {"rating": 5.0, "title": "Surprisingly good", "text": "I am puzzled by the negative reviews....i have only good things to say about this hotel. The exterior looks rather ordinary but the rooms (at least the room i am in) are excellent. All new everything - carpets, bath, linens, curtains, furniture. I wasnt expecting much but i had looked around santa cruz first and was not liking that scene, so came back up the highway to Ben Lomond for a little more serenity. I have never stayed in a Quality Inn before, or if i did it was not memorable. To me the interior of this room resembles a Doubletree or Hilton Garden Inn, maybe a nice La Quinta. For my next work trip to this area i will definitely stay here again.", "user": "Chris K", "date": "August 30, 2012", "id": 138840284}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I am baffled by the comments of other reviewers. This place isn't cute but disgusting, and management didn't seem to care. I stayed here in July 2012 with a group and got to see several rooms. The pool water was blue/yellow. My room had black mold spots all along the inside of the shower curtain. (That's healthy!) The sound was so loud from the small fridge every few hours that we had to unplug it after the first night (or be worken up all night again). One of my travel companions checked into a room that smelled like a mixture of stale cat urine and human body odor. The smell was so bad that she asked to be moved to another room. Management found a room that was open but initially said that they were going to charge her for the \"upgrade\" to a king sized bed. (We laughed, and they backed down.) I saw housekeeping go into the room to check out the smell; she shrugged her shoulders and went back outside. My room was musty but bearable; we kept the bathroom window open during the entire stay. The best part was that for all of this, the hotel charged a rate that was higher than some of the cute (and santiary) B&Bs in Santa Cruz. Nothing about this place looks like the pictures. Don't be fooled. Keep driving.", "title": "Mold on the Shower Curtain / Smelled Like Cat Urine", "helpfulness": 1, "user": "mlm125", "date": "August 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 138120643}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We only stayed one night but the room was very nice with great linens and pillows and a very pretty and pleasant small hotel. We could see a castle from our room across a river and there were lots of roses and other flowers. You could even have a cook-out if you wanted. In fact, someone was having a candlelight dinner and charcoaling out on a picnic area when we got back from dinner. Close enough to Santa Cruz to be worth it. Reasonably priced.", "title": "Very pretty and nice linens!", "user": "ljtexas", "date": "August 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137829808}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Very, very small breakfast room. The parking was kinda crowded but ok.", "title": "GREAT FIND!!", "user": "Piper35", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137569368}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We searched every hotel in Santa Cruz and came across this one because of the price. It's in a cute little town that has everything you would need and is tucked away in the woods. I didn't mind the 10 minute drive to the Boardwalk and would prefer it over staying downtown any day. Not sure what room the other reviewer had, but we had 205 and there was no smell at all. It was a nice clean room with nice beds and a huge TV. They need to invest in microwaves though. A few complaints were NO ICE. The Manager said it would be up and running next time. Also if you're the last one in, you'll have to make a parking spot. It worked but they should do something to fix that. Worked great for our family. We have stayed in some real dumps in Santa Cruz for the same price actually more. Would definitely stay here again.", "title": "nice hotel", "user": "Jeremy M", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136440455}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My husband and I stayed one night at this motel and were quite satisfied. It was much nicer than I expected for an older motor lodge. We just wanted a clean, comfortable place to stay overnight after a day hiking at Big Basin and then dinner at the Tyrolean Inn. We chose the Quality Inn because of the proximity to the Tyrolean Inn and because it is inexpensive.", "title": "Nice for a budget stay in the SC mountains", "helpfulness": 1, "user": "november_moon", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 144589839}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "From the outside, the property is basic, but looks well cared for. Our room was very comfortable and looked like it had been recently redecorated - newer furniture and fixtures, fresh paint, granite counter and shower enclosure, nice curtains with good black-out drapes. The bed was comfortable.", "title": "Fun Stay in the Santa Cruz Mountains", "user": "Tristan017", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144191911}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The motel exceeded our expectations and we were quite pleased with it. That said, there are 2 reasons that I rate this place a 4 rather than a 5:", "title": "If you go into the woods today..", "user": "Robert H", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 142570777}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "1. Hot water - after hiking for several hours at Big Basin, I was really looking forward to a hot shower. The water in the shower was warm, but even at its hotest setting, it was not warm enough to satisfy my sore muscles.", "title": "decent place to stay in the redwoods", "user": "sallychicago", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142423938}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "2. Sound-proofing - being an older motel, the soundproofing isn't up to modern standards. We were on the ground floor with one room above us. We could hear the guests above us whenever they walked anywhere in their room - including getting up for the bathroom in the middle of the night. With the fan on the heater/AC unit on this was much less noticable, so we kept the fan running. I would recommend that guests request upstairs rooms if possible to avoid the overhead noise.", "title": "why stay in santa cruz?", "helpfulness": 1, "user": "glitteredshoes", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139383596}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed for one night which was a pleasent experience. Rooms are standard but clean and staff was friendly. Very nice breakfast was included in the rate. Breakfast is more than the regular donut and coffee as it included scrambled eggs and more. Hotel is located close to many restaurants and fast food joints like McDonalds.", "title": "Nice hotel, clean rooms, convenient location", "helpfulness": 1, "user": "Mano40", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114722714}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I'm rating this hotel as compared to other economy hotels of this type.", "title": "Good Basic Hotel", "helpfulness": 3, "user": "cafcolonel", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 93027084}, {"rating": 1.0, "title": "Not a nice stay", "text": "The hotel was clean, a basic breakfast is provided, and the work staff were friendly to us. We had flown in, but had arranged for a pick up earlier, so it's best advised to let them know ahead of time if you are going to need a ride from the airport. There's a McDonalds, Sonic, Denny's, and a supermarket right nearby, and I believe even more withing blocks. They have free internet, and I had no difficulty connecting in my room through the wireless. As someone previously noted, this is Montrose. I will consider this hotel during our next business trip.", "helpfulness": 3, "user": "seniormsu", "date": "October 28, 2010", "id": 85162360}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I stayed 2 nights with my 2 small dogs. I don't know who was running the motel, but everyone seemed to be bossy. Right away I was told to not let my dogs bark as if they had. When I brought my dogs in after a walk in the evening, there were 2 men and a woman filling up the guest chairs in the lobby. The man shouted to me \"Is that your dog? Do not let him bark! A dog has been barking.\" Well, guilty before proved innocent. Hey, this is America. My dogs do not bark, otherwise I would leave then at home.", "title": "Nice Enough for this chain hotel", "helpfulness": 2, "user": "cshager", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79834064}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The computer hardly worked and no one helped with it. There were noisy children running around the lobby and breakfast room, I think the manager's family.", "title": "Typical average motel", "helpfulness": 1, "user": "texgal50", "date": "July 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 70205789}], "location": {"country": "United States", "city": "Danbury"}, "stars": 2, "variance": {"poor": 9, "average": 13, "very good": 15, "terrible": 9, "excellent": 7}, "aka": "Quality Hotel Danbury", "slim_ranking": 0.866666666667, "description": "Complimentary Hot Breakfast, Free WiFi , All Rooms with Microwave and Refrigerator, Indoor Heated Pool , Spacious Rooms."}