{"user_rating": 4.0, "review_count": 82, "name": "Quality Inn and Suites Mount Dora", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel overlooks a small lake, which provides a very pretty view. The property is right on Rt 441, just a few minutes from downtown Mt. Dora.", "title": "Good value and clean rooms", "user": "dohligee", "date": "November 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120507052}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Rooms are large, and have a microwave & mini fridge, which is very convenient. Our room was clean and well-stocked, about what you'd expect from a Quality Inn.", "title": "BRING YOUR LYSOL", "helpfulness": 2, "user": "joyce w", "date": "November 6, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "service": 1.0}, "id": 120228126}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Breakfast was included with the room - there was a very limited selection of food items, but the coffee was good and plentiful. Staff was very friendly.", "title": "Nice view, clean pool, excellent breakfast, cute town", "helpfulness": 1, "user": "adventuretraveler090", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119998513}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We got a great deal on the room rate, and will definitely stay here again.", "title": "Will stay there again", "user": "MadelynGrace", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 119788100}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "They could give you a smoker's room even if you didn't request it. relocation room was full of spiders & webs. Complained to owener he himself promised to clean it, but was a no show. Bed spreads were dirty and had burn holes. Place had ants inside and out. This is a mockery of the word QUALITY!", "title": "Taken advantage of and over-charged", "helpfulness": 1, "user": "JESS8787", "date": "October 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 119693748}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I recently stayed at this hotel for a 4-day training. It was in the perfect location, which made it very easy for me. I loved the lake being right there and the overall appearance was fine. The staff was nice enough and helpful (I had to add another night to my stay and they made it very easy for me). My room was nice enough from the beds up - just on the edge of needing a major 'face-lift' ... shabby without the chic, but felt clean. They have little fridges, which was great for me staying there for 4 nights. The bed was clean, neat and comfortable. No sign of bed bugs - whew! (that was the first thing I checked!). BUT, the carpet was horrible - VERY in need of replacement...maybe they've done that in other rooms, but not mine. I felt like I couldn't walk on the floor barefoot - yikes! (I got extra towels and laid them on the floor like area rugs!) The other thing that was a bit disturbing, was that I caught sight of coachroach-ish looking bugs that scurried pretty quickly about 3 times! (Hey, it's Florida, right?! bugs abound!) I didn't call the staff because I didn't want some toxic spray while i was occupying the room.", "title": "Great location - don't look at the floor!", "helpfulness": 2, "user": "Ms_Traveler113", "date": "February 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 97829947}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "All in all, I settled in and tried not to look at the floor - pretty good for me because I'm a bit of a neat/clean freak! The bathroom (& bathtub) was clean and the shower curtain seemed new. Can't help anyone on the breakfast/food service - I bought my own food to eat healthier and kept it in the fridge which was great for me!", "title": "Excellent choice on price and quality", "helpfulness": 1, "user": "DavidMoretoninMarsh", "date": "November 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88098991}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "I guess I would recommend it, but STRONGLY recommend EVERYONE tell them to REPLACE THE CARPET ASAP!!!", "title": "Good value; will stay here again", "helpfulness": 1, "user": "FloridaKeepcool", "date": "May 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 63370960}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "For the price this was a very good place to stay to break a journey or to visit Mt Dora, the room was clean and the hotel overlooks the lake which is nice. the buffet style breakfast was good and the staff helpful and friendly.", "title": "son's graduation and leisure pleasant surprise", "helpfulness": 1, "user": "sherrylou57", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63231485}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Ditto to previous positive reviews. Great rate (<$60), clean room, sufficient breakfast. Having coffee on the deck over the lake in the early morning was nice. Quick drive to Mount Dora's antique shops. Will definitely stay here again.", "title": "First night of road trip", "helpfulness": 1, "user": "AngelaG", "date": "May 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 63030817}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We decided late to visit Mt. Dora again.The first time we stayed at the Hampton Inn & liked it, but it was Extravagaza Weekend in Mt. Dora & we were lucky to get a room at the Quality Inn because the Hampton Inn was sold out.I really do not want to compare it to the Hampton Inn because they are different type of properties, but I feel I must compare a bit. The size of the room (it was a suite) was better than the room we had at the Hampton Inn, but the furnishings were very outdated. We prefer a hotel with a hallway rather than an outside entrance, & the Quality Inn has only outside access. Our room faced the lake & it was very pretty. We left at 10 AM to explore the antique mart & came back to the room at 3 & the room had not be cleaned yet. The front desk's answer was that they would \"get to it\" but were very busy. I told them to just bring towels & a light bulb (we had requested a bulb in the morning & it hadn't come by 3) & would straighten the room myself. Breakfast ends at 9:30 & for a weekend we felt that was too early to close up.The room has a microwave, small refigerator & a safe, which we felt are 3 positives.The bottom line is that if the Hampton Inn is sold out we would go back to the Quality Inn but our expectations would be lower this time & we wouldn't be disappointed.We listened to the advice of others posting here & we did bring our own pillows! The bed was very comfortable, no lumps.", "title": "Adequate Hotel", "user": "gayler104", "date": "February 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124877001}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The room was very nice and big. Scenic, overlooking a lake. Bed and pillows were very comfy. Friendly front desk.", "title": "Nice room overlooking lake", "helpfulness": 3, "user": "funnyfeet2", "date": "January 18, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 123267755}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at this hotel October 31, 2011. The hotel was extremely clean. Very good for exploring Mount Dora. The pillows are very small though, but that was remedied by doubling up on the pillows. Overall, the room was tidy, bathroom was clean. The hotel staff was extremely extremely friendly and helpful. We stayed one night, but wished we could have stayed more! The only reason why this hotel got a 4 star instead of 5 star is because the pillows were lumpy and the size of a throw pillow. That seems to be the standard on all Choice Hotels, so if you have back issues, or like the size of a normal pillow, I'd recommend bringing your own.", "title": "Very Good Hotel!", "helpfulness": 2, "user": "ndmjax78", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122000379}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Tip: Bring your own pillow.", "title": "Great location, great value!", "helpfulness": 3, "user": "Mingercat8", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121171700}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We stayed at the Quality Inn this past weekend and very much enjoyed our stay. The property is at a great location for the area. We visited Mt. Dora, Eustis and some of the springs in the area. The hotel personnel were kind and accommodating. The rooms were clean, updated and comfortable. The rugs, linens and fixtures were all spotless and updated. We stayed in a suite which had two wide screen TV's (one in the bedroom and one in the sitting area) which worked out great for the kids when they wanted to stay up late. The room also had a microwave and a refrigerator which allowed us to keep snacks and drinks. A generous continental breakfast is served in the morning by a very nice lady who hustled to keep the tables and area spotless. The hotel is faces a large lake with two gazebos and surrounded in the back by some woods so even though it's located on a major thoroughfare, you don't feel like you are staying on a roadside. Plenty of parking at all hours of the day and truly, the daily rate could not be beat.", "title": "Mount Dora Florida Gem", "user": "travelwisherFlorida", "date": "November 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120745616}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "If all you're looking for is a reasonably clean, inexpensive place to stay, the Quality Inn is a good choice. The location is very convenient to Mount Dora, Eustis and Tavares. Ask for a room on the lake side -- the view is very good, especially at sunset, and you won't get any noise from the bar next door. The place shows some wear and tear, and the maintenance could be better. My room had two pieces of upholstered furniture, and both had conspicuous stains on the cushions. The food offered for the free breakfast didn't seem especially fresh. But the price was very good, and, aside from the stained furniture, the place was clean enough to feel comfortable in.", "title": "No frills, good value", "user": "darneke", "date": "September 13, 2011", "detail_rating": {"cleanliness": 2.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 118085245}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Staff was more than helpful, breakfast a real treat. Will stay here again.", "title": "Would certainly return to this clean, friendly, well located inn.", "user": "judy c", "date": "September 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117825085}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Compared to the horrors at The Lakeside Inn this place was the Taj Mahal -so to speak.", "title": "...the Taj Mahal -so to speak", "user": "thepinion", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115942892}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I had reservations at Lakeside but due to the appalling conditions I found upon arrival, I left immediately. Thankfully, this Quality Inn was close by and had a vacancy.", "title": "Clean room", "user": "MarksHonestOpinion", "date": "July 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115321258}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The decor is standard Quality Inn, but I expected nothing more.", "title": "Quality Inn - Wonderful Surprise", "helpfulness": 2, "user": "Buccaneergirl", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 100834199}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 3, "average": 18, "very good": 32, "terrible": 6, "excellent": 23}, "aka": "Quality Inn And Suites Mount Dora Hotel", "slim_ranking": 0.4, "description": "Lakeside hotel located near shopping and dining close to Mt. Dora, Eustis and Tavares Florida. New Flat screen TVs in every room. Two rooms suites available that include micro fridge 2 TVs pull out sofa sleeper for one and back porch or private balcony with a view of Lake Woodward."}