{"user_rating": 4.0, "review_count": 83, "name": "Quality Hotel on Olive", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Convenient location, friendly staff, very good room, excellent food, even a free internet terminal in the lobby. Very hard to fault. The best motel in 13 nights on the road, by some margin.", "title": "Near perfect", "helpfulness": 3, "user": "Packhorse", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15610554, "likes": {"liked": "— Restaurant", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Modern and stylish", "text": "This would be one of the best properties in the Albury/Wodonga region and the room price reflects that. It is opposite a very popular club and is a short walk to the main street. The rooms are modern and the decor is stylish. The bathrooms are new, clean and large. In my room their was a well stocked mini-bar, iron, internet connection, desk, sofa and a comfortable double bed. The only real negative I could find was that the walls are far from sound proof.", "helpfulness": 5, "user": "rockriva", "date": "October 13, 2007", "id": 10073088}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Positives: Friendly staff from the moment we arrived . Inexpensive hotel that exceeded our expectations.for a smallish country town. Welcomed with fresh milk for our tea and coffee instead of the horrid long life stuff Isually get at higher rated establishments. Room large and airy. I never inspect the corners for mould and fluff, so if it's there I did not see it. Bed queen sized, very comfy, clean, choice of pillows but the ones on the bed were just fine. Bathroom well lit especially for putting on make up. Shower hot and strong. Temp control worked well and we were comfortable all stay. Very quiet. Free streaming internet that worked well. Fridge, tea and coffee making facilities, iron and ironning board (base of iron clean)", "title": "Country Hospitality", "helpfulness": 6, "user": "Tuttsy", "date": "June 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7851206, "likes": {"liked": "— location and comfort", "disliked": "— no porter"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "I arrived here with my 8yo son after a trip from Canberra where we'd stayed at a rowdy hotel the night before. As we stepped into the lift, two men were taking a small bar fridge to the 3rd floor and joking with a third man about having a party. \"Are they having a party?\" I asked this third man after they'd left. \"Not in my hotel, they're not\", he replied. This turned out to be the manager; he warmly introduced himself and told me reception was available 24/7 to deal with any problems, and I shouldn't hesitate to ring if we were disturbed in the night.", "title": "Absolutely brilliant place to stay, can't fault it, restaurant superb", "user": "Thomidog", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82821244}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "This was music to my ears. We stayed in a room on the 4th floor with a queen bed and one single; the room was the right size for its bedding, the bathroom was great (walk-in shower, so no messing about with a clingy shower curtain) water pressure good - but people with young children will need to take care as the hot water temperature is scalding hot on its own rather than being limited to 50C. The furnishings are modern without being overwhelmingly or intimidatingly so; the colour scheme warm and inviting. The curtains are lined with proper blockout so the heat stays in and the sun doesn't wake you up. The carpets, to be sure, are probably nearing replacement stage - but this is the kind of investment that a GFC can delay by a year or two until things pick up again. The staff were uniformly authentically friendly, happy, gracious and obliging. I had my own wireless internet access so can't speak for that; but the TV was easy to work, the heater very efficient, the beds and bedding very comfortable. There's a big, free car park. So far, so good.", "title": "Clean room, but old and very small.", "user": "The0G", "date": "October 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 82282913}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "What really sets this place head and shoulders above the rest however is its restaurant - the setting and the food are superb, so much so that I'd recommend you eat there whether or not you're staying at the hotel. It is no dearer to get room service for breakfast (you select and pay for each item individually, rather than there being a set rate for the whole meal - and then it's $5 to have it brought to your room) than it is to go downstairs to the restaurant to eat, and the food is simply divine - I understand the chef is female and very dedicated. We stayed here both going down and returning from the Great Ocean Drive and on the second occasion had dinner in our rooms - dessert was \"Tunisian Citrus Samosas with Almond Ice-Cream and Citrus Salad\" - it was out of this world! All the food was good. Proper muesli for breakfast. The setting is lovely as they have a small and very pretty pool in the courtyard that the resturant looks out on. The staff were friendly and engaging with my child and offered paper and pencils for colouring in. There are newspapers available, unlimited coffee... what more could you want?", "title": "Friendly staff, great meal at restuarant.", "user": "Mark255100", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62635636}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Having travelled quite a lot recently I can confidently say this place out-performs many places that cost up to twice as much. It may not look like much from the outside - being an unprepossessing four story white brick building - but it's brilliant - the best place I've stayed in for a long time. Don't miss it.", "title": "Very nice", "user": "Resque", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57044473}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "When we arrived, reception was modern, staff friendly, and we were given 'real' milk for a cuppa which was nice, and crayons and colouring for the kids.", "title": "Really Pleasing Stay", "user": "welby11", "date": "December 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23005696, "likes": {"liked": "— Free Unlimited Internet", "disliked": "— Nothing"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 5, "average": 10, "very good": 46, "terrible": 1, "excellent": 21}, "aka": "Quality Inn Albury", "slim_ranking": 0.41935483871, "description": "Attractive 5-story Motel near city center."}