{"user_rating": 4.0, "review_count": 37, "name": "Quality Resort Inlander Mildura", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This \"motel\" was comfortable, and clean but certainly not of a resort standard. It is most suited to families with children, not for a romantic getaway. There was not enough staff over the new year period to run a bar service to the pool, neither was there a snack / light meals menu. The only restaurant there was totally booked out and quite expensive, perhaps inaccessible to the family clientele. We found dirty nappies outside our door, drunk non-guests loitering near our room, and we had to battle with a very faulty doorknob to enter our room. Overall, we thought we would have been better off trying the Grand Hotel for an equivalent price.", "title": "motel with add ons, not a resort", "helpfulness": 3, "user": "xelar8", "date": "January 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 12342938, "likes": {"liked": "— comfortable room", "disliked": "— motel facilities for resort prices"}}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Mildura"}, "stars": 3.5, "variance": {"poor": 4, "average": 8, "very good": 17, "terrible": 0, "excellent": 8}, "slim_ranking": 0.291666666667, "description": "The Quality Resort Inlander Mildura is located just a half day away from Adelaide and Melbourne yet still within driving distance from Sydney. The provincial city of Mildura is situated near the picturesque banks of the Murray River. We are in close proximity to wineries, Sunraysia's premier golf course, Paddle Steamers and much more. The Quality Resort Inlander Mildura is situated near the picturesque banks of the Murray River, in the provincial city of Mildura. It is in close proximity to wineries, an international standard golf course, river cruising Paddle Steamers and much more. The Mildura Inlander is set in beautifully landscaped oasis style gardens, featuring waterfalls, children's playground, tennis courts and a large salt chlorinated pool. This family-friendly resort is an ideal place for a laid back vacation in the city of Mildura."}