{"user_rating": 4.0, "review_count": 55, "name": "Quarters on Florida", "reviews": [{"rating": 5.0, "title": "Just great", "text": "Stayed in Quarters, Florida Rd (there's a sister hotel a few blocks away). Nice clean rooms, in a lovely old colonial house. Staff were exceptionally pleasant and helpful. Situation is convenient - 5-10 mins drive from downturn, BUT as opposed to downtown Florida Rd is completely safe to walk along deciding which restaurant/bar you want to visit (I recommend Simply Fish). In fact the biggest danger is likely to be some brainless Durban rich kid showing off how fast his Porsche can go up and down the street - the numerous police don't seem interested in doing anything about that. V close to the new football stadium for next year's World Cup - HOWEVER the global sports agencies have already taken options every hotel room the city, inc here. Durban couldn't even cope with the crowd for the Lions game and that was only 40,000 !!", "user": "Bluftut", "date": "July 15, 2009", "id": 34814692}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We visited South Africa recently for a wedding, and after reading previous reviews on trip advisor decided to book with The Quarters. There was a warm welcome from staff when we arrived, they were very helpful and were able to call us taxi's to wherever we needed to go and advised us of where we could go safely, on foot, from the hotel. The breakfast each morning was perfect, and prepared to a far higher standard than any other hotel I have ever stayed in. We had one evening meal in the hotel, which was very good, and as with breakfast, the serving staff were friendly and attentive.", "title": "Beautiful hotel.", "user": "Beth_2209", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 25334640}, {"rating": 4.0, "title": "Personal Touch", "text": "While we were staying, there were some upgrades to the television service, which caused some disruption to the signal, but did improve the service once completed.", "helpfulness": 1, "user": "Africa_Travels", "date": "July 8, 2008", "id": 17647732}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "All in all an excellent hotel and I would recommend to any-one!", "title": "Durban's best kept secret-pleasant surprise!", "helpfulness": 1, "user": "Gee66", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16167620, "likes": {"liked": "— Quiet neighbourhood, pleasant and cheerful staff and great food and service!", "disliked": "— That i couldnt stay much longer"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Have stayed at the Quarters at least a dozen times and keep coming back. Wonderful property in the heart of the night life area on Florida Road. Just walk out of the door and there are dozens of restaurants, bars and nightspots. The four Victorian buildings are lovingly restored, comfortable and spacious. What makes the difference though is the (overwhelmingly female) staff. It really makes you feel welcome every time. It is a great place to stay if you are on business in Durban and prefer some atmosphere as opposed to the large international chain hotels.", "title": "Beautiful", "user": "Garnant", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8739032, "likes": {"liked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The Quarters Hotel was very nice. The rooms are clean and well decorated, although on the smaller side. The staff is exceptionally pleasant. The neighborhood is safe during the day, but I would recommend taking a taxi at night.", "title": "Lovely hotel", "user": "NYCBrooklyn", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7614404}, {"rating": 2.0, "title": "Not crazy about Quarters", "text": "The restaurant has excellent food. Breakfast is included in the rate, and it is really nice – fresh juices and fruit, yogurt, cereals, pastries, cheeses, as well as eggs, French toast, etc. We ate dinner twice at the restaurant because it was so delicious.", "helpfulness": 1, "user": "suehoff", "date": "March 5, 2007", "id": 6917279}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We stayed recently at Quarters in large part because Trip Advisor has proved so reliable in past trips. We had just come from An African Villa in Cape Town which was wonderful. Durban was hot and humid and our room was hot and dark. Our A/C unit was not working but the staff kept telling us that it was user error. When at 10 I asked them to please change rooms for us they said that the hotel was full, however 20 mins later when I visited the lobby to at least get a fan, a room came open. We found the location to be noisy, crowded, and just not a very desireable hotel. At best without the A/C problem I would rate it just so-so.", "title": "Loved the Quarters.", "helpfulness": 4, "user": "let28", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6138875, "likes": {"liked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I'm always using tripadvisor so decided to write back about my experience. I LOVED the Quarters. Great service - can you believe they packed my breakfast b/c my flight was very early in the morning? Never heard of anything like that. The room is very comfortable, bathroom is excellent. Only one issue: was staying with a friend and there are no rooms with two beds. Ok! They provided an extra single bed. The restaurant is FANTASTIC. Service is more than great. I needed to buy a bottle of a specific wine for my father and they located one place that had this wine and took care of everything for me. I ended up buying a whole box of this rare wine b/c they found it for me. Location, location, location. Very near very good restaurants and safe place to walk around. All my friends staying in the area where most hotels are were regreting their choice (this was a big conference) when they saw the Quarters. If you go to Durban, stay at the Quarters Hotel.", "title": "Clean and the Restaurant was fantastic", "helpfulness": 2, "user": "kimberlina", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5729191}, {"rating": 4.0, "stay_parameters": "Stayed October 2003", "text": "We loved the Quarters hotel. The rooms were very clean and the staff was helpful.", "title": "Very comfortable hotel", "helpfulness": 5, "user": "Ann F", "date": "November 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4121784}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "I live in Durban and have not physically slept over at Quarters - but have been there many a time and have checked the rooms. I would much prefer a new tourist to South Africa to experience this quaint hotel than end up in one of the Marine Parade Hotels or on our Durban Beach front! Like every town has its horrible areas the two above are the only ones I would like tourists to avoid, as my rule of thumb is dont send people to areas you do not wish to visit. The rest of Durbs and surrounding areas is awesome.", "title": "Great Tourist location", "helpfulness": 17, "user": "Calzan", "date": "October 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4038995}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 4, "variance": {"poor": 4, "average": 10, "very good": 19, "terrible": 3, "excellent": 19}, "aka": "Quarters Hotel Durban", "slim_ranking": 0.279069767442}