{"user_rating": 5.0, "review_count": 309, "name": "Queenstown Park Hotel", "reviews": [{"rating": 5.0, "title": "Wonderful boutique hotel in a great location", "text": "I spent 2 nights here in November 2011 and wish I'd had time to stay longer. The rooms are modern, spacious and well-equipped. The breakfast is delicious with a wide-ranging choice. The whole team of staff, managed by John and Donna, are extremely helpful, friendly and well-informed with the ability to provide a wealth of information about the local area and activities (of which there are many). The location, at the foot of the mountains, is ideal with just a short walk into the centre of town. This is everything a boutique hotel should be so it's difficult to pick an outstanding feature but if pushed it's the early evening happy hour where complimentary wine and canapes are served each day providing the opportunity to mingle with other guests. Can't wait to return!!", "user": "JustinDavies", "date": "January 3, 2012", "id": 122450176}, {"rating": 5.0, "title": "Amazing rooms, amazing hospitality!", "text": "I stayed at the park boutique hotel for four nights during the ski season and I have to say this was the best service I have received at any hotel. The owners took the time and effort to remember my name and were eager to accommodate any request. I found the staff to be very genuine and well informed. The rooms were very comfortable, stylish and well appointed. I could not imagine a better experience with a hotel and their staff.", "user": "christinakm", "date": "January 3, 2012", "id": 122447219}, {"rating": 5.0, "title": "A boutique hotel as it should be", "text": "The hotel is very conveniently located, close to the centre but far enough from the noise. At check-in John offered a glass of wine and canapes - certainly the first time I've ever seen this. I don't want to repeat other reviewers' opinion as I fully agree with them, everything was just perfect. The room had a very interesting modern design, the bathroom is separated from the room by a glass wall (there is also a curtain which can be drawn along the wall for privacy), the shower has glass roof, the small kitchen is well equipped.", "user": "nomad2212", "date": "January 2, 2012", "id": 122423369}, {"rating": 5.0, "title": "Excellent Boutique Hotel, airy, exceedingly comfortable and central.", "text": "If I ever get back to Queenstown this will be the hotel for me.", "user": "Spriosan", "date": "January 1, 2012", "id": 122381516}, {"rating": 4.0, "title": "Nice hotel - a shame about the blinds..", "text": "Lovely bright rooms, mine faced the park so it was lovely to watch the paragliders come gliding down. Compact but complete mini-mini kitchenette Complimentary Wi Fi. Quite the nicest accommodation in NZ to date. Nice walks and still adjacent to the centre of Queenstown", "user": "Prudence2", "date": "January 1, 2012", "id": 122346628}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This hotel is perfectely located next to a park, close to the gondola station and the center. John is a perfect host. He receives you on first name basis with a handshake, before giving you a full brief on house, room and the town, with interest for your personal gusto. Even without knowing your schedule, he will keep an eye on flight interruptions to make sure his hosts will safely get out. This is exactly the kind of value added that the exacting customer may aspire to.", "title": "Beautiful boutique hotel", "helpfulness": 1, "user": "Travellersfromswitzerland", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126371690}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We had room 11 which was perfect with its park view from a comfortable bed. Very nice the free standing bath in an extension, seperate from anything more down to earth. The elevator from the underground parking was just nearby. The perfect stay - hope to make it once more!", "title": "awesome boutique hotel", "helpfulness": 1, "user": "jkauf1979", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126363824}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in the tower suite for 3 nights and loved the rooms, but what really makes the hotel is the staff. They were awesome. I was traveling with my wife's parents who are not big meat eaters. They recommended 3 different restaurants that were fish predominately, made reservations for us, and the food was wonderful.", "title": "A wonderful experience", "user": "Helen H", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126132622}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "They sent us on an awesome little hike called Bob's cove that was one of the highlights of our trip and was in no guidebooks.", "title": "Don't stay anywhere else", "helpfulness": 2, "user": "Rover10", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125329405}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The only downside that i can see is the hotel seems to be on the route a lot of people take too and from the bars in town. i woke once or twice to people talking loudly/drunkenly as they headed home. I am a light sleeper though.", "title": "Best time in Queenstown @ Queenstown Park", "user": "Catherine I", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125250946}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "This is not a bed and breakfast nor is it your Four Seasons. This is a luxury 5 star boutique hotel, located steps (2 minute walk) from the heart of Queenstown. John and Donna's brilliance shows in the small details that make it such a memorable and comfortable stay. Enjoy the happy hour between 6 and 7 where you get to sample the homemade canapés and local wines of the region.", "title": "Boutique and luxury", "user": "Dorothy w", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124840560}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The rooms are modern and spacious. The lighting was strategically thought out, plenty of electrical outlets, the shower has a strong jet, the closet space is located on the side panel of the TV console.", "title": "Wine and Rugby", "user": "roxann h", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124638695}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Watch the para-gliders land right beside the hotel on the rugby field. John and Donna knows everyone by name and they take a special effort to cater to your every needs.", "title": "Totally fabulous", "helpfulness": 1, "user": "annieb107", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124460583}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Definitely the hotel I will be staying at the next time I visit Queenstown.", "title": "Well worth a stay!", "user": "Matthew W", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124419263}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There were no lake views from my room but the other amenities made up for that.", "title": "Beautiful modern hotel in a great location", "user": "cat-aaron", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124386104}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "As the reviews have said, the hotel is beautiful and the staff is top notch. We stayed there for one night during our honeymoon before also staying at the St. Moritz for several nights. This hotel made us feel extremely welcomed and provided extra little touches, such as a canapes and wine happy hour and personalized breakfast, to make the stay even better. As long as you don't mind not having a view of the lake, this hotel is perfect.", "title": "Perfection", "helpfulness": 1, "user": "etf1981", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122027126}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "What a great little hotel! Extremely helpful staff who are eager to please. They went above and beyond to make arrangements and recommendations for us. The room we stayed in faced the gondola and was comfortable, clean, and modern. Loads of natural light through windows and a large skylight above the bathroom, but motorized shades for privacy. Good location, a very short walk to downtown. We really enjoyed the happy hour canapes and wine (maybe a little too much). I'd recommend this hotel to anyone, a true gem.", "title": "Wondeful boutique hotel, top-notch service", "user": "aholdy", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121998531}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We spent two nights here at the end of our honeymoon around New Zealand, and it was an absolutely amazing experience. The entire hotel - from the exterior to the lobby to the rooms - is just gorgeous. It's modern design, but not too minimalist or busy. The customer service is also top notch. We had an excellent recommendation to try the spa at the Millbrook Resort, and restaurant suggestions were also dead on. The wine and canapes hour was a wonderful bonus, too. Definitely worth the splurge!", "title": "Cosmopolitan, yet comfortable and personalized.", "user": "SLVTraveler", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121781422}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We've been staying here for two nights in Jan 2012. Service and accomodation are outstanding and it is as stylish place. We loved it.", "title": "Great place", "user": "Blackmage1", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123245082}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Very stylish rooms, light and airy, wonderfully comfortable beds. Great hospitality and a very warm welcome from John.", "title": "Great place to stay in Queenstown", "helpfulness": 1, "user": "Paul_Phil-2011", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122507386}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed in a Remarkables Room which was very spacious, with a huge bathroom, and even a small kitchenette which we weren't expecting in this style of hotel. We loved the open plan style of the room, with just a glass wall dividing the bathroom and the bedroom. If you're looking for privacy in your bedroom, this hotel probably isn't the place to look, but for a couple on Honeymoon it was absolutely perfect.", "title": "Clean, New and Close to Town", "user": "LittleYarYar", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124141303}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The beds were amazing, I don't think I've ever slept so well in my life. With being able to choose our own pillow from the pillow menu, I don't think we could have been any more comfortable.", "title": "Great stay in Queenstown", "user": "a_quirky_pair", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123766868}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The only downside is that the rooms do look over the rugby field, however you can see the Remarkables in the distance.", "title": "Style over Substance", "helpfulness": 2, "user": "Lakelogger", "date": "January 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 123382161}], "location": {}, "stars": 5, "variance": {"poor": 0, "average": 6, "very good": 39, "terrible": 4, "excellent": 260}, "slim_ranking": 0.0655737704918, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Queenstown Park Boutique Hotel is a brand new boutique hotel designed and built for the 5 star traveler in mind. Only 300 meters from the centre of town. Rooms are spacious and luxurious, each with its own kitchenette. Enjoy breakfast with fellow travelers or on your own courtyard or balcony."}