{"user_rating": 4.0, "review_count": 30, "name": "Quest Williamstown North", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Quest Williamstown North", "title": "Real luxury serviced apartment", "helpfulness": 10, "user": "Globetrottin_Grannie", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7427303, "likes": {"liked": "— Full kitchen,comfortable furnishings", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "My husband I have stayed here 3 times; the last was June 2006 for a week. On that occasion although we had booked a 1 bedroom apartment as repeat clients we were upgraded to a 2 bedroom apartment. We hardly needed that, but it does give you a second bathroom with a bath. In addition, when we checked out the receptionist told us not to book (I wont waste time naming the cheap site.com) as they would match any deal next time.", "title": "Brilliant", "helpfulness": 3, "user": "jaxScotland", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 2.0}, "id": 6628138, "likes": {"liked": "— Space", "disliked": "— isolated"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 3, "average": 5, "very good": 11, "terrible": 0, "excellent": 11}, "slim_ranking": 1.0, "description": "Quest Williamstown North has perfected the balance of business and leisure accommodation. Only 15 mins from the CBD, located west of Melbourne in cosmopolitan Williamstown.Guests can enjoy the cosmopolitan shops, restaurants and sights of Williamstown, Scienceworks, the Sun Theatre & Werribee Open Range Zoo to name a few local attractions. Quest Williamstown North offers a complimentary shuttle bus within the local area*.Within short driving distance to the industrial district of Laverton, Altona North & Derrimut and only 40 minutes to Geelong, Quest Williamstown North is perfectly located for the business traveller.Quest Williamstown North provides bright and spacious one, two and three bedroom serviced townhouses with individual entry. Each townhouse features its own outdoor area overlooking the tranquil wetlands and abundant landscaped gardens with views across the wetlands and out to the bay. Guests can enjoy complimentary access to our heated pool, spa and BBQ area, or take a stroll around the peaceful Jawbone Nature Reserve.All townhouses are 4 stars and come fully equipped with kitchen and laundry facilities, foxtel, free internet, free parking and modern self contained amenities. Perfectly suited to overnight and extended stay guests, singles or families, business or leisure.Follow us on Facebook and keep abreast of our latest deals and offers."}