{"user_rating": 4.0, "review_count": 41, "name": "Quest Frankston", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The staff at the hotel were friendly and helpful. The self catering hotel is great. If you get a room with a view its even better. The room I had was spacious, with good facilities for a couple with young small family. I didnt use the pool as I was their for business mostly but it was small but OK for a dunk I guess. There is a Westfield style shopping centre within walking distance and an italian restaurant thats quite good. The frankston area has a nice bay area and is obviously under going some regeneration and investment. In a few years this will have made a big difference but at this time the area hasnt much to offer. However as a base for Mornington, Melbourne (45min drive) and the wider nicer coastal area its a good place to start on the cheap. Thyere was no wifi and I couldnt get the netwrok cable to work either, but that could just have been my UK based business server not wanting to talk to Ozz.", "title": "Great hotel, average location", "user": "TimandVal", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 81046713}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The rooms were modern and adequate, although a little too 'used'. No restaurant and a noisy air conditioner. The room itself was fine, but the staff on the weekend were downright rude. First, when we arrived, we were contacted at 8.30pm, to fill in some paperwork that the staff had forgotten. Second when we left, our baby was asleep, and the horrible person on reception kept ringing the room and aggressively demanding we vacate. Yes, check out was ten, but the cleaners were not coming through till around twelve.", "title": "Clean, Modern, soulless and horrible and obnoxious front desk staff.", "user": "DZ1977", "date": "August 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 76144855}, {"rating": 2.0, "stay_parameters": "Stayed August 2010", "text": "Would not stay there again, and will be revising my company's preferred supplier list very soon.", "title": "The poorest customer service you can imagine", "user": "Abbyzen", "date": "August 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 76116643}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The people at the the reception were consistently rude. The room and cleaning were fine but I would not go back to a place that treat their customers so poorly.", "title": "Perfect business stay", "user": "Styles79", "date": "August 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 73955520}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I stayed here for 3 nights while in the Melbourne area for business and I found it perfectly adequte. The room was well appointed, and I really liked that it had a kitchenette. The breakfast packs you can buy were a godsend as I arrived at 9.30 at night and didn't really want to go shopping for breakfast food for the next day.", "title": "I'd stay here again!", "helpfulness": 1, "user": "Soul_P", "date": "April 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60750345}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "We were visiting for a relative's wedding so not sure on how wonderful the surroundings were but the actual hotel for the money, we felt, was excellent and well above average value. It was incredibly clean and smartly furnished with all the modern conveniences you could hope for. Very very very happy with this place and would definitely reccomend a stay here.....", "title": "Loved the Quest", "helpfulness": 1, "user": "barbarellahutch", "date": "August 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 18706364, "likes": {"liked": "— Clean and smartly furnished, big tv", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Great, clean new, comfortable friendly", "text": "Had 2 nights in a 2 bedroom apartment. Was excellent, very clean, comfortable and the staff extremely friendly.", "helpfulness": 1, "user": "Jessietau", "date": "August 14, 2007", "id": 8417721}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The 2 bedroom apartment had 2 bathrooms and a very large family area and kitchen area.", "title": "very nice", "helpfulness": 6, "user": "lilyana", "date": "July 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8074388, "likes": {"liked": "— the accommodation", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We recently spent a week at the Quest Frankston, it's a clean and comfortable but compared to other Quests I found it a little disappointing.", "title": "Great staff, clean and comfortable but lacks any wow factor!!", "user": "NTLibran", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121847423}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I can't fault the staff at all - I made the reservation over the phone with a cheery and helpful employee and was offered a good rate which included parking and a cot and highchair for our young son. All staff we had dealings with onsite were also pleasant and accommodating.", "title": "Clean, Large Rooms, Good Kitchen Facilities", "helpfulness": 1, "user": "LouLouLouSyd", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120681270}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Noise is an issue and with a lot of corporate guests (seemingly for industrial type companies?) we found we could hear people returning late at night and leaving early in the morning. Given how much we could hear other guests we spent the week paranoid abour disturbing other guests thus trying to keep our baby and visiting niece as quiet as possible.", "title": "Ok for a place to sleep", "user": "MisslisOz", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115945451}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We use Quest's often and compared to others we found the Quest Frankston a little pokey and the kitchen and laundry didn't seem as well equipped / layed out. Detergents were in sachets and only two each for dishwasher, washing up liquid and washing machine. We ran out on a few occasions and either had to track down or wait for housekeeping.", "title": "Lacking privacy", "user": "golfsem", "date": "March 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 102373502}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The furniture seemed a little dated, but as we had young sticky fingers we were actually somewhat relieved by that.", "title": "Spacious, Clean and Comfortable", "user": "Kato007", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 91988675}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 5, "average": 3, "very good": 13, "terrible": 0, "excellent": 20}, "slim_ranking": 0.285714285714, "description": "Quest Frankston has been purpose built to accommodate both the corporate and leisure traveller. Located at the gateway to the Mornington Peninsula, Quest Frankston features 58 non smoking serviced apartments. Offering overnight stay to extended stay accommodation options comprising of studio, one and two bedroom serviced apartments.Our comfortably appointed, spacious and modern one and two bedroom apartments are completed with fully equipped kitchens, private laundry facilities, broadband internet access, balcony or patio, and separate living & dining area. Perfectly suited to overnight or extended stays for singles or families; business and leisure always.Quest Frankston offers a great base for travel to, from and between the Mornington Peninsula and Melbourne. Just a 5 minute walk is a range of restaurants, shopping and the beach. Let our friendly staff assist with your next stay."}