{"user_rating": 3.0, "review_count": 19, "name": "Quest Windsor", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We stayed at this property with friends over New Years 2009. Initial impressions of the hotel is that it needs a facelift. The quality of the rooms were not great and were in desperate need of a refurb. There was a mistake made with our booking which meant that instead of getting a room with one double and two twins we got two doubles. The manager of the hotel was working and she easily sorted it out but indicated we would need to change rooms the next day to get a room with the correct layout. We did and despite being told they would move our belongings the front desk staff members were very reluctant to do so.", "title": "Average not great", "helpfulness": 1, "user": "T-A-UK", "date": "February 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 24819722}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The second room was larger and still needed a facelift but was more comfortable for 4 people. If you were visiting melbourne for an extended period of time you would probably look for a more modern place to stay.", "title": "Adequate Apartment Accommodation", "helpfulness": 1, "user": "aandjSydney", "date": "January 26, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 23906822, "likes": {"liked": "— size of the apartment", "disliked": "— the smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I stayed at the Quest Windsor during the Australian Open. The apartments are in a handy location close to both the Tram and bus stop and walking distance to the nearby Chapel St. Our two bedroom apartment was large and enough room for the 3 of us. The apartment is furnished with fairly average furnishings and the carpet was in need of replacement. The lift was out of service for our whole stay. Luckily we were not on the 4th floor. Smoking is allowed in the courtyard atrium which unfortunately comes into the surrounding apartments. The parking being free is a bonus. The staff were friendly and helpful. The Quest Windsor is suitable if you are looking for a 3* apartment near the city.", "title": "Happy with Quest Windsor", "helpfulness": 1, "user": "belladona74", "date": "December 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 23027670}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 2, "average": 9, "very good": 7, "terrible": 1, "excellent": 0}, "aka": "Quest Windsor Greater Melbourne/Prahran", "slim_ranking": 1.0}