{"user_rating": 4.0, "review_count": 149, "name": "Quest St Kilda Bayside", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This place was fine for a few days stay in the St. Kilda area. Just a short walk to all the local attractions. It was clean and had everything we needed and was fairly quiet. Its located opposite a lovely old church but the property itself is a bit unremarkable. I would stay there again.", "title": "Good quality serviced apartments", "helpfulness": 2, "user": "CiaraB", "date": "February 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 151870259}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Stayed here for the past 9 days and the accommodation was first class - the room was spotless and the facilities excellent. The pool and bbq area were great and we used the bbq facility twice. All of the staff 'went the extra mile' and answered any queries and dealt with anything we asked for promptly. Nothing was any trouble for Jeremy and his team. The only downside to these apartments is the Wi Fi charge $14 per day - there was 30 ,mins free internet option at the reception area however, this pc has seen better days. Apart from that our stay was great.", "title": "Excellent Service", "helpfulness": 1, "user": "kbuthlay", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151825386}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Holidaying with my daughter and her three kids, we needed more than just a couple of hotel rooms. St Kilda Bayside provided two bedrooms, lounge and kitchen area plus bathroom so we had cooking facilities, more room and privacy rather than just a hotel room. The staff were marvellous, in particular the Guest Relations Manager, Jeremy. They were always ready to help and provide additional supplies etc. Tram stop, beach and Acland St about two minutes walk away and the hotel in a quiet tree lined street. Marvellous, Will definitely stay there on next return trip to Melbourne. Rates were reasonable as well.", "title": "Top Accomodation - better than top service", "helpfulness": 1, "user": "sheilaantal", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150127590}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "$14/day for wifi?? Not a great start.", "title": "Great place in a quiet street but close to the action.", "helpfulness": 2, "user": "workholiday", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149060876}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Anyway, once that is out of the way, this was a very nice place to stay. We had a 1 bedroom unit, with a fully setup kitchen and a spacious bedroom. The hotel is located a few minutes walk from the shopping and cafe/restaurant strip of Acland St, and is very close to the beach. But it is still in a very quiet location nestled on a leafy street.", "title": "Very Good Stay", "user": "jayMy", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148767183}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I like to stay in a studio apartment when I stay at Bayside. They are small but perfect for me when I travel on business. The view is of the very old church opposite. I have seen possums playing in the trees in front of the building which might appeal to tourists. The street is a dead end street, so it is very very quiet at night. The tram stop is about a 5 minute walk away and there is a very nice restaurant called Il Fornaio just around the corner. Breakfast is excellent!! The apartments, though very clean, have been looking in need of a refurbishment and I noticed signs around the place telling guests that the refurbishment is happening at the moment. There was noise of cutting at next door to my apartment and I complained that it woke me up, so the next morning, the cutting was moved so it wasn't next to any apartment at all. The very nice receptionist told me that all of the bench tops are being replaced and that they are replacing just about everything in all of the apartments.", "title": "Quiet spot, top location", "helpfulness": 1, "user": "roberta t", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135211340}, {"rating": 1.0, "stay_parameters": "Stayed July 2012", "text": "I like to use the carpark which is under the building but sometimes all of the spots are taken so my car is parked a little walk from the lift - but still off the street.", "title": "Be aware", "helpfulness": 2, "user": "Juauriemo2", "date": "July 22, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 135037493}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "I do like the free wifi at reception. If I want to work in my apartment then I pay the wifi charge which is fairly standard I think.", "title": "Great hotel. Awesome Location.", "helpfulness": 1, "user": "MintTraveller", "date": "July 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134860836}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We booked this hotel so we could stay close to my daughter which leaves in st kilda as well. I was amazed to find the hotel in an ugly old building since St kilda is sourounding by very pretty construction. Once in the room I noticed that they were old and very worn. It does need to be refurnished. By the way the furniture seems to be a gathering of old furniture from some op shop.", "title": "Top spot", "user": "Gina T", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133409792}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I tried to have a shower when the hot water stopped and never came back.", "title": "Well located for after work, staff look after you nicely.", "user": "karenandtim", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132142233}, {"rating": 4.0, "title": "Quiet Location - easy access to CBD", "text": "We stayed here in Sept 2012. We needed reasonably priced accomodation on AFL Grandfinal weekend, with easy access to the MCG at short notice. This turned out to be exactly what we needed - Located in a quiet street, only a five minute walk to the trams, and only 15-20 minutes into the heart of Melbourne, not to mention was also only a short walk to many good restaurants and to the bay.", "helpfulness": 2, "user": "GwynJP", "date": "October 6, 2012", "id": 142123397}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The unit itself was a one bedroom refurbished one on the third floor and although was on the small side was very clean, with a very comfortable bed allowing for much needed restful sleep after the activities of the day. The view from the balcony was not great, but this was not a high priority for us.", "title": "Brilliant location and fantastic staff. Apartment just a little disappointing.", "helpfulness": 2, "user": "Paul B", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 140123993}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "The lamp in our room was not working but on mentioning it to reception on our way out for a short walk, we came back to find it had already been fixed. The service of the staff could not be faulted, they were attentive, polite and above all very friendly.", "title": "modern room and comfortable!!", "helpfulness": 1, "user": "Alba6_44", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138045762}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "We stayed here as a last minute booking, but from the service we received, we shall definately be visiting again.", "title": "Perfect location", "helpfulness": 1, "user": "Simon T", "date": "August 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 137526943}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I stayed for 6 nights at Quest Apartments Bayside during a recent business trip to Melbourne. The apartments are nicely located in a very quiet tree-lined street within short walking distance to the restaurants on Acland St and to the beach. The apartment I was in faced the rear of the property so it was especially quiet. Being on the third floor I had a nice view of the city in the distance.", "title": "Great stay at Quest St Kilda Bayside", "helpfulness": 1, "user": "MinnieLulu", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136683736}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We booked three units for myself, my wife, my daughter and our three grandchildren. My wife and I had a corner unit overlooking the pool, very nice. Each of our units had been renovated. The Quest is in walking distance to the cafes of Ackland St, Lunar Park and the beach. The pool is very clean and partly shaded by some beautiful trees, a fantastic spot for the grandchildren on the 40C day we had whilst staying there. Undercover car parking and top service by reception staff make this location an easy choice.", "title": "Real Handy Location", "helpfulness": 1, "user": "bigkahoonaOssie", "date": "December 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148044917}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We recently stayed for 4 nights at the quest -two adults and two teenage girls.The apartment was small for four adults but had recently undergone a new fit out and was very nice.Beds a little hard and the shower very snug,no external venting for the clothes dryer left the laundry awash,but these were really small things.Overall our stay was very good.Staff helpful,location very convenient and relatively quiet.Off street parking available at a small fee for our rental car and a small pool a welcome relief on hot days.", "title": "Good quality accommodation", "helpfulness": 1, "user": "nutz067", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147097762}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The apartment is easily reached from the airport by St Kilda shuttle bus. It's off Acland Street so it's quiet, but smack-bang central. Easy walk to the beach, busy Acland, and tram stop to CBD. The facility is kept in clean and good condition. I was a happy customer.", "title": "Peace and quiet in St Kilda", "user": "SansRegrets", "date": "December 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146822379}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My husband and I and my son stayed for 4 nights in a 2 bed apartment at the St Kilda Bayside. The apartment was large and clean and well-fitted out with a washing machine, dryer and even a dishwasher. The bedrooms were large with enormous comfortable beds. The reception staff were extremely helpful and friendly (particularly Jeremy). There was lots of easy car parking on site. Despite there being no nice views out of the window (we were at the back of the building overlooking other apartments), the hotel is situated in a quiet residential road in St Kilda, but very near to bars and restaurants and about a 5 minute walk from the seafront.", "title": "A Great Place to Stay", "helpfulness": 2, "user": "gold20", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146799853}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The apartments are just a walk down the street to Fitzroy street or the Esplanade, and a nice stroll to all the tasty cake shops in St kilda.", "title": "Great location", "helpfulness": 1, "user": "Allie6464", "date": "November 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 146406512}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 7, "average": 18, "very good": 63, "terrible": 3, "excellent": 58}, "aka": "Quest St Kilda Bayside Hotel St Kilda", "slim_ranking": 0.166666666667, "description": "Quest St Kilda Bayside’s newly refurbished apartments are now available! Quest St Kilda Bayside is the perfect choice for both the business and leisure traveller. We are situated in a quiet residential street yet only minutes walk from the cosmopolitan attractions of St Kilda, with business and cultural precincts being easily accessible by tram or car - or a walk!Just 5 minutes’ walk from St Kilda beach, each of these newly refurbished (completed September 2012) studios and apartments features kitchen facilities and a private balcony. Also available is a well equipped gym (open during office hours), heated swimming pool and BBQ facilities (summer months only). Guests’ security is paramount, with carded apartment access, tagged property access and on-site car parking.Each studio and apartment has entirely new custom-made furniture and soft furnishings, an LCD TV, dining area, private bathroom and laundry facilities. Private kitchen facilities include an oven, refrigerator, microwave and dishwasher.Additionally, a variety of local restaurants offer Quest St Kilda Bayside guests the ability to charge meals back to the apartment.Melbourne city centre is just a 15-minute drive from Quest St Kilda Bayside apartments. Albert Park Grand Prix Circuit is 500 metres from the complex, it is less than 10 minutes’ walk to Luna Park and the beach is only a few minutes’ walk away."}