{"user_rating": 3.5, "review_count": 119, "name": "Quinta Real Puebla", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The second time we stay at Camino Real was last March 16-19. This time all of our family stayed with me so we got to experience more rooms. Mostly they are very colonial and cute and but some were a bit boring that the others...so if you don't like one maybe you can ask for another one. Excellent location to walk everywhere. We took excellent pictures at all the various beautiful spots at Camino Real.", "title": "Beautiful Courtyards", "helpfulness": 3, "user": "imm93", "date": "April 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4950676}, {"rating": 5.0, "title": "Impressing courtyard", "text": "Great hotel in the colonial center of Puebla. Most impressing for me was the courtyard with its quiet colonial atmosphere where I spent some hours. There is also a beautiful bar with good service. A small silver shop in one corner of the courtyard has extraordinary pieces and a very friendly staff. A must for collectors.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 12, 2006", "id": 4455206}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Stunning property, excellent service and superb food. A very pleasant surprise and a must if you are visiting the area.", "title": "the most beautiful hotel I stayed at in Mexico", "helpfulness": 4, "user": "chiaretta", "date": "September 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3890453}, {"rating": 4.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "The hotel, like most buildings in Latin America, is a nondescript flat wall of yellow from the cobblestone street, but once you walk in the arched doorway, it's beautiful. Formerly a convent this hotel has all the charm of a classic film of Spanish villages, with a courtyard that has a fountain in the center, a wagon filled with flowers to the side, and the tables of the outdoor dining bordering it. The room was very nice with a Talavera tiled bathroom that was worth a photo itself. I was lucky to have a room overlooking the main courtyard, with the spires of the churches over the wall, but the rooms all view one of the 3 courtyards. It was kept nice and clean also. The food was very good at the two restaurants I ate in and not really expensive. The staff were all very helpful and tried to take the time to be sure I was happy. Not much of a business center (2 pc's and a fax machine) although there are several conference rooms available. This is more of an hotel for romance in a romantic city, close to the Zocalo Park, Cathedrals and restaurants. One problem and it's partially my laziness. I asked the front desk to mail my stamped postcards instead of dropping them around the corner at the P.O. where I bought the stamps...6 weeks later and no one got their postcards. Hmmmmm", "title": "The Gem of Puebla", "helpfulness": 4, "user": "CaribMark", "date": "May 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3503681}, {"rating": 5.0, "title": "Gorgeous", "text": "What a gorgeous hotel. The courtyard restaurant was beautiful too. Our room was huge with big high beamed ceiling, big bathroom. I happened to go on their website and booked it for 79 USD! Incredible deal. Maybe it was just our timing. We were there mid-March 2005. We love the old buildings that have been converted. This was an old convent. Would highly recommend.", "helpfulness": 7, "user": "pakdenver", "date": "April 6, 2005", "id": 3338591}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I wanted to visit the Camino Real with my husband after attending a conference there two years ago (when I stayed at the wonderful NH Puebla). The hotel is stunning, and in a great location, but the rooms are surprisingly small, and the service was horrible from start to finish. We booked a three-night stay through Orbitz, and requested a non-smoking room; on arrival, we signed the check-in form (which clearly indicated my NS preference), and were ushered to a small room smelling of stale smoke. When I called to ask if we could be moved, the receptionist --who seemed contemptuous of the fact that we had booked through Orbitz--told me that I had made a mistake, that she had no record of our having requested an NS room (despite the form I had just signed), and then hung up on me. When I called back and expressed my disappointment with the level of service, she retorted \"You are receiving good service, miss\". This kind of unacceptable service continued throughout our stay -- unwillingness to give us an extra pillow for a rock-hard bed, no chance of moving rooms, bar closing earlier than announced and then overcharging horrendously for room service (even the water in the room was 30 pesos for a miniature bottle), and finally, the hotel \"accidentally\" charged my credit card again for the stay, and \"miscalculated\" the amount of water and juice we had taken from the mini-bar. We opted to stay an extra night in Puebla, but high-tailed it over to the trusty NH, which was paradise in comparison.", "title": "Needs to get its act together", "user": "trilceana", "date": "August 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 18725436, "likes": {"liked": "— Location, bathroom", "disliked": "— Staff service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "This is a place where you have to know what you are getting. It is a former convent. The place is just beautiful if you are into this kind of thing.", "title": "Wonderful place", "helpfulness": 1, "user": "dsingram", "date": "February 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13429244, "likes": {"liked": "— History", "disliked": "— parking"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "Even the bed headboards were interesting.", "title": "Interesting......", "user": "Vicola V", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0}, "id": 11717318}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The location is close enough to the Zocolo to make it a short walk. It is far enough away that you don't get to experience the all night parties that a part of Mexico.", "title": "Started off poorly but ended nicely", "helpfulness": 3, "user": "skaterdad", "date": "September 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8709695, "likes": {"liked": "— Historical building, beautifully renovated and upgraded"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Everyone was kind with our broken Spanish.", "title": "Lack of maintenance", "helpfulness": 1, "user": "EAGV", "date": "May 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 7697043}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "I don't think this is the right kind of hotel for american people, because we like things clear, and with the management in this hotel you are gonna get exactly the opposite.", "title": "Terrible management, they love to overcharge at the last minute", "helpfulness": 3, "user": "DyPP99", "date": "October 13, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 5948304, "likes": {"liked": "— To live from there", "disliked": "— The management"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "It is a great stop as a turist just for the tour, but I don't recomend to stay there, or to eat specially this is way to expensive.", "title": "Thieves! AVOID!!!", "helpfulness": 2, "user": "BJinx", "date": "September 25, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 5835767}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "They love to promise things and then they just forget about them.", "title": "it gets scary at night", "helpfulness": 3, "user": "TonyCardenas", "date": "September 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5769069, "likes": {"liked": "— beautiful location", "disliked": "— the darkness and desolated patios at night"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "It is a shame that a beautiful place like this hotel has such a terrible management.", "title": "Gorgeous Hotel", "helpfulness": 4, "user": "Vacationgirl77", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5288311}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Camino Real in August 2006. The hotel was nice and charming but we ran into some problems with housekeeping after we discovered that they had stolen some garments that we had placed in the closet. We reported them stolen and left our number as the manager assured us that he would let us know what was going on with the situation. We are still waiting for his call.", "title": "Beautiful Colonial Experience", "helpfulness": 4, "user": "TripAdvicester", "date": "April 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4978373}, {"rating": 4.0, "title": "Historic but somewhat austere hotel", "text": "The hotel is in a beautiful historic building that has been well-maintained and preserved. The fact that it was a convent also means that it is somewhat austere. There is no landscaping in the huge courtyard, and no place to sit down and relax, except on on couch in the small lobby area. It would be nice if the hotel put seats outside each of the guest rooms that open out onto the courtyard. This would be a particularly nice amenity for quests given the fact that many of the rooms lack windows, other than the windows that are part of the doors that open out onto the interior courtyard.", "helpfulness": 2, "user": "stmalo7", "date": "April 24, 2007", "id": 7430816}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "One wierd thing about the way the hotel quotes prices on their website--they quote a price in U.S. dollars, but then run the charge through in pesos. I don't have a problem with this in itself, but they convert to pesos at a artificial exchange rate that means that, in effect, you are not paying, say $135, but, rather, about $142. I know that the difference is small, but I find the whole thing very sneaky and unbecoming of a large hotel chain. You expect to pay a commission of some type when a hotel actually exchanges currency for you, but here all they are doing is quoting a price in dollars and not actually exchanging anything. If they want to quote a price in dollars, they should run it through in dollars, or in pesos at the official exchange rate. When you add on the cost to the guest of having the pesos charged on his credit card converted into U.S. dollars, the real cost per night iof a $135 quote is closer to $146. I discovered this when I checked out and found that I was being charged 1450 pesos per night for a room quoted at $135. When I asked about it, the manager agreed to reduce the bill.", "title": "Cold in winter time", "helpfulness": 1, "user": "travelling_rocks", "date": "April 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 7347770, "likes": {"liked": "— Courtyard and the general historical feeling", "disliked": "— Room was too closed in"}}, {"rating": 1.0, "title": "Impossible to cancel reservation", "text": "Normally, I like staying in hotels in historic buildings, but in this case, I think I would have preferred the NH Hotel in Puebla, It is a beautiful, new, sleek, and very modern building.", "helpfulness": 3, "user": "cest243", "date": "February 21, 2007", "id": 6821114}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I stayed at the Camino Real in December for a business trip. Obviously this was not their peak season as everything in the hotel except for the restaurant and the bar were always closed.", "title": "A Beautiful Colonial Hotel", "helpfulness": 2, "user": "jervis65", "date": "December 21, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6479894}, {"rating": 4.0, "title": "A nice hotel for the price", "text": "The courtyard is beautiful and in the middle of the summer this must be a great hotel to stay at. There is also a lot within walking distance, which makes for a pleasant stay.", "helpfulness": 2, "user": "C&L23", "date": "November 1, 2006", "id": 6044280}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast"}, "stars": 3.5, "variance": {"poor": 19, "average": 16, "very good": 41, "terrible": 9, "excellent": 34}, "aka": "Camino Real Puebla Hotel", "slim_ranking": 0.333333333333}