{"user_rating": 3.5, "review_count": 282, "name": "Quinault Beach Resort and Casino", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "I wanted to like this hotel. Really. We went for a conference and the rooms were a little less than normal as a result. BUT the beach is one that people drive on, so don't plan to build sandcastles unless you don't mind people speeding by your children as they build. AND if you are a nonsmoker, expect to cough your way through everything - although the nonsmoking room did not smell too bad. The food at the restaurants was fine although most of the cheaper places had very few non fried options. The staff was friendly enough and helped get us some milk for our son because we couldn't find a restaurant that had any - strange. The games were fine, I didn't play alot.", "title": "Great if you're a smoker-nonsmokers and families beware!", "helpfulness": 3, "user": "Kvacances", "date": "September 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 5782765}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "All in all not a place I would choose to go again with a child, or if I didn't have lots of extra clothes so I could change out of the smoky ones often.", "title": "Nice and Relaxing", "helpfulness": 5, "user": "Cfritz75", "date": "August 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5543190, "likes": {"liked": "— Room size, comfort, and the view", "disliked": "— had to drive to get to town, shopping, stores, other restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "New post of an old vacation.....new to Trip Advisor", "title": "Great Resort on the Beach", "helpfulness": 8, "user": "Mass_Matt", "date": "July 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5432207}, {"rating": 4.0, "title": "Great Rooms . . . shoddy casino!", "text": "My boyfriend and I stayed at the Quinault last year for our anniversary April 2005. We had no problems checking in early, at noon instead of 3. Our room had a gas fire place, a seperate seating area with a view of the ocean. It was clean, big, comfortable, and nice. We didn't spend any time in the casino since we are neither smokers or gamblers. The casino is noticeably smokey...but hey it's a casino. We ate at the restaurant the first night and we still talk about the crab cakes!! They were huge and served with a marmalade sauce! Best I've ever had. In fact we ordered them room service for lunch on the last night of our stay. The restaurant offers a buffet on Saturdays which looked alright...but awfully crowded since it's served in the reception/bar area in front of the restaurant. Didn't bother us once we were seated. The bar had a cover band playing that night too. Although we weren't interested at the time, could be fun if your looking for something to do.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 8, 2006", "id": 5325097}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "If you like gambling, the beach and comfortable accommodations you will like this place. The rooms were spacious and clean, the casino nice, and the staff generally friendly. Especially comfortable beds!", "title": "Very impressive rooms", "helpfulness": 8, "user": "Papalr", "date": "May 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5225204}, {"rating": 4.0, "title": "Quiet Getaway", "text": "This resort was a relaxing getaway from the hussel and bussel of work. We spent three nights there over our spring break (March). We had a wonderful view of the ocean, comfort bedding, gas firplace, indoor pool all to ourselves with a hot tub and workout room. And the beach is just a short walk from the resort.", "helpfulness": 2, "user": "teach2nd", "date": "April 28, 2007", "id": 7479884}, {"rating": 4.0, "title": "Still the Best, but", "text": "The casino was comfortable and not to big, which added to the relaxing environment. Even the food in the hotel was good. Only thing I found was to relaxing was the staff. They tend to be very layed back and sometimes forget their manners. The manager said he was aware of this and was working on the problem. He says he has noticed this around the area. Maybe it's all that fresh air.", "user": "OllieSeattle", "date": "April 11, 2007", "id": 7335855}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Our family would go back here to stay again whenever we feel the need for some quiet time.", "title": "Amazing rooms, Amazing views", "helpfulness": 2, "user": "ILoveTravel", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6818391, "likes": {"liked": "— Room size/layout", "disliked": "— Smokey smell"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Given that Ocean Shores is located on a sand spit, you are going to be further away from the water and Quinault Beach Hotel is probably the closest which gives you more of a feel of being on the ocean. The front desk needs better mgmt. as they seem somewhat disorganized. I recommend the queen bed room as having the better view. The king has the bed behind the fireplace, so you can't see the water. There seems to be more deferred maintenance on this trip ( having stayed there several times). The plastic shower head should be replaced. The toilet ran in my room and tub faucet leaked. Make sure you bring along your confirmation w/ rates as the front desk may not have your correct rate. I recommend room service as the food is good but don't count on substitutions - couldn't get rice instead of potatoes.", "title": "Great area, perfect rooms", "helpfulness": 1, "user": "Bliss_Blister", "date": "November 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6149401}, {"rating": 3.0, "title": "nice rooms. small smoky casino", "text": "The rooms at the Quinault are amazing! A gas fireplace divides the room into the bedroom and the sitting area. The room was large enough to host a small cocktail party for 6. The ocean view was amazing. Nice bathrobes are available upon request. The room has s samll fridge and coffe pot with regular and decaf coffe. We enjoyed dinner at Emily's, we took a steam in the spa (no extra charge). There is a free shuttle that takes you into Ocean Shores. We didn't use that. Every person we encountered was great...the valet/bellhop, check in, waiter, spa attendant, everyone! Room service was tasty as well. There were a few items that held me back from giving this hotel 5 stars", "helpfulness": 6, "user": "Cecili", "date": "September 18, 2006", "id": 5811392}, {"rating": 5.0, "title": "Wonderful Experience", "text": "From the time we arrived at the Quinault Beach Resort, till we left. It was a fantastic time. Every one was helpful and polite. At breakfast on my birthday ( 01-13-2006) the staff surprised me with a most delicious piece of strawberry cheescake and sang as well. I have nothing but high praise for this Resort and my husband and I will make this a home away from home place to go.", "helpfulness": 10, "user": "Marvina J", "date": "January 16, 2006", "id": 4356781}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "This was my 3rd stay at this resort. As ambient as it is, I have to say the service in the evening was truly unacceptible.", "title": "3rd time is a charm~", "helpfulness": 8, "user": "princessanalise", "date": "November 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 4112527}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "The rooms in this hotel are surprisingly nice. Our experience was that the room was clean and orderly, had a very nice view, and met our expectations overall. Service at check in was slow, but ok. There is only one elevator, which can take a long time during busy periods, so you may find yourself taking the stairs fairly often. Food at the little cafe in the casino is terrible, and the waits are quite long. There had been a sushi restaurant at one time, but it was closed because the chef had quit and not been replaced. We did not eat at the more formal restaurant, opting instead to try other places in Ocean Shores.", "title": "Hotel: Fairly Good / Casino: Crooked", "helpfulness": 13, "user": "himark35", "date": "April 20, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4991851}, {"rating": 4.0, "title": "Very Nice Stay", "text": "Be forewarned that, in our experience, the casino is not an honest place to gamble. On one bank of machines, our experience was that any time we hit the \"bonus round\", the machine would display a \"call attendant\" message. The attendant would come, open up the machine, and - upon clearing the message - the machine would default to the lowest payout amount, skipping the bonus round for the player. This happened repeatedly - four times in one hour, on three different machines. Call us stupid for letting it happen more than twice, but this is obviously outright fraud on their part. When I called their attention to this and asked for an explanation, they didn't seem to see any problem with the sitution. Needless to say, we did see a problem! I sent a note to the State Gaming Commission to call their attention to the situation, and they responded that they do not have jurisdiction over many of the machines in this casino, which I found fairly interesting.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 27, 2006", "id": 4737620}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "If you're looking for a beach getaway, this is overall an ok place to stay with fairly nice rooms. I would caution you about gambling here, however, if you'd prefer to gamble at a place where rules are enforced and the games have only the typical house edge you'd expect. We enjoy the beach, and will stay elsewhere when we return to Ocean Shores.", "title": "Truly Unhappy Employees", "helpfulness": 14, "user": "ODuck", "date": "March 16, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4626254}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "From the time we arrived the customer service was good. One valet even took the time to direct us to an elevator that was much less busy and closer to our room. There were a few exceptions. On the first night of our 5 day stay the staff in the Bistro, seemed more intrested in talking to each other than helping the customers. After that we had no problems, in fact when we went to get one piece of pizza cut in half they exchanged it for a larger piece. We ate at Emily's one night. Big mistake. We asked about the Sunset Special advertised on their website, and the waitress became very haute' and the service went down from there. The next night we went to Alec's by the Sea in Ocean Shores. Great food and service.", "title": "If you don't mind the smell of smoke and a casino atmosphere....", "helpfulness": 4, "user": "sillyrachael", "date": "March 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4584834}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The view was fantastic and in our experienc the rooms were clean and the bed was very comfortable.", "title": "Nice and resorty", "helpfulness": 9, "user": "rvivian", "date": "February 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4477102}], "location": {"country": "United States", "city": "Ocean Shores"}, "variance": {"poor": 37, "average": 38, "very good": 98, "terrible": 37, "excellent": 72}, "aka": "Quinault Beach Hotel Ocean Shores", "slim_ranking": 0.666666666667, "description": "Resort Enjoy a striking destination inspired by the extraordinary landscape, melding the offerings of thrilling in outdoor recreation and renowned spa treatments, with the hot & unsurpassed beauty of the Pacific Ocean. CasinoFrom your favorite table games, to the many electronic slot machines, you will find all sorts of fun on our Vegas Style casino floor. We offer FREE entertainment on the weekends in the Ocean Lounge for a weekend party at the beach!"}