{"user_rating": 4.5, "review_count": 74, "name": "Quinta do Vallado", "reviews": [{"rating": 4.0, "title": "Chic accommodation in the Douro Valley", "text": "We stayed four nights in one of the new rooms at Quinta do Vallado and thoroughly enjoyed our visit. The new facilities are beautifully appointed, with stylish furnishings and stunning views across the valley. It is situated in the heart of the region making it a great launch-pad for visits to the various estates and being a 5 minute taxi ride from Regua made it quite accessible. Helpful staff and a beautiful buffet breakfast made for a very pleasant experience overall. Could have been even better with the offer of food/ room service throughout the day.", "user": "DTLC78", "date": "April 29, 2012", "id": 129042796}, {"rating": 5.0, "title": "A perfect retreat in the Duoro Valley", "text": "We stayed in the just newly finished hotel and would highly recommend it. Our room had a beautiful view overlooking the vineyards and a patio with comfortable chairs to enjoy the view with a glass of wine. The rooms have every modern luxury and spacious enough to feel more than comfortable. The new addition has great attention to detail with plenty of sitting rooms inside and outside to truly appreciate the property. The breakfast was a delicious feast of pastries with fresh jams, meat and cheese, homemade yogurt, fresh juice with oranges from the trees on the property and other fresh fruit. The wine tour and tasting was enjoyable and we discovered a new liking for Port! With GPS we had no problem finding the house and immediately spotted the orange houses built into the hill. A fantastic stay to recharge in the Duoro Valley at a beautiful hotel with attentive hosts.", "user": "ZZinger", "date": "March 22, 2012", "id": 126516784}, {"rating": 5.0, "title": "Wonderful Wine Estate Experience", "text": "We stayed two nights at this quinta. Like other reviewers, we had a little trouble finding it. The house and setting among the vineyards is absolutely lovely and the Douro Valley as a whole is stunning. Much more beautiful than Tuscany and Napa. We stayed in the green room, which was spacious and very comfortable with a comfortable bed and modern bath. The breakfast was good. Antonio provided very good service and answered our many questions about the quinta and area. Sonia gave us an excellent wine tour, which is complimentary with the stay. We enjoyed the wines immensely and bought several items to take home. We also did the hike up to the top of the vineyards behind the quinta. It was lovely and we had a great view of the Douro river and surrounding area. There are stone tables for picnics. Sonia gave us a great recommendation for dinner - Castas e Pratos - a restaurant and wine bar in town. We had excellent tapas and wine in the wine bar. The service was lacking a bit, but the food made up for it. We also did the scenic drive to Porto. A bit long, but lovely at many points along the way. Overall, we really enjoyed our stay at the quinta and touring the Douro Valley.", "user": "atdrg", "date": "December 3, 2011", "id": 121363239}, {"rating": 5.0, "title": "We will be back", "text": "It also took us a little while to find it - The directions posted on their website are good - we were working with a GPS also, and I got confused when combining the two.", "user": "cwitkows", "date": "October 12, 2011", "id": 119240802}, {"rating": 5.0, "title": "... Beyond Our Expectations", "text": "We had the yellow room, and it was comfortable, nicely updated, and surprisingly large. We were also able to access the common area wifi from the room since we had the first one off of the lounge.", "user": "Dtheresa", "date": "October 11, 2011", "id": 119192391}, {"rating": 5.0, "title": "True Beauty and Charm in the Duoro Valley", "text": "We only wish we had allotted more than one night at this beautiful boutique hotel in the beautiful and picturesque Duoro Valley.", "user": "Msk6261", "date": "October 14, 2012", "id": 142804836}, {"rating": 5.0, "title": "Wonderful, book a couple days if you can", "text": "I don't know why TA categorizes this as a B&B (although breakfast was included and wonderful) because it is more like a Boutique hotel. A stay here also includes a fabulous pool area and a tour of the winery.", "user": "GrintiFiBar", "date": "September 29, 2012", "id": 141591400}, {"rating": 5.0, "title": "Douro wine region - the perfect stay in Summer or Winter!", "text": "We upgraded to a suite in the newer building and the accommodations were outstanding. Spacious and beautifully appointed. The beds are comfortable with wonderful linens, a great, modern bathroom and plush towels. We had the time to truly relax on our patio with a nice glass of wine.", "user": "EventsplannerChick", "date": "August 10, 2012", "id": 136854381}, {"rating": 5.0, "title": "Gem...", "text": "Having driven all day, we took the opportunity to eat in their dining room. We had stopped by Peso Da Regua on our way to the Qunita and decided it was a better choice to stay there than heading back to town. The service was excellent and the meal was \"to die for!!\" The Staff was friendly and helpful.", "user": "nelitodasilva", "date": "July 16, 2012", "id": 134573757}, {"rating": 5.0, "title": "An extraordinary place!", "text": "We enjoyed our drive in the region, photographing the picturesque valley and surrounding vineyards.Everything about Quinta Do Vallado was worth coming back for.", "user": "LeslieOW", "date": "July 11, 2012", "id": 134109807}, {"rating": 5.0, "title": "Lovely boutique-enotourism hotel", "text": "Quinta do Vallado was a real treat - it took us a bit to find it initially, but when we called them they were giving us good directions, and since the Winery is well known in the area, there was no problem. The rooms are in a beautiful stone manor set in the wineyards, rooms cozy-traditional with modern bathrooms (and wifi in the common rooms), and the nice breakfast is served outside on a panoramic pateo, where you can literally eat the figs from the tree above. Plus, the pool is really cool - and refreshing! We also had a winery tour & tasting, which I'd highly recommend! Overall, a great place to relax and explore the beautiful area. Note: there is construction going on right now to expand the place, but we never heard any noise or were otherwise impacted by it.", "user": "markusinmiami", "date": "September 3, 2011", "id": 117619009}, {"rating": 5.0, "title": "Amazing views, wonderful stay", "text": "Most beautiful location, breathtaking!!!! Stayed here with my husband in the terracotta suite, woke up to the sound of singing birds every morning, Breakfast was lovely fresh fruit, juice, ham & cheese, fresh bread and choc muffins that melted in the mouth!!!!!", "user": "2011Niamh", "date": "May 28, 2011", "id": 110274261}, {"rating": 5.0, "title": "A beautiful quinta boutique hotel", "text": "All the staff were so friendly and welcoming, they went over and above to make sure we had the most pleasent stay. Also given a private tour of the winery and had the pleasure of sampling some too......Our only issue was that we did not travell by car and due to location we had to keep ordering cabs from reception which closed at 6pm so a few telephone numbers in information booklet would of been very useful for us but I'm sure most people get here by car. Great private swimming pool area.Local people very warm and friendly too, we came to do the half marathon and found a little piece of heaven on earth!!!!", "user": "irosa", "date": "May 17, 2011", "id": 108703874}, {"rating": 4.0, "title": "Lovely Hospitality & Retreat in Peso da Regua...not quite World Heritage Douro", "text": "We stayed one day/one night at the Quinta do Vallado; it is a great place to stay especially if you are looking for rural tourism as they call in Portugal; you can imagine that is a very interesting and thematic experience to stay in a winery while visiting the Douro region. The historic building from centuries ago is very charming and the rooms very comfortable, updated and quiet. Only few rooms (6) at the Quinta so it is very exclusive, although they are under construction to have 8 more rooms soon. Breakfast was nice, fresh, country style. The winery and taste was also very nice and convenient. The Quinta is few kilometers from the Douro river however it is still nicely placed and in a convenient location. It was definitely a great experience!", "user": "timeisprecious", "date": "April 26, 2011", "id": 105597313}, {"rating": 5.0, "title": "Lovely Quinta in the Douro region!", "text": "When I booked this place, I mistakenly thought that we would be in the heart of the picturesque Douro River Valley. The grounds are lovely but it is a bit of a drive to the beautiful views. The location is it's only ding. We stayed in the Terracota Suite and enjoyed it thoroughly-spacious & elegant, beautiful linens, waterfall showerhead. The breakfast was elegant sufficiency with fresh baked bread, fresh squeezed orange juice, and fresh eggs made to order. The winery & tour is fantastic - a very impressive operation & the wine is nice. Above all, we enjoyed our time spent by the pool. It's somewhat removed from the rest of the quinta but the views from this space are the highlight.", "user": "kimberman", "date": "November 1, 2010", "id": 85635979}, {"rating": 5.0, "title": "Luxurious hillside boutique hotel", "text": "The NY Times' Frank Bruni didn't lead us astray with his timely review (we were in Porto when it was published) -- Quinta do Vallado was wonderful. The vineyard vistas from this hillside hotel are amazing, the room was beautiful and spacious, and the swimming pool was most welcome at the end of a hot day. Paola runs the show. She took our last minute reservations and helped us get our bearings from the road, she met us upon our arrival, showing us our room and booking our dinner reservations at Castas e Pratos that night. The next day, after a fantastic breakfast outdoors (featuring fresh orange juice, delicious yogurt, homemade fruit spreads, bread and cheese) Paola guided us on a detailed tour of the property and a tasting of their wines. Someone should give Paola a well-deserved raise! My only regret is that we didn't stay longer.", "user": "gisaster25", "date": "October 24, 2010", "id": 84695394}, {"rating": 4.0, "title": "Cozy, beautiful and friendly", "text": "It is an old cozy family house, now open to tourism, with the perfect location to visit the Douro region. Only a few rooms. Ours was very nicely decorated as well as the bathroom. We had wine, fruit and water in room on arrival.", "user": "PatNiz", "date": "August 28, 2010", "id": 77246274}, {"rating": 5.0, "title": "Everything other reviews say is accurate!", "text": "The swimming pool is fantastic and most appreciated at the end of the day after visiting the region.", "user": "lissoy", "date": "July 3, 2010", "id": 69582514}, {"rating": 5.0, "title": "Great experience!", "text": "No TV in room but there’s a TV in the lobby.", "user": "BSURiodeJaneiro", "date": "October 27, 2009", "id": 47897091}, {"rating": 5.0, "title": "Fabulous Guesthouse in the midst of the Beautiful Douro!", "text": "Very good breakfast.", "user": "YYZGuy99", "date": "June 23, 2009", "id": 32984990}], "location": {}, "variance": {"poor": 0, "average": 1, "very good": 17, "terrible": 1, "excellent": 55}, "aka": "Quinta Do Vallado Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 4.5}}