{"user_rating": 4.5, "review_count": 433, "name": "RACV Noosa Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "We have stayed at RACV Resort Noosa several times this year alone due to work & many more times over a period of a few years. We are highly impressed with the level of service & excellent standard they have maintained over that period. If anything it keeps getting better. The whole team could not be more helpful. The rooms are superb and each room we have stayed in has a beautiful view that looks like you are in Kakadu with complete privacy. They consistently deliver the best buffet breakfast you will find. The fruit is always fresh and a huge variety. They will even cook you pached eggs if you want. The new gourmet wood fire pizzas are great, but by far their biggest asset is the amazing team of staff. We can't recommend this resort highly enough!!", "title": "Consistently excellent !!", "helpfulness": 3, "user": "beautifullymad", "date": "December 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147918981}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This was an amazing resort. It is condo style accommodation. We stayed in a three bedroom penthouse. It was awesome. Clean and very new looking with all modern accessories. The balcony was huge and even had our own second rooftop balcony! The apartment was huge had 3 bedrooms plus an extra room with a photon so plenty of room for all of us. It is the only unit i have stayed in that had 3 bathrooms, 2 of the bedrooms had ensuites! We stayed poolside & the view was lovely. The pool was so nice & was open till 10pm. It even had a tennis court. The only downside was we didn't stay long enough! Will definitely be going back, even thinking of making a regular! Definitely recommend to all!", "title": "Great for", "helpfulness": 1, "user": "Cle089", "date": "December 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147778315}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We only had a one night stay on our way to Fraser Island. I really would have liked to stay longer! The accommodation and resort facilities were new and modern and the staff were very friendly and helpful. We had a one bedroom apartment which was quite spacious.", "title": "Really Nice Place to Stay", "helpfulness": 1, "user": "gjwjmb", "date": "December 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147760900}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We had a very nice dinner in the restaurant and the buffet breakfast was included in our room price. The price with the NRMA discount was very reasonable.", "title": "Fantastic Place To Stay", "helpfulness": 2, "user": "Miran P", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147714712}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "As we had a hire car, it didn't matter that the resort is a few kilometres out of the main Noosa area. In fact, it was nicer being out of the hustle and bustle of Hastings Street. I would certainly recommend the resort.", "title": "Extended our stay...", "helpfulness": 1, "user": "KiwiGirl_in_Aussie", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147702333}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed at RACV Noosa Resort for 9 nights over the Christmas period. Our family of 5 had a 3 bedroom precinct villa and we were delighted at the space and features of the apartment. The kitchen is fitted with Miele appliances which are wonderful to use, the size of the bedrooms and bathrooms is extremely generous which made the extended stay very enjoyable. There is also a laundry with clothes dryer.", "title": "Outstanding Location, Friendly Staff", "user": "AJCairns", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148562909}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The staff were incredibly friendly and helpful during every interaction with them. Pool area was lovely and clean, there is a games room for the children to entertain themselves for a bit and of course the rooftop spa was a hit as well.", "title": "Very enjoyable", "user": "Sophie K", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 148331449}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "The ONLY real negative comment that I have to make is in regard to the wood fired pizzas on Fri, Sat and Sun nights. When we ordered our dinner on the Sunday night, the children's meals arrived an hour and 20 minutes before our pizzas. This was extremely frustrating. The kids became quite impatient while we were waiting for our meals. When I went to check on the reason for the delay, I was told that they had not even been placed in the oven - an hour after ordering!", "title": "Amazing", "helpfulness": 2, "user": "luvmyholidays_78", "date": "December 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 148180014}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The pizza bases are premade/pre-prepared, so I don't fully understand why we we made to sit for so long. This is the only area that I believe needs to be improved. If they are going to boast to guests about the wood fired pizza available on weekends, they need to be able to cater for the guests in a timely manner. Perhaps it was just the silly season and the fact that the Christmas period is very busy. Still, it would have been nice to be told about the delay.", "title": "a big thank you", "helpfulness": 1, "user": "Janiceoconnor", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148113031}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Otherwise, the resort is FANTASTIC for families with children of all ages and it should be given a lot of consideration when planning a holiday in Noosa. Friendly staff, great location, well equipped resort.", "title": "Excellent resort, would definately stay here again.", "helpfulness": 1, "user": "CCappa", "date": "December 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147927982}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "What an experience staying at the RACV Noosa resort!! We travelled in a large group and were amazed with the resort and the facilities. The staff were magnificent going out of their way to help all of us and made our experience most enjoyable. The full buffet breakfast was great along with the wood fired Pizza's. I would recommend this to all from couples to families or even for Business conference's.", "title": "Excellent RACV Noosa resort", "user": "chris j", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147150728}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Stayed with my girlfriend in the one bed apartment for 3 nights. Super impressed with the room - tidy, clean, great bathroom, comfy bed, spacious lounge/dining.", "title": "Beautiful room, pool, staff, weekend away!", "user": "Daran1083", "date": "December 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146662215}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The pool was great & the staff were very polite, coming round to offer drinks/food around lunch time. Loads of kids which got a bit annoying, but its family friendly resort, so that's to be expected... They looked like they were having fun.", "title": "Weekend Away", "helpfulness": 1, "user": "Jeep_M5", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 146053767}, {"rating": 4.0, "title": "Great weekend away", "text": "Highly recommend this place and we'll definitely be back!", "user": "Tania S", "date": "November 21, 2012", "id": 145867305}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The wife and I have just returned from a stay at the RACV Noosa Resort. We stayed for 3 nights from Thursday to Sunday. All staff we encountered were pleasant and friendly. The room was clean and as expected.", "title": "Not a top pick.", "helpfulness": 3, "user": "AllyHW", "date": "November 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 145782222}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family has just had 9 lovely nights at this fine upmarket resort. The RACV Resort in Noosa offers great value for RACV members in what can be a very expensive holiday location.", "title": "Great value for a great resort in Noosa", "user": "jmcastings", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147592350}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were pleasantly surprised to be given an upgrade from a 2 bedroom apartment to a 3 bedroom apartment which was extremely modern and spacious and fitted out with 4 TV's.", "title": "RACV Noosa Review", "user": "Susan R", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147578762}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "The resort offers a quiet haven for those still wanting access to all that Noosa has to offer without having to be in the middle of it. If you don't have a car the resort provides complimentary shuttles into Hastings Street 5 times daily. Parking in Noosa can be difficult at the best of times.", "title": "Friendly service,beautiful girls in spa.", "user": "Jody W", "date": "December 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147521825}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "If you do have a car then there are numerous restaurants in Noosaville if you want to eat out.", "title": "Highly recommend this first class Resort for the sheer quality of the staff and cleanlyness", "helpfulness": 2, "user": "Gus M", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147158757}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The only negative for us was the restaurant at the resort where I celebrated my 7th wedding anniversary. Unfortunately there was a large party in the restaurant on the same night which resulted in very slow service. When my main course and side dish arrived it was cold and had to be returned to the kitchen. The restaurant manager handled this very well and we were provided with complimentary desserts and drinks.", "title": "Loved it so much we stayed longer", "user": "Neil C", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147152871}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 4, "average": 24, "very good": 122, "terrible": 3, "excellent": 280}, "slim_ranking": 0.1875, "description": "Situated in the heart of Queensland’s Sunshine Coast in the tranquil surroundings of Noosa Heads, RACV Noosa Resort offers a memorable holiday in an iconic holiday destination. Stylish, contemporary and only 2 kms from the renowned Hastings Street, RACV Noosa Resort offers brand new spacious accommodation overlooking a pristine wetlands sanctuary. The Resort is located close enough to explore Noosa’s award-winning restaurants, chic cafes and bars, farmer’s market and miles of pristine beach yet far enough away to enjoy the serenity of the resort’s secluded location. Alternatively make use of the full resort facilities, which include a heated lagoon pool with beach entry, restaurant, wood fired pizza oven, cocktail bar, gym, floodlit tennis court, day spa, lounge and free shuttle bus."}