{"user_rating": 4.0, "review_count": 425, "name": "Radisson Hotel Seattle Airport", "reviews": [{"rating": 2.0, "title": "Not your typical Radisson, not luxury by any means", "text": "I recently returned from a weeklong trip through CA/OR/WA and stayed at the Radisson at SEA-TAC (there are two Radisson hotels within a 3 block radius, so confusion is likely) the night before an early flight. The hotel, while very close to the airport, is not your typical Radisson. I had never before stayed in a Radisson but according to reviews from family members and friends who had, I was expecting a luxury hotel. It appears from the temporary-looking signage and the fact that there is another Radisson three blocks down the street, that Radissson recently acquired this hotel from another chain, perhaps Ramada. This hotel, or perhaps more accurately, motel was nowhere near the standards of luxury. I was disappointed and also glad that I had only booked a room for one night. I would not have been happy to have had an extended stay at the Radisson. It was subpar, at best. My main gripe were the beds, which were very motel-like and certainly not equivalent to what actual luxury hotels are currently offering like Sweet Sleeper's and the Heavenly beds. I happen to subscribe to the belief that the bed is the best indicator of how to rate a hotel and this hotel deserves a measly C-, in my opinion.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3547124}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "We stayed at this hotel for one night before an early morning flight. Included with the one night hotel stay was 7 days of parking for our car during our trip. So, taking the parking into consideration this is a good place to stay and a fair deal. However, I highly recommend that you get there at bedtime and leave first thing in the morning. The room was noisy, had a view of the roof and was worn and dated. There were large gaps in the door out into the hallway.", "title": "A great place to park your car", "helpfulness": 2, "user": "portlandoni", "date": "March 17, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3279752}, {"rating": 5.0, "title": "Very Happy & Loved The Remodel", "text": "I chose the hotel because it is close to the airport and had a great parking package for my early morning flight. It was not just a great deal for the room but also a very nice hotel experience. The lobby and guest rooms have just been remodeled and are very clean and modern looking. The crew was actually finishing installing some internet lines while I was there and they said it was the last step in the million dollar investment. The place looks great and I would absolutely recommend it.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 2, 2004", "id": 2802775}, {"rating": 1.0, "title": "A dump", "text": "The comments I see below must have come before the remodel as they do not even come close to fitting the hotel I saw and enjoyed. It is a great place to stay.", "helpfulness": 5, "user": "chris_schene", "date": "June 23, 2004", "id": 2217030}, {"rating": 1.0, "title": "Terrible hotel", "text": "We had booked this hotel night for two nights. One was for the night we flew in to Seattle and the other was for the night before we flew out early in the morning. Well, after that first night, we immediately cancelled the second night and booked the Doubletree airport hotel. The place is so rundown, I can't believe it's a Radisson! There were nasty water stains on the ceiling and the location overall was noisy. There was a party going on all night at the ballroom, which we could hear all the way across the courtyard. I couldn't imagine what it would have been like if we were closer. The only saving grace about this place was the breakfast which was really good. This is the first and last time we will ever stay at a Radisson.", "helpfulness": 3, "user": "lawahoo2001", "date": "May 5, 2004", "id": 1872044}, {"rating": 3.0, "title": "Needs Soundproofing", "text": "On my way back home, I took a bump and landed myself for an overnight stay at this hotel. Not bad for a Radisson and I did expect worse; however, the constant noise of airplanes landing was very annoying.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 7, 2004", "id": 1711556}, {"rating": 3.0, "title": "Good value for the money", "text": "This hotel needs to somehow figure out a way to soundproof the rooms because from the looks of it, it rests right underneath one of the landing patterns. Other than that, everything else was average.", "helpfulness": 1, "user": "nfahey", "date": "October 26, 2003", "id": 1422303}, {"rating": 1.0, "title": "Stark Contrast to the Radisson LA Westside", "text": "We spent 2 nights at this hotel. One when we first arrived in Seattle before going on an Alaskan Cruise and a second night immediately following the cruise.We booked both nights through priceline and got a fantastic deal. The rooms were average hotel rooms and were clean. We had a non-smoking room with two double beds (we had requested a king at check-in, but none were available). The beds were relatively comfortable.The staff was curtious upon check out and they kindly gave us directions to drive to Vancouver for our cruise.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 11, 2003", "id": 1280717}, {"rating": 4.0, "title": "Good Service. Would go back again", "text": "On Aug. 28th my flight from LA was very late and I missed my connection. Since I had such a wonderful time at the Radisson Los Angeles Westside, I was delighted to try the Radisson at Sea-Tac. Well, I was amazed at the difference. The carpeting was filthy. After a shower, (which wasn't very clean), I tried to use my phone and it wouldn't work. I called the front desk to find that since I hadn't left a credit-card imprint, they wouldn't turn my phone on. I explained that I was only making a calling card call anyway, and was told to bring my credit card to the front desk or forget it. I explained I had just gotten out of the shower, it was almost 1:00am, and I'd gladly read my credit card number to him and let them run it in the morning. He basically said that it wasn't his problem, and if I really wanted to use my phone that badly, I'd bring my card up front! Then, out of desparation, I asked if he would call a number for me and just have them call me back, and he said NO! A while later I called someone else at the front desk and requested a wake up call. Well, luckily for me, I set the alarm, because they never called me. Not only that, but 2 out of 4 glasses in my room were disgustingly filthy. I took them to the front desk the next morning and the lady was appauled at their condition. When I told her of my entire experience, she was nice and offered to pay for my room. That would have been great, but it was courtesy of Alaska Airlines anyway. But, at least she tried to make me feel better. Had I not just had such a great stay at the Radisson in Culver City, I would NEVER set foot in another Radisson Hotel. T. Hewitt", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 19, 2003", "id": 1236530}], "location": {"country": "United States", "city": "SeaTac"}, "stars": 3.5, "variance": {"poor": 36, "average": 65, "very good": 179, "terrible": 27, "excellent": 118}, "aka": "Radisson Hotel Gateway Seattle", "slim_ranking": 0.294117647059, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}