{"user_rating": 4.5, "review_count": 746, "name": "Radisson Blu Resort, Marina & Spa St. Martin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Our stay in May of 2012 at the Radisson was amazing. The crystal clear water was nestled by the green hills. Within minutes of our arrival, we were given the room key, delicious drinks, and a friendly staff member to help with our bags. We wanted a family beach getaway (2 kids- 14 and 8) and that's exactly what we got. The breakfast buffet offered a wide variety of choices. My only negative point would be the price of the food. There are two restaurants in front of the property which offer more adequate pricing. (I would not recommend the Italian restaurant as they had insane prices and mediocre food)", "title": "Beautiful property, great service", "helpfulness": 1, "user": "Yasmine A", "date": "January 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 150840753}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "As far as entertainment went... We were entertained! The pool is beautiful, the beach astonishing, and the property itself; elegant. We hired a small, private boat (everything was checked and confirmend with the trip planning staff) and went on a tour and snorkeling expedition. There is more than enough entertainment on the property itself as well!", "title": "The Quietest Vacation", "helpfulness": 1, "user": "4historyandculture", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150331610}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "One word of advice: Bring the strongest possible sunscreen available. Our skin, used to the East Coast sunshine, was NOT ready for the magnitude of the St. Martin sunshine.", "title": "Gorgeous Hotel and Property on an Unsafe Island", "helpfulness": 9, "user": "Emily A", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150288352}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This resort is the farthest one in the island on the French part. It is nestled between mountains and has a semi private beach. The neighboring resort and the people who rent the villas can walk by a fenced walkway to go to the same beach but Radisson Blu checks on guests room numbers occasionally.", "title": "Great Resort", "helpfulness": 3, "user": "BoomerOttawa_Ontario", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150130392}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Outside the resort, the island is very poor, trashy, and shabby. So, the tourists' money stays in the resorts and does not go to improve the island. Even on the main road in Gran Case, where they say is the gourmet capital of the islands, trash was everywhere.", "title": "Building a bar by the beach during peak season makes for a noisy vacation", "helpfulness": 3, "user": "rinarisper", "date": "January 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149995502}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We visited the Radisson Blu Resort St Martin again in early December and found it up to standard. The facilities are excellent and the staff very welcoming and friendly. The breakfast service was exemplary. At the time of our visit, the haute cuisine restaurant was not operating but it was due to start up for the season on 15 December. There are some excellent restaurants nearby on the Marina or in nearby Grand Case, just 10 minutes drive.", "title": "A gem of a Caribbean hideaway for complete relaxation", "helpfulness": 3, "user": "Chilternman", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149233311}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We really enjoyed the buffett for breakfast every morning. The private beach was wonderful and it was nice having so much space in between us and anyone else. The food was rather expensive which was a bummer and there aren't many choices around. Even the drinks seemed overpriced, for 2 pina coladas it was $24. Besides that price of food, it was great. The hotel entrance is beautiful. I also expected just a little something extra being newlyweds on our honeymoon, but no such luck. Other than that, the staff was great.", "title": "Pretty good", "helpfulness": 5, "user": "aviongirl", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149217694}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family of 6 (ages 17 - 55) spent 7 wonderful days at the Radisson Blu in Anse Marcel St-Martin, Dec 27th - Jan 3rd 2013. The staff was suburb and 1st rate and attentive, especially Claudette & Alan at the Concierge Desk. Rooms were spectacular, large bathrooms, clean and well appointed. The beach was terrific, soft sand, plenty of lounge chairs to enjoy a perfect day. The two restaurants served great food and a breakfast was especially good. Overall I would say our vacation at the Radisson Blu was the best ever! I strongly recommend staying there ... I know I will again next year!", "title": "7 Wonderful Days", "helpfulness": 3, "user": "sbarrie", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149033613}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We vacationed in St. Martin and stayed at the Radisson Blu from December 4, 2012 to December 11, 2012. Upon arrival we were warmly greeted by Conrad and taken to the reception desk and was then warmly greeted by Elise Ratchel and her competent staff. At this time we also met Alain Alidor, the concierge, who became invaluable in recommending restaurants and activities around the resort. While checking in we finally met face to face with Ingrid Mathurin, the reservations manager who was extremely patient and helpful to us when we were making our reservations. She ensured everything was perfect and exceeded our expectations. She is truly a very warm and cordial person. On our second day we met Jean-marc Jalbert, the General Manager. He was a poised, gracious host, who we believe really cares about his guests, his people and his property and takes great pride in the Radisson Blu's success. While we were enjoying the infinity pool, we befriended Patricio, who made delicious drinks and served them with a flair. All of the staff was outstanding and a pleasure to deal with. The grounds are breathtakng, the beach calm and relaxing and our Marina Suite was beautiful and immaculate. We enjoyed our daily breakfast at Le Marche and dined once at C Le Restaurant. We also dined at Le Calypso (across the street) which was also very good. We went to Grand Case and dined at L'Auberge Gourmande (Maggie is a sweetheart), Le Pressoir and also went to Sandy Ground to dine at Le Santal. All of these restaurants exceeded our expectations and in our opinion were outstanding!!! Albert was our taxi driver and he was absolutely wonderful. We enjoyed ourselves so much that before we knew it our vacation was over and we had to return to New York. It was a wonderful vacation and we are looking forward to our next visit. Thank you to the staff at the Radisson Blu for making our vacation a truly unbelievable experience.", "title": "Beautiful Resort, great location, quiet & secluded with a great staff!!!", "helpfulness": 3, "user": "Joanne R", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148854471}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband I recently stayed 5 nights at the Raddison Blu for our honeymoon before going on to St. Bath. The hotel is lovely - very nice and very well maintained. The staff is very friendly and very helpful and accommodating with any requests you may have.", "title": "Beautiful and Serene", "helpfulness": 3, "user": "Lauren C", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148833357}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Radisson Blu Resort at Anse Marcel, St Martin is a stunningly beautiful hotel with manicured, immaculate grounds, a gorgeous pool area, and a secluded, perfect beach immediately adjacent to the pool. They were having a bit of confusion when we first arrived -- their computers were down and they sent us to a room that was still occupied -- but all got sorted out, and everything went well after that. Sumptuous breakfasts in an open-air dining room are free to hotel guests. The rooms are large and luxurious, with covered balconies and spacious bathrooms -- although the showers have these odd little half doors that do not prevent the floor from getting soaked when you shower, no matter how careful you are. If you rent a car and drive yourself, as we did, be prepared to be \"white-knuckled\" the first time you navigate the extremely twisty, steep, and narrow road that leads to the hotel. Also, being on the French side, the hotel uses the French standard for electrical power -- 220 volts through a twin-round-pin plug -- so you'll need a converter and plug adapter to charge your cell phone or laptop.", "title": "Paradise on St Martin", "user": "Dragonminder", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151255100}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Radisson Blu is hard to reach, but worth the trip. Roads leading to the hotel seem too dangerous to walk, so we stayed at the hotel and beach for our 3 night stay. The beach is outstanding - white sand, not crowded, and clean water with a few sail boats in the harbor just beyond the buoy line. The island, Anguilla, is viewable in the distance about 2 miles away. Hearty buffet breakfast is outstanding. Personnel in the lobby are helpful. An international salsa festival in the ballroom livened up our stay.", "title": "Hidden Gem", "user": "klep", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 151221095}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Radison Blu Resort at St Martins", "title": "Fantastic Setting", "helpfulness": 5, "user": "ChazDP", "date": "February 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 151182006}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Just came back from this hotel after five nights stay. My 7th trip to St M/Ms. I have stayed in just about every hotel chain from Ritz/Four Seasons and higher rated to “we’ll leave a light on for ya”, so I think I am pretty qualified to comment. The Radison Blu is on a great piece of property—the setting here is if not the best in St M/M, it is one of the best. A beach resort surrounded on three sides by Hills/small mountains. The beach is great, the pool is without a doubt the best I have seen in St. M/M, albeit I have not stayed at all of the top end places, (save your money and do not eat at the newly constructed beach bar, food was terrible) but the food at the beach side restaurant was very good. There was not one thing to be disappointed about regarding the setting. I give the setting 6 stars out of 5.", "title": "Another Great Visit", "helpfulness": 1, "user": "susan L", "date": "January 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151091647}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The actual hotel is pretty decent, not top notch but really pretty decent. The rooms are roomie, nice bath and a sitting balcony. Each bed was a sleep number bed, which I guess I miss the purpose of that amenity-not sure why it is there, not even sure it worked. Each room had a safe-which in my opinion is a must at every hotel. The one drawback to the room was the carpeted floor, for a resort where people are coming and going with sand and wet things---a carpet to me is a mistake, not very clean—one other thing---do not have open food in your room, we stopped and bought some French Pastries and placed them on the TV table-the box was closed but not air tight. We woke up in the morning only to find our pastry covered with a thousand ants—little buggers but they were all over the inside of the box. Ruined some really good pastry.", "title": "Nice but...", "helpfulness": 4, "user": "AdamGhost", "date": "January 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 151004738}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This location is truly sublime. You could not find a more wonderful and peaceful setting on the island if you tried. The beach facilities, and the rest of the facilities are just great either as a couple or a family. On the negative sie is the restaurants are mediocre. not the type of flare one would expect form a hotel of this caliober on the Fernech side of the island with some much influence of fine French cuisine. The workout centre is palty.", "title": "a gem", "helpfulness": 2, "user": "Paul B", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148536480}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Nice hotel in Anse Marcel on St.Martin. Far from everything, but great for relaxing.", "title": "Beautiful hotel", "helpfulness": 1, "user": "FileST", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 148369254}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The staff was very professional and kind and that is not so often on St. Marteen. We had breakfast and dinner and the food was great. Hotel is in lush gardens and all is designed very beautiful.", "title": "TRULY UNBELIEVABLE EXPERIENCE", "helpfulness": 6, "user": "dnos6749", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147631768}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My wife and I spent a week at the Radisson Blu Resort on the island of St. Martin (French side). We had the most enjoyable vacation in many years. The resort is pristine and the management and employees are true hotel and customer service professions. The location is quiet and peaceful yet only 10 minutes by cab to the village of Grand Casse which is known as the gourmet capital of the Caribbean.....and it truly is with more than 20 restaurants one better than the next. The beach at the resort is beautiful with superb services and looks across the water at the island of Anguilla. The food at the resort is very well prepared and there are several options for dining. The atmosphere on the property and on the island is very Caribbean Upscale. The Spa on the property is world class with expert technicians and a great relaxing ambiance. St. Martin has lots to offer on both the Dutch and French side of the small 37 Sq mile island (so you can get everywhere in short time as long as you avoid the traffic rush hours). We will return to Radisson Blu St. Martin. What a beautiful find this has been for us!!!", "title": "Beautiful seculded gem", "user": "KM1025", "date": "December 15, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "service": 4.0}, "id": 147490880}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "My boyfriend and I had a great time at this quiet beautiful resort. The breakfast buffet was delicious, the lunch was awesome, but the dinner selection was a bit disappointing. We wished there was more of a selection. There is only so much red meat and fish one could eat. Overall, we had a great time.", "title": "Small, but mighty", "helpfulness": 2, "user": "Dmonaco62", "date": "December 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 147051050}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 22, "average": 71, "very good": 237, "terrible": 14, "excellent": 402}, "aka": "Radisson Blu Resort, Marina And Spa St. Martin", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Nestled in the secluded cove of Anse Marcel’s National Nature Reserve, the AAA Four Diamond Radisson Blu Resort, Marina and Spa St. Martin sits upon a pristine stretch of white sand beach, cradled by the Caribbean Sea. The grounds feature one of the largest zero entry infinity pools in the Caribbean. The resort’s literal and metaphorical \"off the beaten path\" locale appeals to travelers seeking quiet and refined, unpretentious Caribbean charm and an unhurried pace. Eighteen lush and spacious acres afford guests a sense of vacationing in their own French-influenced island retreat – private enough so nearby diversions of world-class dining, chic boutique shopping and multicultural exploration are always an option, but never an intrusion. Designed with Euro-chic furnishings the resort features 189 well-appointed guest rooms and 63 suites including the 3 bedroom 2 story Anse Marcel Suite. Our guest enrichment program offers a variety of sport and cultural activities. Our convenient on site Marina is the launching point for many aquatic adventures. Dining is a pleasure in C Le Restaurant its beachfront setting and varied menu sure to delight for Lunch or Dinner. Breakfast and dinner brings you a taste of France at our market style Brasserie - Le Marche. New for 2013 Le Beach Bar offering casual eats and a full by the beach and pool. The lobby bar's offering of regional rums and small plates is perfect for happy hour. Only 25 minutes from Princess Julianna International Airport (SXM) in St Maarten or 20 minutes via water taxi, which can be arranged by the resort, the Radisson Blu is the choice when visiting St Martin."}