{"user_rating": 3.5, "review_count": 211, "name": "Radisson Hotel Cleveland - Gateway", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "My friend and I stayed at the Radisson for one night in late July. We were there for two Cleveland Indians baseball games. We picked this hotel because it is within walking distance to the baseball park.", "title": "Perfect for the sports fan!", "helpfulness": 1, "user": "aicirtapc5", "date": "August 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 18609529, "likes": {"liked": "— The location to the ball park was great!", "disliked": "— The price for valet parking could have been cheaper."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We arrived on a Tuesday around 2pm. It's in the downtown area so parking on the street is limited. We booked a room with the valet parking fee included in hotel price. Parking is $18 per day. A nice man helped us with our bags and took the car. Lady at front desk was very friendly upon check in.", "title": "Baseball Junket.", "user": "sportsfan007", "date": "March 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 14647418, "likes": {"liked": "— Close to Ballpark and Comfortable beds", "disliked": "— Valet parking and feeling uncomfortable after dark."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Our room was a standard with two double beds. There are mini-fridges in each room. The rooms itself was very clean and we didn't hear any noise from our neighbors. The toilet was extremely loud when flushed but all rooms were like that from what we heard.", "title": "Great Stay", "helpfulness": 3, "user": "mamaof1", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12811898, "likes": {"liked": "— location", "disliked": "— breakfast buffet"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This hotel is directly across the street from Cleveland basketball area and a 2 blocks from Progressive Field. There are many bars and restaurants surrounding it for great night life. We walked to the Tower City Center mall in about 10 minutes.", "title": "Good location, but otherwise average at best", "helpfulness": 1, "user": "IADTraveler", "date": "November 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10507325, "likes": {"liked": "— Location", "disliked": "— Room quality"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We checked out the next morning before heading to the baseball game and they were happy to hold our bags for us until we were ready to leave. The bags were brought out along with the car and we were on our way.", "title": "Stay somewhere else", "helpfulness": 1, "user": "sierradrinker", "date": "October 23, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 10254794, "likes": {"liked": "— Close to where I needed to be", "disliked": "— Horrible service."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Terrific hotel at a great value. Building is well-maintained, the night staff were courteous and efficient. Self-parking directly across the street was only $7 overnight. Easy walk to most major downtown sites. Strongly recommend as the best way to see Cleveland!", "title": "Great Way to See Cleveland", "helpfulness": 2, "user": "Tiger887", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8494061}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Well to start off, We were looking for a location close to the Jake so we could walk to the game. We got that! Maybe a 5 min. walk. The rooms were nice, and bed made the sleep better than in most hotels. It was clean, and I felt safe walking around the downtown area.", "title": "It's ok", "helpfulness": 3, "user": "donkey176", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8265777, "likes": {"liked": "— close to stadium", "disliked": "— nothing stood out as special"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I did notice that the employees were bit \"bothered\" by us when we had questions for them. Valet parking is 18.00 for overnight, and you can't get away from it. You really have no choice than to use it. The valet parking is come and go as you plaese, however it took about 20 min. to get our van, and the valet people were not happy to get my van for me.", "title": "Awesome hotel, great location if you're going to an Indian's or Cavaliers game", "helpfulness": 3, "user": "CPfan", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8255781, "likes": {"liked": "— Very clean, comfortable rooms, great soundproof rooms and close to The Jake.", "disliked": "— The cost of the valet parking $18 plus valet tipping."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "So, if you don't mind rude hotel staff, this place is a good place to stay.", "title": "Heart of Cleveland", "helpfulness": 3, "user": "Ginathemaria", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8224927, "likes": {"liked": "— Location", "disliked": "— Indians Fans"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We were very happy with this hotel. Our room was HUGE and the sleep number beds were very comfortable. Warm cookies in the evening at the check in desk and coffee all day long.", "title": "Very convenient location!", "helpfulness": 4, "user": "sarmcl", "date": "April 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7418562, "likes": {"liked": "— Convenient to everything!!", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "Great location", "text": "My wife and I stayed at this hotel for three days and the only problems were the slow elevators and the lack of personalities from the people at the front deck.The rooms were cleaned spotless all three days,the showers were good and the location can't be beat.We walked(short walks)to the Tribe game,House of Blues,Hard Rock,Wharehouse District,as well as thirty other restaurants and bars around our Hotel.You can also walk to the Tower Amplitheater,Rock n Roll Hall,and the The Quick n Loans Arena.", "helpfulness": 8, "user": "Kevlis", "date": "July 7, 2006", "id": 5436879}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I almost cancelled my reservation after reading the two who thought it was horrible, but I'm really glad I didn't. This is a very nice hotel. My king room actually looked like the picture. Sleep Number bed, with the nice white duvet which I like because you know they have to wash it sometime. Unlike the \"hide the dirt\" flowered bedspreads.The room and bathroom were both clean. I used the \"Express Yourself\" on-line check in before leaving home. As advertised, I handed them my ID and they handed my the key and it was almost 3 hours before check in time. The staff was not overly friendly, but courteous and efficient. I enjoyed my stay and would definitely stay there again.", "title": "Very Nice - Don't Let the Bad Reviews Scare You Away.", "helpfulness": 15, "user": "Shaymus", "date": "April 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4997993}, {"rating": 1.0, "title": "Horrible!! Stay Away!!", "text": "Let me start by saying, we did NOT end up staying at this hotel due to the rude treatment before arriving there. I made our reservations in January for two rooms with king sized beds. I was told there would be no problem. When I called to confirm our reservations the day before we were to leave, I was told we had two rooms each with two double beds instead of the King beds I had originally requested. After speaking to 3 managers, including the general manager, we were given one king sized bed and the other room would still have two doubles. I couldn't understand how one minute we were told there were no kings available and now all of a sudden we were given a king. The general manager was very rude and did not care about the situation I was now in. We were meeting 30 people for a concert and about 12 people were to stay in this hotel. After going back and forth and the general manager not caring and fixing the problem, I finally cancelled our reservations, which I'm extremely glad I did. The other people who stayed in this hotel had nothing but problems. Dirty rooms, bathrooms and tubs that did not drain properly. And ofcourse the managers didn't care about these problems either. We did stay at the Hyatt Regency in the Arcade, what a wonderful stay!! Treated like royalty. Because of the horrible treatment we received from the Radisson, I will stay away from all Radisson hotels. We will be going back to Cleveland again with the same people and you know we will NOT stay at the Radisson. Horrible hotel, horrible managers, stay away!!!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "March 19, 2006", "id": 4694169}, {"rating": 1.0, "title": "Horrible!", "text": "My wife and I had a gift certificate to stay at the Cleveland Radisson. We were visiting Cleveland for a concert at the House of Blues. We made good time coming from Dayton, OH and were very pleased how nice the rooms looked!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "January 17, 2006", "id": 4357890}, {"rating": 4.0, "title": "Awesome Place to Stay", "text": "However, as I picked up the tickets from the bed to leave for the concert, I noticed that the bedspread was COVERED with pubic hair! I'm not talking one or two pubic hairs, I truly mean that there were countless hairs on the bedspread.", "helpfulness": 11, "user": "insomniacsdream", "date": "November 15, 2005", "id": 4119359}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Used the valet service and had our window smashed out and the enitre contents of our rental removed while in the hotel lot. 3 different employees including the front desk manager says it happens all the time. Still waiting to hear from hotel insurance company after a week. $6000 worth of stuff gone.", "title": "parker beware !", "helpfulness": 1, "user": "huskerfan", "date": "April 16, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7369854, "likes": {"liked": "— they allow you to leave", "disliked": "— the fact that its open for business"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Hertz - great customer service.", "title": "Excellent Choice for Anyone Visiting the Cleveland Area", "helpfulness": 5, "user": "informed2", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6907649, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Radisson - not so much", "title": "Great for baseball fans", "helpfulness": 4, "user": "NoDakGuy", "date": "August 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5603505, "likes": {"liked": "— Location", "disliked": "— No real \"view\""}}, {"rating": 4.0, "title": "Great stay at the Radisson Gateway", "text": "We were going to a concert at The Q arena and wanted to stay somewhere convienent. The Radisson Gateway was the perfect choice. Located at Tower City, we reserved a package that included room,parking, tickets to the Rock and Roll Hall of Fame and breakfast. This was a fantastic deal, with all of the perks of this deal, our room was only $65.00 a night. We had a room with king size bed and it was very roomy. The staff, from all area of this establishment were very helpful and courteous. I will always choose this hotel whenever I have the opportunity to stay in Cleveland.", "helpfulness": 5, "user": "tvlmartlt", "date": "August 6, 2006", "id": 5562683}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "I stayed at the Radisson while in Cleveland for the Minnesota Twins/Cleveland Indians series from July 21-23.", "title": "I thought it was nice", "helpfulness": 5, "user": "grace_73", "date": "July 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5466167}], "location": {"country": "United States", "city": "Cleveland"}, "stars": 3, "variance": {"poor": 23, "average": 48, "very good": 70, "terrible": 13, "excellent": 57}, "aka": "Radisson Hotel Cleveland Gateway", "slim_ranking": 0.6875, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Radisson Plaza Hotel Cleveland – Gateway, a newly renovated boutique style hotel, is located in the heart of the Gateway District, a step away from Q-Arena and Progressive Field. Take in some of Cleveland’s finest dining, entertainment and shopping in the new “hip” East 4th Street district… all just a short walk from our door. You’ll love our “Yes, I Can” hospitality."}