{"user_rating": 3.0, "review_count": 262, "name": "Radisson Blu Badischer Hof Hotel, Baden-Baden", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Potential but in serious need for refurbishing!", "title": "In serious need of renovation!", "helpfulness": 1, "user": "Bawell", "date": "April 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 127619621}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Garage is very small and despite notice in advance, you are not guaranteed space. It worked ok for us even if the garage is very small and takes skills to get in and out.", "title": "BB needs better hotels, but this one will do...", "user": "markmccauley", "date": "March 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126648147}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Front desk staff very friendly and all worked fine with check in. In our rate no breakfast was included and as it was 20 EUR per person for breakfast we did not even try it. Rooms are in serious need for a renovation. Extra bed for our daughter was a terrible extra bed type beach bed. No mattress at all basically. Bed fell apart as soon as I sat on and had to be fixed and were rather uncomfortable and primitive.One of the rooms stank of smoke as the \"smoking bar\" on ground floor has such bad ventilation. Restaurant looks like something from the past (in a bad sense) and all public spaces are totally worn out. Pool and spa is very basic. A pool, A sauna (mixed), a few showers and a hot thermal bath. Internet free but very slow and unreliable. You need a code for each devise. Why not just use room number and name?", "title": "I liked my stay", "helpfulness": 1, "user": "znapper", "date": "January 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122912189}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "All in all rather it was a disappointing hotel and not at all the standards we are used to from Radisson Blue hotels elsewhere in Europe. I am amazed they are allowed to use that brand and has 4 star rating. This hotel needs some serious rework and upgrade and in the meantime a downgrade to 2 stars.", "title": "Stay here - it's wonderful!", "helpfulness": 2, "user": "peculiah", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121733892}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I didn`t have high expectations for this hotel and kinda of a good thing. When I first arrived, there was no one to assist with luggage and when I asked the front desk staff for a trolley or luggage cart, they told me there weren`t any. So I schlepped all my belongings in. About 15 minutes later, I discovered there were (in fact) three trolleys. Argh.", "title": "Tiny Rooms", "user": "islandervne", "date": "December 13, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121709374}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I paid a hefty price for this place with no AC and no working sauna and when I asked for a cup to get some water I was told to wait until the next day. It's HOT, and not worth it. Disappointed and would never stay here again and would not recommend it. And the photos are nothing like reality. And breakfast is $20 per person per day! Seriously? When your sauna doesn't work and you advertise it does you need to offer some breaks. The \"old part\" reminded me of the movie The Shining, but maybe that's because the experience has already been poor. Oh, and there was black hair in the bathroom.", "title": "Expensive and not worth it", "user": "Raven_Lenore", "date": "May 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 129779030}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I got a great deal on this hotel and was satisfied. I was put in the \"historic\" are of the hotel, which meant that the rooms were not renovated. But that did not really bother me. The location was perfect, my room was large, service was friendly and helpful, internet was free and fast, breakfast was good. What more do you want in a hotel? With the excellent rate I got, I was more than satisfied.", "title": "Nice location", "user": "Americannj", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 128860187}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Nice hotel, good attitude, normal brekfeast! Spa area is very good and important for BadenBaden visitors. At my next visit to BB I'll choose this hotel again - without any doubt", "title": "Very Good!", "user": "Nellija", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128661745}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I'm a little surprised at the recent negative reviews of this hotel. I stayed there for 4 days and it was terrific. I did have a room in the newer section of the hotel though, and this may explain the difference in my experience. My room was a decent size, clean, well presented and very comfortable. The hotel facilities were very good, and the staff were very friendly and efficient. The hotel breakfast was excellent and pretty good value. The Blu is also well located in the stunningly beautiful town on Baden-Baden which is a joy to walk around. I would certainly recommend staying at the Blu to anybody visiting B-B.", "title": "Nothing wrong at the Blu", "user": "Richard H", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128228394}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Booked 2 nights there for my sister-in-laws' 30st birthday. Contacted the hotel directly to emphazise how important this reservation was for me. My brother and my sister-in-law were to spend Easter weekend there without their 3 kids and I wanted this to be a really unforgettable moment (well it was unforgettable, but not for the same reasons). I printed out the brochure the hotel send and gave it to them to have a first look of the place they will be staying in. They were really happy when looking at the pictures.", "title": "Terrible!", "helpfulness": 1, "user": "Zivana", "date": "April 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 127729234}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We had a superior room in the newer wing of the hotel. The bed was extremely comfortable and the room was well appointed. However, this part of the hotel does not have air conditioning and at times the room was hot and oppressive. The room looked out onto the roof of the pool area and although this seemed to be a well intentioned ecological project it looked unkempt and scruffy. The indoor and outdoor swimming pools were most enjoyable and the terrace and gardens very pleasant. Parking and spa tax added sum €20 to the bill for one night. This was almost an extra 20% and expensive.", "title": "Comfortable and well located", "helpfulness": 1, "user": "Lavarcham", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132470345}, {"rating": 2.0, "stay_parameters": "Stayed June 2012", "text": "Old rooms / furnitures with a strange smell. The pool area is nice and clean and has comfortable sun chairs arround. The stuff is friendly as expected in a 4* house. Breakfast is absolutely overpriced, same the car park. Location is OK, Casino is just 5 minutes walk.", "title": "Old and expensive", "user": "BorHor", "date": "June 18, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 132229889}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "From the images on the computer my friend and I were expecting grandeur and luxury, however our expectations were not fully met. In retrospect we paid a very reasonable price for a two night stay and so will still not grumble. We travelled via public transport from the airport and the hotel was on the main road into Baden-Baden and was easy to find. We greeted by friendly reception staff and made our way to our room, (Rather excited to see the double stair case). The hall way was beautiful if not a little tired but in the evening we did find it a little odd to walk past the serving trays and dishes for breakfast. The hotel was rather under occupied as this break was during February and so rather quiet, but it was noted that the communal areas in the older part of the building felt a little tired and could benefit from a lick of paint. Our room was a really good size (Very large infact) for a hotel room with French windows opening to the grounds. We did find the the locations of electrical sockets and mirrors a little inconvenient in a room with two girls as we sat on the floor in front of the large mirrored wardrobes to do makeup and hair etc. We made great use of the spa within the hotel and the thermal outdoor pool was almost magical during the snow! Staff in the hotel bar were very friendly too.", "title": "A great location and friendly service.", "user": "HappyHoliday087", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131473365}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "All in all a great stay and would consider staying here again.", "title": "Radisson Blu Badischer Hof Hotel", "user": "JOTED12", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131157657}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Absolutely amazing place. The hotel is situated convenient to the centre. Thermal pools fabulous. There was some confusion when we booked in as we paid for standard room, breakfast and car parking but we were upgraded with no extra charge. The breakfast was nice but would not pay the asking price for it. The rooms were fabulous. Staff very polite.", "title": "Great location , nice rooms , very courteous staff", "user": "Pravin T", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130881061}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We were 4 friends and to get twin beds were told we needed an executive double rather than a basic double and the rooms were really nice. Lots of space and a balcony with sun loungers. We had air-conditioners and had no problem with noise.", "title": "Great rooms and great location", "user": "KCS", "date": "August 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137386278}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Like the others have said the hotel is dated and feels like a 3/4 star. The decor is old. The TVs are big & old and not easy to watch as tucked in a shelf. Don't normally watch TV much when away but was looking for some Olympic hilights!!", "title": "Insist an a room at the back, otherwise avoid!", "helpfulness": 1, "user": "PvLAchterveld", "date": "July 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 135261232}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "One reason we selected the hotel was for the outdoor pool but the outside lounging area was tiny which was a shame given the size of the grounds.", "title": "Superb property/Superb Service", "helpfulness": 1, "user": "NoneNeeded1234", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134495925}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Close to town.", "title": "Very good service but need urgently refurbishment", "helpfulness": 2, "user": "SwissCheez", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 133154936}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Would go again", "title": "checked out immediately", "helpfulness": 2, "user": "Michael W", "date": "June 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 132824688}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 53, "average": 61, "very good": 74, "terrible": 31, "excellent": 43}, "aka": "Radisson Blu Badischer Hof Hotel, Baden-Baden Hotel", "slim_ranking": 0.636363636364}