{"user_rating": 4.5, "review_count": 1955, "name": "Radisson Aruba Resort, Casino & Spa", "reviews": [{"rating": 4.0, "title": "Can't go wrong with this place!!!", "text": "Stayed at the Radisson from 6/30 through 7/5 and was thoroughly pleased with our decision. We had a delux ocean view and I'm glad we paid the extra for the view. Check in was easy, but a bit slow (hint...take a cab and beat the DePalm Tour Bus people). Had requested a king but got doubles and were told we could change on Friday, but after getting settled in, a move wasn't worth it. The place is gorgeous with all the open-air lobbies and restaurants. Just lovely. We were able to secure a palupa on the beach everyday, but were down there by 9:00. Last day we got the last one and it was 10:00. The pools are great and Gilligans beach-side type restaurant is right between the ocean and the pool.", "helpfulness": 7, "user": "VegasLovers", "date": "July 7, 2004", "id": 2275306}, {"rating": 4.0, "title": "EXCELLENT Place to stay", "text": "We too checked out the other resorts and next time we may try the Hyatt, but only to be different. The balconies at the Hyatt were only step-out types so they are nothing compared to Rad, but the view was still spectacular. If you're the type who enjoy lots of time on a blacony, go with the Rad. The Wyndham was very nice as well.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 6, 2004", "id": 2268914}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "For the casino folks out there, we visited every one. Favorite for winning was the Rad, although small, but staff and bartender were very friendly. Hyatt casino is nice too and a bit bigger. Favorite for looks and \"glam\" may be the Wyndham. The LaCabana is mostly locals, but I had fun when I accidently landed on a foreign language slot!! If you find yourself downtown at night, the casino there is OK too. Seaport casino at the marina is way locals and very small. All were fun overall.", "title": "Radisson Aruba", "helpfulness": 2, "user": "josi65", "date": "July 5, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2267708}, {"rating": 4.0, "title": "Radisson = 4 stars", "text": "We had a fabulous meal at El Gaucho and Flying Fishbone. FF was sooo romantic. Make reservation for 6:30 and catch the sunset. One night we took the Kanuko KooKoo bus party. Great fun. THe house where you stop to have dinner is just something else to see. Big surprise as we thought it was going to be like ribs on a picnic table kind of thing. No Way. It's the ambassador's house (I think) and all open air and open to all partiers to walk through. I wouldn't go on this unless you like to drink and party though. We saw a couple of couples that were just hating it...or least it looked like it.", "helpfulness": 4, "user": "horn1Austin_TX", "date": "July 3, 2004", "id": 2265385}, {"rating": 5.0, "title": "Best Hotel in Aruba!", "text": "The Natural Bridge is a must and easily driveable with just a regular car. If you want to do the Natural Pool as well, rent a 4 wheel jeep and hold on. It was great fun although a bit scary at times. For those of you who hiked it...you're my hero! We saw the ATV tour folks come zippin by us...next time...we're going on the ATV tour. Looked more fun and less scary. And the rock formations along the way were spectacular. Does anyone know why there are literally hundreds of little mountains of rocks stacked up? We made out little moutain too...just not sure what it stood for. We only rented the jeep for a day, and cabbed it everywhere else. The bus ran for 2.00 roundtrip and was a good alternative. Next time we'll get a car for longer.", "helpfulness": 6, "user": "NhBeaglemom", "date": "June 30, 2004", "id": 2241084}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "Our Radisson experience was fabulous! Upon check-in, we were assigned a room in the Curacao tower. A good room, but we preferred something in the Aruba tower. So, the next day, they facilitated a smooth transition to our new room. MUCH bigger, MUCH better view - glad we switched! Never a problem securing a palapa - any time of day - and it states quite clearly that tipping is optional. Pools were beautiful. What stood out most about our experience at the Radisson was the staff. Friendly people were everywhere - from Esther at the Laguna (for breakfast) to Pedro the bellman to Luisa in housekeeping. We felt the staff to be incredibly warm. Radisson Aruba deserves its excellent rating!", "title": "As Good As People Say", "helpfulness": 1, "user": "DesertDweller32", "date": "May 16, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 2062548}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "We loved the location of this hotel since it's across from many restaurants and stores. We searched many hotels and decided on this one based on reviews, price and location. We were quickly disappointed as soon as we arrived after the checkin experience. It took forever! She was not helpful and we ended up having to ask for the manager after she gave us the room locations. We were a group of three families and the rooms were all over the place and she said there were only double beds. Somehow the manager had king rooms but we did have to pay for the upgrade (which she didn't even offer to us). Also during checkin they didnt describe the property at all and how the hut reservations worked. Maybe they are just used to repeat guests? We had to call down later with all our questions. The rooms were great...we were in the Aruba tower which were recently upgraded. We went to the \"a la carte\" restaurant for dinner which was basically buffet and it was so crazy how bad the service was. On top of that there was an 18% tip already added to the bill. The grill station took forever to get what u wanted. The flambe station never actually flambes bc they use an electric stove. It was so odd that theywould eeven have that. Housekeeping was great. So friendly. The bartenders and waiters really need some training on service. I'm not sure if it's because they are already getting 18% but they seem like they really just don't give a care! One of the bartenders made such a big deal that I asked for a drink without ice...really? Overall we had a good time especially for the location of the hotel but the bad service really leaves a negative impression of the Radisson. This was our second trip to Aruba and for the next one I'm not sure if we'd go back.", "title": "Great location, bad service", "helpfulness": 1, "user": "cctravels80", "date": "June 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 164277745}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My girlfriend and I stayed here Friday 6/10 through Saturday 6/15. My experience with the Radisson started wonderfully weeks before we even got there. I had a special request in which I contacted the GM Mark directly about and he got back to me within hours. From the second we got out of the taxi to the second we were in our room was no more than 10 minutes. The front desk staff was amazing and very quick and knowledgeable. We dropped our bags and headed to Gilligan's for some lunch which hit the spot (small menu but tasty food). After lunch, we took a walk around the hotel to get accommodated--the grounds were beautiful. They are meticulously maintained. It seemed I couldn't walk further than 20 feet without seeing another groundskeeper doing some sort of work. We had breakfast every morning at Laguna for the buffet. A good selection of food and the omelet station cooks had no problem with me being so picky. Corniss, a beach waiter, happened to be working breakfast one day covering a shift and he gave us some great Island information as to where to go, what to do, etc. We sat on the beach every day from 9AM to 6:30PM. It doesn't get any better when you leave your room and in 100 steps, you are at the water's edge. As others have said, Palm Beach is a public beach. One day there was a cruise ship in port and the beach atmosphere was miserable. The \"gentlemen\" on the beach sell the cruise patrons umbrellas and chairs and they set up in front of the palapas. These people are loud, obnoxious, disruptive, disrespectful and could care less about the people staying around them. Thank god they all left at 4PM and did not return the next day. That was the only situation that put a damper on our day for a few hours. We spent some time by the pool to get away from the commotion. The hotel had a security guard at the top of the beach preventing cruise ship patrons from entering the hotel pool area. This was a BIG plus! I looked forward to eating at Sunset Grille which unfortunately was closed due to renovations the week I was there. I wish the lady told me that when I made reservations with her weeks before! No big deal. The rooms were clean and comfortable. We lucked out and got a corner room which was more spacious. It's not a Four Seasons room but it was clean and comfortable and that's what counts. Canita, the housekeeper, did a wonderful job and was very friendly. The location of the hotel is perfect. It is across the street from a ton of restaurants, bars and shops.", "title": "Amazing is an understatement....", "helpfulness": 1, "user": "Michael K", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164266662}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "All in all, this was a great trip and we look forward to returning!", "title": "Pearl of Palm Beach", "helpfulness": 1, "user": "Nina L", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164096382}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "When we planned our trip to Aruba for the Soul Beach Music Festival, our travel agent suggested The Renaissance but thank goodness my cousin did some research and asked that we be booked at the Radisson instead. Though the Radisson was further away from some of the \"action\" we didn't feel the slightest bit cheated partly because once we got there we skipped alot of events in favor of relaxation which the Radisson offered in spades!", "title": "There's a Reason Why the Guests Come Back for More", "helpfulness": 1, "user": "FamilyMan13", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164026771}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Palm Beach Area where the Radisson's located is in a premier spot. Though our room/bathroom/balcony seemed just a bit small, we spent most of our time lying along the pristine beach that seems literally 100 paces from our hotel. To me, the biggest selling points of a vacation that keep you coming back are: 1) where you were 2) what'd you eat (I'm a foodie) and 3) how were you treated? The Radisson knocks it outta the park on 2 of 3 of myrequirements. The only area of improvement is the taste and quality of the food in both the buffet area and the casual dining spot. It was lackluster at best--very middle of the road. It's not an all-inclusive spot so feel free to venture across the street for great pizza at Casa Tua and other spots. I had great grilled branzino elsewhere. All in all the Radisson and its uber-friendly staff made me want to return.", "title": "Only 7 days til we return to the best place on earth!", "user": "Debbie C", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164020381}, {"rating": 5.0, "title": "Soul Beach Music Festival - Great Hotel", "text": "I stayed here May 28 - May 31, 2004 Memorial Day weekend. The hotel is beautiful! (Keep in mind, My choice of hotels are W's - New York, Westins, former Swissotel in ATL, Iberville Suites/Ritz in New Orleans). We came to an event called the Soul Beach Music Festival - don't waste your money on that because the festival is overpriced and not worth it! However, that event was not sponsored by the hotel. The hotel is great. The food was great especially the restaurant near the beach. The casino ain't no Las Vegas so keep that in mind but it is cool we walked through (we stayed at the Luxor in Vegas this past weekend - read my reviews there next). At this resort it doesn't matter where your view is, garden or ocean. You won't spend much time there because the beach is beautiful. You can go down to other hotels and eat or hang out there if you want. We originally had an ocean view with double beds but we traded for a garden view with a king bed! It was worth it. The rooms are really clean and comfortable (see through showers are nice). Ok, if you are worried about the lizards and iguanas don't. The tiny lizards are like the ones here in America, but those huge IGUANAS, they don't bother you, you just have to walk past them and keep going, they won't move. However, that wasn't the case for me, I am just scary I always went the other way or had my boyfriend pick me up. They are everywhere but not running rampad or anything. I saw about 4 Large Iguanas the entire time but NEVER saw any at night! I would have gone crazy! When they say LUSH GARDENS..they mean LUSH because there were bushes and stuff everywhere...really exotic and nice. I haven't stayed many places in the carribbean but I will definitely go back to the Radisson! Oh yeah, if you want to get out of the resort and eat for cheap, go out the front of the hotel, make a left at the street, walk down the side walk for about 2 minutes and across the street are 3 little restaurants that have the greatest snacks and food, even steaks for cheap! The hotel can get pricey! Don't eat the McDonalds, it made us sick, the sodas had alot of sugar in them and you could taste it! Beers are little mini 10oz. but very potent! Also, we learned that many ATM/Debit/Creditcards don't always work except at hotel. Please take as much cash or travelors checks as you think you may need/ they have western unions! Be on time for your plane because there is only one line for each airline and everyone seems to be leaving at the same time. Overall it was a wonderful trip and we are making plans to go back next year! Also Chaka Khan (singer), Omarosa Matigualt (The Aprrentice), and Nick Anderson (NBA) stayed there this weekend so you know for your celebrities, it has to be a great place!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 11, 2004", "id": 2182812}, {"rating": 5.0, "title": "A little piece of heaven", "text": "What can I say but simply AMAZING!!!!! My then boyfriend now fiancee and I went there in October of 2002 and are still talking about it. We spend eight days in heaven. Everything to us was absolutely wonderful, not one thing to complain about. We have both traveled to many island and nothing compares to Aruba and this resort. The grounds were very very clean. The pool area was beautiful and lets not forget the beach, FANTASIC!!!!! You couldn't ask for a better beach. All the restaurants food was great, even though I do suggest you take a cab ride and go out to eat, all the restaurants we went to were excellent. The staff was super friendly and very helpful. The rooms were also very clean. All boats going on snockeling trips and sunset cruises all leave from the pier on the hotel premises, which is great cause you don't have to get into a cab to get there. What else can I say but it was the best vacation we have ever taken and are planning to go back for our honeymoon.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 1, 2004", "id": 2142570}, {"rating": 5.0, "title": "YOU MUST STAY AT THE RADISSON!", "text": "My husband and I spent 5/3/04-5/8/04 in Aruba at the Radisson for our honeymoon and we had the best time ever!!! I must tell you, I had the HARDEST time trying to choose between the Hyatt & the Radisson before we left. I even spent so much time here on TripAdvisor to help me make my decision! Finally having decided on the Radisson, it must've been the best decision I made ever!", "helpfulness": 22, "user": "Cindie L", "date": "May 21, 2004", "id": 2095220}, {"rating": 5.0, "title": "WOW! Don't Miss It!", "text": "Don't get me wrong. You cannot go wrong with the Hyatt either. However, here is what I felt the Hyatt lacked... (1) The balconies on the Hyatt were minimal if not lacking. All you can basically do is simply step out on the balcony. Now, if you truly think about it, yes, you don't NEED to have a balcony. However, it is nice if you'd like to take in the scenic ocean and beach and just read a paper in the morning or relax and enjoy the scene at sunset. This aspect truly depends on your own personal preference. Hardly anything to write a negative review about, but nevertheless, the Hyatt's balcony IS lacking in space. (2) The pool area at the Hyatt I felt couldn't quite compare with the pools at the Radisson. Furthermore, since the Radisson has ZERO ENTRY pools, they weren't anywhere near as crowding as over at the Hyatt. I even felt as if there were too many \"kids\" at the Hyatt pools... But as I say again, hardly something to write a negative review about... Just personal preference. (3) The Hyatt's design and layout was BEAUTIFUL... something you would EXPECT at a Hyatt. But it didn't have the same effect as the Radisson did. The Radisson truly seemed to have more of a \"Caribbean\" feel to it that I was looking for. (4) I've also heard (not seen) that the Hyatt rooms were much smaller in size to the ones at the Radisson, unless you booked yourself into a suite or similar level. That is also personal preference.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 16, 2004", "id": 2063554}, {"rating": 5.0, "title": "Gorgeous Resort!!!", "text": "On to the Radisson! (1) The rooms were fantastic! The mahogany four poster beds were amazing. The teak wood furniture and the wooden slats for the doors to the bathroom and balcony were so tasteful! And the balcony was very good in size! The marble bathrooms were gorgeous~ I must tell you, try and book yourself into the Aruba Tower rooms. They have 3 towers, Aruba, Bonaire & Curacao... The Aruba Tower is the main tower and their rooms are larger and have better views in my experience/opinion. They had originally booked me into the Curacao tower until I requested them to move me to the Aruba Tower, and they honored my request and THEN SOME by putting me on the 8th floor, which is the concierge level! It was spectacular. The view from our room was AMAZING!!! (deluxe oceanview room) (2) The pools were beautiful and were NEVER crowded! I loved this aspect! (3) We had NO trouble whatsoever securing a cabana on the beach and never had to wait for one either! Before we arrived, we heard horror stories of having to wake up at 6am to sign up for one. Thank GOD we never had to! Loved it! OVERALL, the Radisson was spectacular~ You wouldn't expect it, hearing that it's a Radisson at first, but take my word, you won't regret it! We can't wait to go back!!!", "helpfulness": 3, "user": "Janet T", "date": "May 16, 2004", "id": 2063207}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We've been to Aruba many times and the Radisson is our favorite resort. We just booked a return trip in November. The beachfront is probably the best on the island and the location is ideal. During our recent trip this past March, I had the unfortunate experience of needing immediate medical attention during the early morning hours. My husband went to the front desk to inquire about a nearby doctor, and within minutes a doctor was in contact with me. I am so grateful to the Radisson staff for immediately assisting with this frightful situation. I highly recommend this resort to anyone looking for a great vacation!", "title": "We're booked!", "helpfulness": 3, "user": "CorieW", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164508864}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Had a great family vacation at the Radisson Aruba... we arrived late and were still able to get connecting rooms. Grounds are beautiful, staff is outstanding. I walked up and down the beach and the area in front of the Radisson is by far the best. It is the largest and cleanest beach. The hotel is located near many restaurants and shopping. The rooms have a mini fridge and the beds are comfortable. Not all hotels in the high rise area have full balconies but the Radisson does. The casino was small (they all are!) but fun. Check out was great, they just slide your bill under your door the last night. We were even able to get a taxi pickup near the parking area so we didn't have to carry our bags all the way through the grounds to the lobby. Hint: rent a pool side cabana if you can. It was only $29 a day but well worth it! Each day after breakfast we went down and they had our chairs set up with towels, fan running, and even a cooler with ice and water. The only drawback to this hotel is the limited number of rooms with an ocean view. I did miss seeing the water from my room.", "title": "Best Beach", "helpfulness": 2, "user": "zottDallas", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164505284}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This was our first time in Aruba, and was glad to have chosen Radisson. We had a perfect stay, at the best location of Palm Beach and the hotel is great.", "title": "Excelent location, rooms, breakfast and service", "user": "Lorenzo B", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164406016}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Special thanks to people there, that made our stay very pleasant, Carita helped us a lot with our room and what ever else she could do to assist us, Rosita at the front desk received us very weel when we got there with problems on our reservation, Tasha also was very nice to get us one more imediate reservation, and Frank assisted us at the checking out...To all of you our thanks.", "title": "Fantastic time! Great service! Great location!", "user": "misterpinkerton", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164375624}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "If you are going to Aruba consider staying at Radisson, I will be back there as soon as possible,..", "title": "Truly paradise", "user": "Marie B", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164365140}, {"rating": 5.0, "title": "The Radisson is where it is at", "text": "First let me say my vacation with my husband in Aruba at the Radisson was spectacular. I have been to many islands and found Aruba to be so breath taking , so clean and refreshing. We chose to stay at the Radisson and felt we could not have made a better choice. The people were so hospitable and went out of their way to make our stay a most enjoyable one. The beach so clean and the food was superb. The grounds were done up exceptional with tropical parrots, waterfalls, fish, along with the landscape. As a matter of fact after we came back from our trip it was days later when I soon had my very own parrot in my house, not that I needed to be reminded of our stay but to take me back there living here in the USA. I have to extend my warm gratitude to the 8th floor staff and also to the Sunset Grille for their upmost and personal ambiance that they extended. Actually my thanks to all staff members that were there during our stay. Ingrid thank you....if it weren't for you I wouldn't have my parrot. Looking forward to coming back in February. You won't be disappointed if you go to Aruba and stay at the Radisson Hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 30, 2004", "id": 2230359}, {"rating": 2.0, "title": "Rooms are for 3 star hotel", "text": "We just came back from Radisson Aruba resort. We were there on the week of June 12 of 2004. I was disspopointed with the room as soon as I walked in - the room that was supposedly a garden view had a parking lot view. So, we asked to switch the room and got another 2 choices, one of them was at least having a partial garden view. The room where we were staying had a safety locker broken, the \"impossible to open\" terrace door and the spotted sheets. The first 2 things were fixed promptly, with the 3rd one I decided to live, but I didn't have a good sleep thinking about it. The furniture didn't seem new to me and the smell from the closet was simply disgusting.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 21, 2004", "id": 2209132}, {"rating": 5.0, "title": "Wonderful Honeymoon!", "text": "The hotel staff and all Arubians are very friendly people and we could not say enough good words about them. Yet I could not understand why \"Radisson\" is rated so high and how could it be even closely compared with \"Westin Diplomat\" in Florida that is also rated as 5 star hotel. I mean I heard that American 5 stars and foreign 5 stars could be different, but I didn't know it is going to be that much of a difference.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 21, 2004", "id": 2208961}, {"rating": 4.0, "title": "Radisson is the place to stay", "text": "Radisson's beach is beautiful and clean with the nice service - it is really something that probably other cheaper hotels didn't have.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 21, 2004", "id": 2208296}, {"rating": 2.0, "title": "It was Ok", "text": "\"Laguna\" cafe (that is on the territory of the hotel) is great for breakfast and \"Rumba Bar and Grill\" restaurant in downtown is absolutely amazing with the delicious food. There are other great restaurants there too like Argentinian one and the \"Smokey Joe\" - all are just couple of minutes walk from the hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 11, 2004", "id": 2183133}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here in May 2012 and June 2013. The resort is beautiful. With trees and waterfalls. The service was excellent and the staff is friendly and remembered us from last year. The hotel is across the street from shops and restaurants and within walking distance to two malls. The beach in front of the hotel has smooth sand and is not rocky (as it is in some other areas of Palm beach). There are live bands in the afternoons and evenings. The bands play all kind of music, from reggae to Tina Turner and are alway excellent.", "title": "We love Radisson Aruba!", "user": "shemoves", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164889627}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The week we spent at this hotel featured the most cordial staff and beautiful beach you could dream of. Across the street is a restaurant strip to satisfy many tastes and there are many small shopping spots too. We liked the dining options associated with the hotel too.", "title": "High rise with high value", "helpfulness": 2, "user": "Christine Y", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164791276}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "On walks around the resort I met several exotic birds. These magnificent tropical species occupied individual cages and had names that invited me to want to get to know a couple of them.", "title": "Wonderful Experience", "helpfulness": 1, "user": "Michael Y", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164786973}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The palapas service was reliable; we rented for a week. Being at the Radisson beach and the Radisson Aruba itself.", "title": "Great Place w/Options", "helpfulness": 1, "user": "Colorado_Freeskier", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164734326}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Next time we'll try to arrange dates to take in the Tuesday's manager's welcome reception and the Friday Italian night. Next year in Aruba!", "title": "Wonderful Anniversary trip", "helpfulness": 2, "user": "Vasoccerchick", "date": "June 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164724517}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I stayed at the Radisson a while ago in Aruba!! I absolutely loved it, it was an amazing experience. Just to let you know the food was better off the resort. Don't get me wrong its good on the resort but better off the resort. Theres a place downtown called fisherman something I forgot sorry but its on like a back street the food was so good!! Aruba is a great time!!", "title": "Beautiful", "user": "Tyrisha626", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164700544}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I will never stay at another hotel in Aruba. The trip was perfect all due to the hotel. We traveled with a group of 3 couples, so the hotel manager worked really hard to coordinating our rooms.", "title": "Amazing Experience", "helpfulness": 4, "user": "midgetbrown", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164651994}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The beach at the Radisson is the best. Even with the hotel fully booked, the beach is so large, it was never crowded. The sand is nicer and beach wider.", "title": "Unexpected Radisson", "helpfulness": 3, "user": "Diana H", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164622773}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We did not do the all inclusive and only booked the breakfast pass, which was great. We filled up each morning and then had a late lunch or early dinner.", "title": "Best Place to stay!", "helpfulness": 2, "user": "FutureArubian", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164590060}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We rented a jeep through Thrifty at the airport the day we arrived for only two days. We checked in and then drove the next morning to Malmok and snorkeled on a beach on the side of the road. Look for the snorkeling cruise boat and then jump in there, the fish were amazing. We left there and drove the grocery store near the hotel. We loaded up on wine, beer, cheese and crackers for happy hour on our balcony. We then turned the car in right near the hotel after unloading grocery buys. Total was only $99! The transfers for 6 people from the airport would have been more. We took small beach insulated totes/lunchbags to carry a few beers to the beach each day to save. The Rad. also has a happy hour bogo every day at 4pm.", "title": "MIRA SOLO COCKTAIL BAR", "helpfulness": 4, "user": "Mark L", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164511985}], "location": {"country": "Caribbean", "city": "Palm - Eagle Beach"}, "stars": 4, "variance": {"poor": 61, "average": 169, "very good": 577, "terrible": 30, "excellent": 1118}, "aka": "Radisson Aruba Resort, Casino And Spa", "slim_ranking": 0.291666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}