{"user_rating": 4.5, "review_count": 633, "name": "Radisson Blu Hotel Cebu", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "An extremely friendly and helpful st aff from the porter who opens your taxi door,the waiters and bellmen,the pool staff and above all the staff on the front desk,especially Miguel.", "title": "Excellent staff and location", "helpfulness": 2, "user": "Philippinebob", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115597445}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Excellent rooms!", "title": "Loved it!", "helpfulness": 3, "user": "Mishy_88", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115597267}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Close to Cebu's pier,S&R, SM Hypermart and above all,right acrooss the street fromgreat shopping at SM Mall.", "title": "Great Service..Polite Staff..would definitely go back and recommend", "helpfulness": 1, "user": "ecohotelier", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115411978}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "A bit disappointed in breakfast, I ate typicall Western and my wife ate Filipino, adequate at best", "title": "Perfect in every way...", "helpfulness": 2, "user": "ec1966", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115191857}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Duration: 4 days 3 nights", "title": "BRILLIANT, BRILLIANT, BRILLIANT", "helpfulness": 1, "user": "leedsfanseverywhere", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114981341}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I live part-time in the Philippines for my job. I live in Manila, but our second office is in Cebu in the South and when I am there I need a comfortable and supportive environment to hang my hat. I was fortunate to have stumbled on the Radisson Blu by default as I was so amazingly disappointed by both the Waterfront Hotel and the Marco Polo Hotel (where I found unbelievably insulting management and ridiculous service). This hotel is lovely and clean and the most comfortable business hotel I have ever had the pleasure of staying at. Within moments of entering the lobby you can see and feel both the attention to detail of the grand \"open\" space design and the warmth of the people. The staff is lovely and supportive and when you are far away from home, it is such a delight to have people call you by name and welcome you back. The restaurant features, beyond a doubt, the most extensive and amazing buffets (breakfast buffet was included in my stay). The options are extensive, but being from California most impressive to me was the ridiculously huge availability of fresh vegetables and succulent fresh fruits, which made my stay even that more enjoyable. The fitness center is exceptionally appointed and the staff is attentive and remembers your every need. A trainer is also available to help with machines or any necessary guidance you may need. Room service, nearly a must for a weary business traveler who works during the night is astonishing. Where on earth can you get a more delicious bowl of pumpkin soup with a shot glass of heated maple syrup topped with cream on the side? Every attention to detail is paid at this hotel, with special \"extras\" like shower gel and a shower \"puff\". Staying for weeks at a time in one hotel can get old, but not when it feels like everyone knows you and wants to make certain you are comfortable at every turn. The SPA is amazing and working at night often causes one to need a good massage, which is a highly recommended benefit of this gorgeous hotel, it is not a \"cheap\" massage, but it is well-worth the price and the lovely treatment rooms and gracious staff are worth every penny. The hotel is conveniently located next to a major mall, so additional supplies that might be needed for any journey are readily available. The pool is gorgeous and the attending staff would not let you sit without handing you the appropriate towel for the occasion. The hotel is beyond a dream for any business or leisure traveler and as an extraordinarily picky American (I can freely bash myself at this point), I can attest that this hotel passes even some of my most demanding standards with flying colors. I will be back again and again and I hope others will follow but not too closely because I would like to make sure my room is available. :)", "title": "My perfect home away from home", "helpfulness": 2, "user": "courtneyb", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117281873}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "I would definitely recommend this hotel! So fresh so new and the staff are courteous food at Feria offers the best buffet comparable or even better than Spiral Buffet at Sofitel. The room we got is the business class floor on the 10th floor. It has everything! Love love our stay here!", "title": "The best hotel in Cebu!", "helpfulness": 1, "user": "MsRoyalHotness", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117255219}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This hotel is a 5 stars for sure.its a new magnificent bulding , colossal and modern style , but beautifull , with an incredible gigantic lobby , design with taste and simplicity. ( it look like the Meridien of Chiang mai , is it the same architect?)", "title": "radisson in cebu", "helpfulness": 2, "user": "superpasmal", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116969833}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "All is sober and nice.", "title": "Awesome Experience with Radisson Blue", "user": "Bulaga", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116919607}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The staff is one of the most professionnal staff you could meet.", "title": "Very much liked my brief stay", "helpfulness": 1, "user": "doctorfoxtrot", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116810318}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Reservation:", "title": "Best city hotel experience in Cebu, except for the FO receptionists", "helpfulness": 2, "user": "Toni C", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116702406}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "1. Prompt reply. It was okay.", "title": "Good night sleep!", "helpfulness": 1, "user": "dugong78", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116701628}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Check In:", "title": "Lovely hotel, eat elsewhere.", "helpfulness": 1, "user": "K_travel_freak", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116573875}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "2. We were greeted courteously by the concierge. It was a warm welcome.", "title": "Newest Kid on the Block", "helpfulness": 1, "user": "midusa1", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116210172}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "3. Hotel is located close to SM, which is very convenient for a business visit.", "title": "Decision to stay here could have not been any better", "helpfulness": 3, "user": "kuyajepwi", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116086826}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Impressive hotel and great location. Stayed in 16th floor and the view is amazing. Excellent service overall. Would definitely stay in the near future.", "title": "Perfect place to stay overnight before a long haul flight.", "helpfulness": 1, "user": "danomawn", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114953170}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "A four star hotel made for good business center, and conventions! Radisson hotel is naturally a nice place for business conventions, the function rooms are separated to the other halls. and the meeting that we had is truly amazing, no interruption, good facilities used, the sound systems are high tech. plus good staffs and deligent waiters. what else you wants more? this is a good venue ever I went with my colleagues.", "title": "Magnificent!", "helpfulness": 1, "user": "Mindabest", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 114721310}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We booked this hotel in our recent stay in Cebu City because it is Radisson Blu and it's the first in the Philippines.Upon entering the hotel, one will not missed to observe its very spacious and grand lobby.I loved the high ceilings and the way the lounge chairs, sofa and even the lobby bar were situated. Check-in was done very efficiently and the front desk staff was very friendly,accommodating and polite.I have observed that all the personnels in the hotel were very courteous and smiling - another plus factor.We stayed in a deluxe room on the 17th floor and we had a very nice view of the swimming pool below.The room was very spacious and it has a very nice and modern interior.The beds were very comfortable and the pillows and linens were fresh and clean.The toilet was also spacious and very tidy. There's a complimentary wi-fi connection in all its rooms - another excellent factor for travelers like me who wants to be always connected.Room service was fast and the breakfast buffet was very appealing.It has lots of choices and variety to choose from salads, breads and pastries to fruits. We had a hearty and yummy breakfast!Before I forget , did I mention they had a very big and spacious dining area?Yes they do and I loved the spacing of the tables! By the way, the hotel is also conveniently located across a very large shopping mall-SM.We will recommend this hotel to our clients.To sum it all we had a great and excellent stay here at Radisson Blu and we will be back here next time.", "title": "Great Spacious Hotel!!", "helpfulness": 12, "user": "Adventureonetra... R", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114624279}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Radisson Blu has been my favorite city hotel in Cebu during my frequent visits to the Philippine's oldest city lately. It is just right next to the gigantic mall, SM City Cebu, whose owner also owns the hotel. If the Ayala Center Mall has Marriott adjacent to it, then SM City Cebu has Radisson. Although I prefer Ayala Center to SM, I would still choose Radisson over Marriott. I have also stayed a few times in Marriott and it pales in comparison to Radisson's grand lobby, pool, spa and of course great food. I have one complaint during one of my stays in the hotel and it was related to making up the room. The previous night I had an in-room massage using my own exotic oil so the next day I really requested my room to be made up. The night I came back to my room it still smelled of the massage oil as the beddings were not changed. I furiously relayed my disappointment to the housekeeping. Anyway I think this was a one-off experience as I previously has in-room massages before in this hotel and the next day my room was free of the oil smell.", "title": "Best City Hotel in Cebu", "helpfulness": 1, "user": "kielwin", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114617827}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Hotel Feature Tip : If you are a fan of breakfast buffets then I suggest to have your room rate includes breakfast for two or more persons staying. It is 50% cheaper that way than being charged separately. Also request for rooms that have no doors to the adjacent rooms for a little more private conversations. If you are a fish lover and prefers in-room meal, don't fail to order the deep fried lapu-lapu.", "title": "Loved it, clean, new, shiny, beautiful", "helpfulness": 1, "user": "Caparn", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114585730}], "location": {"country": "Philippines", "continent": "Asia"}, "stars": 4, "variance": {"poor": 10, "average": 29, "very good": 182, "terrible": 5, "excellent": 407}, "aka": "Radisson Blu Hotel Cebu Cebu City", "slim_ranking": 0.0138888888889, "description": "Cebu City hotel's location places guests close to beaches, shoppingLocated on Serging Osmeña Boulevard at the corner of Juan Luna Avenue, this Cebu hotel places guests in the middle of the oldest city in the Philippines. Located just 500 metres from the International Port area, this South Pacific getaway proves to be the perfect starting point for exploring the island of Cebu and its 167 neighbouring islands. The Radisson Blu Hotel Cebu is situated just 11 kilometres from the Mactan International Airport.Transport in CebuCebu City offers various transportation options for travelers. The strategic location of the hotel provides easy access to public transportation. Metered taxis and local jeepneys are within easy reach to take visitors around the city. The ferry terminal is a convenient 10-minute walk from the hotel."}