{"user_rating": 4.0, "review_count": 1233, "name": "Radio City Apartments", "reviews": [{"rating": 5.0, "title": "Excllent location - a home from home.", "text": "Stayed here first week in October 2006. Clean rooms with excellent facilities, staff very friendly and helpful - excellent location.", "helpfulness": 2, "user": "Hughf", "date": "October 10, 2006", "id": 5934517}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The deli next door is great for breakfast and the Italian restaurant at the entrance is excellent.", "title": "I hate to give this secret away but....", "helpfulness": 4, "user": "redmama", "date": "October 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5934100, "likes": {"liked": "— large rooms for a low price", "disliked": "— no bellman"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This place is truly a home from home.", "title": "Great stay", "helpfulness": 1, "user": "Nik109", "date": "October 9, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5930025, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I was on a business trip to New York Sept. 17 and 18th and needed an inexpensive hotel near 6th and 48th streets. American Airlines had Radio City Apts. on it's list of hotels under $300. so I checked out the website. It was right around the corner from my appointments, right around the corner from Times Square and the rooms looked great. I got in around 2am and the front desk gave me my room key and up I went without anyone to help with my bags but I figured I'd reserve judgement. The lobby is a beautifully restored older one and elevators are small but charming. I got off my room and maneuvered down the small halls to my room, a one bedroom suite and it was fabulous. Easily a three to four stars and nicer than the Hyatt Grand where I stayed last time and newly refurbished with a kitchen! The living room had new, lovely comfortable furniture and a tv and the separate bedroom had two double beds, another tv and a gorgeous marble bath, all for $225. a night, what a steal! The AC worked great and the bed was comfortable. The staff was very nice and the location was perfect. I'd stay there again in a New York minute!", "title": "Tiny rooms, grumpy staff, great location!", "helpfulness": 5, "user": "AussieAngel25", "date": "October 8, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5929582}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "Stayed for 5 nights in Sept. / Oct. Great location, small but very clean rooms. Great price. Within walking distance of most places and subway near by also. Staff not over friendly but very obliging when required. Will definately stay again.", "title": "Cheap, clean and great location", "helpfulness": 5, "user": "Annis_s", "date": "October 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5925652, "likes": {"liked": "— Location", "disliked": "— The Bed bugs"}}, {"rating": 5.0, "title": "Loved Radio City Apartments", "text": "Just arrived back from my first trip to New York City and my first stay at the Radio City Apartments Nov 2004. After speaking to many people who have commented on some of the New York accomodation to be shabby, I was a little unsure what to expect but was pleasantly surprised. The rooms were cleaned everyday. The staff were excellent and very friendly and the rooms had clean towels everyday. Also the added bonus of a hob. fridge freezer and microwave which was handy to heat up our left over pizza! The apartments were so central. Minutes walk to and from Times Square and just down the road from the famous Sax department store. All in all a very pleasant stay. Same time, same place next year!!!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 17, 2004", "id": 2830356}, {"rating": 1.0, "title": "Cheaters and a rude staff to boot!", "text": "Our group of 12 stayed here for the 2004 NYC marathon and ALL of us hated it! First complaint is the bait and switch scam the management pulled. Our reservation confirmation promised one night free, but at check-in they refused to honor this offer and charged us for the 5th night and later told us there was a 'glitch' in there reservation system.", "helpfulness": 2, "user": "gypsyconner", "date": "November 12, 2004", "id": 2822296}, {"rating": 4.0, "title": "Great little hideaway!!", "text": "Second, most of our group did not speak much english and the staff had no patience for their efforts when they did try to speak english (which is incredible considering most of the people who stay here are foreign). We Never encountered a friendly staff member.", "helpfulness": 4, "user": "sher", "date": "November 9, 2004", "id": 2813860}, {"rating": 3.0, "title": "Overall good deal but front desk could use some improvement", "text": "Rooms on lower floors are so noisy it is difficult to sleep. Rooms and hallways reek of cigarette smoke. The elevator is so slow, walking up 8 floors seems like a good alternative. All the rooms are shabby at best.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 7, 2004", "id": 2812264}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "I just got back from a short two day vacation in New York City where I took four other ladies. Most hotels will only allow four to a room so we stayed at the Radio City Suite Apartments. It was two bedrooms, one bath, living room/dining area and a kitchenette. The sofa pulled out into a bed. Although the rooms were small, everything was clean and close to Time Square, the theatre and all five of us could stay together. They let us check in early and held our luggage after we checked out. I would stay there again!", "title": "Great place", "helpfulness": 1, "user": "faith2711", "date": "November 2, 2004", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 4.0}, "id": 2801214}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Stayed at Radio City Apartments for one week in August 2006. Although everything’s been said before, I though I’d just post a quick review and a few photos.", "title": "Loved it!", "helpfulness": 12, "user": "chris49", "date": "October 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6018814, "likes": {"liked": "— The location and spacious accommodation", "disliked": "— No dislikes!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Myself and two teens stayed in a one bedroom apartment on the 8th floor. No view, but very quiet room. Paid at check in (which was very quick), room easy to find. Pleasantly surprised by size of room and amenities. Air conditioned bedroom consisted of two queen sized beds, hanging space, plenty of drawer space, TV. Sitting room had three seater sofa (which converted into extremely comfortable bed), one armchair, table and chairs for four. TV also in this room. Large walk in cupboard for suitcases and plenty of hanging space. Kitchen area with oven and hob, fridge/freezer, microwave, coffee maker, cups, plates and cutlery – in fact, everything to cook your own food. Iron and ironing board also included. Small but adequate bathroom with hairdryer and loads of towels, shampoos, soaps, etc.", "title": "Top marks for Radio City :-)", "helpfulness": 8, "user": "lollipopliz", "date": "October 25, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 6008865, "likes": {"liked": "— Location and cleanliness and size of rooms.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The apartment was beautifully cleaned every day. It was a pleasure to come back to after a day’s sightseeing. We didn’t have a lot to do with the staff on the front reception, but they were always extremely courteous. They keep a typed sheet of supermarkets, pharmacies, etc. in the area – do ask for this if you are catering for yourself. There is a locked room at reception where you can leave your suitcases on check out, if you have a late flight.", "title": "Great Apartments in an excellant location", "helpfulness": 5, "user": "Allie123", "date": "October 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5968690, "likes": {"liked": "— Great value for money, location and cleanliness", "disliked": "— The deli next does a great breakfast menu"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "As has been said before, the RCA is in a superb location – on subway and bus routes and a minute from Times Square one way and Rockefeller Plaza the other. On the corner of 49th and Broadway (just across from the RCA) is a bus stop for the free ferry bus to Pier 83 where you can pick up the Circle Line boat cruises. This bus saves you from trying to find your own way there as it goes direct.", "title": "Clean Small Rooms", "helpfulness": 2, "user": "sworl", "date": "October 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5949096, "likes": {"liked": "— Bathroom Was Lovely, And Liked The Fact That It Was Clean", "disliked": "— Small Room Overall"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I will definitely stay at the RCA on future visits to New York.", "title": "Would definitely return here", "helpfulness": 4, "user": "LizzyKav", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5942893, "likes": {"liked": "— Location", "disliked": "— The slow lifts"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Stayed here for thanksgiving and a week into nov in 2004 (also stayed for a week in 2003) cheap, nearby for subways and times square, its not luxorious but all we wanted was somewhere to stay for the night, and it was perfect. will stay again. staff were friendly and helpful, and we did get 2 keys unlike a prev review", "title": "Stayed twice now, no problems", "helpfulness": 12, "user": "ianst", "date": "January 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3097265}, {"rating": 4.0, "title": "great budget hotel in superb location", "text": "We stayed here for 7 nights on the 26th December 2004 ,two adults and two children under age of five.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 24, 2005", "id": 3072865}, {"rating": 4.0, "title": "LOCATION LOCATION LOCATION", "text": "It looked very promising from the outside, the reception are was nicely decorated with a huge Chritsmas tree.However I did find the staff at the desk a little unhelpful,which put me off a bit.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "January 19, 2005", "id": 3016479}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We were on the 11th floor, we were given a choice and opted for ahigher apartment ,so the noise would not be too bad.", "title": "Excellent Property for Value - Location, Location, Location!", "helpfulness": 14, "user": "happytrailstoyou", "date": "January 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3013402}, {"rating": 5.0, "title": "Excellent value", "text": "Lifts were a bit ancient and we did walk down quicker!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 12, 2005", "id": 3002487}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My husband and I stayed at the Radio City Apartments for a week in November. It was like having your own apartment in the city. We would definitely stay there again.", "title": "Great Price and Location", "helpfulness": 3, "user": "YourConcierge", "date": "November 19, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6152894, "likes": {"liked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My partner and I stayed here for 5 nights Mid October 2006 and just loved it! Though the other reviews have said it all before, I just wanted to confirm that they're all accurate.", "title": "Great Stay at RCA", "helpfulness": 5, "user": "KGB_4", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6083808, "likes": {"liked": "— Location", "disliked": "— Traffic"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The room was very spacious and immaculatly clean. Every day, the coffee supplies were replenished so we never ran out. Bathroom supplies were also stocked daily and was great to find good quality toiletries. Bed was very comfortable and firm (no rolling into the middle).", "title": "Location location location", "helpfulness": 2, "user": "2wombats", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6079476, "likes": {"liked": "— Location", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "By far, the biggest bonus was the location - 1 minute to Times Square and 2 minutes the other way to the Rockefella centre - subway stations is on the same block - excellent Italian restaurant downstairs and the Indian restaurant on the other side was also very good.", "title": "Loved the hotel, location, great price for NY!", "helpfulness": 6, "user": "jkloni", "date": "November 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6078773, "likes": {"liked": "— The price and location", "disliked": "— Motel - ish, but still fine"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The only minor drawback was the traffic noise - but that's New York and not too bad considering how close the hotel is to busy roads - 49th isn't too busy but those New Yorkers just love to honk their car horns!", "title": "Not Bad at All", "helpfulness": 5, "user": "dsikula", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6020107, "likes": {"liked": "— Location", "disliked": "— Placing of bed and hardness of mattress."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Excellent location-easy access to many subway lines.Around the corner from Times Square.Approachable,helpful staff. Would definitely return.", "title": "Perfect in every way", "user": "Invermay", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116131107}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at Radio City Apartments in 2008 and decided to stay there again from July 19 until July 24. Not much has changed, but the one good change was that the front desk staff were much friendlier than before. The internet service gave problems and the guy at reception immediately came to help. The only complaint that we have is that the bed and pillows were not up to standard. The mattress was hard and the pillow ... cheap. The rest of the room was clean and had everything we needed. If I had a different budget I would most probably have stayed some place else, but I guess this is still good value for money.", "title": "Second visit to RCA", "helpfulness": 1, "user": "Pampoen", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 5.0, "service": 4.0}, "id": 115968326}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We stayed here for a Girl Scout trip. We had 12 teen girls and 8 adults, and put five people in each of four rooms. The location was wonderful, the apartments easily slept five and the kitchens were so handy. We were two doors down from a pizza place and were able to keep leftovers in the fridge. The furnishings were clean and comfortable. The towels were thick and thirsty (but we couldn't seem to get the staff to realize that with five people in the room we needed five washcloths--even though we had plenty of towels). I will say though that the washcloths were sent up promply each night when we called. It isn't the Ritz, there is no bellman, the furnishings are stock hotel things, but the mattresses were comfortable and the rooms clean. The air conditioning was via window units so I'm sure some would find it loud, but with three other people in the bedroom I loved the white noise.", "title": "Perfect for Us!", "user": "ruthjoec", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115923964}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "The only downside was the scarcity of electrical outlets made it hard to plug in all those phones, I-pods, curling irons etc.", "title": "Exceeded all expectations", "helpfulness": 1, "user": "Sandshal", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115890994}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Checked out of room 609 On the 7/26/11, 2 bedroom apartment. Despite reading all the rave reviews this hotel far exceeded all expectations. Lift speed fine, staff helpful and attentive and plenty of face cloths! As a previous poster said \"if you can get a 2 bedroom apartment grab it while you can\" definitely coming back to NYC and definitely coming back to RCA!", "title": "New York New York!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 3, "user": "Magnolia195", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115871167}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "For the price and location this hotel is great. The room was average size with an efficient kitchen set up. There is nothing grand about the hotel but everything was clean and the staff was very friendly and helpful.", "title": "Great Location", "user": "K W", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 117288453}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "My second trip to New York, a friend recommended Radio city. Location is absolutely fantastic. Room is clean, self contained studio apartment. Free wi-fi. Laundry facilities in the basement (so good to be able to do your own laundry). I will definitely be staying here again on my next visit to NYC", "title": "Home away from home", "helpfulness": 3, "user": "Boi80", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 117008920}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "This was the second time we have stayed in the apartments - this time we had a one bedroom apartment. As before, the room was kept spotlessly clean by the cleaning staff. The front desk staff were polite and helpful whenever we had a request. This is not a hotel - it is a very convenient, well maintained block which is extremely central to all tourist spots. The rooms have excellent cooking facilities if you do not wish to eat out all the time.", "title": "Location, location, location", "helpfulness": 3, "user": "harry036", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116323275}, {"rating": 4.0, "title": "Great value choice for NYC", "text": "We enjoyed our stay at Radio City apartments. We didn't make real use of the kitchen facilities but they would certainly be beneficial to those wanting to save a bit of money ie. having breakfast in the apartment or so forth. The apartment was clean, and the surrounding area was great - a short stroll to Times Square and the subway, taking you to anywhere in NYC! The ebst part is the price - these apartments represent fantastic value for New York. We didnt have any issues re. traffic noise althoug i cannot remember what floor we stayed on. Would definately stay here again if we ever go back to NYC.", "helpfulness": 1, "user": "k17", "date": "August 5, 2011", "id": 116294533}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "good price, great location between radio city and times square just walked around the corner and there we were central to everything. apartments spacious and clean. staff not that friendly however. but it didnt get to us. id def look into going there again if the price was right", "title": "brilliant location", "user": "tadar78", "date": "August 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 4.0, "service": 2.0}, "id": 116221458}, {"rating": 1.0, "title": "Didn't care for at all...", "text": "After reading all the reviews I thought this would be an o.k. place to stay -- wrong! My favorite \"amenity\" was that you couldn't even use the phone for local calls without buying a phone card. Our \"suite\" did not even have a closet. And enough has been said about the elevators. Would not recommend this hotel to anybody.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 21, 2004", "id": 2908539}, {"rating": 1.0, "title": "DO NOT STAY HERE!", "text": "I just stayed here last week and my experience was horrible. Not only is the staff extremely rude, but they are morons, too. They could not have cared any less about my comfort. They are so cheap--they only provide each room with 1 key, and the elevators are too slow. On average, it takes the elevator about 4 min. to even get to your floor, and then another min. just to take you to your desired floor. You could not pay me to stay here again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 16, 2004", "id": 2886716}, {"rating": 5.0, "title": "Home away from home!", "text": "I stayed here in November ‘04 for 6 nights and I would have no hesitation in recommending it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 8, 2004", "id": 2872133}, {"rating": 1.0, "title": "Like Tom Hanks in Big", "text": "Having heard bad reports on some hotels in mid-town NY, we didn’t know what to expect. On arrival, the reception area looked nice and then when we got to the 10th floor, I was a bit worried when I saw the hallway/landing as it looked dull and shabby but we were pleasantly surprised on entering the apartment. We had a two bed apartment and it was spotlessly clean and warm and didn’t think the rooms were too small. Must say it was also great to have the kitchen / living room space and there are a couple of delis nearby. With the daily maid service, it was nice to return to a refreshed bathroom with fresh towels, beds made and removal of rubbish, etc. The lifts are not as bad as some make out – I didn’t find them that slow at all, (might not be as fast as those of the Empire State Building!!) Will definitely be back to stay here again.", "helpfulness": 5, "user": "oscarmadison", "date": "December 4, 2004", "id": 2862476}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "Remember in Big when Tom Hanks stayed in a horrible hotel in Manhattan. The Radio City Apartments is barely a step up from that. It has a cool name, but the place is a dump.", "title": "Will definitely stay here again!", "helpfulness": 3, "user": "scarywife", "date": "November 19, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 2834646}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "hat a great location, around the corner and a few blocks to Times Square , turn and walk the other way to Rockfeller. Stayed for ten days . For breakfast two shops tp Toasters breakfast for two for less than $10.00 Turn left at the corner 2 blocks to 'Smileys deli'- even though he seldom smiled.", "title": "Location, locaion, location", "helpfulness": 2, "user": "terryau", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 118427490}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Great location but make sure you are not located in a street facing front room. We lasted three days with broken sleep before we upgraded to the penthouse suite - nothing else avaialble. Even the GM of the apartments agredd that it 'could be' noisey'.", "title": "Excellent location!", "user": "AndreVarella", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118372960}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Other wise reasonably priced for the location, location, location.", "title": "Catherine", "user": "cemjfm", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118275010}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The location is great.", "title": "Centrally located, excellent value, clean, pleasant, responsive staff.", "helpfulness": 1, "user": "Honesty49", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 118174440}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "In the same square of Rockfeller center and Times Square.", "title": "Great location", "user": "Donmac_10", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118173007}, {"rating": 5.0, "title": "Perfect for Families", "text": "Stayed here 2 nights Jan 5 2005 - great location just off Times Square - We are a family of 2 AD AND 3 CH - ideal for families. Desk staff very helpful. Good deli nearby Recomended to us by another Irish customer - Popular with the Irish.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 9, 2005", "id": 2991740}, {"rating": 4.0, "title": "Location cannot be beat!", "text": "Just back from 5 days/4 nights in NYC. Stayed at the Radio City Apts. after reading generally good reviews on this board. We had a studio apt. with full kitchen and 2 double beds, room 11F. Elevators were nowhere near as bad as I had read about - sure, they were slow sometimes, but nothing to really complain about. Room was newly renovated, clean, fresh towels, coffee and beds made daily. Kitchen was used frequently which helped us save alot of money on meals. Water pressure in shower left a bit to be desired, but we got used to it. Hotel itself very clean. Staff were, as often mentioned, disinterested - but at $99USD/night, I didn't expect a concierge or help getting around. We checked in, checked out and only other interaction with staff involved a polite good morning every day. The location of the hotel simply cannot be beat - walk a block or two to Rock Centre, Times Square, Broadway, grocery store, 5th Avenue shopping, subway to just about anywhere you need to go.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 9, 2005", "id": 2991261}, {"rating": 5.0, "title": "Stayed here 3 Times", "text": "All in all, fantastic location, room and amenities far better than what I expected - for less $100 USD per night. Highly recommend this hotel.", "helpfulness": 6, "user": "pittsbfan2000", "date": "January 5, 2005", "id": 2978987}, {"rating": 5.0, "title": "radio city apartments", "text": "I stayed here from Dec 29 to Jan2, This is my third time staying here and I have 0 Complaints. We stayed in a room on the third floor, it had 2 full beds, stove, fridge and nice bathroom. It is not the Ritz, but for the price and location you can not beat it. Yes the elevators are slow, but if you have patience you will be fine. We just walked down the stairs when we would go out and used the elevator to go up. Yes you need to buy a phone card to use the phone, that was not a problem since we just used our cell phones. Wireless internet worked great, its free right now i guess they are going to charge you after jan 31 possibly.", "helpfulness": 3, "user": "hudsonvalley", "date": "December 28, 2004", "id": 2947552}, {"rating": 4.0, "title": "Great location, comfortable rooms", "text": "I really can not think of any complaints about this hotel. I can not comment on the staff since our only interaction with them was when we checked in.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 22, 2004", "id": 2910607}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Booked this accomodation after reading previous reviews on this site. Value for money, clean, excellent location, would I book again, you bet. My only complaint would be the front desk staff, their stock standard answer to any question re New York was \"I don't know\". I would have thought those working in the hospitality industry would know a little bit about the city they live in i.e. trains ect. Apart from that no complaints whatsoever.", "title": "Greal Location-Value for money", "helpfulness": 2, "user": "tickford", "date": "October 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5901748, "likes": {"liked": "— Clean-Central Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Excellent location - 2 minute walk from Times Square and less then 50 yards from a subway stop. I stayed in a studio apartment with my wife on the 9th floor. The room was quite basic but was clean and functional - We had an ensuite with a toliet and a good shower. TV in the room. Kichenette with fridge, cooker and microwave. Air conditioning.", "title": "Great Budget Accommodation", "helpfulness": 3, "user": "CMonTheDubs", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 5899371, "likes": {"liked": "— Price", "disliked": "— Street Noise"}}, {"rating": 4.0, "title": "Great location & great price", "text": "Only slight draw-back was you can hear the street noise on 49th street with crazy New-Yorkers beeping their car horns! It didn't keep us awake though.", "helpfulness": 8, "user": "NewYorkSept2006", "date": "October 1, 2006", "id": 5895589}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "I would stay here again and would recommend to others", "title": "Loved the hotel and the location!", "helpfulness": 6, "user": "Cute-Puppy-Dog", "date": "September 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5890346, "likes": {"liked": "— Its fantastic location!", "disliked": "— Nothing, it was all good!"}}, {"rating": 5.0, "title": "You can't best this place!", "text": "I recommend the Radio City Apartments to anyone who doesn't want to pay expensive hotel prices in New York. It's great value for money. I stayed in a lovely bedroom which had a really nice bathroom attached. It was great too to have a fridge in the room type I booked. The staff were very pleasant & helpful. The location is super being roundabout 30 seconds walk from Times Square. I'd definitely go back there for a future stay and highly recommend it. Anne Marie (Ireland) Oct 2006", "helpfulness": 5, "user": "nubieyorker", "date": "September 26, 2006", "id": 5879892}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "This hotel was a gem. Myself and 3 friends of mine got a suite and were able to move about comfortably. It came equip with a kitchenette, flat screen tv's in the living room and bedroom, the bathroom was also nice and clean. The hotel was very close to all the action in radio city and it was a 5 minute cab ride from the main New York train station. I would definitely recommend this hotel to anyone on a budget that still wants comfort and wants to be close to the all the sites, restaurants, bars, lounges and attractions.", "title": "I liked it", "helpfulness": 2, "user": "Kholie", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117988759}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "This is my second stay at RCA and it is just as I remembered it: affordable, clean, centrally located and safe. For $548, taxes included, we stayed in a studio apartment for 3 nights. Watch their rates online after your booking for comparison. If it is lower, we called and booked at the lower price.", "title": "Great alternative to a hotel", "helpfulness": 3, "user": "Sky2020", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117550533}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "There is a safe in the main lobby and our items were secure. They offer a luggage storage area if checkout time is earlier than your departure from the city.", "title": "Not the Ritz but did the job!", "user": "Diggidy_dog", "date": "August 29, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117405938}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Central Park is 10 blocks up. 7 blocks south, you'll hit the heart of Times Square on 42nd. Turn left as you leave the hotel and the NQR subway lines are on the corner to take you downtown. Two blocks over and you'll catch the A, C, subway lines to take you to the upper west side. The bus station is a short distance away (42nd and 8th). We rolled our luggage from the bus station to RCA without issue.", "title": "Great location with good rooms.", "helpfulness": 2, "user": "EK123456", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117393826}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Having stayed at NYC hotels before, the difference at RCA is the experience. You can feel like a visitor in a hotel room but having an apartment can lend itself to feeling like you're a quasi new yorker. Besides, when there are plenty of food options at all price ranges within steps of the place, in room dining service doesn't compare.", "title": "Brilliant location, great access to Midtown Manhattan", "helpfulness": 2, "user": "bombaysapphire_11", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117328230}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 38, "average": 100, "very good": 516, "terrible": 27, "excellent": 552}, "aka": "Radio City Apartments Hotel", "slim_ranking": 0.0484848484848, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}