{"user_rating": 4.0, "review_count": 678, "name": "Radisson Blu Edwardian Berkshire", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2010", "text": "Our stay at the hotel was very disappointing. I have stayed at the RENew Providence Wharf for long stays and the only reason I booked REBerkshire was for the good service I have received there, had I known better I would have chosen another hotel. I travel a lot within Europe and US and as a guest it is very common that when available, you are upgraded to a larger room for the reduced price with which you booked originally.", "title": "Disappointed, overcharged, rate inclusives not offered.", "user": "World1979", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 60525877}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I had initially booked a Standard Twin room for 3 nights to invite my mother to a shopping tour in London. Due to the BA strike our morning flight was cancelled and was rescheduled to an afternoon flight hence we called the hotel to extend our stay with 1 night to catch up on the \"lost day\". I was told that we had to change room on the 4th night as all Standard Twin rooms were booked and we had to upgrade to a Delux Twin for £30. Upon check in I asked if the Delux Twin was available for all 4 nights and if we could stay there but for the price of the Standard Twin room for the first 3 nights which we had booked originally and the pay the original Delux room price for the last night, the receptionist checked and answered yes, and that there was a corner room available. I asked the receptionist several times if this was correct and checked the total price for all four nights and she answered yes, corresponding to my calculations. NB! we are both Swedish and one would think this would make things easier, having the same language and all... However, on the check out it appeared that I had to pay the additional fee for the upgrade for each night! = £90 extra! I felt very cheated as until then I had thought that the offer was most generous however, once I had to sign the bill I was told that it had been a \"misunderstanding\" from my part and that I had agreed to an upgrade for £30 per night for all 4 nights.", "title": "Delivered fully on promises made", "user": "DorsetPeter", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59904160}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Needless to say I didn’t want to spoil the exit by objecting to the bill seeing that I had invited my mother to this trip and didn’t want her to feel in any way obliged to share the bill, I signed and left.", "title": "Near the centre and clean.", "user": "DiManMilan", "date": "March 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59893610}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Also due to the \"rebooking\" our room was left unclean, we had to wait until 3pm before the room was cleaned and fresh towels were provided. We also asked the reception to book a taxi to the airport for the day we were checking out and were woken up a day earlier by the reception informing us that the taxi was waiting!? Once again we had to explain that we had booked an extra night and that they had gotten the dates wrong just as they had when the room was left unclean. When booking online we were offered a Special Easter Stay Inclusions from 1st April - 11th April only including -Easter Egg and -2 for 1 dining offer which we did not receive. The staff was friendly, yes, but that is not sufficient when they are inexperienced to handle and maintain a good customer service and meet their guests requirements. As i have to travel to London and stay upwards nine weeks this year due to my work, I will think twice before making a reservation at your hotels.", "title": "Always a pleasure", "user": "nixyChristchurch", "date": "March 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 57830871}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "I would appreciate a manager contacting me regarding this mishap.", "title": "Great Location, some improvements necessaries....", "user": "Athens85", "date": "February 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 56582362}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Recently stayed here with my Wife for our 2nd Anniversary. Its a nice little hotel, tucked away just off Oxford Street. Its ideally situated for the main shops as well as easy transport around London as it is opposite Bond St Station and there are a multitude of Buses running up and down Oxford St at any time of the day.", "title": "Great Location & Friendly Staff", "user": "dannyw1uk", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 65490364}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The staff were friendly and welcoming when we arrived providing clear directions on how to get to the show we were seeing that night.", "title": "Hidden Gem", "user": "ShelaghC", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64717245}, {"rating": 4.0, "title": "Best Location", "text": "My only gripe is that the bathroom in our room was a little small, but to be fair we were in and out of there as we were too eager to get out & see the sights (so much to do in London & so little time!)", "user": "graciegrace100", "date": "April 16, 2010", "id": 61701807}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A full breakfast was enjoyed with a great selection of food. And from a security aspect the in room safes and key card requirement for the lift made me feel that little bit more secure. I would not hesitate to recommend this Hotel and will definitly be back for more!!", "title": "LOCATION & STAFF", "user": "akis77", "date": "April 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 61640824}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I've stayed at many Hotel's in the city of London and try to change it up each trip. I picked this Radison because of it's location. I was very happy with my choice. Though a small hotel it is hidden on a side street just off Oxford. It is a great location within walking distance to Picadilly, Marble Arch, Theatre District etc. Though it's in the main shopping area, it was very quiet, clean, and very good value for the $$ paid. I would defintely recommend this hotel. My room was on the small end, but bathroom very large and defintely sufficient space for the business traveler. I did have room service and the meal was prompt, hot and very tasty. Check out this location it's worth it.", "title": "Calm in the hustle and bustle", "user": "jooliewoolie", "date": "April 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60855530}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed there with may daughter (to carry her shopping bags...;-). The Hotel is well hidden somewhat off Oxford Street, Bond Street Tube right in front. Location is perfect if you want to shop on Oxford and Regent Street and Picadilly. Go for stroll in Hyde Park in the evening. Rooms are small (hey, its London), clean and well equipped. Suprisingly quiet at night for its location even with the windows open. Very friendly and accommodating staff. Can't do better in this location.", "title": "Shopping at your front door", "user": "Jetstream1958", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74763932}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We stayed in a suite on the top floor which benefited from an outdoor balcony. The suite itself was actually an oversized room with a sitting area. The bathroom has a bath and a separate walk in shower. Cleanliness was good throughout, but there were some cigarette butts on the balcony. The bed was comfortable and bigger than normal. Furniture and decoration were quite modern and all fine. Had some food through room service which was quite tasty.", "title": "Good quality hotel in the heart of Oxford street", "user": "Hoods_Travels", "date": "July 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73024216}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Staff were fine but not stand out. The lobby and reception is rather small and the elevators rather slow.", "title": "Great location", "user": "Richykav", "date": "July 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71950457}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The location is right on Oxford Street, so perfect if shopping is on the agenda. The tube station is just across the road so getting to other parts of London is easy.", "title": "Lovely hotel, great location, friendly staff", "user": "Geordie6840", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69783146}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Overall a decent hotel, nothing stand out or amazing, but does its job just fine and the location is very useful.", "title": "Enjoyable stay, especially if you like shopping!", "user": "MDA160", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69647517}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The Radisson Edwardian Berkshire Hote is simply one of the greatest located hotels in London when it comes to shopping. I've been to London several time and this hotel is just perfect. 2 minutes walk next to Oxford Street, located behind Debenhams you are immediately in the shopping paradise of the city.", "title": "Great hotel for shopping freaks", "user": "zuerich_10", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67860215}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We had a Standard Twin Room with two beds and were very satisfied. The room was nice, not too small, quite, clean & nice bathroom and we still had enough space to have our luggage on the floor!", "title": "Great Location, decent hotel", "user": "kssewell", "date": "June 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 67532022}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I can totally recommend this hotel to everyone who loves shopping - of course, especially on Oxford Street.... I love it there!", "title": "Mostly ok, but certainly need to be \"pimped\"", "user": "Ripatti", "date": "June 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 67343163}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "This hotel is located only metres from Bond St station so was a perfect location. Our room on the 2nd floor was very noisy in the morning though (6am traffic on Oxford Street and trash cans being thrown about) and the window did not seem that solid.", "title": "comfortable and good value", "user": "2littlemonsters", "date": "June 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 66239631}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "For a four star hotel could expect a little more polish but the location made up for this, and we paid a discounted price through a hotel booking site in any event so we were happy enough.", "title": "great location great hotel", "user": "susan186230", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65994559}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 43, "average": 95, "very good": 235, "terrible": 33, "excellent": 272}, "aka": "Radisson London", "slim_ranking": 0.276022304833, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Traditional hotel with multilingual staff, situated near shopping in central London; 2 miles to Paddington or Marylebone Stations."}