{"user_rating": 4.5, "review_count": 251, "name": "Radisson Royal Quito Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Every detail is attended to with style. The rooms, furnishings and systems are top notch. It has the best breakfast buffet we ever found. The staff is incredibly congenial and helpful. We didn't like the \"add-ons\" for hotel insurance and tourist tax that were applied to our bill although we declined them at check-in. Two local or international calls per day are free, but that doesn't include local, in Quito, calls. Bizarre. Except for these last items we'd have given it an \"Excellent\" rating", "title": "We were made to feel secure and comfortable", "helpfulness": 1, "user": "SunGod21", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117256146}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This hotel made my stay in Quito, aside from all the sights, of course! The amenities are ridiculous for the price and the staff is wonderful. The staff is honestly the best part--they make you feel like a rock star and are absolutely fantastic to converse with. This hotel is in an AMAZING location and the views are phenomenal. The 24 hr room service--after a crazy night out in Quito--is just awesome.", "title": "Luxury Plus Amazing Staff", "user": "wavypearl", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117032353}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Miss you, guys!", "title": "Good hotel, great rooms", "helpfulness": 5, "user": "SeraDiver", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116136900}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Love, Josie", "title": "Excellent Hotel on all counts", "helpfulness": 3, "user": "EZT", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115909091}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Enjoyed this place thoroughly, everything worked, room was nice and plush, we could keep an eye on Cotopaxi to decide every morning whether it would be a good day to climb it.", "title": "A great hotel at a great price... I will be back!", "user": "JuanFranToronto", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115599010}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Nothing about it is really excellent, but overall it is 'very good\" by Ecuadorian standards. It is very much like an ordinafy american hotel in many ways. This is not one of the \"charming\" boutiques.", "title": "Very Good perfectly describes this hotel", "user": "nthal", "date": "August 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76237352}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "If you have been in Ecuador for very long you surely know the phrase \"its Ecuador\" as applied to many possible circumstances where things don't go quite as expected. For example, at the Raddison, at Christmas time, the bar was not open for several days (and nights).", "title": "Very nice hotel", "user": "tom_brd", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 75359202}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "All in all, however, the rooms do not hold unpleasant surprises. They are spacious as Ecuadorian rooms go. They are Ecuadorian clean. The location is not right where the the action is and not really close to the best restraurants, but a short cab and cheap ride will get you to the action and the restraurants in the area are very good.", "title": "Great experience", "helpfulness": 1, "user": "Tinkerbeth66", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 73919111}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel sits next to the World Trade Center and across from an excellent and expensive hotel with a great bar, a luxury restraurant and a much higher price to go with it.", "title": "Service and Style", "helpfulness": 1, "user": "AmericanSteer", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72625075}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Use this hotel and run across the street for the finer things in Hotel ammenties when ever you are willing to pay a little more. Go around the corner in the World Trade Center Building and find a good and reasonably priced beauty shop.", "title": "Nice rooms, average service", "user": "EnjoyingLife210", "date": "July 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 72249638}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We recently stayed at the Raddison Royal for only one night, but the service we recieved was outstanding! We arrived in quito after an all night bus ride from Guayaquil at 7:00 am. We went straight to the hotel to see if they could hold our bags until the room was ready. Not only would they hold our bags, but they had a room ready for us to check into right then! How great is that! We were able to go right to the room and rest rest for a few hours before exploring quito. Everything we needed from taxi's to tourist info was available to us! The staff was very helpful and kind. We had a late flight the next day and the held our bag all day so we could make the most of our last day there. The price seemed a little high at first, but after the great service and cleanliness of the room, it didn't seem like too much at all.", "title": "Great Service!!", "helpfulness": 1, "user": "gzwahlen", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72051819}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Was impressed by the cleanliness and friendly staff. My room had excellent view of snow-covered volcano. Excellent value for the price. I did not venture out into the neighborhood after dark, but it looks okay. Will stay here again.", "title": "Nothing negative to say", "helpfulness": 1, "user": "freddy82", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72021222}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I can't express enough thanks to all those who worked at the Radisson Royal Quito Hotel. The place was spacious, clean, impeccable service. Everyone went out of their way to accommodate us. I also was there in Feb of this year and the experience was also wonderful. Professionally managed . In a very nice area of Quito . Lots of great restaurants in walking distance.", "title": "Fantastic service", "user": "emad14", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68336766}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed here for one night - first night of our honeymoon as a stop over on our way to the Galapagos. Reception staff were very friendly and helpful. The room was clean and well appointed. We'd happily se them again / recommend.", "title": "Reliable, Good Service", "user": "Clownf1sh", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 68287642}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Friendly, modern, immaculate. So appreciated after trip from Seattle. Right,..the buffet for $13 is high...but so good. Didn't want American exp. but met people from all over world.", "title": "OZ right..BEST IN SOUTH AMERICA-- $60 a night", "user": "pambarber", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 64662066}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed only for a night in Quito. It's a very good option. Thay can arrange a guided city tour, all information you need and you have every day from 5pm to 7 pm something to eat and a national beer or wine.", "title": "Good option", "user": "lovepatagonia", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 118049057}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The room was simply perfect and comfortable.", "title": "Excellent, great location, great value and service", "user": "DANIELAORTIZM", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117886369}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Unfortunately it isn't so close to the old town so you have to pick up a taxi", "title": "We'll Be Back!", "user": "schatzebar", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117805041}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I was staying here for a business trip and I can say everything was perfect: the price, the value, the room, the food and the staff service. If you have some free time you definetely should try any of the spa services; I got a very cheap and good relaxing massage and a facial cleansing. I will definetely come back and get all the treatment.", "title": "Great location, price and value", "helpfulness": 1, "user": "Carrie R", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117678166}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed here both on first arrival in Quito and the night before we flew out. BEST hotel we have ever stayed in (and we've traveled all over Europe). From the check-in to the staff making us feel like we were the only guests, to the concierge who arranged a personal tour guide and taxi, to the massage, to the....I could go on. Suffice it to say it was awesome! We were made to feel like celebrities (and we're not). Can't say enough nice things about the hotel itself or the staff. Top notch!", "title": "A perfect choice for us", "user": "Oats711NYC", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117675184}, {"rating": 3.0, "title": "average", "text": "ok its just another radisson...nothing special. The location is ok...supposedly in the safer district of quito. was mostly disappointed by lack of enthusiasm and help by staff. If you are here to do some site seeing then do not expect to receive much information from the staff. There are no brochures or advertisements with things to do or see. The best part of the hotel is the free drink and nibbles at 5pm. Im sure there are many more tourist friendly hotels in quito.", "helpfulness": 1, "user": "klea33aschere", "date": "April 26, 2010", "id": 62483228}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The place should be number ONE in Quito - not 20!", "title": "THE Best Hotel you'll find in South america", "user": "ozstamps", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62268090}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Booked it under sufferance as the Sheraton was not available for the 2 nights we wanted on first visit.", "title": "Like a Radisson", "user": "MarlinPrice", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 55373500}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Cost was $US120 plus $30 in taxes via their website for a *SUITE*.", "title": "Attractive Oasis", "user": "travelpr0123", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 52772288}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for three separate nights during our honeymoon in Ecuador. We flew into Quito late at night after a long day of traveling from the United States and were pleasantly surprised by the cheerful staff and the special touches in the room like the hand-signed thank you note and two plates of (delicious) desserts waiting for us! The first stay was in a \"Guest Room\" which was on a lower floor, and was modern in decor. I realized that I had forgotten my toothbrush and when we contacted the front desk, a friendly staff member came right up and brought one in (no kidding) about sixty seconds. We slept like logs and departed early the next morning for the Galapagos. Our next stay was about a week later, when we returned from the Galapagos to Quito for one night before heading off to the Amazon. That stay was in a \"Royal Suite\" which was HUGE and quite a steal at $100/night. There were two bathrooms (a full and a half). The decor was more traditional than the Guest Room, with the living room containing a sofa, television, incredibly well-stocked minibar, a table and two chairs. The half bathroom was off of the living room and the full bath (with an enormous bathtub) was off of the bedroom. The bedroom had a large flat screen television and a comfortable bed with feather/down pillows and soft linens. The complementary toiletries (which included slippers, loofah, shoe shine kit, sewing kit, shower cap, comb, shampoo, conditioner, soap, cotton swabs and rounds) were excellent quality. There were again the lovely desserts and another hand-signed card", "title": "The Perfect Hotel", "helpfulness": 1, "user": "starhawk", "date": "November 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87343706}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "welcoming me back and thanking me for choosing to stay at the Radisson again! This stay afforded a little more time to explore Quito so we decided to check out a vegetarian restaurant, El Maple that we had heard of. With address in hand, we opted to take the hotel taxi. Once there, we (me, my husband, and the driver) realized that there was El Maple in that area. We drove around for a little longer and then without us even asking him to do so, the driver called back to the hotel on his cell phone, had someone search for the correct address on the internet and give it to him over the phone, and then drove us there. Amazing! Our last stay was equally wonderful (perhaps more so after returning from the jungle where the accommodations were decidedly more rustic (and involved a lot of unbidden bug guests) and we were frankly, sad to leave. We used the business center a few times, which is a pleasant space next to the lobby that had four fast computers and a printer to check our emails and only had to wait once for a computer. We also used the laundry service which I think was actually a dry cleaning service. While quite expensive, all of our clothes that were worse for wear after the jungle came back freshly cleaned and were hanging nicely in the closet in bags. Unfortunately, our schedule did not permit us to try the breakfast buffet but I did catch sight of it when I was on the elevator (to leave for the airport) and it looked fantastic (a land of plenty). Two comical notes: the few times we took regular taxis back to the hotel, we had trouble communicating the hotel's name. After saying \"Radisson\", we would receive puzzled looks and after several rounds of: \"Radisson.\" \"Radisson? \"Yes, Radisson.\" \"Radisson?\" \"Uhhhh....Swissotel.\" \"Ah! Swissotel!\" (The Swissotel is right across the street from the Radisson). Once there, we would point to the Radisson sign and the taxi driver would inevitably exclaim, \"Ah! RRRadissohn!\" So apparently you need to perfect the accent! Or just bring a business card from the front desk with the address. The second comical note had to do with the english translations on the menu, hotel information binder, etc., which were unintentionally humorous (charmingly so). My husband and I are still laughing at the phrase \"Corporal defoliation\", which was listed as a spa treatment (translation: either body exfoliation or body waxing...we couldn't determine which!). The only (very minor) complaint has to do with the large windows in the rooms, which offer a nice view and allow plenty of sunshine, but are single-pane and do not offer much insulation against noise. (Luckily, I had earplugs so all was right with the world.) All in all, the consistent quality of the staff, the rooms, the little extras, and the thoughtful touches truly made this hotel a traveler's delight. If we ever return to Quito, we will definitely stay here again!", "title": "A perfectly managed hotel", "user": "nanacha", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83757009}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I've been traveling often to Quito and staying at this hotel frequently over the past 6 months and it is WONDERFUL. I love arriving here after a long flight. Very clean and comfortable (good pillows and sheets!): every single person on their staff is professional and warm and I've noticed that they do not have any turnover of staff ----always a good sign. You can quite cheerfully enjoy their bar or restaurant alone or with a group. The neighborhood is good for walks, other restaurants and cafes and shopping. I once had to stay at another major hotel in Quito that cost twice as much and did not offer any of these qualities of good service and warmth.", "title": "If I am ever made prisoner.....please let it be here!", "user": "Mcgatto", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 80779839}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I honestly wish my stay at this hotel was longer that the one night. They actually had me \"at hello\" at Reception, when I walked into this room and it is absolutely push! the carpet, the pictures, the tourism books, the frigo bar was a mall on itself!", "title": "Best place to stay in Quito", "user": "HeatherP976", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77269954}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "But the final shock came when I looked at my gorgeous desk and find a welcome card signed by the HM and a reception snack, a local sweet and I could not believe my eyes: the spoon was already served with toffee....all I had to do was to insert in my mouth.", "title": "Wonderful staff, very friendly and helpful and very nice hotel.", "user": "TheCastles_10", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77156209}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Stayed here for 3 nites before & after touring Galapagos so reserved a room online directly on their website. Chose this hotel based on the very positive reviews as well as a concern for our safety in Quito. It certainly didn't disappoint! What a great hotel! And it was all the little extras that made it very pleasant & memorable (all included in the price of the room): the welcome drink in the lobby; the welcome sweet snacks & card in the room; glass of wine or beer & terrific hors d'oeuvres at happy hour; breakfast to go for very early risers. And on our second stay, for some reason (and I don't know why), we were upgraded to a suite at no extra charge. Unfortunately we arrived late & then had to get up really early the next morning so didn't have much chance to enjoy the suite. Would definitely recommend this hotel to anyone staying in Quito. The Swisshotel across the road is swanker but also considerably more expensive. Rooms at the Radisson are reasonably priced for a major city/major hotel chain. Oh, and indulge in the buffet breakfast if you have time. Only $13 pp & excellent. Only negative is the street noise which we could hear on the 4th & 6th floors.", "title": "Many nice extras", "user": "Luvtotravel7", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 119254005}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I stayed here on two occasions. For three nights before I started Spanish school in Quito, and 1 night after 3 months on the Galapagos Islands. It is by fat the best hotel I have stayed in, in Latin America. Its clean, smart, got very friendly, helpful staff, large rooms with excellent facilities. The prices are exceptionally good value for a hotel that is of the same standard as 4* in Western Europe or North America. The location is good, just get a taxi. They are very cheap, maximum $5 for anywhere in the City! Or if your feeling brave take one of the buses for only 25cents. The breakfast was quite expensive but you get a massive choice so its worth it.", "title": "Brilliant!", "user": "doddi44", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118992642}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel view was not great, but you can view the highest nearby mountain, from the front of the hotel (see my photos). Take a taxi and its only 15 minutes to the ski-lift that ascends to the top. That's another 15 minutes and an $8 ride up. At the summit, hike about ¼ mile and hire a horse, for a ½ hour ride to the top, or try the hike. The altitude here is not trifling. About the hotel, great! Especially the service and the breakfast buffet (free with an upgrade to a suite). Don’t miss it! The staff was over accommodating. They tended to my wife who developed a mild case of altitude sickness (normal for Quito) while I went out each day. Try the hotel for dinner, or try the room service, both were good. After breakfast wait until 4:30 PM and try the happy hour delectables with the free drinks (wine or beer). The gym in the basement was not the greatest, but the masseur and both the steam and sauna were fantastic. We left the hotel for one night and went to the Mindo cloud forest lodge. We had to ride a suspended basket over a river, to get to our cabin. The next day, hikes up a mountain and a cable ride to a series of waterfalls was el premo! We did not notify the Radisson Hotel staff, but we posted the “Do Not Disturb” sign. For safety, I locked my laptop and the wife’s jewels in the room safe. It was all there when we returned. They called a cab, when we had to leave. The cab service was prompt and onetime at the airport. They also provided cabs for me at other times. They will ask you if you need their trusted cab drivers, or a regular. That may be important, because I had a driver go the opposite way from the destination I asked, and had to direct the driver back to where I wanted to go, in force able Spanish (I am from Miami, Fla). I definitely recommend the Quito Radisson to all.", "title": "One excellent week in the Andes Mountains", "user": "TTorgul", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118913576}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Really enjoyed my short business stay at this hotel. Clean, comfortable, good lighting in the room, and excellent shower - with both American (stationary) and European (flexible) heads on separate connections on opposite sides of the tub. Never seen that design before, it was very convenient. Nice that they had the airport arrivals and depratures information on a screen in the lobby - I wish more hotels did that, not just airport hotels!!", "title": "Nice little hotel", "user": "OlyaDallas", "date": "September 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118493596}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "And the roses in the lobby were just gorgeous :)", "title": "Nice and charming staff. Definitely up to the usual Radisson standard that you would expect.", "user": "imperan", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118359588}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "It may be a little more expensive than some choices in Quito but in the end, you get what you pay for here. Great rooms, terrific service, nice location, attentive staff and a complementary shuttle to the airport.", "title": "First class hotel", "user": "kkhinnm", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115565973}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Breakfast was not included in my", "title": "Top tip!", "helpfulness": 1, "user": "ekirsty", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114961311}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "room's rate so we bought the $13/person the restaurant offers. Seemed high for breakfast until I saw what was offered. Every thing I could have wanted was offered in abundance along with some items that I thought were better suited for lunch. Either way, it was terrific.", "title": "Nice location.", "user": "Urojahaji", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 114719611}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I'd stay here again without hesitation!", "title": "Fantastic hotel, great service and excellent location!", "user": "Patricia H", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114440868}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We found this place after reading others reviews and are not dissappoited! We leave tomorrow and will be back in a week. The rooms are clean and comfy, the breakfast vast! The service great and alot speak English which helps. Great value for money! Highly recommend.", "title": "Great value for money! Excellent!", "helpfulness": 2, "user": "trvlbufElmhurst", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113180732}], "location": {"country": "Ecuador", "continent": "South America", "city": "Quito"}, "stars": 4, "variance": {"poor": 3, "average": 18, "very good": 93, "terrible": 4, "excellent": 133}, "aka": "Radisson Quito", "slim_ranking": 0.12380952381, "description": "Radisson Royal Quito Hotel is next to the World Trade Center in the most exclusive business, financial and gastronomic areas in Quito. Located 40 minutes away from Mariscal Sucre International Airport and 15 minutes away from Historic Downtown which was declared World Heritage Site by UNESCO. Close to major attractions, shopping centers and Plaza Foch."}