{"user_rating": 2.5, "review_count": 461, "name": "Radisson Blu Hotel, Lyon", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The hotel is located in the center of Lyon close to Part-Dieu Railway Station in the kind of skyscraper - from 32 to 39 floor. It definitelly needs renovation - obsolete furniture, almost no light in the room, weak wi-fi which is almost useless (though free). Good view from the windows, but the surroudings are truly urban - mostly concrete and alphalt. Good shopping center nearby. Le Rhone river is 1 kilometer to the west - nice place to see. Also the old city is just behind the bridge.", "title": "Concrete jungle", "user": "Farabundo", "date": "October 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 143434179}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "After a horrible night in which the hotel we were booked in closed the door before we came we stumbled upon this Radisson. The desk clerk was extremely helpful and got us a room right away. The room was clean and comfortable. There room was spacious. We had freee wi-fi access and a desk to do some work. The hotel had a great view of the city. THe lobby could use a little freshing and the restuarant was a little pricey, otherwise everything was great.", "title": "A breathe of fresh air", "user": "Angelash45", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143404081}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed there for 2 nights during our trip to Lyon. Hotel has not been renovated for years. furniture as well as uniform of stuff is very old. Concierge does not know anything about town itself and cannot recommend places to visit or to dine in Lyon. there was no one who could take our luggage upstairs, more than that we have been asked when can we come downstairs to pick it up. Access to the parking area is through the “garbage party” behind the building. Or you have an option to use the elevator inside the building which is almost not possible to find from inside.", "title": "Not too bad, but not good enought for Radisson", "user": "Lapochkajj", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142937664}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "When we have asked to make a dinner reservation for us in town reception almost refused it. So we had to insist.", "title": "Not what I'd expect from a Radisson Blu!", "helpfulness": 2, "user": "jeaneeem", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 142430726}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "It’s a highest building in town, so has a great view. But that is all. Been abit familiar with Radisson standards would say, its just an average Hotel ( probably 3 stars) but nothing to do with Radisson.", "title": "Worst wifi ever", "user": "Jurjen-de-Vries", "date": "October 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 142281509}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "Let's start with the good. When we arrived we switched rooms three times and the staff accommodated us without hesitation. The views from what it one of the tallest buildings in Lyon are also incredible. Free wifi is also a plus. And my wife's favorite the room has slippers.", "title": "The Good, the bad and the Worse", "user": "C_and_MH", "date": "December 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 2.0}, "id": 147039215}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Now onto the bad. The rooms on the 39th floor are in need of dire repair. Walls have water damage and the heat/AC in our second room sounded like a drill hammer. We could have lived with the water damage, but to room smelled of lemon Lysol as if some nefarious oder was being covered up.", "title": "Ignore the grouchy comments", "user": "Britfr0g", "date": "December 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 146616274}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The worse, windows can't be opened, not even a crack. The floor is basically concrete with a millimeter of carpet on it. There is no safe and when you showed the hot and cold water seems to change ever 30 seconds. Also the water pressure in the sink was so great I had to change my shirt after washing up. Lastly, the beds remind me of my college dorm.", "title": "Don't bother!", "user": "298Misscs", "date": "November 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 146372444}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We stayed in the radisson blu last night and could not understand the awful reviews we had read. Yes, the hotel needs an upgrade in terms of the wallpaper in the bedrooms and the lack of flat screen tv (who goes to a hotel to watch tv?)... However, we had excellent and attentive service from the receptionists to the concierge, not to mention the staff in the bistrot at breakfast. Children are really welcome which is not the case in all 4 star hotels. The value for money is excellent for a family of 4 (check out the week-end deals). All the hotel needs is a fresh lick of paint in the bedrooms and a better lit reception desk... Did I mention that the views over lyon are fantastic (the hotel starts on 32nd floor)?", "title": "A Shabby Pencil (Crayon sans mine)", "user": "laloux", "date": "November 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 146150483}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We booked two night via lastminute.com for my partner's birthday we were really looking forward to a nice weekend away in a luxurious hotel!! We had to pay for the parking unground...not stated when we ade the booking 15 euros per night! When we arrived we learnt that in fact the hotel only occupied a few of the floors of the building so we waited for the elevator to the 32nd floor or something. The reception is probably the best part of the hotel. The room was shabby and outdated. There were cracks in the walls and ceiling, paper peeling away in places. The TV was and old style portable from 80's/90's. The bath was stained on the bottom. They didn't even provide a kettle, I don't think I ever stayed in a hotel without a kettle in the room. The worst part was the stench of cigarettes and lack of sufficient ventilation. We slept we the AC on and we both woke up feeling fluey the following day. I actually have a cold now because of that room. The view from the window was the best part of our visit but this hotel does definately not merit it's star rating or it's tariff!!!!", "title": "Come for the view but don't stay here", "user": "Oliver G", "date": "November 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 146003858}, {"rating": 2.0, "stay_parameters": "Stayed November 2012", "text": "\"Radisson\" rang a bell as it had done before. Very small rooms. Public areas not clean. Restaurant services messy. Internet very slow with no option to pay for a dedicated connection. Unfortunately no positive feelings. Friendly service.", "title": "A surprising disappointment", "user": "Thomas E", "date": "November 22, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 145943985}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This hotel offer lovelys rooms with amazing views of the whole city of Lyon. It is very well located near Part Dieu train station and mall. You can also walk to the old city in about twenty minutes. Staff is attentive and very helpful.", "title": "L'arc en ciel at Lyon", "user": "SnowsMadrid_Spain", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145059729}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Radisson Blu Hotel also offers a bar and restaurant with good food and breathtaking views. Just avoid ordering cocktails. They are really expensive and not good at all.", "title": "Internet Internet... Omg!", "user": "silvesy", "date": "November 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 144803129}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "Lyon is a wonderful city, full of awesome restaurants, nice boutiques and landmarks well worth a visit. To me it's like a small Paris, only way cheaper.", "title": "What a Dump!", "user": "RDG1871", "date": "November 6, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 144754344}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Ok so long story short. 1 and 1/2 year ago I review the part dieu hotel... Nice rooms.. The rooms are still pleasant, but at the same time I said the Internet was terrible. When I got a reply via trip advisor from Y-Grardel, General Manager saying that it was reported and the necessary fix was made, I was impressed, I thought cool, they listen to what I have to say. But am back here , and Internet connection in my room is still so bad, what is the point of replying to say that something is going to be addressed if it isn't. I thought a year and a half would be adequate time to sort things out.", "title": "Despite the décor of the room... Excellent!", "user": "6weekholidays", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144445544}, {"rating": 1.0, "stay_parameters": "Stayed May 2012", "text": "I stayed in this hotel for work and I can safely say it was the worst hotel I had ever stayed in. Where do you start!!! From the dingy dirty rooms to the old broken bathrooms to the dirty carpets it was a disaster from start to finish!!!", "title": "Yuck!!!", "user": "blondebabe81", "date": "October 3, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 141885065}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I walked around with socks or shoes on because the carpet looked like it hasn't been cleaned on weeks,god knows what was on it. The bathroom shower was broken,shower head all furred up with limescale and tiles cracked.", "title": "Dated Style, Good Breakfast and Friendly Staff", "user": "DeNyOLondon", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 141817461}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The room was stuffy as you cannot open the windows,understandable being so high up but at least have decent air con if that's the case.", "title": "Just too old (again)", "user": "Philie4u", "date": "October 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 141762432}, {"rating": 2.0, "title": "Total rip off!", "text": "For the amount of money it was a total rip off,I would NEVER stay here again.", "user": "Nickofbend", "date": "September 30, 2012", "id": 141626300}, {"rating": 2.0, "title": "Bad For Radisson Blu.", "text": "Booking Issues", "helpfulness": 3, "user": "Jimbo4444", "date": "September 23, 2012", "id": 140967636}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "stars": 4, "variance": {"poor": 113, "average": 130, "very good": 104, "terrible": 84, "excellent": 30}, "aka": "Radisson Blu Hotel, Lyon Hotel", "slim_ranking": 0.727272727273, "description": "All rooms offer breathtaking views of Lyon and surrounding region as far as the French Alps and Mont Blanc.Toutes les chambres offrent une vue imprenable sur la ville de Lyon et sa région."}