{"user_rating": 3.5, "review_count": 589, "name": "Radisson Plaza Resort Tahiti", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We loved this hotel. After staying at the Intercontinental last time we were impressed by the Radisson. We were prepared for the bad service after all of the the scathing reviews, but I could not take the dreary rooms at the Intercontinental again. We were shocked to get very good service at the reception and restaurant. We stayed in much more expensive resorts on our trip, but got no better or worse service here. The room was small, but perfectly designed with a huge balconey and great view. The food was very expensive (just like the rest of Tahiti), but very good.", "title": "Best So Far", "helpfulness": 9, "user": "Sparky22", "date": "May 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5026454}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "After reading reviews about this property I wasn't expecting much but we were pleasantly surprised when we got there.", "title": "It's not all that bad at all", "helpfulness": 11, "user": "nireno", "date": "July 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 5523881, "likes": {"liked": "— swimming pool", "disliked": "— service"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "We arrived in early morning hours; the receptionist was kind enough and spoke good English. We got very nice room on the 4th floor overlooking the beach. Service is slow but if you traveled around other South Pacific countries that’s nothing unusual. They are much laid back, and couldn’t care less if you're in a hurry. That’s just the way the Polynesians are and it didn't bother us.", "title": "Honeymoon Disaster", "helpfulness": 22, "user": "Wyatt1970", "date": "July 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 5.0, "service": 1.0}, "id": 5477069}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "If you expect someone to dance around you while serving your meal, with all smiles and to treat you like a royalty than I would suggest you to avoid visiting this part of the world. Meals in the restaurant are expensive but of a good quality. Buffet dinner is US $60 per person, continental breakfast is $27 and American breakfast is 36.", "title": "Bad service at huge prices", "helpfulness": 12, "user": "NZSailfish", "date": "July 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 5437179}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "Drinks at Lafayette Bar weren't that expensive, coffee is around $5, cocktail around $12, Coke $4, orange juice $2,beer $6...Burger with fries was $17.", "title": "Awesome room, Poor service", "helpfulness": 7, "user": "SSWEETIGIRL_123", "date": "July 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 5416157}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "There's not much to see around hotel. Restaurants in Papeete city are also expensive, main meal is around $30 in a not so good restaurant. On Saturday and Sunday nights they have good entertainment.", "title": "Great views & quiet location", "helpfulness": 15, "user": "beach_specialists", "date": "June 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5383271}, {"rating": 2.0, "title": "Nice, apart from the rats!", "text": "Tahiti, the thought just conjures up paradise! My first thought of the hotel on my arrival was slightly hazy, just flown from Sydney via New Zealand and the Cook Islands and across the date line so didn't know if I was coming or going! Checked in very early hours of the morning. Not shown to room, had to push my suitcase along a lengthy path till I finally found the lift.", "helpfulness": 14, "user": "Miss-Traveller", "date": "June 19, 2006", "id": 5363535}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Room though was outstanding! Beautiful beach / pool view. Very clean and a 'surprise' Jacuzzi in a separate room (wasn't expecting that)! Cannot fault the room at all.", "title": "Beautiful hotel", "helpfulness": 6, "user": "Finefood", "date": "June 14, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5348778}, {"rating": 1.0, "title": "Fawlty Towers in French Polynesia", "text": "Now the bad bits, everyone who works in the hotel are very reluctant to speak English.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5332959}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I know France is just across the English channel but 'bonjour' is my limit. They seemed very put out by my lack of the French lingo, and I got the impression that they could really speak English very fluently, probably better than me but could not be bothered.", "title": "Very Nice Hotel", "helpfulness": 29, "user": "markh111", "date": "May 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5146005}, {"rating": 4.0, "title": "My Kids Loved It", "text": "The price of everything is outrageous! Drinks, food, you name it! I asked at reception where the nearest store was and was told I had to get a taxi into Papeete. That cost, and the great thing is I past a few stores on my way, near enough walking distance. All I wanted was some coca cola, water and a little vodka (hey I’m on holiday)!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5040960}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 73, "average": 133, "very good": 207, "terrible": 38, "excellent": 138}, "aka": "Radisson Plaza Resort Tahiti Hotel Arue", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "Forget the traditional “Room with a View”, simply imagine “A Resort with a View”. Overlooking Matavai Bay drenched in historical events looking beyond the distant horizon and one of the most important historical sites in Tahiti. Enjoy an “open plan” Tahitian themed destination resort and step into a real Tahitian Cultural experience of warm & welcoming Tahitian staff. Ideally located on the north eastern coast of the island of Tahiti, close enough to get you to town in a short 10 minute trip but just far enough to ensure stress-free surroundings.All units have a large balcony and offer a view over the majestic South Pacific Ocean animated. Radisson Plaza Resort Tahiti caters for multiple desires: 25 Ocean View Rooms, 26 Rooms with private Jacuzzi, 26 Suites and 14 Duplex. Spend time at our local Arts & Craft Market; enjoy our daily cultural & Fitness Activities program; relax in our Sauna, Steam room, Jacuzzi or Infinity pool; enjoy a duo or single massage with jet jacuzzi bath or vichy shower in our Spa, take our free shuttle to visit city centre; appreciate a dinner with typical Polynesian shows in our waterfront Restaurant…Radisson Tahiti matches your desires! Radisson Plaza Resort Tahiti is a journey of richness into history, adventure, paradise, romance and Tahitian cultural hospitality with a difference you will not forget."}