{"user_rating": 4.0, "review_count": 469, "name": "Radisson Hotel And Suites Sydney", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed for 3 nights at this hotel last weekend and cannot wait to go back. Excellent location, right in the middle of everything. Only a short walk to Darling Harbour to see and visit the sights it has to offer. Close to cafes, restuarants, shops and public transport as well. The staff are very friendly, approachable and professional. We were always greeted with a friendly 'hello' each day. Our suite was huge, lovely big room with kitchenette, good sized bathroom, built-in wardrobe, 2 seater lounge area, the heater/air con worked well. Spacious and very clean, plus the lifts were fast. Would recommend this hotel to anyone visiting Sydney. The price, location, staff, amenities, and room size are perfect.", "title": "Can't wait to go back", "helpfulness": 2, "user": "AussieGirl79", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135211954}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Rooms are of very good quality. Front desk staff are not very friendly, our room was not ready even though we indicated a check in time for them. However offered us a late checkout at 12pm. Location is awesome everything you need it close by.", "title": "Nice hotel", "user": "RoderzzzzZ", "date": "July 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 135054588}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "I've stayed here quite a few times and it is a hotel that I would come back to again and would recommend it to anyone visiting Sydney. The only thing I would request when staying at the hotel on either a Friday or Saturday night would be to request a room that fronts onto Liverpool street. There is a lane way that the hotel backs onto and there is a bar which is incredibly noisy and unfortunately you can't block the noise out. Other than that the hotel ticks all the boxes.", "title": "High standard convenient hotel", "helpfulness": 1, "user": "honest315", "date": "July 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 135017451}, {"rating": 5.0, "title": "Great location, friendly staff", "text": "Great location, close to everything. Clean and comfortable. Free internet! Stayed here for a week and would definitely stay here again. The wifi was too slow to watch YouTube on, but for everything else it was fine. The wired connection was also free and faster for those with laptops. Only bad thing would be the price of watching a movie on the tv system - at $15 a movie it was a bit too much. Also didn't really have any noise issues despite the monorail being right in front of our room window.", "helpfulness": 1, "user": "Ian B", "date": "July 18, 2012", "id": 134720874}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We had a great stay. The service was absolutely perfect, reception staff were friendly attentive and helpful. The location in the heart of china town was great for a Sydney city visit, close to entertainment,food, shopping and transport. We certainly had no view although interestingly looking over tetsuyas restaurant. The outdoors seemed a little run down but this is not what you come for! There was also a bit of clattering down the service vent at all hours though it didn't bother us. Great place to stay we can certainly recommend.", "title": "Fantastic place to stay", "user": "ozziwanderer", "date": "July 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134637143}, {"rating": 4.0, "title": "Great staff & location, little noisey at the front", "text": "Hotel is in a great location, close to the darling harbour and some great restaurants. Only 30min walk to the bridge and less for the shops. The hotel staff were very accommodating, our only issue was the noise from the mono rail outside the front and road. The windows are double glazed but still let in quite a bit of noise. The hotel did move us up and towards the back which was much better. They even had power adapters and umbrellas were offered when we went out so the service was excellent.", "helpfulness": 1, "user": "davcas", "date": "August 15, 2012", "id": 137304718}, {"rating": 5.0, "title": "Loved my stay - Fantastic staff!", "text": "I loved staying here for 4 nights. The number one factor was the staff who were cheerful, helpful, polite, efficient (add as many other positives as you can think of). Every single person I met seemed to care that I enjoyed staying at their hotel and it never seemed to be forced or fake in any way. This is a huge achievement. Breakfasts were terrific, room amenities good, hot water and water pressure excellent (I had a high floor). If you want a comfy stay close to everything in Sydney's CBD, this is the place for you.", "helpfulness": 2, "user": "Zeddog", "date": "August 13, 2012", "id": 137095620}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed for 5 nights at the Radisson Hotel & Suites, Sydney. We arrived at 10am, had requested an early check-in & the staff went out of their way to make sure our room was ready after a short wait. The location is excellent, a short walk to Darling Harbour, lots of shops (including a grocery store) & restaurants nearby, bus stop a few blocks away with a free bus which circles the city. The room was very spacious, clean & comfortable with free wi-fi. The reception staff was extremely friendly, knowledgeable & helpful. Perfect!!", "title": "Highly recommend!", "user": "Karen M", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136478741}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I travel for work frequently (usually to Sydney) but I've branched out a little lately and thought I'd try the Raddison Hotel and Suites.", "title": "Clean, convienient, professional staff", "user": "narinna", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 136456474}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Good hotel - the staff are exceptionally nice, wifi is free and the rooms are well appointed (I stayed in a One Bedroom Suite). Bathrooms are clean, which is a big thing to me, and they allow smoking on the balconies if you have one which was a bonus.", "title": "Great location", "helpfulness": 1, "user": "ald60_9", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136281390}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We booked (Wife, Daughter and myself) at the last minute just for an overnight stay to have a meal locally with friends.", "title": "Pleasantly Surprised", "user": "MBarr", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139692432}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The price was very reasonable considering the location and the price of the other accommodation in the area. The location is perfect, very close (with an over the roadway walkway) to Darling Harbour, Chinatown and the George Street Movie Area.", "title": "Good location", "helpfulness": 1, "user": "RAHFamily", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139596722}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "There was parking right out the front for parking (valet - very reasonable) and the check in was quick and painless. I was a little concerend given the small size of the foyer but the rooms are very large and the beds super comfortable. The bathroom is a great size but a little dated and in need of some repair (reducing the review from excellent).", "title": "Convenient and spacious", "user": "Callum M", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139473498}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The rooms are spacious, reasonably priced in a great location. We would definately stay there again.", "title": "Very very nice", "user": "Tmsc35", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138937482}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Convenient location. Near monorail and Darling Harbour and China Town. Rooms are nice size and the on-site restaurant has a good menu. Staff were more than accommodating and very friendly. Would definitely stay again.", "title": "Another Fantastic Stay!", "helpfulness": 1, "user": "TravelNicki", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138475884}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "It was a good place. Always got a smile with the service ... which is not that easy to come by in many places!", "title": "Great Place", "helpfulness": 3, "user": "villdre", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7856566, "likes": {"liked": "— Service", "disliked": "— Lack of Utensils in the Room (not a real reason, I know)."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was HUGE. Nice balcony ... Spa-style shower ... Free Broadband (yes, FREE! and fast too).", "title": "Great, reasonably priced hotel", "helpfulness": 6, "user": "Vicky101", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7693315, "likes": {"liked": "— Size of room and bed", "disliked": "— Little bit noisy with the balcony door open"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Spent 7 nights at the hotel and loved every minute of it. The staff were friendly & helpful. When we come back from a day's out, the staff will greet us with a smile. Stayed in a studio guest room. Love the kitchenette and we were able to do some light cooking. Housekeeping service was great. Tidied up the rooms everyday and changed fresh bedsheets. Facilities were wonderful. Took a dip in the hotel pool & jacuzzi. Business Centre allowed free printing for hotel patrons. The room was spacious & clean. Location was great, just minutes walk to Darling Harbour and Chinatown. Coles (World Square) was nearby and everything was within reach. Will definitely love to stay there again when I return!", "title": "Fantastic Hotel", "user": "ClaireAngel", "date": "August 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138474311}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Spent 3 nights in Radisson 2 rooms apartment after spending a week in gold coast and it couldn't be better. Great location as it's just steps away from some Sydney's finest Chinese restaurants in Sussex street, close proximity to world towers and George street. Initially we were looking at swissotel but decided over Radisson in Liverpool street as the rooms comes with free wifi and Internet services which is handy and no extra cost to hotel guests. Being a fussy traveller, we were impressed as the rooms were relatively quiet, very clean and beds were comfortable. However, the hotel's breakfast table was a bit blend as compared to Hilton and Marriot's breakfast variety. It would be handy if the apartment comes with a washer and dryer. Overall we had a great stay in the hotel, and would definitely come back to stay whenever we visit Sydney again.", "title": "Great Stay", "user": "Joclarelim", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138400693}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Excellent hotel - would definitely stay again. Staff (especially Tara of Front Office and Adam of the Bar) were so very genuinely obliging and always cheerful. The rooms are spacious and clean, meals excellent value and hotel close to everything Sydney has to offer. We enjoyed our five night stay at the Radisson Hotel, Liverpool Street.", "title": "Made to feel very welcome", "user": "CairnsScotty", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138364290}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Great location, fabulous staff, brilliant place to stay. We couldn't have been happier. Thank you to the staff who really went out of their way to help . Special thanks to Tara!! What a professional also to the other staff member who greeted our very nervous three year old with a balloon, completely changed her attitude thanks.. location is perfect, so close to all attractions..", "title": "Fantastic stay", "user": "sage72", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138271618}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Spent 4 nights at Raddison on Liverpool - birthday celebration in Sydney. Very comfortable beds, clean, reasonably quiet except the walls can be a little thin when the romatic couple in the next room are having a sexciting time. monorail right outside window at front of building - knew it was there but no real bother. Staff very obliging and friendly. We were made welcome with a bottle of wine not long after arrival on the first night and the last night a small plate of cakes and card as a birthday gesture. Sushi bar/train only 20 meters away from hotel entry is great cheap eat but get there early particularly on Fri & Sat nights as or que on customer waiting list. Short walk and you are in Darling Harbour and Cockle Bay Warfe. Beware of 'Waterfront Grill' on Darling Harbour - breakfast food quality very poor. Tara at reception was exceptionally nice helpful person. Very impressed and would stay again without question. Central to everything. Top Marks here! 10/10", "title": "Top Marks", "user": "Solo-Quilter", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137847425}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "There is no way this is a 4.5 star hotel, more like a 1 star. The room was big, but dirty walls and horrible lighting. Very noisy and very uninformed staff. It has completely made me not want to ever stay at a Radisson Hotel again.", "title": "AWFUL HOTEL!", "helpfulness": 6, "user": "MPVDH", "date": "August 22, 2007", "detail_rating": {"location": 4.0, "value": 1.0}, "id": 8468007}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Just got back from a wonderful vacation in Sydney. I checked Trip Advisor and the comments were so helpful and true. The Radisson was a great stay. The location can not be beat. It was right down the street from Darling Harbor which we visited almost everday! Our room was roomy and clean. The offered room service daily and the 1 bedroom suite is big enough for a family of 4 ( they can send up extra roll-away-beds for $35 per night). Our room came with a full bar although I wouldn't eat anything from it (chips, sodas and nuts) you have to pay for what you eat and the prices were expensive. It was cheaper to go the the grocery store \"Coles\" located up the street for snacks and sodas. I really can't complain though and I would stay here again if I was given the chance. The duty manager was very nice and never got tired of our millions of questions. The waitress Alejandra took care of our dinning needs and really made us feel welcomed whether we were dinning in the hotel restaurant or ordering in-room service ...also the when we ordered food to our room it came up quick and hot!!. I did not like the meat (chicken, fish, or beef) it tasted very different than what I am used to. We loved the dessert. It is pretty expensive ordering food from the hotel but it is an option. There are so many places to eat from within walking distance. There is a great deli (spanish delicatessen )across the street if you just want a real good sandwich and soda. Taxi's galore in the area ( although you really won't need them). China town and Paddy's market is within 5 min. walking distance. Please go to Paddys's market for all of your souvenir's they are 50-70% cheaper than buying anywhere else (same stuff but way cheaper). I went on the last day of my stay and was upset that I did not go there first. So much to chose from ( silk, jewelry, clothes...ect.). We went to China Town and they had millions of restaurants to pick from (some places a little bit ruff looking!) Make sure you get a package deal tour of the main attractions before leaving....was very expensive if you purchased tickets at the door. Kids will love Darling Harbor (parks, play area and sidewalk eateries). Very expensive for dinning out and even for 1scoop of icecream on a cone $4.10. 16 oz soda $3.50 -$5.00. Loved the chips a.k.a. french fries, was the best I have ever had. Not crazy about the fish part. American fastfood restaurants does not taste the same at all! But as the Aussie's say \"No Worries\". Do not do the buy back program at the airport it is not worth it( a fee to have them buy back your leftover AUD$). I doubt you will be bringing any money back from the trip. A lot of things to do with your kids at Darling Harbor very relaxing but fun atmosphere. The weather was mild for winter time but it was raining half of the time but this did not stop us from having a good time. There were sunny days where we sat with the children eating icecream on the docks watching the boats go buy and feeding the beautiful birds. It is a place your family will enjoy.", "title": "I am glad I chose this one!!", "helpfulness": 12, "user": "NoWorriesYokosuka", "date": "July 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8098872, "likes": {"liked": "— The Hospitality", "disliked": "— The prices for food when ordering from the hotel restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We have just returned from 4 x nights Sydney.We are a family of 4 with children aged 11 and 13 years.This hotel suited our needs perfectly.The apartment was roomy with clean.It had a full kitchen and two bathrooms including a bath.We were attracted to this hotel for the indoor pool ( a must in winter) and the location.", "title": "Great Family accomodation", "helpfulness": 7, "user": "surfnsally", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8070484, "likes": {"liked": "— Location and cleanliness", "disliked": "— buffet breakfast was limited and only OK standard"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We had the mono-rail at our door.Darling Harbour and Cockle Bay 5 minite walk.Lots of family friendly eating locations as the spanish quarter and china town are close by.The staff were friendly and had a can do attitude.There is no view but we spent very little time there as there is too much to do.", "title": "Love this Hotel", "helpfulness": 7, "user": "Constant_Travellers", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7976397}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "This is an excellent property! I travel to Sydney for business often, and have stayed in many hotels and for the price and location this is GREAT!", "title": "Fabulous, Loved It, Excellent Location and Friendly Atmosphere", "helpfulness": 7, "user": "Spirax", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7858898, "likes": {"liked": "— Spacious Rooms, Location, friendly and helpful staff", "disliked": "— Food in the restaurant is a bit too expansive"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 11, "average": 62, "very good": 204, "terrible": 7, "excellent": 185}, "aka": "Radisson Hotel Sydney", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Radisson Hotel & Suites Sydney recently completed a refresh to the hotel lobby, level one conference floor, including our restaurant and bar. Our guests are now enjoying the newly refreshed surroundings, which we hope you can also experience as our guest very soon.100% non-smoking facility.Experience Luxury at one of the Premier Sydney CBD Hotels.Located in the heart of the Sydney Central Business District, the Radisson Hotel and Suites Sydney is the ideal place for business and leisure travellers. Our 4.5 star Sydney CBD hotel's location is within walking distance or a short drive of many attractions, including Darling Harbour and Capitol Theatre. Chinatown, the city centre and other notable shopping districts are just minutes from our Radisson Sydney accommodation. All of our hotel's oversized guest rooms feature large balconies, kitchenettes, well-lit work desks, broadband cable Internet access and 24-hour room service. Spacious suites with one or two bedrooms are also available."}