{"user_rating": 4.0, "review_count": 289, "name": "Radisson Blu Bosphorus Hotel, Istanbul", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "If you are looking for a great hotel in Istanbul, this is a worthwhile consideration. The hotel is located right at the Bospherus and offers great views! The check in is very efficient and friendly. The rooms are very spacious and have a modern design with plenty of amenities, ranging from mini-bar, over dryer, coffee station, international TV to free Wi-fi. The rooms are in immaculate condition and provide a great stay.", "title": "Outstanding hotel", "user": "redwrangler8", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115821995}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This hotel has a well equipped fitness facility. The restaurant not only provides great food but the open terrace is also located right on the Bospherus providing a wonderful setting that can hardly be forgotten.", "title": "Cool 5-star waterfront with deck terrace", "helpfulness": 1, "user": "Lulgiss", "date": "June 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 114124163}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "The conference facilities are well managed and the conference room on the fourth floor is extremely beautiful with its glass encased view onto the Bospherus and the Asian side of Istanbul. If you are looking to impress your clients in Istanbul, this is the place to be.", "title": "Great location but...........", "user": "gilesh71", "date": "June 3, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 111347060}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Overall, the hotel staff is very cordial and takes care of your needs. The food, whether it be breakfast, lunch or conference breaks is very tasty and combined with the great views is a unique experience.", "title": "Not Good!", "user": "Rati_N58", "date": "May 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 109591432}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "When travelling to Istanbul this is definitely the hotel of my choice. Price value relationship is fantastic and I hope to be back soon! One thing to mind though, is that the hotel environment is a bit noisy.", "title": "Modern but great location!", "helpfulness": 1, "user": "Carolinamilk", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 2.0}, "id": 106579105}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We were only booked into the hotel for one evening so didn't have time to fully use the facilities but were really impressed with what we did find and use! The hotel is along the Bosphorus and in some great other company like the Kempsinki etc. We were greeted at check in by some friendly staff who advised us that we had been upgraded into as business class room. Unfortunately to begin with this was a non smoking double but this was soon changed to smoking and they put in another bed for us. We had welcome amenities in the room which incl fruit, water and biscuits etc. The room was very spacious and accomodating. Reception were really helpful with checking that a tour was booked and they were prompt at helping out etc. Breakfast in the morning was excellent and buffet style. The hotel was very clean, modern, excellent facilties and location.", "title": "Wonderful modern hotel overlooking the Bosphorus!", "user": "richbowenuk", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89776188}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "We stayed in a superior room for 4 nights recently. Staff were generally very good and friendly and helpful. The rooms are modern with a king bed but we found them quite small for a 5 Star standard property and also the bathrooms were not large or luxurious. We constantly felt we were stepping around each other... there wasnt anything \"superior\" about them...except perhaps the price!", "title": "Scmick modern hotel with good staff but not conveniently located for main attractions or public transport", "helpfulness": 1, "user": "SallyNSW", "date": "December 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 89316835}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The view is nice...but to be honest we didnt spend alot of time sitting in the room admiring the view..so perhaps the price was not worth it for the bosphorus view room", "title": "Nice hotel but Hotel but its level of customer service so not warrant 5 stars.", "helpfulness": 1, "user": "dellersc", "date": "November 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88066837}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Be warned, the traffic in Istanbul is horrendous...the worst we have ever experienced in all our world travels (including China)...so if this is your first trip to Istanbul and you are only staying for 4 days YOU really need a hotel that is more conveniently located than the Radisson. The tram line is great but the hotel is a long distance to the nearest tram line (which takes you to the major sights _blue mosque, Topkapi Palace, Hagia sophia , grand basaar) and we could never navigate our way on the bus system. AND in 4 out of 5 days we were stuck in a TAXI in bad traffic jams for at least 1 hour each time, OR had to bail out of the taxi and walk back to the hotel...3-4 km...which is OK if its not raining or if you are not in a hurry but far from ideal... Do not think that you can rely on taxis because the traffic is so bad...and the only way to get around is on the trams...", "title": "Allright, tiny rooms", "user": "Mr_reiseglad", "date": "November 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 86819611}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Next time we go to Istanbul we will stay somewhere closer to the golden horn and tram line...", "title": "Go to hell... no wait, lets go to Radisson Bosphorous instead!", "helpfulness": 2, "user": "tripller", "date": "November 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 86465799}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This is not the first time we go on vacation to istanbul, but it was the first time we stayed at this hotel, and we loved it! All the staff was really professional and friendly. The breakfast was included, and it was delicious! Everything fresh and replenished promptly. Also, one can always find what you want because they have Turkish AND American choices.", "title": "Wonderful Hotel in Istanbul", "user": "review4", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105940679}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "At least the room we got had a fantastic view of the Bosphrorous, the Bosphorous bridge (which is iluminated with blue lights at night and it looks beautiful) and a huge mosque, which was also very nicely lighted all night. The room was very comfortable and had all we needed. There are single rooms and bigger ones, with kitchenettes, for those who want to stay a longer time.", "title": "It was expensive", "helpfulness": 1, "user": "paonpaon", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105745018}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The location of the hotel was great for us, because it is very close to the water, and there are a lot of crafts fairs and vendors selling Turkish hand made things around. Perfect for tourists like us that wanted to experience the real Istanbul.", "title": "Nicely remodeled... on the water... great view from some rooms... but VERY far from town", "helpfulness": 4, "user": "Andrew W", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103513424}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "There are dozens of places to eat Kumpir, which are stuffed potatoes, which we found out are one of the specialty foods of Istanbul. Very inexpensive, but delicious.", "title": "Great city, great hotel, superbe service", "user": "ktulu", "date": "March 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 102287627}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "There are taxis available all the time, and the hotel is located in a very central position, so it is easy to access any other place in Istanbul.", "title": "Great location and service", "user": "lambouk", "date": "February 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 97605848}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We were upgraded to an apartment type. It had kitchenette you can hideaway with some louvre doors, and a spacious walk-in closet. The room was very modern and beautifully furnished. It was located on a adjacent street from the main hotel so I didn't really try room service. However, I thought the quaint village behind us had such bohemian qualities because of the night bazaars and the outdoor cafe / restaurants in abundance. Plus the Bosphorus Bridge that connected Asia and Europe was just a few steps away.", "title": "Loved how our hotel room was both functional and very pretty at the same time.", "user": "demi_dee_001", "date": "October 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 82444967}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "excellent service, fantastic view on the bosphorus, great location. i went there in july on a business trip with colleagues. I was there already many times before and the reason for coming back was that the hotel offers good service, a great location and a fantastic view on the Bosphorus. Also bars and clubs are close by, so if you go on the weekend, the Reina's and Angelique's of this world are within minutes of reach. The buzzling area of Bebek is also relatively close and buczada can also be reached from this place relatively easy. i can recommend this as one of the best spots to stay in Istanbul", "title": "stunning view", "user": "austria78", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79735674}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at this wonderful hotel in the first week of August. It is a young beautiful hotel with an excellent location just by the Bosphorus strait. Very close to Istanbul's trendy places so we had the chance to try some of them with easy access. Very experienced and helpful concierge team. We stayed in a loft type suite; an amazing, sexy room with an amazing view and decoration. You have to be patient with the room service but try hotel's restaurant bar by the sea. Cool bar with trendy cocktails, a little pricey though. Breakfast is so relaxing as you watch the morning ferries and fishing boats float by. Very convenient hotel for couples who want a romantic stay and to explore Istanbul's young and trendy districts.", "title": "Best location in town. Free WIFI and sexy suites!", "helpfulness": 1, "user": "TravelsofChloe", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 77642786}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We have recently returned from Istanbul which we stayed at Radisson Bosphorus Blu at VAKKO SUIT room 612. One of the Best view of entire Bosphorus and Istanbul. Large room with living room wrap around balcony great Bedroom and enough space to invite family and friends. Hotel staff extremely helpful and knowledgeable Especially the front desk Staff which was lead By Kilic were the most qualified employee's that helped us get around in Istanbul and arranging great Boat ride (we were picked up from the hotel's restaurant right by the Bosphorus). Hotel has great Bar and perfect view along with great restaurant facility. we have dine every morning for our Breakfast and it was delightful. During my stay I also met GM Ian who was very attentive for our needs and replying my email prior to our arrival and arranging extra amenities such as Microwave for our room", "title": "The Best GEM on Bosphorus", "user": "samikohen", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76645619}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Tiny rooms, lack lustre and indifferent service and over priced for food and", "title": "Overpriced, Unhappy Employees, and Dont know how they got 5 stars!", "user": "HotelHawkess", "date": "August 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 74428105}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 5, "variance": {"poor": 10, "average": 34, "very good": 113, "terrible": 10, "excellent": 122}, "aka": "Radisson Blu Bosphorus Hotel, Istanbul Hotel Istanbul", "slim_ranking": 0.22969837587, "description": "Radisson Blu Bosphorus Hotel, Istanbul is located by the shores of the Bosphorus in Istanbul. Situated in an ideal location which places it just minutes away from the host of attractions that continue to make the trendy district of Ortakoy one of the city's most popular retreats, the hotel is surrounded with local cafes, fancy restaurants, bars and has easy access to the shopping malls like Akmerkez, Nişantaşı City’s, Istinye Park and Kanyon, business quarters and Taksim Square and the Old Town where many historical sites/museums are located.Designed by the famous interior architect Sinan Kafadar, the five-star Radisson Blu Bosphorus Hotel offers his guests 120 rooms, including 2 Bosphorus Terrace Suites, 2 Suites, 9 Junior Suites, 10 Business Class rooms and 34 Superior Bosphorus rooms. Interior of the hotel and all the guest rooms are modernly decorated whereas one of the Bosphorus Terrace Suites offers Ottoman touches in its design. The hotel combines its breathtaking location with high quality service style and comfort.The hotel has one all day dining restaurant, one bar and a private venue:• StarBoard Restaurant offers a spectacular Bosphorus view and an exquisite and fine contemporary Turkish cuisine menu, has a spectacular summer terrace and bar by the shores of the Bosphorus.• In the “Cruise Lounge & Bar”, with its fascinating Bosphorus scenery, guests can enjoy the international drinks & cocktails menu and snacks.• “Pupa Terrace”: a spectacular venue for high profile events, meetings, dinners, cocktails and much more. Fascinates the guests with its incredible Bosphorus view and excellent service.Radisson Blu Bosphorus Hotel offers a wellness center, 7 meeting rooms and an underground parking."}