{"user_rating": 4.5, "review_count": 1052, "name": "Radisson Blu Aqua Hotel", "reviews": [{"rating": 5.0, "title": "Gets close to perfect", "text": "We stayed 8 nights in August in a double queen 'city view' room with a balcony overlooking the outdoor pools and with partial views of the lake and Navy Pier. We had absolutely no issues with noise whatsoever.", "helpfulness": 1, "user": "fraire", "date": "September 12, 2012", "id": 140094438}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The room was one of the turquoise carpeted ones, and it was hugely comfortable with ample space for 2 adults plus 2 kids. The bathroom was lovely, with a great design, rain shower and beautiful bath products. Perhaps they could improve the lighting over the mirror.", "title": "Amazing views!", "user": "diane752", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140015595}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There were nice high-tech touches too, with an i-dock and all the info on the hotel and surroundings being fully accessible from the flat screen TV.", "title": "Perfect Location, Great Service", "user": "jcwolff", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 139930963}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My only quibble is with the in-room coffee. We didn't have the expresso machine that others have spoken about, and the Lavazza coffee in our regular coffee maker really did taste like sock juice. Disappointing.", "title": "just loved it", "user": "Juhani T", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139930754}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This aside, the hotel does have phenomenal facilities, including a mini art gallery, a half basketball court, state of the art fitness machines and 3 pools etc.", "title": "Excellent stay", "user": "dandg78", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139905600}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "great hotel amenities - my friends and i enjoyed our stay - the rooms were luxurious on 17th floor - the views of the city were amazing - we enjoyed the fireworks from our rooms", "title": "great hotel in chicago", "helpfulness": 1, "user": "cristiankjdb", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139574681}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "this is really a great choice for our group to stay. the lounge was also a great place to get together - we enjoyed the pool outside and the indoor pool as well.", "title": "Best in Class", "helpfulness": 1, "user": "Jmarq", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139552405}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "we loved the contemporary style of the hotel rooms and bathrooms.", "title": "Great Place!", "user": "Linda D", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139527933}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My high school friends from New York, Connecticut, Florida and California were in town Labor Day weekend and we stayed at the Radisson Blu. The hotel delivered. The location is great; one block from Millennium Park and the Chicago River and within comfortable walking distance of Michigan Avenue’s Magnificent Mile. Navy Pier was a short cab ride away. The hotel services were exceptional, the staff was quick to respond to requests, and the 17th floor lounge was well stocked with gourmet pastries and espresso for breakfast and complimentary beer and wine for evening cocktails. My friends and I made good use of the outdoor pool, the indoor pool (when it got breezy) and the hot tub. There were plenty of common areas to unwind after a tiring day of playing tourists in Chicago. And the rooms were exceptionally hip, very clean and everything is well thought of, including an Ipad, dock for Iphone. The bed sheets must have been 2000+ thread count and pillows were comfortably soft. Very clean. The business center also provided convenience when my friends had to verify their flights and print boarding passes.", "title": "Grand Hotel", "user": "Debbie H", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139522871}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I was in Chicago for an engagement party and we all stayed at the Radisson Blu. I have stayed at a lot of nice hotels but sometimes the people are stuffy, not here. Everyone was over the top nice and down to earth. The view from my room on the 18th floor was amazing. My room was so nice and the elevators very quick and efficient. The lounge on the 17th floor was so handy for something to drink and breakfast. I plan on staying here every time I'm in Chicago!", "title": "Great stay at Radisson Blu Aqua Hotel Chicago", "user": "queenamj", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139479409}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Firstly I have to say that I had a bad experience with the Radisson Customer Care Department before to stay in it. According to its Web (Best Online Rate Radisson) If you find a lower publically available rate on another website within 24 hours of booking your hotel room on radisson.com, you will receive the lower rate and they will discount that rate by 25%. I found it, I submitted it fulfilling all the requirements, but Radisson Customer Care did not face up its offer and they denied giving me the discount. I exchanged several emails with them. Finally they just said that they give the issue as closed without any explanation. I repeated my claim during the checking and the receptionist ignored me, and after send the client survey, the manager contacted me without any answer and from a non reply address.", "title": "Close to the fire station", "helpfulness": 1, "user": "mistralksk", "date": "September 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 139424678}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The hotel is a new nice building located between the river and the millennium Park. Therefore it’s a good option for business if you go to the loop, or for tourist, because it is at walking distance to all Chicago attractions. The hotel has a very good fitness and leisure premises, indoor and outdoor swimming pools, solarium, an athletics track, and game rooms. Rooms are spacious, but be careful, there is a fire station close to the hotel, so be ready to hear the sirens every time the fireman have to leave the fire station.", "title": "Best New Hotel in Chicago for Families or Business", "helpfulness": 1, "user": "TDiddy", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139420072}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I have stayed at almost every 4 star and above hotel in Chicago and Radisson Blu is easily the best choice. It is designed to ensure you have a memorable, flawless stay. No detail was missed. Thoughtful things like ipads in the rooms, nespresso machines, indoor and outdoor pools (separate adults and kids), plenty of elevators so little to no wasted waiting time, helpful and charming, happy staff, excellent wi-fi service, a lounge on the 17th floor that is a welcome treat and a convenient CVS Pharmacy is case you forgot to pack something! Cabs were easy to get and parking was slick. We were sad to leave but are already planning our next stay.", "title": "Awesome Hotel", "user": "EmilyD369", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139392607}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Our stay in this hotel was everything we expected.Excellent location, clean and reasonably priced. Service was excellent, pleasant staff. Wonderful view from the balcony. Business center was user-friendly. Great indoor and outdoor pools.", "title": "Nice Business hotel", "user": "northamericatourist", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139379296}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "E.D.", "title": "Fantastic Property in Chicago...!", "user": "Danielle T", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139282647}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Have had the chance to stay here several times. Hotel is awesome. The Filini Bar is a nice stop for a drink. A little bright, they ought to turn down the lighting just a bit for the evening crowd. But still a nice lounge. I give this property an enthusiastic WOW rating.", "title": "Still A Wow", "user": "SwissMr", "date": "September 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139857769}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I do think the service staff could be a bit more educated on their own hotel, amenities, and location. When I ask several staff members questions about, morning coffee, or breakfast, or where to find towels at the pool, more often than not the answer is \"I don’t know\". I read another review that mentioned poor signage in and around the hotel. I would agree that it could be improved. A lot of people seemed confused by the restaurant being upstairs and the lounge downstairs. I went down for coffee in the morning and was finally directed to the lounge for morning coffee service and had to wait a long time because there is NO COFFEE maker at the bar? Huge Cappuccino machine, but no coffee maker / service?? The poor fella working the Cappuccino machine had to run upstairs to the restaurant to get me a hot coffee.", "title": "Wow, amazing modern luxury", "user": "Stephen R", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139840214}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I booked this hotel on Hotwire and really was pleasantly bowled over by how nice this place was. I was really wowed by the ultra-cool lobby, sitting areas fireplace and bar. My room was amazing and comfortable, the bed was great, as was the view. The location was super nice and close to Millennium Park. I did not dine here, so I can't speak to the restaurant facilities. I would definitely stay again.", "title": "Very pleased with our stay", "helpfulness": 1, "user": "Barb885", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139817162}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We took the train to Chicago for our anniversary, and decided to stay there because of the building, the location and the great reviews on this site. It was a good choice and I would do it again in a heartbeat.", "title": "hotel shows great promise ... just dine elsewhere", "helpfulness": 1, "user": "777traveler888", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139696273}, {"rating": 5.0, "title": "Top hotel", "text": "Service: Our train got in around 9 a.m. so the first thing we needed was a place to dump our bags and the possibility of an early check-in. I also wanted a room on one of the lower floors. Can do. The bellman stored our bags and front desk took our cell phone number, and called us at noon to say our room was ready. Since the train wasn't due to leave the next day until evening, we were able to get a late check-out as well. So, for a one-night stay, we actually had a room for about 28 hours. The staff went out of their way to be accommodating and helpful when we needed anything. Overall, the hotel service was excellent.", "helpfulness": 1, "user": "biztravel_11", "date": "September 7, 2012", "id": 139693831}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 19, "average": 56, "very good": 203, "terrible": 11, "excellent": 763}, "slim_ranking": 0.0903614457831, "description": "The Radisson Blu Aqua Hotel Chicago is the contemporary debut of Radisson Blu in North America. A true representation of the brand, it is designed to become a destination in itself. Radisson Blu is the luxury division of our global hotel brand, focusing on design, style and attention to detail in every respect."}