{"user_rating": 4.0, "review_count": 220, "name": "Radisson Blu Le Metropolitan", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We travelled all over Europe and this hotel was one of the best. The room was unique in design and we loved the view of the Eiffel tower out our window. The room is decorated with class and the bed was very comfortable. Room Service was excellent and efficient. The Staff were very friendly and extemely helpful in suggesting good restaurants and shopping areas. We had no trouble getting around from this location. Paris is a wonderful city with so many great restaurants and things to do. If we return to Paris one day, we will definitely stay at the Le Metropolitan again.", "title": "Absolultely Wonderful Hotel with Great, Friendly Staff", "helpfulness": 3, "user": "lelash", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84645607}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The rooms, although somewhat small, are designed with great detail and design. The quality is excellent - from v comfortable bed, powerful shower, sofa and large TV. Located v close the Eiffel Tower it was perfect for our business meetings and had a good selection of restaurants close by. The only fault, was that we were the first down to breakfast at approx 6:30am and unfortunatekly the chef was late coming in and so not hot food. Other than that would highly recommend the hotel.", "title": "Style, comfort and great setting", "user": "AngusDS", "date": "October 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82946645}, {"rating": 4.0, "title": "Good location.", "text": "My wife and I stayed here on points, so price was not a factor. We thought the location was great, fairly quiet compared to much of the city. We opened our window to look out at the eiffel, which was fine with us. Just a block or two to 4-5 cafes on the walk to the Seine/Eiffel tower. More places to eat and drink down Rue Kebler. There is a grocery in a small mall just down the block, so water and fruit etc. are readily available. We walked for 3 days from this hotel, and saw the Arc, Louvre, Isle de cite and much more. We had no troubles with the staff whatsoever.", "user": "pperkinsnh", "date": "October 7, 2010", "id": 82438088}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I visited the together with my hysdand during some days in September. After some days in wonderful Paris it was time for us to fly home to Monaco again. We then asked for a taxi to take us to the airport the morning after, and we specificly asked for a taxi from a WELLKNOWN company as G7 or TaxiBleue and the doorman at the hotel assured us and told us he would. The morning after we waited 15 minutes for the taxi to come with the doorman trying to tell us that the driver was on his way. When the taxi finally showed up the taximeter was already on 18 euros!!!!!!! And the taxi was not from a well known taxicompany but was driven by a chinese man from a little unknown company. As the taxi already was late we agreed to go in the taxi but we were afraid all the way to the airport as he speeded and almost had an accident with another car.", "title": "Be careful when ordering your taxi!!!!", "helpfulness": 2, "user": "anithasthlm", "date": "September 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 79040474}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our advice is NOT to take the taxi this hotel will order you and my advice to you is to not go near this hotel at all. If they are not able to order a taxi for the clients something must be very very wrong. They did not change our towels for the whole stay either. Avoid them they do not respect you at all!!!!", "title": "Absolutely the worst hotel I ever stayed at!", "helpfulness": 3, "user": "ibrahamahmed", "date": "September 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 78373315}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "OK, first let me be honest and say that I only chose this hotel as I have been staying at the Raddison Blu in Jersey every week for the past 2 years on Business and therefore got the 2 nights for free on their Goldpoints reward programme. Which in itself is one of the best reward programmes I've used.", "title": "Fantastic stay", "helpfulness": 2, "user": "kevshep", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97395553}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We arrived early and the room wasn't ready, but they took our bags for us and we went off to explore the area. Loved the fact that opening the door of the Hotel you have a direct view of the Eiffel Tower. After some walking and the Modern Art Museum, we returned to the hotel at 3pm where we were told we'd been given an upgrade to a suite. (room 624)", "title": "terrible value for money", "helpfulness": 3, "user": "Dutch92", "date": "February 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 96669845}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "It's worth noting that this was a very cosy little suite with no view of the Tower but instead the side streets of Paris, this certainly wasn't a problem for us. The room was small with a large on-suite, including a black stone bath and large walk in shower. A small sitting area with Table and Nespresso maker were appreciated, although tea making facilities would have also been nice.", "title": "Je t'aime!", "user": "Sy2012", "date": "December 28, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 90932055}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Room service was quick and very tasty, we had Penne Pasta as main and Fromage for desert. It was a bit pricey, but seemed in line with Paris prices.", "title": "4 poster bed with a view to the tour Eiffel", "helpfulness": 1, "user": "OsloSigne", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89916301}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "All the staff were very kind and helpful to us.", "title": "Great concierge, dodgy security.", "helpfulness": 5, "user": "HMDUK", "date": "November 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 85556495}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I chose this hotel last minute as I was coming to Paris earlier than planned and my other hotel could not accommodate. The view of the Eiffel Tower from this hotel is sublime! I was lucky to get the top suite with the round window that perfectly frames the amazing view of the tower, it's postcard perfect!! It was also nice because I was in Paris on Bastille Day so the room was the PERFECT please to view the fireworks and celebrations without having to stan in the crazy crowds below! The room was a bit small but perfectly appointed, very clean and the bed was very very comfortable. Staff was very friendly and cheerful! A fantastic mid-range hotel!", "title": "Fantastic Location", "helpfulness": 1, "user": "materialboi", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115973014}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Within walking distance of the Eiffel Tower, the Le Metropolitan is a nice, modern hotel in Paris. The room was a bit small but this is typical of Paris. Nespresso machine in room, flat screen TV and a very comfortable bed. Shower is small but very nice. The lobby has a lovely sitting area with a modern fireplace. Overall a quiet hotel with nice ambiance.", "title": "Quiet, lovely, updated.", "user": "easartin", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115922797}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This is a fantastic little boutique hotel. It is conveniently situated in a quiet area near the Eiffel Tower/Trocedero. Lots of fab restarants, cafes etc and it feels more 'local' than 'tourist', which we prefer.", "title": "A great hotel for a romantic weekend", "helpfulness": 1, "user": "PoppyBodenHarpers", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115820019}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "All of the hotel staff were incredibly helpful, polite and welcoming, especially the concierge. The swimming pool is petit but still a luxury and the cocktail bar is definately worth a visit before you head off to enjoy the Parisian evening.", "title": "Totally completely ... beautiful!", "helpfulness": 1, "user": "eli014", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115755431}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The bedroom wassmall and cosy but perfectly formed and the bed as comfy as ever. The nespresso machine in the room was great for the morning pick-me-up.", "title": "\"A View To Die For\"", "helpfulness": 1, "user": "TravelDocKleen11", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 2.0}, "id": 114641084}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here for one night in June and wish we continued the rest of our stay here. The staff were extremely helpful, the quality of the hotel and furnishings were top notch. The room was relatively small, but quaint and very well equipd with iPod docks, a huge TV and a fantastic bath and Shower.", "title": "Amazing hotel in a great location with outstanding service", "helpfulness": 2, "user": "SThornton1", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113004096}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The service in the restaurant and bar was of 5* standard and they went out of their way to help at every occasion offering helpful information and advice.", "title": "Could be better", "helpfulness": 2, "user": "Supercat68", "date": "May 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 109917241}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We would return here if we re-visited Paris again without a shadow of a doubt.", "title": "The perfect place to stay to experience Paris as its best!!!", "helpfulness": 2, "user": "Chanel_Ingrid", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105587822}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I chose the Radisson based on stays at previous Radissons and location - near the Eiffel Tower. Firstly, the hotel is very small - a true boutique property. The staff are very helpful, polite and highly commended.", "title": "Very service oriented staff in convenient Paris location with fabulous views of the Eiffle Tower & access to other sites", "helpfulness": 1, "user": "GS124", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102056641}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I had a standard room which was next to the elevator and TINY. The bed was two twins zipped together but without a mattress cover so you could feel the zip. It took up most of the room with nowhere else to sit. The bathroom was the smallest I have ever seen. No bath, just a shower, and the actual room was the width of the sink!! No towel rails, nowhere to put your toiletries...thank heavens I was travelling alone!! There was no full length mirror and no mirror over the small desk so you couldn't see to dry your hair, sit and put your make up on etc. Not the end of the world but these basic things are important to female travelers. there is a small desk but no seat for it and no room for a seat either.", "title": "Very surprised how much I liked it!", "helpfulness": 2, "user": "BNLX", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99161707}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 12, "average": 29, "very good": 77, "terrible": 5, "excellent": 97}, "aka": "Radisson Blu Le Metropolitan Hotel Paris", "slim_ranking": 0.187395426659}