{"user_rating": 4.0, "review_count": 135, "name": "Radisson Hotel Santa Maria", "reviews": [{"rating": 5.0, "title": "This is a great hotel!!", "text": "Back in March, we had a quick stay in Santa Maria - just an over-nite. Our AAA advisor suggested staying @ the Radisson because of its location near the airport. We had a very relaxing and wonderful stay. The room was very clean and comfortable. The dining room was spacious and welcoming, but at the same time we could get a booth for just the two of us for an intimate dinner. Food was to die for! While my husband had a steak, I had a pasta dish! YUM! The next morning before our flight out, we had a wonderful breakfast served by a very friendly server. I would definetly recommend this to my friends.", "user": "Lucille1956", "date": "July 18, 2007", "id": 8182139}, {"rating": 2.0, "title": "Eh, not so great", "text": "I have stayed at many Radisson hotels both in the United States and in Europe. I have stayed at the Radisson in Arizona, Texas, San Francisco, Nashville, as well as the Radisson Edwardian Leicester Square.", "user": "orridge", "date": "July 8, 2007", "id": 8079647}, {"rating": 3.0, "title": "OK for memorial day \"pass-through\"", "text": "This particular Radisson fell FAR short of all previous experiences. It is not a terrible hotel. Just not quite a Radisson. We were told the hotel had problems when visiting a local winery.", "user": "pandahenry", "date": "May 30, 2007", "id": 7721828}, {"rating": 4.0, "title": "Reasonable small town full service property", "text": "My rating is 2 stars, not 3 or 3.5. Also, the shower is SMALL!!!", "user": "DenverBrian", "date": "April 12, 2007", "id": 7335915}, {"rating": 1.0, "title": "Yuck!", "text": "This hotel had excellent staff who upgraded us to a suite, but alas was next to a humming electric equipment room.", "user": "sandyw", "date": "January 22, 2007", "id": 6642173}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We drove to this hotel after could not find decent price hotel between 10 miles south of Santa Barbara and Solvang. Most of the hotels were sold out. One two star motel in Solvang quoted us a price of $299. We decided to drive an extra 45 minutes and found this Radisson hotel for $129/night; it was one of the best decision we made on our trip.", "title": "A good find", "helpfulness": 6, "user": "trangf", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5788088, "likes": {"disliked": "— 4 miles from the main freeway"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "This hotel locates right on the a small airport. From our balcony, we could see some small planes parking right below. The airport however is very small and rarely had any activities. Actually, our room was very comfortable and quiet for us.", "title": "perfect stopover", "helpfulness": 3, "user": "minkymeen", "date": "July 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5435887}, {"rating": 2.0, "title": "Stay at Your Own Risk", "text": "We both love the “sleep by number” king size bed. The bedding was soft and comfortable, the pool and spa were very nice. I thought the bathtub was a little small but my husband was content with it.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 3, 2006", "id": 4831496}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "The staffs were attentive and very helpful. This hotel is a good find and we will come back to this hotel again.", "title": "Wine tasting getaway", "helpfulness": 3, "user": "Pookaa", "date": "November 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4154134}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "Arrived at this hotel late after driving along teh Big Sur from San Francisco – check in quick – large room with a sleepmaster bed – very comfortable – large bedroom and bathroom – room was located on ground floor looking out onto the runway but we were not disturbed by any noise. My boyfriend left his electric toothbrush behind in this hotel – he only discovered it missing a few days later and when he rang hotel they located it and posted it to the hotel we would be staying in Las Vegas – excellent service", "title": "Nice for a stop over", "helpfulness": 1, "user": "Sam B", "date": "October 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4004933}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I really liked this hotel. The bed was wonderful, particularly for a hotel bed. The sleepnumber is fantastic and two people who have different firmness needs can both be happy. The room was very comfortable, and I loved the chaise lounge. It seemed like every room had a little patio, which was a nice touch.", "title": "Great stay at the Radisson", "user": "pinkypinksand", "date": "January 12, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 23502747, "likes": {"liked": "— the sleepnumber bed", "disliked": "— Could have had more cable channels"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The restaurant where breakfast is served looks out onto the little airport and runway and it's a lovely view and really interesting to see the tiny planes take off and land. Brunch was also very good.", "title": "Nice for Business Travel", "user": "Zooper", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 20324519, "likes": {"liked": "— Sleep Number beds"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I would definitely stay here again if visiting Santa Maria!", "title": "nice", "user": "nannatwo", "date": "August 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 18896606, "likes": {"liked": "— the bed", "disliked": "— set up of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "The place is a little worn, but clean and comfortable. Even though it is right by the runway at the small local airport, it is quiet. There is free high speed internet and I really like the sleep number beds. The breakfast is good and the staff is friendly. It's a fine place for business travelers; I'll definitely stay here again.", "title": "A good night's sleep", "user": "joemed2001", "date": "July 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 18387581, "likes": {"liked": "— clean and quiet", "disliked": "— exercise room sub-par"}}, {"rating": 2.0, "title": "Older \"motel\" -- adequate for lodging", "text": "Nice hotel but a little off the path. I had read about it being so close to the airport that some didn't like that. While we were there the noise level was very low. We were on the fourth floor over looking the run way.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 9, 2008", "id": 13407037}, {"rating": 1.0, "title": "Not a good experience-beware of airplanes", "text": "We did not have a good experience staying at this hotel. We booked a room last minute because we couldn't find another room elsewhere and wanted to try out the sleep number beds. When we got there we had our choice of a few rooms and we asked for whatever was going to be the most quiet. What a joke. We were put in a room on the third floor and at about 9pm started hearing loud music. When we called the front desk they informed us that there was a club on the bottom floor and they couldn't tell us what time the music would stop. We decided to switch rooms and were put on the other side of the hotel. We thought this would be quieter and were surprised to look out of the window and literally be on an airport runway. We were within hundreds of feet of small airplanes taking off. They did not stop until late at night and began very early in the morning. The hotel is actually between the airport building and the runway which we realized the next morning, so you cannot be any closer to the planes. It's ridiculous. And to top it all off, the sleep number beds were not that comfortable and very loud to operate. Overall, I would not recommend staying here unless you don't mind a lot of noise.", "user": "beksLosAngeles", "date": "September 30, 2007", "id": 10023166}, {"rating": 3.0, "title": "Nice for a getaway", "text": "Took a trip to the Central Coast as an end of the summer getaway with the kids before school started. Not knowing exactly what the weather would be like around Pismo Beach, we elected for Santa Maria so that being a little inland, if the coast was socked in with fog, we'd at least get some sun and pool time. This ended up being a great strategy. Perfect weather in Santa Maria...fog until the afternoon at Pismo.", "user": "swirlinabc", "date": "September 18, 2007", "id": 8749057}, {"rating": 3.0, "title": "Mediocre room but good/inexpensive stop for driving the CA coast", "text": "The hotel itself was fairly pleasant, though we felt that the sleep number beds were a gimmick. It was hard to tell one number from another. Free internet was quite helpful. Breakfast buffet had several choices, but is quite rushed on Sundays where they close early at 9:30 so that they can set up for Sunday Brunch which is not part of the breakfast package. The pool was decent and hardly used while we were there.", "user": "williamtraveler", "date": "August 14, 2007", "id": 8423356}, {"rating": 5.0, "title": "We like airplanes", "text": "A few hitches...while we reserved a 2 bed room for 4 nights, when we arrived all there was available was a king for me, my wife and 2 kids. Although they discounted the room until we could be moved to a double-double, it was 2 nights of inconvenience trying to fit 4 of us onto a king bed and a rollaway.", "user": "VistaGal", "date": "August 12, 2007", "id": 8396830}, {"rating": 1.0, "title": "Beware Smokers Paradise", "text": "Maintenance of the rooms could use some attention. A few nicks and peeling wallpaper here and there. One thing that drove us crazy was the shortage of electrical outlets in the room. Some of the ones that were available were worn out and would not hold a plug. Nowadays with chargers for everything, getting the phones, cameras, and other electronics was a challenge.", "user": "CaliforniaTraveler13", "date": "August 4, 2007", "id": 8351254}], "location": {}, "stars": 3.5, "variance": {"poor": 11, "average": 31, "very good": 48, "terrible": 6, "excellent": 39}, "aka": "Radisson Santa Maria", "slim_ranking": 0.315789473684, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}