{"user_rating": 4.5, "review_count": 723, "name": "Raffles Grand Hotel d'Angkor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Great Hotel. Stayed for 5 nights and was an excellent experience. The most striking feature perceived from the first day is the service orientation of everyone. You do your check-in in the terrace sipping a complementary juice while they take care of the paperwork; when you comeback from sightseeing they receive you with a cold towel to freshen up; you get complimentary bottles of water daily; awesome swiming pool; wonderfull spa; etc etc. This is a truly five star hotel that although on the high price range for Siem reap hotels it is worth it. The atmosphere through out the hotel is great from the little details (flowers, soft live local music in the lobby, etc) to the things that you must expect from a five star hotel (top spa, great breakfast, etc). If it is within your budget, you will certainly enjoy it.", "title": "Worth it", "user": "AEPP1961", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 146298229}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed here for 5 days and enjoyed everything about it. The staff were super. Always there for you without being intrusive. Service top class and the hotel provided everything a visitor could ask for.", "title": "Can't fault it", "user": "John T", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146180745}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I had a suite which was worth the extra. the newer wing is much nicer and the staff are wonderful. My butler was sweet and eager to help, very professional. the breakfast was amazing and the pool was warm and refreshing in the humid air.", "title": "No power but fantastic", "user": "dentiststan", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146083154}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed here as part of a Southeast Asian vacation. Absolutely beautiful hotel and room. All amenities provided. As stated elsewhere, separate bath and shower, amazing staff, great location. Nice bar on main level--good English spoken and understood and bartender seemed happy to practice her English as well.", "title": "Fabulous hotel", "helpfulness": 2, "user": "Elizabeth Q", "date": "November 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145979622}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed 2 nights and wish we had been there longer. The staff were excellent and made you feel welcome. Everyone spoke very good English. The room was comfortable as was the bed. The bathroom was very nice with a tub and a walk in shower. Drinks and food were wonderful and well prepared. They have a traditional dance show twice a week, which we were able to attend. Food buffet is served at about a dozen different stations while you are watching the show. The location is great for getting around to various sites. Breakfast was delicious, with both Asian and American choices. The pool is very large and the setting is just gorgeous.", "title": "Beautiful and Comfortable Hotel", "helpfulness": 1, "user": "Buzzby48", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145702649}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My family and I stayed at the Raffles during a recent trip to Siem Reap and had a great experience. We'd looked into more modern places but honestly, this hotel with its colonial vibe made the overall experience that much better. Definitely book a room in the main building, I can't speak for the other rooms but the classic finishes made it feel more authentic. The food was good, the service was great - our guide (to the temples, the town and beyond) was fantastic, they gave us good recommendations for shopping (although I must admit we liked the dining selects based on our own research much better than those offered by the concierge), and the manager went out of their way to return some items we accidentally left in our room on checkout. All in all, if we ever get to come back to Angkor Wat, we'll definitely be staying here.", "title": "Old school", "helpfulness": 2, "user": "jcurry", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147946476}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The final hotel of our grand tour of indochina was Raffles. It was simply perfect.Our rooms were excellent. Always regularly cleaned and tidie to a high standard.The area around the pool was simply perfect and gave us a great way to unwind after a day of temple trekking. The breakfasts were excellent as was the food in general, but the most striking feature for us must be the staff. Always smiling, always so very helpful and always making time to talk to you. We found the staff so genuine in their desire to ensure all was as it should be, something often lacking in our world today. Well done raffles, no one could have made our stay any better!", "title": "Too short a stay", "user": "TJWOxford", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147617272}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We loved our visit to this hotel. Our room was large and very clean. Good hot water and amenities. The breakfast buffet was full and very good and the service was first rate at all levels and aspects of the hotel. Old world charm. The Hotel also offered good shopping with 5 or 6 stores that sold quality items and local souvenirs.", "title": "Wonderful charm and Excellent service", "helpfulness": 2, "user": "Scotty65Md", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147405337}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Well located to the Angkor Wat complex. The spa was lovely and the rates were reasonable for the services. It was the firs time I ever saw orchids atop urinals in the spa rest rooms.", "title": "Understated charm & elegance", "helpfulness": 1, "user": "Sackville", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 147243798}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "A five day stay was still not long enough at this fine grand old hotel. The service is superb, the food, spot-on and the rooms just fab. OK, a few gripes with the plumbing if you have a room in the main building, and OK there is no separate shower - but this is an 'old lady' that has not lost her charm and elegance, she has to be allowed some old ways.", "title": "A Fine Hotel Close to a World Heritage Site", "helpfulness": 2, "user": "Strathcool", "date": "December 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147087608}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I spent three nights in Siem Reap at this hotel and wished we had planned to spend a week. The hotel is a wonderful hotel with phenomenal service - from the personal greeting by name from virtually every member of the hotel staff to the effort made by everyone we encountered in the hotel to ensure our stay in Siem Reap was memorable. We disagree completely with those reviews that complain about the hotel's supposed fading glory. True, it is old, but its age gives the hotel much of its charm and it is beautifully maintained. Our room was spacious, the meals we had at the restaurant were outstanding, and the pool is beautiful. But the genuine friendliness and helpfulness of the staff stand out above all else. We would return to the Raffles Grand Hotel d'Angkor in a heartbeat.", "title": "A superb hotel - charm & luxury without pretensions!", "helpfulness": 3, "user": "NERoth", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34717775}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "If you love history, then this is the place for you.", "title": "Time travel is possible. Simply Stunning.", "helpfulness": 3, "user": "PJ_25", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33783189}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Impeccable service by the most friendly staff, ambiance that only comes with the grand history of this hotel and spotlessly clean as one would expect of the Raffles name.", "title": "Loved this hotel!", "helpfulness": 2, "user": "kellycares", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32907271}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We travelled during low season and, despite the other guests, it felt like we had the place to ourselves.", "title": "Excellent Hotel! Excellent Value!", "user": "Trisha C", "date": "June 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31609189}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "Breakfast was included with our room and served buffet style with a great variety, delicious and beautifully presented.", "title": "Colonial Ambiance", "user": "criticaleyes7", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30507586}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Stayed in here for one night during my Siem Reap trip (did a bit of hotel hopping) and it was fabulous. The room was well thought out with a comfortable bed, a nice big TV and a small balcony. The bathroom was a tad small, but it was sufficient with nice amenities.", "title": "Old World Charm", "user": "JauiPop", "date": "December 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146856808}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The pool area was great - a nice large saltwater pool with great poolside service - friendly and attentive.", "title": "Gorgeous Raffles", "helpfulness": 1, "user": "SunnyMelissa", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146738432}, {"rating": 2.0, "stay_parameters": "Stayed November 2012", "text": "Breakfast was also very good - fresh food, champagne, good coffee and a good egg station that managed to do fabulous poached eggs.", "title": "Noisiest hotel room I've ever stayed in", "helpfulness": 2, "user": "nicko060", "date": "December 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 146533457}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "All in all, very relaxing. Loved the heritage of the place as well. Definitely would go back if I can afford it again!!", "title": "Great Hotel", "helpfulness": 2, "user": "Howie1953", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146401711}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We just stayed for 6 days in Raffles Grand Hotel d'Angkor from the 24th November. What a special experience.", "title": "Best hotel by Anchor Wat", "user": "judy m", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146342782}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed here for the final 4 days of our holiday touring Vietnam & Cambodia. It was a great choice, very relaxing and certainly lives up to its 5* billing. We had a standard room (State room) which was a good size with large comfortable twin beds, feather pillows (excellent sleep quality!), a separate bath & shower and nice views of the garden. In fact it had all the amenities you'd expect in a 5* hotel such as a spa, well equipped gym (which was never busy) and a beautiful large pool. All the service was excellent, from housekeeping, restaurant, pool staff to conciege and front desk. We found everyone to be extremely helpful with good English. They also learnt our names within 2 days ( not bad for a hotel with so many rooms).", "title": "Brilliant place to stay", "helpfulness": 2, "user": "7Dave7", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145611877}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Three other special points to mention:", "title": "A true five star", "helpfulness": 2, "user": "londrepyramid", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145567377}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The hotel has a butler service who brought my wife a beautiful iced cake on her birthday with flowers - I can only assume they must have found out her birthday from her passport when checking in).", "title": "From start to finish....just great.", "helpfulness": 1, "user": "siralex1", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145561771}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The concierge arranged an excellent & safe Tuk-tuk driver (Mr Sok Sokha) on Day 1 and we used him for our whole stay when going into Siem Reap. He was very reliable and knew some good shops for bargains.", "title": "Impeccable service and beautiful facilities", "helpfulness": 2, "user": "ArnaldoRuiz", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145542707}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Also we were given a late check-out as my wife was feeling ill from our all day tour to Koh Ker the day before; as we had a 28 hr journey to face, this was really appreciated.", "title": "Perfect in every respect", "user": "BabyBlueOwl", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145356664}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We spent 4 days in Siem Reap. We originally wanted to book at the Aman resorts, as we have great experience with them, but unfortunately (actually, FORTUNATELY!), it was fully booked. We picked the Raffles and i can't imagine we could get a better service or anything in the Aman. may I point out one night in Aman was going for $1000 and we paid $130 in Raffles! this resort was spectacular, especially due to the incredible staff there.", "title": "Amazing - better than AMAN next door!", "user": "MandMLondon_NewYork", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30437603}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Service: I have to start with the staff as this was the most impressive service I've received, and for the price we paid! We arrived from the airport, 10 min drive, and there was a personal opening the car for us, another opening the door, another taking our luggage, another handing us a cold towel, another handing us a cold juice drink, another handing us our room key, another opening the elevator door and another one taking us to the first floor in the elevator so we wouldn't have to push the button! And this was like this every time we entered the hotel.", "title": "Fantastic colonial experience", "user": "SBM081", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28487762}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "HOTEL: french colonial style, old fashion and cozy. very large rooms. all the hotels are next to each other on one or tow roads so no need to worry about location.", "title": "Old fashioned class", "user": "lifeissweetbrunei", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28254891}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "FOOD: most incredible. we only ate in the hotel as we didn't want to take chances. fantastic, a lot of local flavors, in a raw or \"fusion\" style. We went to the bar every night for the piano player. The cocktails were out of this world.", "title": "Great Hotel and Staff!", "helpfulness": 1, "user": "mcarthurws", "date": "April 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27477378}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "SPA: best massage we had in years. so cheap we had two hours every night", "title": "French Indo-China Architectural Classic", "helpfulness": 2, "user": "Kelly P", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26708040}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Having stayed in the Raffles Phnom Penh earlier, with great satisfaction, I was keen to stay at the sister hotel in Siam Reap. Finally got the chance with my sister and brother in law for their wedding anniversary. 4 days there was just great, and all I hoped. Pool is huge, service is wonderful (attentive, but not obsequious), buildings and grounds are well maintained and in keeping with the colonial elegance. They made a special effort to make my sister's wedding anniversary unique, and at all times the staff added to the enjoyment of our stay. Location is not quite in the middle of things, but easy to get to and from the downtown market area - they don't expect you to have to take hotel transport to most places. Guides and cars they do arrange for you are reasonable price. Food was great. drinks were great. A reasonable cost to stay there, but really well worth it for us, and ensured we had just the perfect stay while visiting Angkor Wat - the perfect complement to seeing the old temples.", "title": "always a fan of old-style colonial elegance and service", "helpfulness": 2, "user": "YugBKK", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 24990448}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The Raffles Hotel is not a five star hotel, it may appear to tick all the boxes initially but after taking a second look it is far from. One of the reasons this property was chosen was for its \"old world charm\" however, this is not an excuse for the hotel being poorly maintained and run down. The hotel also feels like an old fashioned train station with masses of people and tour guides coming and going.", "title": "Not a five star hotel", "helpfulness": 1, "user": "Carla123", "date": "January 23, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 23820345, "likes": {"liked": "— The location - you could walk to Pub St or take a TukTuk for USD2", "disliked": "— Run down and train station atmosphere"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "The rooms were very dark with marks on the walls and carpets. The bathroom was very old with major signs of wear and tear such as the bath tub being so scratches there were more brown/yellow tones and only a hint of white.", "title": "Ambiance and style", "helpfulness": 1, "user": "Gordon L", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23787905, "likes": {"liked": "— Service, comfort", "disliked": "— A little drab in the"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The breakfasts were average, for us the lack of fruits available was an issue especially considering an abundance is available on the street for under USD1 and the hotel serves 4 types of fruit and 12 types of fruit juices. The buffet is also very small and at peak times there are masses of people waiting around the buffet for food to be replaced.", "title": "Great staff and service", "helpfulness": 1, "user": "echobarry", "date": "January 20, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23739528}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I would not stay at this hotel again and would likely try the Anansara (across from this hotel) or Hotel De La Paix (very close to Pub St).", "title": "Wonderful experience", "helpfulness": 1, "user": "martin55london", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23307013, "likes": {"liked": "— it had glamour and service", "disliked": "— nothing at all"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "As soon as I walked into this hotel, I knew it was a special place. When we arrived, we were shown to the lobby area overlooking the pool and given a luscious tropical juice to drink. The colonial and historic atmosphere was quite striking right from the beginning of our stay.", "title": "Awesome Stay", "helpfulness": 1, "user": "kingsroadgal", "date": "September 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41478272}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The architecture of the hotel is quite stunning and comfortable. The public areas are so well decorated and well-kept. The hallways are black and white marble and simply dazzle. I did like our rooms in the old section of the hotel very much. You reach the rooms in one of the quaintest and oldest elevators that I have ever used. Such was the condition of the elevator, however, that it gave you no worries. It was perfectly kept, and quite a pleasure to ride. I would have to say that it was one of the best elevators I have ever used in a hotel, despite its small size.", "title": "A taste of the fabulous", "helpfulness": 1, "user": "TCA", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39970176}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "If I had any critique of the Grand, it would have to be the rooms. The bedrooms are quite charming, but the baths don't quite measure up. My main dislikes were the wood toilet seats, and the somewhat ratty shower curtains.....they need to be replaced. I almost subtracted a star for this, but the overall ambience of the hotel was so nice, I couldn't quite bring myself to do it.", "title": "Charming property with excellent service", "helpfulness": 2, "user": "Japan_Gaijin", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39215715}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Also, the staff of the hotel is quite great. Very friendly and helpful. They quite efficiently arranged a car and guide for us so we were able to tour Angkor in comfort. Angkor and the surrounding temples more than met our expectations. We also enjoyed our drive down to the Tonle Sap.", "title": "Wonderful experience - especially the breakfast", "helpfulness": 1, "user": "jamiep84", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35850745}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Food in the hotel is quite good both in the casual restaurant and the more formal restaurant. Apparently, the chef for the hotel also works for the Cambodian royal family when they are in residence in Siem Reap.", "title": "best hotel, best service", "user": "montecristo-no1", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35133584}], "location": {"country": "Cambodia", "continent": "Asia", "city": "Siem Reap"}, "stars": 5, "variance": {"poor": 17, "average": 27, "very good": 123, "terrible": 6, "excellent": 550}, "aka": "Raffles Grand Hotel d Angkor", "slim_ranking": 0.115384615385, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Since the early 1930s, a visit to the ancient temples of Angkor has been synonymous with a stay at Raffles Grand Hotel d'Angkor. Located in the heart of Siem Reap, a mere 8 kilometres away from the majestic Angkor Wat, this leading Siem Reap luxury hotel offers convenient access to some of the most intriguing ruins of the temple complex. The luxury Siem Reap hotel offers personalized pampering at the award-winning Raffles Spa, as well as an array of fine dining choices, from exotic Khmer cuisine at the Restaurant Le Grand to the Elephant Bar where fine wine, champagne and cocktails, including the signature Airavata is served. For a one-of-a-kind dining experience, opt for private dining at one of the magnificent temples of Angkor. Spread over 15 acres of beautifully landscaped French gardens, Raffles Grand Hotel d'Angkor exudes old-world Cambodian grandeur infused with the best of modern comforts. An elegant cage elevator, the township’s very first, adorns the lobby and continues to gracefully ferry guests as it did since the hotel was first established."}