{"review_count": 1033, "slim_ranking": 519.0, "name": "Rain Forest Cafe at MGM Grand Hotel and Casino", "reviews": [{"rating": 5.0, "title": "Breakfast at the Rainforest!", "text": "It was really good and a good price compared to some of the buffets around town! We have eaten dinner here in the past also. We love the \"thunder storms\" and the salt water fish tanks are fabulous!", "user": "Isabell1960", "date": "October 13, 2013", "id": 180873544}, {"rating": 4.0, "title": "Good breakfast in a fun location", "text": "The special effects (of a rainforest) were very enjoyable throughout the meal. The food was OK, nothing spectacular. It was the special effects and shopping in the rain store that was fun.", "user": "Patricia J", "date": "October 13, 2013", "id": 180799170}, {"rating": 1.0, "title": "Poor service", "text": "After a day of sightseeing we decided to head here and and grab a quick bite before bed. The restaurant itself is ideally located and superbly decorated in its rainforest theme. The one thing about Vegas is the service you recieve is second to none. With tips being so important, you are treated like royalty. However this was not the case here, with our waiter barely muttering 2 words to us for the 2 hours we were here. We both decided on a beer, with standrad burger and fries. Our waiter took nearly 30 minutes from enterring to take our order, the place was emptying so this seemed very excessive. We then waited a further 30 minutes from finishing to recieving our bill, due to the fact our waiter had gone missing. In the end we walked out and placed the exact money at the counter. The food itself was plain fare, we have had far better for a lot less in many places here. Would i visit this venue again? Never in a million years. Its the worst service i have ever recieved in any place i have eaten.", "helpfulness": 1, "user": "Shane B", "date": "October 13, 2013", "id": 180793350}, {"rating": 4.0, "title": "Noisy But Otherwise Good", "text": "Food was better than average, service was Goldilocks: not too much, not too little, just right. Prices were reasonable, but just barely so. If they could just find a way to lower the overall noise level...", "user": "Grundoon", "date": "October 12, 2013", "id": 180744350}, {"rating": 5.0, "stay_parameters": "Visited October 2013", "text": "Had a meal here with my daughter this week and was blown away by the fantastic surroundings and effects, but also the food was excellent, I had a Cobb Salad and my daughter had a Brave New World Pizza and both were delicious. The price was very reasonable and the service was excellent.", "title": "Great food in awesome surroundings", "user": "Yorkie1948", "date": "October 11, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 180647743}, {"rating": 3.0, "stay_parameters": "Visited September 2013", "text": "4 adults. The decor is awesome here - great for kids! We had a late night dinner (no cocktails) here on Sept 30, 2013 around midnight. We ordered 2 burger entrees, 1 salad, 1 chips & queso and 4 sodas. The dining room wasn't very busy at all but we waited to be seated, then waited for our beverages and food quite a long time, then waited for our check.", "title": "Food was good - service was slow", "user": "Laura O", "date": "October 11, 2013", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 180610828}, {"rating": 5.0, "title": "Great Experience", "text": "We had breakfast here a number of times and although aimed at kids we enjoyed the thunder show with the moving animals.", "user": "RJTaberner", "date": "October 11, 2013", "id": 180605286}, {"rating": 4.0, "stay_parameters": "Visited April 2013", "text": "The service is what you expect in the US and the food quality was very good.", "title": "Busy Busy Busy", "user": "speedbrush", "date": "October 11, 2013", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 180600077}, {"rating": 5.0, "stay_parameters": "Visited September 2013", "text": "Thought about eating here but every time we went to try it was rammed mainly families, obviously a big attraction for the children the food must be good as it was so hard to get a table we were there at Easter what the Americans call spring break so children of all ages and lots of teenagers to be fair it looks a great place to eat but beware it will be expensive ,loud and packed unless your very lucky so if you like to dine in a relaxed atmosphere I would give it a miss .", "title": "SO GOOD FOR A SNACK", "user": "maganda0411", "date": "October 11, 2013", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 180544300}, {"rating": 5.0, "title": "Yummo!", "text": "The atmosphere is the standard rain forest café style dining. The food is great, so cheap and very large servings, good if you're a big eater. Service is good and friendly. Good if you have kids along to experience the animatronic animals and the amazing very large aquariums. Just a bit noisy for me. But its worth the experience.", "user": "Tiffane_Leigh", "date": "October 10, 2013", "id": 180532369}, {"rating": 4.0, "title": "Amazing", "text": "Wow how nice was this place loved it ..even in stormy weather it was great lol....meal was good and like all meals in the states it was huge....Very Very nice", "user": "jeffmLoganQld", "date": "October 10, 2013", "id": 180525450}, {"rating": 5.0, "stay_parameters": "Visited October 2013", "text": "We ate at the Rainforest again this trip to Vegas. We always enjoy this restaurant, especially for families with young children. I'm sure it could be a bit pricey for families but the animated jungle scene would be nice for them to see. You will get priority seating if you belong to the Landry Club. This is a good perk for this restaurant and others that are part of the same program, check it out. The food is decent, never been disappointed, moderately priced.", "title": "Always a fun place to eat, lovely shop adjoining it.", "user": "angeliclovebug44", "date": "October 10, 2013", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 180515968}, {"rating": 5.0, "stay_parameters": "Visited June 2013", "text": "Great place to eat. Great for families and singles. Huge meals and even better cocktails theme of the restaurant is awesome love the thunder storms and birds. Hint share meals as they are very large", "title": "Excellent food and service", "user": "Lairoo", "date": "October 10, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 180503977}, {"rating": 4.0, "title": "Nice for a snack", "text": "the standard rain-forest cafe style - amazing large aquariums to see plus the animatronic animals. Food, drink and service were great and the souvenir glass will always remind us of this lovely palce", "user": "hardwil", "date": "October 10, 2013", "id": 180434568}, {"rating": 5.0, "title": "nice", "text": "great food, good price, food was piled on the plate, so we definitely got more than what we paid for.", "user": "Shanners001", "date": "October 9, 2013", "id": 180304001}, {"rating": 3.0, "title": "A noisy experience", "text": "This is a busy - noisy experience simulating a rainforrest. The food is ok and service average.", "user": "Kebe42", "date": "October 7, 2013", "id": 180088257}, {"rating": 4.0, "stay_parameters": "Visited October 2013", "text": "Your kids will be intrigued, but will be pumped by the noise and visual experience", "title": "Good, chain restaurant.", "user": "bmg617", "date": "October 6, 2013", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 179947539}, {"rating": 4.0, "title": "Awesome Atmosphere", "text": "Good food, good service. Went at 12 noon on Saturday, didn't even have to wait for a table. The waiters (er...Safari Guides) are engaging, fun people.", "user": "Ray W", "date": "October 6, 2013", "id": 179938574}, {"rating": 4.0, "stay_parameters": "Visited October 2013", "text": "Strawberry Mojito was great, as was the Portobello Wrap (although was a little messier than I expected).", "title": "Classic Rainforest, good food, decent prices.", "user": "spracr", "date": "October 6, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 179881183}, {"rating": 5.0, "title": "Fun to do!", "text": "This is just like any other Rain Forest Cafe though, so don't be too surprised either way.", "user": "abetcha", "date": "October 5, 2013", "id": 179820333}], "location": {"country": "United States", "city": "Las Vegas"}, "variance": {"poor": 72, "average": 259, "very good": 347, "terrible": 63, "excellent": 292}}