{"user_rating": 3.5, "review_count": 94, "name": "Ramada Painted Post", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "we ended up stopping at this hotel due to time of night and rain snow mix happening on our way to New York City. There is not much in Painted Pot and the Ramada looked familiar. Lobby was very cold and the price was rather high for it being 6 at night but oh well. The girl at the front desk was very nice and gave us some restaurant names to head to. Room was close to lobby and entrance, very clean and comfortable. We used the computers in the little room....wifi worked well but it would of been nice if it worked in our room. It included a breakfast the next morning...room was again very cold, milk was sour and there wasnt much to pick from but the woman running it was very nice. This hotel served its purpose but for $ we could have stayed in a nicer motel on our travels,we probably wont be staying there again.", "title": "a stop along the way....", "user": "candle_maker_2004", "date": "January 3, 2014", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 189522871}, {"rating": 2.0, "stay_parameters": "Stayed November 2013", "text": "I stayed at the Ramada in Painted Post NY for one Friday night because I was traveling to Alfred,NY with my dog. For 15 extra dollars I could bring my 16 pound cocker spaniel and unfortunately this \"dog friendly\" hotel wasn't so dog friendly. My dog could be compared to an indoor cat in that if she could, she would never go outside. She goes out for two minutes, finds the closest grass spot to do her business and runs back indoors. While staying at the Ramada, I believe she contracted fleas.", "title": "Fleas", "user": "KFS1", "date": "November 25, 2013", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 185846487}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 19, "average": 24, "very good": 27, "terrible": 7, "excellent": 17}, "aka": "Ramada Painted Post Hotel Painted Post", "slim_ranking": 0.833333333333}