{"user_rating": 4.0, "review_count": 179, "name": "Ramada St. John's", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The room itself was nice and clean, with a large comfy bed. The corridors were old and worn; the elevator small and inconveniently placed. We came with lots of luggage, and had to enter and exit through the restaurant with luggage cart due to steps inconveniently placed in the lobby. Pushing the cart up narrow, long ramps to get to the elevator was more exercise than I was looking for, and maneuvering past the pop and ice machines to get into the elevator with the cart was another inconvenience. Although downtown St John's is enchanting, the area that this hotel is located in is anytown, ugly North America. Would recommend staying here only if you have a car and very little luggage. Most of the lobby staff were adequate only or less than adequate. Shuttle driver and the waitress we dealt with were gems.", "title": "Good room, poor surroundings", "user": "love-the-rock", "date": "September 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 117827582}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We happened to get to St. John's a day early and so we can compare the Ramada Hotel where we had (unfortunately) pre-booked 3 days & the Holiday Inn St. John's that had room for us the day we arrived early....and there is no comparison. It is hard to fathom 1) how the Ramada outranks the Holiday Inn on Trip Advisor and 2) where the Ramada spent a couple of million dollars in a recent renovation. The Ramada is one very tired and outdated hotel. It also has some serious accessibility issues unless someone tells you that you can bring your luggage through the restaurant and into the hotel (!) But if you do, you are at the very opposite end of the building to take the scary elevator that creaks and groans. The elevator fits 4 people but our family decided against taking it for the most part, but when we did, we decided not to travel in it together to allow other family members to get help if required! The fitness area is a makeshift extra room where they could not even find the time to take the headboards off of the walls. Also, the beds were not as advertised so CAUTION to those with a bad back!", "title": "Ramada-One very tired & outdated Hotel with accessibility issues", "user": "BPCGA", "date": "September 4, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117658369}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Passable if you need a place to lay your head, but no frills. Not much in the way of a place to eat. Very poor location. For a new hotel, meeting rooms etc are not really what one would expect.", "title": "Poor location", "user": "Buchans79", "date": "August 17, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 2.0}, "id": 116866713}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Friendliest people in the world live in Newfoundland :-)", "title": "Love St. John's, Newfoundland!", "helpfulness": 1, "user": "Jewell013", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115936168}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "and the Ramada is a great place to stay....just outside the downtown area. Near the Avalon Mall shopping Centre and Memorial University. Has a free airport shuttle. It is also on the bus route if you do not have a rental car. We were there to settle my daughter into her university dorm and found the Ramada to be located perfectly for everything. There is also a Starbucks and a Swiss Chalet directly across the street.", "title": "Nice but needs refreshing", "helpfulness": 1, "user": "thearcher23", "date": "July 14, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 115362152}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I have just returned from the Ramada St. John's, and I am please with my choice of lodging. It was as I expected from my research - including using TA reviews. It is a busy area, but I heard NO road noise at all from my room. I would not want to be there w/o a car - so if you plan to do all your sightseeing on foot or by taxi, don't stay here.", "title": "Happy with my stay", "user": "sfm132", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 132650494}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I did not use their restaurant, but the aromas were good as I passed by. There is close access to many chain restaurants and stores - but again, a car is pretty vital.", "title": "Fantastic Hotel in a Wonderful City", "user": "expeditionswest", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131747024}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The room was very large, even with 2 queen beds. It was clean (I like the trend of encasing comforters with clean white sheets); TV station selection wasn't huge, but certainly adequate. At time of reservation I asked for a room on the top floor and away from the elevator (all to reduce noise impact), and that is what I got. The only noise issues I had was some loud door closings from nearby rooms late night or early morning - but that was inconsiderate people, and a common problem in hotels. The staff I encountered was always friendly.", "title": "A little out of the action", "user": "EaseCoaster", "date": "June 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 131399039}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "So for what the Ramada is advertised as, and the hotel chain level expected - it was an excellent stay.", "title": "Good experience!", "user": "Tara154", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 131285214}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The staff at Ramada went over the top to help me stay in my room a few more days than reserved. The rooms were clean and well-appointed. Internet was free and reasonably quick. Plenty of parking, all easily accessible. The hotel is pretty far from the downtown area, but well positioned overall for those with a vehicle, which allows access to the newer conveniences and shopping away from the city center.", "title": "Decent hotel, but not a convenient location", "user": "Travellers_Checklist", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 130819824}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed here just one night on business November 2012. The hotel is not in the downtown area but was handy to my business meeting and they offer a free airport shuttle. The room was excellent, way more than I needed with two queen size beds and a kitchenette complete with fridge and stove, dishes and cutlery. This would be great for a long-term stay or family. The bed was comfortable and the room very quiet. I ate in the restaurant and the food was quite good. The service was excellent. I would recommend this hotel unless you want to be right downtown. St. John's is not all that large so if you have a car, I'm sure it wouldn't take long to get downtown or to the historic sites.", "title": "Friendly quiet hotel", "helpfulness": 1, "user": "Moltrasio", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120502683}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This hotel has a long, distinguished pedigree. Its creation was a central plank in the 1767 Treaty of Accommodation between the United Kingdom and France, which called for adequate lodging for rum merchants making their stops along the North Atlantic’s lucrative ‘circle of intoxication.’ In the centuries since, the Ramada St. John’s has established itself as a desirable place for weary travelers to stay during their visits to Newfoundland’s principle city.", "title": "Where Quality meets Affordability", "helpfulness": 12, "user": "KtotheG", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120046586}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Though not in the downtown core, the Ramada St. John’s offers much more attractive room rates, yet price alone should not be seen as the only selling point of this establishment.", "title": "good place to stay", "user": "Churchill_Fortunato", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 118384475}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Upon entering the hotel, one is impressed by the layout and cleanliness of the lobby. I would not be surprised if teak or mahogany was used in the construction of the staircases…You know they use elephants to help in lumber harvesting? I read that in National Geographic one time.", "title": "Ramada St John's", "helpfulness": 1, "user": "mjpm3", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117999161}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "On account of my travel schedule, I arrived before the posted check-in time. Thankfully, the manager kindly allowed me to check-in early – he deserves a heartfelt fist-bump for his understanding. Barter is not an approved form of payment (I have found a widely-accepted rate elsewhere is one live egg-laying chicken for a 2 night stay); however, they do take American Express.", "title": "Good clean rooms, excellent service", "user": "grlost", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117991890}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "For my stay at the Ramada St Johns I was looking for a \"moms night out\" place to peacefully lay my head and have some alone time. The check in was easy and efficient, price was great, and the room was so much more than I expected! What a lovely clean up to date room! I also had brunch at the restaurant the next day after check out and great food. Would definitely recommend this place. Much lovelier accomodations than some other hotels in the city ( that charge even higher rates ).", "title": "Excellent Accomodations!", "helpfulness": 1, "user": "mama2two2012", "date": "April 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127093456}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Very nice hotel, newly renovated, great staff. Great loaction for shopping and restaurants.", "title": "St. John's Getaway", "helpfulness": 1, "user": "Wade W", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124316002}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "the ramada never fails to please its always a nice quiet stay all shopping & resteraunts are with in a 5 minute drive", "title": "a nice clean hotel", "helpfulness": 1, "user": "nigrarosa", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122373914}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Had a great experience staying at the Ramada in St. John's. Very conveniently located near the Avalon Mall and several popular eaterys (Cora's, Swiss Chalet, Starbucks). From the time the courtesy shuttle picked my daughter and I up at the airport until check out a few days later, we could not have asked for better service or friendlier staff. Room was clean, comfortable bed, soft towels and a nice little workout room. Will stay there again definitely!!", "title": "Friendly staff, great place to stay", "helpfulness": 1, "user": "Marilyn_B_M", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121423667}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My 2 kids(3yr old & 2yr old) and myself stayed at the hotel for two nights and we had a great time. No problem checking in friendly staff. Long walk to elevator and we had a room with a kitchen on the 4th floor. Nice clean room. Booked a room with 2 queen beds but got 2 double beds but did not complain. Our housekeepers name was Gloria and she was very friendly. Room is very quiet you can't hear much. Overall we had a great time. Restaurant was great chowder yummy, nachos great & the eggs Benedict was to die for. I had it both mornings. Kids meals was plenty on plates for 2 kids to share.", "title": "Great time", "user": "Tracey H", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120868666}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 19, "average": 48, "very good": 52, "terrible": 3, "excellent": 57}, "aka": "Ramada St John`s Hotel St. John`s", "slim_ranking": 0.55, "description": "Ramada St. John's recently completed a multi-million dollar renovation that included all guestrooms, public areas, restaurant and banquet/meeting rooms. All guestrooms are very tastefully decorated and are over-sized, offering free wireless hi-speed internet, large work desk, iron/board."}