{"user_rating": 3.0, "review_count": 190, "name": "Ramada Waterloo Hotel and Convention Center", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed in the hotel for two nights last week to attend a wedding in the area. I wanted something nice, so we paid for the suite on the 10th floor. The rooms were dirty and badly warn out. The pool was so dirty I didn't let my kids swim in it. The kicker was when I saw two drug deals go down in the driveway of the hotel. Stay away.", "title": "150 a night for that room?", "helpfulness": 2, "user": "Tony J", "date": "July 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 135255968}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel is an older Holiday Inn, but very convenient if you are using the Sullivan Center right across the street, as the hotel and Convention Center are connected by a skywalk. The staff is very knowledgeable and friendly from the front room clerks to the maids.", "title": "Average for a Holiday Inn", "user": "Steve S", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 135095402}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I travel for work and spend 3-4 nights a week in hotels. Trust me, I am not picky. This hotel is bad. The staff was very rude. The woman driving the hotel shuttle was angry that she had to drive back to the airport to pick me up after she had already been there. The woman who checked me in was very short with me. The entire hotel outside of the rooms (the lobby, hallways, elevators, etc.) was over 90 degrees -- it's miserable. My room had an old CRT TV that didn't work very well. (The A/C in my room worked well though.)", "title": "All Around Bad", "helpfulness": 1, "user": "Jason E", "date": "July 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 134667807}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I went down to the restaurant for dinner and waited 30 minutes just to get my order taken because \"they forgot to schedule a server that night\" even though I was the only person in the dining room. When I did get my food it was not good. The potato was cold and the brisket tasted stale. I told the bartender and she said it must be me. I went to at least get a candy bar out of the one vending machine in the hotel and it was empty.", "title": "Not worth it", "helpfulness": 2, "user": "Christine D", "date": "July 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 134220980}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We have family in Waterloo and due to the amount of people coming in decided to stay at the Ramada. The room was not that clean the comforters and all the chairs had holes in them. The tv did not work and we had to request for it to be looked at 3 times before the looked at it. The bathroom facet had mold growing around it and the facet in the shower was coming out of the wall. The tub had stains in it. The AC never turned off and so we had to constantly adjut the tempertature. The skywalk was scary to walk through alone late a night with young children and knowing that access to the garage and hotel were easy. The ice machine was broken on our floor and we had to request new cups in our room daily. We went down for breakfast and it was not worth the money. I would never stay here again!", "title": "VERY, VERY, VERY, HOT!!!", "user": "TRACEY M", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133946464}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Our stay in the Ramada Inn was great. The banquet chicken in the convention center didn't win my heart.", "title": "Big group", "user": "treestump", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141187142}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I recently stayed in the Waterloo Ramada Inn August 17th Friday. I arrived from a long 24hr drive from Ft. Lauderdale, Fl. 3am in the morning. I was exhausted yet alert enough to realize there was something creepy about this place. I stayed there until 12:30 that same morning, then check out to look for a better hotel. Later that evening i started itching on my chest and neck. I awakened my1 face, eye, neck, chest, back, arms and fingers swollen, red itchy and painful. I'm a city girl that has traveled extensively ( Africa, Europe, Japan, Israel just to name a few) and I have never experience anything like this ever! Sunday I was taken to ER to discover I HAVE BED BUGS BITES. I contacted main office to inform them of this matter and requested a refund as well as ER visited covered. Brenda Mills the manager evaded my call and attorneys call for 2 days, then finally responded stating\" we had a outside company investigate your room and resolved nothing was there\". Rudely and extremely nice/nasty I was told they will not refund nor cover medical bill thank you for your money. needless to say im presently in a legal issue with them. DONT STAY IN THIS HOTEL IT WILL BE A LIFETIME REGRET!! ESPECIALLY IF YOU'RE ETHNIC, I STRONGLY PRECEIVE THE RULES CHANGED. I will continue to dispute this matter and will NEVER stay in ANY Ramada Inn only because there association with this Ramada. Its about customer service and the principle. Advice; The Hampton Inn In Waterloo saved the day. OUTSTANDING/EXCELLENT service and facillity!!!", "title": "Bed Bugs Bites", "helpfulness": 4, "user": "Aprille H", "date": "August 31, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 139001676}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I travel a fair amount on business. This place was the first one where I actually felt unsafe personally in the lobby. There was a bunch of unsavory individuals in the lobby, and standing outdoors on both sides of the entry. One man, holding a 40 oz bottle wrapped in a bag, even gave me the \"hey baby\" routine. While the staff was helpful and attentive, and the rooms were \"ok\" at best, I think they really need to tighten up on the creepy folks. I also noted the drug dealing mentioned in another review. And, the restaurant was simply hopeless. Empty. No staff, so one to seat you. I risked my life and walked to the pizza place down the street across from the \"Gentlemen's Club\". Ugh. As a helpful hint: don't park your car under the lights in the parking lot. The bugs and spiders cover your car.", "title": "Kind of strange", "helpfulness": 2, "user": "Porter93", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 138779824}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "Well unless you like very dated hotels that are ghetto. I travel for work quite often so I've seen my fair share of crappy hotels. This is definitely one of the worse. It's dirty, the staff wasn't at all polite and there are a lot of random people hanging out in the lobby and outside. The \"wall paper\" in the room is peeling and to be honest I'm surprised the air conditioner is even working with the number of pieces missing from it. Look for another hotel....", "title": "Don't do it....", "helpfulness": 2, "user": "WestRoadWarrior", "date": "August 29, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 138736339}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I stayed here last weekend for the \"Iowa Irish Fest\" the location is perfect. All the people that worked there that I had contact with were great. We used the bus shuttle a couple times without any problems. Shawn was help full getting some reading materials for the bus ride home. The rooms were fine, just needs some upgrading in the bathroom and the TV. I also think the they should open the bar earlier than 4:30 on the big weekend.", "title": "Needs upgrade but good location and great personnal", "user": "palosgirl", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 136506738}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed at this hotel for a wedding because the reception was in the adjacent convention center. We checked in and were in line for the elevator when it broke! They had no idea how long it would take to get fixed, so we climbed up eight flights of stairs (our 3 year old son included) to our room. The only part of the hotel that was air conditioned was the room! The lobby, the hallways, the stairwells, nothing else was air conditioned and it was over 100 degrees outside. The entire hotel could use a face-lift. The room decor was very outdated. The restaurant was terrible too. We ate the \"buffet\" and it was horrible. The two positive things that I can say is that the air was working in our room and that it was convenient for the reception. If you aren't attending an event at the convention center, find another hotel.", "title": "It's July, where's the air conditioning?", "helpfulness": 1, "user": "amd78", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 133835815}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Was coming through town for a quick night and decided to stay here. Really not bad for 60$. Room was clean and the ac worked great. The people at the desk however were not very helpfull. They did not tell me anything once I checked in, even after asking what there is to do around here. Pool was nice", "title": "Not as bad as past reviews", "user": "Marcbriggs", "date": "July 1, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 133167659}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This hotel was chosen by our coach for a weekend soccer tournament. We'll never let that happen again.", "title": "Never let the coach choose the hotel!", "user": "reviewerRochester_MN", "date": "June 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 132801388}, {"rating": 3.0, "title": "Alright...", "text": "The room was shabby. The bedspreads had tears and cigarette burns in them (even though it was a non-smoking room, it had a stench of what was once a smoking room). My daughter went to take a shower, and the tub drain was full of pubic hair. Cleaned it up, called down for more towels, got an apology and someone showed up with new towels 20 minutes later. Wallpaper was peeling all over the place. Just run down and shabby, a lot like the town of Waterloo.", "user": "Jrmsp", "date": "June 19, 2012", "id": 132328589}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Yes parking was free. Yes it was across the street through a skyway...but it was not terribly convenient. Yes we got a great rate, and that's about the only positive thing I can say about the Ramada Inn in Waterloo.", "title": "Nice Hotel", "user": "KatherineNoel", "date": "May 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130220020}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I stayed here over Easter weekend and found the hotel much nicer than many of the reviews of this hotel. The room was clean and the bed was cozy. A great deal for $60 a night!", "title": "not too shabby", "helpfulness": 1, "user": "AlleyKats", "date": "April 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127703228}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I have stayed at this hotel quite a few times because my boyfriend lives in Peoria, IL, and I live in Minneapolis. Waterloo is a halfway point where we can spend the weekend together.", "title": "Not bad!", "user": "Emmy8382", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 127692019}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We have always stayed in a jacuzzi suite, and it's incredible because I can bring my big dog, and they let her stay in the room. So, I get to hang out with my boyfriend and my dog! I like that. I don't think that this hotel is bad at all. It has always been quiet and the housekeeping is respectful of the privacy sign. The beds are very comfortable, and the views from the tower are pretty nice.", "title": "NOT HAPPY", "user": "Kela J", "date": "March 27, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 126794166}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "True, the area around the hotel isn't so great, and there aren't a lot of places in the immediate vicinity to hang out in, but I haven't ever felt that my life was in jeopardy while I was out walking my dog. Also, our cars were fine out in the parking ramp.", "title": "Ramada inn,Waterloo,Ia", "user": "rzbrown11", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 125052387}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The front desk people are great, and I've hung out in the little bar/restaurant a time or two. We have never had food there, but the drinks and service are excellent.", "title": "Crap, Crap, Crap", "helpfulness": 1, "user": "Rmahairas", "date": "February 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 124622149}], "location": {"country": "United States", "city": "Waterloo"}, "stars": 2.5, "variance": {"poor": 45, "average": 43, "very good": 54, "terrible": 29, "excellent": 19}, "aka": "Ramada Inn Waterloo Hotel Waterloo", "slim_ranking": 0.733333333333}