{"user_rating": 4.0, "review_count": 676, "name": "Ramada Hotel and Suites London Docklands", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We booked this through otel.com and got a great deal for only 80EURO per night, per double room , including breakfast. Although is not in the city center, but you can take DLR+ Tube and it's about 20 mins to the city center. The hotel is very clean and business style. Our first room got some problem with the hot water , and after reflect it to the hotel manager, she upgrade our room to suite in the top floor , with great night view. The breakfast is excellent. It is with walking distance to city airport which is very convenient for us since we didn't have many luggage. We are glad for our choice", "title": "Good place to stay", "user": "WeiAmsterdam", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 15019225, "likes": {"liked": "— room", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "My online travel agent www.duniyakehotel.com got me a great deal on this hotel. The hotel is great. Great receiption, quick check in, big clean comfortable rooms and nice bathrooms. The breakfast was excellent. I chose to have the breakfast served in the room. It was complimentary. Everything is perfect with this hotel...................................", "title": "Good Hotel..............Poor location", "helpfulness": 1, "user": "udalvr", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 15016442}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "..........everything but the location. It's way out of central London. It's a five minute walk from Prince Regeant Station on the Dockland Light Railway. It's an isolated location. You are the only one at the station and on the road. It's less of London and more of a US city like Hartford, CT.", "title": "So very Clean", "user": "mandasue", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 14681350, "likes": {"liked": "— Early check in was no problem", "disliked": "— Noisy heating system"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Stayed at this hotel for 1 night to see The Eagles at 02 arena, early check in no problem, staff friendly. DLR station easy reached and brilliant price of (£5.90) for unlimited day travel.", "title": "Nice room, but isolated hotel", "helpfulness": 1, "user": "FamilyTravel63", "date": "March 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 14609828, "likes": {"liked": "— room", "disliked": "— Location, location, location"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Very clean hotel , will definitely stay here again.", "title": "Curates egg", "helpfulness": 1, "user": "onan", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 14526519, "likes": {"liked": "— very helpful reception staff", "disliked": "— the lazy sullen staff in the restaurant"}}, {"rating": 5.0, "title": "Night before a flight from City Airport", "text": "My husband and I enjoyed a night here before we flew from City Airport. We arrived early afternoon went to our room and left our bags. We then took the DLR to Victoria Dock and went on the Emirities Cable Car which was great fun. We then walked back to the hotel. We had dinner in the hotel restaurant and it was very good. There was hardly anyone in there which was a shame. The bed was very comfortable and the room was very quiet. Plenty of hot water for the shower in the bathroom. Had a very good breakfast - good choice and very pleasant staff. Only five minutes from the airport too.", "user": "Speges", "date": "September 15, 2013", "id": 177229061}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Would stay again.", "title": "Dissapointed", "user": "MikaelAgren", "date": "September 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 176920972}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Thanks", "title": "Good hotel", "user": "Lorraine H", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176798484}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Mould in the orangejuice in breakfast restaurant (witch made me feel sick, yeah I saw it when it was to late)", "title": "lovely hotel, friendly staff", "user": "A D", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176484952}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wifi down for a long day, not good for working..How hard could it be to solve the problem..", "title": "Comfortable but far away from Central London", "helpfulness": 1, "user": "J H", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 175661517}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Very convenient for City airport, walkable though not sure for a lone female after dark. Connections into London via DLR very frequent, takes about half an hour. Arriving at the Prince Regent DLR station it is not obvious how to get to the hotel – the website is no help; although I took this issue up with management, one month later there are still no instructions provided.", "title": "Good choice for the airport", "user": "herebedragons", "date": "August 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 174148298}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Breakfast poor value, even at the discounted price when pre-booked in advance at reception.", "title": "Pretty good for what you get", "user": "mar_che2013", "date": "August 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 174007592}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Ate one evening in the restaurant, very good chicken Caesar salad, unremarkable pizza. Good wine selection. Enjoyed the bar food as an alternative to the restaurant.", "title": "Good hotel near Excel and O2", "user": "aruphilly", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 173225141}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This hotel is pretty decently priced for the amount of stars it has and the good service you get. Don't forget London is not known for the quality or size of hotel rooms. The location is a slight annoyance, only because it's on.DLR line which means you need to make swaps to get into the centre. Prince Regent is the closest station and is only 5 min from hotel. Good wifi, and I was on 6th floor. Pricey restaurant but the excel centre opposite had heaps of cafes. Suggestion: buy water and snacks from tesco or M&S to save money. Nearest Tesco was canary wharf I think.", "title": "Excellent stay", "user": "Frainy", "date": "August 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173068559}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Location wise, Ramada hotel is 20 minutes from Bank and Tower Hill underground stations. The Price Regent DLR station is around 5-8 minutes walk. The Royal Victoria Docks are 15 minutes walk away or 5 minutes via DLR and you get Emirates Airway for O2 with wow views from there ; the walk itself is great. Greenwich, Canary Wharf are all nearby. So, as you can imagine, the Hotel is slightly away from the Victoria Docks where most action happens (but we didn't mind it).", "title": "If you ever lose your passport...", "user": "HayleyCleaves", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 172940315}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I booked 3 nights at the Ramada as it is perfectly located for flying into London City airport and 5 min walk from ExCel. We arrived much earlier than the check in time(2pm), but we were given rooms at 9.30am.", "title": "Great Service", "helpfulness": 1, "user": "Wee-Bear", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 14512195, "likes": {"liked": "— Location & Staff"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The rooms were in need of a bit of attention (small hole in 1 of the walls) but were clean and big enough. The shower temperature had been limited so a hot shower was not possible. The matress was in need of replacement as we rolled into a dip in the middle, when I phoned reception the next morning I was told the hotel was full & no other room was available until the next night, they did offer to put a board under the matress (which I declined).", "title": "Think I'll stick to Express by Holiday Inn !", "helpfulness": 1, "user": "Nick F", "date": "March 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 14380945, "likes": {"liked": "— Staff efficient & pleasant; room clean and bright", "disliked": "— Location - not great at all..."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The 1st night we arrived back after the restaurant would normally have closed but a good buffet dinner was provided for guests coming back from ExCel.", "title": "Good for the City Airport", "helpfulness": 2, "user": "Jamezon", "date": "February 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 13524071, "likes": {"liked": "— Convenient location to London City Airport", "disliked": "— Very poor weekday breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "In any of my dealings with the staff I found them all to be VERY polite, helpful and friendly and this made the problems we experienced seem minor.", "title": "Great Service, Super Location for Excel/City Airport", "user": "TDMIsleofMan", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 12841149}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "It was hard for me to find my room because the plan of the hotel was like a labyrinth. you feel enclosed and traped when you are walking in the corridors as they were very narrow.", "title": "average accomodations", "user": "jamineyas", "date": "September 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175540573}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The personnel was good and welcoming and the food was average", "title": "Bleugh!", "user": "charlotte b", "date": "September 2, 2013", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 1.0}, "id": 175238171}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We booked the hotel using lastminute.com 's secret hotels. The hotel was listed as a four star deluxe double, the idea of an upgraded room appealed to us as we needed to get away last minute. When we first arrived at the hotel the shabby appearence did worry us a bit and didn't seem in keeping with a four star hotel. The staff were efficient and friendly, we dropped our bags off and went into London. The transport links were very easy to use and the area around the hotel was really nice, quiet, clean and very tourist friendly.", "title": "Ghost town!!!!!!", "user": "Stock88", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 175095049}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "When we came back to our hotel in the afternoon though and properly looked around our room we were disappointed. Our room was very shabby and badly in need of updating. The furniture was battered and bruised, our net curtains were dirty, the lampshades were dirty and broken and the shower had big holes that had been poorly repaired. We went and spoke to someone in reception to see if we had been given a deluxe room only to be told that room type didn't exist!", "title": "I liked it", "user": "ibarisma", "date": "August 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 175021096}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "After many phones calls and one agitated fiancee last minute refunded our money and we went elsewhere.", "title": "Nice hotel on waterfront of Royal Docks", "user": "Fl0g0_9", "date": "August 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 174872594}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I would ideally give this hotel 3.5 stars if I had the choice to do so, however it very marginally leans to 4 stars on Trip advisor star ratings, which is rather unfortunate. The hotel is in an excellent location outside Central London, close to the City Airport, the cable car taking you near the O2 Arena, the Excel London, close to the DLR, the nearest tube station being Prince Regent DLR less than a 5 minutes walk in the hotel. There is so much to see and do in the area, with several markets overlooking the Thames River, however they were not open for long enough and were not quite up to adequate standard (in my opinion). The hotel provided spectacular views overlooking the Thames River, the Excel London, O2 Arena and the City Airport. The location, in my opinion, is certainly one of the best in this rejuvenated part of East London which generally seemed safe and secure, particularly considering that the security was easily accessible standing all night! There is so much to see and do in this area, nor is it too crowded or congested like Central London or other parts of London. Excellent for a stroll, particularly when the weather is warm and pleasant in the Summer. Although it is quite a way out of Central London and the nearby City Airport was fairly noisy at times outside the hotel, it really was not a problem for us and it is most certainly an unspoilt and beautiful part of East London fairly nearby to the Stratford Olympic Park which was held in East London last year. The hotel, although not in Inner London, is still fairly central with the Cable Car and DLR running through it being well accessible by the London Underground; it is not only close to Stratford Olympic Village and the O2 Arena, but easily accessible to both North and South London rather well as well as North Circular Road. It certainly would be first choice if not choosing a hotel in Central London. The hotel offers free parking which was excellent, free breakfast and free internet which was very pleasing. There was a fitness centre and bar area in the hotel which was nice, however no swimming pool which was a shame as it really would have been nice to have one in the hotel. The 4 star breakfast was nice considering Ramada's standards of breakfast, not as good as the Hilton or Marriott 4 star, but I was pleasantly surprised with the substantial amount of breakfast that the hotel had on offer. Again, the bar area was nice and typical of a Ramada 4 star, however the menu for the food was rather expensive (as we expected). Again, it was not quite up to the quality of a Marriott or Hilton 4 star bar area, but it was nonetheless decent and more than adequate for us with a large screen TV and lots of nice places to sit and enjoy. However, we ordered fries from the bar areas and they proved to be a bit too expensive (even for 4 star bar prices), moreover, what was slightly irritating was that the fries took a long time to arrive which was a little annoying for us. The staff were mainly pleasant, helpful and polite, but not always, the reception did seem a little reserved at times, but on the whole they were nice, quite friendly and polite. When we asked for directions to the Museum of London Docklands they even showed us on the map pointing it with their pen and explaining everything to us very well, one a little more talkative than the other, but still rather helpful, which was good to see that the service was not all quite that disappointing. Check in and check out at the hotel was quick and efficient. The waiter was very nice, friendly, welcoming and polite which was good and he served us to our table quickly and efficiently which was impressive. The rooms were small and too congested for us, the bedrooms were tight fitted and the mattress seemed relatively easy to slip. The room does have the normal amenities and did not really provide more than the normal necessities, but no more than that really and it was a lot less than we primarily expected and did not live up to our expectations. The shower was adequate, but not really anything decent for a 4 star hotel, I would have liked it have more privacy and a little bigger would have been nicer, but all of the soaps were provided to a very good standard. The service, on the other hand, was disappointing and let this hotel down a lot, unfortunately. We asked for plates and it took over 45 minutes to arrive in the evening when it was relatively quiet, which was annoying and irritating. We also asked for towels and toilet roll on another day and it took over 1 hour and a half to get just the towels and this was also at night when it was relatively quiet so we had to ask them for service twice; on one hand came the towels and then we had to enquire as to why the toilet roll did not come, fortunately another pleasant man when we enquired about this quickly arrived it in our room. On another day we asked for 3 glasses with ice in them in the evening when it was relatively quiet and, again, it took a long time to arrive and again in took over 1 hour and a half to arrive and, despite us not having to ring them again, this was very annoying and irritating for us, especially because this episode had already occurred beforehand. However, it did eventually arrive. The service was not all that bad though as the staff were quite friendly, welcoming, polite and enthusiastic as to help us out with directions - which is why we are marginally giving service 3 stars. All in all, this hotel is in an excellent location and we will still be trying this hotel again if we are looking in the area and we recommend that you do to, despite the fact that the rooms are small and congested, the views and location more than make up for it, although the service does need to improve significantly. One other disappointing thing for us was when we booked this hotel on Hotwire we were told that it is not a standard, only when we realized when we arrived in the hotel that it actually is a standard room, perhaps if you do not book the standard room the rooms will be will be significantly bigger and less congested, therefore I am not going to hold this against the Ramada too much, hopefully presuming that the non-standard rooms are significantly bigger, which is why we are giving the rooms 3 star? I still recommend in trying this hotel again and we hopefully see if they can improve this from our enquiries and I would still recommend this hotel more than any other in the London Docklands area, as not only what I have mentioned above, but you are also close to the Canary Wharf alongside the River Thames and the famous, historic town of Greenwich. We recommend that you give this hotel at least another chance because of this. It is a great hotel for plane spotting enthusiasts.", "title": "Good hotel in an ideal location providing spectacular views, but rather disappointing service.", "user": "Sapna C", "date": "August 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 174721714}, {"rating": 4.0, "title": "Good stay, City airport view", "text": "The hotel cleanliness, staff, breakfast, room - everything was in order. The great thing for me (as aviation fan) was a view on London City airport - watching the planes taking off an landing. As hotel is really close to the airoport. But don'tworry, winodows are soundproof, so you could barely hear the planes.", "user": "kevinsz", "date": "August 29, 2013", "id": 174718557}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Hotel is 5 minutes walk from DLR station", "title": "next to Excel Exhibition Center", "user": "Peter B", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 174442391}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The Ramada offers the perfect location to visit events at the Excel Exhibition Center in the Docklands / London / UK. 2 Minutes walking distance to the Exhibition halls. Comfortable rooms, large Bar / Restaurant to relax after an eventfull day. A few minutes from London City Airport - right alongside the river Themse.", "title": "Very nice hotel with good staff", "user": "Wycombe-Simon", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 174401761}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I enjoyed my stay here, The location couldn't be better for London City airport or for the Excel arena as the hotel is sandwiched between the two!", "title": "very helpfull reception staff", "user": "yokie", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 174205156}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Stayed for one night to attend the World Travel Market (WTM) 2008. I previously stayed at the Premier Inn (across the street) and the Travelodge (across the Canal) and have to say that these two hotels offer more value for the money. The room was ok, not very big, no Minibar, very soft mattress (my back is still sore) and also very cold when I checked in and it took forwever to heat up. The restaurant was absolutely freezing cold during dinner. Breakfast was nothing to write home about. More or less cold as well (including the coffee). It was, as promised, a full English Breakfast, but nothing else.", "title": "I have my doubts", "user": "Jetstream1958", "date": "November 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 21932557, "likes": {"liked": "— Everything was cold, the room, the restaurant, the food, etc."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Check-In and restaurant staff where very, lets say, indifferent.", "title": "Choose another hotel for ExCel", "user": "kfalck", "date": "October 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 20819299}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Something that has to be said for most Hotels and other service providers in the UK: Due to the fact, that most of the staff is from Eastern Europe, the level of service and friendliness in the UK has reached a desolate level. I have nothing against these people. When I travel in Eastern Europe I am used to this service level and steady improvements have been made over the past years, but unfortunately this is not the case for the people working in the UK.", "title": "Too Far from Central London", "helpfulness": 1, "user": "GLSA", "date": "August 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 3.0}, "id": 18538905}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The location is great for the Excel Exhibition Center and for the Docklands. But as mentioned already, other Hotels nearby offer better value for the money.", "title": "Nice Hotel", "helpfulness": 1, "user": "VICTORIAFife", "date": "July 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 17983749, "likes": {"liked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I picked this hotel while attending a conference at ExCel, thinking it was close to it. It was quite far away, we had to use a shuttlebus to get back and forth. The hotel was not even shown on the public maps so it was very hard to find by foot.", "title": "Great hotel for Excel", "helpfulness": 2, "user": "Whereshallwego2next?", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17500560, "likes": {"liked": "— Location for Excel", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "I stayed here for three nights. I arrived into Heathrow so getting here via the tube and dlr took around an hour. The travel time into central london wasn't too bad.", "title": "Location good and bad, Great Breakfast", "helpfulness": 1, "user": "brissypete", "date": "June 20, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 2.0, "value": 3.0, "rooms": 3.0}, "id": 17066097}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The room was okay however I ended up with a disabled room which was a bit annoying. Bed was comfortable enough.", "title": "OK", "helpfulness": 1, "user": "FionaS2411", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 16787973, "likes": {"liked": "— Rooms", "disliked": "— Room Service"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "My onward flight was from London City airport which was extremely convenient.", "title": "Great hotel if you need to be at Excel", "helpfulness": 1, "user": "CEWEngland", "date": "May 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16334128, "likes": {"liked": "— Its proximity to Excel", "disliked": "— The bar staff"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The breakfast was excellent with a great choice of hot and cold, even poached eggs which were cooked very well.", "title": "Clean hotel, but disappointed overall.", "user": "Dolly78", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 16250167, "likes": {"liked": "— Very clean.", "disliked": "— Irritating humming noise in our first room."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I would only stay here again if I was using London City airport.", "title": "'Oh dear', that just about sums this hotel up.", "helpfulness": 1, "user": "Philip001", "date": "May 20, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "value": 2.0, "location": 2.0, "service": 1.0}, "id": 16228135, "likes": {"liked": "— Leaving", "disliked": "— The overall experience. Very poor indeed."}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 44, "average": 117, "very good": 308, "terrible": 28, "excellent": 179}, "aka": "Ramada Hotel London Docklands", "slim_ranking": 0.318773234201, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}