{"user_rating": 3.5, "review_count": 462, "name": "Ramada Encore Birmingham NEC", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We have stopped at the Ramada Encore now on two occasions and find this hotel perfect for the overnight stay prior to flying from Birmingham, had it not been for other commitments we would have also stopped on our return journey as we did not land until late in the evening. The hotel room is clean and tidy although slightly on the small side but adequate for an overnight stay. If you fancy a walk, which I would recommend to get your bearings for your departure to the airport the following day, turn right when leaving the hotel walking through the industrial estate and go either by the stairs or if you are with cases you would prefer to take the lift into the NEC where you find yourself at the NEC train station. There you will see a monorail which is free and takes only two or three minutes into the airport. The monorail does not run between the hours of 2.00-4.00 am This would not be ideal for anybody who is elderly or not reasonably fit as the walk takes approximately ten minutes. At the airport I would recommend Wetherspoons for a pint and a reasonable meal at sensible prices. The reception does provide a map although it is not really required. A taxi if it was raining approximately £5.", "title": "Ramada Encore NEC Birmingham", "helpfulness": 3, "user": "Plough_Stones", "date": "December 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122278888}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The Hotel and 8 days parking with the car remaining on site was booked online with Holiday Extras.", "title": "great for what it is", "user": "CarnarvonBoy", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122135217}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Downfalls:", "title": "Great location and clean.", "user": "Brad-and-Susan", "date": "December 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121852669}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A little difficult to find the Hotel.", "title": "Airport Stay", "user": "d b", "date": "December 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121482239}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "People leaving for the airport, so occasionally banging of doors.", "title": "Unbeleivable value", "helpfulness": 1, "user": "TheJolaShow", "date": "December 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121372170}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This couldnt be any closer to the NEC really. I was on crutches at the time, so its needed to be near. I was literally a 5 minute hop. Staff really helpful and friendly. Food was good value and quality. The rooms were tidy, clean. Lovely bathroom. Only bad point - hard bed.", "title": "Fab location for the NEC,", "user": "Drucey2", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125186874}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here sunday night --£115 a room--doesn't include breakfast and from a few months ago doesn't include the car park any more--- now charged at £7 a day so that's now over £140 a room for two if you include breakfast. The hotel didn't charge us for the parking as we had booked months in advance--wasn't made aware that our telephone booking at the time excluded the breakie, didn't ask as we had stayed a few months earlier and it was included as was the parking. Nice clean room but a bit of a small double bed as before but all we wanted was a room to sleep overnight in so the room was more than ok--reception staff very good as before --had a meal in the restaurant Sunday night--shared a nice salad and a main course chicken tikka as a starter--very nice--main course we both had the rib eye steak -main was ok but hers was pretty poor--rubbish cut of meat ---finished with pancakes-- these were disappointing as they were a pretty tasteless stack of pancakes with a small dollop of ice cream and a sweeze of caramel syrup--wine was ok--service pleasant--breakfast was the best part of the stay-- they do do a nice breakfast spread--not a lot but all of it is quite nice--would we stay here again ?? not worth over £140 a night -, not by a long chalk--- i know some shows at the NEC attract premium rates so as it was MODA week is was dearer than it should be--but overall the room and bed are only just ok and no more--these hotels at the NEC do need to start taking a reality check at what they charge and what they give back--if the best value we can get for september is £140 for what we have had at the ramada and another lump for a very average meal than maybe if would make more sense to drive back the same day==", "title": "will probably look elsewhere in the future", "user": "licksmith", "date": "February 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 124972142}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "If you need a bed to stay overnight then this hotel may offer what you need. The bed size is small compared to other hotels. Bathroom has a walk-in shower. Breakfast is what you would expect on a 2 star hotel. For £40 I was quite happy to spend one night but would not stay longer.", "title": "Good value for money", "user": "Dougie G", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 124815524}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We were exhibiting at the Spring Fair and stayed at this hotel. Extremely convenient as from the back of the hall to the hotel was about 5 minutes walk!", "title": "Convenient for NEC", "user": "ThierryBMaidenhead", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124669306}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The rooms are confortable and well equiped. With very friendly staff in both reception and restaurant.", "title": "Great Hotel for Birmingham Airport", "user": "2tripsters040", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124251535}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed here to visit Miniatura at the NEC. It's a good hotel, within easy walking distance of the NEC. We had a comfortable and pleasant stay and would recommend it to anyone visiting the NEC for flying from the airport.", "title": "Great hotel for NEC", "user": "southernbelle269", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124186761}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Used this hotel for two nights - either side of a holiday, and took advantage of the parking with it. Both rooms were noisy, pokey and hot (in the middle of winter!). Rooms come with one poor pillow each, and you have to ring (and wait 20 minutes) for a second one.", "title": "Must be better airport hotels around!", "user": "OckhamsRazor", "date": "January 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 123756721}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The restaurant left us waiting for 40 minutes for a bread and oil starter, and another 30 minutes before the main course. The general manager had, apparently, had the idea that it would be ok for a tabletennis Christmas party to play in the restaurant/bar area and our meal was accompanied by the tap tap of the game, and the shouting from the players.", "title": "Modern but basic", "user": "dwfco", "date": "January 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 123258593}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The one redeeming feature was the restaurant manager, who responded to my complaint very effectively - all credit to him.", "title": "Great pre flight hotel to start your holiday relaxed", "user": "Ade_Morris2", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122777248}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Stayed here overnight on business. Very simple rooms with minimal furniture, the wardrobe was hooks on the wall! Bed was comfortable but room too basic. Evening bar / breakfast room had the appearence and layout of a \"works canteen\" though the food was quite pleasent. Ok for a one night stay for business or for the airport, but wouldn't stay any longer.", "title": "Modern, Clean & lovely Staff", "helpfulness": 1, "user": "NeilExeter", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122510224}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed here for two nights for a show at the NEC and found the hotel to be very convenient. It's an approximate five minute walk from Birmingham International Station and the same distance to the NEC. Only downside on this front is that there are no signs to the hotel from inside the station or NEC itself so unless you know to go in a certain direction and down a random flight of stairs then you wouldn't have a clue. The walk to the hotel isn't that nice either and I would recommend that solo travellers get a taxi at night.", "title": "Decent hotel for a business stay", "user": "kathrynjc", "date": "March 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125838671}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The staff were very helpful at check-in and it was all done without a fuss. My room was 311 and was enormous: single bed, double bed and a sofa all in a spacious L-shaped room. the bathroom is fantastic too, being exceptionally modern and clean so all in all I was thrilled (I am perhaps slightly easier to please than some). Bathroom doesn't have a bath so this may be an issue for some travellers. However, some of my colleagues were allocated much smaller rooms and one was given a room with two single beds. The reception were able to change her to a standard double room though and although smaller than mine it was still big enough, especially for two nights.", "title": "Rude, and unhelpful", "helpfulness": 2, "user": "David J", "date": "March 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "location": 5.0, "service": 1.0}, "id": 125758216}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The restaurant/bar is comfortable and is fine in appearance but they could easily liven this up with decor and more seating so it feels slightly less cafeteria-like. The selection of food was again fine, a bit pub-grub like and not the best selection in the world, but I ate there both nights and was ahppy with everything I had. The breakfast is a little sparse but is a buffet style with cooked breakfast, toast, cereals and croissants. Drinks and food were not extortionate but definitely at the hotel-end of the price scale.", "title": "very convient for the NEC", "user": "UKTonyz", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125224631}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Only niggle was that the free wifi that is advertised so forcefully on the website is available in the public areas only and for this you need a code from reception. There is no wifi in the rooms and the internet can only be access by a lead which means you cannot get access if you have a portable device (BlackBerry, iphone, etc.). The lead is only compatible for laptops and if this is a necessity for you then I would recommend you contact the hotel ahead of time.", "title": "Fantastic location for NEC", "user": "louh1975", "date": "February 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 125218670}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I would not recommend this hotel for a leisure stay and am sure that Birmingham city centre has better places to stay but for the NEC or the airport I don't think this can be beaten.", "title": "The best Airport hotel for Birmingham", "user": "Gromit89", "date": "February 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125193586}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 46, "average": 121, "very good": 156, "terrible": 35, "excellent": 104}, "aka": "Ramada Encore Birmingham Nec Hotel", "slim_ranking": 0.471014492754, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}}