{"user_rating": 3.5, "review_count": 332, "name": "Ramada Plaza Albany", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed two nights to visit friends and family. Price was good. Room was nice and bed was comfortable. Breakfast was also good. Carpet could have been a little cleaner but otherwise no complaints.", "title": "Good Value", "user": "Humphryg", "date": "July 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114965695}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The service is outstanding.", "title": "Outstanding", "helpfulness": 3, "user": "easternstar11", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114684050}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Staff will go above and beyond to ensure that the guests are satisfied.", "title": "FANTASTIC", "helpfulness": 4, "user": "greymoon95", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114048752}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "All the staff is very friendly.", "title": "Priced for everbody, fit for a king!", "helpfulness": 4, "user": "jtagg5", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113320434}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Great location and very easy to locate.", "title": "Great experience, great atmosphere, Customer service at it's finest", "helpfulness": 4, "user": "Insuranceman25", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 112176115}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "At first I was very skeptical of booking here with all the reviews, but I decided to give the ramada plaza of albany a try. The hotel used to be a clarion but was recently switched. All the perks of a four star hotel for a budget value. Nice swimming pool, on site laundry and fitness center, also a large business center where I was able to get alot of my paperwork done( they have a copy machine in there too) The hotel it self is kinda old but the staff makes up for it. The front desk was excellent as were the breakfast attendants. I stayed 6 nights, wakin u everymorning to a hot breakfast I dont have to cook was amazing. The rooms are nice and spacious, the bathrooms are a little snug but they are very clean. I commend the houskeeping staff they did an amazing job. The hotel seems like it is on its way up. My stay was great and I am planning on coming back regularly as I do alot of business in and around Albany. Great food in the on site resataurant as well!! See you next time!!", "title": "Diamond in the rough", "helpfulness": 6, "user": "TravelingMikey", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 100815790}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "We came here recently for a weekend conference. I was amazed at the lack of regular maintenance, ie. carpets taped down in the foyer and conference room with duct tape, a pool area that was very dingy with rusted furniture, and worst of all a side security door that would not shut. The staff from the catered meals during the conference were very nice and accomodating and the food was good. I have a food allergy and the wait staff certainly went above and beyond to make sure I had something good to eat. The hotel was dirty on the first day, but that may be due to the winter storm we had that day. Perhaps the cleaning staff could not make it in. I would say if you are planning a conference to stay clear of this hotel.", "title": "Very disappointed, but reviews were accurate.", "user": "Happytraveler3074", "date": "March 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 98534835}, {"rating": 1.0, "title": "HORRIBLE EXPERIENCE-Car vandalized and ROBBED in the parking lot. Staff dismissed-shrugged it off.", "text": "We experienced a house fire in the early morning of Jan 2, 2011. The American Red Cross offered us a place to stay at this Ramada Inn. We were treated like second class citizens, as if we were \"undesirables\" due to not paying ourselves. Im not sure why? They sent us around back in a connecting section of the hotel, stating they had no rooms in the main building. (90 % of the rooms were dark that night in the main building) We were told to park out back. The security door was open every time we came and went and we were the only cars out back in a seedy area. Low and behold, my car was broken into durning the night, ramsacked and everything we had saved from the fire that we left in my trunk, was stolen. My car was trashed and everything was gone. I called the desk and all they said was.. \"Well, I dont know what to tell you. File a police report. We can give you a different room if you want.\" They never recontacted us, never apolozied and simply shruged when we left in a hurry. The room was disgusting, the building was not secure and the surroundings were less than safe. We survived a house fire only to be robbed and snubbed like \"trash\" by this hotel. Adding insult to injury they charged my credit card double room rates for two nights, when the certificate was given to them by the Red Cross and they have an account on file! They charged me almost $300 when they shouldn't have charged my card at all. So much for \"we need a credit card to just have in case...\" . Sure.. in case you want to run it up full of charges!", "helpfulness": 2, "user": "EJH123456", "date": "January 9, 2011", "id": 92307148}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Do yourself a favor... if you stay in Albany, stay at the Homewood Suites/Hilton on Wolf road. It's the difference between garbage and royalty! We are happily LIVING at the Homewood suites now until our home is rebuilt. Honestly... I never want to leave, this place is so wonderful.", "title": "Stay Away!!", "helpfulness": 1, "user": "optix10", "date": "October 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 84729271}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "So ... beware of the Ramada and stay far, far away !!!! I wish I had known. It would have saved us over $500 in replacement costs for stolen items and $300 in overcharged rates. NEVER AGAIN!", "title": "Don't trust your GPS to find this hotel", "user": "Justwantedtomention", "date": "September 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 78933911}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Ramada on Watervliet Ave. Ext. the weekend of July 30 to August 1. The hotel advertised a heated swimming pool and a spa. There was no spa, and the pools were dirty. The hair dryer did not work and my wife was sent to a filthy room to dry her hair. There was no ironing board in our room, although the hotel staff did provide one after being alerted to this. The iron rest was falling off the wall. The rooms are not soundproofed, as we learned on Saturday night, when there was a \"hip-hop\" wedding party two floors below and the racket could be clearly heard in our room. The beds were lumpy. This place has not been a Ramada very long. The carpets are stained on all the floors we were on. The second floor reeks of stale cigarette smoke. Weight machine in the fitness center has an out of order sign on it. Fitness center was very cozy (Linen Closet) CSX Railroad houses their transient employees at this place, so it's not very classy. While this place may improve with time, the management needs to be more honest with people who are making reservations. We will not be coming back to this hotel again!!!", "title": "Not as advertised", "user": "KnightlyTraveler", "date": "August 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 73407592}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I was very pleased with everything at this hotel. Each staff person addressed every single question, issue or request without the slightest hesitation. No one said \"so-and-so handles that, but they are not here right now\". I experienced no disappointments with anything.", "title": "Ramada Plaza Albany New York, 3 Watervliet Ave Ext", "helpfulness": 7, "user": "MisterVin", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108090627}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "The food at the hotel restaurant exceded my expectations. Everything was fresh.", "title": "Excellent customer service , great hotel", "helpfulness": 6, "user": "Insuranceman25", "date": "May 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 107341841}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "When I requested well done, my food was well done. The servers were responsive and cordial. I never felt that they were doing me a favor; they were doing their job professionally and friendly.", "title": "Great !!", "helpfulness": 11, "user": "BillVas", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106747865}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I would not hesitate to stay there again.", "title": "Horrible Experience", "helpfulness": 2, "user": "SwedishSully", "date": "April 13, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 103966732}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stayed at the Albany ramada for three weeks while training for a local insurance company. The housekeeping staff was amazing and very attentive to my requests. The rooms were super clean and very comfortable. Brand new pillowtop mattresses help me get a great nights sleep. The front desk was always polite And professional. Breakfast was great every morning. Any time I'm in Albany I will be staying at the Ramada.", "title": "skeptical holiday getaway", "helpfulness": 7, "user": "nikkim65", "date": "March 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 101967157}], "location": {"country": "United States", "city": "Albany"}, "stars": 3, "variance": {"poor": 61, "average": 88, "very good": 86, "terrible": 33, "excellent": 64}, "aka": "Ramada Plaza Albany Hotel Albany", "slim_ranking": 0.58, "description": "This Albany hotel offers that rare combination of lustrous style and friendly, personalized service in an ideal, central location. The perfect location for unforgettable weekend escapes and elegant meetings and events, our hotel's staff provides an unforgetable experience,from our front desk team to our banquet and event staff, our Albany, New York hotel offers exceptional service thru out! Sophisticated and friendly, we provide the ultimate experience for business and leisure travelers alike. We have an upscale free hot breakfast that guests raive about.We also have 24 hour 7 day a week transportation to the airport and train stations.We guarentee the best experience."}