{"user_rating": 3.5, "review_count": 233, "name": "Ramada Lewiston Hotel and Conference Center", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My husband and I stayed at this Ramada with two other friends April 10-11. We got there super late and the hotel was very quiet. We rushed up to our room cause we were so tired driving from Boston.", "title": "One Night Stay in Lewiston, Maine", "user": "EmilyDiaz", "date": "April 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27928206}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Hotel Lobby was on the older side.. not very modern. We didn't see an elevator.. lucky we were on the second floor. We got to our room.. and it was kinda humid and musty so we turned the air on immediately. We left it on all night.. cause it wasn't too cold. We preferred the air flowing in the room.", "title": "Free Night with Wydnham Rewards- But it was a great place!", "helpfulness": 1, "user": "Traveller-NS", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 23286083, "likes": {"liked": "— The character of the building", "disliked": "— could smell chlorine from the pool in the halls"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "The sink was outside the bathroom.. the bathroom was very small. Just a toilet and shower/tub. The shower did look on the older side.. but it was clean.", "title": "70's Nostalgia", "user": "2TubMan", "date": "August 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 19351740}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The room does come with an iron and ironing board, coffee maker and little refrigerator which was useful for us. The beds were not very comfortable, very firm with two pillows and no extras.", "title": "pool was great and so was the food", "user": "exmainer_8", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18389402, "likes": {"liked": "— close to so many things", "disliked": "— bathroom door is not in a very handy place, not much room in there to move"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "In the morning.. our neighbors got up quite early and we could hear their shower as if it was in our room. That was very annoying.. especially when our Neighbors had a few kids that were screaming and crying all morning. The walls were paper thin and could hear everything.", "title": "It's Ramada, not the Ritz", "user": "Peregrina651", "date": "May 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 16351626, "likes": {"liked": "— cooling system"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Stayed here while dropping our son at Bates. Brick hallways are a little dark, but the hotel is clean and friendly. Pool, hot tub, & sauna were open late, which was great. Fridge in the room was a pleasant surprise. Didn't use the restaurant, so can't comment on that. (Bought lobsters around the corner and ate them in our room.) Convenient location. Would stay here again.", "title": "Decent value in Lewiston", "user": "PaGuy2", "date": "September 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5765690, "likes": {"liked": "— Pool, hot tub, sauna", "disliked": "— Brick hallways"}}, {"rating": 2.0, "title": "A bit run down", "text": "This hotel has potential, but its western 70's dark decor needs a face lift. We stayed in the executive studio, so I can imagine the rest of the hotel may have needed even more attention. Side-entries not secure.", "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4956668}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "Clean and quiet, but desparate for some updates.", "title": "In need of major redecorating/remodeling", "user": "wellesley82", "date": "March 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 4629904}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The restaurant needs to hire a chef...the buffet gets old when staying for several days in a row.", "title": "Great Place!", "helpfulness": 1, "user": "themoon", "date": "July 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3628425}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I suppose I am used to staying in hotels that are....clean. I didn't feel like I could put bare feet on the floor or my head on the pillow -- nevermind the comforter. The room was decently sized and the TV worked, which to be honest, was more than I expected from walking into the lobby. It has a very old, \"rustic\" Maine look. Hotel breakfast was ok...nothing special. It was mass-produced buffet food.", "title": "Not one of the best", "user": "monkey769", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 10207596}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Researching Bates with our Daughter. Hotel was listed byBates as a place to stay, but was very dark and drab - don't think it has changes from the '60s. Pool and fitness room in a strange, plastic plant lined interior rom. Our daughter was shocked when she tried to use the tradmill - apparently an ungrounded hot wire made this device into a 'death trap'!. Next time, we stayed at the Hilton Garden Inn in Alburn. Much closer to Bates and in a beautiful location. More expensive, but worth it!!", "title": "Dark!", "user": "jcharley", "date": "September 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 8853059, "likes": {"liked": "— Low Cost", "disliked": "— Dark, worn out, old"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "On a positive note, the staff was very friendly and helpful and everyone was really great to us. But as far as the negatives go.... well that's another story. As a note: I did not have just one room as an example but was with a good size party so had the opportunity to see 4 other rooms and everyone had the same complaints! The hotel was obviously run down with stains on tiles on the ceiling, big rust stains in the bathroom, missing bits and holes, and worn bits on the furniture and fixtures. The cleanliness was questionable when I found a CD between the bed and dresser and there were blood stains on the comforter that were even obvious to my son. Yikes! I was going to make tea in the coffee pot provided but had to scrape a layer of dust off the top and clean it myself before attempting. Unfortunately, when I actually looked inside the machine itself, it was so disgusting with built-up residue and who knows what, I gave up and put it back on the shelf. The whole room seemed dirty with obvious dust, mysterious hairs throughout the bathroom and sink area, dirty smudges on various things that I wouldn't touch or allow my son to go near. The showers were horrible! As soon as you heard the shower go on in the room beside you, suddenly your shower went freezing, and after turning the knob to full hot it became dueling showers that would alternate between scalding and freezing. I figured I would get up earlier the next day to avoid fighting over hot water with my neighbor, but still had the same problem with alternating freezing and scalding water. The riff raff seemed uncontrollable making loud noises and yelling while running between rooms at 1am--these were \"adults\" mind you. And even though it was a non-smoking facility, people were able to leave side doors to the hotel open and stand in the doorways smoking and letting it waft inside. There were empty beer cans and bottles around the indoor pool area, and the hot tub was so littered with empties my son attempted to step around them without causing an avalanche, but I stopped him from even getting in, since it looked so questionable. The buffet is cheap, but you definitely get what you pay for, with a multitude of frozen or \"instant\" food heated up for you. Overall, I would not stay here again, unless of course, I had no other choice -- like I was stranded in a snow storm.", "title": "Would only stay if there was no other choice.", "helpfulness": 1, "user": "StripeyS", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8128184, "likes": {"liked": "— The staff was great", "disliked": "— VERY Dirty rooms, horrible freezing/scalding showers, noisey drunken riff raff"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Am writing this review from my room in this hotel- taking advantage of the ONLY good thing I can say about this place- the free and reliable WiFi.", "title": "Rundown, Dark, Dingy, Horrible Food - But nice staff", "helpfulness": 2, "user": "mwgSF", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 7349875}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is not an Inn. It is not a hotel. It is a rundown, motel where they sealed-off the doorways and added carpet to the hallways to make it a 'hotel'. The brick walls, cement steps and long U shape are all still there. The rooms are very shabby, mine has a hole in the ceiling in the bathroom and peeling wallpaper. The heater was very loud, and kept me and my coworker in the next room, awake at times.", "title": "A great surprise!", "user": "NBCantravel", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7269281, "likes": {"liked": "— Ease of checkin in and quality of room", "disliked": "— Would have liked a restaurant that offered more than buffett"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "The small family operated motel I usually stay in when visiting family in Lewiston was closed for vacation when I planned to visit, so I found the Ramada online for the same rate the other motel usually charged (~75/night midweek). This hotel is right off Exit 80 of the Maine Turnpike. Great location with easy on/off for anyone heading towards northern Maine or New Brunswick.", "title": "Average Hotel with great amenities reasonably priced", "user": "mellifera75", "date": "January 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 92834018}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "This hotel is definately older, but you can see that they've made great effort to make it comfortable and a little more modern without having to do major construction. I had a room with 2 queen beds, bench, recliner, desk & chair. I'd consider the size of the room to be average. Bathroom was TINY. As others said, the sink was outside of the bathroom (that's not new to me, i've seen it before), but the door to the bathroom apparently hits the toilet bowl sometimes (you can see a ridge in the door where it would hit). Shower was standard size shower, apparently newly renovated with a bathfitter type deal.", "title": "Perfectly average hotel on the road", "user": "SomervilleReisender", "date": "November 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 87091325}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Hallways definately still look older and could use new carpeting. Pool area was a great surprise. Pool was 4ft-8ft, crystal clear and heated. Hot tub appeared clean, though could probably use a light scrub by the time I checked it out (9PM). Sauna was also nice, but small - 2 benches. I was very impressed with the condition of the pool area for the price I paid, the area I was in, and the general age of the hotel. Pool area hours are 7AM-11PM (this far exceeds many places I've stayed at).", "title": "Run down and dirty!!", "user": "Martini22", "date": "September 7, 2009", "detail_rating": {"cleanliness": 1.0, "rooms": 1.0}, "id": 40066928}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The only thing that concerned me is that there are 4 numbered entrances to the hotel (aside from the front desk). The desk clerk told me it would be easier for me to drive around to door #3, park and unload there, rather than winding my way from the lobby. I expected to have to use my key to gain access to the building (it was after 8PM when I checked in), but apparently it is open 24/7. This gives anyone access to the hotel (from the back) without scrutiny.", "title": "Tired, but friendly!", "user": "MarcusDee", "date": "July 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35075283}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I was on the first floor, but I think there may be 2 floors, but no elevator. If you have mobility issues, make sure you request a ground floor room.", "title": "Excellent Convention Center", "user": "MMonvacation", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34922987}], "location": {"country": "United States", "city": "Lewiston"}, "stars": 2.5, "variance": {"poor": 49, "average": 66, "very good": 47, "terrible": 19, "excellent": 52}, "aka": "Ramada Inn Conference Center Lewiston / Auburn Hotel Lewiston", "slim_ranking": 0.2, "description": "For a relaxing stay in Vacationland, book your hotel room at Ramada Conference Center Lewiston / Auburn hotel, near Portland International Jetport Airport. Located off Interstate 95, our non-smoking Lewiston, Maine, hotel is a convenient home base for exploring or just kicking back and taking it easy. Relax in our recently updated pool, sauna and Jacuzzi, or check out local attractions with free Wi-Fi Internet access. Work out in our on-site fitness center or take advantage of guest laundry facilities. For the ultimate in relaxation, book our honeymoon suite with new HD television, fireplace and king bed. Kids 17 and under stay free with an adult.There is so much to see and do near our Lewiston, Maine, hotel. We are minutes from the Androscoggin Bank Colisee, featuring ice rinks and frequently scheduled public skating. You can stop by the original L.L.Bean Flagship Store and pick up a new guaranteed-for-life backpack, fleece or windbreaker, or hit the links at Fox River Golf Course. Head to Oxford Speedway, minutes from our hotel, for high-octane racing action. If you are in town to visit Bates College, book your room with us for fast access to campus. The unique Maine coast is just 25 miles away, and Kennebunkport is an easy day trip.Join us at our newly renovated on-site restaurant, Fusion, where we serve breakfast and lunch in a casual buffet format. For our evening guests, enjoy a dinner menu that features everything from traditional New England dinners to juicy steaks to Maine lobster, and after dinner, head to Fusion Lounge where you can enjoy live music, dancing and delicious cocktails in an inviting atmosphere.Our Lewiston, ME, hotel offers a 15,000-square-foot conference facility with 10 meeting rooms.Please note that a major credit card is required at check in. Cash payment at check out is accepted."}