{"user_rating": 4.0, "review_count": 698, "name": "Ramada New York/Eastside", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is a great hotel for the price. The rooms are newly remodeled and the staff was very nice and helpfull. Great location to everything there is a subway just two blocks away on 28th street. And the breakfest is a plus, a great start to your morning, and they have a bussiness center right across from the breakfest room which is another plus. The area is mostly residential which made me feel safe.", "title": "Great location, newly remodeled", "helpfulness": 3, "user": "mbkris", "date": "May 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7703800, "likes": {"liked": "— Nice residental aera"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I have stayed at this hotel few times. Great value in a safe area. There are few Indian and Tibetan restaurant nearby. Expect to pay less than half of what you would pay nearby.", "title": "Great value in mid-town", "user": "AroKhampa", "date": "May 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7669318, "likes": {"liked": "— Great Value"}}, {"rating": 4.0, "title": "Excellent Value", "text": "Little trivia... I am absolutely convinced that the outside shot of this hotel was used as the hotel in Tom Hank's movie,the Terminal, in which he plays the Russian tourist who gets stranded at the Airport in New York.", "helpfulness": 2, "user": "ERSFallsChurch", "date": "May 10, 2007", "id": 7580842}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This travel snob was very impressed with the value for the money. I only stayed here because almost all hotels were booked in the city on my travel dates, and the only other reasonably priced rooms were in higher-rated rooms that got terrible reviews. The Ramada was clean, bathroom was recently updated, and the breakfast was a nice addition. The sheets are a little thin and the towels small, but I would still recommend the hotel without reservation.", "title": "For the price, it's a great value", "helpfulness": 1, "user": "HuskerFaithful", "date": "May 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7545059, "likes": {"liked": "— Location and price", "disliked": "— Spartan accommodations"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Evidently, it's gotten a lot more expensive to stay in the city since I was in NYC the last time (2001). Hotel rooms are commonly hard to find, especially when the Tribeca Film Festival and Yankees-Red Sox are going on the same weekend. We luckily were able to secure a room at the Ramada Eastside at 30th & Lexington. Three blocks away is the 28th Street subway stop for the 6 train, which will get you to Grand Central and from there just about anywhere in the city you will want to go. The rooms are nothing special, but they are clean and have very comfortable beds, which it appears they are about done replacing. Continental breakfast and free internet in their business center are pluses. There is a connecting coffee shop off the hotel lobby and a decent Italian restaurant right next door to the North (Trattoria Belvedere). Another good restaurant is Les Halles, which is about two blocks away on Park Ave South. We found the location of this hotel to be good, especially since we couldn't find any other hotel rooms available for less than $350 a night. I would stay there again if I couldn't get a room through Priceline.", "title": "Great", "helpfulness": 3, "user": "joefour4", "date": "April 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7341000, "likes": {"liked": "— beds and free breakfast", "disliked": "— no hot water last day"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The room was clean & functional. Worth its price !", "title": "Good", "helpfulness": 2, "user": "prakashpt", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8091284, "likes": {"liked": "— Location & cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "I stayed there in june during the week for 4 nights. I chose the Ramada because on weekdays most hotels with 3 or 4 stars were 400-600$ a night this period. The room (king bed) was clean, so was the bathroom. A friend of mine stayed in a room with queen bed, the room was very small and I wouldn't recommend it for two persons.", "title": "Ok if you can get a good rate", "helpfulness": 1, "user": "DavidBelgium", "date": "June 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 7973862, "likes": {"liked": "— Complimentary internet and breakfast", "disliked": "— Price/quality"}}, {"rating": 2.0, "title": "Good value BUT overcharged and not offered a refund", "text": "The room was simple but ok, the mattress was very good. Complimentary internet (although I think that's only for king-rooms) was very convenient, so was the complimentary breakfast (fruit, yoghourt, donuts, bread, juices, coffee, ...).", "user": "Karen H", "date": "June 21, 2007", "id": 7957884}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "I'm giving the ramada inn eastside only a two out of five because I think the room certainly wasn't worth the 214$ a night I paid. If you can get a rate around 100$ or a bit more I would recommend it.", "title": "Expectations Met and Exceeded", "helpfulness": 4, "user": "chazzOH", "date": "June 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7935820, "likes": {"liked": "— Location", "disliked": "— Room Size"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I would be writing a favorable review about my stay in Feb (clean, good location) but I recently sent friends there and had a bad experience. I booked rooms through my travel agent and sent friends there with reservations that said $161 per night. The hotel charged almost a HUNDRED dollars more and would NOT issue a refund. Leaves a nasty taste in the mouth... I am not sure if this is happening to online bookers as well...", "title": "Very good value for New York City", "helpfulness": 1, "user": "Suzzsin", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7712174, "likes": {"liked": "— Cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the Ramada Inn Eastside from March 22nd to March 27th. The price was the lowest I could find in Manhattan for a Murray Hill hotel room with its own bath (179-189 a night). The hotel staff seemed nice, the hotel lobby was very clean (in fact the hotel hallways smell kind of like bleach), and the room was just fine. Remember, this is the Ramada Inn, not the W Hotel, so don't expect lots of space or luxury. But do expect a smallish room (about the size of a typical American bedroom) with a very comfortable bed, a TV in an armoire, desk and chair, night tables, lamps, iron, blow dryer, phone, coffee maker, shampoos, several towels, etc. And a generous free breakfast is served on the lower level each morning. For the price, you could do a lot worse than this solidly middle class hotel! This was a safe and comfortable place. And there were absolutely no bugs! Believe me, I checked this out thoroughly after being terrified by reading reviews after I'd booked the room. The only complaint I had was that the ceramic tiles in the bathroom need to be regrouted as the grout looks kind of stained as years go by, which is not a big deal, just not appealing to look at. There is nowhere to put anything in the bathroom--any little shelf would have been nice. I couldn't put anything on top of the toilet tank because it was slanted, and the little pedestal sink had no room to put anything down. So the hotel management should consider adding a little shelves to the bathrooms. Other than that, this was a fine place to stay for the money.", "title": "It's fine, it's clean, and very easy on the wallet!", "helpfulness": 8, "user": "LindySeattle", "date": "March 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7240033, "likes": {"liked": "— The price"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We just returned from an 8-night stay here. The room was very clean, and we were comfortable the whole time. The weather outside went from 70F the start of the week, to 25F near the end. The room was always comfortable, and we hardly even had to turn on the heat/AC.", "title": "Very clean, gracious staff, will stay again", "helpfulness": 5, "user": "jimbo26", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7192997, "likes": {"liked": "— cheap price", "disliked": "— the sound on the TV was quiet on one channel, loud on the next"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The rooms are not huge, but we stayed with two kids, and had plenty of space. The building is not new, but seems to be maintained well, and they have clearly done a lot of work lately (new mattresses, carpets, paint, fixtures).", "title": "Great value and pleasant staff!", "helpfulness": 2, "user": "villemur", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7190615, "likes": {"liked": "— Good price, safe neighborhood", "disliked": "— parking"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "The breakfast is normal continental fair, but was a huge money saver. Toast, bagels, donuts, oatmeal, juices, fresh fruit, yogurt, coffee/ energy drinks. Eat well, 'cause the rest of your day in NYC will cost a lot!", "title": "Best Hotel on Eastside of NY", "helpfulness": 4, "user": "njnurse123", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7179789}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The staff were all very courteous. Maids were friendly and trustworthy. A plugged toilet was fixed in less than 5 minutes.", "title": "great location, great price", "helpfulness": 3, "user": "MaggieM94", "date": "March 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7148141, "likes": {"liked": "— Location, price, and new mattress!", "disliked": "— Rooms are small, decor needs updating, Wi-Fi is sporadic"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "I stayed here in November for 4 nights with two friends. It was our first trip to New York. The room we had in the Ramada Inn was very clean, had comfortable beds, plenty of hot water and good shower pressure. We were on the eight floor and it was pretty quiet. Our toilet needed to be repaired during our stay and this was dealt with within 10 minutes of reporting it. The breakfast consisted of cereal, toast, bagels, fresh friut, doughnuts, very nice orange juice and lovely coffee. The location is also good for getting around Manhattan.", "title": "I would stay here again", "helpfulness": 6, "user": "Alison127", "date": "December 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4234637}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "On my next visit to New York I will stay here again.", "title": "Great location, great price", "helpfulness": 4, "user": "toptaffy", "date": "November 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4142796}, {"rating": 3.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "We stayed here for four nights in October 2005. The best thing about the hotel was the location - a few minutes walk from the empire state building. Our room was very comfortable, clean and quiet with two double beds, large TV and large bathroom with bath and shower. Breakfast is served in a curious basement room. However, the food was adequate and it made a good start to the day! The only downside was the attitude of the staff on reception. On checking in they didn't even respond when I asked to check in and wasn't even sure that they'd heard me until they produced the form to sign. The area itself is quite quiet, but there are plenty of good restaurants on Lexington Av and it's worth trying a curry on the curry hill!", "title": "Great Location & Comfortable", "helpfulness": 5, "user": "vnomous92", "date": "November 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4126200}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "I was in NYC on company business from Nov 15-17. Found out I was going only the week before and our usual hotel was booked. The minute I found out I was staying at this hotel, I got on 'Trip Advisor'.", "title": "Coudn't ask for better", "helpfulness": 2, "user": "josydez", "date": "November 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4092690}, {"rating": 4.0, "title": "Great Deal, Great Stay!!!", "text": "I was comfortable with the mostly favorable reviews and most were dead-on correct.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 7, 2005", "id": 4092184}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "I just got back from a girls weekend in NYC (Sept. 30th - Oct. 2). This particular hotel was chosen for the value of 4 people in one room ($50/night per person). I honestly don't know how 4 of the girls slept in this tiny room. I shared a room with only one person and we barely had enough space for our stuff. Our room was $199/night and that was with a discount, so in my opinion, it is no value hotel!!!", "title": "Stay far, far away!!", "helpfulness": 2, "user": "Nolegirl1", "date": "October 7, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3999536}, {"rating": 4.0, "title": "Couldn't have asked for better...", "text": "Honestly, this hotel was probably the worst hotel I've ever stayed in. It was dirty, small and the entire place smelled like smoke (the lobby included). The elevators were extremely slow and they were super tiny.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 29, 2005", "id": 3948141}, {"rating": 2.0, "title": "Most unpleasant staff I have ever met on my travels.", "text": "I would never stay at this hotel again.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3946006}, {"rating": 3.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "...at least not for what we paid. I don't understand the bad reviews I read on this site before we left. They must be from less experienced travellers because we quite enjoyed our 7 day, 8 night stay.", "title": "Small but clean room", "helpfulness": 1, "user": "bgonner", "date": "September 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3914125}, {"rating": 1.0, "title": "rude staff/blood in bathroom", "text": "We stayed on the 7th floor and it was a quiet room, the odd siren or horn could be heard at night but we were never actually awoken by any of this. The bedroom itself was smallish, which I expected in NYC, but it was comfortable. We had some closet space and a dresser which helped for our week-long stay. The queen bed was comfortable but I'd ask for extra pillows. The bathroom made up for it-big enough for two of us to get ready at once(plus my girlfriend enjoyed not having to pack her hairdryer).", "helpfulness": 4, "user": "washdcsjf", "date": "August 26, 2005", "id": 3808769}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We stayed here for two nights in December. The best thing was that the hotel was clean. There were holes in the bedspread....but at least it was clean. Of course it is small like most hotels in New York. The worst part was the heater. It blew hot air even when turned off. We had to open the window just to be able to breathe. The heater also made a noise like someone banging a hammer all night. Breakfast was fine ( bagels, toast, coffee, juice).", "title": "Clean but old and hot", "helpfulness": 8, "user": "Jlzywales", "date": "January 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4350302}, {"rating": 5.0, "title": "it was great!", "text": "the ramada was a great place to stay! im a normal college senior and took a trip out there with my best friend just to have fun and meet boys! to be honest! and the hotel was fab! me and my best are gold collar people! we dont live in slums (no offense anyone) so we know quality! but it was great super clean! the maid was sooo nice and cute she helped us with any question we had, anything we needed! we seened her everyday, which is nice to see a familiar face, it felt comfortable. the again was nice and clean! breakfast, work out room, everything u dont need! lol! the service was nice but the location was just a bit much for me! thats the only prob! safe suroundings just a little too far from the action! but the cleanest nicess place ever!!! trust us! we are just normal, spoiled, clothes conciences college students!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 10, 2006", "id": 4335212}, {"rating": 5.0, "title": "Great Stay in NYC!", "text": "My partner and I were there for Christmas 2005, as well as his 30th b'day. The room was a bit small, but hey, this is New York we're talking about. However, it was spotlessly clean as was the bathroom. The front desk staff was very friendly and helpful with a great attitude. One of the better Continental breakfasts of any hotel. Very safe neighborhood with great Pakastani/Indian restaurants, as well as Italian. Forget Starbucks, go to Brasil Cofee adjacent to hotel. Don't miss Patrick Kavanaghs Pub just a few blocks away on 3rd Ave bet. 33rd & 34th. Subway only 2 blocks away. Plentiful taxis. I don't think you can find a better value in NYC.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4312544}, {"rating": 5.0, "title": "Merry Christmas 2005 at the Ramada", "text": "We just spent the entire week of Dec 20-27th 2005 at this hotel, and LOVED it!! First off NYC is crampted its the beauty of this beast The rooms are small but so are the owned and rented apartments in this city. Im shocked with all of the negaitve comments on this hotel. We were greeted at what ever time of the day, We were blown away by how CLEAN the whole hotel is. The staff couldnt do enough for us ! All we had to do is ask. Rays Pizza is awesome and is to the left on Lexington as you come out of the hotel a couple short NYC blocks (Very good food and priced very cheap!) The breakfast was good just your basics, but a good start of getting something in your tummy to start your day. Murray Hill is a great neighborhood . Very easy to walk to anything! We know we happened to be there the day of the Transit Strike, but after 3 days we were using our MTA passes. I think the Hotel is wonderful . Just wish we could always book a room there at 100.00 a night we are relocating from Florida to NYC in about a year and will be making more trips up to NYC We had an incredible Christmas and to all of you a Happy New Year!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 29, 2005", "id": 4309290}, {"rating": 5.0, "title": "great value hotel", "text": "I have stayed here 5 times and all round value it was great! its only a 5 min walk to empire state building, staff were very helpful and the breakfast is a great start to the day. Rooms are cleaned every day and clean bedding and towels every day,also its quieter than being near the times square area.A tip is to keep checking the website as the prices change every few days and a bargain can often be had if you keep checking.", "helpfulness": 4, "user": "jilly62", "date": "December 21, 2005", "id": 4255013}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I booked this hotel with a little trepidation because it's been at least 20 years since I had a good experience with a Ramada Inn. Usually they're a bit shabby. However, all the usual mid-range hotels I like to stay at (Courtyard, Hampton) were either booked solid or $600/night, so I gave this one a shot.", "title": "Basic, but good", "helpfulness": 2, "user": "Snarky", "date": "September 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8736846}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled as a couple", "text": "This hotel is pretty good. It's not luxury, but the room was spotless, the furnishings recent, the Tempurpedic bed was comfortable, and the room was fairly quiet once you turned on the air conditioning. I have no real complaints.", "title": "Good hotel + location and a good price", "user": "MrsKCork", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8701047, "likes": {"liked": "— Price", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Like pretty much everything in New York, this is an older building that has been refurbished. I had a room with one queen bed, which was a little claustrophobic, but the closet was big enough to put my luggage in there so I wouldn't trip over it.", "title": "Ramada Inn Eastside..", "helpfulness": 1, "user": "jpjeff", "date": "August 13, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8402477, "likes": {"liked": "— Proximity to NYC", "disliked": "— Front Desk Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "WiFi Access is free and works well. (Call the front desk to get the password to login.)", "title": "Awise choice in NY!", "helpfulness": 4, "user": "Oscar_from_Denmark", "date": "July 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8259742, "likes": {"liked": "— The bed, the air condition and the nice bathroom. The breakfast included was ok too...", "disliked": "— The staff"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The shower controls are a little tricky. As you turn the knob at first, it goes from cold to lukewarm to no water, back to cold-ish. If you stop at the lukewarm before you hit the spot where the water stops, you'll get a surprise when the water heats up! The trick is to open the valve all the way and wait for the water to heat - it will be cold at first, but will be perfect in a couple of minutes. I'm not sure if every room is like this, but it's what I experienced in mine.", "title": "For the Price and Location, It's Fine", "helpfulness": 3, "user": "Cyberworld Toronto", "date": "July 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8193539, "likes": {"liked": "— Price", "disliked": "— The East Side Scene"}}, {"rating": 1.0, "title": "Most Terrible Hotel in New York", "text": "Worst experience ever! New York trip was ruined due to unfriendly staff, horrible attitude towards the guests. I have had a decent experience with the Ramada Inn's in other locations but this was the worst hotel experience ever.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3715669}, {"rating": 4.0, "title": "Good value for money", "text": "The Ramada is a good budget hotel. We stayed here for six nights. My husband and I wanted somewhere comfortable and clean and the Ramada was certainly both of these. The breakfast in the morning is good (and complimentary) and set us up for the day ahead.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3702969}, {"rating": 4.0, "title": "Worth Checking into", "text": "My only criticism is that I did not know what AAA meant (as I am from the UK) so the quote I got with Expedia when booking it was misleading. The AAA is a the american version of AA and apparently you get a discount only if you are a AAA member. I had a heated argument with the reception lady about this and she refused to give me the rate I had booked at as I did not have one of these AAA cards (my AA card was not good enough).", "helpfulness": 4, "user": "GustafClark_SD", "date": "July 22, 2005", "id": 3694213}, {"rating": 2.0, "title": "an Okay hotel for the price", "text": "I even showed her my email print out that I got sent by Expedia with my booking reference number on it, the hotel address, the dates of my stay and the rate i booked at but this was not evidence enough for the receptionist.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3677516}, {"rating": 4.0, "title": "Good, clean, simple, affordable accommodataion in Midtown Manhattan", "text": "After this shaky and disappointing start (and 45 mins of arguing with the receptionist and manager) I decided I wasn't going to let this blight the rest of my hols and conceded to paying $200 odd more than I had originally agreed to.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 1, 2005", "id": 3624664}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 34, "average": 125, "very good": 348, "terrible": 33, "excellent": 158}, "aka": "Ramada Eastside Hotel New York City", "slim_ranking": 0.609480812641, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Ramada Eastside offers clean and elegant accomodations with free wireless Internet access, a fitness center, a 24-hour business center, complimentary continental breakfast, free calls within the US and a lot more!"}