{"user_rating": 4.0, "review_count": 949, "name": "Ramada Limited Santa Barbara", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "We stayed at the Ramada, Santa Barbara whilst on a road trip from LA to San Francisco up the Pacific highway. I had planned and researched each hotel stop on the way and upon arrival at the Ramada Santa Barbara I can tell you that we were soooo happy and chilled out after the hustle and bustle of LA. We got the room for a very good price and so were very pleased. The rooms were comfortable and small and the breakfast minimal but perfectly adequate, but it was the landscaping and flora that really made it for us, it was so beautiful with the lagoons and bridges and the pool and spa were so refreshing. The ambience of the place was just mesmerising. We had only booked 2 days there but asked if we could stay another night as we felt so relaxed there. It probably was a little dated compared to other hotels at the time, but we loved that 1970's sort of a vibe and from the look of the website now, they have refurbished the inside. We actually got engaged there so this hotel holds a special place in our hearts!", "title": "Beautiful Calm Oasis - Unmissable!", "user": "London-Gal08", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27151791}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "My family stayed at the Ramada Limited in Santa Barbara and couldn't believe it was a Ramada - it seemed like a higher end hotel. We had a great room with a balcony overlooking the pool, which was surrounded by nice plants and even a little pond - really nice landscaping. The room had a high vaulted ceiling, which made it feel more roomy. The breakfast was higher quality than expected - there were even croissants. The hotel was in a good central location. Our only complaint is that there was no exercise room in the hotel - they have a gym you can go to a couple miles away, but we didn't have time to go offsite for exercise. The hotel wasn't cheap, but for Santa Barbara it was very reasonable. I would definitely go to this hotel again.", "title": "Can't believe it's a Ramada", "user": "blairp", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26900246}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We went to SB for a hockey camp on campus of UCSB. We decided to go for a suite as we had three hockey players and all the gear that goes along with each individual. We found the hotel very easily and pulled right in. There was one couple in line, two clerks so we walked right in and checked in. The clerks were very friendly and helpful, offered maps and assistance with our bags. The room was easily found and huge! The boy loved the balconies. The decided that they were going to eat breakfast on the balcony. The view was of the hotel grounds including a small pond with ducks. The bathroom was large enough and had an additional sink outside the bathroom with a small vanity. The shower head was very nice and did not rip my skin off. Plenty of hot water and towels. There was a nice touch for the kids that came in the form of a rubber duck. We asked for a second duck and it was given without hesitation. There was a small refrigerator and microwave that were sufficient for our needs. The beds were wonderful. Finally enough pillows for me! Two televisions were nice, but we were never there for very long so we did not really use them for too long. I come from a family of pest control employees and the first thing I do is look for evidence of bugs. I can say that I did not detect any signs of bugs at the Ramada. There were some areas of minor wear of the paint and some splashes of dirty water in the bathroom. Nothing that was worth getting worked up over. As for the noise, I did not notice any and I am a very light sleeper. We were on the freeway side but I heard the ducks in the morning, not the freeway noise.", "title": "Santa Barbara Ramada-Nice for families.", "user": "Jettavroom", "date": "March 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26712794}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The grounds staff was very pleasant and friendly as was the breakfast staff. The breakfast saved us at least $40, probably more. It was fun seeing others from the hockey camp having breakfast as well and the kids thought it was great to see the coach. During the evening the lobby had fresh cookies. Hot tub and pool area were clean and well stocked with towels and chairs. There were numerous coupons and maps available in the lobby. Check out was just as easy as check in. I was ready to be disappointed in a room that was over $200 a night, but in the end I was not. I would recommend this hotel to anyone looking for a safe, clean room in Santa Barbara.", "title": "Beautiful Surroundings, Nice People!", "user": "Nancicone", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25999006}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "P.S. A week later they sent us a thank you card for staying at their hotel. Nice touch!", "title": "Great place!", "user": "Seym", "date": "February 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24744920}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "If you want a clean, affordable, no non-sense hotel, you don't need to go further than Ramada Hotel in Goleta. Just a couple of miles past Santa Barbara is this hidden gem of a hotel with its beautiful pond and cut ducks!", "title": "best place to stay", "user": "sbloverla", "date": "February 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24633020, "likes": {"liked": "— functionality, price, cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "We were looking for a place to stay up in Santa Barbara and after some research chose this hotel. We have a 1 year old and needed to warm up her food; so having a microwave & a fridge in the room was very nice. They even brough in a crib for us. We realy enjoyed the pool and the hot jaccuzi.", "title": "Great Sports!", "user": "Fullback15", "date": "February 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24168795}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Internet in the room was free. There is no charge for parking your car. A generous continental breakfast including home made waffles, eggs, etc. is included in the price of your stay! Home made cookies await you in the lobby every afternoon.", "title": "Great family hotel!", "helpfulness": 1, "user": "whosthemom", "date": "February 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24107882, "likes": {"liked": "— Easy,convenient,welcoming accomodations"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The staff goes out of their way to accomodate you; they are very friendly and work extra hard to earn your satisfaction. We will definately come back to this hotel.", "title": "Good and Bad", "user": "GXS777", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 24104737, "likes": {"liked": "— friendlystaff", "disliked": "— old rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "We are a college sports team that booked the Ramada as a result of learning its proximity to UC Santa Barbara and its price point.", "title": "Dining, Ducks, and a Dip in the Pool", "helpfulness": 1, "user": "FrancoHarris", "date": "January 31, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24045463}, {"rating": 2.0, "stay_parameters": "Stayed November 2008", "text": "I paid USD 163 for a night in November (i.e., off-season) and honestly it is not worth it. Amenities in the room are very basic. Hotel is a bit outdated and very noisy (too close to the Freeway). Room for breakfast is \"depressing\" (and breakfast is so so). 10-15 mns drive from SB downtown. Should have gone in a Motel instead.", "title": "Very expensive for what you get", "user": "Zizgig", "date": "December 1, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 2.0, "value": 2.0, "rooms": 2.0}, "id": 22334990, "likes": {"liked": "— Nothing", "disliked": "— Expensive for the service you get"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "This place is great. Average price, comfy room, with basic things like a small fridge and microwave. The room was in a great condition, updated fixtures. Bathroom was very clean, plenty of towels. It was not very crowded during our time of stay, so we got to enjoy both the bigger pool and the hot pool all to ourselves! Continental breakfast is great! Everything is pretty much provided, even waffles. The bagels though were abit too densed. But other than that, it was a great place to stay. Staff were friendly, a little language barrier we encountered w/ the kitchen staff but they were very good to us! oh and free fresh baked cookies at night too! Short driving distance to downtown area, very easy location. I would most definitely recommend this to everyone.", "title": "Great place!", "user": "be-zen", "date": "November 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 22009677}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We stayed at this property for two nights and were very impressed with the rooms. They very very clean and had all the basic amenities including a microwave and refrigerator. Our room had a private patio too. The property has a very nice continental breakfast included in the price with a variety of items that included freshly made waffles. The other pluses are a heated pool and a nice Koi pond/lagoon near the pool area. Downtown Santa Barbara is only 10 minutes away and is a real easy drive. I would surely recommend this property.", "title": "Great value hotel minutes away from Santa Barbara downtown", "user": "Trevelling_Macs", "date": "November 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 2.0, "cleanliness": 4.0, "rooms": 4.0, "location": 3.0}, "id": 21790810, "likes": {"liked": "— Great breakfast. Nice clean rooms. Many amenities.", "disliked": "— The complex internet service."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "This hotel is excellent. Rooms are clean. My kids loved the lagoon at the center and breakfast was excellent.", "title": "Excellent", "user": "nlanla", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 21678857}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "My son attends UC Santa Barbara, and the Ramada Limited is located conveniently nearby. The last time I stayed there I was too busy to take advantage of the wonderful buffet and actually sit and enjoy the beautiful lagoon that was created to give the guests the peacefulness of nature. I had my senior in high school with me. He called me out on to the balcony where we enjoyed watching a beautiful, graceful egret searching for a little treat. He looked up at us for a moment, but carried on slowly walking and searching the water for a little fish. When he flew away it took our breath away. Then we saw the orange fish come out from their hiding places. This hotel is located close enough to Hwy. 101 to make getting to Santa Barbara or the University extremely easy. However, when we are sitting next to the beautiful pond surrounded by tropical plants, we cannot tell there is a freeway nearby.", "title": "Loved the peaceful lagoon at the Ramada Santa Barbara", "user": "collegemom57", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21390001, "likes": {"liked": "— Lagoon and convenience", "disliked": "— Cant think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "Date: January 10-11, 2009", "title": "A+ service, above and beyond the call of duty!", "user": "Ultimate-Mom", "date": "January 23, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23813965, "likes": {"liked": "— Excellent staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "Reviewer: A TripAdvisor member, Alameda, CA", "title": "This Ramada is wonderful!", "user": "TheDoctorLosAngeles", "date": "January 15, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23592224, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "Our Ultimate Frisbee team just returned from a weekend stay at this property. Very convenient to the UCSB fields and shopping areas. We requested an early morning breakfast due to our tournament schedule and Drew Wakefield, Director of Sales, was able to arrange everything we needed to make our experience unforgettable. The waffles were perfectly prepared by the morning crew and we were fed and ready to leave by 6:45am!", "title": "Exceeded my expectations", "user": "storewanderer", "date": "January 2, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 2.0, "rooms": 3.0, "location": 4.0}, "id": 23213296}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The rooms were comfortable, clean, and well-stocked. Our patio opened out to the gardenside with views of the pool area.", "title": "An oldie but a Goodie", "user": "Cruiser63", "date": "December 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 22613352, "likes": {"liked": "— the size of the room / location", "disliked": "— not being able to have the breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "The night manager, bless her heart, (I believe her name is Sarah) was most helpful in arranging for us to use their breakfast room for an evening gathering. She also kept some fresh baked cookies for us at check-in, after we drove in at 10:00pm from a long road trip. What a sweet way to begin our stay.", "title": "Five Star Service at the Ramada Limited in Goleta!", "helpfulness": 1, "user": "sammybeeSanDiego", "date": "December 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22530552, "likes": {"liked": "— friendly service; free wifi and local phone calls"}}], "location": {"country": "United States", "city": "Santa Barbara"}, "stars": 2.5, "variance": {"poor": 55, "average": 136, "very good": 347, "terrible": 25, "excellent": 386}, "aka": "Ramada Limited Santa Barbara Hotel Santa Barbara", "slim_ranking": 0.383333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Ramada Best of 2010 & 2011 Hotel Award Winner. Conveniently located near the Santa Barbara Airport, University of California Santa Barbara (UCSB) and US Highway 101. Complimentary deluxe continental breakfast, high speed internet, business center, airport shuttle, heated pool and whirlpool. Sealy posturepedic mattresses, in-room safes, refrigerators, microwaves and interior corridors. Beautiful waterlily lagoon and lush gardens with ducks, turtles & fish. Great service & value combined with clean, comfortable accommodations."}