{"user_rating": 4.0, "review_count": 489, "name": "Ramada Plaza Dieppe/Moncton Crystal Palace", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "One thing is for sure, the Ramada Plaza Crystal Palace Hotel is central to everything your need for a great family getaway. A theme park, theatre, shopping, indoor pool and restaurant are all onsite. Very few hotels can offer as many amenities. My wife and I, along with our pre-school son, purchased the \"Family Fun\" package, which included a family pass to Crystal Palace Amusement Park and a credit to the onsite restaurant, McInnis Landing. The front desk staff was very nice and interacted with small talk. The lobby area was a little tight with people checking in and out. We were assigned a room (California Suite) which gave us direct access to the indoor pool. The room featured two queen beds, mini-fridge, flat screen TV and many more standard features. Since we purchased the Family Fun package, the staff had placed two snack bags in our room. Rooms have complimentary wireless internet which provide a very good connect. The beds were very comfortable and clean; offering a pleasant night sleep. Overall, the hotel room was average… average in amenities and average in décor. A couple of items worth mentioning: there was a slight musty smell in the room, likely due to wet guest walking into the room from the pool. Also, we were awakening very early by the sounds of children in the pool so poolside room has its downside, especially at 8am. The hotel appears to be popular with hockey teams so expect to see plenty of teenage boys running through the hallways along with their parents sitting in rooms with the doors’ open. We enjoyed our stay at Ramada Plaza Crystal Palace however if this hotel did not feature an onsite amusement park, it may not be as recommendable.", "title": "Great Location and Amenities But Still Average", "helpfulness": 2, "user": "StandingRoom", "date": "April 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102573654}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We had a gift certificate for one of their fantasy suites that my wife bought at a fundraising auction. We were going to be in Moncton about a month later, so we called the hotel, asked which of the suites were available on the night we wanted. All of the fantasy suites were available, so I initiated a booking. Everything was great until I said we had a gift certificate.", "title": "We tried to stay here - but hotel would not honor our gift certificate!", "helpfulness": 1, "user": "lanlord", "date": "March 30, 2011", "detail_rating": {"service": 1.0}, "id": 102239046}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "They said they would not honor the gift certificate on the weekend! It says nothing about this on the certificate itself. They then told us it would be no problem to book it for a weeknight. Not impressed. Who is looking for a Fantasy Suite in a hotel on a weeknight?", "title": "What's not to love?!", "user": "Mum1928", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100558908}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We don't live in Moncton. We may never be able to use this gift certificate. Shouldn't they say on the certificate if there was such a restriction?? It would not have been bought if we knew this.", "title": "Great place to stay with young children.", "user": "SunforMum", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99646540}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "What a rip off.", "title": "Very Clean", "user": "Travellingteam", "date": "February 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 95835078}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed at the hotel on Sept 30th for my girlfriend's birthday. I was impressed with the quality of the hotel and the good service from the check in staff. Such a convenient location for a nice relax night. Rates a bit more expensive than I expected but the room was great, definitly better than an average hotel.", "title": "Early check out???", "helpfulness": 1, "user": "vpcool", "date": "October 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82676409}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "However we were waken up early by the housekeeping staff, who knocked at our door at 9am. She tried to enter the room as well,good thing the chain was on. My girlfriend walked down the lobby for a bit and was asked THREE times by the same housekeeper if we were checking out, well before check out time! I understand housekeeping is on a tight schedule but we payed good money and expected not to be bothered until 12.", "title": "Good stay with kids", "user": "JNG123", "date": "August 31, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 77603049}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I would still recommend the hotel and hope this was an isolated incident.", "title": "Fantastic Hotel - Great Experience", "user": "lbaumgartner", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74365005}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We booked the slide and ride 3 day stay package and it had a great value. We had family day-passes at crystal palace (the attached indoor amusement park) and at magic mountain (the nearby waterpark) included in the package. As well as a family pizza dinner and $120 credit at the hotel restaurant which could be applied at the bar or room service also. For the price, it was definitely worth it. The only downside of our stay was that our bathtub was really dirty under the bath mat. So bad so that I refused to bathe my children in it. But overall, for the amenities and included package perks, it was well worth the money we paid.", "title": "Better than I expected - Great for a March Break getaway :)", "user": "Canabrits2", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60172803}, {"rating": 5.0, "title": "Great place for a hockey team", "text": "I am originally from the East Coast, and my husband and I were going on a last minute get-away while visiting family in NB, as we now had babysitters for our 6 month old. Lots of hotels were booked, and we ended up finding a room at the Crystal Palace Ramada. It was never a hotel that was at the top of my list, but since staying there it's the first place I'd call in the future. Our room was absolutely beautiful, and the service at the front desk was beyond compare; those men and women are extremely friendly, helpful, and professional. Furthermore, the attached restaurant had great food and super friendly servers, the pool area looked fun and inviting, and the whole hotel had a really great feel. Oh, and did I mention that the front desk staff were excellent? I'm looking forward to returning with my husband and daughter when she's old enough to enjoy the amusement park that's attached, although I'd come back in a heartbeat even if we were unable to take advantage of this added attraction. I would highly recommend this hotel to any traveler.", "helpfulness": 1, "user": "WildCommonwealthBoy", "date": "February 3, 2010", "id": 55112476}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "We brought our hockey team here again this year and were not disappointed. The young guys from Source Security did a great job in keeping things quiet but still allowing everyone to have fun. Thank you. The staff at the Hotel were great and also McGuiness Landing was able to host a team dinner which (I think, Mgr. Lisa)did an awesome job.", "title": "Best Hotel for a Group of Kids", "helpfulness": 1, "user": "WildCommonwealthBoy", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94536778}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Why would you stay anywhere else? The kids have their space at Crystal Palace and the parents can do their thing.Overall, another great job by everyone.", "title": "Amazing Hotel Staff!", "user": "DowntownBrown60", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92119426}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Booked a basic room online using Wyndham rewards points for a free stay. Upon arrival to the hotel we asked if there was a chance we could get a theme room just for fun! The receptionist indicated that since the Christmas rush was over he may be able to help us. He went out of his way to give us a free upgrade to a \"Nautical\" theme room. Room was amazing! When we asked if there was a free continental breakfast we were told no. But instead (since we asked) we were given two free breakfast coupons to the attached restaurant McGinnis Landing! Breakfast was great but service was lacking in the restaurant. We waited over 30 mins for our first cup of coffee. But hey, the price was right! Loved the hotel and amazing staff! Can't praise our receptionist enough. Thanks Michael!", "title": "Superb Business Hotel", "user": "greycupfan", "date": "November 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88455465}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I am a Business Plan Consultant and have clients in Moncton and Halifax.", "title": "Great hotel, great location, great features", "user": "Monctonguy", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 87184879}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Service is delivered at this Hotel with a smile and with professional style. Staff members are well-trained and clearly enjoy what they do.", "title": "Clean, comfortable, pool and amusement park...great family destination", "helpfulness": 1, "user": "RugerSako", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86552892}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We stayed on a long weekend with our daughter and had booked a package that included dinner and passes to the amuzement park. After a long afternoon/evening at the park we made our way back to our room so we could get cleaned up and head to bed. About half way through my shower I noticed that our bathroom had NOT been cleaned!!!! I wear glasses so I couldn't tell how bad it was until after. There were open shampoo and conditioner bottles from the person who stayed before us. Even a used bar of soap complete with body hair stuck to it. I let the hotel staff know the next day (our daughter was already in bed for the night) and they barely even apologized. After returning home I checked my credit card balance to find that I was OVER billed for this horrible experience. They charged me for the package that included the meal and then charged us for our meal again. I emailed the hotel with no response. I finally reached someone by phone who agreed to reverse the charge of the meal. Almost 2 weeks after leaving the hotel I checked my credit card again to find that I was still being pre-authorized for twice my hotel stay on my card. I had to call again to find out that they did something \"wrong\" with my card and it still wasn't fixed. At this point I was a little frustrated and called the Ramada toll free number. After several conversations I was assured that I would receive a complete refund from the hotel. Another 2 weeks later and still no refund. I phoned the Crystal Palace Hotel directly and was told that the chain toll free number never should have told me I'd receive a refund because the manager informed me that they \"don't do that type of thing\". She told me she'd email me a coupon for my next stay (not that I'd ever go back). I told her my email address but I never did receive anything. When I phoned back again I found out that the manager hadn't written down my email incorrectly. After spending five minutes trying to explain to the manager what an underscore was I finally gave up. I've still never received an email or an apology for that matter. I would NEVER stay there again!!!!!!!!!", "title": "Would never stay here again!", "helpfulness": 3, "user": "saranndur", "date": "January 29, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 54689682}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I had always wanted to go here to stay in one of the fantasy suites.", "title": "Disappointed, but willing to try one last time...", "helpfulness": 4, "user": "NovaLisa902", "date": "January 26, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 54461494}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I booked the Rock and Roll room for myself and child and a regular room for my mom and a friend who came with us.", "title": "Frequent Hotel Guest", "user": "irishman50s", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53791988}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Photos were deceiving, decor is changed and rooms are TINY!", "title": "Fine overnight stay", "helpfulness": 1, "user": "laprof", "date": "October 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45683258}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The room was not in a good state of repair. Colored Lights were burned out around, and in the juke box as well.", "title": "Expected more!", "helpfulness": 1, "user": "juddylove", "date": "March 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 26898515}], "location": {"country": "Canada", "city": "Dieppe"}, "stars": 3, "variance": {"poor": 22, "average": 60, "very good": 178, "terrible": 5, "excellent": 224}, "aka": "Crystal Moncton Palace", "slim_ranking": 0.25, "description": "Our hotel is in the hub of Moncton, close to the airport, downtown and restaurants. We are attached to an indoor amusement park with a rollercoaster, laser tag, mini golf, climbing wall and much more. Our location also houses Empire Extra movie theatres, Chapters, Starbucks and McGinnis Landing Restaurant. We are steps away from the largest one level shopping centre in Atlantic Canada. Winner of one of the Top Ramada Awards in the World, our focus is on customer service and ensuring that you have a memorable stay with us. We offer free parking, free high speed internet, theme rooms and our famous tropical pool oasis."}