{"user_rating": 3.5, "review_count": 487, "name": "Ramada State College Hotel and Conference Center", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Dirty outdated rooms - typical for ramada. The conference center is much nicer than the hotel part. The shower was hot and cold so I got to get scalded then frozen while taking a shower. The bed was comfortable enough. The room has old furnishings, a big tube tv, looks dark and dingey, and the cleaning people don't do a good job. There was dust and dirt in the room and trash on the floor from the previous guests. The free internet was sooo slow that I had to use the 3G on my phone instead. Given the choice I wouldn't stay here...or any ramada", "title": "Dirty and outdated - go somewhere else", "helpfulness": 1, "user": "BC B", "date": "August 22, 2011", "detail_rating": {"cleanliness": 1.0, "service": 1.0}, "id": 117080927}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This was my 5th time staying at the Ramada at State College and by far the worst. Our room was on the side by the swimming pool (room 406), and there was a distinct odor of what I thought was urine in the parking lot - almost like a sewer backup. The room was shabby and needed updating. Both the air conditioning and the bathroom fan were very noisy, making it difficult to get a good night's sleep. Worst of all, the bathroom was not clean. The floor had hair on it, the shower knobs were loose and hard to turn to regulate the water temperature, and the toilet was difficult to flush. On top of that, when I went to move the shower curtain a dirty, stained washcloth that was placed on top of the shower rod fell to the floor. It looked like it was stained with blood -- YUCK!!!! I would have said something to the front desk, but at checkout the line was almost out the door.", "title": "Lousy Room", "helpfulness": 1, "user": "Ellen J", "date": "August 21, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 117038092}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I know it was move-in weekend at Penn State (the reason I was there also), but this hotel has to get its act together and finish the room upgrades they started a year or two ago, especially when we paid (with tax) $170 a night.", "title": "We will definitely stay there again", "user": "Kate S", "date": "August 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116869254}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Overall, the accomodations and trip went very well. Jennifer Brooks-Stahl was very organized and easy to work with, so I look forward to working with her in the future.", "title": "Busy time of year", "helpfulness": 1, "user": "7521wifey", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 4.0}, "id": 116676375}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "I stayed here two nights with my 1 year old while in town for a family wedding. The staff is super nice, the room is nice except the door didn't shut all the way (the lock did latch though). My room was on the bottom floor right on the walkway to the pool and there were loud people, talking, laughing, shouting and walking by at all hours of the night into the early morning (college aged). The next day I had maintenence check out the door to see if a better seal might keep the noise out. The door wasn't fixed and the 'party' outside my door sounded like it was in my room-and it didn't stop even when I called up to the front desk to have them break it up. I was given a healthy discount after letting the front desk staff know about the noisy situation ($70/night instead of $100). Who knows if it's always like that or if some type of college function was going on. If I ever stay there again, I will ask ahead of time for the quietest room possible.", "title": "Super friendly staff!", "helpfulness": 1, "user": "molly d", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116584616}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This hotel is in need of a major renovation...Bathrooms, drapes and carpet all 1980, yet it is CLEAN. The shuttle to and from the airport is a plus and the food in the restaurant is good. The hotel staff are very nice and the price is reasonable...", "title": "You can do better in State College", "helpfulness": 2, "user": "daisy20071960", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 118931615}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I was there for a conference for work and the Conference Center was the perfect venue. It was very nice to not have to leave the hotel property to get to the conference. The hotel rooms were very nice and relaxing. The \"outside\" room I was in had been renovated and was very nice.", "title": "PACVB Conference", "helpfulness": 2, "user": "MikeO3", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118625094}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "Nice place and decent value for 80 bucks. When they Jack the price for special events not a good value. The indoor pool is the big attraction otherwise rooms same as other motels in SC.", "title": "Ok place", "user": "freqtravelor11", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 117958189}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stay here annually when we visit State College for Penn State football games. Way overpriced, but one of the best options you'll find on a football weekend and since supply and demand win out, we just \"suck it up\" and deal with it.", "title": "One of your best choices when visiting PSU", "user": "adlaver", "date": "September 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117844911}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "All \"inside\" rooms have been renovated (unsure about \"outside\" rooms) and they're very nicely done with upgraded bathrooms with granite counter, flat screen TVs, fridge, microwave, etc. Plus, you cant get much closer to campus!", "title": "60's motel in need of update", "user": "goldold25", "date": "September 6, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117762002}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "When we arrived a wrestling camp was in session. The temperature was 103 and the indoor pool area smelled of overworked young bodies and mold. The first room we were given was just off of this area and the only \"window\" looked out on the adjoining corridor. The second room was next to the laundry and had such a strong mildew smell we had to refuse it. The third room was acceptable it at least had an outside window. The conference center is loosely connected by open corridors which as the evening went on became outside party areas for the many families and groups of kids staying at the hotel. Some of the rooms have no windows at all just curtains covering cinder block walls. The front desk staff on Friday when we checked in were less that helpful.", "title": "Unless you are 12 or under never go there", "user": "ryla1", "date": "July 28, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 115917997}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "In their defense, the front desk staff on Sunday at check out were very helpful and the meeting rooms and food for the conference were more than adequate. The air-conditioning kept up to the heat and the evening banquet was excellent.", "title": "Not Clean", "user": "jo514", "date": "July 27, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 1.0}, "id": 115873588}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Although the room had some hotel extras such as shampoo etc. Over all the room had a strong bleach smell that came from the sheets, horrible yellow pillows and the best was the underwear behind the bathroom door to which the front desk said \"EWEE\"", "title": "Decent place, a little pricey", "user": "ltlredfun", "date": "July 18, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 2.0, "service": 3.0}, "id": 115501856}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Move on to find another place.", "title": "Epitome of \"Average\"", "helpfulness": 1, "user": "ryla1", "date": "July 18, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 115490454}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Breakfast was nice if you got there first thing, in an hour most was gone and not replaced.", "title": "Bad Choice", "user": "jcm3113", "date": "July 17, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0}, "id": 115462477}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "In July 2011 we had my daughters wedding at the Ramada in State College, PA and we couldn't have been more pleased. We did very little and the room and facility were very elegant--the lighting under table clothes were especially beautiful and we have received many compliments from friends and family. This is definitely a one stop place for everything as they handled everything from the time we walked in until the time we walked out. We found the staff/personnel to be professional and accommodating as well as able to make changes as we went on the day of the event. The food was exceptional and words cannot describe... I highly recommend the Ramada as a future site for your family wedding or function, I know my daughter had the wedding that she always dreamed about. The overnight rooms were very nice and there is also an indoor and outdoor pool which are also very welcoming.", "title": "Best Wedding Reception EVER--One we will always remember", "user": "Susan R", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116573848}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Awesome outside pool, friendly staff, clean rooms, and the restaurant (PJ Harrigan's) was delicious!", "title": "Great place!", "user": "Amys000", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116573051}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This is a large complex, clean and well maintained. Friendly, efficient staff. The room had a refrigerator and microwave. The bed was wonderfully comfortable. Our room was on the 2nd Floor, overlooking the atrium and pool. We enjoyed seeing the activity around us, although some of our group with pool side rooms complained about the noise and humidity and asked to change rooms after one night. If you want to ensure peace and quiet, consider asking for it. A hot breakfast was included on week-days. The restaurant was reasonably priced for a hotel dining room, as was room service.", "title": "Comfortable and Reasonably Priced", "helpfulness": 2, "user": "LanceErie", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116445441}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I moved to State College from across the country, and arrived to the town without first being able to secure an apartment. The hotel was aware of my situation and bent over backwards to accommodate me as I searched for a place. Of all the hotels I'd made an attempt to book, this was the only one flexible and willing to work with my tenuous schedule. I would recommend this Ramada, and particularly its staff, to anyone visiting State College.", "title": "Hotel With Heart", "helpfulness": 1, "user": "tatiad", "date": "August 7, 2011", "detail_rating": {"service": 5.0}, "id": 116395000}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel was busy with groups and conferences but the Front desk staff was very nice. All our questions were answered and they were helpful with directions and with things to do with kids in State College.", "title": "Good Time", "helpfulness": 2, "user": "avr1321", "date": "August 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116320797}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 66, "average": 125, "very good": 132, "terrible": 30, "excellent": 134}, "aka": "Ramada Inn & Conference Center State College Hotel State College", "slim_ranking": 0.807692307692}