{"user_rating": 3.0, "review_count": 128, "name": "Ramada Edmonton South", "reviews": [{"rating": 1.0, "title": "Lousy service", "text": "Reservations messed up, moved to a more expensive room and charged extra, no extra towels, rude and un-appologetec clerks, carpets dirty. Will never use Ramada again!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 10, 2004", "id": 2433332}, {"rating": 3.0, "title": "GREAT for a family!", "text": "It's an older hotel, however, we found the room perfect. We had a separate bedroom (same room) for our children, with their own TV. We all enjoyed the water slide, heated pool and hot tub. I would DEFINITELY stay there again! It's GREAT for a family.", "user": "A TripAdvisor user", "date": "November 12, 2003", "id": 1483543}, {"rating": 2.0, "title": "Well.....", "text": "Well, to start there was a bunch of us that stayed there. It was a nice enough hotel sure, but since the quote on here is alot lower than we paid,, which I wouldnt have minded had they paid their heating bill.. IT WAS FREEZING.. Our room wasn't the only ones that thought that either I talked to other people that were staying there that I did not know and they said the same thing. They ordered extra blankets, wish we had done the same, instead we froze all night long and with 4 kids under 8 yes it wasnt a quiet night. The next morning we then went to the restaurant for breakfast, I kid you not everyone went up to get their coats to sit and eat,, that isnt the way I like to eat, being comfortable is important. But hey the food was worse in temperture, yuk. It was old and I actually chipped a tooth on the bacon and telling the guy running the register didnt work cause all he kept saying is pay here, pay here.. All in all, if the food was edible and the rooms were warm instead of freezing,, I may go back, but that will be a long time coming before I do. I guess there is always a slight chance the rest of the edmonton hotels will burn down and I will have no choice.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 28, 2003", "id": 925542}, {"rating": 1.0, "title": "Caution!!!", "text": "This hotel was a nightmare to deal with! We were misquoted rates, and they tried to stick us with $20/night too much. When we complained to the General Manager (Jim), his arrogance was unbelievable. He cared little about anything other than profits, profits, profits. He was right and everyone else was wrong! This encounter was truly pathetic, and I would highly caution anyone who is choosing to go with the Ramada Inn, Edmonton South. Edmonton is a great town, with many other hotels. Its not worth the chance - GO SOMEWHERE ELSE!!! If not... don't say you weren't warned!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 15, 2002", "id": 642347}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "This tops the list of the worst hotels I have ever stayed in. The walls in the rooms must have been almost paper thin, because they didn't block any of the talking coming in from next door. We have 5 and 3 year old children and they were kept up till 11:00 at night. The waterpark was freezing - even the hot tub! I also found it very dirty. The hotel service wasn't good either, as the front desk lost both our room keys before we checked in and we had to wait a half hour before they found them. Aweful hotel, Aweful experiance.", "title": "Horrible Experiance", "helpfulness": 2, "user": "dogbone1002000", "date": "August 24, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3802190}, {"rating": 4.0, "title": "excellent!!!", "text": "Our family had a great time here. My 6 yr old said it was the best waterpark in a hotel ever!! Excellent customer service, clean rooms.", "user": "A TripAdvisor user", "date": "May 7, 2005", "id": 3446730}, {"rating": 5.0, "title": "Great Family Place!!", "text": "Highly recommended.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 3, 2005", "id": 3435020}, {"rating": 5.0, "title": "Scumptiously Wonderful!!!!!!!!", "text": "Upon pulling up to the hotel I was a bit scared at the look of the outside. The stained white brick with pink balconies was very gross looking.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 20, 2005", "id": 3289671}, {"rating": 5.0, "title": "Outside aweful, inside awesome", "text": "But when i got in it was the cleanest most beautiful hotel i've ever stayed in. The rooms were very clean and had redwood furnishings. There were white brick walls which looked nice and kept the sounds from other rooms out. The balcony was fun to stand on and look at the traffic.", "helpfulness": 2, "user": "Barkleythedog", "date": "November 4, 2004", "id": 2805839}], "location": {"country": "Canada", "city": "Edmonton"}, "stars": 2.5, "variance": {"poor": 17, "average": 25, "very good": 32, "terrible": 38, "excellent": 16}, "aka": "Ramada Edmonton South Hotel Edmonton", "slim_ranking": 0.590909090909, "description": "Ramada Edmonton South renovated 2010/2011 has a fitness facility, restaurant, bar/lounge and liquor store. Business amenities at this 2.5-star property include business services and audio-visual equipment. Event facilities consist of conference rooms and banquet facilities. Additional amenities include laundry facilities, complimentary newspapers in the lobby, and self parking (Complimentary). Guestrooms: Flat Screen TV's are equipped with cable channels and pay movies. Guestrooms provide complimentary wireless Internet access, phones, and voice mail. Guestrooms feature coffee/tea makers, fridge and microwave. Beds have triple Sheeting, and Duvets Bathrooms ( new granite Counter tops )offer hair dryers and complimentary toiletries. Additional amenities include air conditioning, irons/ironing boards, and clock radios. In addition, housekeeping is offered and amenities available on request include wake-up calls. Cribs (infant beds) and rollaway beds are available."}