{"user_rating": 5.0, "review_count": 404, "name": "Rampsbeck Country House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My partner and I stayed here for one night on a deal we got from Travelzoo. From the moment we arrived to the moment we left, the service was impeccable. The staff welcoming, attentive yet discreet, the food was out of this world and the bedroom was beautifully furnished, our room had a view of Ullswater lake and was it was so quiet and peaceful. The whole experience was relaxing and I would go back again any time!", "title": "Faultless in every way", "helpfulness": 3, "user": "Jo f", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151630962}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Superb hotel with great staff and service, although a bit remote from other tourist areas but you know that when you book!", "title": "Excellent staff with superb en-suite", "user": "chchester", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 151562478}, {"rating": 5.0, "title": "Wonderful stay- immaculate hotel", "text": "Meals are excellent but dinner was a bit too rich for me although on the second night I restricted myself to Sea Bass which was very well cooked.", "user": "Smyth1", "date": "February 6, 2013", "id": 151553955}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Breakfast had the usual large selection; all of which which is served to you at your table and the porridge was spot on and not too runny.", "title": "Exceptional hotel in an amazing location", "helpfulness": 2, "user": "Jill N", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151408080}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Excellent restaurant waiting staff – the majority (if not all) are from other countries although speak good English. More importantly however they are very well trained with attention to detail when serving customers.", "title": "A special 'afternoon tea'", "user": "Gillybt", "date": "January 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150877316}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We have just returned from a short stay, in what I can only describe as \"pure luxury\".The hotel is charming, the staff, very friendly and professional.We booked a standard room with Dinner. The room,although small, was very appealing, with a lovely bathroom,tea and coffee making facilities, and a fruit bowl. The evening meal had good choices, and was fantastic ( obviously a wonderful chef ).Breakfast was great.We left the hotel,promising to return ASAP.Well done \" The Ramsbeck Country Hotel\"", "title": "Luxury on a Plate", "user": "Kenneth23", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140613323}, {"rating": 4.0, "title": "Peace and Quiet", "text": "I loved this place. It was a typically English country house hotel, with beautiful grounds and well appointed rooms, that were immaculate. However I did feel the youngest person there and I'm 51!! It was a bit old fashioned, but to be quite honest, I quite liked it. The service was excellent and they also looked after our dog well. It was a bit like going back in time . People dressed for dinner which few of us do these days, so it was lovely that people made the effort. Breakfast was terrific and catered for the needs of the dieters! Dinner was good, although a little over priced. The wine list needs to be improved substantially and more wine by the glass needs to be on offer in order to do good food and wine matching. I'd go back ....but would have to save up. It's not cheap!", "user": "Junojac", "date": "September 15, 2012", "id": 140314194}, {"rating": 5.0, "title": "First class service, Five star rated!,,", "text": "The best hotel, we have stayed at for a long time, first class cuisene beautiful exqusite surroundings & decor.", "helpfulness": 2, "user": "Michael T", "date": "September 5, 2012", "id": 139482741}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "A nice touch that showed the trouble they have gone to was the serving of canapés in the bar before dinner, whilst you perused the delightful dinner menu!,, A definite must stay again!!", "title": "Wonderful Hotel in a fabulous setting", "helpfulness": 2, "user": "Welshmandownunder", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 139040311}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We found Rampsbeck by accident, what a find! Lovely warm welcome, beautiful room looking over Ullswater furnished to a very high degree with antiques everywhere.", "title": "Excellent hotel beautiful location", "helpfulness": 3, "user": "Rosie91", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138948546}, {"rating": 5.0, "title": "High Standards", "text": "The Rampsbeck has standards, high standards and as far as we can see it meets or exceeds them in all aspects of hotel management and guest satisfaction. It's not cheap but it is value for money. The food was very good, not outstanding, served well and with a reasonable wine list (not many hotels of this size would list two CdP's albeit the Beaucastel was a 99/2000 vintage at £100+ and one wonders how many of those move in a year even in this hotel). The room was both well maintained and well equipped with a nice full length window view of the garden and lake. The staff were attentive without being intrusive and very helpful with local knowledge of where to ramble, eat out etc. We did not find them to be the slightest bit 'stuffy' as some poor souls have alleged.", "helpfulness": 1, "user": "nataliatiyad", "date": "October 22, 2012", "id": 143466322}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "If we cavil about anything it would be that the style of shower that we encountered (overhead rose only without a hand held attachment) is not to our liking and, horror of horrors ...... there was some mould on the bottom of the shower tiles; someone in housekeeping will probably be shot for that omission.", "title": "Fabulous Hotel", "helpfulness": 1, "user": "Anne A", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143053292}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This is a little gem .The welcome was warm and the ambiance superb. We had a lovely room overlooking the lake with a nice seating area and a great bathroom. Also was very quiet at night .", "title": "Exemplary Service", "helpfulness": 2, "user": "tr250man", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143020000}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The service was good... attentive without being intrusive. We ate in the restaurant and it was excellent - probably in our top 5 of UK places to eat.", "title": "What a shame the atmosphere is not as outstanding as the venue", "helpfulness": 4, "user": "Linda T", "date": "October 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142857174}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We can't wait to visit again .", "title": "Not in the least pretentious .........", "helpfulness": 1, "user": "DGeorgeCarlisle", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142806233}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My boyfriend and I stayed here for Dinner Bed & Breakfast with a Superior Room. The service was first class- all the staff were polite and professional.The food was incredible, the Bramley apple cheesecake is a must-have! The room was beautifully presented and immaculately clean. We would definitely recommend staying here!", "title": "Exceptional Hotel", "helpfulness": 2, "user": "hanby256", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150866560}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We had a wonderful one night stay here, this is a beautiful hotel, the staff are polite and very helpful. The room we stayed in was a mini deluxe, we had views of ullswater lake, the mountains and the hotel gardens and a beautiful bathroom, with a bathtub looking out over the lake. We enjoyed sitting in the lounge, reading the papers, next to a roaring log fire, drinking champagne watching the snow come in across the lake - very romantic! The breakfast was delicious. Looking forward to our next stay.", "title": "Beautiful country house hotel", "user": "ireallywanttogothere", "date": "January 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150674840}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We've just had a two day Travelzoo offer at Rampsbeck Hotel and couldn't rate it highly enough. The place is lovely - very beautiful and everything you would expect from a hotel of this class. The accommodation was very clean and comfortable, the staff were wonderful - the perfect mix between being friendly and efficient - and the food was amazing. Am hesitant to post this as really would like to keep this place a secret!!", "title": "Wonderful Experience", "helpfulness": 1, "user": "FelicityDumfries", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150595322}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Took a pot of tea in the bar in December on two occasions ,speedy free Internet access with a lovely peaceful bar room overlooking the gardens , Ullswater and the snow covered mountains beyond . Booked the special dinner , bed and breakfast rate for January and February and stayed there Wednesday night the 23 rd of January . So very impressed with every aspect of the hotel I have made a reservation again for early February and invited best friends to share the experience with me again . It will be my Pal's 65 th birthday present for him and his wife . I know they will enjoy their two night holiday at this very special ,privately owned hotel.... .location location location they say, plus the finest attention to detail make this spot the place to stay in the Eastern borders of the Lake District.", "title": "Perfect tranquility with the highest standards of service and only six miles from the M6", "user": "Peter R", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150569229}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We went here for a wedding anniversary celebration in December 12, using a groupon voucher. We found the location quite easily and the surroundings overlooking the lake was beautiful. We had a frosty night on one evening and the pictures were just like a winter wonderland. The bedroom was clean and very comfortable, we a an excellent nights sleep. The food was fantastic and wine list. The lounges were old world style with modern day comfort and we would definitely love to return and recommend to others. Our son and his wife had gone about two weeks previously and also had very good reports so definitely not a flash in the pan.", "title": "Lovely hotel in a lovely place", "user": "waleboer t", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150517577}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I had high expectations for the Rampsbeck given the previous reviews on Tripadvisor, but unfortunately did not have the same experience as others who have reviewed the hotel. The location is gorgeous and the room was great, as was the breakfast. The dinner was really overpriced and my biggest disappointment was how pretentious and snobby some of the staff were, particularly the woman at the frost desk. Up until this point, my husband and I had amazing stays in places in England and Scotland with staff that were so welcoming and friendly, so the poor attitude of some of the staff at the Rampsbeck was very apparent. If we return to the Lake District, we will be staying somewhere else.", "title": "Okay stay in a beautiful location", "helpfulness": 1, "user": "Lauren B", "date": "October 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142710433}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Stayed at the beautiful Rampsbeck Hotel for one night and was completely blown away. Service was the best I have ever received at a hotel! Over looking the stunning lakes. We stayed in a standard double room, spotless, the bathroom was of very high cleanliness. Temperature was perfect at all times and contained everything we needed! Will most definitely be staying again soon. Very highly recommend this hotel.", "title": "Blown away!!", "helpfulness": 1, "user": "Misnomer87", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142339807}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed for one night only - not long enough! We have stayed in many hotels in the lakes but Rampsbeck is the best so far! We had a superior Room (16) - lovely views, spotlessly clean and very comfortable bed. The staff were very welcoming, the dinner was divine, very innovative menu - compliments to the chef, the service excellent. Cannot fault this hotel, can't wait to go back. Thankyou!", "title": "\"A Hidden Gem\"", "helpfulness": 1, "user": "Orville", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142060291}, {"rating": 5.0, "title": "A little piece of heaven in the lakes!", "text": "My partner and I have stayed in many places in all parts of the lake district over the past few years and I have to say that the team at Rampsbeck have got the balance to as near perfect as we have experienced and expect when we go away. Our mini suite \"Hallin\" was perfect and the bathroom very sumptuous. In our opinion the Ramspeck have got the balance just right between wanting to be a five star hotel without being too attentive. The cleanliness of the room was nearly perfect and the staff fantastic with their attention to detail. My partner had asked for flowers and candles to be in the room for our arrival and both were great. We loved our stay so much that we booked to stay for new year then and there and we were even shown the rooms themselves that were available so we could have an informed choice. The food was excellent and again we did not feel hurried or rushed to make our choice or vacate the restaurant. The views across Ullswater are breathtaking. We are very much looking forward to spending New Year at the Ramspeck - thank you to the team for making us feel so welcome and at home.", "helpfulness": 1, "user": "lizz e", "date": "October 1, 2012", "id": 141728062}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We have just returned from a lovely return visit to Rampsbeck for our 40th wedding anniversary.", "title": "Anniversary visit", "user": "Linda S", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140862126}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Having had this hotel recommended by friends , we paid our first visit to Rampsbeck House and we were not disapointed. The location on the lake side is stunning. We had a room with a lake view which was wonderful inspite of the almost constant rain over the bank holiday weekend ! We ate the first evening in the hotel restaurant and the cuisine was exceptionally good.", "title": "Ullswater Retreat", "helpfulness": 4, "user": "Graham F", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138637153}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The second night we ate at the nearby pub and it was well below average , never again !!", "title": "Excellent hotel but a bit disappointed by the food", "helpfulness": 3, "user": "Hopeful-Guest", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138585614}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel breakfast menue is fantastic , spoilt for choice. Staff at the Rampsbeck were first class in every way making our first visit here a very enjoyable experience.", "title": "Wedding Bliss", "helpfulness": 1, "user": "PhatHutch", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137092267}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "First impressions very good with friendly efficient reception - indeed the front of house staff cannot be faulted throughout the hotel.", "title": "Superb", "helpfulness": 2, "user": "TravelCouple13", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 136732043}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had a side lake view medium priced room (£250 per couple per night dbb). It was very comfortable and well appointed - I have never slept on a nicer bed. Housekeeping is immaculate. Modern bathroom, flat screen TV and free internet. The public rooms are very comfortable and the gardens are beautiful.", "title": "Consistently wonderful", "helpfulness": 1, "user": "Beancounter27", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136315907}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Just returned from staying at this wonderful hotel and can honestly say it was fabulous. We went in a party of 8 and each and every one of us thoroughly enjoyed every aspect of this charming establishment.", "title": "Simply outstanding", "user": "Jaws8", "date": "February 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153291474}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The rooms were immaculate, the staff courteous and friendly, the food sublime, and the setting perfect.", "title": "Another Great Weekend at Rampsbeck", "user": "TonyR27", "date": "February 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 153178629}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "It was also excellent value for money.", "title": "LOVELY RAMPSBECK HOTEL", "user": "Lindalook", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152978237}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "A big thumbs up to all who work there - you all have much to be proud of and your hotel truly deserves its lofty status on trip advisor.", "title": "Great views, good food, just a few more things would have made it excellent", "helpfulness": 1, "user": "g12doc", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152935091}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This is the third time we stayed at Rampsbeck in the last year and we have really enjoyed every visit. This time our room was Mell Fell and it was superb, a large room, comfy bed, with a well equipped bathroom and lovely views across the Ulswater. As usual the staff were friendly and helpful and the food was quality. The walks around the grounds and surrounding area are a great.", "title": "Stunning hotel", "helpfulness": 1, "user": "AnnyMay", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152894582}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We were looking for a beautiful location, great service and good food. We found it :)", "title": "Excellent location, just a few things...", "user": "JerriHT", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152745089}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The food, like so many others have said is great. The lobster pasta dish my partner had was incredible, rivaling the lobster dish we had at a 3 michelin star restaurant a couple of weeks prior.", "title": "Nothing is too much trouble and beautiful views.", "user": "lubman", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152039443}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The suite we stayed in was very large & the bathroom exquisite.", "title": "Avoid Room 17", "helpfulness": 2, "user": "Jan S", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 151996709}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We felt at home here, very relaxed and welcomed.", "title": "Just as good as our visit in June", "user": "excraftybakers18", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151944695}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Just a few things would have made this stay perfect- The hotel was closing the week after our stay for their yearly maintenance & I'm sure if we had come after this our room would have felt more 'loved' unfortunately when we stayed it did feel a little worn around the edges. Also although there were numerous attempts to fix the WiFi we never had internet in our room.", "title": "Fantastic welcoming Hotel", "helpfulness": 1, "user": "Countrylassie_11", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151903318}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 11, "very good": 44, "terrible": 1, "excellent": 345}, "aka": "Rampsbeck Country Hotel", "slim_ranking": 0.5, "description": "Rampsbeck has welcomed guests as a Hotel since 1947. From the word 'go', Rampsbeck was the best of Hotels, spoiling guests with the finest of four star decoration and luxury."}