{"user_rating": 4.5, "review_count": 30, "name": "Rappeport Guest House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Tsfat is a beautiful part of Israel with quaint narrow roads and paths and an incredible Jewish history. we stayed in Lauries B&B for our stay in Tsfat. Laurie was very helpful and accomodating. The room was clean and quiet. A definite must to contact if you are lucky enough to visit beautiful Tsfat", "title": "Rappeport B&B", "user": "stacoh", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87705291}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We searched for a place dowtown Safed during the Klezmer Festival (two nights). We foud the Rappeport Guest House in the internet and we booked by e-mail.", "title": "Very disappointing experience: unsecure", "user": "VMSanchez", "date": "November 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 87291539}, {"rating": 5.0, "title": "Rappeport Guest House", "text": "The experience in this guest house was awful. Let me explain myself. The place is the basement of a house formed by two rooms and a tiny bathroom. The rooms, especially the place where the bed is, were extremely dirty. It smells very intensove to dog (it should be where the two dogs stay if guests are not using it) and it was full of dog-hair. The dust was everywhere (just take a look to the lamp).", "helpfulness": 1, "user": "sabazian", "date": "July 4, 2009", "id": 33899016}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "What a gem. Nothing fancy, just a clean room with one incredible amenity, Lauri. She arranged for shabbat dinner, hosted a shabbat luncheon, invited us to a community Purumspiel, arranged for a private guide and much more, she became our friend. She knows everyone in Tzfat, and everyone seems to know her.", "title": "If you really want to know about Tzfat, this is the place to stay.", "helpfulness": 1, "user": "Nancy_and_Dennis", "date": "April 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103188980}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We spent four nights at the Rappeport House. It was a great way to learn about Tzfat, Galilee, and Israel We can't imagine going to Tzfat and staying any other where else.", "title": "friendly, cozy attractive home in Safed", "helpfulness": 1, "user": "savtasue", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98457721}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed at this delightful zimmer for over shavuos and wished we could have stayed longer. Our room was cozy, clean and attractive with a small bathroom and a second, smaller bedroom that we used to store our bags. We ate most meals at a table in the quiet garden of this residential neighborhood. The price fit our budget and the ambiance fit our needs. Even better than all that was Laurie's attentiveness to our needs. She worked hard to help us find services for the second day of Shavuous -- not an easy task in a place where just about everyone observes just one day. She helped us find a seudah and a place to study in English at night. She even brought us a piece of cheesecake she had made. As far as I'm concerned, she made her home in Safed our home, too.", "title": "Charming respite in Tzfat", "helpfulness": 1, "user": "sarimalia", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 88056557}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "A great space just outside of the hustle-and-bustle of the artist's colony in Tzfat (but only a 4 or 5 minute walk to the heart of it). Near restaurants and shops, beautiful views, and interesting historic sites. (Laurie can certainly provide recommendations for some places to wander on your own, and possibly even recommend a guide, if that's your thing.) Laurie was unbelievably helpful, and even let us borrow her iron to tidy up our shabbat clothes, which were a bit wrinkly from three days in backpacks.", "title": "secret getaway in the heart of Tzfat", "helpfulness": 1, "user": "unis24", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87961152}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The space itself: bedroom with comfy full/queen bed, another small bedroom if necessary, private bathroom and shower. There's a mini-fridge (perfect for storing snacks for shabbat) and the space has its own private entrance.", "title": "Comfortable rooms, perfect location", "user": "RehabMD", "date": "November 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87707502}], "location": {"country": "Israel", "continent": "Middle East"}, "variance": {"poor": 1, "average": 2, "very good": 4, "terrible": 1, "excellent": 22}, "aka": "Rappeport Guest House Safed, Israel - Galilee", "slim_ranking": 0.166666666667}