{"user_rating": 3.0, "review_count": 41, "name": "Ras Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "We stayed in a renovated room and it was really nice and comfortable. The price is very reasonable, given the overall quality of the service and the excellent location. The breakfast is very good. The premises are outdated, but I didn't find that a problem.", "title": "Great hotel in the center of Addis Ababa", "helpfulness": 1, "user": "Penitent", "date": "February 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 56019628}, {"rating": 3.0, "title": "Good if you just need to \"get away\"", "text": "Best hotel I have ever stayed in Addis Ababa for the last 10 years.", "user": "A TripAdvisor user", "date": "December 10, 2009", "id": 51028596}, {"rating": 1.0, "stay_parameters": "Stayed November 2009", "text": "Good location if you are going out or are familiar with the city. Buffet Breakfast included. No Foreigner rate- popular with Ethiopians and NGO's. Food is decent and not \"overly\" overpriced-but it's not the Sheraton or the Hilton. Nice Patio and hot water/generators available. It shields you from the electric and no water days as best as possible. Quiet enough for sleeping. A bit run down compared to other RAS hotels.", "title": "Really not worth it", "helpfulness": 2, "user": "corvid", "date": "December 4, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 50611848}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I stayed there with a small group. We got the manager of our tour company to contact them on our arrival day and request that all the rooms has hot water and that any water heaters be switched on - we had been camping in Awash and had a tight schedule on the night we arrived in Addis. About half the rooms had no hot water, and it was clear that nobody had done anything about checking to make sure they had. Maybe this was in part due to the fact that they could not get into the rooms in the first place as some of the key cards were not working. These were their 'new' rooms.", "title": "Perfect location, clean and big, but state-owned", "helpfulness": 3, "user": "kalmyk", "date": "November 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 21528685, "likes": {"liked": "— room availability and cleaniness", "disliked": "— no caracter but what the heck"}}], "location": {"country": "Ethiopia", "continent": "Africa"}, "variance": {"poor": 6, "average": 20, "very good": 10, "terrible": 3, "excellent": 2}, "slim_ranking": 0.521739130435}