{"user_rating": 3.5, "review_count": 52, "name": "Ravesi's Hotel Bondi Beach", "reviews": [{"rating": 1.0, "title": "Ravesis", "text": "Arrived in Sydney from Singapore and met with some friends in Ravesis. The bar has a contemporary feel to it. The bar was very busy; standing only and very noisey. There was an overall lack of friendly atmosphere. I asked for a bottle of champagne to celebrate my arrival and was stunned that the young barman said I was too drunk to serve. I hadn't even had a drink and couldn't figure out why he was saying this. I can only put it down to my strong Glasgow accent and he didn't understand me!! Anyway, he asked the doorman to ask me to leave - my friends asking him to understand I was not drunk. I asked to speak to the doorman alone and after seconds of talking to him he said 'your not drunk', he then spoke to the barman and I was served. What a rotten welcome to Sydney, rotten attitude from the young lad. I will not be back here and would choose the many other bars in the area for better prices, atmosphere and service.", "user": "flyby21", "date": "February 4, 2007", "id": 6744774}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I stayed at the hotel as the first stop in Australia on our honeymoon. We`thoroughly enjoyed our stay. The hotel staff were pleasant and accommodating and prepared our room for us quicker than expected.", "title": "Great, relaxing stay", "helpfulness": 1, "user": "Piet_van_Gelder", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6556472, "likes": {"liked": "— Cool atmosphere, size and comfort of rooms", "disliked": "— No breakfast service"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006", "text": "The room itself was a split level room with a view of the beach. It was tastefully furnished (whoever said Ikea obviously doesn't shop there as the furniture is high quality bespoke fitted units) and very large with its own living space and balcony. By contrast with many other hotels in Australia they also offer free wifi access which was a great bonus.", "title": "Disappointing. Ravesi's over promises and under delivers", "helpfulness": 1, "user": "ScottishIan", "date": "November 12, 2006", "detail_rating": {"value": 1.0}, "id": 6109763}, {"rating": 4.0, "title": "we loved ravesis", "text": "It is clear that the refurbishment was done a few years ago but the room still had a quality feel to it (for example the bath suite was Villeroy & Boch) and the price charged was not excessive compared to other hotels that we stayed in.", "helpfulness": 1, "user": "sarahg_mattl", "date": "November 8, 2006", "id": 6085474}, {"rating": 2.0, "title": "avoid", "text": "The restaurant is lively with good food and service and the bar is always packed. Bondi Beach has a different atmosphere to staying in central Sydney - far more relaxed and chilled out with lovely cliff top walks - there is no doubt that Ravesi's is one of the best hotels in Bondi.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 23, 2005", "id": 3606727}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "Almost passed on this gem due to the so-so reviews on this website but the weakening Aussie dollar encouraged us to take a gamble, and I'm so glad we did!!! The We booked a side-view room for about $160 US per night ($240 AUS) from November 25-28, 2008, on www.wotif.com. The whole experience was fantastic from check-in to check-out. We got here a tad early and were cheerfully allowed into our room. The room was enormous, by boutique hotel standards anyway, well-appointed, and had with balconies and a side- view of the beach and complimentary bottles of Voss water. The bed linens were pristine white and the furniture dark wood. The bathroom was sparkling white and included a tub (the longest hotel bathroom tub I have ever seen). The bathroom was pretty simple and won't win any design awards but anyone who faults it is just being fussy. Plus, bonus points for a floor so clean that you can eat off of it. The room was perfect. The hotel is literally across the street from Bondi Beach and very easy to access from central Sydney or the aiprot - just take the subway to Bondi Junction and then either the 380, 381, or 333 buses - the buses stop right by the hotel. The only con, I guess, is the noise - the hotel contains a lively bar and restaurant and is facing a busy street, so if you need pin-drop silence to sleep you might be annoyed. We didn't mind it at all, though - it's a small price to pay for being On. The. Beach. Plus, when it's quieter, you can actually hear the waves. The rotating cast of young front desk clerks were uniformly friendly without overdoing it and extremely helpful (shout-out to the adorable night clerk who went out of his way to help us). No attitude to be seen anywhere. The first night, we ate at a little Greek restaurant on Campbell parade called Nikos that served the best spaghetti with clams I have ever had in my entire life. Incredible. The second night, we headed out to the Flying Squirrel tapas bar a little further out - also excellent. The final night, we splurged at Ravesi's restaurant, which was outstanding - we booked beforehand and were given the best table ( corner, facing the ocean) and faultless service. We were a little unlucky with the weather during our stay on Bondi, but still managed to have a great time, probably because we stayed at Ravesi's.", "title": "Ignore the so-so reviews! This place has stepped up its game!!", "user": "PT1976", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22292696, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Having been told Ravesi's had undergone a major refurb we booked 2 nights in a slpit level room for 2 adults & 2 children.", "title": "chic boutique Hotel by amazing Bondi beach", "helpfulness": 3, "user": "40ishcouple", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13998404, "likes": {"liked": "— room size, decor and location", "disliked": "— bathroom is down stairs from other areas - only weird in the middle of the night"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We were pleasantly surpised by the size of the room - an open terrace and lounge area included - the decor is funky and included a KING size bed and it was remarkably quiet, given we are on top of one of the busiest bars/restaurants in the area.", "title": "Avoid At All Costs", "helpfulness": 3, "user": "VSSL", "date": "May 11, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 1.0, "value": 1.0, "rooms": 1.0}, "id": 7588236, "likes": {"liked": "— I did not like anything about it", "disliked": "— The noise and people"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "An outside room would have a balcony but I would imagine the noise from the street and the bars would be a factor.", "title": "Enter at your own risk!!!", "helpfulness": 2, "user": "reggie246", "date": "April 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7477849}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The service was brisk but efficient and the rate represented good value for money, especially for 4 of us. The write up in this months Gourmet Traveller was very accurate.", "title": "Good looks, good atmosphere, but service sucks", "helpfulness": 1, "user": "johnfre", "date": "April 8, 2007", "detail_rating": {"front_desk": 3.0, "value": 1.0, "service": 1.0, "business": 1.0, "location": 5.0}, "id": 7292421, "likes": {"liked": "— Nice location, nice looks", "disliked": "— Racism"}}, {"rating": 4.0, "title": "Loved It", "text": "Stayed at Ravesis April last year after 3 weeks of 'roughing it' it was a little piece of heaven!, we had the cheapest room which was really comfy, bar is packed at night really good atmosphere, and just over the road from the beach - what more could you want! - would definately stay here again!", "helpfulness": 1, "user": "helsbells1980", "date": "February 22, 2005", "id": 3220125}, {"rating": 1.0, "stay_parameters": "Stayed January 2005", "text": "Having seen Ravesi's listed in Wallpaper and other such authorities on \"cool\", I was expecting a fantastic boutique experience. I am a big fan of boutique hotels in general.", "title": "Big disappointment - Ravesi's", "helpfulness": 20, "user": "nknyc", "date": "February 1, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3105571}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 6, "average": 9, "very good": 13, "terrible": 9, "excellent": 15}, "aka": "Ravesis Hotel Sydney", "slim_ranking": 0.333333333333, "description": "Ravesi’s Hotel is found on the doorstep of the beautiful Bondi Beach, it is the only boutique accommodation in the suburb; set above our award winning Drift cocktail bar and thriving street side bar, approximately twenty minutes from Sydney Airport and Sydney CBD, Ravesi's Hotel offers all the ingredients for the perfect getaway. Stay in one of the hotel's 12 individually styled boutique hotel rooms, indulge with fresh and innovative cocktails at Drift cocktail lounge, explore local and international wines in the Wine Bar, dine on the diverse Modern Australian & Australasian cuisine, and when the sun goes down, get ready to play! Ravesi’s offers monthly book & wine clubs, as well as weekly social events."}