{"user_rating": 4.0, "review_count": 149, "name": "Real Fini Via Emilia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "The hotel is a business hotel. The rooms are wood paneled and organized tightly regarding space. The location is near the medical school, not near town. The centre of the city is ½ mile away and you really need to take a taxi or drive. The other sites in Modena like Ferrari Museum also require a car. The hotel serves an excellent breakfast but no other meals on site. There is a restaurant next door for lunch and dinner which is excellent. Internet is only available in the lobby by paid WiFi or use of the hotel computer (5E for your entire stay).", "title": "The hotel is a business hotel.", "helpfulness": 1, "user": "MarianaG", "date": "June 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3535286}], "location": {"country": "Italy", "region": "Emilia-Romagna", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 34, "very good": 59, "terrible": 2, "excellent": 44}, "aka": "Real Fini Via Emilia Modena", "slim_ranking": 0.189189189189, "description": "Located approximately one kilometer from the historic center of Modena, the Hotel Real Fini Via Emilia is located about 10 kilometres from both the Modena North and from the Modena Sud Motorway Exit. Easily accessible both by car and by public transport, it is the ideal solution for those who want to enjoy the city and have the confidence to reach the hotel without any difficulty. The hotel has ample parking and underground garage reserved for guests.The Hotel Real Fini Via Emilia has always been a reference point for those who stay in Modena for business or pleasure, has 85 rooms including double single use, doubles and junior suites. All rooms are soundproofed and equipped with minibar, 32 \"LCD TV, safe.The rich buffet breakfast and free Wi-Fi are always included in our rates, and at our Guests’ disposal there are also the American Bar, the Fitness Room and the Aesthetics and Wellness center where you can make beauty and wellness treatments from 06.00 to 23.00.The first floor of the building houses the conference center made of nine Meeting Rooms, all with modular retractable walls, whose total capacity is 500 people. The technical equipments are the last generation and can be implemented on request.The Hotel has no restaurant à la carte, catering for groups or events must always be defined in advance, but our staff will know how to direct your guests to the Restaurants in agreement within the range of 150 meters from the hotel offering diverse types of national and international cuisine.Choose the Hotel Real Fini Via Emilia means to ensure the highest standard of service at competitive rates."}