{"user_rating": 4.5, "review_count": 152, "name": "Red Lion Inn Sacramento Rancho Cordova", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I am currently staying at this hotel on business, and am writing this from my room. I've been here for five days and, unfortunately, have another week to go. I don't have a choice but to stay here as it is assigned by my employer.", "title": "Avoid Like The Plague!!!", "user": "ccollman", "date": "February 20, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 56622746}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I don't know how old this hotel is, but it is extremely dirty and not well maintained. The rooms have a dirty smell, the bathroom has black mold growing along the edges of the tub and around the sink, the tub mat is peeling up and has jagged edges, the bathroom door won't close or latch properly and the window won't shut all the way.", "title": "\"King\" Beds apparently a foreign concept at this hotel!", "user": "WittyL8dy", "date": "January 16, 2010", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 53626358}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "As far as service ... housekeeping has missed my room twice in five days and Carol at the front desk just tells you that you have to go get your own towels. She has never apologized once or seemed like she cares. The coffee pot hasn't been cleaned once ... NOT ONCE ... in five days. I ran out of toilet paper the second day and had to go get another roll from the front desk. The same dead bugs and scraps of paper have been on the floor since I got here five days ago indicating that they don't vacuum.", "title": "adequate place for one night", "user": "TBegay", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 17704630, "likes": {"liked": "— the price we paid", "disliked": "— noisy A/C and disappointing breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Upon my return tonight, I smelled the strong odor of marijuana throughout the hallway on my floor (third floor).", "title": "Nothing Special Freeway close", "user": "dcozad", "date": "March 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 14201845, "likes": {"liked": "— Close to office and pretty cheap", "disliked": "— Moving rooms to get a clean and working one"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Several of my colleagues also staying here have relayed similar stories.", "title": "Great place to stay at a reasonable rate", "helpfulness": 1, "user": "kori", "date": "August 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8277860, "likes": {"liked": "— great room for a great price"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I selected the Vagabond Executive Inn for its location to the activities we had planned to do in the vicinity of Ranch Cordova. It was an excellent choice. The check-in reception was easy and friendly. Our room was very well appointed and also very clean. The morning breakfast room was very adequate and provided a good selection of breakfast items. I also appreciated the use of a computer with internet access. This facility was one of the best overall during our trip to Central CA.", "title": "More than Adequate Accommodations", "helpfulness": 4, "user": "MrIVV", "date": "July 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8052538, "likes": {"liked": "— Computer with Internet Service", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "Orbitz rates this hotel as a 3-star. Far from it. Borderline 2-star. Assigned room had no TV even. Fiddled around with room heater for 30 minutes to get it to work. What should have been sealed items were opened -- shampoo, soap, sugar and creamer for coffee. To top it off, 3 \"guests\" stood outside my room smoking and talking. After hearing every work (despite turning the radio up) and inhaling the smoke for an hour, I asked management to intervene. Waited another 45 minutes before they left -- of their own accord or otherwise.", "title": "What a dive!", "helpfulness": 4, "user": "cgusta", "date": "December 2, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6318126}], "location": {"country": "United States", "city": "Rancho Cordova"}, "stars": 2.5, "variance": {"poor": 7, "average": 4, "very good": 39, "terrible": 5, "excellent": 97}, "aka": "Red Lion Inn Sacramento Rancho Cordova Hotel Rancho Cordova", "slim_ranking": 0.111111111111, "description": "The Red Lion Inn Rancho Cordova is conveniently located just off Interstate 50 adjacent to the Rancho Cordova Business District in Rancho Cordova, CA. This puts you right near companies such as Bank of America, Sutter Health, VSP, Dignity Health, Franklin Templeton and many other major businesses. In the morning, enjoy our complimentary Roaring Start Breakfast Buffet that includes hot and fresh options such as egg items, waffles, fresh fruit, breakfast meats, cereals, yogurts, pastries and bagels.Our newly renovated 104 guest rooms are full of thoughtful amenities, including a well-lit work desk, a flat screen 42\" TV with free cable including HBO, microwave, refrigerator, iron, ironing board, and hairdryer. And we'll make your business travels just a little bit easier by providing complimentary wi-fi, free local calls and a convenient fax service. At the end of a long day take a swim in our heated outdoor swimming pool, practice your swing at our putting green or try a game of ping pong by the pool. Red Lion Inn Rancho Cordova is in close proximity to just about everything in the center of the Greater Sacramento Region and you get to experience every season. We are just 15 miles from downtown Sacramento, 8 miles from Folsom, 6 miles from Sacramento State Aquatic Center and 7 miles from Folsom Premium Outlets.The hotel is close to the American River Parkway, Lake Natoma, and Folsom Lake which allows for rafting, kayaking, rowing, swimming and enjoying the sun in all aspects of summer. The mountains in Tahoe are about two hours away from world class ski resorts. Don't forget about the historic Nimbus Winery. Make your way through the mom and pop shops while taking in a game of glow-in-the-dark mini golf and a visit to the old winery's cellar. The Mather Airport and sports complex are two miles from our hotel as well as Mather VA Medical Center. We are a short distance away from the world class equestrian centers including Rancho Murieta Equestrian Center, Brookside Equestrian Park, Leone Equestrians and Starr Vaughn Equestrian Center."}