{"user_rating": 3.5, "review_count": 371, "name": "Red Roof Inn Seattle Airport - SEATAC", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I had a really good experience at this motel. The staff was very friendly. The room was really big and clean. I would definitely would recommend it.", "title": "Very Nice Stay", "user": "msjarv", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124234421}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My husband and I broke up our travel on our way to Hawaii. We stayed here just for one night. We arrived around 5pm, left around 5:30am. Shuttle service was prompt, room was clean, and Denny's was within walking distance to grab an inexpensive meal. Staff was friendly and very helpful! The shuttle is shared with another hotel (Holiday Inn I believe) so look for the Red Roof Inn logo on the wind shield!", "title": "Great for what we needed!", "user": "jmp572", "date": "January 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123921528}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Hotel is old, but they keep it in great shape. You get a huge room, very clean, everything you need in the room except for fridge, free shuttle service to the airport. Very friendly staff. Just the internet was too slow, but at least for free.", "title": "Perfect for waiting for a flight!", "user": "IroMac", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123137616}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The service was excellent - all the people behind the front counter were welcoming and super-helpful! The room was clean and larger than most budget hotel rooms. The bed was comfy. I really liked the pillows. Wi-fi worked well. The exercise room (two treadmills and one creaky elliptical) was serviceable. The shuttle runs every 20 minutes to/from the airport. There is a decent Asian restaurant two buildings down the road. I'd definitely stay here again!", "title": "Excellent bang for the buck!", "user": "Vivianne G", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122920827}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Room was supposed to be non-smoking. However, it was smoked in so the room had been over perfumed with some kind of fragrance that made me physically ill. The window was wide open trying to air the room out and it was 39 degrees outside. We had a reservation for a king bed in the back away from the street and airport. They only had two queens left when we arrived. I would only recommend staying here if you are someone who can sleep anywhere and have low standards for hotels.", "title": "Don't get what you ask for here...", "helpfulness": 1, "user": "Sheilah C", "date": "December 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 121899818}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Basic clean hotel, two minutes from airport, 2 minutes from rental car terminal. Free parking, 5 minutes walk to Denny's for great breakfast, nice Chinese less than 5 minutes away. Free shuttle. Gave lots of ideas for activities to do around Seattle.", "title": "Adequate Hotel for Airport transit", "user": "56Anna56", "date": "October 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 179614680}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We booked the Red Roof Inn at the airport, the night before we were boarding a cruise ship. I wish we had stayed in town instead. When we landed at the airport, we had a hard time getting the shuttle. The phone number that we had been given by Cruise.com (who booked the room for us) kept giving us a rapid busy signal. Some other travelers said they could not get through either. When we first called the hotel number to get the shuttle, they told us to call the shuttle number again but on the second call to the hotel they got in touch with the shuttle for us. The hotel was okay, but there was no breakfast and we had to pay to use their computer in the lobby.", "title": "Close to Airport", "user": "KathyJ26", "date": "October 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 179571440}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "We took the light rail into town the evening before our cruise. It was a 5 min. walk from the hotel, but the road was very busy. If I were doing it again, I would stay in town the night before our cruise. We returned to the Red Roof that evening by light rail. The shuttle to the cruise ship picked us up on time and got us to the cruise port .", "title": "A nice surprise...", "helpfulness": 1, "user": "MGBIndonesia", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179452366}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Only because of the favorable reviews at TripAdvisor and Agoda did I risk an overnight here following a long transpacific haul from Thailand to Seattle via Seoul. Frankly, I wasn't expecting much more than a reasonably clean room and a moderately comfortable bed. In fact, what I got was a spacious accommodation with all the amenities previous reviewers have described. The heater/air conditioner was the quietest window unit I have ever encountered in a motel. I am a light sleeper, but during the night I never heard a sound--either from next door or in the heavily carpeted corridor outside.", "title": "Cheap, clean and overall great hotel", "user": "ZaraAndy", "date": "September 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "location": 3.0, "service": 4.0}, "id": 178454234}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I mention one caveat. A nearby Holiday Inn provides shuttle service for the Red Roof as well--something not well advertised. Accordingly, if you are looking for a Red Roof van, you might very well miss your ride! It wouldn't occur to most travelers that two different hotels would double up on the transportation. Worse, at the shuttle station is a bank of phones enabling a traveler to call for pick-up. The Red Roof line never responded to my several calls, and their voice mailbox was full. No way to leave a message...", "title": "Deploying_USAF", "user": "USAF_en-route", "date": "September 22, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 178192421}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I was traveling with a group that booked several rooms in this hotel so I'm not sure on what price we paid for the rooms (sign outside was advertising $69.00/room). You get what you pay for here - the rooms were decent (if a little large for what was in them - lots of space for luggage or even another bed) and clean. I noticed a few narrow places where it looked like they couldn't get the vacuum in very well but the bathroom was great and the sheets and bedding were clean. Service was excellent and the front desk got us settled very quickly and even offered to provide us with shuttle service to a restaurant if we needed it (we decided to walk).", "title": "Decent Budget Hotel", "helpfulness": 1, "user": "tripjimbc", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125530916}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I slept fairly well (although others in our group did not). The bed was \"firm\" and had the feel of being a solid budget mattress (no pillow top here but not sagging either). The pillows were OK - I like flatter pillows and these were pretty puffy but not super firm so they flattened out nicely. My only complaint would be the sheets and blankets - the sheets seemed pretty thin and had a worn feel to them, the blankets were obviously fairly low quality polyester. But for the price wasn't expecting more - for an overnight budget trip or a night before a flight they were fine. Room was cold when we arrived (heat not on) but warmed up pretty quick. No problem with noise from other rooms or flights.", "title": "More Like Red District Inn", "user": "Callie b", "date": "February 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 124531691}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Bathroom looked like it had had a basic Bathfitter's reno with a few extra touches. My only complaint was the complimentary soap and shampoo - really didn't smell too good, kind of a Dollar Store feel and smell to it. Make sure to bring your own!", "title": "Outstanding Customer Service", "helpfulness": 2, "user": "newengland4me", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124524948}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Wireless was excellent - had no problem connecting with my MacBook. Great signal and good bandwidth. Other facilities like the business lounge (?) and the fitness room were pretty basic. Don't book this hotel solely for the fitness room as you'll be very disappointed : ). Coffee only in the morning, no continental breakfast.", "title": "Bad from the start", "user": "quiltygirl52", "date": "February 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 124523983}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Several restaurants nearby within walking distance. We ate breakfast at the Denny's a couple of blocks down and had dinner at pub further down.", "title": "Good value", "user": "gnw69", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124304030}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I was only staying there 1 night in order to catch an early flight the following morning. The staff was efficient, the room was clean and quiet, the wake-up call was precisely when I wanted it, the free shuttle service was on time. These were the important things for me. I didn't care that there was no microwave or frig as I didn't need to use either and was happy not to pay for amenities I was not going to use. The small coffee maker in the room didn't work but there was coffee in the lobby, it was no big deal. I would DEFINITELY stay there again. It was great value for the money.", "title": "Good Value/Reliable", "user": "Helen M", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120575786}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "I booked this hotel through priceline as part of my first trip to Seattle. The location is perfect. It's right across from the airport and right near the train into Seattle. The rooms were spacious and I had a balcony (not exactly a great view but I wasn't staying in the Alps). There's tons of places to order food from in the area. The staff was great. The girl at the front desk (cant remember her name it was a different name she had glasses) was extremely helpful and very personable. She gave me tips on what to see and avoid in Seattle. I will specifically book this hotel on my next trip to Seattle.", "title": "Great place to stay if you're planning on seeing Seattle.", "helpfulness": 2, "user": "paulyv24", "date": "November 10, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 120432806}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "My friend and I stayed here for one night, after our flight from the UK. The hotel offered a free shuttle service that you call from the coach station outide of SEA-TAC airport on a free phone. The shuttle came to pick us up within 10 mins of calling and dropped us off at the hotel. Exellent service!", "title": "A nice suprise!", "helpfulness": 1, "user": "IlovePibb", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120412201}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Checking in was quick and professional. Staff were friendly. We had prepaid for our room in advance of our stay, but were pleased to have our i.d. checked to ensure our booking. The room was huge, with two double beds! Perfect to sleep off our jet lag. The room very clean and quiet. We had a fridge, microwave, hair dryer and ironing board and iron. There was also free hot drinks (tea/coffee) available in the lobby area. The free wi-fi was a bonus too! To be honest it far exceed our expectations for an airport hotel.", "title": "Clean, quiet & close to the airport with free shuttle", "helpfulness": 1, "user": "goodtoglow", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120346907}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The hotel is close to a petrol station / supermarket and also to a Denny's, which was convienient. This is not a luxery hotel by any means, but if you are looking for somewhere clean, quiet, has great facilities and is value for money then this hotel is a lovely suprise. We would definitely stay here again, if we were to come back to Seattle!!", "title": "Red Roof Inn Seattle Airport", "helpfulness": 1, "user": "HawaiianWoman", "date": "November 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120116944}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had 2 days before our cruise to Alaska and stayed at the SeaTac airport location. Staff was friendly, rooms were clean and it was a short walk to Denny's for breakfast and just another couple of blocks to the train for downtown Seattle which we used twice for $3.50 round trip each. What a deal. Would use this again on a return trip to Seattle", "title": "Great location", "user": "Lin337", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178192270}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Arrival 4/5 - they emailed me instructions of how to find the courtesy bus. The instructions were spot on, but it are also well signed inside the airport. Check in was swift and friendly", "title": "Convenient for the airport", "user": "NeilandBarbara", "date": "September 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178182905}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Room 4/5 - a very large room with a large separate bedroom area. They called it a Superior room. Large flat TVs, sofa, desk with chair, iron & board, fridge, microwave, tea/coffee machine. Plenty of storage space and good aircon. Reasonable speed free wifi.", "title": "Room for a good price", "user": "Alicia T", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177997246}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Bedroom 4/5 - nice size separate bedroom with king bed", "title": "Near the airport", "user": "KBR99", "date": "September 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177829185}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Bathroom 2/5 - a good size with full size bath and shower above. Hair dryer. The bin had not been emptied by housekeeping when we arrived in the room!!!", "title": "Nice and Close", "helpfulness": 1, "user": "Chief_K_USAF", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177654947}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Fresh paint in the public areas, updated rooms make the RRI at SeaTac a very nice place to stay. Newly painted fresh updated rooms, very comfortable beds, free wifi, flat screen TV, very nice clean bathroom, fridge, microwave make the stay at this hotel enjoyable. No breakfast in the morning, coffee available, and an added bonus of a computer in the lobby, but the minus to the computer is that you have to pay to use it, so I past on this feature and walked to a hotel where I could print for free. Also a complimentary shuttle from/to the airport. Staff is very friendly and helpful. If you want to go into Seattle, a bus stop at the door which will take you to the nearest light rail line station Tukwila.", "title": "Updated review", "user": "yvr1", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180633741}, {"rating": 4.0, "title": "Better late than never", "text": "I just got on tripadvisor and I have been writing reviews of some of the hotels I have stayed at.I actually stayed here in September of 11.I remember having a great stay.The people at the front desk were friendly and attentive.The room was clean and everything worked well.The shower could of used a little more speed, but, it worked. The bed was comfortable and was able to sleep well.I stayed there Friday through Sunday. It was important to get good sleep that weekend. On Monday I had to get a cab, go to the Greyhound terminal and go out to Ellensburg to pick up a truck that had been repaired and then drive it to Tulsa, Ok, before flying from Tulsa back home to the Detroit area. The one big bugaboo is the parking. It is extremely tight.For work I was driving a pickup with a camper unit so there was no way I could fit in the parking deck.I had to park with half the truck on an abutment.If the owners of the gas station right outside were to sell their property, Red Roof would be very wise to buy and expand the parking lot.Overall had a great stay", "user": "Michael M", "date": "October 10, 2013", "id": 180519343}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Well, try the Red Roof if you're flying out of Sea-Tac. They provide a shuttle if you need one, or in my case they are really close to the new rental car return facility and I tend to worry about getting lost, or getting stuck in traffic. Here, that is almost impossible.", "title": "Need to be close to the airport?", "helpfulness": 1, "user": "DWG6392", "date": "October 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179756266}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This was my 7th night in a hotel/motel in a row, in 3 different states. I was tired and need to get a good nights sleep before an early flight back home. This place provided that, at a reasonable price. The coffee isn't the freshest, but it is free and at 0500 I needed a cup.", "title": "Nice Clean and Comfortable", "helpfulness": 1, "user": "Connie W", "date": "October 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179731354}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I was surprised that a king size room wouldn't have a bath tub, it did but they had fixed so that you couldn't use it as a tub, just a place to stand for your shower. I survived. The room was clean, the bed comfortable, for my purposes it worked out just fine. I've stayed here before, I'll stay here again.", "title": "Great Value", "user": "Gwenhwyfawr", "date": "October 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179726291}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Stayed here in November for the 2nd time using the Park and Fly option. The room was quite nice and very clean. We used the Denny;s coupon they gave at checkin for dinner - very nice. The shuttle was on time both dropping us off and picking us up 19 days later. The shuttle driver who picked us up suggested a different route north to Vancouver as we would be in rush hour traffic. I think he saved us at least 30 minutes.", "title": "Great place to park and fly", "helpfulness": 1, "user": "molly2kit", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121719386}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Will certainly stay here again.", "title": "Beyond Fantastic Service", "user": "Brooklyn C", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121685013}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I stayed here for a dancing conference and was late one morning. The shuttle didn't arrive on time so the manager took me in his personal car! They were always super helpful. The rooms were clean and the beds were comfortable enough.", "title": "Ideal airport hotel", "user": "ArbutusIslandGirl", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121427406}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Want a fancy hotel with a full fitness centre, cocktail lounge, spa and a price to match? Look elsewhere (suggest the Fairmont at YVR). Need a good place to overnight before or after flying out of Seattle? Then this is it!", "title": "Reasonable, friendly, clean", "user": "seni0rtripper", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 120909888}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "-Free shuttle service to and from the airport.", "title": "Don't waste your money.", "helpfulness": 1, "user": "Paula W", "date": "November 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 120595265}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed at Red Roof Inn prior and post Alaska cruise. The shuttle to the airport was perfect; on time, clean, and friendly. The light rail to downtown Seattle was convenient, inexpensive, fast, and served our needs very well. Front desk was very helpful when we were there BUT when we checked out and left passports, cash, and travelers checks in the safe...They were way above any expectation. Tania called before I realized our items were missing. She shipped them by UPS immediately and then called to give us the routing number and when to expect them. Booking on line gave us a great rate, and then the customer service was the best. Thank you Red Roof Inn. We'll be back and send our fr", "title": "Just what we needed", "helpfulness": 2, "user": "EmilyH1969", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177543606}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Had a king room that had recently been renovated. Bed was comfortable and the room was clean. This hotel does not have a continental breakfast, but there is a Denny's that is walking distance. Hotel shuttle to airport was a great perk. Hotel employees were helpful and nice. Would stay here again.", "title": "Quiet and Close to SeaTac", "user": "pyanders", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177539435}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The red roof inn is quite conveniently situated relative to the airport. We found it convenient to return our rental car there and catch the shuttle back to the hotel. If you have a rental car, there are also gas stations next to , and near the hotel.", "title": "Convenient to airport but parking expensive", "helpfulness": 1, "user": "keltzar", "date": "September 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177351851}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "This property gets 4 stars from me because of what it offers for the price. Otherwise its 3-star generally..", "title": "Pretty Good", "user": "Greg H", "date": "September 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 176112848}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The place is recently renovated ... so the rooms are quite nice. My only grouse is that the parking is expensive so you need to make sure you add it to the price ($7+ per night I think).", "title": "Overnight staying", "helpfulness": 1, "user": "mcdas", "date": "September 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 175672767}], "location": {"country": "United States", "city": "SeaTac"}, "stars": 2, "variance": {"poor": 32, "average": 90, "very good": 145, "terrible": 34, "excellent": 70}, "aka": "Red Roof Inn Seattle Airport - Seatac Hotel Seattle", "slim_ranking": 0.441176470588, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}