{"user_rating": 3.5, "review_count": 157, "name": "Red Lion Hotel Lewiston", "reviews": [{"rating": 5.0, "title": "Spacious and clean", "text": "Our room was in the area called the Clearwater Tower and we were very pleased with the size and cleanliness of the accommodation. Comfortable king bed with lots of good pillows, good shower, microwave, refrigerator and acceptable lighting. But I have to say what put it to the top for me was simply the magnificent beverage center in the lobby which makes wonderful cappuccino and flavored hot chocolate. No need to stop at Starbucks for my morning fix.", "user": "CouleeCat", "date": "November 1, 2013", "id": 183168609}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The room was quiet for the most part, although you certainly could hear road traffic, we didn't, hear anything from the hall or other rooms. The blackout curtains were much appreciated in the a.m. after our late night/early morning arrival.", "title": "Horse show", "user": "Randi M", "date": "October 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182885867}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "That was the best red lion we stayed all year the front service was great and the food in the restraunt was excellent great room and service we especially loved the new cappuccino machine every thing was perfect.", "title": "Very Comfortable and Quiet", "user": "Tara M", "date": "October 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181722368}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We drove over from the Seattle area to pick up a vehicle. After 6 hours of driving in the 95-100 degrees even at 10pm, it was a breath of fresh air to walk into the hotel that was comfortable, not overly chilled. We stayed in the main area and our room was right next door to the elevators. Not once did we hear any noise from the elevators, even though their was a conference in town and the hotel was sold out. The room was clean, the staff was nice and the restaurant breakfast was very tasty. We would stay here again if we are stopping in Lewiston.", "title": "Stayed one night", "user": "Jgburke", "date": "October 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 179811167}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "We had reserved two adjoining rooms months in advance. Without notifying us beforehand we were denied adjoining rooms at checkin. This is a huge problem since one of us is handicapped. The hotel offered no explanation or recourse. Sad.", "title": "Very clean, comfortable and friendly hotel", "user": "chimpchamp", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178763632}], "location": {"country": "United States", "city": "Lewiston"}, "stars": 3, "variance": {"poor": 21, "average": 25, "very good": 51, "terrible": 15, "excellent": 45}, "aka": "Lewiston Red Lion", "slim_ranking": 0.166666666667, "description": "Located next to Highways 12 and 95 on the confluence of the Clearwater and Snake Rivers, the Red Lion Hotel Lewiston is only minutes from the Nez Perce County Airport via our complimentary airport transportation. The nearby Clearwater and Snake Rivers offer a wide variety of recreational opportunities including fishing and boating. Take a walk, run or cycle on our many miles of trails along the Snake River. World-class golf courses are also nearby and Hell's Canyon is just a short distance away via jet boat tour.Our 183 spacious guest rooms and suites feature all the amenities you have come to expect from a first-class hotel including oversized bathrooms, Red Lion's signature Sealypillowtop beds, Eco Fresh Environmentally Responsible Products (ERP), complimentary wi-fi, hairdryer, coffee maker, cable television with HBO, complimentary newspaper and valet and room service. All guest rooms are equipped with a microwave and refrigerator and offer sweeping views of the Lewis/Clark Valley, Clearwater River and the famous Snake River.On-site amenities include a full service fitness center, whirlpool and seasonal outdoor pool. For your dining pleasure, our Meriwether's Bar & Grill features Northwest and traditional American Cuisine. M.J. Barleyhopper's Microbrewery and Pub offers over 60 beers and our very own award-winning hand crafted ales. The atmosphere at the Exchange Lounge is perfect for a quiet conversation while enjoying fine wine, microbrews, cognac, spirits and premium food service.With more than 13,000 square feet of meeting and banquet space, the Red Lion Hotel Lewiston is also able to accommodate up to 900 guests for your next conference or special occasion. Whether your visit is for business or pleasure, Lewiston's Red Lion Hotel is committed to care, comfort and value."}