{"user_rating": 4.0, "review_count": 296, "name": "Red Coconut Beach Hotel", "reviews": [{"rating": 1.0, "title": "BIG DISAPOINTMENT!", "text": "Tsk tsk tsk... that's how I'll start my review. What a rip-off. If you are considering staying here (Red Coconut) - THINK AGAIN! The smaller 'sidestreet' resorts have better accomodations. If you can afford to stay at Red Coconut - you're better off spending your money else where - go parasailing. First of all, the room was sleazy - I can't even compare it to a motel. The sheets were dirty - we had to pour alcohol all over it. I didn't bother to use the blankets. Itty bitty TV. Disgusting bathroom - dirty toilet, clogged sink, the works! stains all over the place. Even the towels were way below acceptable standards. It was so raggedy that you're better off using your own clothes to wipe yourself dry. Breakfast buffet -----! You can tell that the spoon and fork was still dirty. The food was terrible! I hate this place. Don't ruin your vacation - trust me.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 8, 2006", "id": 5042197}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "What a rip-off!!! The room smelled bad.. The curtains were dirty, the toilet was dirty... and the sink was clogged... For the price we paid, we were expecting better rooms and service. The free breakfast buffet sucked!!! Really not worth the money!!!", "title": "Overpriced and Ewwwww Yucky", "helpfulness": 9, "user": "jhanki", "date": "May 5, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5034984}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "We were also attacked by mosquitos!", "title": "Don't try the crepes!", "helpfulness": 9, "user": "vanilla_bean", "date": "April 13, 2006", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 4971302}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "Note: This is a review only about the restaurant at Red Coconut.", "title": "Horrible Beds & Then Some!", "helpfulness": 9, "user": "MsTravelHag", "date": "November 30, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 4153661}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "I decided to have lunch at Red Coconut because I heard they served French crepes. It was Monday, around 11am and the outdoor dining area at the resort only had a few tables occupied -- I would say around 10% at the most. I ordered bottled mineral water and a crepe from the waiter and proceeded to read my newspaper. Around 20 minutes later, I hadn't been served anything. I reminded the waiter of my order, and he just told me it was \"coming\". Five minutes after my reminder, my water arrived. 30 minutes after I placed my order, still no crepes. The waiter started to avoiding any eye contact with me. A full 45 minutes later, a lady appeared behind the bar and finally started preparing the crepes which were served in about 5 minutes.", "title": "TRAPPED Should Avoid", "helpfulness": 12, "user": "cvcrna", "date": "November 19, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4126668}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "We stayed at the Red Coconut for 4 days and 3 nights for our honeymoon and it was unforgettable! We booked a seaview room at the 2nd Flr and it was simply amazing, the room has a King bed and a Queen bed, a sofa and a huge TV. The shower was clean. The room smells great and housekeeping always clean the room daily while we were out. We checked the Garden View rooms and they are not as great as what we had so thank God we booked the Seaview.", "title": "Honeymoon", "helpfulness": 4, "user": "LeilaniAllyn", "date": "January 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6711727, "likes": {"liked": "— The Room"}}, {"rating": 4.0, "title": "what a honey moon", "text": "The location is just right. It's at the border of Station 1 & 2 so it's just a few minutes walk to D'mall [shops]. It's also just a short walk to the night life at station 1. The resort is far enough from the noisy bars so you can definitely sleep well.", "helpfulness": 10, "user": "redtree1", "date": "July 30, 2006", "id": 5529373}, {"rating": 5.0, "title": "excellent service", "text": "Breakfast is good but there are flies around sometimes [gotta do something about it]. Room Service is very pricey. Staff is ok but quite detached.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 1, 2006", "id": 5414495}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "Over-all the place is Great!", "title": "OK place - Good AC - Food is fair - Clean pool", "helpfulness": 5, "user": "BayAreaMike", "date": "June 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 5398127}, {"rating": 2.0, "title": "Stayed in one of garden rooms, very quite. ", "text": "staff were excellent, manager was excellent, breakfast was very good, lunch was great, room on ground floor next to pool was clean and cool and water was warm for showers, the hotel made our stay uncomplicated and something we both will remember. thanks to all great hotel people.", "helpfulness": 7, "user": "TheHamiltons43", "date": "May 9, 2006", "id": 5044354}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Myself & friends stayed at the Red Coconut hotel, Boracay, in November 2007 for just one night during a weekend island hop-over from Manila. The hotel package we took included transport to Boracay (and to the hotel) from Caticlan airport located on a next island.", "title": "Basic nice small hotel", "helpfulness": 1, "user": "mijansso", "date": "April 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 14823812, "likes": {"liked": "— Location, service", "disliked": "— pool"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Upon arrival, we were met by transport staff who took us to a small \"trike\" type motorcycle that quickly took us to the harbour at Caticlan: From there on we took a typical Filipino trimaran-type boat accross to Boracay island (trip took about 15 min). Red Coconut is located smack at the White Beach shore, but nowadays the transport boats are not allowed to dock at White Beach (this is a good thing I feel), so instead we docked at the tip of the island. From there on a small van took us to the Boracay \"D'Mall\" and walked the rest of the way to the hotel. All this transport means that people with disabilities, fragile older people etc. need to forget about going to Boracay!! Infrastructure simply isn't there to support your visit, sorry.", "title": "nice hotel,shame bout the service,staff", "helpfulness": 3, "user": "ladette74", "date": "March 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 14034542, "likes": {"liked": "— location,theme", "disliked": "— staff"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2005, traveled with family", "text": "The hotel is a typical Filipino resort, meaning that it has very nice and friendly service & staff but only basic amenities. A small pool sits in front of the hotel: This pool is too small for any real swimming. Bar & restaurant facilities exist and are pleasant. Rooms were clean and spacious, but certainly not luxurious.", "title": "Bad service", "helpfulness": 2, "user": "Travellingisagift", "date": "November 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10903528, "likes": {"liked": "— bathroom clogged and the staff were not helpful", "disliked": "— staff"}}, {"rating": 5.0, "title": "Wonderful Experience!!!", "text": "One of the best/worst things about Red Coconut hotel is its location right at the famous White Beach and right next to \"D'Mall\" shopping area. Whether you consider this central location a good thing or not is completely matter or personal taste. The small, coconut-tree shaded path between the hotel and the beach itself is absolutely infested with quite pushy peddlers who sell watches, sunglasses and other trinkets.", "user": "michellebosquet", "date": "October 30, 2007", "id": 10445410}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "One cannot help notice how squeezed the hotels are behind the White Beach: Each \"mini resort\" has exactly maximum 30 - 40 meters of land (typically the width of the hotel), and the next similar mini-resort starts one meter away from the previous. The development of the area lacks any standards, and as a result there are lots of rooms, yes, but style, comfort and cosyness has been thrown out of the window a long time ago. A few large hotels plus some bungalow villages is all the island would have needed.", "title": "A Great Part of Our Vacation", "helpfulness": 1, "user": "mango_14", "date": "October 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10052304, "likes": {"liked": "— Rooms, foods, location, pool", "disliked": "— pool"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Well Just got back and i have to say I miss The Red Coconut! The staff were so nice and accomidating. This place is ony\\ly going to get better. the rooms are clean and the food is great. It has a great family feel to it. The beach is one of the most breathtaking in the world. Many beach activities if you want to do stuff like wave runners or island tours.. or my favorite.. lying on the beach..absolutely beautiful view of the ocean and neighboring islands.", "title": "Beautiful Beach", "user": "sjs1007", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 69368442}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "stayed at red coconut for 3 nights and enjoyed every minute spent there. walked towards stations 1and 3 and found red coconut to have the most homey, cozy, inviting feel out of all the other hotels. great staff!", "title": "red coconut rocks!", "helpfulness": 1, "user": "blahbah", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63455809}, {"rating": 5.0, "title": "Fantastic!", "text": "Top staff. Simply. Rooms are just fine - not luxuary, but really nice. Price level is good, including extra beds (1250 PHP/night). Good and positive mood amongst the staff - they love working there, and enjoy taking care of you. I wanna go back.", "helpfulness": 3, "user": "PerH4", "date": "April 13, 2010", "id": 61236577}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We greatly enjoyed our stay at the Red Coconut. Our accommodation was off the beaten path so our nights were quiet and dark - however guest can choose to stay in their beach front property and get a kick out of the all-night night life. The re-vamped bar is much improved and staff can manage large parties. Breakfast is buffet but you can order off the menu (best crapes and Philippino breakfast on the island - beef tapa, garlic rice and friend egg will cure any hangover). Attentive barmen, waiters and beach boys - get friendly with the staff (tip well and share lots of smile) and you'll be well taken care off.", "title": "Island Paradise!", "helpfulness": 3, "user": "SmallandBig", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60432577}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My husband and I visited Boracay for the first time and stayed in one of the beach front/pool front rooms on the ground floor of Red Coconut. We payed about Php 13,000 for a 3 day-2 night stay with buffet breakfasts (2), cocktail drinks (2), and free transfer to and from the Caticlan airport. The room was very clean and spacious for the two of us and had a small patio in front, toiletries were provided, foot wash bucket on every room (which I thought was cute), small flat screen TV, hot and cold shower, cleaning services and everything that you will expect in a US-based hotel. Red Coconut made my Boracay experience sureal. The staff was great, always smiling and very helpful. I didn't have to lift a finger or ask for anything because everything was done accordingly. We left two pairs of sunglasses in the pool area and was returned to us 10 minutes after we went inside our room by one of the staff before we even realized that they were missing. The transfer from the Caticlan airport to the hotel, which was arranged by the hotel staff, went smooth. The restaurant outside had a big cocktail bar that serviced customers from other hotels also. The Filipino-American food fusion was also comparable to the other restaurants in the area. They offer buffet breakfast (taste was good) for Php 400. The location of Red Coconut is in between station 1 and 2. Beachfront sand is clean, fine, and whiter than the sand in station 3. They have a little beach cabana for mani-pedi and massages just across from the hotel. They also have enough beach beds available for the guests and restaurant diners. I definitely recommend this hotel and will no doubt come back again.", "title": "Amazing experience", "helpfulness": 1, "user": "Joy84K", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59824669}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "Great location as this hotel is right in the middle of the action in Boat Station 2. Not for families or a romantic getaway but will perfectly suit nightlife denizens traveling solo. Very laid back atmosphere with a great bar by the beachfront esplanade from where you can hail one of the itinerant vendors for piping hot balut or penoy to go with your martini. The bartender even brings out a plate, napkins and cutlery when he sees you slurping that delectable nectar out of the duck's egg. When it's time to party, head out to Boat", "title": "Location, location, location", "helpfulness": 3, "user": "eidaromlaj", "date": "December 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 88816853}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Station 1 and go through Guilly's to cross the street to Cocomangas. Or head out the other way to boat Station 3 and choose a humongous tiger prawn being kept alive in aerated tanks outside Deja Vu, a newly opened music lounge that has a tropical/minimalist/zen vibe.", "title": "Best Bang for your Buck", "helpfulness": 1, "user": "jammie772", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82803058}, {"rating": 4.0, "title": "Reservations and \"The Family Room\"", "text": "Stayed at the Red Coconut - first time in Boracay. Nice, clean rooms. Free buffet breakfast with excellent service! Great location and great island activity booth right on beach. Only drawback was the constant barrage of vendors that line the main walkway in front of the hotel - it becomes very annoying - very quickly!", "user": "A TripAdvisor user", "date": "September 26, 2010", "id": 81124568}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I'd like to begin my review by reinforcing what christophutaipe said about Red Coconut (RC). RC reservation was stressful. RC Management retracted on the offer we agreed upon, a book-and-buy scheme we made during the Travel Expo in Manila (Aug 2010). RC initially agreed to give us two deluxe rooms for the price of the \"Family Room,\" but later retracted this and down-graded our accomodation back to the Family Room. They even insisted that we take the Superior Room which is priced lower than the Family Room; we vehemently disagreed on this. We finally settled with the Family Room just before we hit Boracay.", "title": "a good choice overall, especially for family with kids", "user": "christophutaipei", "date": "August 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 76250984}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "But that's the last of our worries. On the hotel itself and their service::", "title": "absolutely perfect!", "helpfulness": 1, "user": "eyx", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69860078}, {"rating": 1.0, "stay_parameters": "Stayed December 2005, traveled as a couple", "text": "We stayed in one of their garden view airconditioned rooms as the seaview rooms we're apparently fully booked.It was a big disappointment as soon as their representative fetched us from the airport. He was very friendly but he took us to their private banca via a tricycle(to my horror!) I'm not a snob but I expected better.Like a jeep perhaps? As we were led to our rooms we had to go thru this little alleyway which didn't feel safe at all.and then the room!!!!it smelt musty,the lavatory was not the cleanest and the wall of the bath area looks like it's going to fall apart...lots of cracks on the wall.... and the sheets have seen better days too...", "title": "lovely boracay...end of....", "helpfulness": 4, "user": "yolkie", "date": "August 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 1.0}, "id": 8464458, "likes": {"liked": "— the location!BORACAY", "disliked": "— the room,the food,the tricycle trip"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "breakfast the next day proved more disappointment...half of the buffet dishes are empty and there was not much choice anyway.", "title": "Loved It!", "helpfulness": 1, "user": "TinaMesina", "date": "June 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7803743, "likes": {"liked": "— Great Seaview Room!", "disliked": "— No Newspaper delivered inside the room"}}, {"rating": 5.0, "title": "Great food!", "text": "i just wish i looked around more.we don't mind paying extra as long as we get what we paid for.lesson learnt...", "helpfulness": 1, "user": "Bueno_y_barato", "date": "June 4, 2007", "id": 7756787}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "i will definitely go back to boracay but will never stay in red coconut again.", "title": "Loved Boracay - Red Coconut, ehh..", "helpfulness": 1, "user": "iwasjustthere", "date": "May 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7715150, "likes": {"liked": "— I didnt have a hard time communicating with guest services", "disliked": "— food could have been better"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I decided to spend a couple of days in Boracay right after New Year. It was our first out of town trip as a married couple", "title": "Beautiful views, Great spot", "helpfulness": 5, "user": "Bluepetal23", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6784250, "likes": {"liked": "— The location and set up of the resort", "disliked": "— When the battery of the TV remote control ran out apparently they were out of batteries that night. And when they said they have fixed it, the remote was not working at all. We didn't bother to chase it up further as we were not there to watch TV."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "3 stars hotel in beachfront, with a friendly staff. Bar and restaurant.. A basic hotel, but absolutly overpriced!!!!! I paid US$150 per day and it doesn´t worths it!!!!", "title": "Good 3 stars Hotel But OVERPRICED", "user": "RobertoChile", "date": "February 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 95260221}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Swiming pool with not space for chairs and few chairs in beach.....", "title": "Red Coconut Beach Hotel, we found very warm and cozy.", "helpfulness": 2, "user": "Kenchappelle", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95126872}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Best location, right on the beach. We found the staff very friendly, helpful and courteous.", "title": "PERFECT ANNIVERSARY in BORACAY!!!", "helpfulness": 1, "user": "Peter_J0hn", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94881272}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Delicious pizza and pasta in the resturant and great tropical drinks at the Coconut Bar. In the evening the hotel set-up very romantic diner tables on the beach by candle light..", "title": "Had a great stay.", "helpfulness": 1, "user": "PaulAggieworldtravel", "date": "January 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94675741}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I highly recommend the Red Coconut Hotel.", "title": "food poisoning", "helpfulness": 2, "user": "hawaiiman02", "date": "January 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 94182144}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The service at Red Coconut was so unbelievably perfect it practically MADE the holiday. Even the beautiful white powdery beaches at our doorstep were a close second. Everyone from the beach towel boys, to the restaurant staff, bar staff, and manager met and exceeded our every need. We traveled with my family to celebrate our daughter's 3rd birthday - and they even baked a chocolate cake & sang. The dining experience - under the stars, on the beach, with amazing lobster and seafood - was so great that we did it twice. The rooms were clean, yet simple, and had near perfect soundproofing from the beach parties (necessary for my 3 year old daughter). There is a pool which was a nice plus after too many days of sand. And the gardens surrounding the property were so lush. Thanks for a great holiday", "title": "Perfect Hotel", "helpfulness": 2, "user": "deschmidtie", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58779144}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "pretty good location - nice busy happening right out front. nice soft sandy beach steps away. it's very close to d'mall, the shopping area. there are many restaurants around there. there are also many hawkers right outside though. it was nice but a bit on the pricey side. there was a blackout one of the nights. the hotel/room itself is pretty decent.", "title": "decent", "helpfulness": 3, "user": "redeyeblues", "date": "February 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56620500}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I'll start by saying that if you're looking for a secluded escape away from the crowds, nightlife, and overall fun, free spirit that is Boracay, the Red Coconut is not for you. Stay closer to Station One, or at the Shangri-la, instead.", "title": "Best location and staff in Boracay!", "helpfulness": 2, "user": "LovinAnyBeach", "date": "February 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55694353}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "That said, Red Coconut is an outstanding choice for those who want to be in the heart of the action of White Beach, and for those who are looking for a great staff and nice rooms at a good price. The bar, hosted by an outstanding staff, is one of the best places you can go to people watch. Good food, too.", "title": "Great location and great beach hotel", "helpfulness": 1, "user": "Cramz", "date": "February 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55221378}, {"rating": 5.0, "title": "Make your reservations directly to the Hotel", "text": "We'll definitely be back!", "helpfulness": 2, "user": "jcahyumae", "date": "January 11, 2010", "id": 53147479}], "location": {"country": "Philippines", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 16, "average": 28, "very good": 112, "terrible": 10, "excellent": 130}, "aka": "Red Coconut Beach Boracay", "slim_ranking": 0.519379844961, "description": "The Red Coconut Beach hotel remains the premier destination for informed travelers to our little island, Boracay. With world class amenities and personal service, you and your loved ones will have the vacation of a lifetime! Situated in the middle of the world famous White Beach, between station 1 and 2, we are steps away from the ocean, D'Mall, and other fun activities. Enjoy a cool tropical drink at our beach front bar or dine at our famous restaurant."}