{"user_rating": 4.0, "review_count": 420, "name": "Red Roof Inn - Boston Logan", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "jennifer exceeded her customer service. we called for directions while driving and she got us there with no problem forget navigation she was our phone navigation. Friendly and helpful this hotel was also newly renovated and close to boston easy to get to. Jennifer also had many great suggestions for diner. we would definetly go back. thanks for all your help!", "title": "boston experience", "user": "jean1200c", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132155930}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Excellent guest service, very clean and all new renovation. Jennifer at the front desk was very helpful and very patient.", "title": "Very Good", "user": "ju b", "date": "June 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132125288}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Jennifer at the front desk was very friendly and professional. I stay here alot and she was by far the best front desk attendant. I will definatly come back because of her. She even went out of her way to let me know about discounts and coupons on my next stay which was great.", "title": "Great Experience", "user": "60MMM", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132037973}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Hi", "title": "Good option to visit Boston", "helpfulness": 2, "user": "KCho19", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 131913305}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Good value for the money to visit Boston. My room was all renovated and the beds were comfortable. The street where its located is full of family restaurant if you dont make it to downtown. Free parking.", "title": "Best Red Roof Ever", "helpfulness": 1, "user": "glassman72", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131817844}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stopped here over the 4th because boston was a little crowded and pricey. Found it in the AAA Book and stopped by. Room was spacious and very clean. I was surpised as I had not put Red Roof Inns in this nice a category.", "title": "Nice Hotel!", "user": "lurch1", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 133917169}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Room was not 'cheap', but similar to a Quality or Comfort Inn in price and class and I assume the price was due to proximity to Boston as well as the time of year. I would stay here again of course, and I will add Red Roof Inns brand to that of which I am willing to stay at in the future. They seem to be a good brand.", "title": "great for the price", "user": "pammer22", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133794847}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Location is a little odd and off a main hwy which is hard to get to from the north. The area itself actually looked scary as were a few customers lingering outside, but the hotel and room was great.", "title": "Great hotel and only 15 mins from Boston Airport (Great value)", "user": "patsy666", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 133715336}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "had a late arrival at Logan..the gentleman at night was welcoming and effeciant.", "title": "Perfect Spot For The 4th Of July!", "user": "Julio Q", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133499167}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "so quick ...we were tired - about 1am. He had everything ready to go . card and signatures and were asleep.", "title": "One nice chain site to stay!", "helpfulness": 1, "user": "Cam625", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133386745}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Jennifer at the front desk was great. Provided umbrella so we could walk to dinner next door, and after the power went out, located an extra flashlight so we could find out room. Would stay here again!", "title": "Reasonable and Helpful", "helpfulness": 1, "user": "Gina F", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133166598}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Our check-in experience was very smooth and efficient. We were welcomed by Jennifer who guided us to an excellent restaurant in Melrose, which was close by.", "title": "Efficiency at its best!", "helpfulness": 1, "user": "Almond_68", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133022059}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The room was clean and well equipped, mini-fridge, microwave, safe, coffee-machine, iron & ironing board. It was nice to have coffee-mate available instead of the usual packs of powder. Beds were comfortable and air-conditioning worked well. Bathroom is small but functional. Overall, the staff at reception were all very helpful and we had an excellent experience.", "title": "Jennifer, the desk clerk", "helpfulness": 2, "user": "Marge B", "date": "June 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 132914318}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Flying in at 4:30 pm from Wisconsin with no knowledge of the Boston area made us apprehensive. We did have reservations at the Red Roof Inn in Saugus...7 miles from the airport. After renting a car and driving for 20 minutes we realized we were in trouble, and we stopped at another Red Rood Inn where the desk clerk told us to keep driving.(She was wrong!) After another 10 minutes, our granddaughter called us from the Red Roof Inn wondering where we were. Thanks to Jennifer, the desk clerk, she and our granddaughter went to Map Quest and talked us through the process of getting back. Jennifer was absolutely wonderful and worked with our 23 year granddaughter to get us there safely. Once we were there, she was soooooo helpful. She helped us find a place for dinner, printed out directions for us to get to the Cape and then back to Logan Airport. The Red Roof Inn has a true gem of a worker in this young woman. We are so thankful to her as a part of the staff. Our stay at the Inn was very good...nice room, comfortable bed, and great serviice. The only suggestion we would make is to include very clear directions from airports to hotels. I wish I could thank that Jennifer again!!!!!", "title": "What happend to Red Roof Inn? Something good!", "helpfulness": 1, "user": "JNHRoadWarrior", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132742596}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Was blown away with their new renovations! Definitely not your grandfather's Red Roof Inn any more! Vastly improved decor & features. Now have an in room iron/ironing board, in room coffee makers (even included Coffee Mate creamer instead of those nastly little packets of powdered creamer) I travel a lot for work; \"renovated\" Red Roof Inns are back on my \"hotels to stay at\" list.", "title": "Very attentive staff and management!", "helpfulness": 1, "user": "Mister_H_Train", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132717592}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is a new modern Red Roof that was a little upmarket than I've previously experienced with this chain. The room included a king size bed, fridge and microwave. There was even a breakfast snack pack in the fridge. It was a little difficult to get to, but that's common for hotels on service roads. I was impressed by this Red Roof.", "title": "A Red Roof like no other", "user": "bundybear61", "date": "June 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132582195}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Nearly everything in Boston was booked when I had to find a room for one night on short notice. The room was terrific with very attractive flooring, fixtures and furniture. The check in was smooth and friendly. The traffic noise was minimal and the bed was comfortable. Easy access to internet and able to print my boarding pass in the lobby.", "title": "Glad I found them", "helpfulness": 1, "user": "mafarmerga", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 132540734}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I knew from other reviews that there was no airport shuttle and airport Taxis do NOT know where this hotel is, so be sure to download driving directions and bring them with you for the ride from the airport. Also, there is very limited taxi service out there. The night before I requested a 7:30 Taxi but one did not show up until 8:15. It made me late for my meeting in Boston. The hotel staff were trying their best but had I not shared a cab with another patron I would have missed my meeting all together. This is the only big negative about staying here instead of one of the in town hotels. Also no breakfast (free coffee) but this was not a big deal for me. There are a few places in walking distance from the hotel for lunch and dinner.", "title": "Excellent Service", "user": "Donald M", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132539175}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Red Roof Inn in Saugus, MA was a pleasant surprise. The rooms have recently been remodeled and were clean, comfortable and well appointed. The customer service I received by Jennifer at the front desk was super. I would definately stay at this hotel again.", "title": "Overnight stay", "user": "Bob P", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 132440780}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "This is a very nice hotel, Jennifer (the desk clerk) was very nice and service was prompt; stayed in the \"superior king\" which was very clean, there was a hardwood floor exept on both sides of the bed. I would have given this hotel a 5 star rating except for the fact that the bathroom sink is outside of the bathroom, which I didn't care for, but this wouldn't prevent me from staying there again. There are many restaurants surrounding this hotel. I don't know why they advertise this location as \"Boston Logan\" when it is not near the airport. In fact while checking out, I overheard the desk clerk telling a man who was trying to get to the \"dock area\" where he was meeting his cruise ship, that it would cost $25 by taxi to get to the airport and $45 to get to the dock area. In my opinion, if you're going to advertise yourself as an airport location hotel, you should at least offer a free shuttle ride to the airport or dock area.", "title": "Great Stays at Red Roof Inn in Saugus, MA", "user": "Mark B", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 132412204}], "location": {"country": "United States", "city": "Saugus"}, "stars": 2, "variance": {"poor": 13, "average": 63, "very good": 160, "terrible": 5, "excellent": 179}, "aka": "Red Roof Inn - Boston Logan Hotel Saugus", "slim_ranking": 0.166666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}, "description": "100% Non-Smoking Red Roof Inn Boston Logan is Newly Renovated and a great place to relax after seeing Boston’s sights—Newbury Street, Boston Commons, Fenway Park, Quincy Market, Boston Harbor, The Freedom Trail, The North End, Back Bay, The New England Aquarium, The Swan Boats, The Museum of Fine Arts, The Science Museum, Harvard University, M.I.T, Tufts University, as well as other famous universities, and so much more. If you are traveling on business, we are just miles away from The Hynes Convention Center, The World Trade Center, Boston’s Financial District and Boston Convention and Exhibit Center. If you are here on leisure, catch a concert or see the world famous Boston Celtics or Boston Bruins at TD Garden in Boston or head over to Fenway Park and see the Red Sox! Boston has plenty of fun to offer and in the historic Theatre District you will find several live performances nightly at the Orpheum Theatre, Citi Performing Arts Center, The Charles Playhouse and many others. The Red Roof Inn in Saugus is only 5 miles away from Revere Beach, America’s 1st Public Beach as well as Suffolk Downs where you can see exciting horse races most of the year. Don’t feel like driving into Boston? Don’t worry, we are just 5 miles away from Wonderland T Station (subway) where you can park all day for a very low rate and take a quick 15 minute train ride into the city."}