{"user_rating": 3.5, "review_count": 251, "name": "Red Roof Inn, Secaucus/Meadowlands", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "we ended up being a day ahead of ourselves heading into NYC for NYE so we needed a hotel to stay in and it was 6 at night....went to a few and their rates were 239....went into the red roof and it was 139 so we took it. Room was nice, all re-done...didnt really like our door opening to the open air, especially in the winter so you hear the wind banging against it and the cold air coming in when you open it. We felt safe but still didnt sleep that well. Our shower nozzle was hanging off the wall...we all showered but I\"m sure after time the water will rot the wall out if not fixed. Only one light worked in our room...the bulbs were blown in the other lamps and we only had been given 2 towels and 2 hand towels....there are 4 of us and washcloths would of been nice. These are all things I could have gone to the front desk about and had fixed but it was late and we just wanted to eat and get some sleep. We paid more than we wanted to but it isnt tannersville, its close to the city so its expected. Room was clean except for the few minor issues and the woman at the front desk checking me in and checking me out the next day was very nice. If we were in that bind again it would work but we wont be rushing back to stay there.", "title": "needed a place to sleep asap...", "user": "candle_maker_2004", "date": "January 3, 2014", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 189524640}, {"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "We stayed here because of the location it's convenient to everything including Giant stadium and restaurants in the area. The staff were so polite and always went above and beyond. My partner and I were very pleased with the service and not to mention the price didn't burn a hole in our pockets. I will definitely come back to the Red Roof Inn.", "title": "Best place to stay in Secaucus", "user": "lexxbme", "date": "December 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 189017028}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We stay at Red Roof because it accommodates out large dog. Most of our RRI stays are pleasant enough. We don't expect bells and whistles, but this was pretty bad.", "title": "Even the dog hated it.", "user": "cmdressel", "date": "December 26, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 188629198}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "It took us about 45 minutes to check in. They are close to the airport and buses bring in loads of people (some without reservations) every 15-20 minutes. There is only one person at the desk. In a VERY small area. Strike one.", "title": "3RD WORST RED ROOF EXPERIENCE IN MANY YEARS", "user": "ddbstuff", "date": "December 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 188064171}, {"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "This is a RRI that has been \"remodeled.\" It was only surface remodeled. The tub was in bad shape- in fact the whole shower/toilet area was in bad shape. We had only two (small) towels, and three of us staying in the room. When we called the front desk, we were told that laundry had not been done, so we'd have to call in the morning. (You don't have one extra towel for the whole hotel?)", "title": "\"Little Gem in north jersey\"", "user": "snax555", "date": "December 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 187120890}], "location": {"country": "United States", "city": "Secaucus"}, "stars": 2, "variance": {"poor": 33, "average": 50, "very good": 62, "terrible": 22, "excellent": 84}, "aka": "Red Roof Meadowlands Hotel", "slim_ranking": 0.666666666667}