{"user_rating": 3.5, "review_count": 128, "name": "Red Lion Hotel Yakima Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "It had been over 20 years since I had stayed at this hotel and I was happy to see it still had some of the things I enjoyed as a frequent guest during my working years.", "title": "Hello, old friend.", "user": "CouleeCat", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167669533}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We had a room on the backside, with sliders to an inner courtyard. When we parked in front of the unit, we thought, oh, oh, this looks questionable. But, when we opened the door to find a beautifully decorated room and nice tiled bath with a huge shower, we were very pleased.", "title": "Not up to Par", "user": "LoloWA", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 166766814}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Loved the bed, pillows, linens, the comfy chair and the table and chairs out on our private patio in the courtyard. One wish though, the patio was filled with vegetative debris and cobwebs and the table and chairs very dusty, it would be nice to include this area in daily housekeeping. From the courtyard, it is an easy access to either of the two pools. Anyone that has visited Yakima in the summer knows that a great pool area is a big deal. Both of these were so well kept, lots of beautiful vegetation surrounding it and plenty of chairs and lounges. They even had an ADA assisted power lift into the pool.", "title": "Old hotel refurbished somewhat", "user": "Robbie69", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 166764356}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I appreciated the refrigerator in the room as we had picked up some fruit to enjoy for breakfast and it kept our beverages nice and cold. Speaking of breakfast, we came down too late to partake of the Roaring Start breakfast, but the front desk clerk offered to see if they could put something together for us anyway. Nice touch.", "title": "Dead Bugs. Bad Shower, Bad Breakfast", "user": "bcw58838", "date": "July 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166643722}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "The location of this property is very convenient not only for the adjoining convention center, but for walking through the downtown area, which has spiffed up considerably since my last visit.", "title": "Convenient for Convention Center.", "user": "Sue H", "date": "June 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 165716758}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Stayed here in a recent trip to Yakima, and I won't be going back. The hotel was old and seemed run down. We had to walk out of the hotel across a parking lot into the door of our room. For the price paid, it was not worth it.", "title": "Old and expensive for the quality", "helpfulness": 1, "user": "mw368", "date": "June 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 165090164}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Was looking for a decent hotel in a sunny location with an outdoor pool. Found it at this Red Lion. The beds and pillows were comfy and there were 2 pools. Staff were excellent. Room was clean. Breakfast was good. Only negatives were that the fridge was really small & on the floor. Would have been nice to have it on a table. Also the room is dark, it could definitely stand another lamp of two. Had to pack in the morning after the sun came up because we couldn't see well enough at night with just the 2 lamps to get the job done. Would definitely stay again.", "title": "Perfect for our needs!", "helpfulness": 1, "user": "Pappytrails", "date": "June 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 164641576}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This hotel is very close to local baseball fields. We stayed for a baseball tournament and in the warmer months, it would be a great place to stay as a group, around the outdoor pool area. It also has a great breakfast, which is included with your stay to get the kids going for the day.", "title": "Close to baseball fields", "user": "gcraw", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163788652}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This hotel is a great place to stay for conventions that use the Yakima Convention Center. Great rooms Normally good Service, Great Breakfasts. Nice Grounds, Close to many off site attractions and restaurants.", "title": "Great place for a convention", "helpfulness": 1, "user": "mstrthor", "date": "June 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163233524}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I stayed at the Red Lion over Memorial Day weekend, 2013, coming over from Seattle because of the rain. We chose the Red Lion because of the 2 outdoor pools and the reported comfort of the bed; (which lived up to its rep). We had a very pleasant stay in our poolside room. The all you can eat buffet breakfast was very good and well worth the price (under $6). The refrigerator allowed us to have cold juice in the morning without having to leave the room (and chilled wine in the evening while relaxing around the pool). My tips to a fellow traveler would be to bring a few large plastic cups because no glass containers are allowed at the pool and bring your own hair conditioner, as they do not supply any.", "title": "A Great Choice!", "helpfulness": 1, "user": "Sandra D", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163167933}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed here recently for a conference and was pleasantly surprised. The staff was courteous and knowledgable. My room was spacious, the bed was very comfortable and the pillows were amazing! The grounds were beautiful and the pools were very relaxing. The workout equipment was high quality and I really enjoyed the breakfast that came with the room.", "title": "Pleasantly Surprised", "user": "jan t", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160691392}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Attended a conference at the hotel and we had a great experience from begining to end. The hotel is a bit older but it is in great condition. Our room was great -- on the ground floor near the pool -- the bed was great, the room was big, free wifi, refrigerator, microwave and coffee maker, and it was all super clean. The Red Lion is located right in the middle of everything and you can walk to a dozen good places to eat. We also enjoyed the free Roaring Start Breakfast which is a cut above most hotel breakfasts.", "title": "Nice Place", "user": "Rob B", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159662794}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "On check-in, Rewards members get a chintzy bottle of water (I mean one of those with packaging that's so thin, it about crushes in your had while trying to drink it....) woo hoo.", "title": "Not my favorite Red Lion", "user": "LUVtheNW", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157306693}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The place didn't seem very full, but they put us in a \"motel\" room clear around back with steel exterior door. The lounge had three signs on/near the entrance that all had different opening times. One said 4:30, another said Happy Hour at 4. We walked in just after 4 (the door was unlocked, but they did not appear open). We asked if they were open, and a worker reluctantly said \" I guess we can open now...\"", "title": "I've decided to Like Red Lions", "user": "SRMueller1", "date": "March 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 155377567}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The room was clean enough, once we were inside, but there was just something missing from our regular Red Lion experience....", "title": "Average hotel with friendly service", "user": "PullmanCougar", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 150142810}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "I came here every summer and I had an absolute blast here, there's a heated pool and there's the cold pool also. Just had an amazing time here and I would Recomend anyone to come here and have a amazing time here and absolute blast.", "title": "Amazing Stay", "user": "breakingdawn2012", "date": "November 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146269459}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Wanting to get some \"end-of-summer\" sunshine, we booked a hotel with an outdoor pool and headed to Yakima. The front desk staff was very friendly and accomodating. We requested a room close to the pool and got Room 161. It had a sliding door that opened to the grassy area next to the pool. Perfect! The pool was relatively small (as were the pool towels!), and the water temperature was cold. It was Labor Day weekend, so the pool had many families, kids screaming, and adults talking loudly to anyone and everyone around that would listen. We were looking for quiet sun time with a good book, and this felt like a \"neighborhood pool\". The best thing that happened, from our viewpoint, was that a kid threw up in the water, and maintenance closed the pool. Suddenly all was quiet and peaceful! By Monday, all the families had checked out, so again, we had a wonderful sunny, peaceful day. Our room was surprisingly well-appointed and very clean. It had a microwave and small fridge. The only negative was a continuous buzz that you could hear from the room next door. It sounded like a fan. But other than that, we were very happy with the room. Breakfast was included and it was a regular type buffet breakfast. Out total bill for our stay was $117. We thought that was pretty reasonable.", "title": "Room Surprisingly Nice!", "helpfulness": 1, "user": "AreWeHavingFunYet", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139378420}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Red Loin located right next to the Yakima convention center is very convenient and downtown. The room was spacious with a nice balcony with two chairs and a table to be able to sit outside. The hotel has two large outside pools for those interested. Room was very clean and beds were very comfortable. I slept all through the night and this is unusual for me!", "title": "Comfortable night", "helpfulness": 2, "user": "behaman", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138826867}, {"rating": 4.0, "title": "Destination Yakima", "text": "A clean, large and well appointed room. Felt very \"vacation-y\" even though it was a one night stay; loved the ground floor lanai near the pool and overlooking a well kept green lawn. Gorgeous. Friendly, courteous staff. Disappointed in the breakfast - not worth $5.95.", "user": "Amorah R", "date": "August 26, 2012", "id": 138466563}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We booked on priceline at a great rate and stayed here as a stopover between Boise and Seattle. I would have been very disappointed though if we had paid the going rate for one of these rooms. The hotel seems like it was several adjacent hotels all purchased and now managed by the same company. We stayed in the section that felt like an old roadside motel from the 60s. The bed was very comfortable, but that was the only positive. The light switches were located in the strangest places, and there was no breakfast. Red Lions tend to be nice places but this one falls way, way short.", "title": "Outdated", "user": "Scott H", "date": "August 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 3.0}, "id": 138329113}], "location": {"country": "United States", "city": "Yakima"}, "stars": 3, "variance": {"poor": 17, "average": 25, "very good": 38, "terrible": 14, "excellent": 34}, "aka": "Red Lion Hotel Yakima Yakima", "slim_ranking": 0.52, "description": "The Red Lion Hotel Yakima Center is located in downtown Yakima Washington, next door to the Yakima Convention Center. Located just minutes from Yakima Greenway, Yakima SunDome, Yakima Valley Community College, the Central Washington Fairgrounds, and only 6 miles from the Yakima Air Terminal and offer a free airport shuttle. Red Lion Hotel Yakima guest rooms provide quiet, comfortable accommodations to help you rest and unwind. Hotel amenities include free wi-fi, telephone, in-room coffee and plenty of Yakima sun at our two outdoor pools. Additionally, the Red Lion Hotel Yakima Center boasts easy access to several nearby business locations like the Pacific Northwest University of Health Sciences, Yakima Regional HMA, Yakima Memorial Hospital, GE Aviation, Pacific Power, and Cascade Natural Gas. The Red Lion Hotel Yakima Center, located near I-82 provides easy access to Yakima Valley's award winning Wineries, nestled in the foothills of the lower valley. Located near the Yakima River provides many opportunities to fish the only blue ribbon river in the state of Washington."}