{"user_rating": 4.5, "review_count": 863, "name": "Red and Blue Design Hotel Prague", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Stayed 3 nights at the \"Blue & Red Design Hotel\" as part of a small city break. The hotel is in walking distance (15 minutes) or 2 tram stops (5 min) of the Charles Bridge. It's locations is nearly perfect as it's far enough from the touristic center so you won't be bothered but near enough that you get there under 5 minutes.", "title": "Great option to explore Prague", "user": "Diltiazem", "date": "November 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86851017}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Rooms:", "title": "An pleasant surprise", "user": "Chagoule", "date": "November 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86779186}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Contemporary and with all the amenities expected on a european 4 star hotel. The heating is a bit to high, but nothing the A/C can't handle.", "title": "Nice hotel", "user": "BattyGlobe", "date": "November 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86623542}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Breakfast:", "title": "Excellent hotel with modern decor and necessary amenities", "user": "eshizzle", "date": "November 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86466697}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Good selection of pastries and also fresh fruit/vegetables. Should please everyone.", "title": "1st Class Hotel with a 1st Class Staff!", "user": "Charles-Liu2010", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86369021}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The hotel is great. Rooms and other hotel spaces had excellent, tasteful interior. Rooms were spaceous, just like its bathroom. It all seems pretty new, so nothing could and should go wrong there. Breakfast was good. Free, well organised WiFi (on every floor a different network) is always a big plus to me! Front desk personnel was very helpful and friendly, even during the night shift.", "title": "Great hotel with great prices. Location not bad, but could be better...", "user": "pieterjansen", "date": "December 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 88900380}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Only (minor) down side to the hotel is that it is a little out of the center. During our stay (Nov. 2010) it was snowing heavily, so the 15-20 minute walk to the center was less comfortable, but at more sunny times this would definitely not be a problem to us!", "title": "Absolutely Fabulous!", "user": "Meg0417", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88731456}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Just returned from a wonderful stay at this hotel. The rooms are spotless and very modern (obviously recently decorated) and the bed was one the most comfortable beds I have ever slept in! Our room faced the road so we were a bit apprehensive about traffic noise but the thick double glazing meant that we didn't hear a thing. Unlike other reviewers, we found the staff to be very helpful and friendly, check in and out was a breeze and we managed to book an airport transfer with them by email before arriving (it was 1000CZK both ways). Breakfast was very good, they had a huge selection of cold meats, breads, cakes, cereals, juices, eggs, bacon etc which changed everyday. The hotel also has a bar but the prices are high - it's also very quiet which I suppose reflects the high prices. The hotel has free wi-fi and use of a computer downstairs which is helpful when you want to check in your flight before you leave. It is located on the outskirts of town, but like other reviewers said, I think it is better for it as there are a fantastic selection of cheaper restaurants only a few metres away (we ate at the Artisan, Cantina and La Bastille - which were all lovely). All in all, a really enjoyable stay and I would definitely stay here again.", "title": "A wonderfully modern hotel for great value - though a little out of town, and poor service", "user": "TravelAl2010", "date": "November 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 88605100}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "We arrived on the overnight sleeper train from Krakow, and thus were at the hotel very early. Luckily (and the only positive example from the staff), they were happy for us to take the room early, and without an additional charge. The rooms were lovely - very modern & spacious, with a separate desk & sitting area. The hotel itself is on the west bank, and thus quite a way from the center of Prague, though it is easily reached by a cheap tram ride. This has benefits - some restaurants were far better value than the center of town, for example. The staff, however, were barely above rude. They were continually condescending, and made no effort to provide help. Example - when asked for a local laundromat, they insisted that the only solution was the hotel laundry (at obviously exorbitant prices). The same situation when asked for a bottle opener - I was forced to bring the bottle to the bartender in order to be scorned for not buying from them. Not the level of service you'd expect for the price...", "title": "A little gem in Praha", "user": "ExplorerAsh", "date": "November 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 88541577}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Highly rated on Trip Advisor and rightly so.", "title": "Love this hotel - its amazing!", "user": "Shimmerstars", "date": "November 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88305564}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The breakfast is basic but has a number of hot options (eggs, sausage etc) in addition to the continental style meats, cheeses etc.", "title": "red and blue design hotel modern and excellent value", "user": "ppurewal", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87051908}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "If you are looking for a relaxing stay in Prague you don't have to search any other place, this is definitely the place to stay. Nice and clean rooms, great staff, breakfast is very good and even the hotel's location was perfect for us: there was a lovely park in front to go out for some walks and the center of Prague is only a couple of minutes away by foot (you have a tram stop very close to the hotel nevertheless).", "title": "This is the right place to stay in Prague!", "user": "bmpereira", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90312086}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I'll definitely be back to Red and Blue Design Hotel if I ever visit Prague again!", "title": "Absolutely stay here!", "user": "travelofreak", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89970367}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Stayed 4 nights in the last week of November/ first week December and loved every minute of it.", "title": "Great Value with good transport access - Great Hotel!", "user": "travellingchick81", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 89898995}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We checked in early at 5:30 AM on the first day and were given an early check in within 10 mins. Staff were very professional and courteous. Breakfast choices were great, there is also a cosy little bar downstairs.", "title": "Good Stay, Nice Location", "user": "subject957", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 89577740}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Rooms were classy and loved the shower in the bathroom. We got a blue room.", "title": "Birthday", "user": "christinadavid6", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89126480}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My boyfriend and I stayed here for a short break in December and had an amazing time! We paid about £60 per night for a double room and could not believe how nice the hotel was for this price! We arrived on an early flight and the hotel staff were very friendly and more than happy to let us check in early. They provided us with maps and directions to the center and were on hand to answer all our queries throughout our stay.", "title": "Excellent all round hotel..", "helpfulness": 1, "user": "MissTravelbug83", "date": "January 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92195234}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The room was large and immaculately clean and we had a nice view over the city. Were given a red room, which we had requested when booking (personal preference!) but all of the room appeared to be of a similar design. The highlight of the room was the bed, being the most comfortable I have yet to find! The room was equipped with everything we needed including free tea and coffee facilities and anything we used was religiously replaced every day. Bathroom was modern, nicely decorated and again very clean, Bathrobes would have been a nice touch but for this price you can't complain!", "title": "Peaceful location but near all the sights", "helpfulness": 1, "user": "RATSOMATIC", "date": "January 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91315602}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Breakfast was included which appears to be a rare thing for European hotels and there was a good selection everyday. The hotel had no restaurant but this was not a problem as there were plenty of restaurants and supermarkets in the surrounding area.", "title": "Great hotel, friendly staff and good location!", "user": "Ivilina", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 91292134}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The location of the hotel was perfect, the area had lots of nice shops and cafes and was refreshingly local whilst being only a 10-15 minute walk from the historical center. There was a tram stop 2 minutes from the hotel but we never had occasion to use it as everything was within walking distance.", "title": "I can't imagine staying anywhere else in Prague!", "helpfulness": 1, "user": "smokva", "date": "December 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91221176}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I would highly recommend this hotel for anyone looking for a good value, modern hotel in central Prague and would definitely stay here again!", "title": "Very good price/quality relation and the best location.", "helpfulness": 1, "user": "NetBear-332", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90989423}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This was one of the hotel's I was looking forward to staying in most during our trip and I ended up being a little disappointed. The hotel itself is just as nice as everyone says with modern rooms, great bathrooms and a decent all included breakfast. A note of caution though, the pillows are a joke. They are SO big you can't really sleep on them. I woke up with a sore neck that nagged me for the rest of the trip...NOT impressed by that. Location wise I'd only say is mediocre. It's probably really nice in the spring or summer but if you are planning on travelling in the winter I'd probably recommend something a bit closer to the main areas of town. It was rather cold while we were there so the 20 minute walk to get anywhere was rather miserable. Also, the cobblestone sidewalks seem to be much more treacherous than a normal sidewalk so be careful when you are walking. Oh, and this hotel is located on a hill with a semi steep incline so you might want to keep that in mind when booking as well. The ice made getting down the hill on the sidewalk an adventure. Overall I just have to say it's OK. It was a really clean hotel and you can't argue with the price but there were just a few things that could have been done much better and the location really isn't ideal during winter stays.", "title": "Just OK", "user": "Janesse", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 93754178}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Really nice hotel about a 15-20 mins walk to Charles Bridge. Relatively new on the Prague scene and very modern in design. I had a loft type room on the top floor which was very spacious - huge pillows. Room was rather warm when I arrived but the air-con worked very well and was soon at the right temperature. The staff were very courteous both at reception and at breakfast which was a mixture of continental and hot style. All in all this is an excellent value hotel and ideal for business and leisure travellers and would thoroughly recommend it!", "title": "Very impressive hotel", "user": "JaseUK1", "date": "January 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93753833}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I went to Prague in early December last year and thoroughly enjoyed it; a large part of this was owing to the fantastic location and amenities that the Red and Blue Design Hotel offered.", "title": "Fantastic Hotel: Great Location in a Great City", "user": "careless_people", "date": "January 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93540328}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Location wise the hotel is around a 25/30 minute trip from the airport. We used an excellent transfer company to get to the hotel. They sent a clean and very comfortable Audi A4 to pick us up along with a friendly and knowledgeable driver who gave us a few good tips on where to visit and a really helpful map. This cost around £15 each way but was well worth it. The company even sent the same driver to take us back, I thought this was excellent attention to detail or perhaps a sign that we tipped too much.", "title": "Wonderful Hotel in Perfect Location", "user": "ebbosse", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93243529}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "The hotel is walking distance to all the major attractions in Prague which are all located within walking distance of one another. It’s around a 10 minute walk to the Charles Bridge or a 2 minute tram ride (these are easy to use and inexpensive). You can also walk to an excellent beer hall from the hotel with ease - U Medvidku.", "title": "More than we expected", "user": "ep14881", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 93048383}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 5, "average": 27, "very good": 230, "terrible": 0, "excellent": 601}, "slim_ranking": 0.0654761904762, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}