{"user_rating": 4.5, "review_count": 797, "name": "Regent Singapore", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed here for three nights and had a very enjoyable experience. As others have commented, the lobby and check in staff are very efficient and helpful. We had a particularly positive experience with the concierge who gave nice recommendations and helped us order movie tickets on line. The breakfast is ample and has a nice mix of asian and western food. What makes this hotel so nice though is the service. The staff are really trained well and go out of their way to anticipate requests. At the pool, the front desk, the gym, all were really courteous. As for the facility itself, I think it's starting to feel its years. Though there's no problem with cleanliness in any way, it's pretty clear it was designed with the needs of travelers past in mind. The room is small, the pool is small, the gym is small, the bathroom is super-small (as in the door practically brushes the front of the toilet when opened). All in all it's a nice place with service that I have rarely experienced elsewhere but if you want more opulence you should look elsewhere.", "title": "I'll give it five stars but the rooms are a little dated", "user": "badwaiter", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 136946028}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I visited The Regent for business and stayed for a week. This is a 5 star hotel with excellent service and probably best breakfast on the planet. Location is great, as it is just by the Orchard Street. Great value for the money, hotel like this, in Europe, would be ridiculously overpriced, while The Regent is much more reasonable.", "title": "5 star experience", "user": "Summer S", "date": "August 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136720450}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Hotels in Singapore are generally quite expensive if you want to go for 5 star. But The Regent is very good value for the service you get. Staff are nice and the bar serves up a mean cocktail. Wagyu beef burgers are also a big hit with me.", "title": "Great Location and good value", "helpfulness": 1, "user": "Foodgoorou", "date": "August 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136653864}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Only downside is that lobby was always really humid. But rooms are fine so can't really fault this much.", "title": "Really nice", "user": "jj k", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136553084}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We choose this hotel because it was close to Orchard road and whilst it was conveniently located, it also ended up being very pleasant. The hospitality was spot on and the rooms spacious - for Singapore. When you complete your swim the staff actually have an iced glass of water waiting for you! Loved the fact that they had fresh jackfruit as part of the breakfast buffet, as well as everything else you could possibly think of. Whilst everything seemed to work like clockwork, it still managed to have a relaxed feel.", "title": "Still the best", "user": "RoRoBrisbane", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136445476}, {"rating": 5.0, "title": "Enjoyed my two weeks stay here", "text": "I stayed for 13 nights for a business trip. I Asked and recieved a non-smokers room on the eight floor (room 813). I was very satisfied with the room- clean, king size bad, good shower accessories, didn't have any noise problems at all. Check-in & out were fast. Gym & sauna facilities were also very good. My flight was late at night so I got a late check out at 6 pm with no additional charges. Laundry service is expensive- 5$ for one pair of socks but I guess this is the price at any other hotel of these levels. MRT station at Orchard road is a ten minute walk from the hotel & Singapore's Botanic gardens are also a walking distance. I enjoyed my time here and would probably return to The Regent if I'll be at Singapore in the future.", "user": "Or_1981", "date": "August 4, 2012", "id": 136201869}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Stayed here a week for business. I love everything about this hotel except for the super pricey breakfast buffet (costs around S$78) but as I titled up there, breakfast was amongst the best in any 5stars hotel around se Asia. Experienced a bit trouble when once they delivered my laundry late, but other than that staffs were all helpful and friendly, loved my stays.", "title": "You get what you pay", "user": "tatsqij", "date": "August 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 136186593}, {"rating": 3.0, "title": "Living off old glory...", "text": "In many ways value for money, a great arrival experience with very capable staff on the driveway. The first floor is beautifully decorated, stylish and opulent five start interior. Reception staff is a little inexperienced and showed some (English) language deficits. I had booked a suit for the price of a double room but expected more then a tired looking room, the bed very hard and the pillows like cement blocks in good linen with no choice to receive a softer version from housekeeping. Terraces were without furniture, the toilet flush sounded like a jet taking off, the taps turned counter intuitive and the shower located in the tub had a old fashioned shower curtain that smelled of better days. Clearly, the hotel is due for an overall make-over! The hotel has some excellent restaurants however, reviewed separately...", "helpfulness": 1, "user": "Idenburger", "date": "July 29, 2012", "id": 135689237}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Booked via agoda and stayed here for 5 nights with my little baby.", "title": "Very Comfortable and Excellent Service !", "user": "Steven P", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 135652451}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "All staff welcome us with smile and they are very helpful in any way", "title": "Regal treatment", "helpfulness": 1, "user": "fred200099", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135650307}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed for 4 days in June 2012 in this place. Everything looks magnifique. Pristine surroundings.", "title": "Excellent Place. except for a Malay receptionist & rude Indians from Housekeeping", "helpfulness": 1, "user": "Winter S", "date": "July 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135209090}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "There's just one thing they need to work on.", "title": "Excellent stay", "helpfulness": 1, "user": "J786", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135006356}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My cousins and I observed that whenever we ask for ice cubes, and an indian delivers them, they will hand you over the bucket and turn your back on you even if you were asking them something. This didn't happen only once, but thrice. All other nationalities working in the hotel are respectful..except in that department. There's another Malay receptionist I've encountered when I first checked in. I was waiting on a line at the reception desk. Beside me on the other line was a blonde guy in business attire. I was waiting for my turn for 10 mins. When its my turn..the Malay receptionist signalled the guy to go over my lane so he'll be attended first. The guy looked at me, feeling ashamed. and I just made a look which says \"It's okay\". Everything should've been perfect. But management should check on their workers for value every now and then.", "title": "great stay!", "user": "littleteacosies", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134957763}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed for over a week and it was an excellent experience. Spacious and very comfortable too. That was very clean. Well attended by housekeeping staff. All staff really helpful, attentive and friendly. Conference and Events Team reaaly great. Excellent spread at breakfast and some really good food especially at Basilico and the Summer Palace. A great hotel in central Singapore.", "title": "Very Comfortable, loved the gym", "helpfulness": 1, "user": "corrinna", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134872451}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "i booked a room here to celebrate my birthday as its one of the few hotels in singapore to accept pets.", "title": "accommodation", "user": "585JohnY", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 134864030}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We've spent 4 nights there and I will give 6 stars if I am allowed to do so. The outlook or the architectural design of the building is of its age. I will not compare it with the contemporary ones such as Sands but it is a classical high class hotel settings. The room is excellent but again someone may criticize the fitting-out is outdated. The beds and sofa are also comfy. The air-conditioning is super quiet but a bit windy (I think you can ask them to adjust the air diffuser for you). Moreover, the toiletries provided is from L'occitane! However, the best thing of the hotel is not the hardware but its software -- staff. They all serve the guests wholeheartedly. On day, my little daughter slipped on the floor and bumped her head. Although the hit was in fact very minor and she was absolutely fine, the staff in the lobby approached us immediately and offered us help. The duty manager also gave us a call later (in fact it was a voice message as we were out) to express their concern. We could feel that they really cared about the guests. Overall, we have had a fantastic experience in the hotel and are definitely looking forward for staying there again. One suggestion, as there is another Four Seasons Hotel in the area, just tell the taxi driver \"Regent Hotel at Cuscaden Road\" and nothing more. Never mention the \"four seasons\" as it will only cause confusion. ---- from Ho.", "title": "It deserves it's 5 stars rating.", "helpfulness": 1, "user": "y2000hei", "date": "July 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134502640}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "From the moment we arrived, we knew the hotel had class. We were greeted by a lovely concierge. We got an upgrade suite which was very nice.", "title": "Impressive Hotel", "helpfulness": 1, "user": "Geraille", "date": "July 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 134406379}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The room is very clean and quiet. Breakfast was fantastic, with excellent service from the friendly staff..", "title": "A very pleasant stay....", "helpfulness": 1, "user": "QueenDP", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134104737}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I definitely recommend The Regent hotel and rate it highly.", "title": "Stay in Regent Singapore", "user": "ushala", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134089507}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The lobby area and flowers were beautiful. The rooms were clean and well furnished. The location was very handy to access the shopping on Orchard Rd and near to the Botanical gardens. The staff were extremley friendly - especially Joseph on the concierge desk. The plants on the bedroom floors were a little disappointing - esp given the lavish flowers on the ground floor - it gave the floors a very sterile look which should be brightened up to improve.", "title": "Nice and pleasant", "helpfulness": 2, "user": "Anisha2608", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133015818}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 5, "variance": {"poor": 21, "average": 63, "very good": 303, "terrible": 17, "excellent": 393}, "aka": "The Regent Singapore Hotel Singapore", "slim_ranking": 0.107638888889, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Regent Singapore, a Four Seasons Hotel, is built around a sun-filled atrium that ascends through the building’s 12-story interior. Conveniently located in the city’s most select area, the hotel is central to the business district and minutes walk to tranquil Botanic Gardens and Orchard Road, Singapore’s premier shopping and entertainment hub."}