{"user_rating": 4.0, "review_count": 96, "name": "Relais de la Magdeleine", "reviews": [{"rating": 4.0, "title": "Romantic outdoor dining experience under floodlit plane trees", "text": "The Relais de la Magdeleine is approached by a beautiful driveway down an avenue of plane trees. It has a tranquil setting with swimming pool in a secluded area. The building is an old manor house. The rooms are old fashioned, but have a faded charm, although the bathrooms could benefit from some updating. The kitchen is excellent and dining outside under the floodlit plane trees is a joy. The service is good and the owners of the hotel run the place themselves and have a keen interest in maintaining high standards. I can recommend it highly.", "helpfulness": 1, "user": "Barney31", "date": "December 11, 2010", "id": 89571912}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The day before we were to arrive, we read a negative review. Then drove 5 hours in torrential rains wondering if we'd made a mistake. No mistake. We could not disagree more strongly with the unhappy review. As we stood in the rain looking at the welcoming entrance, we were met by Vincent, the son of the matriarch who runs the hotel. From that moment forward, every wish or request was promptly and happily honored, and our stay was perfect. Our very quiet and private corner room was one of the less expensive rates, yet was roomy and filled with windows, every one with a spectacular view. The furnishings were antiques burnished with the patina that years of age provides, and fabrics were the warm colors of Provencal. Bath was spacious, modern, and well equipped. The hotel public spaces are high ceilinged, with the feel of an English manor house, one room flowing into the other. An inviting fire awaited to banish any chill. Our dinner was creative, delicious, reasonable, and served by candle light in a private and romantic setting with meticulous service and no sign of stuffiness. All the staff were gracious and well trained, and seemed to have been in their roles for a long time. The next morning, in bright sun, we explored the grounds and could fully appreciate how beautiful the setting is. We met Madame, who charmed us, in contrast to the sometimes formal French persona which can be difficult to penetrate. We left feeling as though we'd been privileged to stay in a family home, and can't wait to return.", "title": "Treated like family", "helpfulness": 3, "user": "candj2010", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82831688}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is the third time we have stayed at this lovely old hotel, which was once a private 18th century mansion and is fronted by a line of ancient plane trees. Often when one returns to a spot which hold pleasant memories there is disappointment because things have changed. But La Magdeleine has remained exactly the same; if anything the cuisine is even better than we remembered it. There is a fine pool and the interior rooms are elegant and comfortable. The service is professional and congenial.", "title": "Lovely old hotel", "helpfulness": 1, "user": "eschatology", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82339996}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Seaside resort towns such as Cassis and Bandol are easily reached as is Marseilles, though the narrow streets and heavy traffic in the latter make driving there an ordeal best avoided. Our bedroom in la Magdeleine was large and attractively furnished. Our only complaint, and it was a minor one, was the plumbing: the hot water dribbled in at an exceedingly slow rate. However, other guests with whom we chatted said they did not have the equivalent problem.", "title": "A terribly neglected hotel", "user": "MER45", "date": "October 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 81767911}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Michelin gives this hotel a high rating - which it does not deserve! It is run down and \"seedy\". The furniture is worn out and inadequate. The door knob fell off of our door. The parking lot is full of deep ruts. The fountain in the courtyard is full of weeds and mold and does not work. The whole place is completly neglected and the staff doesn't seem to care.", "title": "Very pleasant Provencal hotel", "user": "Racer356", "date": "July 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71079892}, {"rating": 4.0, "title": "A real find", "text": "Good location for visiting Aix and Cassis. On edge of pretty village and set in nice grounds with large pool and lavender gardens. Lots of quiet sitting areas.", "user": "FirstclassSussex", "date": "June 19, 2010", "id": 67994202}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Hotel is an old historic house. Typical French shabby chic with lots of rather gloomy reception areas. Bedroom on top floor large and peaceful, though bathroom a bit out of date. Dinner on terrace was very good indeed with lots of choice, a good wine list and careful service. Staff super. Breakfast good value for France. A very nice hotel as a base to return to. Recommended.", "title": "Beautiful hotel", "helpfulness": 1, "user": "Alexa071", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36895900}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We found this place by chance last year and decided to visit again this year. Beautiful hotel. A large house with green shutters and ivy up the walls. Impressive gates and lavender up the drive way. The rooms are decorated with period furniture but not too chintzy. Ensuite athrooms in nearly all rooms. All very clean. And depending on the room - they are very spacious. We had one room with twin beds - that room seemed much smaller than the other double rooms we had but all had large bathrooms. Weather permitting eating is outside - breakfast, lunch and dinner. Very romantic. Is formal and the meals are not cheap. Set meal or a la carte. But great food. Tables in the evning all have their own candles or table lights and everyone sits under the trees. Don't think this is a hotel for young children - most people staying in it seemed to be 30+ years. Is not really a hotel for kids. Second visit did not disappoint. Rooms are really great value the meals less so but it is hard not to be tempted to each there once you see the place at night.", "title": "My most romantic stay ever..", "user": "ClausJ", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31937054}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Would recommend taking a small stroll into the village for a coffee and pastry if you don't want to pay the 15 euro they hotel charges for breakfast.", "title": "Beautiful, old fashioned charm", "helpfulness": 1, "user": "woody35London", "date": "September 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20339017, "likes": {"liked": "— friendly staff and great food in fantastic setting", "disliked": "— nothing really"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Agree that the manager is rather indifferent - he seems a little awkward in his role. But the rest of the staff more than make up for it.", "title": "One of my all time favorite places", "user": "chasUpstateNewYork", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12979806, "likes": {"liked": "— the staff are world class!", "disliked": "— there is nothing to dislike!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I enjoyed two wonderful days at the charmingly old Bastide Relais Magdeleine. We enjoyed the hotel itself, the people, the magnificent dining room, fabulous breakfasts, and gorgeous gardens with its great Sycamore trees and pool. The rate was extremely fair, and our suite had big windows on two sides. Mme Marignane sees everything, and it runs it all very well.", "title": "Postcard old French Charm, food and setting; poor beds", "helpfulness": 3, "user": "woodluckgamble", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 148500987}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "However, we were disappointed with the actual bed in our suite (overlooking the pool). We would return but for the bed itself. It was very small, obviously old, and sagged terribly. Bad enough for one person, who could at least roll into the middle. Even as a happy couple, we could not get a good night's rest. For the second night, we took two pool towels and put them under the mattress to even it out a bit. We wonder if they have ever found them.", "title": "Provence perfect!", "helpfulness": 1, "user": "HiddenHill", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 140394357}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Should the hotel upgrade to new and larger beds, we would return in a minute, each year, and recommend it highly.", "title": "Peaceful Perfection!", "helpfulness": 1, "user": "Nancy171717", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139808195}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Relais de la Magdeleine is a perfect place to unwind for a few days. It's very peaceful and beautiful. Everything about it has a well-polished patina of history and is a delight to the eye.", "title": "An escape to another age", "helpfulness": 2, "user": "mse1125", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132416753}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Service is impeccable under the watchful eye of Madame, an owner and manger of great skill and charm.", "title": "Our second visit but our last", "helpfulness": 6, "user": "Florence027", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 3.0, "service": 1.0}, "id": 115589608}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a lovely old building that had been updated in some ways -- a one-tower castle in Michelin. I looked at several rooms, as I had been quoted 135 Euros for a room with shower, but it was confirmed at 148 Euros -- then it turned out that all the rooms with showers were on the third floor and the elevator only went to the second floor! I was shown several other rooms, in one of which the A/C wasn’t working.", "title": "A lovely building, but . . .", "user": "Chandolin", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 167458189}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We settled on a large room with a stand-alone bathtub and hand spray at 148 Euros. We took the couette out of its case and slept with only the double sheet. There was no Kleenex in the room or wastepaper basket other than a tiny one in the bathroom. The tub was inadequate with a hand spray shower -- I know, Europeans will castigate Americans who prefer a shower, but a hand spray is certainly acceptable in a normal tub with some sort of barrier to keep the water and heat in, not standing in a old-fashioned bathtub. And the water became scalding hot when the sink faucet was turned on.", "title": "Amazing Getaway", "helpfulness": 1, "user": "kamran f", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163825658}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had a very good dinner in a gorgeous garden terrace at the hotel, with plane trees over 200 years old. Breakfast was lovely on the terrace.", "title": "Charming bastide", "user": "Michel J", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163598319}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Recently spent a weekend at this wonderfull hotel. This was once the home of the local aristocracy; Beutiful building and grounds. Tastefully decorated. It has that nice feeling one would expect from an elegant upmarket country hotel. Equipped with all modern amenities WiFi Cable etc...", "title": "Charmant hotel in rustieke omgeving", "user": "cornelis n", "date": "May 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 162453216}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Very nice gourmet restaurant, great wine list.", "title": "Wonderful", "user": "freddiepowell", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157967408}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 8, "average": 12, "very good": 33, "terrible": 8, "excellent": 35}, "aka": "Relais De La Magdeleine Hotel Gemenos", "slim_ranking": 0.111111111111}