{"user_rating": 4.0, "review_count": 146, "name": "Relais Castel Bigozzi", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We left Florence early to spend a night near Siena. Found this hotel on line and booked via telephone while we were in an internet cafe in Florence.", "title": "Beautiful Tuscan Villa", "user": "Tbelle", "date": "August 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5609927, "likes": {"liked": "— Beautiful Setting", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We got sooooo lost trying to find this place! But the staff was incredibly patient, and kept us on the phone while they guided us in. Strove is a very small town about 15 minutes drive from Siena, but if you don't look closely at the many signs when you exit the Autostrade, you will get lost.", "title": "Fab hotel", "user": "danlisa", "date": "August 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5542375, "likes": {"liked": "— Wonderful views", "disliked": "— Room not upto scratch"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Hotel was beautiful. We almost had to stay in the one room which was at the top of the stairs, but we said it was too many stairs to climb and they moved us immediately to another more convenient room off the elevator.", "title": "Beautifull tranquil setting", "user": "bobbieblue", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5532172, "likes": {"liked": "— The setting", "disliked": "— reception staff"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We were greeted with Asti Spumante and a bowl of fruit in our room. Breakfast was wonderful, staff was wonderful, room was clean, comfortable and wonderful - our only regret was that we were unable to stay there longer . . . yes, we would stay there again! Loved it.", "title": "Tuscany landscape & quiet place", "helpfulness": 3, "user": "LGSLGS", "date": "April 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5012918}, {"rating": 4.0, "title": "great location and service in the Tuscan countryside", "text": "Stayed at the castle for two nights, and it was bliss! The hotel is located in the middle of nowhere so a car is a must. The grounds are wonderful, supplying a 360 degrees view of the Tuscan countryside; even San Gimianno can be seen in the very far off distance. The pool was clean and there are plenty of chairs and sun beds.", "helpfulness": 2, "user": "blonddog", "date": "February 27, 2006", "id": 4523876}, {"rating": 4.0, "title": "Loved it! Relaxing and serves as gateway to Tuscany", "text": "Wonderful historic structure with view of Vineyards that you dream about. Not too far from Siena and Colle d'velsa (about 10Km) and serves as a great base to explore Tuscany. Simple but well detailed rooms; wonderful breakfast and very pleasant staff. Definitely eat at Le Leggenda -- a real treat! Cant wait to return!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 2, 2005", "id": 3115612}, {"rating": 4.0, "title": "A nice place", "text": "This was a delightful apartment near Siena. There was a kitchen but we booked accomodation as a bed and breakfast & so could only use by paying extra. There were 2 large rooms and a wonderful large bathroom. I liked the separation of sink from tub & shower area so two of us could get ready at the same time. My only complaint was the pull out bed in the living area. It was awful. The form was worn out and an adult could not have slept on it. (The bed in the bedroom was quite comfortable.) My teenager made do by piling up the couch cushions. The balcony had a wonderful view and the breakfast was excellent. The staff was friendly and helpful. The nearby town of Monteriggioni was interesting. The tiny store on the road where you turn was very helpful but I would suggest you come with groceries and wine as there is nothing nearby.", "helpfulness": 11, "user": "kmjmmm", "date": "July 29, 2004", "id": 2332839}, {"rating": 4.0, "title": "Loved the Castelbigozzi", "text": "We were sent to the Castelbigozzi from the small tourist office in Monterrigioni after being unhappy with where we were staying. It turned out to be the perfect place. On a hilltop with great views over a rolling countryside. We had a 2 room suite with kitchenette and sofa bed for our daughter. The staff was friendly and intimate, and the pool was large and peaceful. It was exactly what we were looking for.", "helpfulness": 5, "user": "Howiekap1", "date": "September 10, 2003", "id": 1278311}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "If you loved the movie, \"Under The Tuscan Sun\" you will love Castel Bigozzi. Location, Location, Location! This is in the small town of Strove and between the lovely walled city of Siena and San Gimignano. It is a hard place to find especially in the dark. But, well worth it.", "title": "Surpassed Our Expectations!", "helpfulness": 5, "user": "Gabrella", "date": "November 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4127342}, {"rating": 4.0, "title": "Loved the Bigozzi!", "text": "You do need a car if you are going to stay here. And, the great thing is if you get lost, people are so friendly to help you find your way.", "helpfulness": 2, "user": "MJSKS", "date": "November 11, 2005", "id": 4106088}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "Our room was upstairs and had tuscany surrounding us at every angle. Our breakfast was good too. Our luggage was lost upon arriving in Rome therefore we had to wait till 6pm for it to arrive and needed to check in past Castle Biggozi's normal hours. They were very hospitable and made arrangements for us to get our key after they were closed. In addition, we had missed breakfast because we were so tired and they brought cappucino's and croissants to our room. We stayed their 3 nights and I wished we could've stayed longer. Its so beautiful and relaxing in Tuscany. The room was spacious and came with a small kitchen, fridge and dishes to use.I highly recommend this place.", "title": "Not what we expected", "helpfulness": 2, "user": "yankel", "date": "November 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4092554}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We loved the Castel Biggozi! We were there pre-Relais but fully understand why they bought it. Our room was spacious and opened up to a patio that overlooked acres of rolling vineyards. Heaven! The people were very nice and very helpful. Buffet breakfast was lovely and the location was A+ for daily trips through the hilltowns. There is one restaurant in Strove (La Leggenda dei Frati) and it was excellent. I would most certainly return to Castel Biggozi!", "title": "Idyllic location", "helpfulness": 4, "user": "griffjd", "date": "September 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3911381}, {"rating": 4.0, "title": "A nice country inn", "text": "We stayed here in late October. the room we were given was on the very top floor. You ride an elevator up one floor and then climb narrow steps to the room. we asked for another room - but were told that none were available. The hotel is a little hard to find although it is a quick drive to the autostrade once you know the way. It did not meet our expectations of staying in a Tuscan Villa.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3747056}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 14, "very good": 54, "terrible": 1, "excellent": 69}, "aka": "Relais Castel Bigozzi Hotel Monteriggioni", "slim_ranking": 0.3125}