{"user_rating": 5.0, "review_count": 41, "name": "Relais dell'Abbazia", "reviews": [{"rating": 5.0, "title": "such a beautiful b&b!! what a great place!", "text": "we stayed here for 2 nights and it was incredible!! the place is beautiful, great great style! the breakfast was very good in a beautiful little garden on the back. the owner was the nicest! she really cared for us and gave us food and drinks whenever we wanted. it's in a great location, in a quiet area, walk distance from the center.", "user": "808Reut", "date": "August 14, 2012", "id": 137194983}, {"rating": 5.0, "title": "An absolute gem!", "text": "My husband and I spent one night (sadly, only one!) at this utterly charming property while attending Aida, the opera. The attention to detail surpassed many 5 star hotels - from the lighting, to the amenities, and the perfect breakfast al fresco. Very quiet, welcoming, and cosy. We have recommended it to many friend already and look forward to returning with more time.", "user": "L N", "date": "August 12, 2012", "id": 136984868}, {"rating": 5.0, "title": "An ideal place for a family or a a romantic holiday", "text": "I with my husband and daughter of two months spent two wonderful days here. The hotel is located on a cozy street. A very nice and stylish place, with very friendly and helpful host. 15 minutes walk to the center. Rooms have own separate bath and entrance, and a cozy garden. Amazing breakfast! If you ever dreamed to spend time in Verona with perfect comfort - this is the place for you.", "user": "SvetlanaBelso", "date": "July 24, 2012", "id": 135255328}, {"rating": 5.0, "title": "Romantic & cosy", "text": "Just been to the Relais. One of the most charming places I have been. Everything has the cosy italian touch. Quality of materials and anenities are top of the range. Very close to the superb San Zeno Church. A 15 min delightful walk to the city centre along Verona's river.", "user": "Fab V", "date": "June 18, 2012", "id": 132205646}, {"rating": 5.0, "title": "Great location, immaculate presentation, wonderful hospitality", "text": "We booked 3 rooms at Relais dell Abbazia for a week during half term, travelling with my parents and our 3 kids aged between 3 months and 13 years. This could have been a recipe for disaster, but our choice of accommodation really made a big difference to our week. The building itself is ancient and very characteristic, My view in the morning was of the pretty garden, with the persimmon tree at the window and the sound of bells from nearby San Zeno church - very romantic! The rooms are of a very high specification. I've stayed in hotels for a lot more money which have a lot less thought gone into them. Although the building is old, the rooms are immaculately presented, with lovely wooden floors and beams, decorated in creams and very tastefully done. The bathrooms were also very high spec, with excellent showers, tiling and lighting. The kids were delighted by the wifi (no problems accessing the internet) and the English TV channels on the TV in the sitting room which came with our rooms. This was our new babies first trip away, and miraculously he loved his travel cot in our room, and didn't sleep in our bed once (at home he hated his crib!) It is an easy walk into town along the river past the Castel Vecchio, and the church of San Zeno is amazing, and just over the road. The parking in on street, but wasn't a problem. Francoise the owner did everything she could to make our stay a happy one, including even holding the baby while we ate breakfast! The breakfast is continental style cereal, croissants, coffee and fruit juice etc, Some travellers may expect cooked breakfast, but we tend to eat so well in Italy that its a relief not to have a big cooked breakfast. Are there cheaper B&B's in Verona? Yes. Are there nicer ones? I doubt it!", "user": "RLJUk", "date": "November 7, 2012", "id": 144821168}, {"rating": 5.0, "title": "A superb place to stay...", "text": "Wow! We were lucky to stumble on this charming place. Soooooo much better than any impersonal hotel. The Original structure was built in 1070. It now has stunning grounds, each room is prettier than the next and everything is perfectly appointed. The web photos do not lie! The breakfast is amazing, the Internet actually works, and the location is fabulous for walking anywhere. Benissimo!", "user": "Freizer", "date": "September 17, 2012", "id": 140516443}, {"rating": 4.0, "title": "home from home", "text": "We spent one night at this lovely relais early September. Its location is just perfect - an easy and pleasant walk to Verona's old centre along the river walls with great views of the mountains to the north.", "user": "4traveljunkie", "date": "September 11, 2012", "id": 140021388}, {"rating": 5.0, "title": "Wonderful place to stay", "text": "We really liked the welcome by the owner and her lovely dog Sherpa - and the room was clean, comfortable and very practical. The bowl of freshly-washed grapes in the room was a treat, and we also liked the tea/coffee making facility for guests on the same floor. We had an extensive and leisurely breakfast in the small but pretty garden.", "user": "AlexandraArata", "date": "August 29, 2012", "id": 138831761}, {"rating": 5.0, "title": "Romantic city trip", "text": "The road is quiet and makes for a good night's sleep - though we would have wished for some softer pillows (the pillows are very hard and - although its personal taste we know - it would have been nice to have had the choice of some softer ones too). Just one other thing; if you are driving without a GPS its quite hard to find.", "user": "Carolinevioline", "date": "August 26, 2012", "id": 138405148}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 4, "terrible": 0, "excellent": 37}, "slim_ranking": 0.0547945205479, "description": "An antique dwelling just a few steps from downtown VeronaFormerly a section of barn within the Benedictine complex close to San Zeno Abbey, the dwelling that host “Il Relais dell’Abbazia” is located in Verona’s historical quarter (the Arena is at just ten minutes away).A cosy and quiet atmosphere welcomes guests, caused by thick walls and low ceilings reflecting a dimmed and relaxing light."}