{"user_rating": 4.5, "review_count": 934, "name": "Renaissance Saigon Riverside Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Arrived very late around 1130 pm and check in was fast and smooth. Got complimentary upgrade to Club level because of being Platinum member. Room is very spacious and very clean. Free bottle water was always provided and few times a fresh fruit:) Bathroom was very nice too. We stayed on 19 floor.", "title": "Great stay", "user": "Aruba2004", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176395310}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Club Lounge is very nice and service is very good. there was an option to eat downstairs in restaurant, which we did every morning. Lots of choices.", "title": "Lovely Stay", "user": "nessytp", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176266091}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "SPA was really nice and well priced. Customer service is great, they are really trying. Ate at Chinese restaurant once and it was very good. Taxi is always available at the front door and very cheap. Would stay again. Great location and view of the river is awesome.", "title": "A pleasant stay", "user": "Woodizz", "date": "September 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176199505}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This hotel is quite central and close to the Saigon river. We stayed on the 10th floor with a street view. This did not bother us as it was quite pretty if you looked down at the street at night. Room was spacious, comfy and very clean. The breakfast was buffet and a bit of everything Vietnamese or Western if you prefer. Dinner buffet was fantastic, you choose the seafood and it gets cooked for you. The view from the roof top pool is amazing and you can get an almost 360* view of the city. The staff are very friendly and helpful, service was outstanding!", "title": "Amazing!", "user": "Jemma S", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176146095}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The hotel is just opposite the Saigon river so you can have a very good view if you book for that side. However, it would require you a healthy walk to reach the center where the activities are going on.", "title": "Good hotel and outstanding service", "user": "Nana R", "date": "September 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176066008}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "This is an excellent hotel. The room I stayed in was good. The toiletries provided were wonderful. Very clean room. View from room wasn't so good. Comfy bed. Stationary provided. Air con was good. Rooftop pool was a good location to see all of Saigon. Very helpful staff. They had an orchestra playing in the reception area. Streets near to hotel a little uneven or under repair, bit far from all the 'action' if you were going to walk. Top marks for the experience.", "title": "Good hotel", "user": "wanderingbedu", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 13439861, "likes": {"liked": "— The attentive service", "disliked": "— The fact it rained on the open air pool"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This hotel was an exceptional value in a nice location. The room was spotless and well appointed. The breakfasts were very impressive with the assortment of fresh fruits and local fare; as well as those catering to a western audience. The tables by the window where the hustle of scooters flying by sharply contrasted the calm dining area; and was a great experience each morning.", "title": "Luxury oasis in bustling city", "helpfulness": 1, "user": "paletexan", "date": "February 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13296989, "likes": {"liked": "— Location, rooms, and the breakfast", "disliked": "— Nothing comes to mind."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "There are some excellent local markets around the corner, and for those less adventurous, there are several high end restaurants and shopping. If you get used to walking in the city; the hotel is in walking distance to many sites.", "title": "Very good hotel, great location", "helpfulness": 1, "user": "ambientson", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13264665}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The staff was very friendly, and even gave us a gift of candy since we enjoyed the banana and sesame candies they stocked in the front. The fitness facilities were great, and there was a nice rooftop pool with great views of the city and river.", "title": "Riverside Hotel - good location", "user": "zippy2", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12778812, "likes": {"liked": "— location and price", "disliked": "— meals a bit expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The only thing you don't want when booking a 5 star hotel is to be disappointed.", "title": "excellent choice", "helpfulness": 1, "user": "lowl", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12759292}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "This hotel is on the further end of Dong Khoi area in District 1, away from the bustling traffic and honking of automotives during peak hours. Was upgraded to Club Floor as i have a Marriott Elite Gold Card. Tried the breakfast at the coffee house instead of the Club Floor. Breakfast is marvelous & almost a very wide coverage of selections available including some Indian foods. Facing the riverside & extremely convenient if you had opted for a river cruise scenic tour or dinner. Helpful staffs & most of them speak understandable English. Rooms furniture a bit outdated but clean including the bathroom. Has a coffee maker & also has an interconnectivity kit where there's USB, HDMI, apple ipad charger cables & etc.....", "title": "Wonderful stay", "user": "Yap W", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174452218}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The hotel is located in the main business district, most of the places that one may want to visit will be nearby. Service by the staff was very good with quick solutions. The food options for a vegetarian were limited. Almost the entire experience with the hotel was very good except with the front desk in getting the nights credited in Maritt Rewards program.", "title": "Nice hotel with a good location", "user": "NehaPradeepJain", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173152682}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We arrived in the Renaissance Riverside hotel around 13:00 pm. Check in was fine and the staf was very, very friendly. We were shown our rooms, which were awesome. This was our second stay in Ho Chi Minh City, but the first stay in this hotel and we were really impressed.", "title": "Awesome hotel, lovely staff", "user": "Bob F", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172375507}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The room looks very American, but was very comfortable. Big bed, good bathroom and it was very clean.", "title": "Reeeeeally Unpleasant Stay!", "helpfulness": 3, "user": "magicalphoenix", "date": "August 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 172277906}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "After seeing the rooms we had lunch in the restaurant, which was really good we went out and saw the Was Remnants Museum for the second time, you can not miss that one!", "title": "Wow!!", "user": "Furhank", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172225201}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here for three nights having arrived from Hoi An.", "title": "Ok if you need a bed", "user": "AlexxxOz", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 171982049}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Reception staff and check-in was quite smooth without any issues and good knowledge of English. We were on the 6th floor in a standard room which we didn't mind. Upon opening the door the room smelt quite \"wet\". We assumed that maybe it was just cleaned and hence it still had a bit of a \"damp laundry\" smell. We settled in and wanted to plan our excursions to find wifi wasn't free. Having had this in every hotel right down to the cheapest of restaurants it surprised us. Turns out that we had to join the Hotel Chain Club and would then be given complimentary access. By the time this was all sorted a few hours had past but in the end it was all good.", "title": "Club Facilities Renaissance Riverside Hotel Saigon", "user": "dontone", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 171851146}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We hit the town and came back later to find the room still smelt damp. Ok - let's not have the airconditioner on 22degrees and see if it rectifies itself.", "title": "Value for Money, 24 hrs Fitness", "helpfulness": 2, "user": "AmyAngkana", "date": "August 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 171603593}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Next morning we had our beloved breakfast buffet which is our favourite part of the day. Sadly I have to report it was not up to any of the others we had on our 2 week holiday across the many other hotels.", "title": "stay here... it's brilliant", "helpfulness": 1, "user": "Michael12334", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171460659}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "It looks quite good with a lot of selections but the taste is a little bit bland. Poached eggs are pre-cooked and then briefly dropped into hot water when you order them, so when you cut them open the inside is still cold. Choose the freshly cooked fried eggs or scrambled eggs instead.", "title": "Beautiful view of the river from the room.", "user": "Kyle L", "date": "August 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171176935}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel was OK but not great. On arrival, they tried to stick me in a really small room. They did a really hard sell to try and get me to the executive top floors for about $50 more, or he said the only other option was this really small room on a lower floor. This despite me requesting an upper floor. Note, it's really noisy on the lower floors due to the busy street below and windows that do not completely close, but have a crack in them. After the hard sell, I told him I was unhappy with his options, and he finally said that if I waited til the afternoon, they may have another room for me. I said I'd wait, then suddenly, another room appeared, which was the type I had already reserved. I was very unhappy that I had to \"bargain\" on arriving in a forign country after a long flight. I felt he was really trying to just manipulate me to the higher end floor and must get a bonus or commission if he sold me. I was proud of myself for holding out until he finally gave me what I had reserved. Otherwise the hotel was fine. Nothing special. Doesn't really seem like a 5 star hotel, but the only one on the river, although the road noise below if pretty loud. Might consider the Sheraton next time, although prefered being on the River, altho no where to really walk along the river anyhow.", "title": "OK - but not great", "helpfulness": 2, "user": "LosAngelesRaphaelhom", "date": "January 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 12592686, "likes": {"liked": "— Location", "disliked": "— High pressure sales guy at check in and the noise from the street below"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We've just returned from a 6 night stay at the Renaissance and the hotel definately lived up to our expectations. Fair enough, if you have stayed at 5* hotels in other countries in the Far East (say Thailand for example) you may be a little disappointed as the bathrooms are on the old-fashioned side and in need of updating. However, I think for a stay in HCMC, the Renaissance is an excellent choice. The location is perfect (Dong Khoi Street is a short walk away as are the Reunification Palace, the Notre Dame Cathedral and the General Post Office), the staff are exceptionally friendly and professional and the rooms have all the amenities you would expect from any 5* hotel (robes, slippers, complimentary water, etc). Also, the beds and pillows are extremely comfortable. We didn't eat at any of the hotels restaurants as its so cheap to eat out so unfortunately cannot comment on any of the food choices available. Also, despite being on a busy roundabout by the ferry points on the Saigon River, we couldn't believe how quiet the rooms were (mind you, we were on the 12th floor!) If we were to return to HCMC, we would definately choose the Renaissance again.", "title": "An excellent choice for HCMC", "helpfulness": 2, "user": "MadamMuck", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12492896, "likes": {"liked": "— Location", "disliked": "— Bathrooms need updating"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My girlfriend and I stayed here for 2 nights in January 2008. We arranged the hotel via a special program, so it was a \"city view\" (i.e. a direct view into the office building next door) and didn't include breakfast or internet. However, for the $100 we paid per night, this was a very nice hotel.", "title": "Very Nice Hotel", "helpfulness": 3, "user": "Talaga_LA", "date": "January 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 12480804, "likes": {"liked": "— Comfortable room"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The bed and linens were very comfortable and the bath was very well appointed (and had great, absorbant towels). The room included the standards (tv, mini-bar, in-room safe, ...). Towels were changed twice per day and special requests were honored. Front desk staff and door clerks were helpful and friendly. Overall, we had very good service while at the hotel.", "title": "If you want to go all out, try the Park Hyatt", "user": "marils_sf", "date": "January 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 12399272, "likes": {"liked": "— location", "disliked": "— overpriced breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The pool on the roof is nice, but as noted in other reviews, there aren't enough lounge chairs. On Friday and Saturday nights they have a BBQ next to the pool. It seemed expensive and there were many other very good restaurant options in the area, so we didn't try it. It smelled good though.", "title": "Enjoyable experience", "user": "SnEEkEy", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11999834, "likes": {"liked": "— location", "disliked": "— Food somewhat pricey. Room internet is expensive."}}, {"rating": 5.0, "title": "An excellent place to stay", "text": "We visited Vietnam Nov/Dec 2007 and stayed for 3 nights on the HCMC leg of our holiday at the Renaissance. We booked a river view on the club floor and on arrival we were upgraded to a suite. This comprised of a double bedroom, bathroom, lounge and study area and a separate cloakroom. The suite was on the corner of the building and had a duel aspect overlooking both the city and the river. It was great to just watch the activity on the river and the coming and goings on the streets.", "user": "DebWarwickshire", "date": "December 9, 2007", "id": 11372495}, {"rating": 3.0, "title": "Very Overrated by Reviewers", "text": "The quality of the room and the housekeeping service was very good indeed, the turn down service would always replace the used towels and any toiletries; chocolates were left for guests each night. The bathroom was a decent size with separate shower cubicle and the toiletries were of a good quality.", "user": "SkepticalGuest", "date": "November 14, 2007", "id": 10822725}, {"rating": 4.0, "title": "Good Quality Stay", "text": "The club floor has a small dining/lounge area where breakfast is served and in the early evenings there is a complimentary bar and hor’dourves. This is a very pleasant way to prepare for your evening. There is also complimentary internet both wi fi and hard wired.", "user": "beats21", "date": "November 6, 2007", "id": 10643281}, {"rating": 5.0, "title": "Great Stay", "text": "The breakfast was of a good standard although my only complaint was having ordered eggs benedict on my last morning, I was still waiting for my order some 20 mins later. This was a special order which would have to be produced by the hotels kitchens and not the club floor; however the timing was not acceptable. The eggs did arrive eventually some 25 minutes after order but to be fair the supplementary cost of $6 was waived due to the delay in service.", "user": "04-03-06", "date": "October 20, 2007", "id": 10168021}, {"rating": 5.0, "title": "Reliable option in HCM", "text": "We found the staff extremely helpful, always smiling and very happy to assist with anything. Okay so there English isn't brilliant but we are in Vietnam, the supervisors and managers certainly have good language skills. Again concierge were very helpful, whether you wanted a taxi, directions or local recommendations they were constantly on the ball.", "user": "p750777", "date": "October 18, 2007", "id": 10106850}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Excellent service. The riverside view is beautiful. It faces the busy boat jetty, the silent Saigon river and greenary. In the far site one could view the upcoming new city with multi-story buildings.", "title": "Value for Money amongst all the luxury hotels in HCMC", "helpfulness": 1, "user": "SivaBangalore", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175456074}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "The hotel is also well positioned in terms of accesibility to city centre and business districts.", "title": "I LOVE THIS PROPERTY", "helpfulness": 1, "user": "pompui", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175380547}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I have stayed here often where Doris Marchardt runs a fabulous property. The staff is terrific and the exec lounge is a delight. I love the location, the view, everything. Rooms are lovely. Restaurant is great! Enjoy!", "title": "Great Hotel with Great Service", "user": "Joe C", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174778026}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Be SURE to sign up with Saigon River Express (reviewed here a lot) across the street for the Mekong River tour. It will be the HIGHLIGHT of your trip to vietnam...you must believe me on that!", "title": "Best Views in HCM City", "user": "keneverywhere", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174765547}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Service:", "title": "Lovely hotel, great location", "user": "Heather M", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174489093}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Lovely hotel in a great location in HCMC. Rooms were large and well appointed. Hotel bars and food were excellent, especially the pho for breakfast. Exec lounge was lovely and peaceful mostly, with a decent mix of tourists and business people. Usual high standard of food and drink on offer within.", "title": "Great location, great hotel!", "helpfulness": 4, "user": "toneer", "date": "October 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10053633, "likes": {"liked": "— Location, exec lounge, pool", "disliked": "— nothing springs to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The pool upstairs was adequate and the lunch served up there really nice. You get a lovely view from the top - see pics.", "title": "Fabulous Hotel", "helpfulness": 5, "user": "CarlotaeNuno", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8550596, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "My advice would be to pay the extra for exec lounge access and get a river view room as high as possible - you're never going to fully drown out the road noise of the bustling streets of HCMC, but every little helps. beep beep!", "title": "Friendly hotel at a great location", "helpfulness": 4, "user": "chezkelly", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8500305, "likes": {"liked": "— Location", "disliked": "— Breakfast not included for internet booking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Stayed ate the Renaissance for 3 nights after a 10 days travel in Vietnam. Renaissance is a fabulous hotel. Nice, big and clean rooms. Nice and safe location. The restaurant is very nice. Good breakfast and great dinner buffet whit lots of seafood and sushi for a great price. Nice shops around the hotel. Enjoyed a day trip to the Mekong Delta. Would stay here again!", "title": "Fab Hotel", "helpfulness": 10, "user": "AAGill", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8420457, "likes": {"liked": "— Very comfortable, spacious and clean", "disliked": "— The noise from the outside traffic"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Stayed 5 nights here. The room was very clean and comfortable. The twin room comes with a sofa set. Aromatic toiletries provided. Good sets of clean towels and promptly changed even during night service. Coffee making machine and coffee powder for a fresh brew. Gym a little small and well patronised. Rooftop pool has great river view and an oasis in town. Very friendly and welcoming staff all round and no hesitation to recommend the hotel. Good restaurants in the vicinity.", "title": "Great Western Style Hotel in Saigon", "helpfulness": 2, "user": "AAMiles", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8130871, "likes": {"liked": "— Rooms, service", "disliked": "— View from the city side were of the next office building, not really of the city"}}], "location": {"country": "Vietnam", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 17, "average": 95, "very good": 398, "terrible": 8, "excellent": 416}, "aka": "Renaissance Ho Chi Minh City", "slim_ranking": 0.0529411764706, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Strategically located in the heart of Saigon's business and entertainment district, the Renaissance Riverside Hotel Saigon offers warm hospitality, first-class amenities and incredible panoramic views of the Saigon River. Ho Chi Minh's famous landmarks such as the Reunification Palace and the beautiful Opera House are all within strolling distance as are numerous sellers of Vietnamese arts and crafts: a fascinating mix of commercial, retail, entertainment and cultural highlights at your door. Pamper yourself in a newly refurbished club room and after a day of meetings or sightseeing, take a dip in our rooftop pool,relax at our sun soaked poolside terrace. Alternatively enjoy a drink in the Atrium Lounge, a leisurely dinner at Kabin Chinese Restaurant or dine in our Riverside Café for Western and Vietnamese culinary delights. If you are looking for a hotel for an event or meeting the Renaissance Riverside Hotel Saigon offers meeting facilities which include natural daylight and river views"}