{"user_rating": 4.5, "review_count": 350, "name": "Renaissance Tampa Hotel International Plaza", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I bid through priceline for a four star hotel and we were so lucky when this hotel accepted our bid. The location is EXCELLENT!! The only complaint that we had was the shuttle service to the hotel. We were told that the shuttle was waiting for us, but it took two phone calls and a 30 minute wait before the shuttle showed up. After that hurdle, everything was smooth sailing. If we ever cruise out of Tampa again, this is our hotel!! We didn't arrive until after 9 pm but since the hotel is located next to the International Plaza (http://www.shopinternationalplaza.com), we didn't have any problems finding an excellent meal just steps away at Champps Restaurant and Bar. The following day, we slept in late and then left our luggage at the front desk while we walked back to the International Plaza for lunch at the Cheesecake Factory. (Don't be mislead by \"walk\", you merely travel up a flight of stairs and around a corner into a courtyard where numerous restaurants are located along with an entrance to the mall which also includes a regular mall food court.) After lunch, we took a leisurely stroll through the mall to walk off the Cheesecake and to purchase a few items we forgot to pack. Afterwards, we returned to the hotel where a taxi was waiting to take us to the port. After a $25 charge for the ride to the port, we were off on our cruise. Beautiful hotel, wonderful staff, safe and clean area, everything you need just steps from the hotel.", "title": "Perfect pre-cruise hotel", "user": "LBGDTF", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101322712}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "I booked this hotel at the last second as we decided to attend the NCAA Basketball Regional in Tampa. I knew it was not close to the downtown arena, but I also knew it was not too far away. I had no real expectations, but was pleasantly surprised. It has a different fell from the second you walk in. I don't know how to describe the hotel decor, but perhaps it is an old Florida or even Spanish feel. It has an interesting design and a very nice outdoor courtyard. It has a pretty good fitness center and a large outdoor pool with a hot tub. The rooms are pretty good sized with large flat screens. The bathrooms are nice as well. The hotel is next to a very upscale mall and right next to an outdoor restaurant complex that is part of the mall with many great choices. Parking is free.", "title": "A Surprise in Tampa", "user": "FTLAW", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100902932}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "The Renaissance Tampa Hotel is an newer hotel in the area..", "title": "Plesant Upscale hotel", "helpfulness": 1, "user": "Traveling_Lady_2004", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98396445}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Lobby area is beautiful.", "title": "Excellent Choice for a Tampa stay", "user": "FloridaGators", "date": "January 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92485449}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Rooms are comfortable and decorated nicely; bed comfortable. Bathroom clean and had all amenities you would need. The front desk staff was outstanding, willing to help out in any way. There is a free shuttle to the hotel. I would suggest calling the hotel for pick up. The shuttle driver was a delight talking about Tampa, letting me know what is around the airport area and that I made a good choice to stay at this hotel.", "title": "Thin Walls but nice", "user": "alligirl3883", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 91696211}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The room and bathroom are standard hotel size, clean and have all the normal amenities you would expect from a mid-range hotel. The website mentioned iPod docks in each room but we could not locate the iPod dock in our room specifically.", "title": "Nice hotel.", "helpfulness": 1, "user": "DuffyDo", "date": "June 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 114557680}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We were allowed to check in early as I requested. We planned on lounging poolside until the evenings festivites at International Plaza were to begin but the pool was in really bad shape. LOTS of dead bugs and other debris in the water. I couldn't tell when the last time the pool was actually skimmed and/or cleaned. I let the front desk know and we opted to hit the hotel bar instead.", "title": "I always stay at this great hotel when in Tampa", "helpfulness": 2, "user": "scoobytrips", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114382441}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The bar is small but the bartender was friendly and on top of the orders we placed. It's expensive but aren't all hotel bars for the most part. $96 (including tup) for 5 drinks, a basic cheeseburger and a sampler platter of appetizers.", "title": "Very nice hotel at a reasonable price", "user": "tomjackfl", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114073977}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "After returning from International Plaza's bar area in the wee hours, we ordered room service which was prompt and friendly. All staff we interacted with during our brief stay was very pleasant and helpful.", "title": "Favorite Tampa Hotel", "user": "afamily04", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113205703}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel would be perfect for a mom and daughter shopping weekend.", "title": "Great Place!", "user": "steveDallas_TX", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112586083}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "This is a very nice property. Rooms are modern and clean. There is a nice outdoor courtyard in the middle of the hotel that gives it a European flair. It has everything you would expect from a hotel in this class.", "title": "Pleasant hotel but odd location", "user": "xy223yz", "date": "June 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 111118089}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "However, its location is a bit odd. In fact, this is a major shortfall of the property. Simply put, the hotel is attached to a shopping mall. As a result, you are parking in what boils down to the shopping mall parking lot. My room, and one entire side of the hotel, overlooks the mall's dumpsters.", "title": "Great Value and Location", "user": "nware1", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111030737}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "If you want to stay where you shop and be very close to the airport, then the location should not bother you.", "title": "Great Location - Beautiful Hotel", "helpfulness": 1, "user": "cnncreech", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 110298590}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed here for one night, prior to flying out of Tampa the next morning. Typically when you stay near the airport in a major city, there is not many options near by for dining, shopping, or to kill time. This hotel is attached to the International Plaza which is full of restaurant options from chains like Champps and Earl of Sandwhich to a nice Italian Restuarant, English Pub, or New York Deli. Not to mention all of the shopping from Louis Vuitton to Dillards.", "title": "Beautiful hotel and convenient to shopping/nightlife!", "user": "hfitzger", "date": "May 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 106500828}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The hotel staff was some of the nicest I have met. I am Marriott Platinum, and the hotel desk manager was one of the nicest I had ever met. Great service.", "title": "BEWARE of your CREDIT CARD", "user": "FirstClassLuxury001", "date": "April 17, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 104415040}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I brought my teenage son so we could Christmas shop at the International Mall. For all practical purposes, this Hotel is NOT a family oriented Hotel. Obviously they do not care about normal people. Just the dollar. The bottle of water already in the room costs 4.50 if you open it and/or drink it. I feel it is a trick to rack up your bill unaware. The internet is 13.00 a day just to connect to. They say you can use the interenet in the lobby for no charge, but you can only access their webpage. another farce. The iron was broken, there was dried toothpaste all over the vanity when we checked in, andthe bed cover had dark spots all over it and it looked like it just came out of a paper sack. (creased and wrinkled). I look for cleanliness when I travel and especially when I pay what I did at this Hotel. Although The housekeepers were very nice, I was afraid to touch anything for fear there would be hidden charges pop up on my folio. Sorry, not for me and i wont come here again. Ill go across the street.", "title": "Nice but not practical", "user": "butrflie50", "date": "December 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 88963916}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "We had very little interaction with the staff, but when we did they were friendly and allowed us to check in early upon request. The rooms were good, comfortable beds, very nice and pretty new looking. I liked the decor. They were extremely quiet, which was great, I slept well.", "title": "Very nice hotel, though their internet policy is misleading.", "user": "kyleracine", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88704135}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The only thing I didn't like was having to pay extra for internet. I'd much rather internet be included in the total price than feel like I'm being nickled and dimed. I was upset because on the website when you click to pay for \"24 hours\" of internet they don't tell you that the 24 hours is from 12pm-12pm, it doesn't just start whenever you click. So I paid at 10m one night thinking it would last until 10am the next morning and nope, SURPRISE! I had to pay again in two hours at midnight. Incredibly annoying and shady policy on that.", "title": "Great Location, Nice Amenities, Staff/Operation Could Be Better", "helpfulness": 1, "user": "Marrasyn", "date": "November 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 87624057}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Our arrival was immediately tainted... we received an email offering upgrades, including a club level option. We decided to take that upgrade, only to learn that they only run the club lounge Monday-Friday. After speaking to two less than helpful staff members, a manager was able to resolve the issue by comping our breakfasts and upgrading our view. Still no good explanation why we received the incorrect offer in the email though and I believe we wouldn't have received anything, even an apology, if my husband hadn't persisted and spoken to a manager.", "title": "Excellent Service and great location", "user": "sdegeorge", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84494639}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Also, we happened to be staying there while a large wedding was occurring. We arrived back to the hotel one evening only to see NO hotel parking available, unless we wanted to pay for valet. The valet said we could simply park in the mall parking lot... I read here that people had been towed for this, so I was reluctant. So, I spoke to the desk staff who assured us there would be no issue. I was uneasy, but agreed. Did I mention that there was an entire gated hotel lot that was being kept empty for whatever reason?", "title": "Great Meeting experience", "user": "tampagirl2505", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83469792}], "location": {"country": "United States", "city": "Tampa"}, "stars": 3.5, "variance": {"poor": 10, "average": 24, "very good": 113, "terrible": 4, "excellent": 199}, "aka": "Renaissance Tampa", "slim_ranking": 0.0632911392405}