{"user_rating": 4.0, "review_count": 769, "name": "Renaissance Las Vegas Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "great check in and concierge svc. friendly and helpful staff. QUIET. A quick trip to The Strip using the monorail's 3-day pass took us quickly and efficiently. We'll definitely stay there again.", "title": "the perfect stay", "helpfulness": 1, "user": "BeemerPilot", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115582882}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed here over the weekend to enjoy a couples weekend. Chose hotel due to great internet promotion. Knew it was off the strip, but confident in the Renaissance brand. Hotel is small by Vegas standards, but very modern and clean. Could see it being a great hotel for conventioneers. It can be ghost town when there is no conference going on. Easy drive to strip and monorail station is not too far away. Parking was free (valet and self) Room was spacious and bathroom had a separate shower and tub. Walls are a bit thin as we heard occupants kids next door yelling and wresting. We enjoyed Envy for an afternoon snack and service was good. Calamari and flat bread was good. They had a wine tasting that was complimentary which was nice. Would not hesitate to stay again given an great rate.", "title": "Just far enough from the Crowds", "user": "outof714", "date": "July 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115488078}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The Renaissance Marriott is your best choice when attending trade shows at the Las Vegas Convention Center. It's steps from the south hall and allows quick trips back to your room or to grab a quick lunch. The best part is that it's not a casino. It's very relaxed, clean and upscale. The Envy steak house is perfect for client lunches and dinners as well. I would not recommend for families as the pool is small and in the shade most of the day. It's also a bit of a walk to the stirp. During busy conventions, the cab line here is far less than in front of the convention center or the Hilton.", "title": "The only choice when working at Las Vegas Convention Center", "user": "HobieKat", "date": "July 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115396663}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This was a mixed bag experience! Although we had excellent first impressions of this modern and well equipped hotel we were very upset to learn that they did not offer free WIFI at all - it was $19.99 if we wanted 24 hours and be linked to our room's HD TV which I felt reasonable but they also wanted $13 fo 24 hours connection (per devise) if we'd brought our own smart phone or laptop :(", "title": "Renaissance hotel :/", "user": "Nick0demus", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115174988}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "come on guys - this is the 21st Century or are times really that bad?", "title": "Exceeded our expectations!!", "user": "suzycpa", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115018550}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Nice room, but they did not clean it. They closed the pool early on a Saturday night. Close to convention center, but away from good dining. The staff were not sympathetic at all. It was an ok stay, but I would not choose this hotel again.", "title": "Could have been better", "user": "B435", "date": "June 13, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 112991211}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Just finished a 5 day stay. I was looking for a quiet property without a casino that was close to the Convention Center. The Renaissance fit the bill perfectly.", "title": "Great Stay", "user": "KCMA79", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111383560}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The room was large, modern and clean. The bathroom was large with a sep. tub and shower. Large plasma screen TV with many HD channels.", "title": "Great location. Very nice staff. Room 1208 was great", "helpfulness": 1, "user": "Cloud9west", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 110796446}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hotel is off the Strip but the monorail stop is just next door . It is a 5-10 min walk to the North Hall of the Convention Center.", "title": "Nice place except for stained sheets, mildew in shower", "user": "gr8ful2travel", "date": "May 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 110557567}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The staff was outstanding. They were always cordial and helpful.", "title": "Looks good but terrible ammenities", "user": "pantypolice", "date": "May 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 1.0}, "id": 108403387}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I've stayed here many times, but not in the last two years. I was very pleasantly surprised this time with the recent upgrades. The tiny, fuzzy TV is now a 50\" flat screen with pretty much all HD programming (60 channels, 5 HBO channels!). The gym has 5 Precor treadmills, compared to the mismatched cheap ones before. The Club (concierge) lounge has great food (breakfast and afternoon snacks,) but the greatest part is the staff--all great, but in particular, Christina, who is simply the friendliest and most helpful staff member I've ever met at a Renaissance club lounge.", "title": "Excellent Club Lounge and great overall hotel", "helpfulness": 2, "user": "PDXBigGuy", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115874681}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The room, bathroom, check-in/out, internet (free to Platinum and Gold members), and decor are all great. There's also a very useful safe and small fridge in the room.", "title": "The hotel is a convenient place to stay for those attending conferences at the convention Center, Las Vegas.", "user": "RitaGurgaon", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115849682}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This hotel is very convenient for those attending conferences and concerts at Las Vegas convention center. It is only a short walk away from the center. There is an Indian restaurant close by. The hotel is a good option and provides value for money. The rooms are spacious and clean. The staff at the concierge is most courteous. The front office staff is equally efficient and quite responsive to the needs of the customers.", "title": "Nice Hotel - Too Far Away from the Strip", "user": "irishfaith", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115696135}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This was a very nice hotel. I was travelling for a business conference. The rooms were nice and the meeting areas were good. This hotel only has one restaurant onsite and it's very pricey. They have a cafe style place to grab a drink or snack, but nothing substantial.", "title": "Deteriorating", "helpfulness": 1, "user": "mlasser", "date": "July 22, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115660211}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The pool is also in an odd location - it's in the courtyard of the hotel of the first floor, so the sun is limited and it's awkward because everyone in the hotel can see the pool from the lobby. Especially bad if you're there on business and want to sneak away - there's no way to do it because all of the meeting rooms are surrounding the pool.", "title": "Nice location.", "user": "raesive", "date": "July 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115621169}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "This is a really nice looking property. My wife had a convention so it's location was very convienent....right next to the LV conference center. And it was nice that it was not a casino, quiet. We stayed 3 nights. Unfortunately there were many things that were just not right. First of all we arrived at 11:15 a.m.. We did not expect to be able to check in so early. The check in lady was very nice. Timarra I believe. She told us to come back at 3 and see if our room was ready. After that, we stood in line for 20 minues to check our bags at the bell desk. One guy there to check in a long line with many people with many bags. At one point another bellman showed up and asked the lone bellman if he needed help. He declined, much to the disappointment of all of us standing in line that heard the offer. What was he thinking? We finally left our bags and went to the strip to check things out. We came back at 3:15 and stood in another long line to see if our room was ready. A gentleman named Yousef rather curtley and with a bit of arrogance said that our room was not ready yet. When asked when it would be, he told us to check back in awhile. No offer of a call or anything. In other words, stand in another long line to find out for the third time. Went back an hour later to find out that we could have 2 double beds now, but it would be \"about\" 2 hours more for a king siz bed. We took the doubles. Housekeeping is apparently a major issue with this property. They are seriously understaffed, especially for a not so big hotel. First of all the first day maid service hadn't been around by 4 p.m.. I went down the hall and asked the maid when she'd be by to clean our room. She said would clean it next. We left and by 5 it was cleaned. Then for 2 days in a row, she only left one wash cloth, even after having left a note for her to leave two the next day. I tried to call the front desk but the phone between the two beds didn't work! I didn't realize there were 2 phones in the room however. The other one worked. The bathroom floor was never mopped once the whole time. It was pretty obvious if you know what I mean. There was also a huge stain at the foot of one of the beds. They had a refridgerator and that was nice, but the rubber seal around the door was coming off so if you didn't push it back on the door it didn't keep things cool. We found out that one the hard way. We were there for almost 4 days and the 6th floor hallway carpets were never vacuumed once! I know this because I saw the same debris on the floor the last day that I saw on the first day. What's up with that? Then there's the pool. It's a nice small pool. Problem was that it was not clear...it was rather murky. You could see the bottom, but it was a little gamey looking for me to go swimming in. Too bad, since it was 108 and a swim would've been nice. I do have to say the bellman were very nice and very helpful. Most of the rest of the staff were also congenial. They also allowed a late check out time of 1:30 p.m. which was very nice since the convention didn't end until 12:45. Getting a cab to the airport was no problem and that was nice too. All in all, there are too many rooms in Vegas to put up with issues like these. I highly suggest management look into housekeeping staffing levels. They are not keeping up! It's too bad. I really wanted to like this property. Plus we're members of Marriott too. Hopefully management reads these and attends to these issues!", "title": "Not sure we'd stay there again.", "helpfulness": 4, "user": "ShadyGrady", "date": "June 30, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 114909304}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "This is the closest hotel to the Convention Center (adjacent to the parking lot) and its Monorail station, placing you just minutes to most Vegas strip attractions. The monorail entrance is about 300 meters from the hotel. A modern, stylish gem for Vegas, without all of the casino and 'resort' entrapments for your dollars. The nearest casino/resort is the Wynn, across the street.", "title": "Exceeded most expectations. Great!", "helpfulness": 1, "user": "travel_wahoo", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114849929}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Rooms are modern/stylish with a very comfortable desk chair (great job, interiors people!) and comfy bed. The huge 50+\" flatscreen had a good channel selection, and the modernized iBahn interactive setup was excellent and easy to use. My only beef was the in-room movie pricing: $9.99? My room had a small refrigerator as well as a lounging sofa, but this may not be a typical room. They advertise an evening turndown service, but that never happened during my stay.", "title": "Beautiful hotel...close to the monorail (quick walk thru the LV Convention Center). Nice not having a gambling hotel to stay in,", "helpfulness": 1, "user": "OmgNice", "date": "June 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 114776824}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The bathroom was lit well, and had a separate tub and standing shower, with Aveda amenities, the standard for this brand. Not sure why other reviewers had issue here. No complaints at all: it's functional, modern, and though lacking some of the fancy, this is, again, not a \"Resort\", and not trying to be one.", "title": "exceeds exceptions guests treated like a 5 Start hotel", "user": "roark10", "date": "June 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 114185227}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The internet had its slowish moments, as the hotel was fully booked the weekend I stayed, but it was wireless at least. If you are upgrading to one of the concierge floors, or have Marriott status, the lounge is on the 15th floor, with views of the north of the strip, and mountains. Foods here were nicer than typical Marriott lounges, and the staff is very attentive.", "title": "Nice, clean and quiet", "user": "Zeus9806", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 113446415}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 43, "average": 87, "very good": 291, "terrible": 27, "excellent": 321}, "aka": "Renaissance Las Vegas", "slim_ranking": 0.262962962963, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Renaissance Las Vegas Hotel celebrates everything that is distinctive and unique in Las Vegas. For the independent traveler who values originality, Renaissance is the only hotel brand that inspires and provokes its guests to discover something wonderfully new and different—each and every time they stay—so that no business trip ever feels routine. Located just one block east of The Strip, mere steps away from the Las Vegas Convention Center and Las Vegas Monorail; we offer direct access to all of the action and a peaceful night’s sleep to follow. As coveted location for the convention delegate, we make your trip home after a long day easier on your tired feet. Designed to champion effective meetings and events, the Renaissance Las Vegas Hotel provides highly perceptive services and precise execution to ensure the success of everyone involved."}