{"user_rating": 4.0, "review_count": 231, "name": "Renaissance Chicago North Shore Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Beds were comfortable. Room was quiet and I did not hear my neighbors, which is my biggest complaint in a hotel stay. Linens were nice. Staff at front desk very friendly. I would stay here again without hesitation. Lives up the Marriott standards in all ways! There was a restaurant across the street, but didn't see shopping to close by.", "title": "Nice Stay", "user": "Bobkatevan", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163373433}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I would rank the hotel as a good business hotel, and overall the staff make a real effort to make your stay pleasant. The breakfast staff were really good and went out of their way, and the breakfast itself is good. Quite unusual that in the bar in the lobby they have live music every night, but I think it works very well, and again the staff here are very helpful. Unfortunately, when I checked in I had a bit of a nightmare...I attempted to check in 30 minutes early (3.30pm) and was told my room was not ready...but then had to wait until 4.30pm, despite the room having been empty at 3.30pm. This was made even more frustrating in that when I entered the room I wouldnt rate it as the cleanest I have seen...but the daily cleaning was good.", "title": "Good Business Hotel", "user": "Reluctant_business", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 161961777}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed two nights and found the hotel had some rough edges and some nice touches. The room itself was good, though on the smallish end for a high-tier hotel. Beds were quite comfortable, good linnens, nice updated look. Bathroom was very small, with two getting ready for graduation events, it was tight. Front desk staff was upbeat and friendly on checkin and checkout.", "title": "Uneven", "user": "Snowman00", "date": "May 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161491430}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Where we had some issues was with some staff: phones sometimes took 15 or even 20 rings to be answered both before arrival and during our stay. We called three times over the course of an hour just to get light blankets for our room, not getting to sleep till after 12:30am as we waited and waited. Down comforters are plush and nice, but too warm for this half of the year. I got comped some rewards points for our trouble when the checkout person asked 'what could have been better about our stay?' (nice touch to ask that).", "title": "Great Stay", "user": "grossepointebeachbum", "date": "May 15, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 160779277}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Breakfast buffet on Sunday was excellent and well priced for quality. We were surprised that the buffet closed at 8:30 weekdays, that seems early. We ordered a la carte and the food was mostly quite good but the wheat toast had mold on it. The waitress was horrified, apologized and whisked away the toast and replaced it quickly, so it was handled well.", "title": "Amazing!", "user": "cherrygarcia5", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160749292}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Spent three nights here with my team while competing at the Chicago Curling Club around the corner. Clean, comfortable rooms, but a few things struck me as unusual. First, the \"free wi-fi\" was only for Marriott Rewards members -- which costs nothing to join, so it's just in inconvenience before accessing the internet. Second, the layout of the public spaces was a little tortured -- to get to the pool, you needed to first go downstairs, through all the conferences areas, then upstairs to the pool entrance, and the entrances to the restaurants were neither clearly marked nor visible from the registration area. Other than that, the rooms were pretty much what you'd expect from a Marriott Renaissance, and the group rate for the curling event (of $89/night) was not bad at all. The staff were all friendly and helpful, although the way the parking lot was cleared after an overnight snowfall left a bit to be desired.", "title": "Comfortable stay, but odd layout", "helpfulness": 1, "user": "ABCWorldVacations", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153300709}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This is definitely an average hotel that could use a facelift. The decor is some of the worst I have ever seen in a hotel. The lobby and the lounge look like Martha Stewart on steroids! My room wasn't as bad but definitely dated. Room was a good size and comfortable enough. I thoroughly enjoyed the terry cloth bathrobe and the lush towels though they could have been softer. I can't believe in this day and age, this hotel charges for internet service. Had the buffet breakfast in the restaurant one morning - great selection and great service. I didn't actually choose or pay for my stay as I was travelling with a school group but I definitely would not choose to stay or pay here in the future.", "title": "A bit dated but a comfortable room.", "user": "tmfoxx", "date": "February 25, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 153154295}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I'm going to give this place a \"Very Good\" rating this time, although it is probably closer to average for what it is supposed to be. It is a very old hotel, yet renovated well, and probably as best they can do without tearing it down. Rates are not insignificant compared to what you'd expect of a Marriott Renaissance Hotel. Beds were comfortable. But there is room for improvement. For example, the windows are well over 30 years old, and this winter ice formed quite a bit on the inside of the windows. The type of heater/AC on the wall is the kind I always despise as they are noisy and not well suited to a supposedly classy hotel. One of our rooms had considerable water on the carpet under the heater/AC. They probably should have replaced the bathtubs rather than resurfacing them, as around the drain there is heavy caulking and some rust. Also, heavy caulking on the floor next to the tub. Better workmanship would have made this decision better. The towels and linen were excellent. But all in all it is still just not quite up to the standard one should expect at the price and with this brand.", "title": "Improved since last June 2012", "user": "thelion44", "date": "February 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152722526}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "It was good having Ruth Chris Steakhouse attached to the building. And their food was excellent.", "title": "Great Hotel and Evntertainment", "user": "Carly E", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152559815}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The front desk personnel were friendly, but not very professional looking for the Renaissance. Maybe staffing in the area is more difficult, but the chap was not well dressed, a bit rough around the edges, yet an affable and accommodating fellow.", "title": "Great place to stay, eat, sleep and meet", "user": "Febre33309", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151917570}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "As many have said, the outside looks very non-descript but the minute you walk through the door you know you are in a Renaissance. Starting at the font desk where everyone was extremely helpful to the Pancetta breakfast area where the staff was amazing, to the awesome bar that made you feel like you were in the living room of your multi-million dollar home, everything was welcoming. I had a corner room that was very large and the bed was awesome. The only rub with the rooms were the small bathroom. Otherwise it was perfect. The indoor pool and fitness area were great. The food was outstanding and the bar food specials made it an easy choice to stay and eat there. Stay here, you won't be disappointed.", "title": "Outstanding property!", "user": "Batt2", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159991969}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I stayed here for two night with my company for a meeting with about 200 people. My room had two queen size beds and provided a clean, comfortable place to sleep after a long day of meetings. Wifi is free if you have or sign-up for Marriot Rewards card. It was easier for me to use my Mifi device, but heard complaints from many of my associates lacking the technology about having to go through the paperwork. I thought the food provided by the hotel for the conference breakfast, lunch, and snacks was above average for a conference space. Also, ate dinner one night at the Ruth Chris attached to the hotel which was very good.", "title": "Comfortable Conference Hotel", "helpfulness": 1, "user": "Westpo", "date": "May 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 159312561}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We live in Chicago, but wanted a night away. The outside of the hotel is certainly nothing fancy (although from previous reviews it sounds like there will be some exterior updating), but the brick building certainly fits in with the neighborhood. The lobby is very modern and tastefully done. The front desk staff at check in were extremely friendly and efficient. We were in a room with a king bed. The bed was one of the most comfortable I've slept in. The room was also very modern in décor, but very classy. It was a decent size with a refrigerator and coffee maker (hidden in the dresser...housekeeping had to help us find them...we were embarrassed but the housekeeping staff were very helpful and friendly). The bathroom is very small but updated. While a minor touch, the hair dryer in the room was one of the nicest I've had a hotel. It's a real dryer, not one of the tiny ones attached to the wall.", "title": "Excellent Service and stay", "user": "travling4fun", "date": "April 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 159089506}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The rooms window opened a bit so we were able to enjoy some of the beautiful weather outside. It's rare that you have that option. If I had to have one \"complaint' (and it's more of an observation as it did not disturb us), it would be that the black out drapes on the window was placed so that some light still came over the top of the curtain.", "title": "Nice and modern.", "user": "suttonin", "date": "April 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 158959845}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "We had dinner and drinks at the little restaurant off the lobby. When we arrived, few people were there and we couldn't find any staff. After a couple of minutes of confusion, someone finally came out and seated us. The food was very good and we enjoyed the atmosphere. Our server got us everything we needed/asked for, but I wouldn't say he was at all attentive.", "title": "Mid-Range Basic Business Hotel with Lounge Lobby", "user": "TraveltheGlobe09", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 158806371}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "So it's not much to look at from the outside, but once you get inside it looks fabulous! I would describe the decor as Funky conservative. Loungey purples, crystal bling, silvery mirrors and dark contrasts. Very modern and hip. The rooms were nicely appointed as well. This is where you discover that this place is still an older building behind the face lift. The doors make a lot of noise when they close, which can be heard as other people enter their rooms at night. Although it's been redone, the bathroom is quite small, a tight fit to get in and close the door. The shower head sprays great, however it is low. It should have an extension that places the showerhead higher and more in the center. A little shelf would be good too. I think the people that design these things should actually use them. Think about it, look at the size of the shampoo and conditioner bottles, they are quite small and where can you put them so that the cap doesn't go slipping in the tub and so you don't have to bend down to get them. Anyway back to the room. TV's are new flat screens the room I had was a king size which left plenty of room to be in. The chair was nice and the heating system operated well. A fridge is always nice to have. The Service at this place is very good. Try the breakfast buffet. It was fresh and i thought a good value for this service. All in all, I would stay again and recommend it to others.", "title": "You'll be surprised once you get inside!", "helpfulness": 1, "user": "Kingson I", "date": "April 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 157275077}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Robert greeted me with a smile when we came in. Our waitress Shiria was attentive and kind. The shuttle drivers Tony, Oscar, and Jim took me and my gorgeous wife to the mall and grocery store. We were well cared for the whole time! Awesome kind service. And John greeted us for breakfast in the morning and Freddie at night serving us was a delight! Thanks this is the best hotel ever! Keep it up!", "title": "Excellent", "user": "Ben V", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155939905}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Don't let the exterior fool you. . .I sat in the parking lot and thought THIS is a Renaissance??!! But once I entered I was surprised. The staff was excellent and check in was a breeze. At dinner, the waiter's recommendations were wonderful . . .I will always take their recommendations over my thoughts in a strange hotel! My biggest disappointment was the HVAC system. . .so incredibly noisy that I had to shut it off. I would have preferred to open a window! I had just come from the JW in Chicago so maybe my standards were a bit high, but I cannot tolerate the cycling on and off of these wall units.", "title": "Looks like a three star but has some qualities like a four star", "user": "Catherine W", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155758089}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed here recently for business. Found the check in process smooth, room was OK but had a loose tile or something in middle of floor that made considerable racket when stepped upon (no other rooms available). Restaurant was OK, waitstaff seemed new or inexperienced. Food-not so great.", "title": "Close to Northwestern", "user": "KLintheSEH", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155555744}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "The hotel seemed to have undergone some recent revisions and is somewhat styled trendy/Hollywood regency, however, it still seems somewhat dated, particularly in basement. Gym was good, had what I needed and was well kept.", "title": "There's only love at this hotel!", "helpfulness": 1, "user": "Elizabeth D", "date": "March 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153714900}], "location": {"country": "United States", "city": "Northbrook"}, "stars": 3.5, "variance": {"poor": 20, "average": 34, "very good": 92, "terrible": 7, "excellent": 78}, "aka": "Renaissance Northbrook", "slim_ranking": 0.6}