{"user_rating": 4.5, "review_count": 1305, "name": "Renaissance New York Hotel Times Square", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "Stayed at this hotel for 7 nights, arriving on Xmas day. We'd reserved a superior room on 25th floor and on the first night had to be moved due to noise from the lifts. Room was reasonably large and well furnished with nice marble bathroom and high pressure shower. Found the reception staff to be most unhelpful with a very superior couldn't care less attitude. Also had problems with housekeeping forgetting to leave us coffee / tea, even on one occasion after four requests! With these exceptions the hotel is in a great location and Foley's restaurant and the bar area are both very good. Would not return to this hotel but would go back to the Hilton Times Square which offers far superior service and similar standard guest rooms for a lot less money!", "title": "Nice Rooms - shame about the service", "helpfulness": 5, "user": "beaubrummie", "date": "January 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4326404}, {"rating": 5.0, "title": "HoneymoonTreat!!", "text": "We arrived on Christmas Day and checked in and let the staff know it was our honeymoon. We were promptly upgraded to the 26th floor, given bath robes, recieved 4 free morning meals and free drinks in the bar that night!!!!! The room was very large for 2 people, the view was amazing(7th ave.) The food in the resturan was great, if you can manage to get a free buffet breakfast, do it. We had great staff working, the consi. was great, they made nice choices for dinners. The bellmen, room service and cleaning crew was spot on. The access to all of the local favorites was a nive addition. While staying we saw Tia Mowery so that showa that this hotel gets the stars(even if it was an old show). The pricing from Christmas day thru New Years eve was great considering the time frame. When we asked if we could extend through New Years Day we were put first on the waiting list and recieved a room at a lower price. The view of the ball, the things offered for room service that night were great. I reccomend this to all travelers. We will be back!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4316041}, {"rating": 5.0, "title": "It's All True!", "text": "It's all true! As fine a New York hotel as you'll find in such a prime location. We stayed for one week just before Christmas, which did unfortunately coincide with the transit strike however with a location such as this, it didn't really matter... everything was just yards away. Our room was located on the 25th floor and despite being on the doorstep of Times Sq we never heard a thing. The staff were excellent and the concierge was extremely helpful and the view from Foley's at breakfast has to be seen to be believed. All in all this hotel added to our Christmas vacation and without doubt i wouldn't hesitate in staying at the Renaissance on my next visit to New York.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4312706}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "I went to the Renaissance Hotel with my husband for Christmas Holiday. The first thing I noticed was the great location. You have to do Times Square at least once. The location of this hotel was ideal to be able to see everything. The lights and the sounds were exhilarating. I picked this hotel as I have had luck with Renaissance Hotels in the past. It was a good choice.", "title": "Nice Hotel - Great location", "helpfulness": 10, "user": "L1", "date": "December 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4310377}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The room was large for New York standards. We had a room that looked over 7th street and all the billboards. It was great. The room had a King bed with a foyer area that had a fridge and coffee area. It also had a chair and desk. So it was big enough for 2 people. The bathroom had a huge tub and large sink area to place many things for both of us. Overall the room could use some freshening as it looked like it hadn't been updated in quite a while. The bed was very comfortable so that was great. We slept really well.", "title": "Great hotel and staff", "helpfulness": 9, "user": "Roger M", "date": "December 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4222474}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We stayed at here from the 8th to the 12th of February on honeymoon, and I have to say I could not fault the hotel. Clean, comfortable and they gave us a great room on the 21st floor. Being right on Times Square was perfect for two newbies to New York. It was also pretty spectacular on our last day there when all that snow turned up. It was fantastic! Definately recommend this hotel especially for newbies to New York.", "title": "Wonderful hotel", "helpfulness": 7, "user": "Thelma_Beauvery", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4567482}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "I am amazed at the positive reviews on this site. I just got back from 3 days and can state that this is the worst hotel experience I have ever had in NYC- this place is way, way inferior compared to other Manhattan Hotels.", "title": "Inferior, No Character", "helpfulness": 7, "user": "CaptainAmerica", "date": "February 21, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 4475818}, {"rating": 4.0, "title": "Great Location", "text": "Well, lets start with check in. It was done with pure ghetto attitude, no smiles, all arrogant boredome on behalf of the staff. In fact, they seemed so busy yammering in noisy Spanish with each other I felt I was interrupting a quinceanera with my pushy requests for a hotel key. Rude, even by New York standards-expect better service at a ghetto Burger King.", "helpfulness": 3, "user": "Gaspari", "date": "February 18, 2006", "id": 4468183}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Their much vaulted bar/resturaunt, Foleys, with its supposed great view of the Times Square light show, looked like it would have been a nice place to hang out, IF IT WERE EVER OPEN. For some inexplicable reason, the whole place is CLOSED on Sundays and only open from 5pm - 12pm weekdays & Saturdays. Bars in NYC can stay open to 4AM for Pete's sake, what is the big problem? Unable to enjoy this supposed perk. For the city that never sleeps, Foleys management sees fit to only be open an measly 7 hours a day.", "title": "Outstanding Service", "helpfulness": 4, "user": "SRQmom", "date": "February 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4447671}, {"rating": 4.0, "title": "Great location. . .", "text": "Gee, what else. The towels were coarse and had a nasty chemical smell. I asked for a non-smoking room, got a room that reeked of smoke, complained and was told I had the \"last available\" \"non-smoking\" room (the hotel did not seem particularly full, this was probably a standard lie they use to dodge changing your room). To compensate, they sent up some poor slob an hour later with a spray bottle, Great.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4393720}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The hotel personnel were friendly but not overly compared to other Renaissance hotels. Other hotels I have been to the staff were very friendly and wanted to help in any way. Here they barely said 2 words. One day we were taking a nap around 4:00 and housekeeping barged right in. Fortunately we had the lock on so they couldn't get in. Not sure what they were doing except maybe turn down service. It was very annoying.", "title": "Great Location", "helpfulness": 8, "user": "AZ2323", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 4124471}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We did not go to any of the restaurants so I can't rate them.", "title": "Brits don't call home!", "helpfulness": 11, "user": "shazzie5", "date": "November 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4121698}, {"rating": 5.0, "title": "Amazing", "text": "But you can't beat location and the size of the room. The price we got was very good as well. I would definitely stay here again but would like to see something maybe in a more quiet area.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 15, 2005", "id": 4117369}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "we stayed here between 30/06 to 6/07. we had a great time. the location was perfect, right in the heart of all the buzz and lights of times square, so if that is what you want then this is the place for you! staff were polite and friendly and answered and dealt with any queries we had straightwaway. 3 of us shared a room and it was really spacious with enough room for all our shopping and suitcases. the bathroom was great too.", "title": "excellent location", "helpfulness": 2, "user": "poochie-girl", "date": "July 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17607887, "likes": {"liked": "— location location location", "disliked": "— the breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "we used the free internet downstairs, you get 15 mins at a time and for us that was fine, the computers were always free and more than adequate to check emails etc from home.", "title": "The unfriendliess hotel I have ever had the misfortune of staying at.", "helpfulness": 2, "user": "ThursdaysChild78", "date": "July 3, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 17491178, "likes": {"liked": "— The location", "disliked": "— The unfriendly staff"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "my only minor criticism would be the breakfast, normally i wouldnt bother with breakfast in hotels in NY and indeed we had some great ones at other places during our stay, but the one at the renaissance was not great at all - expensive even by hotel standards and the quality/quantity was below average.", "title": "Good Hotel in Excellent location!", "helpfulness": 2, "user": "kev99", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17123451, "likes": {"liked": "— Location", "disliked": "— Noisy Hallways"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "all in all a great place to stay for a short shopping/city break trip to new york. we would definitely stay there again!", "title": "Very Nice Hotel", "helpfulness": 2, "user": "NovaScotiaCapers", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16652184, "likes": {"liked": "— The location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I stayed at this hotel with two friends in May 2008, and the problems started immediately on arrival. Our first impressions of the hotel itself were good, it's modern and is in a great location.", "title": "Favorite Hotel in NYC", "helpfulness": 2, "user": "shawbee99", "date": "June 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16570114}, {"rating": 5.0, "title": "Loved the Renaissance", "text": "We stayed at the Marriott Renaissance mid-week from September 6-8, 2005. We were pleasantly surprised by the comfort of the room and by the excellent service we received from everyone we encountered. After reading many reviews of tiny, noisy New York hotel rooms, we were surprised by how ample our room was, and how quiet. The only time we heard any street noise at all was when an ambulance went by with its siren blasting- and even that noise was relatively muffled. We had requested a king size bed, but instead got two double beds. No matter - they were incredibly comfortable, with down comforters and pillows. The maid service was impeccable- the room was spotlessly clean.", "helpfulness": 8, "user": "NYNative", "date": "September 13, 2005", "id": 3900123}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We didn't have any meals there since we were always on the go. We did find a great place for breakfast on 51st and Broadway - a deli called Ellen's. The food was inexpensive but good, and the waitresses, all Broadway star \"wannabes\" provided great service and even performed a song or two for the diners. That was a lot of fun, particularly for the kids we saw there with their families.", "title": "Terrific Hotel", "helpfulness": 6, "user": "GaerielSky", "date": "August 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3801556}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We had a wonderful pre-theater dinner at Tout Va Bien, a French restaurant on 51st and 8th. They are known for their pepper steak and authentic French food, and a 3 course meal (delicious!) cost under $25.", "title": "Great Stay in Times Square", "helpfulness": 8, "user": "totika", "date": "August 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3792905}, {"rating": 5.0, "title": "Great place, clean room and decent price", "text": "Spent the weekend in the city with some friends and got a great rate on the Reaissance. Somehow the dates were mixed up, and when I called to confirm they let me know and apologized getting me the same rate for the days I needed. The staff couldn't be friendlier or more helpful. The rooms are very nice and pretty spacious and clean. Great views. Prime location. The restaurant has a spectacular view of Times Square. The health club was great too (and totally empty). Highly recommend. I would definitely stay here again. I had other friends who stayed at the Edison and they hated it and everyone was rude.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3726798}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The Renaissance Times Square is the perfect place to stay if you are touring New York City. We stayed for three nights in August. The hotel is right in the middle of Times Square but is the perfect getaway from the noise and crowds that are right outside your door. The room is a good size, very nicely furnished and the bathroom is outstanding. The people were terrific, very helpful when needed but not pushy at all. Foley's has a terrific view of Times Square, the service there is great, but be prepared to pay for the ambience. It's expensive. The rooms are a good price for the location. In all, we would highly recommend this hotel. It was our 30th anniversary and our first visit to New York City and the Renaissance made it perfect.", "title": "Great location, But...", "helpfulness": 11, "user": "SeattleTrvlr", "date": "July 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3674417}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We LOVE the Renaissance. We have been staying at this hotel for the past 3 years. Every time we visit NYC, this is the hotel we stay at. The rooms are nice and large. You can't beat the location!", "title": "Location, location, location!", "helpfulness": 1, "user": "thechandlers", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18727435}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Perfectly located in the theatre district and Times Sq., this hotel exceeded all expectations of our two rooms for a three night stay. The rooms were large, modern, clean, had every convenience imaginable and perfectly suited to both pleasure and business. The rate was fair and actually a value for the type of hotel this is, I'd compare it favorably to any high end NYC hotel, but with far less cost. Renovated and remodeled two years ago, this is a best kept NYC secret. As experienced travelers, we'd definitly stay there again and highly recommend it.", "title": "Perfect NYC Hotel", "helpfulness": 2, "user": "finewein", "date": "August 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18652822, "likes": {"liked": "— location and price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Renaissance Hotel in Time Square was an absolute find.", "title": "Loved the Renaissance 100%", "helpfulness": 2, "user": "sfgiantsbaseballfan", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18628841, "likes": {"liked": "— Location and cleanliness", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Pro's:", "title": "Great Hotel Even For A Picky Travler", "helpfulness": 2, "user": "rhodac8", "date": "July 29, 2008", "detail_rating": {"front_desk": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 18406205, "likes": {"liked": "— the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "1) Staff was very friendly and helpful with arranging dinners reservations, cab rides etc (with a smile on their face every time).", "title": "Oasis amid Times Square", "helpfulness": 1, "user": "traveltoall50states", "date": "July 24, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 18216625, "likes": {"liked": "— Location!", "disliked": "— Only restaurant is now Asian cuisine."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We stayed for a long weekend in Oct. and loved this hotel. The rooms are lovely, clean and quite roomy. The location is great for theater, restaurants and sightseeing tours. The staff was helpful and friendly. One night there was a lot of noise in the halls from a group of women who were going back and forth between rooms, slamming doors and talking loudly. One call to the desk and they sent someone up who asked them to be quiet. We never ate in their restaurant, but the views from it are wonderful. Elevators were quick and although the hotel was sold out for the weekend it never seemed crowded. We would definitely stay here again.", "title": "great hotel", "helpfulness": 8, "user": "chewpei", "date": "October 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4048918}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We stayed at the Renaissance for five nights with our two children, age seven and five. From the moment we arrived until we left, the staff were very friendly and always had some fun with our kids. We also had dinner at Foleys, again great staff. The meal was delicious, and worth the cost. The room was spacious and very clean. The bathroom was lovely and we were always well stocked with towels. We have absolutely no complaints and would definately stay here again. The subway is at the corner and a lot of major attractions are easily accessable. Two recommendations - go to \"Jamba Juice\" right beside the hotel for an amazing smoothie, and \"Pax wholefoods\" one block up on the same side of the hotel for amazing breakfasts.", "title": "A fantastic hotel for all the family!", "helpfulness": 10, "user": "ClanMcIntosh", "date": "October 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4040538}, {"rating": 5.0, "title": "Brilliant Hotel!!", "text": "We stayed at the Renaissance for 3 nights as the first part of our honeymoon! It couldnt have been better!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 29, 2005", "id": 3947208}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "The location is No1. right on times sq!", "title": "Excellent Hotel", "helpfulness": 5, "user": "Chris072", "date": "September 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3946170}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "When we arrived bel hop took our bags away, and at check in they saw it was our honeymoon and congratulated us and gave us a free breakfast any day we chose!", "title": "Great stay! Perfect for shopping and shows!", "helpfulness": 5, "user": "TNtravelers02", "date": "September 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3946148}, {"rating": 3.0, "title": "A Birthday Treat Right on Times Square", "text": "Now for the minuses: No NYC guide books or mags in room to help you plan your days. Despite being a non-smoking room, it smelled of old cigarette smoke. AC never got cool enough for us and maintenance unable to do anything about it. $13/day for Internet access! Towels worn out, and sheets getting real thin. Blankets were shabby and old. And my pet peeve -- non-fitted bottom sheet and non-fitted mattress pad. Will not stay tucked in and together they create a VERY lumpy sleeping surface within the first 5 minutes. I HATE that! If not for this, I'd probably stay there again despite the worn-out linens because the location is so great. If you don't mind the lumps, go for it if you can get a decent rate.", "helpfulness": 9, "user": "UKTwo_M's", "date": "July 14, 2005", "id": 3665780}, {"rating": 4.0, "title": "Great Location!", "text": "I took my Mum to New York for her 75th birthday and chose to stay at the Renaissance as my husband and I had spent 4 days there back in Nov 2003. We stayed at the hotel from 10th to 17th June it was the ideal place smack bang ontop of Times Square. It was my Mums first visit to New York and one she will remember forever as she fell in love with the City and its People from the moment we arrived. My one real complaint was that Virgin who had arranged all our travel had sent them notification it was my Mums 75th birthday and that this was a special treat for her and asked for a room overlooking Times Square I didn't care what floor we were on. We got a side view of Times Square from our room which was clean and the beds were the most comfortable I've ever slept in away from home - my Mum had the best sleep ever in this hotel. I agree with a lot of people about the bathrooms looking worn out and the towels were just a little threadbare (we had fluffier towels in our hotel at Heathrow) and the bed linen was spotless. As they had all that information at hand I was a little disappointed that on the day of her birthday they didn't leave just a little card or some fruit to wish her a happy birthday so i was just a little let down with the hotel this time around but it did not dampen our time there and the staff were very helpful although they could do with learning to smile a little more when approached. On two occasions we returned to our room from long days out sight seeing and shopping to discover that our room door had been left open from when it was cleaned. The first day I told them about it I was told they would report it to the Housekeeping Manager. Unfortunately the next day we came back to the same thing door open it just so happened the same member of staff was on when I complained again and he was horrified that the same thing had happened and quickly offered us free breakfast for two days. I did ask if they could make it dinner as on the second day it was my Mums birthday and mentioned this to the man on reception to which I was very promptly told no so I accepted the breakfasts but again it left me a little disappointed in their handling of things. Thankfully nothing was taken from our room (it looked from the outside that the door was closed) as all valuables were in the inroom safe.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "June 30, 2005", "id": 3622251}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "This was my second visit to NYC and the Renaissance. I just love this hotel. I had a STD room on the 8th floor which looked over Broadway on Time Square. Yes you can hear the odd traffic noise like fire brigade sirens but your in NY. The hotel bar is great however watch out for the price's. The rooms are of good size with King bed, table and armchair and still plenty of room to walk around. You have big windows and its great to sit on the ledge and look down to TS below. Bathrooms are marble and have deep baths. All the staff i spoke to couldnt help you more. Cant wait to go back. 49th st on the subway is just outside the hotel entrance to is great for exploring. Have Fun!", "title": "Excellent again", "helpfulness": 8, "user": "spur365", "date": "January 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4373897}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We arrived at the Renaissance on the 26th Dec for a 12 night stay. Check in was fairly smooth, but the staff seemed a bit stressed with the amount of pepole checking in that afternoon. I had requested a refridgerator when I booked months ago, knowing about the notorious \"charge it if you move it\" sensor in the mini bar. I was told that they were out of them at the moment , but assured that I would recieve one in a few days since we were staying quite long. Of course it never arrived!", "title": "Expected More - But Can't Beat the Location!", "helpfulness": 7, "user": "scorp-dragon", "date": "January 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4370977}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed at the Renaissance from June 29th-July 1st 2008. We were VERY impressed with the hotel and would stay there again in a heart beat. Luckily, we got a great internet rate because the standard room rate is kind of steep.", "title": "GREAT experience", "helpfulness": 2, "user": "dtmickle", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18007505, "likes": {"liked": "— Room size and cleanliness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "The hotel staff was wonderful. The rooms were beautiful, clean, and spacious with a great view. The hotel itself was very impressive and I was thrilled that we had selected this particular hotel.", "title": "Wonderful Hotel!", "helpfulness": 2, "user": "BuffaloAmy", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17925226, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "For those that complained about the check in being on the second level...who cares? The elevators were really fast and we NEVER had to wait for more than a few seconds.", "title": "Great property let down but dreadful management and service culture", "helpfulness": 8, "user": "adbear", "date": "July 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 17920953, "likes": {"liked": "— Recent renovations and the fittings and furniture", "disliked": "— The appalling management culture"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This hotel was wonderful and I would highly recommend it!", "title": "Loved the location...", "helpfulness": 2, "user": "5-Star-hobo", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 17871694, "likes": {"liked": "— Location and Staff", "disliked": "— Room size and Lobby decor"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This was the hotel I stayed at for my first ever trip to NYC in 1995. I had always remembered it being very nice, but since it is on the expensive side, I never returned there for another stay until this past March. I was able to get a great deal for 3 nights through Marriott Rewards, so I didn't hesitate to book it. The hotel was wonderful in 1995, it has just recently finished renovating, and is now even more spectacular!", "title": "it's awesome and in the middle of it all!", "helpfulness": 4, "user": "JudyJetsonFla", "date": "July 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17770185, "likes": {"liked": "— the bellman: JJ!", "disliked": "— expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "My mother and I spent the Mothers Day weekend at this recently renovated property. Our room was on the 22nd floor with a wonderful view of Broadway. The window tilted out to open for ventilation - something I really enjoy as an alternative to a steady diet of stale, manufactured air.", "title": "Four Stars For Sure", "helpfulness": 1, "user": "a410traveler", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16044143, "likes": {"liked": "— Quality and class from start to finish", "disliked": "— Lobby with loud music"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The room was clean, well appointed and large by New York standards. The carpet was clean and appeared to be fairly new with no worn or stained areas. The beds were as marvelous as you'd expect in a high end Marriott property.", "title": "Awesome Hotel Awesome Location", "helpfulness": 1, "user": "toddy7105", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15822422, "likes": {"liked": "— Clean room comfy beds, awesome view", "disliked": "— Expensive drinks"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The bathroom was large, very attractive and supplied with Lather brand soaps, shampoo, conditioner and lotion. A magnified shaving / make-up mirror was a nice addition. The shower was a real treat - glass doors, a huge shower head that produced a soft rain-like flow and a generous supply of soft, white fluffy towels. The only negative here was that the bathroom was not vented - a common fault even in the finest hotels.", "title": "Excellent if you like Times Square", "helpfulness": 3, "user": "UpgradeQueen", "date": "May 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 15786046, "likes": {"liked": "— Convenience of location, view, quiet room", "disliked": "— Right on Times Square - too many people"}}, {"rating": 4.0, "title": "Great Stay", "text": "The recently renovated and ballyhooed lobby was a bust with me. The furniture was trendy but not overly comfortable. The music was loud and poorly chosen. We attempted to have a conversation with a friend in the lobby and ended up shouting over the obnoxious music like we had blundered into a Techno club.", "helpfulness": 2, "user": "pc9010", "date": "May 6, 2008", "id": 15723365}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "I'd recommend Maxie's deli on the corner of 7th avenue and 48th street. Grat sandwiches and the chocolate cappucino cheesecake is mandatory.", "title": "Gorgeous hotel in a wonderful location!!!", "helpfulness": 2, "user": "princessjocie", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15639653}, {"rating": 5.0, "title": "Extremely Comfy Establishment", "text": "We stayed at the Renaissance New York Hotel in Times Square from June 11th -13th. We are from New York City, but we still did a lot of research before picking our hotel. We were not disappointed with our choice. This hotel is located right in the heart of Times Square. Tourists and locals alike will be impressed with the views from the rooms-- especially at night when everything is lit up. The rooms were immaculate and the hotel provided plenty of towels and bathroom amenities. The beds were real comfortable and there were extra pillows in the armoire.", "helpfulness": 8, "user": "MarcJordan", "date": "June 29, 2005", "id": 3621188}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "The only thing that you should be aware of is that the mini-bar has sensors in it-- everytime you touch something, it is automatically billed to your room. We found this out as I was moving things around to put some of our own stuff in the fridge, and I noticed the small sign that tells you about the automatic billing. We called the front desk to ask about this, and they confirmed that we had been billed for three items. After speaking to a Manager and explaining what had happened, the charges were removed, and they supplied us with a mini fridge free of charge.", "title": "Terrific time!!!!!!", "helpfulness": 14, "user": "RedVelvette", "date": "June 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3612408}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Just got back from 4 nights (6/29/05). The property is immaculate and while the rooms are quite small by American standards, it was very, very comfortable. The pillowtop bed was outstanding. Don't know where others come off by saying the rooms are \"tired looking\" or \"in need of update\", I found the room to be decorated very warmly and the tile in the entryway was a nice touch. The marble bathroom was roomy enough for me and my wife. My only complaint was the showerhead, which is one of those stylish, wide brimmed heads that drip down. I would much rather see an adjustable head. Let me add that there was plenty of hot water. The bedding was in excellent shape, not warn or pilly. Don't know how they did it, but the room was totally cutoff from outside noise. We were on the 8th floor and didn't hear a thing. Interestingly, about 50 feet directly from our room a new building is under construction and the crane was eye level with our window. We didn't hear a single sound from it.", "title": "Fantastic hotel, great location", "helpfulness": 14, "user": "Beachbabe31", "date": "June 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3555362}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 32, "average": 95, "very good": 438, "terrible": 15, "excellent": 725}, "aka": "Renaissance New York City", "slim_ranking": 0.18778280543, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Hotel housed in 1930s building, located between Avenue of the Americas & 7th Avenue."}