{"user_rating": 4.0, "review_count": 607, "name": "Renaissance Palm Springs Hotel", "reviews": [{"rating": 3.0, "title": "Great location - noisy courtyard", "text": "First let me say that the hotel is very good from a location perspective and staff are friendly.", "helpfulness": 3, "user": "Flyboy92021", "date": "March 14, 2013", "id": 154481930}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We had a room with a balcony facing the pool.", "title": "Totally Relaxing", "user": "LindaBamford", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154432757}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The problem, which for a hotel I find bad, it was hard to sleep since they let people in the outdoor courtyard next to bar out there past 11pm. In fact it is now midnight as I write this and the people are very loud! No sleep possible...", "title": "Very Good Hotel", "user": "tylerat", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154350378}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Why do I have to make a call to reduce the noise?", "title": "Nice hotel but overpriced", "user": "wlgolfer", "date": "March 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154205974}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "They seem to be more concerned by their parking lot than the comfort or sleep of the guest.", "title": "Would DEFINITELY come back", "helpfulness": 1, "user": "GlendaleCA", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154180281}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This hotel offers an airport parking service but evidently contracts it out to a 3d party vendor Towne Park, Ltd. (they don't tell you this when they take your money and when they pick you up in a Renaissance Hotel shuttle) I used this service and had items stolen from my car while parked at the hotel. The insurance company for the service denied any responsibility citing nebulous language on the back of the valet ticket that I doubt anyone reads. There is no doubt that my items were stolen while the car was parked at the hotel. This is just poor customer service, and I would be leary to use this service unless you feel comfortable that your car could be damaged or things stolen while you are gone. Their disclaimer includes any damage to the vehicle, etc. Not much of a service for a fee if you think about it.", "title": "Airport Parking Service-Beware", "helpfulness": 2, "user": "codybuster47", "date": "March 5, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 153797741}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We decided to take a quick 3-day trip to Palm Springs and after reading plenty of reviews on TripAdvisor, we passed on some of the bigger names and we decided on the Renaissance. We arrived at 11pm so check-in was quick. This is a large convention hotel but manages to maintain a hip, boutique feel. We arrived at 11pm so check-in was quick. The lobby is expansive with beautiful lighting and atmosphere. More similar to a W Hotel than a Marriott property.", "title": "Would definitely return but they need to fix one major problem", "helpfulness": 2, "user": "Michael B", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153541498}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Hotel: It’s in a great location…just 3 blocks from the main street in Palm Springs. We didn’t rent a car this time and now I doubt we’d get one in the future. The hotel provides a complimentary shuttle to and from the airport. They were happy to drop us anywhere for dinner, and although they offered to come and get us, we always opted to walk back on our own since the distance was so short. We ate at Chop House and Lulu’s – both are great options but you’ll probably need reservations. Our room rate came with complimentary breakfast at their restaurant, Dates, so we took advantage of that every day.", "title": "Superior Customer Service!", "user": "Terri M", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153527848}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Pool: The pool area is massive with plenty of lounge chairs. This was a big factor in our decision since so many reviews found here about Palm Springs hotels point out major problems with tiny pools, lack of chairs, or guests feeling like they had to get up a 6am to claim their spot. No issues like that here at all. There’s complimentary wi-fi at the pool and the lounge (but not in the rooms).", "title": "One of the best in the Renaissance Chain", "user": "suspect309", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153199011}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Bar: The Rocks Lounge was fun. Right off the lobby with plenty of seating and huge windows looking out into the pool area. Always busy and lively. We went there every night after dinner. Service could be erratic, though. The daytime shift was always great, especially by the pool. The nighttime shift was a bit indifferent, depending on who served you.", "title": "Nice hotel big pool a good 3.5 star hotel in Palm Springs Family Friendly", "user": "Abe G", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153083837}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "I stayed here for a convention and the service was fantastic. The staff is very friendly and eager to help. They have area experts available to help you decide where to have dinner. Just tell him what you are looking for (a good steak, Italian or Mexican food) and he will make a suggestion. He pulled out his phone and made resevations for us and the place was fantastic. There is a free shuttle that will take you to the nearby downtown district to eat and drink and they will pick you up for free.", "title": "Typical Marriot hotel...Very Nice!", "user": "Remy87", "date": "March 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 154680129}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The only drawback to the place was the spa. They have a stict cancellation policy and you have to cancel by a certain time or they will charge you the fee. I have no problem with being charged if we dont show up but when the place is closed throughout the day, it was hard to cancel when no one is there.", "title": "Convenience and Quality", "helpfulness": 1, "user": "Rachel D", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154560629}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Overall, it was centrally located, right next to the convetion center, and a great place to stay.", "title": "Great Facilities, Bad service", "helpfulness": 1, "user": "MtnSoccerMom", "date": "March 14, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154559443}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "My husband had a convention at the Westin Mission Hills, and due to our late booking, were unable to stay at the conference, and booked the Renaissance Palm Springs. We were delighted that we ended up there instead. Although my sneak peak at the Westin property was lovely, the convenience the Renaissance offers to downtown Palm Springs far outweighs the beauty of the Westin, and the consistency in quality accommodations under Marriott delivered again.", "title": "Lovely spot, close to Palm Springs attractions, lots of room", "user": "MarianTB", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154549284}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Not only is the Renaissance in close proximity to everything, but they run a shuttle for hotel guests by request to anywhere downtown until almost midnight. Just ask for Kirk, and you'll get suggestions, a smile, and a safe ride.", "title": "Great hotel!", "user": "Gogo247", "date": "March 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 154543521}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed here one night on our way back home from California. Never been to Palm Springs and wanted to see it. Hotel was very nice. Room very large. Lobby beautiful along with the pool area was very nice. Rooms were clean and beds were comfortable. Only a 1/2 mile down to the main street, where we walked down to see a Street Fair going on. I guess they have this street fair every Thursday. It was nice. Rooms we quiet and the check in staff were very nice and quick to serve. I would love to stay here again when I have more time. Lots of restaurants off the main street.", "title": "Location and Nice Hotel", "user": "Bobkatevan", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155447632}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is an attractive hotel with a stunning pool area. It is within walking distance of the heart of Palm Springs so that there is no shortage of things to do. If your room is situated well, you'll have a spectacular view of the mountains. The rooms are decorated nicely, and the beds are the terrific ones that we come to expect at a Marriott hotel.", "title": "Terrific location in Palm Springs", "helpfulness": 1, "user": "Shoemaven", "date": "March 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155274420}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We were expecting more than an average experience; however, the service--while always friendly--was just average. I would recommend the hotel because of location and overall ambiance, but I don't consider it exceptional in any way.", "title": "Great desert getaway", "user": "travel4fun3319", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155198902}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This is our second stay at the Renaissance and we really like it here. The hotel is beautiful with very spacious rooms and a great pool area. We also love the close proximity to Palm Canyon (the main street in Palm Springs with the restaurants, shops, museum, etc.). The breakfast buffet is excellent. The only complaint is that the staff needs to do a better job of keeping the smokers away from the pool area.", "title": "GREAT place for a getaway in the sun!", "helpfulness": 2, "user": "missstcroix", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155180355}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Someone just asked me for a recommendation of a hotel in Palm Springs and this hotel came to mind immediately. We have been to Palm Springs many times and have stayed at a variety of hotels, but this one was my favorite. We were here last summer, 4th of July week, and had a great stay.Traveled with my husband and two teenage boys. GREAT value and price. Very clean, large spacious room with a pool view. The lobby and pool area are so nice...comfy chairs all around and very very clean and well maintained. Great pool with music poolside which was excellent. Wonderful location, close to town and in walking distance to off property restaurants with beautiful mountain scenery all around. Take the Palm Springs tram up the mountain if you are not afraid of heights for a fun and different day....but make sure you bring a sweatshirt..it is COLD in the mountains even when it is 100 degrees below! If you are traveling with kids, there is a go cart/arcade type place nearby which was fun. I prefer Westin heavenly beds to Marriott..that would be my only \"very good instead of excellent\" mark. Highly recommend and will definitely stay here again!", "title": "Great destination", "helpfulness": 1, "user": "Seggie1958", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154748349}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 33, "average": 93, "very good": 224, "terrible": 23, "excellent": 234}, "slim_ranking": 0.442857142857, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located in the heart of downtown Palm Springs, the Renaissance Palm Springs provides a sophisticated and stylish setting perfect for any visit to the area. Steps away from the Palm Springs Convention Center and the upscale shops of Canyon Drive, our hotel is perfect for both work and play."}