{"user_rating": 4.5, "review_count": 652, "name": "Renaissance Providence Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We get what you expect of a Renaissance hotel: Great rooms, luxury ammenities and a very confortable bed. The service was accordingly good.", "title": "Stylish and in a beautiful building", "user": "ARUANO", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118537339}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Providence center is not big so, even there is a short walk from the hotel to it, it is a good place to stay. The main shopping mall in the city is steps away.", "title": "Great value and service!", "helpfulness": 1, "user": "Roadgirl57", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118388836}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We spent one night at the Renaissance Providence and were most impressed with the personal attention we received from the staff. One would not expect that kind of service in a hotel of that size . From the moment we checked in, until we left the next day, the staff (Michael, in particular) was extremely courteous and helpful. Michael provided us with printed directions and a map to Los Andes, a wonderful local restaurant. The valet staff were very prompt in parking and retrieving our car when needed. The room was spotless, with a very comfortable mattress, soft linens, and fluffy pillows. The only thing we could not regulate was the temperature in the room which was on the cool side. A call to the desk did not resolve the problem, as the thermostat was centrally controlled, but that was a minor flaw. The breakfast selections were vast and tasty, and our waitress was most accommodating and attentive. We will surely stay there again if we travel to Providence!", "title": "Great hotel; nice staff", "user": "barusso", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118336466}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I've stayed at the Renaissance Providence many times, the latest this past June. It has an elegant yet modern and quirky lobby, the staff is terrific and the views of the Capital dome lit up at night are wonderful. The rooms are modern and it is so conveniently located.", "title": "terrific staff - the best hotel service in memory", "helpfulness": 1, "user": "Amy S", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118261236}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Got married in Rhode Island and used Renaissance as the home base. Their wedding customer service was spectacular, and we didn't have any events on the premises. They gave a good deal on room blocks and made sure that my husband and I had a terrific room for that price bracket. They also did EVERYTHING for us when things got hectic, including arrange somewhat last-minute transport for me and my bridesmaids to the wedding. They were good to my mother too, who required printed directions at every outing. The service was, by far, the best I've EVER encountered. Plus the rooms are beautiful and the buffet breakfast is yummy.", "title": "Quality Hotel for Business or Pleasure", "user": "John2France", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118177717}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The incredible management and staff at the Renaissance helped provide our daughter with the most amazing wedding on 3 days notice. During recent poweroutages from a tropical storm the reception site we had chosen a year ago lost their power with no idea when power would be restored. On a moments notice the staff jumped to action - a very capable event director and her staff were warm and comforting and professional. WIthin hours they were able to assure us that the reception would go off without a hitch. They called in staff for the Labor Day weekend and everyone pulled off what was described by our 200+ guests as the best wedding they had been to\". Generally the bride and groom get the bridal suite with the booking of a wedding on short notice it was not available and the hotel was sold out. The staff monitored rooms and somehow came up with the Vice Presidential Suite on last minute notice. The suite was something out of a Hollywood movie. I cannot say enough about the Renaissance and their staff. The food was incredible, the facilities gorgeous. The hotel should be very proud of all their staff. I cannot imagine a better venue for a wedding.", "title": "Amazing staff - extraordinary facilities", "user": "Kathy K", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118160495}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I have been staying at this hotel over the past few months for business and have come to really like it and the service. The fact that it is an old masonic temple gives it a unique air and I appreciate the blueprints on the room floow that show how it was originally designed. The color scheme is very red, but it appeals in its sophistication and quality. Many of the rooms are very large and I find it more than adequate for business needs, with good desks and the ability to connect wired or wirelessly.", "title": "Nice hotel in a unique building", "user": "GTRambler", "date": "September 15, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118155394}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The staff are very cordial and gracious. Always willing to help and hoping to build a relationship with returning guests.", "title": "Best smelling hotel I have ever been in!", "user": "SparkyzFan", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118061754}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "All in all I would recommend this hotel as the best place to stay in Providence if you want comfort.", "title": "I love this Hotel", "user": "P4620", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118053200}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This was a beautiful hotel! The room was huge and very nice. We tried the valet parking and the service was very friendly. We had a problem with a light bulb blowing a breaker, but, engineering was up right away and fixed it in no time. The only reason I did not rate with 5 stars was they charge for internet access. The hotel seemed to be truly clean without all those heavy smelling \"deodorizers\" some places use to \"cover up\" the dirty smell.", "title": "Good Hotel, Great Staff", "user": "Traveller147388", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118036195}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Always like the Renaissance. Get nice clean rooms, big beds and helpful service. This particular Renaissance was typical, with a few exceptions. We arrived on the Friday night before Labor Day weekend. The hotel was full--and had been booked as such for at least a week. There didn't seem to be enough staff to handle the large load, although those that were there did their best. Had to switch rooms once as they could not find the amenities I requested. This location is a bit hard to get to, traffic near the state capitol is not local friendly. Also, room was somewhat noisy. But, it all worked out fine and enjoyed our stay.", "title": "Nice place, nice people.", "user": "Zen2Zen", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117997442}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "As a worldwide traveler I can tell quality of hotels very quickly and precisely, from the moment i arrived i was greeted professionally by the doorman, David, i believe his name was. He was very courteous and professional, and extremely knowledgeable of the area. It is very important to have people like this representing your hotel because they are the first impression. Checking in was also a memorable;e experience, the young lady named Crystal gave me a complementary upgrade that had a spectacular view of the RI Capital and the downtown area. I am a starwood rewards member and am rethinking upcoming reservations. I came to Providence for a wedding that was being held at another hotel and i was shocked at what a great city providence is, if i come back for any reason the Renaissance will surely be my hotel of choice.", "title": "Exceptional Service", "user": "paul c", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117948530}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We spent hurricane Irene here for my nephew's wedding. The hotel staff was so wonderful. They allowed us to extend our stay at the special rate. They even blocked out space for us in the restaurant, when we couldn't get out due to the rain. Other than housekeeping being a bit slow to clean the rooms, I really can't think of anything negative to say about the hotel. It s within walking distance of the mall, and our rooms had gorgeous views of the capital.", "title": "Very accommodating", "user": "jeckel13", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117946199}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed at this hotel for the first time on a business trip/meeting held by a client a work with. Everyone in the meeting loved the hotel. The hotel is located in the heart of downtown, and within walking distance of a number of good restaurants, and large mall. It is a old and historic property that has been beautifully updated. My room, (and other reported the same) looked very fresh and new, especially the bathroom. The bed was excellent and the room was very very spacious. The service was also excellent. I was also very impressed with their meeting management. I did not organize the meeting, but I have done enough of these to know if the hotel staff is doing its job.. The hotel staff was both well organized and on top of the meeting. The quality of the food was surprisingly good.", "title": "Your Best Bet in Providence", "user": "MacAtlantaGa_", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117846872}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I have had a couple of bad experiences with Providence Hotels, and I was glad to have great one at the Renaissance Providence.", "title": "Awesome location and wonderful staff!", "user": "aug08bride", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117837116}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We loved the clean comfortable room, and the overall feel and decor of the hotel. It was right near the beautiful State Capitol building and conveniently located to restaurants and the mall.", "title": "Very nice hotel, comfortable and clean", "user": "likecomfy", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117809133}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband initially asked for a lower level room (I think it was a better price)When I asked for a higher level for views of the city, the nice woman at the desk upgraded us to a deluxe room - no additional charge. This may have been because I am a mariott rewards member.", "title": "A great hotel!", "user": "Southside", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117804427}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The room was spacious, clean and comfortable. The bed was very comfortable. The bathroom was spacious and clean. Aveda bath products, fluffy robes, and hair dryer supplied.", "title": "It could be better.", "helpfulness": 1, "user": "Jon_1556", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117727482}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We went back to the desk to ask about the origins of the hotel because it is very unique, and the same nice lady gave us the entire history of the hotel.", "title": "We loved it and we'll be back!", "user": "Barbsywarbsy", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117701226}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Breakfast was $7 for continental and $24 for full buffet. The food was very good, but I thought $24 was pricey for what was offered.", "title": "Loved it!", "user": "missjoeli", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117606304}], "location": {"country": "United States", "city": "Providence"}, "stars": 4, "variance": {"poor": 17, "average": 34, "very good": 208, "terrible": 9, "excellent": 384}, "aka": "Renaissance Providence", "slim_ranking": 0.166666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}