{"user_rating": 4.0, "review_count": 474, "name": "Renaissance Concourse Atlanta Airport Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at the Renaissance Concourse the night before an early morning flight. The hotel is very good. I loved the atrium layout of the hotel - very open and airy. The open design does make the hotel more noisy than one would expect, but it wasn't bothersome. My room had a balcony overlooking the runways, which was fun. The room was quite nice and very comfortable. I had dinner at the on-site restaurant, and while expensive (but not beyond what you expect at an airport hotel), the food and drinks were good and the service was decent - everybody was very nice, just a little slow and a bit forgetful. The atmosphere in the restaurant is nice and there are large windows overlooking the airport runways so you can watch the planes come and go as you eat.", "title": "Very nice choice for an airport stay", "user": "november_moon", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143723926}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Overall the hotel was very good - the only things that prevented me from giving it a 5 instead of a 4 were: service in the restaurant could be improved and there were a few amenities missing from my room that I would expect in a hotel of this caliber - mainly a hairdryer, which was a big deal to me - had to request one in the morning, and waiting for it to come put me behind schedule.", "title": "Superb Hotel", "user": "Paul H", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143652128}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Top class Hotel, perfect for aviation enthusiasts, great bar great food.rooms very large clean, comfortable,massive beds, needs more free tea and coffee in the room, great gym, large pool, indoors and outdoors, private balconey....", "title": "For An Airport Hotel...", "user": "Sandy K", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 142665098}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I rate the hotel average, but if you need a hotel near the airport, this hotel is quite good. The rooms are very comfortable and reasonably well appointed. The food is better than ok but not exceptional. The service is friendly and good. Of course, the noise for a majority of rooms is quite loud most of the time since the hotel is situated very close to runways at one of the nation's busiset airports.", "title": "Great view of airport! (If you like Delta airplanes!)", "helpfulness": 1, "user": "Bill O", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 142520544}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We had a business conference here, which, I take it, is done by many because of the convenience of getting people to and from flights easily and quickly. I believe it'd be better to go on into town and get the amenities of better hotels even at somewhat of a higher price, but that's a beef I would better direct to our sponsors than to you, dear readers. The reason that I make the point here, however, is that I want to say this hotel works nicely as a place for that one night before or after a flight when there's a need to have a nearby hotel. I don't recommend it for more.", "title": "Excellent Stay at this Airport Hotel", "helpfulness": 1, "user": "caneshockey31", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142416818}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stayed here overnight on our way from London, England. Liked the design--the atrium gives a feeling of spaciousness and calm. Rooms are clean and comfortable . We had a room with balcony on the airport side but if you're not an airplane buff I recommend you take a room on the other side, away from the airport , since the noise can be annoying. It stops at 10 p.m though, so O.K. for sleeping.", "title": "Good if you're staging through", "helpfulness": 2, "user": "IsleOfWightCaulkhead", "date": "October 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0}, "id": 10230700, "likes": {"liked": "— Feeling of space inside the hotel."}}, {"rating": 5.0, "title": "Loved the Hotel !", "text": "Stayed here this past Saturday night because of an early morning flight and our only complaint was that we didn't check in earlier to have more time at the hotel.", "helpfulness": 4, "user": "RachelKansasCity", "date": "October 9, 2007", "id": 10059196}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "It was a beautiful, modern , immaculate , well run hotel.", "title": "Great Start To Honeymoon", "helpfulness": 1, "user": "stargirlcw", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10007671, "likes": {"liked": "— The Comfortable Beds and The Breakfast and the beautiful lobby", "disliked": "— We ordered a late night snack that took too long to deliver"}}, {"rating": 4.0, "title": "Loved the hotel views", "text": "We booked a room overlooking the runway and you are very close to the runway !", "helpfulness": 2, "user": "sdthompson", "date": "September 13, 2007", "id": 8708214}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Great for plane afficionados.", "title": "Best View and Beds!", "helpfulness": 2, "user": "kimmiejohn", "date": "August 27, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8517931, "likes": {"liked": "— The view of the airport and the beds", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Nice views of the airport, yet quiet, good room service.", "title": "Good Stay", "user": "Rob S", "date": "February 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13268931, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I meant to write a review for this hotel long ago. My husband and I stayed at the Renaissance Concourse the night of our wedding because we were to depart on our honeymoon the next morning, and we needed to be at the airport by 7:00 am or so (ouch). The hotel was SO convenient because the offered a park and fly package where you get a room for the night at the hotel, have a free breakfast (which was pretty delicious), have free transfers to the and from airport, and free parking for your car until you return. It was the perfect thing for us.", "title": "Nice, convenient hotel!", "user": "flutterbye605", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13080130, "likes": {"liked": "— The wonderful airport package and the close proximity to the airport"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The staff was very kind to us, especially given the late hour of our arrival. They had a HUGE family reunion going on, and they seemed to be handling the craziness very well.", "title": "A wonderful place", "user": "gwhite17", "date": "January 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12965676, "likes": {"liked": "— Very clean and great deal and a decent location", "disliked": "— cant think of a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We were only there for about 5 or 6 hours, so maybe ours isn't the best opinion for someone looking to stay for several days, but we were quite happy. Our room was very comfortable and there were champagne and strawberries, and a gift waiting on us, which I think were also part of the package. The bed was comfy, and the bathroom was pretty well appointed.", "title": "beautiful older hotel", "user": "yowhuzup", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 12759452, "likes": {"liked": "— price and hotel", "disliked": "— a little noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I actually wanted to stay again when we returned, but we simply picked up our car and came home after our trip.", "title": "Very nice place to stay!", "user": "Aldenp76", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12697939, "likes": {"liked": "— The quiet in the hotel was supurb."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The Renaissance Concourse is a nice hotel within a five minute drive from Atlanta Heartsfield Airport. The entrance is pretty special with its floor to roof atrium. Check in went swiftly and the attendant was very friendly. The bed was comfortable. I had a \"city\" view but couldn't see the city from my 5th floor room, but really didn't need to have a view as I was tired and there only because all flights had been cancelled into DFW due to storms. I could sometimes hear airplanes taking off while watching tv, but didn't hear any when going to sleep and none woke me up. The room was average size, spacious and clean. The bathroom was large and clean.", "title": "Nice hotel, Comfortable Bed, No Wireless", "user": "GoodCompany2000", "date": "March 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14417282, "likes": {"liked": "— Convenience to the Airport.", "disliked": "— No Wireless Internet and Cable Internet Cost $14.00 a day."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I will continue my harping here about hotels, particularly hotels that cater to business travelers, that don't have wireless internet, preferably free. The Renaissance does not have wireless. They do have cable and it was sufficiently fast, but they charged for it, about $14.00 a day. If you cater to business travelers, it should be wireless and it should be free.", "title": "Wonderful", "user": "Justintx", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14288295, "likes": {"liked": "— Clean, quiet rooms", "disliked": "— Leaving"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Otherwise, it was a nice hotel with good service.", "title": "Poorly Treated", "user": "davethegr8", "date": "March 12, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 14241951}, {"rating": 5.0, "title": "Great place to stay", "text": "Beautiful Hotel. One of the nicest hotels I have stayed at. Lobby is beautiful. Staff friendly and appreciative. Rooms were clean, modern and most of all quiet. We will definately stay there the next time we stay in Atlanta.", "user": "atagctg", "date": "February 20, 2008", "id": 13719053}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "To put it simply, I originally booked this hotel in conjunction with our layover in Atlanta on route to Acapulco. I happened to book this hotel in September 2007 knowing that the hotel had amazing balcony views of the airport. It was definetly the hotel we wanted to be at. I even prepaid directly to the hotel in advanced to ensure nothing would be lost in the booking. Well we arrived at 3pm on day of booking and were told the hotel had no rooms available and we would be put up in a sister property and that they would cover it. I was very upset knowing that I had a confirmation and that we booked so far in advance for this particular hotel. I even asked to talk to the manager and he informed me there was nothing he could do. I asked for my payment back and he said no, we have you booked in at the other hotel for the same price. I didnt pay that price to stay in a second rate hotel. Well I ended up taking $50 bucks in cash and moved on down to the other hotel. The hotel handled the whole situation very poorly and there will be numerous letters sent off to Marriot head office and along to the hotel itself voicing my anger. I´m sure the hotel is as nice as others have reviewed but in my case I never even got passed the lobby. Guess it dosn´t matter if you make a reservation or not in advance. What a joke.", "title": "What's so great about this place?", "helpfulness": 1, "user": "LadyTraveling", "date": "February 16, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 13601335, "likes": {"liked": "— cool view of the airport traffic", "disliked": "— unorganized staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "At the last minute I needed a hotel due to a cancelled flight. Let's just say \"it had been a long day\" and I was cranky. Schlepping suitcase, briefcase and a bad attitude I was lucky to reserve this room minutes before arriving. It was a great experience - I was put in a room at the far end of the hallway in the corner (this is one of those hotels that has a central open courtyard with bar and restaurant on the ground floor and the rooms surround it like one big Guggenheim Museum floor plan), I ordered room service and used the business center - all in a span of 8 hours before my 6am flight the next day. The staff was very good - front desk, operator for the wake up call, the room service staff, etc. I'd definitely stay here again if I needed to be close to the airport.", "title": "Good solid business hotel close to Airport", "helpfulness": 1, "user": "NonaKim", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140778380}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "The balconies of the south-facing rooms at the Renaissance Concourse Hotel are just about as close as you can get to ATL's runways without being on a plane. It's an aviation fan's dream. And oh yeah, the hotel isn't too bad either.", "title": "Plane-lovers paradise", "helpfulness": 1, "user": "michiganmarlon", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 140559851}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel straddles the north runways at the world's busiest airport, providing incredible views of all the takeoff and landing action, and the sprawling ATL terminal complex and aircraft maintenance hangars. They even put chairs out on the balconies so that you can sit and enjoy the view.", "title": "Old and tired but still very decent", "helpfulness": 1, "user": "robertocusato", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 140438300}, {"rating": 4.0, "title": "Nice Hotel", "text": "The Renaissance itself is quite a nice place, with a big, soaring atrium lobby that's airy and inviting. The staff is very pleasant, from the airport shuttle van drivers to the check-in staff to the restaurant/bar staff and so on. Check-in was quick.", "user": "GoinPlaces63", "date": "September 15, 2012", "id": 140368586}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My room (2 queen beds) was spacious and clean. It had the requisite flat-screen TV and generic earth-tone color scheme. The work desk and lounging furniture were more than fine. The bathroom was also large and well-equipped with Aveda bath products.", "title": "Excellent and unique", "helpfulness": 1, "user": "launcher69", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 139429706}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I was flying out of Atlanta the next day, so decided to get a room here.....close to the airport. It was a good decision. The shuttle was free and timely.The room was everything one would expect from a Renaissance property. Just walking around the Hotel was an experience. Reminded me of the Opry Hotel in Nashville.We also ate at the Hotel restaurant and it was very good as well.", "title": "Nice stay near the airport", "helpfulness": 1, "user": "williamhosey", "date": "August 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139022818}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Exactly what you would expect from a very nice full service hotel. Great looking property, clean/comfortable/classy room, friendly/helpful staff. Decent food, nice bar, prompt service and good atmosphere. Super convenient location if you're just flying in and right back out again the next day - free shuttle service says they run every 20 minutes, but they'll take you right away/pick you up when you call, even outside those timeframes. Only complaint, and this is to be expected given it's located almost directly on the airfield...it's pretty noisy. I can sleep through anything so it didn't bother me one bit, but if you're a light sleeper, be sure to get a room on interior side of the hotel and/or maybe bring some earplugs.", "title": "Great, but Noisy", "helpfulness": 1, "user": "bugfreak", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138832394}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Would definitely stay again.", "title": "Great View From Hotel!", "helpfulness": 1, "user": "PackPride", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 138705692}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Before you go booking this hotel based off just the overall rating, be aware that this is near the airport, so there isn’t much to do around this area. With that said, the hotel does shuttle you to the airport where you can take the MARTA anywhere around town, or if you have a car it’s easy to get on the highway from there. The hotel itself is very nice! I really like the grandiose entrance once you are out in the restaurant area with the open air of the hotel above you. Ask for a room with the airport view so you can have a balcony and watch all the airplanes coming in from around the world! Also, if it’s summer time, go outside and enjoy the pool. Or, if it’s in the cooler months, they have an indoor heated pool and spa area. Highly recommended!", "title": "Comfortable stay, will return", "helpfulness": 1, "user": "Saranger", "date": "August 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 138158551}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Spent two nights here with spouse on business. Room on 9th floor, airport view. Check in efficient, friendly staff always asking if they can help you. Room large and beds very comfortable. Aveda amenities, nice towels. Speakman shower head (same as Westin). Coffee maker in closet.", "title": "GREAT STAY!!!", "user": "Budd B", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138116275}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "First of all, I would like to state that I am a travel agent, so I have reviewed and stayed at many hotels.", "title": "Refreshing", "helpfulness": 1, "user": "sylviaelewis", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12137607, "likes": {"liked": "— The views", "disliked": "— rennovations"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "The Renaissance Concourse hotel is definately one that I will be recommending to future clients. This hotel is conveniently located so close to the airport that should you get a balcony suite, you can sit outside and enjoy watching the airplanes take off and land. At the same time, the rooms have an excellent standard of soundproofing that while you can still hear the planes from the inside (barely), they do not disturb your sleep. The staff is friendly and willing to go above and beyond to help you. The lobby is extravigant, and the breakfast is equivallent of any breakfast you will eat in any restaurant, though not free. The beds are extremely comfortable and the rooms are fresh and clean. I usually associate a musky odor with many hotels, but am glad to say that this hotel did not have one.", "title": "a great place for plane buffs to make a landing", "helpfulness": 1, "user": "ajva", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11059310, "likes": {"liked": "— view of airport", "disliked": "— inattentive staff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "There is actually a television in the bathrooms, and you can rent movies that are still in theatres! They are doing rennovations at this time to keep their hotel fresh, but you can hardly notice. This was one of the best hotels I have reviewed. I will reiterate that this hotel was wonderful, and I will be both staying and recommending this hotel.", "title": "Good service but needs to be updated", "helpfulness": 1, "user": "1Kman", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10759799, "likes": {"liked": "— Big rooms, front desk staff, location, Marriott points", "disliked": "— Waitress Lori in the bar, dated fixtures"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The great selling point of this hotel is it's CLOSE CLOSE location to the Atlanta airport. The Hotel sits adjacent to the airport property just over the fence from parallel runways 8R-26L and 8L-26R. From the balconies on the airport side of the hotel it is possible to watch take-offs and landings at one of the country's busiest airports.", "title": "Modern Luxury with Timeless Hospitality", "user": "JAXtravel", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10437134, "likes": {"liked": "— Comfy Bed, Great View, Professional Staff, complimentary shuttle 24 hours", "disliked": "— room size"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I had seen this hotel for years on many occasions as I was zooming down the runway making one of my numerous connections in the Atlanta airport. I wondered what it would be like to stay there and what kind of view of the airplanes coming and going it would have. So on my recent trip to Atlanta I decided to pass though. I purposely requested a room on the airport side of the hotel both in my reservation and at check in. My request was honored. After check-in i found my room, number 428, with its floor to ceiling window and full balcony.", "title": "Another great stay at the Renaissance...", "helpfulness": 2, "user": "MelissasTrips", "date": "October 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10375627, "likes": {"liked": "— It's just an all-around great hotel!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Right on the edge of the busiest airport in the world,complete with balconies from which to watch the planes. It is fascinating. Rooms are amazingly quiet, so don't worry about that. Good peach martinis in the bar a great breakfasts.", "title": "great view of airport.", "helpfulness": 1, "user": "travelmomCincinnati", "date": "October 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141998596}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife and I stayed at this hotel a day before our trip to Panama. We had a very ealry flight to Panama and it was very convenient to come to Atlanta the day before and stay at the hotel. Our stay included a shuttle to the airport and secured parking for our car. It was a very nice quiet hotel. The hotel was very clean with comfortable king size bed. The front desk staff was nice and friendly and the restaurant was nice. We had a light meal before turning in early I would definitely recommend this hotel to others especially if you have an early flight the next day.", "title": "Convenient to Atlanta Airport", "user": "dtb61", "date": "October 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141933096}, {"rating": 4.0, "title": "Loved it! Needs cheaper bar prices though", "text": "My friends and I stayed here for a bachelor party. It's only 15 minutes to downtown, the price was great, hotel is stunning on the inside, room was superb, beds very comfy, amazing soaps that were spa quality. The only negative thing I would say about this hotel is the drink prices at the hotel bar are so outrageous that the bartender actually told us to not drink there. 7 bucks for the cheapest beer and 11 for a basic wells drink. Would have been nice to have some drinks at the bar before we went out but it really wasn't a big deal. I will definitely stay at this hotel again if in the area.", "helpfulness": 1, "user": "MrZoob", "date": "September 30, 2012", "id": 141693132}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "my husband and I stayed at this hotel a day before and the day after our trip to Jamaica. it was a very nice quiet hotel. the front desk staff was nice and friendly and we were placed on the 11th floor which is concierge level do to my husbands Marriott elite status. our room was facing the airport which was wonderful. it's extremely nice watching the airplanes come and go off the runway. it was also surprisingly quiet at night. the concierge lounge is somewhat small but have a variety of food and drink available pretty much throughout the day. a light dinner is served starting at 5 p.m. and Mister William the attendance there is absolutely wonderful. I would definitely recommend this hotel to others especially if you have an early flight the next day.", "title": "very nice start and finish to a vacation", "user": "lowcountryboilers", "date": "September 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 141236187}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I was traveling with a young woman not accustomed to travel in nice hotels and she was blown away. It was fun to see her reaction. This hotel has the old-school atrium design that is horrible for energy efficiency but it does look cool! The room was very nice. The beds were excellent, pillow top mattresses with high quality linens. Very nicely appointed bathroom with four star polish. This will certainly satisfy the business traveler who is used to four star or very nice three and a half star accommodations.", "title": "Beautiful hotel, outdoor pool is lacking style", "user": "holyjes", "date": "September 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141108228}], "location": {"country": "United States", "city": "Atlanta"}, "stars": 3.5, "variance": {"poor": 27, "average": 57, "very good": 174, "terrible": 11, "excellent": 205}, "aka": "Renaissance Concourse Resort", "slim_ranking": 0.192708333333}