{"user_rating": 3.5, "review_count": 348, "name": "Renaissance Tel Aviv Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We decided to have a 2 night stay at a hotel on the beach in Tel Aviv. There are 4 hotels there to choose from and we decided to give the Marriot a try afetr having stayed at others.", "title": "Executive level not worth the money", "helpfulness": 3, "user": "hankn", "date": "September 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41741467}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Checkin wa slow since there was only one person at the frontdesk even though there were other staff members milling about with a line of people to checkin. Even the girl behind the desk asked her colleagues to pitch in but they were too busy doing paperwork then to speed guest entry. I guess someone has to talk to Marriot about priorities.", "title": "Opposite of charming but celebrated for location to beach", "helpfulness": 2, "user": "AviBoston", "date": "September 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 40200743}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We got a room on the 14th floor - a more expensive Executive level than the standard Comfort, Deluxe or Club level rooms. The room was ok but what annoyed me the most of this hotel was that the minibar was electronic - the kind that opening a shelf automatically charges you. This indicates to the guest that the hotel considers you a thief and not a guest.", "title": "Comfort, beach,sun and wonderful sunsets", "helpfulness": 3, "user": "vibradental", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35556867}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The bathroom had only one robe and one set of slippers even though the booking listed two guests. After we called they brought extra sets.", "title": "Executive floors offered a lot of . . . food! Yay!", "user": "sueceeque", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35118797}, {"rating": 4.0, "stay_parameters": "Stayed July 2009", "text": "The lounge on the 16th floor was a disappointment in its food offerings. Cold and hot drinks were available, but food was minimal compared to other lounges in Tel Aviv hotels. No fruit. No potato chips. No pretzels. One type of cookie. Not worth the money for lounge access.", "title": "Another very nice stay", "helpfulness": 1, "user": "robd", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34715795}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Had a wonderful stay at the Renaissance Tel Aviv.", "title": "A wonderful hotel, great location", "user": "Veganboy", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 59570644}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel has perhaps the best location in Tel Aviv - you step out from the back door and you are on the beach! And Dizengoff Street is about 10 minutes walk away.", "title": "Superb location on beach - hotel itself is comfortable but decor dated", "user": "RStokes", "date": "March 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58280221}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "We had a nice sized room on the 6th Floor - facing south. All rooms have a view of the beach but I'd recommend a south facing room so you can see Jaffa in the distance. We could also see the sun set which was great.", "title": "GREAT hotel!", "user": "ToughCritic4Sure", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57792819}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The room was fairly quiet but occasionally we heard the TV from the adjoining room.", "title": "Quasi luxury on the beach", "user": "Westontraveler", "date": "February 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55884985}, {"rating": 4.0, "title": "Awesome location, service not great during night hours, excellent during the day", "text": "You can't turn the handle on the outside of the room door unless you've inserted then removed the card key. People aren't aware of this so many people when going out from their rooms pull the door closed which makes a banging noise. Not a problem during the day but maybe at night time if you want to go to sleep early.", "user": "alm5150", "date": "January 26, 2010", "id": 54377726}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The renaissance is a renovated Ramada.It is better located than the Sheraton. You can walk out directly to the beach. Lounges cost a few dollars. Saturday at the beach is very loud lots of cigarettes and alcohol on the beach. Other days the beach is tourist oriented. The rooms and bath are okay . Tel Aviv is a busy city. Getting around by car is a challenge-poor directions and many motorcycles darting in and out. overnight parking is available for $13 or $20. Try to get gps if driving.", "title": "Comfortable", "user": "sunsurfandsand", "date": "June 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68149973}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "I recently stayed at the Marriott - Renaissance Tel Aviv Hotel and had an awful experience. If it didn't say Marriott inside the hotel I would've assumed I arrived at Motel 6. I frequently stay at Marriott in the US so when I traveled I though I could trust Marriott International to offer me a good stay. Was I wrong. After that experience I will never stay at a Marriott again. I made my reservation online with Orbitz and when I arrived at the hotel the rude person behind the desk (named Sivan) said she couldn't find my reservation. IT TOOK HER 25 MINUTES TO LOCATE IT! the whole time she was giving me attitude like I was responsible for he incompetence. In the middle of the booking process she turned to her colleagues and said in Hebrew: \"This guy is really annoying me\". How is this acceptable, what kind of customer service is this. Just because I live in the US doesn't mean I'm not fluent in other languages, I understood every word. Is Marriott even supervising the people that work there? what kind of hotel is it where you pay $500 for two nights and you're the one \"annoying\" the desk person. The room we got (for two people - not a couple) was small and we got two children sized bed.As if that wasn't enough things just got worse. In order to get beach towels each guest gets a a towel card which you give the attendant to get a beach towel and upon it's return you get the card back. You must check out with this card or you will get charged. Next day we went to the beach and got towels. When we returned the beach towel desk was already closed, so we thought \"ok we'll return it tomorrow\". We left the towels in our room and went to eat dinner. When we returned there was a breakfast menu for the morning on our beds and the 2 towels were gone!!! not our room towels (which you can tell the difference) the beach towels! We go down to the front desk - furious! the guy says he'll send 2 beach towels up so we dont get charged. 30 minutes later a cleaning guy shows up with REGULAR towels not beach towels!!!!", "title": "Worst Hotel Service Ever - Stay Away", "helpfulness": 2, "user": "joshuab123", "date": "May 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 64498638}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Things just kept getting worse and worse. In the morning of the checkout I go to check out and instead of just checking out (cause my reservation was paid in full to Orbitz) Yaron at the front desk claims that \"Orbitz didn't send them payment yet and he's going to charge my credit card\" As if that's my problem!", "title": "Great location, comfortable stay", "user": "MrsSaunders", "date": "April 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60574683}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Worst hotel experience ever!", "title": "Spend your money elsewhere!!", "user": "CurtiousTraveller", "date": "April 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 60118917}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "We stayed over Passover and were impressed by the terrific locaton - right on the beach. The staff tried hard but could do with much better training and management, unusual for a Marriott. We were told on several occasions on Shabbat and over the holiday that \"black coffee\" wasn't available, though Nescafe was. On pressing further, we found that filter coffee was on tap; \"ice coffee\" (on the menu) was not available on shabbat, thgugh \"ice coffee with ice cream\" was; we asked for it, \"without the icecream\" and it miraculously appeared. The breakfasts are magnificent with as much choice as you can find anywhere in Israel. However, when we asked if there was any cottage cheese (which was usually on the buffet) we wre met by a curt and brusque \"No!\" However, the room - facing Jaffa - was fine, very clean and well fitted and the bed was very comfortable, with six pillows between the two of us. Maid service was, however, erratic; on one morning the room was made up by 8.30; the next day, it wasn't made up by 15.30, to my discomfort, as I wanted to show the room to my sister-in-law, who lives in Israel, The sun terrace overlooking the beach makes a great place to read in comfot and shade, with a limited menu available througout the day. All in all, we had an enjoyable stay and would stay again.", "title": "Superb", "user": "mifarrell", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59686497}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This hotel is on the beach where you can find many restaurants and many beach activities. Great restaurant, only had breakfast there, but that was a superb buffet full breakfast. Rooms big and clean, lobby spacious, overall is elegant and clean.", "title": "Fantastic location on the beach", "helpfulness": 1, "user": "zahav", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51886204}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Not walking distance to downtown area but short cab ride or drive.", "title": "Excellent business hotel", "user": "nealjking_njk", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51238139}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Excellent service, but not inexpensive: This hotel is right on the beach in Tel Aviv, with easy access to restaurants. The hotel staff were always helpful and thorough. However, the room price was quite high, and they charge a lot for WiFi access.", "title": "Not Impressed", "helpfulness": 2, "user": "ibreak4coffee", "date": "November 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 49998489}, {"rating": 4.0, "title": "A great location and a good hotel", "text": "Stayed here for one week on a business trip. Overall I was not impressed by the hotel, nor the service levels.", "helpfulness": 4, "user": "herv_7", "date": "September 20, 2009", "id": 43041406}], "location": {"country": "Israel", "continent": "Middle East", "city": "Tel Aviv"}, "stars": 5, "variance": {"poor": 35, "average": 82, "very good": 120, "terrible": 17, "excellent": 94}, "aka": "Renaissance Tel Aviv", "slim_ranking": 0.59756097561, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}