{"user_rating": 4.5, "review_count": 369, "name": "Renaissance Charlotte Suites", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "I was just down here for a 2 day conference right at this hotel. The airport shuttle from the airport was very convenient. The meeting rooms were appropriate and the staff very friendly. I found my room to be very large and well appointed, as I think this is an all suites property. My bed was very comfortable and having the separate living room and kitchen area made it convenient when in had a few coworkers over to watch the game later at night in my room. The bar downstairs had a good variety as well. All in all, a nice clean place, perfect for smaller meetings and conventions.", "title": "Great For Business Trip", "helpfulness": 1, "user": "mainetoday", "date": "June 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16919719}, {"rating": 4.0, "title": "The Wonderful Renaissance Charlotte Suites Hotel", "text": "This hotel has had a facelift since my last visit there in November. The rooms have been re-done, they are comfortable ,spacious and just a few little details have been overlooked....a make up mirror in the bathroom would be welcome. The food is the best hotel food we've ever eaten, and the presentation is \"first class.\"", "helpfulness": 1, "user": "VEGO", "date": "May 4, 2008", "id": 15642893}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "This was one of the nicest hotels Ive stayed in, in a while. There was some renovations going on but it didnt bother anyone or anything. The place is lively, classy and welcoming. The food is average, but overpriced. The bartender really knows how to make you enjoy happy hour. The crew was polite and very helpful.", "title": "Good times!", "helpfulness": 1, "user": "Packerzzz", "date": "April 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15249737}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The pool facilites were nice and so was the gym, except that I didnt use it. A shop for souvenirs was open till very late, but instead of colecting keepsakes, I indulged in the variety of yummy snacks and drinks they carry. Also HAAGEN DAS! what a treat! The chick who works there is hot too.", "title": "give the renaissance a pass", "user": "rosiesc", "date": "January 12, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 12557259}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "bottom line, good place, worth the money.", "title": "A cut above other Renaissance hotels but far from excellent", "user": "scl44", "date": "January 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 12374473, "likes": {"liked": "— The spacious suites at the price of a hotel room", "disliked": "— The location and service"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Requested an early check in (normal check in is at 4:00 p.m.). The hotel booked at least two large conventions and was unable to handle the massive number of patrons. At 4:00, the room was still not ready and people were lined up waiting to check in. All were being told to \"check back in 30 minutes.\" Ice machine was broken on my floor. The telephone in my room did not work. Only has one restaurant on the property; two computers in the \"Business Center.\" And they charge $10.00 a day for Internet connection. I would never suggest a stay in this hotel.", "title": "What a nightmare!", "helpfulness": 1, "user": "ncsu_rn", "date": "November 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 10627620, "likes": {"liked": "— Absolutely nothing.", "disliked": "— The rooms not being ready on time."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "This was my third stay in this hotel and it will probably be my last. Were to start... It took 30mins to check in. The food was subpar and the prices were outrageously high. I reserved three rooms. One was fine, one we couldn't get in, and one had water all over the carpet and smelled like mildew. It took 2hrs to get someone to fix the door to the room that we couldn't get into and I had to request another room without a wet carpet. The staff was somewhat helpful. The rooms were not as clean as before.", "title": "Last trip to this hotel.", "helpfulness": 1, "user": "briny319", "date": "October 23, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 10269057}, {"rating": 5.0, "title": "Very nice - highly recommend!", "text": "My first impression of this hotel is that it reminded me of an Embassy Suites, but a step up. The hotel had anopen atruim with glass elevators when you first walked in. The suites were clean and modern and I liked the subtle touches, such as nice throw pillows on the sofa and warm dark wood around the fridge and microwave. The bed was very comfortable and included a pillowtop mattress. I'm happy to see that hotels now understand that beds are top priority when staying away from home!", "user": "southernhiker", "date": "August 5, 2007", "id": 8356075, "likes": {"liked": "— I liked the look and feel of the suite", "disliked": "— Everything was great, if I had to pick something I'd probably like to have had the lunch buffet a little more upscale."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We had access to the club level and I was impressed with the morning and evening reception food. It seem to be more extensive than I have seen on other hotel club levels.", "title": "Excellent", "helpfulness": 1, "user": "GAT#1", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8217347, "likes": {"liked": "— friendly staff, clean rooms, beautiful decor and great restaurant", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "I had lunch a couple days in their restaurant and took advantage of the lunch buffets. It was pretty good, the service stood out more than the food. The servers were friendly, knowledgeable and seemed to be a step ahead with anything I needed.", "title": "Beautiful hotel, but......", "helpfulness": 1, "user": "GEOFFS3", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 7631153}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "An amazing hotel indeed. We stayed for almost a week last month and I never wanted to leave :-( The gym was a lifesaver though and the staff is exceptionally trained. The food was good, however one thing that stood out for me during my stay was the 'Gift Shop' situated within the hotel. This shop had anything and everything you could and cant think of! If there is something you need that they dont carry, they immediately 'special order' it for the guest.........as they did for me. I even bought some ethnic looking apparel which I absolutely LOVE!!", "title": "Great Staff", "helpfulness": 1, "user": "GoGetter81", "date": "April 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7418926}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The manager of the hotel should definately pat him/herself on the back for running such a great hotel.", "title": "Absolutely Wonderful!!!", "user": "OtisClark", "date": "December 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6445116, "likes": {"liked": "— Clean & Luxurious Accomodations", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Very Nice--No Complaints", "text": "This was the best hotel experience we have ever had in the states!!! We were only there one night because of a layover issue. They picked us up at the airport and checked us right into our suite. Every aspect of our visit was absolutely Five Star!!! Every other hotel chain could learn from this establishment on how to treat its guests. If you want the best possible service and the nicest hotel room stay at this one!!!", "user": "Cowles12", "date": "November 30, 2006", "id": 6310165}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My family and I stayed here for a one (Saturday) night stopover. We needed to be near the airport b/c of an early am flight. The hotel was clean and the staff, especially the night time staff, was extaordinarily helpful, friendly and efficient. It may not be quite as nice as some other Renaissance hotels, but it is worth the reasonable price I paid. It cost me more to stay in a room at a Hampton Inn just a week before, and, understandably, the Hampton Inn did not compare favorably. I'd stay here again in a heartbeat. I'm giving it 5 stars mostly for the staff, even though the hotel is not quite as nice as some Renaissance hotels located downtown in bigger cities. But is costs less, too.", "title": "Great stopover", "user": "Maggie from Michigan", "date": "October 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 5907436, "likes": {"liked": "— The clean, pleasant rooms", "disliked": "— Definately try a Renaissance Hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "My family and I have stopped here twice on the way to and from places south. I really like this hotel. The beds and linens are great. We've had good experiences with the food. All the service has been pleasant and helpful. The small store has some cute indian things to look at. We've also stayed at another Renaissance in northern MI and found it very nice as well. I keep this hotel on my list whenever we head to FL or SC.", "title": "Not Bad..", "helpfulness": 5, "user": "I.Z.E.", "date": "September 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5790759, "likes": {"liked": "— Clean Rooms", "disliked": "— Dated Carpet and wallpaper."}}, {"rating": 5.0, "title": "Great amenities, OK location", "text": "My spouse and I stayed at this property for a weekend getaway in Charlotte. The location is fairly easy to find and convenient to I-85, Billy Graham Pkwy, and the airport (we didn't hear any airport noise though). However, guests will need a car while staying here because there are no restaurants, convenience stores, etc. within walking distance. Our early check-in was quick and very easy. The lobby is spacious and has a great restaurant, sundries shop, meeting space, etc. The glass-paneled elevators make for a scenic ride to the upper floors. Our room was very spacious with seperate living and bedroom areas. The couch pulls out into a sofa bed for those that need it. The room had 2 televisions, microwave, dorm-sized refrigerator, and coffee pot. The bathroom was very clean and bright. The bed had plenty of extra pillows and the linen were soft and comfortable. The concierge and front desk staff were knowledgable about the area and gave great directions. We would definitely stay here again!", "helpfulness": 3, "user": "chem_dr", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5715678, "likes": {"liked": "— Room amenities", "disliked": "— Distance from attractions"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "My experience at this hotel could not have been better. The rooms are huge (separate living room and bedroom). The beds are very comfortable and the decor is fairly new.", "title": "Perfect in every way", "helpfulness": 1, "user": "baxterins", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5713116, "likes": {"liked": "— Food and size of room", "disliked": "— n/a liked everything"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The staff was very helpful. The lobby is huge and a great place to meet business associates.", "title": "Great For Long Stays If You Have Transportation", "helpfulness": 1, "user": "leondrataylor", "date": "August 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5538949, "likes": {"liked": "— Microwave and Refrigerator", "disliked": "— Lack of concierge and restaurant choices in the hotel"}}, {"rating": 2.0, "title": "Fine Dining and Stylish Decor???", "text": "The meal I had at the restaurant was the best I've had at any hotel in a very long time.", "helpfulness": 4, "user": "JCSISEMORE", "date": "March 23, 2006", "id": 4728200}, {"rating": 2.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "I will stay here whenever I am in Charlotte. It is a great hotel.", "title": "Not impressed.", "helpfulness": 3, "user": "meg7456", "date": "November 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 4109783}], "location": {"country": "United States", "city": "Charlotte"}, "stars": 3.5, "variance": {"poor": 18, "average": 22, "very good": 120, "terrible": 9, "excellent": 200}, "aka": "Renaissance Charlotte Hotel Charlotte", "slim_ranking": 0.077380952381}