{"user_rating": 4.5, "review_count": 693, "name": "Renaissance Paris Vendome", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed here in April of 2007 and absolutely loved it. Rooms are a little small HOWEVER you should rarely be in your room, right? Beds are heavenly, we did sleep in a lot because of this. I still use the Bulgari lotion they had in the room (reminds me of Paris now). This hotel is close to the Louvre and other great attractions. PLEASE visit the fun Irish bar across the street, we made some great friends in there ~ Bon Voyage! P.S. Don't forget to check out the pool and fitness ctr. in the basement, it was wonderful to be able to take a little swim in the afternoon.", "title": "Loved this hotel", "user": "SBRussell", "date": "March 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14454517, "likes": {"liked": "— Beds, location and pool/fitness ctr.", "disliked": "— rooms were a little small"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Did a lot of reading on TA to find perfect hotel, but think I might have got better value for money elsewhere I'm afraid. The hotel is very modern and trendy and the service very friendly, but sadly the room size and a few other drawbacks, meant that I couldn't give a better review.", "title": "Very average, possibly overpriced.", "helpfulness": 1, "user": "kq501", "date": "March 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14447509, "likes": {"liked": "— Location good", "disliked": "— Room service food, noise"}}, {"rating": 5.0, "title": "Great location. Amazing service.", "text": "We were given an upgrade on arrival, but I'll be honest, unless the upgrade meant we got a mini bar... I really can't believe it was a proper upgrade. The room was very small and compact, and if we were rightly upgraded to a suite then I'd hate to have spent even more money (which I nearly did prebooking) on such a small suite.", "user": "TravelingRaider", "date": "March 16, 2008", "id": 14322825}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I have been to Paris before and I am aware that rooms are small most places, but fo rthe money I spent I'd have expected better. We were unfortunately right across a small street from an Irish bar.... which at the weekend allows it patrons to drink outside while smoking.... EXTREMELY LOUD... to the point you can't possibly ignore it. Adults with suits acting like kids... both fri and sat nights.", "title": "Amazing Honeymoon", "user": "Travelminx", "date": "February 27, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 13883490, "likes": {"liked": "— the luxurious ambience and quality service", "disliked": "— -"}}, {"rating": 5.0, "title": "nice upmarket stylish hotel", "text": "We also ordered room service. My partner tried to order just a plain baguette with cheese, which they said they couldn't do as it's not on the menu!!! The food was very poor too for the money. A club sandwhich, drenched in dressing that it turned to mush. Chips were cold and merely batter. We just popped it back outside hardly touched... but were still charged full price obviously.", "user": "thedogwalker", "date": "February 20, 2008", "id": 13711659}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We really enjoyed our stay. The staff were friendly, helpful and efficient. The hotel is located close (walking distance) to the Louvre, Musee D'Orsay and L'Orangerie, which was ideal for us. It is only a 1-2 block walk to the metro. We had a taxi called for us by the concierge for a Sunday morning departure. The taxi arrived exactly on time and there were none of the added charges that we had been warned about. The only thing we didn't like was that the air in the hotel was a little smoky, despite being in a non smoking floor and room. Maybe they need to clean the filters in their system.", "title": "Had a really nice stay", "helpfulness": 4, "user": "mklafter1", "date": "November 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6136975, "likes": {"liked": "— Location and overall atmosphere", "disliked": "— stale air"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "I just returned from a 4 night stay at the Renaissance Paris Vendome with my husband and 2 other couples. I picked this hotel from the tripadviser reviews. This is the cleanest hotel I have ever stayed it. I decided to reserve a superior room. The room was larger and there was a tub and seperate shower in the bathroom. The front desk was so professional and both of the concierge's, Jason and Olivier, were so friendly and helpful. I got wonderful recommedations for dining at small bistro's that were walking distance from the hotel. I booked the rooms on the Marriott website. {--) I picked a superior room with breakfast. Our breakfast every morning was great! You could eat in the dining room or order any thing you wanted from the room service menu. Either way, it was included in the room rate. Every evening after dinner, our group went to the pool area. There was a nice sauna, steamroom, large showers and a lovely pool. It was a great way to end the day.", "title": "I loved this hotel", "helpfulness": 9, "user": "blondtraveler", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6106304, "likes": {"liked": "— Cleanliness of the hotel", "disliked": "— The showers were small"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I would definitely stay there again.", "title": "The Best", "helpfulness": 3, "user": "Orfila", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6090231}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Simply the Best. Awesome location and friendly service. Cleaniest Room.", "title": "Great - but tiny rooms!", "helpfulness": 4, "user": "richardlondon", "date": "November 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6063722, "likes": {"liked": "— Excellent location", "disliked": "— Tiny, tiny rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Renaissance Paris Vendome is a great hotel in a perfect location. Service is highly professional yet discrete. The hotel is extremely well appointed with a contemporary, modern feel.", "title": "Better than Marriott Champs Elysee", "helpfulness": 5, "user": "abenakee", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6049322, "likes": {"liked": "— Location", "disliked": "— size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I have stayed in 3 different hotels in Paris and this was by far the best place I have ever stayed. It was in the middle of everything. My husband and I were able to walk to the Louvre, Tuileries garden, D' Orsay, Concord Place, the royal palace, and so much more. There is a metro station 2 blocks away and a velib station (bikes) right around the corner. We are elite members so they offered us free room service or breakfast in the restaurant every day-which was perfect to get a good start to the day. The staff was exceptional-they were friendly, courteous, and gave great advice as far as places to go certain days and tours they recommended. The room and bathroom were much bigger than your typical European hotel room. Looking at the prices, we may not have stayed there without our miles, but now that we have stayed there, I don't think I would stay anywhere else if we return to Paris.", "title": "Perfect location & Service", "helpfulness": 2, "user": "ecarder", "date": "October 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47456918}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "My wife, my 16-month year old daughter and I had a wonderful stay at this property. The location could not be better for soaking in Paris (strolling every morning in the Tuilerie gardens, grabbing lunch at Angelina's, walking to the Louvre and Orangerie, etc). With the exception of the Eiffel tower, everywhere we wanted to go (including outstanding restaurants) was within a 10 minute walk or cab ride.", "title": "Location, Location, Location", "helpfulness": 1, "user": "OR2010", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46757037}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The service at the Renaissance is very good. I also enjoyed the indoor pool, steam and sauna rooms. The concierge was very competent - arranged for all our reservations and tickets. The rooms are a little cramped and it is pricey - but hey, that's Paris.", "title": "Very nice, not so friendly, overpriced", "helpfulness": 1, "user": "adampres", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 46699717}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We did enjoy our stay at this hotel. The location is perfectly located in an area that is very nice, and the city felt very accessible from there. The staff lived up to a disappointing stereotype: curt and not very helpful.", "title": "Great hotel with great location", "helpfulness": 1, "user": "debbfrog", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 46385272}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel itself is very nice and our room was luxurious. However, as nice as it was, after staying at several other very nice hotels in Paris, we felt that it was overpriced. I believe that you could pay the same price or less for a larger room in an area just as good at a hotel of comparable quality.", "title": "Superb", "helpfulness": 1, "user": "tdp918", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46228404}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Perfect location! Sometimes helpful staff. Actually used the swimming pool and it was lovely! Very clean and nicely furnished.", "title": "This is not my idea of a superior room", "user": "Cooking-teacher", "date": "October 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 46035764}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "However, we were supposed to have a superior room and had a cell that was almost hard to turn around in -- and we are not large people. When we asked the front desk they said it was a superior room because of its size! All you had to do was look at the floor plan on the back of the door to see that this was not reality. Let's not treat guests like they are naive!", "title": "GREAT LOCATION & Service - Small Room", "user": "LucianoSF", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45854343}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I would recommend the hotel as long as folks understand that these are really small rooms.", "title": "Location and concierges make this a fabulous hotel", "helpfulness": 1, "user": "SheLovesToTravel413", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45837634}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My wife and I stayed at this hotel at the end of August for 5 nights. As mentioned in other reviews, this hotel is in an amazing location in the 1st, right by the Vendome, Louvre, Tulieres gardens. The staff at the hotel were extremely helpful and accomodating. We came to Paris primarily to enjoy amazing food ,and had a pretty big list of restaurants we wanted to try. They helped us plan out our entire 6 days and make and adjust restaurant reservations accordingly.", "title": "Nice rooms and great location - mediocre service and atmosphere.", "helpfulness": 2, "user": "SK8KIM", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 43312418}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Our flight arrived from the US in the early morning, and we were allowed to check-in before noon. The staff even gave us a complimentary \"double upgrade\" on our room. The rooms are very clean, nice and well appointed. Even with our upgrade however, we found the room to be very small, even when compared to other hotels in France or similar size/category hotels in New York City. While the bed felt comfortable to sleep in, I woke up extremely sore every morning and it took hours to feel normal again. This was probably the biggest downside of the room.", "title": "Nice boutique hotel: good service, great location", "helpfulness": 2, "user": "TTIW", "date": "August 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39202793}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This is a beautiful hotel with an unbeatable location--1 block off the Rue de Rivoli and a few minutes from Place Vendome. Two older hotels were combined and completely re-done when Marriott took over management. There is a wonderfully clean and attractive lap pool on the lower level. The staff is extremely friendly and accommodating--especially the concierge, David, and the rooms manager, Julie. The rooms are quite small (even the premier rooms with king bed). We were upgraded to a junior suite on our second day and, although very attractive, it is also rather small. Overall, we loved the hotel and hope to stay there again.", "title": "Pristine and Modern Boutique", "helpfulness": 3, "user": "DCRE", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 50515082}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I stayed 2 nights in this hotel during a business trip.", "title": "Avoid", "helpfulness": 1, "user": "hgeslin", "date": "November 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 50115470}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The decoration is nice but the room are extremely tiny.", "title": "Perfect Stay, Perfect Location", "helpfulness": 3, "user": "sjportcity", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49114611}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "It is so small that you have to eat your breakfast on the bed.", "title": "Wonderful visit", "helpfulness": 5, "user": "maroger242", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48656557}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The bathroom was small and the bath tub was only half the standard size.", "title": "A wonderful location!", "helpfulness": 2, "user": "swimmergrl", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47799254}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Stayed as mid week break. Overall the hotel was great with a very convenient location. Expensive for what you get but balanced against the convenient location. Staff very accommodating apart from one bad experience with a duty manager. The handle of the door to the ladies health suite changing rooms broke leaving guests unable to access the room. The Duty Manageress had no sympathy nor empathy for my wife's inconvenience at waiting in the corridor for ten to fifteen minutes until door was fixed. Small issue maybe but amplified unnecessarily by the fact that it was raised in the requested customer comment sheet filled in before leaving. Noone has got back to us from Marriot with a reponse suggesting the \"after break\" service is not high on hotel agenda. Spent approx 750 euros over two nights so disappointed at lack of response to our only gripe of the stay. It has made us question whether we use same hotel on another trip to paris next year.", "title": "mid week break", "user": "owenl", "date": "December 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6349273}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We opted for the Renaissance Vendome due to its location, and we were not disappointed. It's close to a number of \"must see\" spots (the Louvre, Champs Elysee), and the hotel itself is nicely appointed. Overall the hotel staff was friendly (yes, they were French), spoke perfect English and was quite helpful. We'd definitely stay here again..", "title": "What a great hotel!", "user": "Rockyrd", "date": "December 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6340716, "likes": {"liked": "— great location, comfortable, nice sized-room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "J. & R. Sullivan", "title": "Romantic weekend - Just what we wanted", "helpfulness": 1, "user": "bedefelts", "date": "December 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6321444}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "California", "title": "Perfect Paris Experience!", "helpfulness": 3, "user": "suze_shoes", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6231424, "likes": {"liked": "— Cleanliness, ease of stay, proximity to attractions", "disliked": "— I just wish more of france was non smoking."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Found this hotel on TripAdvisor and again wasn't disappointed. The rooms were clean and well laid out and had everything one could need. Great location and found ourselves walking to the Louvre and catching the Metro close by. Didn't get to use the hotel bar or restaurant as we ventured out for all of our meals and coffees - let's face it you are spoilt for choice in Paris. A weekend and stay to remember.", "title": "Small, but first class", "helpfulness": 1, "user": "SD_Happy_Traveller", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6177686}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Me and my boyfriend choose to stay here for our 5 year anniversary. We were not disappointed one bit.", "title": "Perfect anniversary in Paris", "helpfulness": 3, "user": "natgoduk", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38235594}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I had called the hotel prior to our arrival to advise it was our 5 year anniversary and if there was anything extra they could do it would be much appreciated. On arrival we were greeted by a lovely man on reception who firstly congratulated us and advised he had giving us a free room upgrade! BINGO! (I assume we only got the free upgrade because it was January and low season for Paris) We were placed on floor 5 with a view of the street below which runs out to the Tuileries Gardens.", "title": "Location location location", "user": "Nub2travel", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 38094885}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We went off to explore the area and when we came back there was a book of Top Places to Kiss in Paris left on our bed with a box of chocolates. This hotel just gets better! We tried out the swimming pool, it is only small but adequate. I would recommend this hotel to friends and family as we all know how hard it can be to find a decent hotel in Paris which isn't over priced.", "title": "Very comfortable hotel, great location", "helpfulness": 2, "user": "sayaz", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37990953}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "And don't forget to check out Godiva around the corner, it offers the best hot chocolates you can find. Yum.", "title": "Ideal location.", "helpfulness": 2, "user": "PollyFinders", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37876378}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This stay was my second at this property and it deserves high marks for style and location. I have had the opportunity to stay at this property a total of 10 days and the location made it ideal. Unfortunately on both visits I found the staff ineffective on some very important issues like my bill. To be balanced we did encounter some very helpful and pleasant staff members. I am addicted to the free candies at the check in area. And my mom & sister loved the bath amenities that I brought home from my first visit. I did not care for them so much.", "title": "Over rated by far", "user": "OpalJean", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 37441441}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This is a lovely hotel with beautiful amenities. Although our room was on the small size, the amazing bed more than made up for it. The bathroom was fresh and modern. The room was very clean.", "title": "Quiet Retreat", "helpfulness": 2, "user": "EllenBM", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6031656, "likes": {"liked": "— The feather bed and duvet plus the quiet, quiet room.", "disliked": "— A few stains on the carpet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I loved the french doors that opened into the courtyard.", "title": "The Best - Great Location, Service and Staff", "helpfulness": 3, "user": "MARVJR", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5980816, "likes": {"liked": "— Staff, Location, Service, Accomodations"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "You can walk to just about any major attraction in Paris from this location.", "title": "Great Paris Hotel", "helpfulness": 7, "user": "UTLonghorn2000", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5975137}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "We stayed here during our trip to France and Italy in mid-September. The location and the staff made the visit a pleasure. Service was outstanding; we were there for 3 nights, 4 days and they were packed with the museums (all within walking distance), travel all through Paris using cabs and some great dining spots. The Concierge staff was very knowledgable and accomodating. We made extensive use of them and the Hotel Staff.", "title": "Lovely hotel", "helpfulness": 3, "user": "Ghostie", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5966849, "likes": {"liked": "— The location", "disliked": "— Prices charged for coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The rooms were clean, bright (we had a non-smoking room) and had great internet service (a requirement when traveling today). Bathrooms were very clean, fresh, soft towels and great amenities. The restaurant was excellent and we used it for breakfast each day.", "title": "Exactly what we wanted in Paris!!", "helpfulness": 13, "user": "Top-notch-Tastes", "date": "October 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5927316, "likes": {"liked": "— Clean and not too fussy", "disliked": "— larger rooms would have been nice"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Stayed at the Renaissance for 1 night, August 29th on our return trip from a Danube River Cruise. The location is perfect-near many major museums, shops, restaurants, and public transportation. The hotel, while part of the Renaissance chain, is more like a boutique hotel. Great attention has been paid to small details that make you stay even more enjoyable- Down comforters, fluffy pillows, flat screen TV& Bvulgari toiletries. The room (a standard),while small, was beautifully appointed and imaculately clean. A floor to ceiling window opened to the street below,but never was any traffic or pedestrian noise heard. The stafff was very pleasant and extremely helpful. Once we checked in, we were always greeted by name. Did not use the restaurant, but menu was quite expensive. Gorgeous bar at Lobby level. Will definately stay here again-this is our new Paris home!!!!", "title": "Great Hotel with Perfect Location", "helpfulness": 6, "user": "Trip H", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5876124, "likes": {"liked": "— Location, Upscale Boutique feel", "disliked": "— Room size may have been a little larger"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We just returned from a week at the Renaissance Paris Vendome (RPV). There were many highlights--and a few things that could be improved. Even factoring in the problems, we judged the overall quality of our stay as excellent--but, of course, that depends on individual expectations.", "title": "Pleasantly Predictable--with just the right amount of Parisian Charm", "helpfulness": 14, "user": "LossForAName", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5837038}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "A few comments:", "title": "Plaza Vendome (marriot hotel group), Excellent location", "helpfulness": 13, "user": "parny", "date": "September 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5783490, "likes": {"liked": "— Location", "disliked": "— small room, limited view"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "LOCATION, location, location. . .It's hard to get much better than Mont Thabor--a relatively quiet street just off the Rue du Rivoli and extremely accessible to most of the \"must see\" sights in the city. A brief warning: the restaurant and bar across the street can get a bit noisy for the rooms on the street side.", "title": "Where are the facilities ?", "helpfulness": 6, "user": "bdaria", "date": "August 24, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 5705216}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "IT'S A MARRIOTT. . .Which means that you can get a true non-smoking room--something possessed by only 1/2 of the Top 6 hotels in the 1st arrondissement (as reported by the 2006 Michelin Red Guide) . I started sneezing the moment I stepped into DeGaulle Airport from all of the cigarette smoke and was greatly appreciative of a well-ventilated, smoke-free place to sleep. It also means that standard business services (like high speed Internet) are available--although at a price. It also means that you can get Marriott points for the large amounts you are bound to spend (the current exchange rate from $ to euros is miserable). Finally, the clientele is principally American, which may be good or bad, but does mean that the staff speaks excellent English and is used to dealing with American eccentricities and handles them graciously.", "title": "Great Place", "helpfulness": 11, "user": "zulan78", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5636702, "likes": {"liked": "— Service, Cleanliness, Friendliness, Conceirge Help", "disliked": "— Housekeeping interupted sleep a few times even with a do not disturb sign on the door"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This was a wonderful hotel. We had less than two full days in Paris, so I was", "title": "Wonderful hotel.", "user": "dmcintosh", "date": "August 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8366401, "likes": {"liked": "— The comfort and attention to detail.", "disliked": "— Didn't get to stay there long enough!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "really looking for a good hotel. This one was great. I had never been to", "title": "Great Location", "helpfulness": 3, "user": "Cubfanincs", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8116767, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "Perfect Location", "text": "Paris before, and with such a short amount of time, location was important.", "helpfulness": 3, "user": "Kuty", "date": "July 12, 2007", "id": 8107063}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This was right up the street from the Louvre and within walking distance of many", "title": "Nice Hotel, Lovely Staff, Perfect Location", "helpfulness": 2, "user": "jsoxy", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8052429, "likes": {"liked": "— Location", "disliked": "— Small Rooms (not smaller than others in Paris, though)"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "other sites.", "title": "Great hotel -", "helpfulness": 2, "user": "JCLON", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7872426, "likes": {"liked": "— Rooms are very comfortable", "disliked": "— No interesting views from any of the rooms."}}, {"rating": 4.0, "title": "Mixed Feelings", "text": "The Good: the rooms are nice, trendy and upscale, but small. The location is close to Place Vendome, and in a quiet side street so noise is limited. Price for the rooms tend to be very good for what you get - in the 300 Euro range.", "user": "HoustonLawyer", "date": "November 19, 2007", "id": 10927294}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Bad: no hot water in the shower at 1pm on a Saturday afternoon. Sudden hot and cold water surges in the shower at 5am on a Sunday morning.", "title": "A Lovely City Hotel in a Perfect Location!", "helpfulness": 6, "user": "bagsalwayspacked", "date": "November 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10731147, "likes": {"liked": "— Location, location, location", "disliked": "— We wish we could go there more often!"}}, {"rating": 5.0, "title": "Loved it , Excellent service and rooms !!!", "text": "The Ugly: the hotel accidentally gave away our reserved taxi to another guest during the strike, and so my wife and I missed our train", "user": "KJLMexico", "date": "October 1, 2007", "id": 10026261}, {"rating": 5.0, "title": "Loved the Renaissance", "text": "to London. That said, they acknowledged their mistake, and put us up for free that night so we could take the first train in the morning.", "helpfulness": 2, "user": "campbejuSacramento", "date": "September 25, 2007", "id": 10002987}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Overall, lots of plus points, with a few negatives.", "title": "Excellent location BUT .....", "helpfulness": 2, "user": "blacklab", "date": "September 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8717948, "likes": {"liked": "— location", "disliked": "— price/performance ratio very poor"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Fantastic hotel......great service and location. The pool is very stylish and functional.", "title": "Fantastic - one of my favourite hotels!", "user": "JonathanBateman", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12206836, "likes": {"liked": "— Very stylish, great service and location", "disliked": "— Cheaper rooms can be a little tight!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Rooms are exteremely comofortable. Suites are fantastic !", "title": "Splendid room!", "user": "lesmil", "date": "December 19, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 11702567, "likes": {"liked": "— location and friendliness of staff", "disliked": "— Breakfast costs were expensive."}}, {"rating": 4.0, "title": "Great place to stay in the heart of Paris", "text": "Have stayed 4 times now and wouldn't stay anywhere else in Paris. Staff are superb and friendly.", "helpfulness": 3, "user": "Nath&Sian", "date": "December 3, 2007", "id": 11226530}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I can't fault it.", "title": "Housekeeping was the only weak link", "helpfulness": 2, "user": "HVB", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11185875, "likes": {"liked": "— Xavier, the location, the bar, the spa area, the service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I used my Marriott Reward Points and was pleasantly surprised at the quality of the room and friendly staff. I did pay the 60 Euro per night upgrade--but it was well worth it. The bed, towels, accessories, etc were all excellent. The location and the ability to use points made this hotel a real delight. I would returning here because of the pleasant experience. We did not eat the breakfast since it was 29 Euros so I cannot comment on that.", "title": "Peaceful and relaxing", "helpfulness": 3, "user": "pgooden", "date": "November 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11006974, "likes": {"liked": "— Comfortable beds and bathtub", "disliked": "— Expensive restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "I don't speak any French at all, and I was very worried about having a good experience during my visit to Paris. This hotel was perfect - the staff all spoke excellent English, and were very kind about it. The concierge was first-class; she even helped me hunt down a specific Babar book on a Sunday afternoon.", "title": "Excellent hotel", "helpfulness": 2, "user": "Traveler8910", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8592422}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The location is honestly perfect - so close to everything. And the room size was decent for a European hotel - would definitely stay there again!", "title": "renaissance best location", "helpfulness": 2, "user": "PikesvilleTraveler", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8525769, "likes": {"liked": "— location"}}, {"rating": 4.0, "title": "Great little hotel, but snooty service", "text": "although the rooms were somewhat small (not really for europe) this hotel had outstanding service and a fantastic location", "helpfulness": 1, "user": "Muscae", "date": "August 23, 2007", "id": 8474676}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "the people at the front desk, including the concierge and even the doormen, were so nice and helpful", "title": "Great Location", "user": "Mullettlk", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8451936, "likes": {"liked": "— Staff and service", "disliked": "— Even suites are a little compact."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed at the Renaissance Paris Vendome for 2 nights, June 10-12 2007. The hotel is in a perfect location, within easy walking distance to all the great shopping near the place vendome, Louvre, tour buses. We had a prestige, non-smoking room with a king bed. It was small - which I had expected from the previous reviews but was still surprised. We could barely walk around our bed. Also - the toilet was near the door entrance while the sink and shower were on the opposite side of the room- also a bit odd, but worked out okay, I picked the hotel b/c I like modern - and it was very clean and modern. Everyone at the hotel was very friendly and accomodating. Also had high speed internet access which was a must. The breakfast was included in our price (490 euro/night) and was excellent- fresh breads, fresh cut fruits, cheese, meat and they cooked eggs to order. They had USA today and other newspapers delivered each day, the hotel was very quiet. Overall, an excellent hotel which I would stay at again.", "title": "Excellent location, modern hotel", "helpfulness": 1, "user": "ammt", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7869610, "likes": {"liked": "— Location, modern, clean", "disliked": "— Small room"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This trip was a surprise for my partners 40th birthday and unbeknown to her were I was going to ask for her hand in marriage (so I had to have everything just right!!) , But on arrival we were surprised to find that the room that I had paid 1200 euro for a two night stay, had'nt materialised, after waiting nearly 2hrs, several bowls of spicey nuts and two or maybe three drinks we were eventually given a room, not the \"Corner Junior Loft suite\" but one on the 2nd floor which was for another customer, I went back to reception and rec'd a room on the 4th floor, again not the one I had booked, back to reception again, after a good 20 minute conversation, my partner (who's special weekend this was) managed to get them to transfer us to room no 3, which was again not what i had paid for but by this time I had lost the will to live, I just wanted to get out, see the sight and relax.", "title": "get what you book?...", "helpfulness": 2, "user": "Baldie1", "date": "June 6, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 7789939, "likes": {"liked": "— the Bed oooooooh the bed was very nice.", "disliked": "— paying for a far superior room and not getting it on more than occasion,very disappointing!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Upon my return I contacted \"Marriott Customer Services\" regarding my reservation, outlining the fact that I had paid a lot of money for a room that I never received and the double importance of my visit, the reply from Marriott seemed that they did not value 1) my custom + 2) were unable to provide an explanation or an appology as to why I did'nt receive what I had paid for.", "title": "Renaissance Paris Vendome, tres bon!", "helpfulness": 1, "user": "chrisjo06", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7712910, "likes": {"liked": "— Location and comfort", "disliked": "— Price of drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "For a company of Marriott's standing I would have expected a higher level of professionalism and competent customer services.", "title": "Excellent boutique hotel", "helpfulness": 2, "user": "maksis", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7582777}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My wife and I stayed at the Renaissance Paris Vendome for 3 nights to celebrate our wedding anniversary. Having used some of our Marriott Rewards points to pay for the room (we did pay a 60Euros per night surcharge to upgrade to a prestige room, which was worthwhile doing) it is difficult to comment on value for money. That said the staff, especially reception/concierge were welcoming and knowledgeable. Breakfast (included in the rate) was good enough although we chose to eat other meals in restaurants other than the hotel (Bistrot du Paris, Rue de Lille, was excellent and walkable!). Items in the mini bar were way over priced and, like everywhere in Paris, drinks in the bar were very expensive. The room was spacious enough, quiet and relaxing, very comfortable, LCD TV/DVD player, great bed and a perfectly acceptable bathroom. The location of the hotel is fantastic - we walked to e.g. the shopping area(s), Le Louvre, the Eiffel Tower, Tuiliants, St.Germain, etc. Would we stay there again? Definitely.", "title": "Excellent experience @ Renaissance Paris Vendome", "user": "lindy1991", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7564942, "likes": {"liked": "— Staff, location, room comfort"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the Renaissance Paris Vendome for 5 nights, from April 20th-April 25, 2007. We used our Marriott points and upgraded to a premier room for $60.00 per night extra.", "title": "Perfect!!!!!!", "helpfulness": 2, "user": "ccadvice", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7555441, "likes": {"liked": "— The pool!", "disliked": "— No bureau"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is in a perfect location. 2 blocks to the Louve, 1 block to the Tuileries. The room was pleasant, very clean and had windows that opened to the courtyard. The only drawback was that there is no bureau. We used the shelves, but they are a bit shallow.", "title": "I've stayed at the best...and this is better!", "helpfulness": 8, "user": "DCDaveBrad", "date": "May 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7549013, "likes": {"liked": "— Comfort, service, amenties, location", "disliked": "— Shower not fully enclosed"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The bath is lovely, the shower small. I preferred to swim in the beautiful pool and shower in the locker room which is bigger and easier.", "title": "Not worth it", "helpfulness": 2, "user": "TravelWithKids2", "date": "April 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7363439}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We walked everywhere, prob 12 miles each day. Breakfast taken daily at Le Pian (sp?) up two blocks and around the corner. Ther are multiple cafes and restaurands in the Marche area...all wonderful. First dinner was at Cafe Flotte. Fabulous...concierges Davied, Julian and Olivier are top notch.", "title": "Renaissance Paris Vendome -- Absolutely Wonderful", "helpfulness": 5, "user": "FredMacmurray", "date": "April 7, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 7290959, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Ah Paris, our first trip...most beautiful city we have ever seen. A special night at Cafe L'Homme with Paris friends...the Eiffle Tower is 1 block away..right in front of you and the light show begins on the hour at night. Eat on the open patio. I will never forget this fabulous sight, nor will we ever forget Paris....", "title": "Excellent Service and Location! Great Honeymoon spot!", "helpfulness": 7, "user": "jaywong54", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7268611, "likes": {"liked": "— Excellent service and location", "disliked": "— Limited after-hours room service and no concierge"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My husband and I stayed at this hotel in November 2007. We decided to stay here because we could stay using Marriott Reward points. Our reservation was for a \"Prestige Room\" and we were going to pay an extra 60 Euros a night for our seven day stay.", "title": "Loved it!", "helpfulness": 2, "user": "bubbasrb", "date": "January 28, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 13062392, "likes": {"liked": "— location, service at hotel, modern design", "disliked": "— not a lot of public spaces"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Check in was a little slow. We arrived at about 10:30 am hoping to get into our room but we were told it would only be a short wait. We hung around, then decided to go for lunch and a walk around the area. I think we were finally taken to our room at 2pm. Everyone was really nice about it and we were happy with our room.", "title": "Pure Paris Pleasure Jan 14, 2008", "user": "SeatravelerWA", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12827202, "likes": {"liked": "— upscale comfort", "disliked": "— Half shower door"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The rooms are small. Even the \"prestige\" room is smaller than an average US hotel room, so be prepared.", "title": "Fantastic hotel + location", "helpfulness": 2, "user": "Lawz333", "date": "January 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12743682, "likes": {"liked": "— Everything - esp. the location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel was really beautiful, but smaller overall than I expected. There is a great indoor pool near the spa that my husband and I took advantage of one evening. Nice way to relax after a day of walking the city. There is also a steam room and sauna available.", "title": "Great stay, great location!", "user": "imwmn913", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12474003, "likes": {"liked": "— location location location", "disliked": "— bedroom too small to accomodate two large suitcases comfortably"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The hotel location could not be beat. We talked about cancelling our trip due to the transportation strike, but decided to go because we had such a great location. The strike lasted our entire visit, but we walked everywhere.", "title": "Charming Retreat in Paris", "helpfulness": 2, "user": "NVRam123", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12405287, "likes": {"liked": "— very stylish decor", "disliked": "— the view from the room"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 5, "variance": {"poor": 27, "average": 41, "very good": 214, "terrible": 13, "excellent": 398}, "aka": "Renaissance Paris Vendome Hotel Paris", "slim_ranking": 0.0981595092025, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The downtown Renaissance Paris Vendome Hotel is a luxury boutique hotel in the heart of Paris Fashion Distric. Enjoy contemporary luxury and visit Paris and its tourist attractions from our doorstep. The Seine River, the Louvre and Orsay Museums and luxury shopping areas are only minutes away. Take the nearby Paris metro or walk to the magical Champs Elysees. Our boutique hotel features luxury hotel rooms with king-sized beds, luxury bathroom amenities (Bulgari) and broadband internet. Enjoy a Parisian ambiance and modern French cuisine from our world-recognized chef at Pinxo. Rejuvenate in the free fitness gym, indoor swimming pool and sauna. Indulge in a visit to our hotel spa for facial treatments and massages."}