{"user_rating": 4.0, "review_count": 418, "name": "Renaissance Paris Hotel Le Parc Trocadero", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This hotel was situated on a quiet street but very close to fabulous restaurants, the metro, and walking distance to Champs Elysee, Arc d'Triumph, and the Eiffel Tower. We actually walked much farther than that, but it was very easy to jump the metro and get to wherever you want to go. The staff is very kind and the concierge is quite helpful.", "title": "A magic gem on a quiet street near metro stations", "user": "wheretogonext1", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115980820}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is located in the 16th Arrondisment and location to restaurants is excellent. Eiffel Tower is very close by as well as access to various forms of transportation. Great area for walking. The recently redecorated Le Parc Trocadero is lovely. Small attractive interior bar with beautiful, outside oasis setup with conversation areas for cocktails. The redecorated hotel is warm and inviting. Hotels rooms are pricey for their size so having the French courtyard was welcomed. Our room was so small that there was one way traffic in front of the bed! One stepped back if the other needed to get to the other side. I am sure there were larger rooms but I cannot report on them. All in all, we loved the location and the ambiance but were disppointed in room assignment. Gold was of no benefit there. We were not even provided with courtesy water even after they said they would.", "title": "Lovely, beautifully redecorated Marriott Renaissance property.", "helpfulness": 1, "user": "MMADallas", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115932889}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at this hotel twice on our overall trip through France. We had the same great service both times. There are great restaurants near by and a small deli and convenience store a block away. Great location near a metro and neighborhood. Walking distance to major sights. Newly renovated and beautiful.", "title": "Twice as Nice", "user": "cdhannah", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115231138}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "For benefit of providing ease of review, I highlight the key plusses and minuses:", "title": "Beautiful room and location in the heart of Paris. Quiet and tranquil setting despite immediate access to Paris hotspots", "helpfulness": 2, "user": "TravelingAllCreation", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115217237}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Plusses: 1] Very accessible to key Parisian sites. I love to walk, and getting to the Louvre, Eiffel Tower, Notre Dame, and Champs-Elysse was definitely within walking distance if you have the time (you really explore the city that way). If time is of the essence, no problem because a subway stop is only a couple blocks away and can take you directly to those places.", "title": "Nice hotel, great service", "user": "Pinkpapuga", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115114284}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Booked this on marriott points and it was the only place I could get at the last minute. turns out to have been a lucky break. I really liked this hotel. It was small, very well located (only 10 minutes stroll to the Trocadero), next to a metro that went all the places we wanted to go to but was also quiet and in a 'real' part of paris.", "title": "I was very impressed with this hotel", "helpfulness": 1, "user": "thefrequenttraveller", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115096436}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "On top of that, this hotel had the best breakfast I have ever had in a Marriott (and as a platinum member - I tend to see a few!). Drinks can be a bit pricy (but so was everywhere else we went in Paris), but the courtyard in the summer was a pretty nice place to have a pre-dinner drink.", "title": "Our home away from home in Paris", "helpfulness": 1, "user": "retiredtravelwriter", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114919505}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "I've only given 4 or 5 hotels 5 stars and I stay in hotels every week. I will go back to this one when next in Paris.", "title": "A top notch hotel in a great location", "user": "Jonmac55", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114699896}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The location is elegant and central, the hotel is delightful and the staff are friendly and helpful. We stay here every year and the biggest 'feelgood' attraction is the courtyard garden restaurant. Not too fancy, but a marvelous place to talk and relax. Rooms are excellent and the service consistently first class also.", "title": "Lovely hotel in a great location!", "user": "Kathykoer", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113761225}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "- Retired travel writer -", "title": "Great Location, Excellent Service", "helpfulness": 2, "user": "w0rldtravelfan", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113424233}, {"rating": 4.0, "title": "Good location but not for business.", "text": "The hotel is absolutely fine, the staff were all helpful and the rooms was a good size and very comfortable. However, as a place to hold a business meeting for around 12 people it wasn't one I'd recommend. The neighbourhood is first rate, but the room rates reflect that to the point that I winced when handing over the company credit card! The bar and restaurant facilities are pretty limited and lunch was not great. All in all, I would always prefer the Rebaissance Arc de Triumph which is not so far away and a better place to meet.", "user": "Out_to_lunch_10", "date": "October 26, 2012", "id": 143746410}, {"rating": 4.0, "title": "Second time is just as good", "text": "This is my second stay here, for work - I also stayed here early this year, also for work. I know people like hotel chains for consistency of quality (although I tend to like the little homey places), but what I can say for this is that I liked it quite a lot last time, and it has only gotten better. This time, the prices were crazy high, and if it wasn't for work and the arrangements being made for me and the great location, I'm not sure I'd stay here because of the expense. But since I did, if you can afford it - I felt very well taken care of here.", "user": "philsdottir", "date": "October 21, 2012", "id": 143402602}, {"rating": 5.0, "title": "Beautiful Boutique Hotel", "text": "Reception/check in - I thought they were super nice. I came in on that 6 am flight someone mentioned, and I had no expectation that my room would be ready - but I did have hope (when I came in early in February my room was ready for me!). It wasn't ready, but they were so, so nice about it. They gave me free breakfast that morning, and also a free day of internet. So I ate breakfast and played online for a couple of hours, and watched thousands running the 20k race right down Raymond Poincare, and then at 10:30 my room was ready. They were really apologetic, but they had no reason to be at all, I was very very grateful and glad that they make getting people into their rooms before the check in time a priority. Later, after I did get my room, they came by with a note from the Director of the hotel, a yummy chocolate thing, and a small bottle of house-distilled gin. And I'm not special - they did the same for my colleagues. The concierges I'd say are a mixed lot. A couple of them were great. One day I ventured out to the flea market at Clingnancourt and the bellman cautioned me to be very careful on the metro and at the market about pickpockets. (Absolutely justifiable warning, though I take the metro and go to Clingnancourt regularly, so I wasn't worried.) This is what I mean about feeling like they are taking care of you.", "user": "RonP11971", "date": "October 18, 2012", "id": 143133871}, {"rating": 4.0, "title": "Great location, great staff, nice but small room.", "text": "Room - A number of people have made comments about room size. It's Paris. Rooms are always tiny. I've stayed in probably 30 hotels in Paris in the past 10 years or so and rooms are always small. So let's just stipulate this and move on. I was in the main building and overlooked the courtyard. I didn't have any problems with hearing any noise outside my own room. I felt the housekeeping service was really good. Loved loved loved my big fluffy bed with its big fluffy pillows and crisp sheets and duvet. One day I had the DND tag on the door because I didn't think I needed cleaning every day - I don't clean my own home every day - and that evening Housekeeping called me and asked if I didn't want my room cleaned, they were here at any time whenever I wanted to have it cleaned, any time. It was super nice! My room was smaller this time than last, but I didn't feel claustrophobic or anything. It had all the same amenities as last time - tea tray, Evian bottle daily, slippers and robes, a safe and minibar with space for your own sodas (bahind a cabinet), a flat screen TV with a multitude of channels, bath amenities including conditioner, lotion, shampoo and shower gel - and bath salts! - big closet with lots of hangers. The water pressure was always good and the hot water was super hot - hardly needed any for a nice warm shower. I didn't get the room service this time either, so I can't speak to this.", "user": "Deckwalker", "date": "October 10, 2012", "id": 142514447}, {"rating": 3.0, "title": "It's okay, but there were some issues.", "text": "Amenities - This time I did get to spend a very little bit of time in the outside courtyard area, where you can get drinks and relax on lounges and chairs. It was really nice. I didn't spend any time at the gym this time. I'm still annoyed by the ridiculous internet charges - 100 euros for the week, 20 for 24 hours, 7 for one hour. There's really no reason to charge this, especially when they are so willing to comp a day of internet for any issues you have.", "user": "david_k001", "date": "October 5, 2012", "id": 142062315}, {"rating": 5.0, "title": "MAGNIFIQUE!", "text": "My wonderful (& spontaneous) Boyfriend surprised me with a whirlwind, last-minute trip to Paris Dec 29-31 and selected the Renaissance Hotel Le Parc because of its prime location, which is a quick, 3 block walk to the Eiffel Tower... and it was PERFECT!", "user": "Lia S", "date": "January 4, 2013", "id": 148820430}, {"rating": 1.0, "title": "Trashy Room and Rude Housekeeper", "text": "The Renaissance is one of Marriott's 'Boutique' Hotels with just over 100 rooms which are modernly decorated and immaculate. Our check-in was friendly & prompt and we were invited to enjoy their delicious buffet-breakfast while our room was being prepared for us. The staff in the restaurant was friendly and attentive and the variety of food, both Hot & Cold, was outstanding and consistent each and every morning.", "user": "canyanyday", "date": "December 22, 2012", "id": 147926797}, {"rating": 4.0, "title": "Straddling Two Worlds", "text": "Our room (360 which over-looked the courtyard) was ready when promised and had a huge King-sized bed (that was incredibly comfortable!), a flat-screened TV, tasteful Marble bathroom with a deep tub and plenty of HOT water and excellent water pressure with every use. The ONLY issue Joe & I had was the shower didn't have a 'door' but rather a single 3-ft piece of glass which made no sense and left the floor soaking despite our best attempts to put towels down.", "user": "jay r", "date": "November 30, 2012", "id": 146490036}, {"rating": 5.0, "title": "Elegant and comfortable", "text": "But the BEST thing about this Hotel is its location! Out the front door, take a right, walk 3 blocks and you are at Trocadero in front of the Eiffel Tower! The Metro Station is there for easy access to the rest of the City but Joe & I decided to see the City by Bus and got on the Les Cars Rouges (The Red Double-Decker Buses) and LOVED IT! For 27 Euros you get an all-day pass that takes you on an audio tour of the major attractions and you can get on & off as you please. Buses every 6-10 minutes and we were able to cover a LOT of ground and take our time at each which was awesome! For an additional 6 Euros, you can get a Cruise Pass to go on a boat ride on the Seine which we did later that evening. The hour-long cruise was just ok. Long line, long wait time, and the boat was full.. plus it was COLD! So take or leave the upgrade.. but definitely do the bus!", "user": "Karyn T", "date": "November 27, 2012", "id": 146336007}, {"rating": 5.0, "title": "Highly recommended", "text": "Some recommendations if you are planning on travelling to Paris:", "user": "Wali65", "date": "November 27, 2012", "id": 146280940}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This Hotel is a very nice safe location easy walk to the Arc or Eiffel Tower. It is in the Embassy district always safe and clean. The Metro Stop at Victor Hugo is 1/2 a block away. This is a VERY EXPENSIVE area. 4 nights here cost us $900+ with out breakfast. today the last morning we had the complete breakfast at $75 a couple. Lovely meal but $75 ?", "title": "Nice Hotel but bring your checkbook", "helpfulness": 2, "user": "mangom", "date": "September 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117850590}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Paris is a great city but in the tourist areas the waiters and cab drivers are ruthless in their lack of honesty. Cabs never have change and waiters always insist on a tip even when the service is included.", "title": "Beautiful Hotel, Wonderful neighborhood", "user": "NHM1991", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117762719}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Our guide sent us to Les banquettes near the Bastile. The owner and his staff were pleasant , polite and generous in their effort to provide us with expert guidance , excellent service and an exceptional meal.", "title": "More like a 4 star hotel", "helpfulness": 1, "user": "cmleesa", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 117475366}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We used the Metro every day. One day we squeezed into a car on line 1 at rush hour, a pickpocket robbed my wife and tried to rob me, but by a miracle the wallet was dropped and returned by a young boy to us. Unheard of in Paris that a pickpocket will get your wallet and you ever get it back.", "title": "Nice Hotel, Pricey Breakfast", "helpfulness": 1, "user": "Italytravelgirl77382", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117246612}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "IN THE METRO BE VERY CAREFULL, the CITY is OVER RUN with Eastern European Thieves. Money belt, nothing in your pockets, and NEVER LET ANYONE INTO YOUR PERSONAL SPACE ON THE METRO.", "title": "Wonderful hotel and great location", "helpfulness": 1, "user": "airportbabe", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116740066}, {"rating": 4.0, "title": "Comfortable fairly standard hotel with pleasant bar and some quirky rooms", "text": "This is a hotel I use regularly when visiting our offices in Paris. Reasonably close (5 mins walk) to the Arc de Triomphe. It has changed hands over the years from Sofitel to Marriot Renaissance and in the process has had the bedrooms and public areas upgraded. The building is unsual with various levels and shapes. There is a separate building annex which I avoid as this involves walking outside which when it rains is annoying. The rooms are every shape and size. Three of them are duplex with bedroom mezannine and living room on lower layer. Some of them are small. Some are much larger. I never book anything other than a basic room and often end up in a larger room. Breakfast is excellent wityhj a variet of fruits, pastry and hot food. Service is friendly and responsive. Bar is comfortable and business-like rather than social.", "user": "Kevin M", "date": "November 9, 2012", "id": 144992250}, {"rating": 5.0, "title": "Great Location and Great Staff", "text": "My wife and I stayed there for one week in October and again for another four days when we returned to Paris. If we were ever to return to Paris, this would be the hotel we would choose.", "user": "ackvil", "date": "November 2, 2012", "id": 144329201}, {"rating": 5.0, "title": "Perfect place to stay in Paris", "text": "First, the staff is first rate. We arrived in the a.m. after a long flight. Sonia, the person at the check in, offered to give us an immediate room or if we wished to wait until the maids arrived she would upgrade us to a better room. We chose the upgrade and Sonia offered us a free breakfast for waiting! All of the staff go out of their way to be helpfull.", "user": "jaj828", "date": "October 30, 2012", "id": 144089692}, {"rating": 5.0, "title": "excellent", "text": "The rooms are well a furnished and very comfortable. The rooms are all clean and fully furnished with all the necessities.", "user": "McGee_7", "date": "October 28, 2012", "id": 143954710}, {"rating": 5.0, "title": "Centrally Located", "text": "The location is excellent. Close to the Eiffel Tower and the Metro.", "user": "mbzray", "date": "October 28, 2012", "id": 143946673}, {"rating": 5.0, "title": "Lovely Parisian Neighborhood Experience", "text": "My husband and I recently stayed here for 5 nights using Marriott points. We've been to Paris many times and chose this hotel because we had never stayed in this neighborhood, and it looked charming. Would definitely stay here again. Our room, which faced the courtyard, was quiet and attractive, and the bed was incredibly comfortable. The staff was wonderful - couldn't have been nicer and more helpful. The location is a bit removed from some of the tourist sites, but you have the advantage of being in a real Parisian neighborhood. My only complaint was that wifi was very expensive. Breakfast was not included with our room, but this turned out to be an advantage as we discovered a nearby boulangerie/cafe with some of the best croissants we've ever had (Boulangerie Bechu - 118 Avenue Victor Hugo).", "user": "GourmetGirlNYC", "date": "November 24, 2012", "id": 146088312}, {"rating": 4.0, "title": "Fantastic Location - Wonderful Staff", "text": "Recently spent 5 days at this hotel. Fantastic location, 15 minute walk to the Eiffel Tower and 15 minute walk to the Champs-Elysees/Arc de Triomphe. Metro, restaurants all in easy walking distance. Concierge was extremely helpful with recommendations. Rooms were large and clean. Would definitely stay again.", "user": "Charlotte R", "date": "November 22, 2012", "id": 145960995}, {"rating": 5.0, "title": "THE best Marriott property I have ever stayed at. A gem!", "text": "I booked this hotel using all my marriott points (6 nights, 200,000 points). I have been a Marriott guy since 1999 and have stayed at many of their upscale properties (and some small Fairfield Inns in the middle of nowhere). When I was deciding to go to Paris, it was between this hotel and a few others. I had stayed in the Trocadero area before at another hotel chain and loved the area for its neighborhood feel. I dismissed the Champs Elysse and Arc de Triomphe hotels as they were in touristy areas and would be loud. Walking past the Champs Elysse hotel during my last visit, I noticed how busy everything around it was. So, I looked at this hotel and the Vendrome location. The 'boutique' word used in so many reviews made me think 'small rooms' so I opted for the Trocadero Rennaissance location. From the minute we arrived we were treated like special guests. All the staff was very friendly. The hotel itself is quiet and upscale but close enough to the action. Its a 5 minute walk to the Victor Hugo Metro stop and a 5 to 7 minute walk to the Trocadero Metro stop and an awesome view of the Effiel Tower. There are many little bistros along the way and a small grocer within a block. There is a bigger grocery store near the Victor Hugo metro station. We stayed in the annex of the hotel which required us to walk through the amazing courtyard every day. If it was warmer out, we woulod have bought a bottle of wine and relaxed there.The room was big for European standards, so was the bathroom. A lot of detail went into the room. The room had a fridge, safe, nice TV with one or two English news stations, and robes.Turndown service leaves mini Tolberones! Since I was a Gold Level Marriott person, we got free breakfast and internet. The breakfast would have been about $80 US for two of us! The food was great and so was the service. Lots to choose from. Ask for the hot chocolate if there in the winter. this was my 3rd visit to Paris and second stay at a Marriott property (La Defense was my first stay. Too far away from everything, small rooms). I cannot recommend this hotel enough. Now if I was spending my own cash, it would be different but if you are deciding to book a Marriott property in Paris, this one should be at the top of your list!", "user": "TMSTZ12", "date": "November 15, 2012", "id": 145460199}, {"rating": 4.0, "title": "Solid stay at a Marriott property", "text": "You cant really go wrong with a Renaissance or a Marriott. Rooms were extremely clean and the staff was very helpful and friendly. Its a bit of a walk to some of Paris' main attractions, but the metro is a few blocks away and makes it pretty easy to get around. Rooms were large and cleaned on time every day. We used points to book our stay and didnt have any problems.", "user": "smittydhc", "date": "November 13, 2012", "id": 145357378}, {"rating": 4.0, "title": "Paris hotel", "text": "Great place to stay in Paris. We got the port hole window....had a view of the Eiffel Tower ...just the top as there is a height limit on buildings of seven stories. Still fun when it sparkled ...just a perk as a five minute stroll had you at the Trocadero where you could watch the light show in all its glory. The staff were wonderful. Very helpful with dinner reservations, cabs. Room was small as are most in Europe but had everything needed for a great stay. The only thing keeping this from five stars was the shower...a odd layout but a minor issue. The location could not have been better..close to two metro lines...not far from the RER c line to get to Versailles.", "user": "Marky713", "date": "November 12, 2012", "id": 145247746}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This is my first review on trip advisor. I just want to say I spent two wonderful nights at this hotel. I did use my points built up from business travels. I had a wonderful room that was HUGE compared to any other hotel I have stayed in Europe. I had a king size bed along with a sitting area. The concierge was very helpful getting me places to see/eat. This may have been because I am a Platinum member (things that make you go hmmmm since this is a high end hotel.) Everyone should be treated the same (just saying). I did receive free breakfast which was 27 euro without the comp. which I personally think is expensive. Also internet was expensive (~20 euros) when I have been to less expensive hotels that give wireless internet for FREE not because you are a Platinum member!! The hotel is well decorated. I didn't have a courtyard view as my room was #312 it was good for me since I spent so little time in the room. Overall the location being near the Trocadero metro stop, and short walk to the Eiffel tower I would def. come back and stay here again.", "title": "Loved It!!", "helpfulness": 2, "user": "VCGadventures", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116551471}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed here as a family for 2 nights. The hotel is newly renovated and our room was lovely! It was a room that you would see in decorating magazines! Beautiful large king bed. All necessary amenities in the room. We had a lovely view of the courtyard. Courtyard is beautiful and quiet - a perfect place to relax, and such a rarity in Parisian hotels! Our room had power converter already so you don't need to bring your own. Breakfast was delicious! Pricey at 29 euros for a full buffet, but as a Gold member we got this for free. Pastries, breads, fruits, cereals, meats, eggs, coffees and speciality teas. Also, this hotel is in a very nice area (in the 16th arrondisement). Close to metro and quick walk to the most stunning view of the Eiffel Tower. Quiet, clean and safe area and hotel. Wished we could stay longer!!", "title": "Perfect quiet and beautiful hotel in a safe area!", "helpfulness": 1, "user": "straveladdict", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116305378}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Had booked a king and a double room preferably connecting if possible. We were given a disabled room on one floor with and the children were on another floor in the double. Asked if this could be changed and was told this was not possible. Disabled room was old and did not have hairdryer or coffee maker.", "title": "Not worth the money", "helpfulness": 1, "user": "Angela60745", "date": "August 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 116230256}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "No atmosphere or character to this hotel. Wanted just a coffee in the morning could not get this without having to have breakfast, limited facilities.", "title": "Cosy modernized stylish hotel", "helpfulness": 1, "user": "Aburel", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116018576}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Convenient location, near Victor Hugo square and metro station, the hotel has a very modern but cosy look nowadays. Elegant, decent, clean and very comfortable. It has feb buildings around a nice comfy garden where you can relax after a long day in Paris. Breakfast was included, enough choices, presented in small quantities but sufficient and always available. If weather permits the nice gardens makes the croissant more tastefully. Rooms are ok for Paris and very comfortable. Nice surroundings and pleasant for both business and leisure.", "title": "Save your money, but ok hotel to use with points", "helpfulness": 2, "user": "wife2reporter", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 1.0, "service": 2.0}, "id": 115994334}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 5, "variance": {"poor": 18, "average": 47, "very good": 145, "terrible": 9, "excellent": 199}, "aka": "Renaissance Paris", "slim_ranking": 0.131065253765, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Reopened April 2011, this five-star hotel in Paris, underwent a complete renovation. Discover a blend of luxury, charm, class and innovation of which only our hotel knows the secret. A historic treasure in one of Europe's most charming cities, the Renaissance Paris Hotel Le Parc Trocadero is located near the Champs-Elysees and Eiffel Tower. This Paris hotel’s 122 elegant guest rooms and suites boast flat-panel TVs, Internet access and plush bedding. Enjoy simple and tasty cuisine at our signature restaurant Le Relais du Parc."}