{"user_rating": 3.5, "review_count": 1173, "name": "Renaissance London Heathrow Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We decided to stay near the airport since we were only in London for 2 days and we had a shuttle arranged to take us to the cruise port in Harwich. The hotel location was great since we took the 285 bus from Terminal 1 to the hotel for free. There are other buses that go to the hotel for free 105,111,140, 555, 556, 557 but we always seemed to catch the 285. The Hotel Hoppa bus does stop at this hotel also but the charge is $4 pounds each way. The Hotel Hoppa bus does pull right into the hotel parking lot making it a bit easier with luggage.", "title": "Great hotel near the airport", "helpfulness": 1, "user": "CCCLady", "date": "October 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83062300}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The hotel does look old from the outside but the lobby looked newly remodeled. Check-in was a breeze. We actually checked into the hotel at 12 noon with no additional charge. I booked the hotel 1 year ahead and I was able to get AAA rate of $80 pounds a night.", "title": "Not up to par", "user": "WorldTraveller550", "date": "October 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 82673014}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The room was nice and clean but extremely small. The bed was comfortable. The bathroom was small and the shower was tricky to turn on without being burned by the hot water. The tub needed to be refinished. There was a safe in the closet which is definite plus.", "title": "Brilliant view from our room!", "user": "ThomasJonathan", "date": "October 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 1.0, "location": 4.0}, "id": 82476178}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We did not use restaurant in the hotel. The breakfast buffet was expensive. There is a McDonalds across the street from the hotel which came in handy for a quick breakfast.", "title": "If you want to eat at your hotel, don't bother staying here.", "user": "azmomsy", "date": "October 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 81988683}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We did not use the internet connection either but McDonalds does offer free WI-FI.", "title": "Does what it says on the tin!!", "helpfulness": 1, "user": "MrandMrsTrain", "date": "September 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 81629250}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This was my first experience at a \"Renaissance\" Hotel... we're mostly Marriott stayers and this is now part of the Marriott Group. The Taxi driver and I Had some trouble locating the Hotel as the only sign says Renaissance and I was looking for the Marriott logo. No one at door to help with luggage and had some problems with handicapped wife, wheelchair and our luggage getting inside but Reception was very helpful. (I will say Senior Management called later and apologized for lack of people on front). THIS HOTEL IS HUGE !!! I mean you could use watering stations finding your room... that's just a joke folks, but the corridors are L O N G ! Room average size, little difficult with wheelchair and luggage but we stored wheelchair in closet. Bath is nice - clean and easy in/out. Room very clean as was entire hotel. We had some friends from London stop by for drinks and the Bar/lounge staff were very, very helpful. (Probably have name spelled wrong here but Janecka (from Poland and new) and Sami were extremely helpful) . During our stay there was a large Indian wedding in one of the conference areas and it was amazing to see all the beautifully dressed men and women in their formal attire. We Americans in our docksiders and shorts looked out of place. The Executive Lounge is so-so. Rather small and can easily get loud (with Americans !) . One funny story was of a father and son sitting at the window watching the planes. They were sitting there when we went for a drink at 4p and still there at 10p when we came back. I thought what a bad father to make his son sit while dad does business on the phone BUT come to find out, the boy wants to be a pilot, has every imaginable radio equipment to listen to airplanes and was very happy sitting there listening to the coming and going of Heathrow. Dad wanted to do something else :-) .. EASY access to and from Heathrow... there is a pay bus but we used a Taxi because of our equipment (10 GBP o/w) ... overall a nice first time experience with this chain.", "title": "HUGE... but very comfy", "user": "HH922", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139142559}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "One of several visits in the last couple of months; staff are polite and well meaning, however the hotel is still showing its age. I had to wait 20 minutes before my room was ready, but otherwise no real complaints", "title": "Showing its age, but the staff mean well", "user": "AksaiOiler", "date": "August 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 138986054}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I've stumbled across trip advisor purely by accident and found it a very usefull tool in the last week!!", "title": "Very impressed!!Will be making this a regular stop over.", "helpfulness": 1, "user": "Paneldave", "date": "August 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138879341}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We arrived at the renaissance hotel at heathrow after a rather disappointing episode at the copthorne slough which was coupled with 2 days for us at Legoland Windsor, without getting into any further details it was awful and on entering the lobby at the renaissance we thought we'd won the jackpot!!", "title": "Tired and just about works", "user": "RichardU71", "date": "August 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 138786003}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "From the first moment we were greeted with smiles, curtecy and efficiency as we we checked in and given a rather special suite being the 1 the 2006 Olympic torch stayed in overnight whilst transferring on a flight the next day, suite 3208 is a 1 bedroom unit that has fantastic aviation views and the best quiet glazing you could imagine having 100 ton jumbos hurtling down the runway 100 yards in front of us.", "title": "Average", "helpfulness": 1, "user": "Martin D", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138586055}, {"rating": 3.0, "title": "A fantastic hotel spoilt by one man!", "text": "The review for the Renaissance would have been excellent. Outstanding welcome from Stephanie on reception. Honestly, it is rare to find someone so friendly, or engaging, on hotel reception. She took the time to explain what was included in our room rate. Room rate was good considering how much Jury's Inn wanted.", "user": "mikey777icc", "date": "April 3, 2012", "id": 127172365}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Great runway view, which is what we wanted. Such a nice day we sat outside. However, £26 for a gin and tonic and vodka and tonic is a rip off. This is one reason we have the reputation for Rip off Britain.", "title": "Lose the plastic sheets & it would be 4 stars!", "user": "Robh9999", "date": "March 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 127041550}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We enjoyed our experience at the Renaissance thoroughly until it came to check out. We did this via the tv screen in our room. Paid for car parking at the automated machine. Personally, I think guests should be allowed free parking in hotels. Machine accepted payment for parking. However, when we got to the barrier it would not allow us out. There followed a long exchange via intercom until, what can only be described as a rude man came and told us we had not paid after examining the ticket. This was an instance whe the customer is never right. Despite the machine accepting payment on our card. We ended up having to back to reception to resolve the issue, who thankfully waived the charge.", "title": "A very pleasant experiance", "user": "David w", "date": "March 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 126956259}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "It was a very disappointing end to what was otherwise a very pleasant stay.", "title": "Need a facelift", "user": "SwissMarky", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 126894117}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I stayed here for 3 nights in March for a conference. The obvious comment is that this is an airport hotel, so the atmosphere is very much as you would expect - an awful lot of coming & going!", "title": "Excellent value", "user": "MsZ", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126721589}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed here when British Airways put me up overnight after bumping me off a flight. I would not have picked this hotel for myself under normal circumstances.", "title": "Hair everywhere", "user": "ecoast5", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 138578482}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The room itself was large, but had an outdated feel. The main complaint I have was that I found other people's hair all over the bedspread, the towels in the bathroom, near the sink and all over the shower. If someone had bothered to do a careful, thorough cleaning I would have slept a lot better.", "title": "Excellent Runway Views", "helpfulness": 1, "user": "Dutchy69", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138556867}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I was pleased with the front desk staff who helped me with transport back to the airport the following day, and granted me free wireless internet for 3 hours.", "title": "Hot Hot Hot", "user": "Emma G", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 138428627}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We booked this hotel because we found it to be reasonably priced and offered excellent position for getting to the airport for our early morning flight.", "title": "Room a little small, but food out of this world!", "user": "Fizzy42", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138415229}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We weren't expecting it to have rooms that look out onto the runway. I was like a big kid the minute we got to our room I ran to the enormous triple glazed window and starred out of it for a good half hour, taking pictures etc.", "title": "Be careful with brutally high add-on pricing", "helpfulness": 1, "user": "Alfonso F", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 138207977}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "If one is staying at Heathrow, it's almost certainly for convenience rather than pleasure. Of the three Heathrow aiports I've stayed at, this was by far the best (not that the competition was exactly tough). The rooms are very comfortable. I didn't eat there -- the food seemed very overpriced for what it was, and the dining area/bar a plasticated open-concept wasteland filled with bored looking business travellers. The penalty I paid for that was having to eat at the Macdonald's across the road, seemingly the only alternative on this arid strip of airport perimeter concrete. But what I wanted was the smoke-free room I'd booked handed over to me without preliminary hassle and a comfortable night's rest, which is exactly what I got. It struck me that it was a little odd that one had to pay for the shuttle to the terminal, but perhaps that's standard at Heathrow -- the shuttle seemed to be a distinct operation, not run by the hotel itself.", "title": "One of the best at Heathrow", "helpfulness": 1, "user": "Traveller1000Ottawa", "date": "September 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81617871}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The kindest thing I can say about this hotel is that it is 'dated'. The decor is out of date, but not stylish, just old and getting tatty, the room fittings are old and tired, the room I had was small and cramped, with about 20% of the available free space taken up by the huge CRT TV in a cabinet. No mini-bar and public areas not very appealing.", "title": "Won't stay there again.", "user": "Mike340", "date": "September 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 81526654}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I was given a runway view room and that was the redeeming feature, but the windows don't open and whilst I can understand why, it makes the room stifling and claustrophobic. The bath and water pressure were good but no frills.", "title": "Dated", "user": "LinBar999", "date": "September 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 80797504}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The staff try hard but are overwhelmed by flight crews coming and going.", "title": "Close to the airport, good for early flight", "user": "nldogbert", "date": "August 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 77703121}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The price of internet access is a scandal, £15/day.", "title": "avoid resturant especially buffet", "user": "nantlais", "date": "August 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 75197675}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Two adults and one 12 year old shared a room here. The room was very cramped and smelled of drains. As we had three hours to kill before bed we were looking forward to a nice pre-holiday dinner. The posh restaurant was empty and very expensive. We opted for the bar/lounge with big screen TV. A steak sandwich, a plate of nachos and a small plate of humous (all very tasty) and a bottle of their cheapest red came to - wait for it - £70.00!!!!!!!!! How can that be? Three snacks! Our room and parking were only £66.00!!! Beware. Bring a picnic. There are no restaurants nearby and we shouldn't pay these sorts of bills without complaining. How dare they get away with this highway robbery? It's amazing tourists still come to London. Five people ate far too much gorgeous Italian food north of Miami for the same price!!! Complain! Perhaps they will lower their prices.", "title": "Beware Hungry Travellers", "helpfulness": 8, "user": "Patty15", "date": "February 21, 2006", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4476657}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Spent a couple of nights at the renaissance. Staff seemed very friendly, no real problems except the room smelt like there was a dead dog under the bed. Nice hotel overall but very expensive.", "title": "What a smell", "helpfulness": 2, "user": "Teacake_Taster", "date": "May 18, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 5180003}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "After reading some of the previous reviews we selected a strategy to make best use of this hotel. I got a one night stay and 15 days parking for £89, how daft is it that you cannot book the parking through Marriott themselves?", "title": "Good Airport Access", "helpfulness": 7, "user": "autoholic", "date": "April 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5009323}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Anyway, we were directed to our room, got a runway view after requesting it at reception, and dumped our bags in the very spacious and comfortable room. We headed off for some dinner but as I'd read the review of the food prices we decided to head for the airport. And no we did not use the Hoppa bus but a London Transport bus that took us the one stop to Heathrow Bus Station, just a short walk from all Terminals - and yes it was free!! We dined at the airports Cafe Rouge, great food and service, then jumped on a bus heading up Bath Road one stop back - yes still free.", "title": "Good for plane spotting", "helpfulness": 3, "user": "nicola_1717", "date": "April 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5003779}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "As we had an early flight we didn't bother with breakfast or room service and instead hailed our favourtive bus service to take us on our way - still free. On our return, via the free London Transport bus (are you getting the message yet?) we found our car safe and sound in the car park. Nice one Renaissance, great room, excellent service, we'll be back.", "title": "spent one night due to missed connection -free from British air", "helpfulness": 6, "user": "ronadebra", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 4.0, "service": 3.0}, "id": 4741758}, {"rating": 2.0, "title": "Not what it seems", "text": "Oh and we saved £24 by not using the Hoppa Bus and London Transport arrive every couple of minutes.", "helpfulness": 2, "user": "Donalyn", "date": "February 26, 2006", "id": 4521451}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The worst part about our stay was the poor level of hospitality. First I'll say something good about the hotel - the food in the restaurant was incredible! It was a HUGE buffet, and much of the food was gourmet quality. If you are going to a hotel SOLEY for the food, you would have a hard time finding better. And don't get me wrong, the hotel was beautful. But other than that, we did NOT enjoy our experience here. The shower handle came off in the bathroom when my sister was trying to turn it on. The TV's were older, and it was difficult to turn them on - you had to make sure the silver button ON the face of the TV was pressed in before the remote would work. The Wi-Fi and computer center prices were EXORBITANT - 1 POUND FOR 10 MINUTES!!! And the price didn't go down very much if you bought more minutes. We called downstairs to see if they had a corkscrew, and they said it would cost us FIVE POUNDS to bring it up. So, my sister asked if we could come downstairs to use one, but the woman at the front desk would never give her a straight answer. The front desk woman was not exactly rude, but she was not friendly or helpful, and she definitely did not understand the meaning of hospitality. The only people in the hotel who understood the meaning of hospitality were the non-British employees (i.e. the Indians). The room rate was 309 pounds per night, which is roughly $510.00 US dollars per night. If the airline had not paid for this hotel because their delay caused us to miss our connection, I would have been PHYSICALLY ILL that I paid so much for such shoddy service and broken/poor accomodations. If you have the means to spend $510.00 per night, YOU SHOULD FIND A BETTER HOTEL THAN THIS ONE!!! (Unless of course you want to spend $510.00+ per night just for the food.)", "title": "Sadly disappointing for a 4-star, first class hotel", "user": "Rachel S", "date": "April 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 128047580}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed here for business at the end of March/beginning of April. Although I wouldn't use this hotel for a weekend away in London for sightseeing/show etc I would come back for airport transfer or business. My room had a huge bed with loads of pillows and the room was clean. TV did not work very well but used radio mainly. The gym was small but had everything you would need for a mini workout. Check in and out was very efficient. Food was good hotel standard but ours was a pre ordered menu for our conference. Would recommend the vegetarian lasagne! I liked being able to sit outside and watch the planes come in and take off. Surprisingly, after doing this and listening to the noise, you would not know you were staying in a hotel right next to the runway, it is very well soundproofed. The only negative thing I would say is the hotel could do with a bit of updating and in some areas it has an \"old carpet\" type smell. Would I recommend it? Yes for airport transfers or a conference venue.", "title": "Good For Heathrow", "user": "Woo48", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127789762}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our British Airways flight was cancelled. Though the attendant at the check-in desk was reluctant to arrange a room for us, the manager readily agreed and therefore we had a place to rest till our rescheduled flight the next morning. Fortunately this hotel was just 15 minutes from the airport so we caught the bus from the hotel entrance at 6:55 and were at the check-in counter by 7:15. Since we were still jet-lagged and on India time we had no problem getting up and having breakfast when the buffet opened at 6:00 am.", "title": "Luxury, friendly service", "user": "lsaravinda", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127776416}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rooms were clean and comfortable. They were small, but enough for our needs. Staff were all quite warm and friendly. Dinner buffet was very good - vegetarian options were limited but we got enough to eat - lentil salad, soup and green salad were all quite good. One member of our family has several food allergies and the chef kindly prepared special dairy-free pasta for him.", "title": "pleasantly surprised!", "user": "aysuaysu", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127680047}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Considering the overall luxury level of the hotel, I would have expected better quality bread at the breakfast buffet. It also took us quite a bit of effort to find out if the cheese contained animal rennet (it did). Apart from these minor disappointments, it was a fine place to stay while waiting for a flight.", "title": "If you like planes get a runway facing room -fab views!", "user": "ScottieKent_", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127618432}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Stay here frequently on arrival and the night before departure. Rooms are compact but comfortable and immaculate in cleanness. As its an airport hotel there is high room turnover so good early check in availability for flights arriving in the early morning. The club lounge is open weekends and has a great food selection.", "title": "Convenient to LHR", "helpfulness": 1, "user": "Jeff E", "date": "September 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 139825100}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Very nice place", "title": "Nice, but don't dine there", "helpfulness": 1, "user": "kobibi", "date": "September 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 139647944}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Clean rooms, comfy beds (:", "title": "More than meets the eye", "helpfulness": 1, "user": "CCC_wanderlust", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139522696}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Terrible food, eat lauch and dinner, both horrible (:", "title": "perfect hotel", "user": "gibraltar2121", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139479058}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "A good place to stay (:, shuttles to the hotel arrive regularly every half an hour...", "title": "awful. should be ashamed to have the Renaissance label", "helpfulness": 3, "user": "raverusa", "date": "September 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 139413414}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed at this hotel for 1 night before an early morning flight. We booked this via Holiday Extras as the deal was airport hotel and parking.", "title": "Ok for a 1 night stay at LHR", "user": "S&ALLondon", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127579240}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "It’s easy to find along the Bath Road and had plenty of parking. We had a good welcome from reception and were allocated a top floor quiet room away from the lifts. The reception area is vast with modern décor but the rooms and corridors could really do with a refurb.", "title": "Best Hotel in the Heathrow strip", "helpfulness": 2, "user": "Wembleygal", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127533828}, {"rating": 4.0, "title": "After a hard day of travel, the staff made me feel better...", "text": "Our room itself was small but had everything you need. The bed was comfy too. Considering this hotel is so close to the runway it’s relatively quiet.", "user": "OnePassPlatinum", "date": "April 8, 2012", "id": 127475535}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Cannot comment on breakfast/dining facilities as we didn’t use these.", "title": "OK airport hotel. Suspect that there's better.", "user": "Pompey103", "date": "April 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127448007}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "We used the hoppa bus to get to Terminal 3 which worked fine. We purchased our tickets the night before from the machine near to the concierge.", "title": "Excellent staff", "user": "RevyCanada", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127300401}, {"rating": 2.0, "title": "Old and tired hotel.", "text": "This hotel is close to the airport and has good shuttle service, not free, but good. The problem is that the hotel is really old. My room had no mini bar, in fact it was nailed shut, and had no bottled water in the room. The sink only had scalding hot water so you couldn't even brush your teeth. The shower only had cold water. The food in the bar was excellent but the bar was dirty. Service was good, they did try to fix the problems, but the hotel is just plain old. Not comfortable. Dated.", "user": "lorraine6225", "date": "August 11, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 74767962}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We arrived at the hotel earlier than expected, but this was no problem the staff on reception were really helpful and very soon we were in the room we had requested. The housekeeping stall were very friendly and even offered to turn down our bedding in the evening,our room was lovely and clean throughout our stay, The staff in the restaurant were very attentive and ensured all our needs were met, not bad when you consider the hotel was full because it was Farnborough airshow. All in all we had a lovely break this being our 4th annual visit, and hopefully not the last. Keep up the good work Renaissance.", "title": "Made to feel like royalty", "user": "allied2", "date": "August 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 74649095}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I took the upgrade to a club room - always a wise move as you get breakfast thrown in. What is not so good is no snacks in the club lounge at the weekend. Check-in can be a long frustrating experience when it is busy, I have never seen so many people behind a desk achieving so little in such a long time.", "title": "Still a good experience ... but only just", "user": "tromsopete", "date": "August 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 74498484}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My room was clean, well appointed and had a runway view however, the aircraft noise does not intrude as the double glazing was good. Despite being a non-smoking room in a non-smoking section it smelled of cigarettes. Whether that was from a previous occupant or permeating up from the next floor I don't know but housekeeping should really have freshened it up a bit. I notice a couple of other reviewers have made the same comment.", "title": "O.K. hotel near the airport", "user": "CountryHills", "date": "August 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 73659894}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Many people complain about cleanliness and room quality - I stay regularly and I have never had a bad room. On this occasion (as always) it was spotless, bed linen squeaky clean and I will also say - amongst the better quality hotel beds. What takes up the space in any room is the huge old fashioned analogue TV in a wooden cabinet which is long overdue for replacement now. The decor is badly worn in many places and money will need to be spent sooner rather than later.", "title": "Tired, outdated and overpriced", "user": "TheRodders", "date": "August 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 73539686}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "II have stayed at this hotel several times over the last few years on business, however recently stayed over with my family due to a cancelled connecting flight.", "title": "Good Service - Renovation desperately needed", "user": "jb812", "date": "April 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 128287885}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel public areas (Bar / Restaurant) are fairly modern and the food in the restaurant is of a reasonable standard although expensive. Breakfast was particularly good and as the airline was paying I was glad we had been, although if I had been paying myself the price would have put me off going in the first place. It is also worth noting you may have a shock at the price of drinks at the bar, they are starting to get beyond a joke, especially as they add a service charge, even when you go ton the bar and order your own drink - This really is a cheek as the service is anything but quick!!", "title": "Glad I was only there one night", "helpfulness": 1, "user": "tdLeeds", "date": "April 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 128279549}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The most disappointing thing about the hotel is the very dated bedrooms, they all look identical, even if you are in a club room and they need a complete refresh to bring them up to anything like a 4* standard. I have no idea why any hotel thinks that old fuzzy tv's (please get some flat screens), and dated bathrooms are acceptable. Also the green carpet and worn furniture needs to go. On a positive note the rooms are clean and the beds are very comfortable, so you should not be put off staying at the hotel if you can get a good rate.", "title": "Comfortable stay in a brutally ugly hotel!", "user": "Trampus01", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 128191147}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel staff are generally friendly and professional as you would expect in a business style hotel.", "title": "not an easy stay", "helpfulness": 1, "user": "San F", "date": "April 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 128086410}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Hopefully someone from Marriott will read this and may be able to give a comment on plans for refurbishment in the near future - if not it won't be long before the hotel will no longer be somewhere I will consider staying when at Heathrow.", "title": "Disappointing Start", "helpfulness": 1, "user": "Gilliandash", "date": "April 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 128079130}, {"rating": 5.0, "title": "Lovely", "text": "Fantastic views of runway from 3rd floor. Excellent meal and breakfast. Would love to stay again. Great service.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 1, 2005", "id": 3981505}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Good hotel lots to choose from in this area ,this is as good as any.Slept well,had great view of runway , very quiet room 1187!Food was good, nice bar and lounge.All the staff were very polite and friendly. Would stay again.", "title": "stopover", "user": "davidcarol", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140228177}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "OK i am a harsh grader, i have stayed in some of the best Marriott resorts and hotels, and also some of their better lower end hotels. On the good side you barely hear the planes. Stay at the new Marriott down the street, better food, restaurants, and rooms.", "title": "Renaissance? Really?", "user": "Bryan_S", "date": "September 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 140197405}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "But here are the shortcomings:", "title": "Value? Keep looking.", "helpfulness": 2, "user": "3D_Voyager", "date": "September 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 140164058}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "* Yes the bar and restaurant staff speak English, but they don't know how to mix a drink on the menu (took 15 minutes, had to get a manager to make it) and service was non-existent.", "title": "Close to airport but pricey", "user": "1969tina71", "date": "September 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140013444}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "*** Only one outlet at desk (european), two on floor (UK) between minibar and TV cabinet,none by the bed....how the heck do you charge a laptop, phone and tablet? not in these rooms!! Make sure you ask for extension cord when you check in.", "title": "Great location if you like watching aircraft! ;-)", "user": "JasonL4", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 139888898}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We arrived very tired at 10pm only sleep/shower and catch a morning flight. The layout is so bad, we had to walk about 6-8min from the elevator to our room. The extra bed we requested was not in the room, nor made, so we couldn't go to sleep until it was set up. The room we got smelled like cigarrette butts, even though I requested a non-smoking and there was a non-smoking sign in the room! I was told there was nothing else available right then, but that they would send a housekeeper to \"freshen up\" the room, who never came.", "title": "Good linens, comfy bed, bad service, cigarrette butt smell", "user": "boxofgoods", "date": "July 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 72706139}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "We finally went to sleep...I expected better service from a 4 star hotel, being that I did not have unreasonable requests.", "title": "Very happy -- great way to eliminate many Heathrow hassles", "user": "SanDiegoBusyWoman", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72382108}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed at this hotel the night before a morning flight to avoid the hassles and we were very happy with our experience.", "title": "Comfy matress but dirty washrooms..", "user": "Kleyopattra", "date": "July 25, 2010", "detail_rating": {"value": 2.0, "sleep": 5.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 72283242}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "First nice thing was getting there -- we used the London transport journey planner and found that we could take a bus directly from Harrow (where we had been staying) and get dropped off right in front of the hotel with no changes. Mondial and Nene stops are immediately prior to the Heathrow stop and both are right in front of the hotel (at opposite ends of the same block). Easy and cheap. Since hotel is in the free Heathrow transport zone, we took one of the very frequent busses at 5 in the morning to get to airport for free instead of being ripped off by Hotel Hoppa.", "title": "Location", "helpfulness": 1, "user": "Sledz", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71461673}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Check in was easy and friendly with no waiting. Room was quite nice and whatever they did to keep the plane noise out seemed to work really well. Internet was expensive, so we walked about a block away and crossed the street to the McDonalds which had free internet access. There was a busy, helpful, and kind concierge working in the lobby who offered some nice tips when I asked about where we could go eat from there if we only wanted to walk (he suggested a couple of places, including a nearby pub). Check out was zero-hassle, zero-waiting. Great airport hotel experience.", "title": "Renaissance Hotel - A tired old bird but good none the less", "helpfulness": 1, "user": "MarkWButler5705", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 71141488}, {"rating": 2.0, "title": "Where's the staff?", "text": "After a one-day road trip to Cholsey, Oxford and Woodstock, and as I was returning to the US on an 8 a.m. flight the following morning, we decided to stay near Heathrow rather than going to my boyfriend's house in Englefield Green. This was one of the hottest weekends in the UK in ages and staying in an air conditioned room after walking under the intense sun at Blenheim Palace Gardens was enticing.", "helpfulness": 4, "user": "islington3164", "date": "July 19, 2006", "id": 5488691}, {"rating": 2.0, "title": "Nice staff can't overcome bad hotel", "text": "We arrived at approximately 6 p.m. only to find one person working the regular check-in line (about 7 people ahead of us) and the airline crew desk where two crews were checking in. At 6:48 p.m. (I looked at my watch.) and after numerous complaints from those of us in line (all of which were ignored), we finally arrived at the counter only to be met with the rude, snipetty clerk. When we asked for a room facing the runaway, we were told that none were available and then gave us an unnecesary smirk. We later ran into someone who had been standing behind us in line and he had somehow managed to get a runway view, whlie we got a room facing a wall. When I asked the clerk to look up my Marriott Rewards number, as I did not have it with me, he told me he could not do it through the computer system and \"oh well, too bad you won't be getting points for this stay\". As we had planned on using the car later that night, we asked about the £10 parking charge, which per the website, is the maximum charge for 24 hours. We were assured that even if we went in and out, we would not pay more than £10 and staff would adjust any extra parking charges at check out. We left later to go to Staines for dinner and paid £5. On the following morning, we knew we would have to pay the full £10 as the car had stayed in the lot for the night. However, there were no clerks at the front desk and when we asked a hotel employee who was in the lobby, we were told that there was nothing he could do and we should just drop our key at the express check out and take it up later with Marriott.", "helpfulness": 5, "user": "Jet-Setter-SF", "date": "July 12, 2006", "id": 5460538}, {"rating": 4.0, "title": "Not a bad hotel", "text": "On the plus side, the hotel is clean, typical large-ish airport hotel room, lots of tv channels and good movies.", "helpfulness": 5, "user": "WNelson", "date": "May 31, 2006", "id": 5237419}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "This is not a bad hotel, but the decor is now out-dated (70s) and the staff, which I think consists of one very irate person, is completely indifferent. This is a good Heathrow hotel if you can get it for under £75; otherwise, stay somewhere else.", "title": "Decent Heathrow Hotel", "helpfulness": 5, "user": "g&z", "date": "May 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5186969}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "This is a huge Heathrow hotel. Successful only due to its proximity to the airport. If it were anywhere else it would have to improve or drastically reduce its prices. (I paid 139 pounds for one night.)", "title": "A bad experience", "helpfulness": 5, "user": "PhantomHotelReviewer", "date": "May 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 5182094}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 188, "average": 332, "very good": 423, "terrible": 94, "excellent": 136}, "aka": "Renaissance Hotel London Heathrow", "slim_ranking": 0.6, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}}