{"user_rating": 4.0, "review_count": 227, "name": "Renaissance Savery Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We wanted a quick weekend getaway for our anniversary. We wanted something nice, with a pool/hot tub(as always), and near downtown. We booked this hotel and we're surprisingly thirlled with the location. After driving around Downtown I think this is closest hotel to all the bars and restaurants. We we're 1-2 blocks walk away from everything.", "title": "Great Location Decent Hotel", "helpfulness": 1, "user": "Chad B", "date": "July 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 135334500}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The room was very small...but clean and well decorated. The beds were very comfortable. We did have to pay for parking..and breakfast was not included. They did have wifi included which was nice.", "title": "\"Lots of charm\"", "helpfulness": 1, "user": "Chad B", "date": "July 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 135178921}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The pool was a bit of a dissapoitment. It was located in the basement with no natural light. The hot tub had something wrong with the fan. It made an extremely loud whistle that was a huge annoyance. It was so loud you could hear it in the entire basement.", "title": "Handicap bathroom is poorly designed", "user": "hotelsnob012", "date": "July 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134552331}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I was told this hotel was one of the oldest hotels in Des Moines. Parts of the the hotel had that feel..but they've done many modern updates. It was a good hotel. Worth the $130 a night we spent. On the weekdays it jumps up to over $200.00. I don't think I would spend that comfortably though.", "title": "I Liked it!", "helpfulness": 2, "user": "RoadWarrior0219", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133599773}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "This is a very unique, charming hotel. It has been renovated, but, some of the character has been left. The bathroom had the toilet on an angle and the flush handle was on the wall...It appeared to be the original...Very cool. The beds were very comfortable, but, a little small. I think they were full or double and we are used to a king size bed at home. The pool and spa area were very nice. We arrived late and had very little use of either. I just do not think they should close the pool and spa when people are in them relaxing. :( There were some mystery stains on the carpeting..Parking was a hassle. Overall, a very nice hotel, but, be prepared to somehow deal with parking in a garage or on the street as the hotel has no parking of their own. We enjoyed our one night stay.", "title": "The Historic Charm is Missing", "user": "buellj", "date": "June 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132731786}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I used to enjoy staying at this restored bit of area history. The building has been updated and retains its vintage feel and coziness but there's nothing for the traveler to do in this hotel. The coffee shop aka the bar and hotel food service is average and the front desk staff are not up to contemporary Marriott standards. It's time to re-price this location or hang one of Marriott's budget brands sign on the door. The neighborhood has transitioned from busy to just tired and run-down. I would be reluctant to have my wife or daughters stay here, set your expectations low so you won't be disappointed!", "title": "Great Stay-Strange Neighbors", "user": "GOmaha", "date": "October 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 141943741}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Ok I'm a platinum member who is basically in a 10 x 10 closet for 259.00 a night. It smells of sewage. While the room may have been comfortable in 1920 it isn't now.. Room is like a youth hostel. Headed to a king bed tomorrow at the Marriott tomorrow for 30 bucks more and a room 2x as big. Tried to give this a chance but management and everything here is a disaster. They believe their own historical hype as to why you should be inconvenienced. Full price without the amenities of the Marriott like HD channels and valet parking (garage at Marriott, not here, same price. Outside). Bar has expired bottle beer, June for a Boulevard Ale, ask bartender.....ohhh. nothing. Run from this disaster.", "title": "Not of Marriott standard", "user": "Brian R", "date": "September 25, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 141197623}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "So I check in, the girl at the desk seem not so on top of things. I asked about parking and the garage run by a 3rd party put the gate up at 5 for the free weekends. Nope, not till really late at night per front desk. So I park there figuring I will leave to go to the bar at around midnight or fall asleep and leave in the am thus parking for free. So I ended up going to the car at maybe midnight and found the gararge had put a parking bill on the car. So I thought bad words and left. The gate was still down. I hit the button and the rep said to pay the bill and put the paid reciept in the envelope and place in the drop. It was maybe 5 bucks, not a big deal but sorta wish the check in had known what she was talking about. Also room was tiny. Bathroom so small not only do you have to choose to have door open or closed while on the pot, the sink has no counter. They did have aveda products. The bar soap seemed as cheap as any other brand and i got a pimple 2 days later. The shampoo smelled good, peppermint- not standard aveda smell--much better:). There are city sounds even on high floor. I had a headache at about 7 pm so went to walgreens down the street for headache med and treats. It was already closed...wtf. The hotel did sell in the mini shop by the desk and cost 2.50 for 1 dose, added to bill, was happy. Night staff also seemed indifferent-- they did have security--NPI (not known for quality). This hotel seem to like to find unskilled workers on the cheap rather than hire professionals. Elevator was tiny, if there is a fat guy with a bag you are waiting for the next one, although I found speed to be much better than what others said. Overall, not my kind of place, am silver, got free internet but no bottle of water or free breakfast nor anything else most chains provide to elite (even low level) members. If you are an artsy fartsy person or one that likes history it might be alright, or if you get an upgrade they have nice rooms. My counsin invited me over to party when she stayed here for free a couple years ago as she was a sales manager for marriott-- locations liked to butter her up with free stays and gifts in hopes corp sales mgr will book them business. That suite was huge.", "title": "Not my kind of place", "user": "chuck29355", "date": "September 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 140810062}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "This hotel is located right in the heart of downtown Des Moines and convenient to many locations. The bed is one of the most comfortable I've slept in. Staff is very courteous. The bar has a great ambiance. Fitness room was large and had many different types of equipment. The only downfall was checking out the next morning. Only one elevator was working so it took me 15-20 minutes to get down to the lobby and I had too much to carry to take the stairs.", "title": "Neat and convenient hotel", "user": "Pam H", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140598728}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Overall, the hotel is nice. Admittedly, didn't use many of the amenities (pool, restaurant, etc.).", "title": "Service could make it great", "user": "April J", "date": "September 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139481616}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at this property on our visit to Des Moines for the state fair and Adventure Land. Will be back, love the friendly staff, clean rooms and the location. The beds were very comfortable and sheets felt clean. Like the lemonade in the lobby, nice tuch.", "title": "Over night stay", "user": "Nichole S", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137899073}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Pulled up, gave my keys to the valet, checked in and was in my capitol view room within 5 minutes. Yes valet was $16 which I knew of going into it however It was worth it to me to save my energy from finding a place to park. Hotel is close to all of the bars/eaterys. My wife and I elt very safe walking back the block or so at 2am. The nice thing with with place is they will drive you anywhere within 3 miles and then come back and pick you up for free. @ one point the drivers were on airport runs and I was told it would be 20 min. (no problem) 3 minutes later I got a call telling me the manager was on her way. Very cool people. Make sure you check out Zombie Burger which they will take you to. Thanks again Renaissance downtown desmoines for being so kick as$. I think they have so many differant styles of rooms, our king had two full baths. So I would tell them your needs and maybe they can sugest the best room to meet your needs.", "title": "kick as$", "helpfulness": 1, "user": "LETMPLAY", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136523204}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We spent three nights at the Savery and would give it a favorable rating. The best thing was that we had two full bathrooms - big treat after being on the road for awhile with my husband. The thing I liked least was that the room is quite large and a fairly small TV was on the wall opposite the bed and too far to watch in bed. The Summer Olympics were on and I found this frustrating. The staff were all very nice to work with. The Court Street night life is a short walk and that was a plus.", "title": "Very comfortable and nice location", "user": "Diane Lynn", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136521477}, {"rating": 1.0, "stay_parameters": "Stayed July 2012", "text": "The check in staff is HORRIBLE. The staff member and the supervisor charged my debit card for 4 nights vs. 2 nights. As I went up the chain of command the excuses were less. Make this your last choice please. It's 11.00 to park or 16.00 if you choose valet . The guys at the valet parking were great . A car was broken into at the 11.00 a night garage .", "title": "Run away while you have a chance", "helpfulness": 1, "user": "Hotelfox1", "date": "July 28, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 135648255}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel was only able to comp me 2 mornings of a free breakfast which I could already get because I am a Marriott rewards member. Per the manager Tina at the time the 2 restaurants and the valet service are all separate from the hotel. Save your trip , your sanity and your money . Don't stay at the Renaissance UnSavery Hotel", "title": "A Touch of Luxury in Downtown Des Moines", "helpfulness": 1, "user": "Paul4ejjr", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135349923}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I would not recommend this hotel because even if it is in a small city, it is expensive and with very limited service. You pull over in an open area right on the street, so if it is raining (it was when we came in) you will get wet. No one in sight to help with bags or lend an umbrella. When the bell boys were called to help, they did not like being disturbed for whatever they were doing. You have to go back out after check in and drive your car to a parking garage, so you get wet again.", "title": "OK Business Hotel, but very expensive for its category", "user": "Fernando1969", "date": "June 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132679948}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Dinner was closed for the night at 9 or so, so we had to go to the bar to order some food, there was a total of one person working at the bar, for about 20 people ordering drinks and food.", "title": "Very Nice Classic Hotel in great Downtown location", "user": "milestonecruise", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132466814}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My room was spacious and clean, but again, not worth the price, this is a 3 star hotel max.", "title": "Room more like a Motel 6 than a Renaissance", "user": "Snoopy575", "date": "June 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 132158754}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Not recommended.", "title": "Great location, room views, room layouts and staff.", "user": "jgoemaat", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132074746}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Very Nice Classic hotel in great downtown location. Close to events center, civic center, State capitol and Des Moines river. (Concert on the river the weekend we were there)", "title": "Great hotel in perfect location", "user": "MaryinMilwaukee", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131972232}], "location": {"country": "United States", "city": "Des Moines"}, "stars": 3.5, "variance": {"poor": 17, "average": 32, "very good": 78, "terrible": 12, "excellent": 88}, "aka": "Renaissance Des Moines", "slim_ranking": 0.155555555556, "description": "This historic hotel, located in the heart of downtown Des Moines, Iowa is within walking distance to Wells Fargo Arena, Iowa Events Center, Civic Center of Greater Des Moines, Court Avenue restaurants and nightlife and East Village restaurants and shops. Start your day off right with a visit to Coda Coffee, located on the street level of the hotel, for freshly brewed Starbucks beverages. Then return in the evening to Coda Lounge to discover the hottest new lounge in downtown Des Moines. Don't miss the contemporary midwest cuisine and local products served in BOS restaurant, also located street level in the hotel. Additional amenities enjoyed by guests include a fitness center, indoor pool, whirlpool, complimentary airport transportation and complimentary wireless service. If you’re searching for a venue to host a romantic wedding, a business meeting or a conference, this hotel features over 12,000 square feet of function space, innovative meeting technology and a creative catering and culinary team."}