{"user_rating": 4.0, "review_count": 1018, "name": "Renaissance Harbour View Hotel Hong Kong", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "What everyone else has said really: Superb views over the Harbour, nice rooms, very comfortable.", "title": "Amazing views", "helpfulness": 5, "user": "glasgow1888", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8092887, "likes": {"liked": "— View", "disliked": "— No bar"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Very much a 4 star city centre hotel and doesnt try to be anything else. Good location, reasonable food and attentive service.", "title": "Excellent Large Hotel", "helpfulness": 3, "user": "Paul H", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8090511, "likes": {"liked": "— View", "disliked": "— View of building work"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Desperately missing an important feature: A BAR!!!", "title": "Nice Location but that's pretty much it", "user": "mare1205", "date": "July 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8072338, "likes": {"liked": "— The Location of the Hotel - but the next door Hyatt has the same", "disliked": "— Noise, service and the lack of information from the Hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed for two days after leaving the QM2. More than happy with the hotel and facilities, The view of the building works was not the best but would be temporary.", "title": "Great Harbour Views", "helpfulness": 9, "user": "Brummy07", "date": "July 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8033006, "likes": {"liked": "— cleanliness", "disliked": "— having to carry luggage up and down an escalator"}}, {"rating": 4.0, "title": "Good but not Great", "text": "Nice large room with all facilities and restaurant and bar fine. Live music at night in the bar very pleasant.", "helpfulness": 8, "user": "mushis", "date": "June 27, 2007", "id": 8004305}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My first comment would be that the Renaissance has the very best location of any hotel on Hong Kong Island. And since I prefer Hong Kong Island to Kowloon, I consider the Renaissance to be the very best place to stay.", "title": "Best location on Hong Kong Island", "helpfulness": 17, "user": "Montana Business Man", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7957844, "likes": {"liked": "— LOCATION, LOCATION, LOCATION !!!!", "disliked": "— small fitness center"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "PROS:", "title": "A decent base", "helpfulness": 4, "user": "Ratbag", "date": "May 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7708036, "likes": {"liked": "— Nice clean towels/bedding", "disliked": "— Noisy neighbour (see review)"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "1. My top priority when I travel in Asia is to be conveniently located next to subway entrance. If I'm only in town for a few days, I don't want to lose 2-3 hours a day from walking between the hotel and nearest station. The Renaissance is a fast (and covered) 5 minute walk to the Wan Chai station and just 60 seconds away from the Star Ferry terminal. Lots of hotels are located near a subway station, bu the Renaissance is the only one close to both a subway station AND the Star Ferry.", "title": "Excellent experience", "helpfulness": 6, "user": "vanessa_jm_gray", "date": "May 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7703081, "likes": {"liked": "— Views & location and standard of clenaliness", "disliked": "— building work next door"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "2. Right across the street via covered walkway is a 7-11, grocery store, coffee shop, and about a dozen restaurants, including the extremely popular (and cheap) Cafe de Coral. Acquainting yourself with this area will save you big bucks on dining.", "title": "Decent hotel in great location", "helpfulness": 10, "user": "pvg", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7693735, "likes": {"liked": "— Location, service, overall good value", "disliked": "— Too many businessmen, slow elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "3. Service is impeccable, but that is pretty typical for most of Hong Kong.", "title": "Flawless stay", "helpfulness": 9, "user": "nobster666", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7631007, "likes": {"liked": "— service", "disliked": "— lounge bar music. Couple of pretty girls murdering all the all saints classics."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Well placed hotel on Hong Kong side. Absolutely must have a harbour view room ( although the next door conference centre is extending with plenty of building work and the hotel lobby was being refurbished - no discount or prior notice was given to us) although to be fair it made little impact on our stay. Superb location and views. Covered walkway to metro and nearby shops. We ate out of the hotel with breakfast at a deli t the end of the walkway and dim sum and local restuarants cheap and plentiful. Nearby ex pat drinking and red light area not too seedy and local street markets next door worth the visit. Starline ferry a short walk and trams and buses nearby -its very easy to cover HK and Kowloon side. Use peak tram to get up and then walk round the corner for a bus back down to get the views and quicker exit. Stanley market not as cheap relatively (Primark t -shirts cheaper!) but plenty eating and drinking places and easy transport via No 6 bus. Allow plenty of time to get back from Aberdeen harbour via the tunnel as very busy. Definately recommend the longest mid level escalator trip with then a leisurely walk down through the zoo (which was well worth the visit )and then exit and drop onto the peak tram -as a sort of trip itinary.", "title": "great location", "helpfulness": 9, "user": "watchitLondon", "date": "September 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8676963}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This hotel is just fabulous. Everything about it is great; the food, pool, rooms, staff helpfulness, location. It is right on the harbour and adjoined to the COnference and exhibition centre. THe undergroud train is a short walk away and is easy to find through a hotel walkway. We were upgraded to the Club floor, where we felt like rich business people, except we hadn't brought the smart clothes to go along with it. All in all a great placeto stay.", "title": "Great hotel", "helpfulness": 10, "user": "DavinaB", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8470024, "likes": {"liked": "— Fantastic views"}}, {"rating": 4.0, "title": "would return", "text": "wonderful location and fantastic hotel.. real luxury with excellent service and very good value for the price..cant wait to return", "helpfulness": 8, "user": "LancashirePeely", "date": "July 27, 2007", "id": 8242774}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed here for 3 nights from the 10 February. The hotel is on the waters edge of Hong Kong Island which looks across the harbour to Kowloon. The staff were very helpful and our room was very comfortable and very clean. Our room also looked across the harbour and was toped up daily with free bottles of water which comes in very handy. The hotel pool looked very nice although we did not have time to use it and the restaurants in the hotel were also good. The hotel is next to the star ferry terminal couldn't ask for a better hotel.", "title": "Great view of the Harbour", "helpfulness": 5, "user": "w0rldwidetraveller", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8120264, "likes": {"liked": "— All of it", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Stayed two nights in the Renaissance on they way out to NZ and again on the way back.", "title": "Lovely hotel would definitely return again", "helpfulness": 5, "user": "newgrange", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8116722, "likes": {"liked": "— Fantastic location", "disliked": "— Smoking floors in hotel (yuk)"}}, {"rating": 3.0, "title": "spring weather", "text": "Fantastic spring weather mid April. Took express train from airport (cheaper to buy double package) and then courtesy bus to outside hotel. For return took taxi to express train terminal, which has quick check-in for bags rather than at airport. Hotel checked in quickly but first room smelt very bad but were changed after a little while to another similar room. Room size smallish and drab as is rest of hotel. However, staff service is exemplary at all times. Breakfast very average selection and quality neither good nor particularly bad. Ubiquitous Filipino group sang bravely in a cavernous entrance area, which ruined any sound. Bar food was quick and fresh but tends to expensive as are drinks. Very much a business hotel (part of the HK Conference Centre) and lacks any atmosphere. Has a retro look of old style socialist hotels ie block shape, with marble but drab. Very handy for one of the Star ferry terminals, a couple minutes walk. We got a good corporate rate but would otherwise consider elsewhere for more \"character\". The staff are the best part.", "helpfulness": 4, "user": "fco", "date": "April 20, 2007", "id": 7405252}, {"rating": 5.0, "title": "Fantastic Trip", "text": "We stayed at the Renaissance over New Year, we had a fantastic stay, the rooms are small as expected, the service and hotel facilities are fantastic, taxis are very cheap and public transport even cheaper, the hotel is literally 2 mins walk from the Star Ferry and about 5 mins from the train terminal, from Wan Chai it took about 45 mins to China Shenzhen station, be prepared for the culture shift as you get there, we must have travelled to Lo Wu commerical centre on one of the quietest days, dont go early as you will simply be followed and hassled more as shop vendors fight for your business.", "helpfulness": 6, "user": "SJJG", "date": "April 9, 2007", "id": 7301069}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We booked the limo service from the airport to hotel and it could not have run smoother, although its much cheaper for a regular taxi or public transport.", "title": "New Year's Eve in Hong Kong", "helpfulness": 7, "user": "Reviewer23", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7270371, "likes": {"liked": "— Good location and excellent service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Breakfast is very varied and very good, the hotel has a great pool and relaxation area, you can also book beauty treatments at the hotel next door. The hotel is spotlessly clean and concierge are a great source of knowledge and provide detailed maps for local attractions and restaurants, dont miss the peak or the fortune telling birds in the night market!!", "title": "Terrific!", "helpfulness": 9, "user": "snakedriver", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7270277}, {"rating": 5.0, "title": "Fabulous Hotel", "text": "All in all a fantastic holiday, a great location and I wish I could go back tomorrow!!!", "helpfulness": 9, "user": "TAAC", "date": "April 1, 2007", "id": 7266570}], "location": {"country": "China", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 25, "average": 112, "very good": 441, "terrible": 13, "excellent": 427}, "aka": "Renaissance Hong Kong", "slim_ranking": 0.0795660036166, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Situated on the waterfront and adjacent to the Hong Kong Convention and Exhibition Centre, the Renaissance Harbour View Hotel Hong Kong enjoys panoramic views of the Victoria Harbour and is located close to everything Hong Kong has to offer. With the completion of Phase Two of the hotel’s renovation program in August 2011, the hotel offers 857 modern guestrooms with the latest technology. The hotel’s banqueting and conference facilities have a total of over 1,300 square metres in the Lower Lobby, Mezzanine and 8th floors. The facilities include two versatile function rooms named the Oasis and Concord Rooms, and nine boardrooms. Modern, artistic and elegant are the best description of the newly renovated Concord and Oasis Rooms. Upon entering, one is immersed in the gold and burgundy effects of the decoration. Glittering, modern chandeliers and the colourful LED lighting with twelve different combinations stir up the ambience of the function rooms. Complementing the lighting and wood panelled walls is the soft burgundy and purple carpet with oriental touch. The Concord and Oasis Rooms are divisible into four separate rooms to cater for intimate to large-sized events of up to 600 guests for a banquet setting.Full length windows, a partial glass ceiling, state-of-the-art technology including wireless Internet access, built-in projectors and LCD screens, and contemporary interior design ensure that guests will find every venue to be an inspiring environment for meetings, conferences, receptions, banquets and weddings. An attentive and professional team of event specialists and technicians will be on hand to ensure that all events are a success. With its prime location, first-class accommodation, superb dining and business facilities, the hotel is the perfect choice for discerning leisure and business travellers."}