{"user_rating": 3.5, "review_count": 287, "name": "Rendezvous Reef Resort Port Douglas", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed at Rendezvous resort (although dont know how they can use the word Resort) in September 2012. The first unit we were put in was, dirty, dark and looked out at a back below the main road. The lounge suit (which is just outdoor wicker type furniture) have cream cushions that were stained and really uncomfortable, urine around the toilet, the window joinery was really dirty and upstairs was a safe in a cupboard with a rusty lock, which, there was a $4 per day charge. We shifted units and although a better location, the unit was still dirty. Washing machine didn't go. The staff were really nice and helpful, except Natalie, she was rude, sour faced and everything seemed to be a problem, sighing when asked a question, the worst person for a front desk job i have ever came across. The beds were very comfortable and shower upstairs had great pressure, although marketed as a 2 bathroom apartment, i wouldn't call a shower behind a door with a toilet in a tiny room off the laundry, a 2nd bathroom, we didn't use this. They put on really good breakfast.There was no outdoor area to sit in the sun, no real outdoor furniture. We compared this place to a motorcamp with units. We were so disappointed and found this place to be depressing. We checked out after 2 days, couldn't do the whole week here. This place needs totally renovated (not just a flick of paint)and some seriously new furiture. Wouldn't recommend sorry.", "title": "Rendezvous Port Douglas", "user": "Linda M", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 140479442}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for 6 nights in August 2012 and thought it excellent. We were really impressed by our villa with two comfortable double bedrooms both with balconies, two shower rooms, well-equipped kitchen, spacious dining area, comfortable lounge area with tv and hi-fi, washing machine and drier and terrace outside looking out over the stream and mangroves and well-maintained garden full of colourful birds and flowers. The staff were friendly and helpful and the few small things that we reported as not working were attended to immediately by the maintenance staff. The two swimming pools looked great for families with small children but we prefer to swim in the sea (it wasnt stinger season) so we walked across the road and down a path to the amazing 4 mile sandy beach. We also walked twice via a pathway full of birds and trees to the excellent Rainforest Habitat (our tickets were valid for a second free visit if made within three days of the first visit - we also had an amazing value buffet lunch with the lorikeets there)and across the road from there is a supermarket and bottleshop so we were able to buy all the provisions we needed despite not having a car. The shuttlebus goes regularly from the hotel to the centre of Port Douglas - we preferred the friendly driver of the Sun Palm service and think it was slightly cheaper than the other one at $21 return for three of us. Most of the tour companies we booked with came to collect us free of charge from the hotel. There's all you need for a comfortable economical stay in Port Douglas provided you dont need to be right in the centre for nightlife. Highly recommended.", "title": "Excellent! fantastic value, comfortable well-equipped villa", "helpfulness": 4, "user": "sjcarayon", "date": "September 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139789148}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We stayed at this hotel recently and were definately underwhelmed by our \"delux villa\".", "title": "rendevous resort, port douglas", "helpfulness": 1, "user": "Lesley S", "date": "September 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 139547759}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "On our arrival the manager and receptionist barely acknowlegded us, apart from the greeting, \"your room is not ready, come back in 2hours\" After a long flight from Chch, Nz, this was not welcoming, nor was finding the villa had 1 queen size and 2 single beds, hardly the accommodation for 2 couples. After much discussion and more waiting time a different villa was found!", "title": "Great value and good service", "helpfulness": 2, "user": "jamward", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 139312032}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Unbelievable to us was the 1 satchet of dishwasher powder and 1 toilet roll in each loo! That's taking budget to the limit!!", "title": "Port Douglas", "helpfulness": 2, "user": "WALTONS12345", "date": "August 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 138991207}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "As other reviewers have said this is not a 5 star resort. It does have a number of things going for it.", "title": "Perfect for family vacation", "helpfulness": 3, "user": "robmigrates", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145632621}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "1. The pools are magnificent. Love the spa 'caves'.", "title": "Great time at Rendevous Reef Resort", "helpfulness": 4, "user": "Lee-Anne G", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145100227}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "2. The Villas are roomy. You have the option to cook for yourself or eat out.", "title": "Underrated Resort", "helpfulness": 2, "user": "redbark17", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144894819}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "3. Prices are reasonable for what you get and up to 2 kids eat free.", "title": "Fun Family Holiday", "user": "whoopdedoo", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 144696716}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "4. Shuttle to Port Douglas if you don't have a car", "title": "Rendezvous Resort.....FANTASTIC", "helpfulness": 8, "user": "jenniferc2012", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144449680}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "spent a wonderful 6 nights at rendezvous. Friendly, helpful staff. Very comfortable modern villas which were very large for a resort. Great pools(3) Gym and lap pool. Didn't have to leave the resort at all if you didn't want to. Bus to the Port village in 2 minutes. We were very impressed with what the restaurant had to offer both for breakfast and dinner. Didn't try the lunch.Kids loved the recently built playground which kept them amused for hours and the bbq area is terrific. A great stay and we will be back next year. Thank you Rendezvous", "title": "Not Disappointed at all", "helpfulness": 2, "user": "wayne m", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 144171980}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Read a lot on here about bad service and dodgy rooms so was very worried about what we would find. We need not have worried. We had a fantastic 2 bedroom delux villa right next to the mid size pool and loved every minute of it. The room was newly renovated and had everything we needed. Contrary to other reviews on here it was in excellent condition, clean linen, lots of toilet paper, new carpets and terrific bathrooms.", "title": "Loved it", "helpfulness": 8, "user": "Leigh S", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143421035}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The only thing that was not up to scratch was the couch. Very small and uncomfortable but if you spend your holiday in Port Douglas sitting on the couch then you may as well stay at home.", "title": "Great Value - Don't sweat the small stuff", "helpfulness": 10, "user": "Scatterman", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 142813840}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Loved the gym, the BBQ area and the pools. A town shuttle is available every 15 minutes from the front door. Had no issues with kids in the pool waking us up early. There was plenty of kids around but we didn`t hear them.", "title": "Rendezvous Reef Resort Port Douglas - Disappointed", "helpfulness": 4, "user": "Karen D", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 141036817}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The staff were outstanding. So friendly and eager to please. We had to check out at 11am but they let us hang by the big pool and drink cocktails until 4.30pm when our airport bus arrived.", "title": "Very disappointed.", "user": "Loredana G", "date": "September 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 140900335}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This resort is getting a bit dated, the decor is a bit kitchy coastal early 1990s style. We had a deluxe apartment which was okay, it was clean and well maintained. The staff were good, friendly and helpful. A stay is as good as you make it. I wasn't interested in the pool because I was travelling in winter. Having an apartment was great as it allowed self help (cooking). The beds, the important bit when travelling, were fantastic. We had a queen and a king. we changed to the king to 2 singles and they were really comfortable. One of the showers was a horrible as it had the flexi hose and the shower head wouldn't stay in the right position and kept falling down. Car parking was problematic as the grade of the carport was elevated above road level which meant that the car bottomed out when I parked in the car port. I was worried about under carriage damage in the rental car, so ended up parking on the roadway. Other than those minor hiccups, it was generally good accommodation and a good stay.", "title": "Good value - Good accommodation", "user": "Nannanaps", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 138835289}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "the most unfriendly unhelpful staff we have ever encountered.Did not know how to smile.The unit was called \"deluxe\" - would hate to stay in the standard villa because our unit was very dirty with stained lounge suite cushions& mattress protector and was generally dusty throughout. We had to change the washing machine taps over because they were on the wrong way.The gardens are unkept & full of rubbish & weeds. There is no private outdoor seating area & the plastic outdoor chairs & small coffee table need updating. We had to stay for 11 nights because we had prepaid but wish we had not relied on the website photos for an accurate picture of this resort. Would not recommend to anyone wanting a clean, quiet & private villa.", "title": "definitely budget(& it shows)", "helpfulness": 1, "user": "Jo R", "date": "August 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 138738661}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This seems to be a group of apartments hustled around a central hub. Seems that not all apartments are owned by the hotel. We had a great deal, but feel our apartment was on the out limits of the establishment with private owners. Pools were a quite cool and certainly didn't qualify as inviting to stay \"we were told they are refreshing\" hmmmm. Apartment was great with our 15month old daughter, small bedrooms, plenty of air con, STAIRS STAIRS STAIRS - be aware, no room servicing with out additional charge, so make your own bed and clean up after your self. No outdoor furniture to enjoy the outside, communal BBQ area was handy - but dark and if your not into socialising with everyone and their dog.....painful. Great for a week away - but without luxury and service......next time I think we'll pay the extra to be waited on and pampered a little more.", "title": "Could have been better", "helpfulness": 1, "user": "mbm3", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 138185028}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The Rendezvous is a family with kids place and I wouldn't recommend it to romantic couple. Two large lagoon pools (the lap pool was closed for renovation)that is just great fun for the kids. The breakfast is really basic, nothing special but great that its included. Staff is friendly and the modern villa is well equipped, clean and with good beds. We used the BBQ area and had a great time meeting new people. Its good to have a car if you stay here because its a 5 mins drive outside Port Douglas. We had a lovely stay and I can really recommend this resort.", "title": "Our kids loved it!", "helpfulness": 2, "user": "Erik S", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137962756}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I stayed at this property in August 2012. It was a getaway from work and a way to really relax.", "title": "Great accommodation for families not too sure for couples", "helpfulness": 3, "user": "Chiquimonkey", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 137828186}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 27, "average": 56, "very good": 110, "terrible": 24, "excellent": 70}, "aka": "Rendezvous Reef Resort Port Douglas Hotel Port Douglas", "slim_ranking": 0.765957446809, "description": "Rendezvous Reef Resort offers two storey 1, 2 and 3 bedroom villas each with a kitchen, laundry, separate lounge and dining areas, TV/DVD player and balcony or patio in over 110 square metres of living. Set on 15 acres of lush tropical gardens offering plenty of room to spread out and enjoy the facilities which include 2 large lagoon-style pools, 1 leisure pool, a children’s pool, children's playground, gymnasium, 25m lap pool, tennis courts and a family BBQ area."}