{"user_rating": 4.5, "review_count": 126, "name": "Residence Inn Fredericksburg", "reviews": [{"rating": 5.0, "title": "Excellent choice!", "text": "Spur of the moment decision to take a rest on a long night of driving brought us here and it was a great decision. The rate was very reasonable and the room was huge! Very updated, clean and modern plus the staff was very friendly. Driving I-95 corridor can lead you to some interesting places to stay but this was a refreshing change and is highly recommended!", "user": "achatey7", "date": "May 28, 2013", "id": 162061445}, {"rating": 5.0, "title": "We could live herer!", "text": "The Residence Inn at Fredericksburg is at the purrrrfect location (60 Towne Creek Road) to tour the historic district - turn right at the light and it takes you straight downtown; and, it is located behind a shopping center with a movie complex and restaurants. Upon checking in, Bobby (behind the desk) told us we had been upgraded at no extra cost to us....very nice. I have to tell you that we love staying in Residence Inns; but, this one was just the best! The rooms (suites) are clean, comfortable, quiet and luxurious. The housekeeping staff need to be commended! Bobby was most gracious and helpful with directions and recommendations and offered to make reservations for us. If we could have a washer and dryer, we could move in! Along with the bedrooms, there is a FULL kitchen and a nice size living room. We'll go back just to stay here!", "user": "travelexplorer27", "date": "May 24, 2013", "id": 161720922}, {"rating": 5.0, "title": "Excellent Newer Property", "text": "I stayed at this location for one night during a drive. I was pleasantly surprised by how nice this hotel was. I believe it's brand new and it shows. All appliances were new and in great condition. The beds were very comfortable and the layout was inviting. I had a 1 bedroom suite, which was perfect for my family. The hotel is literally right off of 1-95 and I believe most of the hotel rooms face the freeway. Ours did, but I didn't find any problems with a noise factor. The hotel is also across the street from a mall, which was a nice treat Breakfast was good and the staff were very friendly. I highly recommend this location - you definitely your bang for your buck.", "user": "GAPeach444", "date": "May 7, 2013", "id": 159934848}, {"rating": 4.0, "title": "Good place", "text": "Recently stayed at this hotel on business. The usual RI. Located behind the Spotsylvania Mall and not in Central Park. Probably a good thing since being inside Central Park can get busy with traffic.", "user": "Brd-Bttr", "date": "April 13, 2013", "id": 157648355}, {"rating": 5.0, "title": "Great hotel- will definitely stay again!", "text": "Plenty of eateries abound. Rooms were nice and no complaints. Breakfast is the usual fare. It does the job.", "user": "glovermelinda", "date": "April 8, 2013", "id": 157053972}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Recently stayed at this hotel. It was wonderful. Our room was a 1 bedroom with a fireplace. The room was \"Just Beautiful\". Thank You.", "title": "Just Beautiful", "helpfulness": 1, "user": "Jebr2010", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148923297}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The lobby is so nice. There is a room that looked like a quiet library/living room . I used that to work on their computer so it was very comfortable. We used the safe deposit boxes available even though everything felt very safe. The market was a nice idea to have as we decided on a little snack so very convenient. Every staff member was very friendly from the housekeeping to the front desk. We did not use the pool or fitness center. I also did not use the outside patio because of the weather but it looked very nice. They breakfast was just ok THe OJ was so watered down one morning, everyone was throwing it out. Next day it was much better. Each morning we ate next to the fireplace near the breakfast tables, so that was really nice. The hotel is behind a mall so nice and quiet even though 95S is close to access it. I would definitely recommend this Hotel!!!!", "title": "Great place to spend the night or a few days!", "user": "kenmar84", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148626829}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We stayed here on our way home from South Carolina and glad we did. Our 2 bedroom suite was perfect in every way, well provisioned, clean, and generally quiet(see note below). The hotel was hard to find, however, using our GPS, but the location is terrific: close to highway, movie theaters and a great shopping mall. If I had any criticism, it would be the breakfast. We ate at about 8:30 and the place was messy and needing attention. Very long line for waffles, so we gave up. But their orange juice was the best I've ever tasted! Shirley Marie at the front desk was exceptionally friendly and helpful.", "title": "Thanks for the great follow through!", "user": "Johnmcgroarty", "date": "November 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146343786}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "In our previous stay this year we had been disappointed by the lack of a decent breakfast tea and made it known in our review. We were contacted directly by management quickly that they would correct the situation. Well on our recent two stays here that was in indeed corrected as there were two different black teas in the breakfast area and everything was perfect. Congrats for the excellent follow through and proud to be a Marriott customer!", "title": "Great place to stay!", "user": "TerryRochesterNY", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144950006}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed there recently on our way to Myrtle Beach. It is right off I-95 but hard to find, that's my only criticism. However, the place is beautiful, the staff is great, and the location to restaurants, etc. is great.", "title": "Lights Out !!!!!!!", "user": "JaeIsFocused", "date": "November 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144517203}, {"rating": 4.0, "title": "Beautiful hotel, but very noisy depending on your location", "text": "My family stayed in a two bedroom suite for a soccer tournament. The rooms were very nice and the suite area with a full kitchen and table was very clean and homey-feeling. The continental breakfast was good with both hot and cold food choices. The location of the hotel is right next to a huge mall which can be both a pro and a con. On the positive side, we could walk to nice places to eat for dinner and shopping, on the negative side, we had to drive in circles around the mall to get to the hotel. The hotel is also located right off the highway which makes access easy, but unfortunately, our suite faced the highway and the road noise was horrific all night long. Make sure you request a room that DOES NOT face the highway if you are a light sleeper or you'll be a bear (like I was) the next morning.", "user": "SalemToesocks", "date": "April 5, 2013", "id": 156685606}, {"rating": 3.0, "title": "It was okay...", "text": "The rooms were spacious. The breakfast was not good, though it was free. There are no ice machines. The man at the desk said his ice machine was broken. He said the refrigerator in the room could make ice, but that doesn't help me now. The sofa had something spilled on it that should have been cleaned off...heater is REALLY loud.", "user": "Gabriellii", "date": "April 2, 2013", "id": 156439647}, {"rating": 5.0, "title": "Fantastic Accommodation", "text": "This is a new hotel behind a shopping mall. It took us a few trips around the circle in the mall to finally realize where it was. It was worth our patience. We had a suite which is the same price as a king room: 2 bedrooms, 2 baths, 3 tvs. I thought the front desk had made a mistake. The very nice young man at the desk made a restaurant suggestion for us--I think it is named Firegrill or something like. that. We should have realized that it was Valentine's day. The wait was 2 hours. We walked a little bit away and came to Bravo--the wait was only 45 mins. The food was good. and the place is pretty. I would prefer to stay somewhere I can walk into a town, but I would definitely stay here again. I love the breakfast at the Marriott Residence Inns and with parking included, this beautiful hotel was a bargain.", "user": "6Miles01", "date": "March 4, 2013", "id": 153687008}, {"rating": 4.0, "title": "Road trip South- nice place to stay!", "text": "New hotel located right off the highway- except figuring out how to get there was a bit of a challenge. Our google maps brought us via long way which was a bit sketchy, but once we arrived- it was worth the inconvenience. Hotel is new and in great condition. Front desk service was a little unfriendly, but didn't care since we were only here for the one night. We would return here.", "user": "islandmap", "date": "February 16, 2013", "id": 152301640}, {"rating": 5.0, "title": "Overnight stop Fl- NY trip", "text": "This is a fairly new VERY nice motel. Upscale decor( granite style) in bathroom area and kitchen space. Spacious,comfortable and clean. Very nice staff.", "user": "snowitek", "date": "February 4, 2013", "id": 151380300}, {"rating": 4.0, "title": "So Close to the Action. Very Clean and New.", "text": "If you are visiting Fredericksburg or just passing through, this is a great place to stay. It is right next to the highway (this is the only reason I could not give it an excellent, as it was kind of noisy and I live on a quiet island), so travelers can access it. It is close to restaurants, a movie theater and bowling alley. Also it is only a few miles from downtown Fredericksburg and other historic sites. There is free parking and breakfast, which was refilled even when you come down a bit late. The room is spacious and clean and because this is a newer property I did not get my customary puffy eyes. Highly recommend.", "user": "Born_to_go61", "date": "January 30, 2013", "id": 151008389}, {"rating": 5.0, "title": "Loved our stay!", "text": "Clean, friendly, great location but a little hard to find. However, now that we know where it is we will be back again and again. Matt was wonderful. Room is clean and tastefully decorated. Mall is right nearby. Love the stores and restaurants. Wish we could stay longer:(", "user": "madotz", "date": "January 27, 2013", "id": 150787591}, {"rating": 5.0, "title": "Really NICE !", "text": "We have been trying several Marriott hotels during this vacation and have been very pleased especially with this last stay before we reach home. This was a first for us at a Residence Inn and it was a very pleasant stay. We found this hotel modern and tastefully decorated and super clean. Comfortable suite with all the amenities and comfortable beds. Staff was very friendly and helpful. It would be nice if there were more signs directing you to it though ! it is well hidden behind the mall.", "user": "Vacalot", "date": "January 26, 2013", "id": 150703558}, {"rating": 5.0, "title": "mila2420", "text": "I travel frequently to Fredericksburg, and have tried alot of hotels there This one is by far the best not only in the accomodations which were excellent but the customer service and friendliness were just off the chart. Everyone had a smile and a greeting and just wanted to please. Outstanding place. Within close distance to everything. This will be my only destination from here on out when I stay in Fredericksburg.", "user": "JohnH H", "date": "January 20, 2013", "id": 150125586}, {"rating": 3.0, "title": "Power Problem But Stay Still Nice", "text": "Stayed another 4 nights at this location. Furniture is a little older, but the hotel for its age is kept up well. I checked out the jacuzzi and it was in great shape along with the treadmills in the exercise room. It is conveniently located next to the mall with plenty of shopping and restaurants to eat at. Service was great and friendly staff. Once again I was on the top floor as requested. This trip however we had a situation one night late (around midnight) when the power went out. The only reason I woke up was t from the clicking sound my heater was making and the room was a little colder. I called the front desk they explained the situation and i crawled back under the covers and went to sleep. ;) The hotel immediately went to backup power which allowed lighting to work still in my room. The outage was no fault of the hotels, and everything went back to normal the next day. Something about the power company, and it was right after Hurricane Sandy which might have been a contributing factor. The elevators were still non operational the next morning. But I take the stairs anyway. I mentioned that to the front desk and went off to work. I would recommend and stay there again even with the hiccup. Thanks for reading. Video on Youtube Channel.", "user": "RetiredArmyRANGER", "date": "January 18, 2013", "id": 149992521}], "location": {}, "stars": 3, "variance": {"poor": 5, "average": 11, "very good": 31, "terrible": 0, "excellent": 79}, "aka": "Residence Inn Fredericksburg Hotel", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}}