{"user_rating": 4.0, "review_count": 133, "name": "Residence Inn Norfolk Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "When it comes to hotels new is nice. This is one of the most modern, trendy Residence Inns I have stayed at. The rooms are well appointed with very stylish furniture, kitchen, bedding, and the bath. Not to mention the two flatscreens. In room internet is top notch. Other hotel chains could learn from this hotel what \"high speed\" is supposed to mean.", "title": "A review from your extended stay business traveler", "user": "Chase71", "date": "November 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87623653}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Location is excellent. Walking distance from \"Granby street\", the dining/pub segment of downtown Norfolk.", "title": "Beware: don't let them trick you into paying to park on the weekends", "helpfulness": 1, "user": "croelin1000", "date": "October 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84911638}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The only down side I could give this hotel are the evening meals. They are Tuesday - Thursday and are in need of some improvements. The meals can be at times a bit lacking. One week they had the exact same entree two nights in a row despite having different meals listed on the calendar.", "title": "Frustrating", "user": "shauntae201", "date": "August 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 75603000}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The indoor pool and workout center are top notch for this type of hotel.", "title": "Great Choice", "helpfulness": 1, "user": "yumyum90", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75465899}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Everything was fine at this hotel (what I expect from a Residence Inn - it delivered. Big rooms, with kitchen, wonderful breakfast, good location).", "title": "Great rooms and fantastic breakfast", "helpfulness": 1, "user": "Lisa226", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74190391}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "We stayed two weeks ago at this hotel. First the reception and check-in was great. I was provided tourist info, the number for the Norfolk F.R.E.D free car service (they pick you up at the hotel and drop you off wherever downtown), and an early check-in (I badly needed it for health reasons and previously requested for it while booking on expedia).", "title": "Great atmosphere, brand new, clean room, helpful staff!", "user": "Inesella", "date": "May 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65151471}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Then as you can judge by my pictures the room and kitchen were spotless. I wish my kitchen was that clean ;). . Free high-speed Internet (with the provided cable ) worked fine. You have flat screen TVs in the bedroom and living room.", "title": "My new first choice in downtown Norfolk", "user": "Pb650", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 64659686}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Only downsides:", "title": "Great Hotel, Good location, Very large accomodations", "user": "sleepyje", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63866543}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "- there were amenities for 1 person only.", "title": "Great Customer Service makes for a Great Hotel", "user": "brohustler", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63147814}, {"rating": 4.0, "title": "Great newer hotel", "text": "- hallways on the floor were a bit cool (it was however raining that day)", "user": "speksy", "date": "April 14, 2010", "id": 61302995}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I spent 6 wks on a business trip in the hotel, and I felt so welcomed. Front Desk Staff, Housekeeping Staff, Maintenance Staff, Breakfast Bar Staff were warm and polite. The free hot breakfast each morning is great, but the free \"dinners\" weren't as tasty. It was still a nice perk. The room was large and comfortable. I didn't like the flat-top stove in the room. It took me forever to cook scrambled eggs for some reason. I loved the restaurant 4-5-6 Fish; expensive but good food. Todd Jurich's Bistro was even pricier ($110 for appetizer, salad, lobster, dessert and 1 glass wine) but good. Wouldn't go back, but glad I went. FRED is a great service for hotel guests; the city of Norfolk provides a FREE battery-operated car ride from the hotel to other downtown locations. The drivers were all wonderful, and they told me that they are not allowed to accept a tip. You call FRED (or the front desk can call for you) they pick you up, drop you off. Then you call again to have them pick you up to go back to the hotel. It beats finding parking in the area. I have a horrible sense of direction, so one drawback to this hotel was that there's a lot of construction with closed streets, and I got confused driving in my car. The construction is for the sleek rail system that will be operating in 2010. I would HIGHLY recommend the hotel for lots of reasons, but for me, the wonderful staff is the most important reason of all.", "title": "Fabulous Staff, Beautiful Room, Great Jacuzzi", "user": "anitag18", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51363512}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Intro", "title": "Lovely Lobby Layout and Suites!", "user": "bagsalwayspacked", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50240637}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "We just spent three nights over Thanksgiving at this hotel and loved the lobby and the suite. The architecture is refreshing with bright modern colors and surfaces that invite you to have a seat and strike up a conversation with a person sitting nearby.", "title": "Best Customer Service", "user": "sardodge", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49897298}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Selection of this hotel", "title": "Yes it's new and clean BUT thats where it ends", "helpfulness": 1, "user": "Momwrldtravlr", "date": "September 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 4.0}, "id": 42164839}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "We have been traveling to Norfolk on business for about 20 years, and began staying at Marriotts 5 years ago. Normally we choose the Marriott Waterside because of its location and wonderful views. We could not resist the holiday rate of $89. a night including a hot breakfast and a light dinner. We are glad we tried this Residence Inn because it was a pleasant stay with clean, modern surroundings.", "title": "The inmates are running the asylum", "helpfulness": 1, "user": "ghostwriter6699", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 5.0}, "id": 40228279}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "On my last trip, I stayed at the Sheraton Waterside, but this is now my first choice hotel when in Norfolk. I arrived at 10PM on Saturday night from San Francisco, very tired. I felt as if I was being welcomed home. The evening staff was teriffic, very accomodating, and made sure I had just what I needed. The hotel is about a year old; my room was on the 7th floor. Elevators arrived quickly, I didn't wait long at all, even though the hotel was sold out. The rooms are suites with full kitchens, stocked so I could make lunches and dinner. Pets are welcomed for a cleaning feel. There is an indoor pool, jacuzzi, and workout room on the main lobby floor. Breakfast and internet are included; parking for a fee in the garage across the street with in and out parking for 24 hours. After my experience the first night, I cancelled my reservation at the full service Sheraton Waterside, and continued my stay here. Why stay anywhere else?", "title": "Why would you stay anywhere else when you have the Residence Inn Downtown?", "user": "ImluckyRN11", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72800605}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I were looking to have a weekend getaway to celebrate our anniversary. We picked Norfolk for two reasons: 1. It was not too far to drive from MD and 2. We had never been to Norfolk. We are Marriott timeshare owners and use Marriott exclusively when we travel. We always leave satisfied. So we chose a Marriott property. We found this locatioin.", "title": "Very nice stay.", "user": "justwantstotravel", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 72096333}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "First impression was a bit off putting driving into the city. Like any major city, the outskirts seemed run down and I was concerned that downtown would be like this. I was wrong. It was very nice. Quaint. Clean, Quiet and Safe. We walked everywhere we went in town and never felt ill at ease.", "title": "Enjoyable Stay", "user": "mcrae006", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70371109}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I stayed at this Residence Inn for 2 weeks while taking a training course at the Naval base. It is by far the best hotel I have been to, including any since. The 1 bedroom suite was huge, completely clean, and the view from my room was nice. The internet is as fast as my own at home. Having a TV in the sitting area and the bedroom was a really nice touch. The breakfast was also good, as were the receptions they offer on certain nights. I also had the good fortune to have a corner where there was nothing around me except the maintenance room on one side. Try to get one of those rooms, I heard absolutely nothing despite the hotel being full.", "title": "Near perfect stay.", "user": "jmh21078", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88648714}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Because of the amazing service I had, I will be returning in April 2011 when I have another training course. I recommend this to everyone!", "title": "Good Location, Very nice hotel", "user": "billsays", "date": "November 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 87822774}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Let's get the first part done here that most everyone agrees with: modern, clean, extended stay hotel in an excellent location.", "title": "A review from an extended stay traveler", "helpfulness": 1, "user": "Chase71", "date": "April 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103095961}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "This is my third extended stay and I'll post the most important comments:", "title": "It was one of the nicest room we have ever stayed in.", "user": "tootsie045", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102699520}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "1. Evening meals. The hotel publishes a calendar posted in each room that lists the nightly meals. But what ends up being served can be very different. Substitutions end up being served and one night it was supposed to be Ravioli and only a salad was actually served. However you word it the evening light meal service still need some quality improvement and fine tuning.", "title": "Everything about my stay was GREAT!", "user": "jeffsam", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99679528}, {"rating": 2.0, "stay_parameters": "Stayed March 2011", "text": "2. Internet. I gave props to this hotel for having very fast internet service while other chains tend to low ball their so called \"high speed\" internet service. To my disappointment this hotel has implemented a tiered service that provides just adequate service for free and two higher speed paid levels at a much higher daily additional charge. Some may see it as a choice. I see it a margin building initiative. Or a better word:: nickel and dimeing.", "title": "No Heat", "user": "morebeerplz", "date": "March 2, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 98726663}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Overall a great choice for short and longer term stays in the area. Excellent front desk staff and managers.", "title": "Wonderful Stay in a Dog-Friendly Hotel", "user": "jamajill", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96881190}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My boyfriend and I live in Richmond, VA and came to Norfolk to see Jerry Seinfeld perform on a Friday night. We arrived at the hotel around 4:30pm and parked in the lot across the street. Parking is $15.00 and is added to your bill. We checked in quickly and went up to our room on the 7th floor. Our room was awesome and we had a great view of the city. A large room with a king sized bed, a living room area, a huge kitchen and nice bathroom. The bed was really comfortable and we slept well considering you could hear the sounds from the street below. The bathroom was well stocked with nice large towels, bigger than the ones you typically get in hotels. We ate dinner at 456 Fish. They have amazing food but the prices were a little high. Make reservations because they fill up fast! There are many restaurants located just a block away...maybe 5 minutes walking briskly. Chrysler Hall was where Jerry Seinfeld was performing and that was within walking distance as well. The hotel staff was very friendly and accommodating. In the morning, we went down for breakfast at 7:30 and they had said there was a \"hot breakfast\". There was nothing hot. We asked the front desk about breakfast and they said the chef wasnt there. That was the only thing that we were unhappy about, but it was minor to us. Everything else was awesome and we will definately come back!!", "title": "Awesome!!", "user": "karenleigh83", "date": "March 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57969599}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I will divide my review into three areas and based on 2/3 getting a poor rating, I would not recommend this hotel.", "title": "Do the Pros Outweigh the Cons?", "user": "Spillthemoment", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 2.0, "rooms": 5.0}, "id": 54473817}], "location": {"country": "United States", "city": "Norfolk"}, "stars": 3, "variance": {"poor": 10, "average": 7, "very good": 45, "terrible": 3, "excellent": 68}, "aka": "Residence Inn Norfolk Downtown Hotel", "slim_ranking": 0.125}