{"user_rating": 4.0, "review_count": 95, "name": "Residence Inn Albuquerque North", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Excellent location to all surrounding areas. Easy access to I 25 and Jefferson Blvd was a main side road to balloon fiesta and casinos. Rooms were clean, comfortable, and nice size suite. All staff from the front desk to housekeeping were very accomodating. Breakfast every morning hot and fresh complementary as were the evening appetizers. Several franchise restaurants located within walking distance. Would highly recommend checking it out.", "title": "Excellent location to all areas of the city", "user": "Dave-MarciaH", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 84162262}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Dave-Marcia H", "title": "Had a wonderful time staying at this...", "user": "lgkris1394", "date": "October 15, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 83651056}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Had a wonderful time staying at this location. My kids loved the pull out bed, and the breakfast was wonderful!", "title": "well run and a great value", "helpfulness": 1, "user": "zooiet", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82253048}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Our room was clean and bright; breakfast was very pleasant. This was a very well managed facility and the staff were both cordial and efficient.", "title": "Below average Residence Inn", "helpfulness": 1, "user": "JenP75", "date": "August 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 77357843}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I stayed in quite a few Residence Inns this summer, and this was one of the most problematic. The people working there were not particularly friendly, and the hotel seemed old and run down even though it is supposedly relatively new. It has a no smoking policy, but my room had the distinct smell of smoke, and then the horrible smell of all the cleaning products that had been deployed to cover the smoke smell. They also have a terrible television lineup, and they subscribe to Showtime and not HBO - who does that? They are right off the highway, and have restaurants like PF Changs nearby. I don't know what the other Residence Inns in the area are like, but I would try another hotel before I'd go back to this Residence Inn.", "title": "Nice Hotel", "helpfulness": 1, "user": "artyalex", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71408511}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This hotel is nice... but that is not what made my stay. The staff is AWESOME. They treated very nice. A hotel can be brand new or 20 years old, but it is the staff that makes the hotel great. Not sure if I will be back in Albuquereque... but if I am I will stay at this hotel.", "title": "Nice Hotel... Great Staff", "user": "crymdogd", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109715627}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Spent 3 nights at the Residence Inn Albuquerque North. Used Trip advisor to choose this hotel. Check in was friendly and fast. Rooms were updated and clean. We had a 1 bedroom suite. Both livinig area and bedroom had flat screen televisions. The kitchen area had marble counter tops, and appliances were up to date. Complimentary breakfast in the morning starts at 6am on weekdays, 7am on weekends. Very good. This hotel is just off I-25. You notice the noise from the interstate when at the pool, but otherwise, no issues. Very convience to plenty of places to eat, upscale to fast food. Only downside was the high speed internet service was far from \"high speed\"! Very slow. However, I would definately stay here again.", "title": "Great Choice-Perfect location", "helpfulness": 3, "user": "james5171", "date": "May 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108645899}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "We had a 1 night stay in the 2 bedroom, it was perfect, I did sleep on the sleeper sofa, it wasn't bad at all, we really liked that as soon as we walked in you can smell the cleaniness. Breakfast was good too. I've stayed in a lot of high dollar resorts and this place was really nice.", "title": "Great Place to Stay", "helpfulness": 2, "user": "Mandy5848", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98307175}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My husband and I stayed here with our cat for more than 2 months as we were house-hunting and finalizing our home purchase. Loved staying here. The facilities were great with laundry on site and practically a full kitchen (except no oven). The carpets and linens were new and fresh, styling was contemporary. The staff was warm and welcoming, especially the front desk staff. They accommodated every request, and even allowed us to maintain our rate throughout the otherwise expensive Balloon Fiesta season because we'd been staying so long. Most importantly to me, the staff honored our request to stay out of the room unless requested so as not to scare our kitten. We did ask them to come in once to fix the dishwasher and another time to work on the smoke detector that was beeping, but otherwise, they honored our privacy and respect. The included breakfast was just right, dinners were good as starters (though hardly nutritious), and the hot tub and swimming pool were frequent escapes. Quiet. We've become longterm Marriott fans since this stay.", "title": "Home away from home for 2+ months", "helpfulness": 2, "user": "mikenmickey", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96487114}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We stayed at this hotel for one night on November 20th when we passed through Albuquerque on our way from Denver to Phoenix for Thanksgiving. We put the address into our GPS and found the hotel easily.", "title": "An unexpected surprise.", "helpfulness": 2, "user": "MileHighGirl", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88369786}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We started with a 1bd but DON'T count on using the sleeper sofa as a bed. It had a 3 inch box spring type \"mattress\". Another room had the same. The next night we moved to a 2 bd which was nice. The 2bd had 3 flat screen tv's,full kitchen that we didn't really use other then the fridge. The continental breakfast was ok. Bagels/english muffins -no taste, waffles, yogurt, fruit were good, also had eggs, potatoes and meat. We didn't get to use the pool because someone was outside next to the pool smoking and my DD has asthma. We also tried eating breakfast outside which would have been nice, but again people stand right outside the main door smoking. The beds were comfy, quiet room, I slept great.", "title": "Stayed 4 nights", "helpfulness": 1, "user": "RJMom08", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71232084}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Went to the Gathering of Nations Powwow the weekend of the 23rd and this was a great place to stay. Check in was fast, plenty of parking, great places to eat within walking distance.The only issue was setting air conditioning to a good setting. The breakfast was great and the room was clean. I would recommend this hotel to everybody....", "title": "Gathering of Nations powwow", "helpfulness": 1, "user": "jcottonwood", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 62805514}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The room was great, the staff were great, everything was fine. Would love to stay there again.", "title": "friendly stay", "user": "ganotrill", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 60768967}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This Residence Inn is quite up to date, with modern decor, flat screen TV's and an excellent breakfast area. The breakfast was very good also. Clean, neat and well run -- a very good choice.", "title": "Very Nice", "user": "JimParkRidge_IL", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49832477}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I was looking for a hotel near to the balloon festival park that would accommodate my husband and I and my Dad. I have always found the Residence Inns to be a great place to stay when you want the convenience of 2 rooms and a living area to share. We weren't disappointed. The location was great to attend the balloon festival. We took the bus from Cliff's Amusement Park to go to the balloon feista. It was great as Cliff's always had the shortest return lines. We were up early each morning and they did put ot a few breakfast items for those that were leaving the hotel by 5 a.m. There are at least 5-6 restaurants within walking distance of the hotel. I would highly recommend this hotel if you want to stay close to the balloon feista park.", "title": "Great Location to go to Albuquerque Balloon Festival", "user": "96traveler", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47947447}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "On this trip we stayed at five hotels in New Mexico and this was the nicest one in terms of service and quality. When I needed toothpaste and deodorant the hotel provided it free of charge.", "title": "Nice Hotel, Friendly Staff with a Few Extras", "helpfulness": 5, "user": "DCSacramento", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118003184}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Check In- I was greeted warmly by two elderly gentlemen while checking in. They asked my room preference, thanked me for being a rewards member and asked me if I needed any information about the area.", "title": "Made Relocation a Little Easier", "helpfulness": 4, "user": "hdblue", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112987683}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The Lobby- The lobby is pretty standard. There is a nice room with a fireplace, tv and internet access off to the side. Everyone was considerate of time in using the internet unlike my experience at the Sheraton Uptown in the same City.", "title": "Highly recommended; would stay again", "user": "EastCoastTraveler19", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112657713}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Room- It is a slightly older model Residence Inn. However the room was spotless and on the third floor. It was the one room suite with a sofa sleeper. My bed was comfortable and the room was quiet. The kitchen had all the amenities I could ask for if I needed to make dinner.", "title": "Close to many restaurants and Hwy 25", "helpfulness": 3, "user": "jtf98", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 110825708}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Breakfast- The breakfast was excellent. A good variety of hot and cold items. Fresh fruit was also available. The attendant was also very friendly.", "title": "This was a great place for seeing Albuquerque", "helpfulness": 2, "user": "goofyhome", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110442015}], "location": {"country": "United States", "city": "Albuquerque"}, "stars": 3, "variance": {"poor": 5, "average": 13, "very good": 33, "terrible": 1, "excellent": 43}, "aka": "Residence Inn Albuquerque North Hotel", "slim_ranking": 0.2, "description": "Few hotels in Albuquerque offer the comfort and convenience of the Residence Inn Albuquerque North located near attractions and popular restaurants. We are immediately accessible to I-25 of Jefferson near I-40. We are surrounded by over 20 restaurants and lounges including PF Changs China Bistro, Fox and Hound Sports Bar, Twin Peaks, Mimi's Cafe, Allure Bar & Grill, Texas Roadhouse, Fuddruckers, Boston's Pizza, Landry's Seafood, Red Robin, Olive Garden, and much much more! There is something for everyone! Complimentary Evening Social for hotel guests is available from 6:00pm - 7:30pm Mon - Thur."}