{"user_rating": 4.0, "review_count": 595, "name": "Residence Inn Lake Buena Vista", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Here for a week. The staff is first rate, from front desk to restaurant. Nice pool and outdoor facilities. House keeping is very good and the room very clean. Televisions could use an update though, still have a VCR under the set. I like this place and look forward to visiting again.", "title": "Nice Property", "user": "MikecDallas", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54120321}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I stay 70+ nights a year at Residence Inns, and this place was way below average in most respects. The check-in experience was subpar. The first night I tried to cook a pizza in the oven, but while the oven was preheating, the room filled up with so much smoke that I had to turn it off - the oven obviously had not been cleaned in a long time. I called front desk and asked them to clean the oven the next day. Two days later I tried to use it again, and it had obviously not been cleaned at all. I called the front desk again and asked (again) for the oven to be cleaned, and they said they would send someone up right away, which they did (note that I did not receive an apology). A housekeeper appeared half an hour later with a can of oven cleaner and asked me what I wanted her to do. I shrugged and said \"Clean the oven\"? She asked me how, exactly, she should do it, and pointed out that the oven was warm, and that maybe it could be dangerous to do it while the oven was warm. She seemed annoyed at having to be there at all, so I said that it was fine with me if she came back in half an hour, but that got her even more irritated, since she informed me in no uncertain terms that she would be on her way home in half an hour. I then read the can, and showed her that it says on the can that the oven can be hot, but she said she might burn herself. So I opened the oven and carefully and quickly put my fingers on the heating element to see how warm it was, and then informed her that it was not that hot. She said that she couldn't take the risk, at which point I wrapped my hand around the element and held it there. After 10 seconds she rolled her eyes and said \"OK\", and started looking like she was preparing to actually - horror of horrors - clean the oven.", "title": "Bad Housekeeping, avoid", "helpfulness": 1, "user": "hyslopc", "date": "January 13, 2010", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 53409285}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "At that point I grabbed the kids and we headed down to the pool, but we couldn't get into the pool - our card didn't work. We went to the front desk and explained that the pool gate wouldn't open, and they said that the pool gate we had tried often doesn't work, so just to try another. I was a bit stunned, but did as they said, and sure enough, the problem was with the gate. This problem persisted during our entire 2-week stay - they didn't bother to fix it. However since it took much longer to go around to the other gate, my 5-year old son came up with a solution - he could easily reach through the gate from underneath, and open it from the outside. Safe, eh? A 5 year old can open the gate and let himself into the pool area without an adult - mmmm.", "title": "Two words : Bed Bugs", "helpfulness": 2, "user": "Rosemary500", "date": "January 3, 2010", "detail_rating": {"location": 4.0, "service": 4.0}, "id": 52465838}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Once we got back to the room, my wife threw a pizza into the oven, but after 10 minutes we realized that our oven cleaning saga was not over - the room filled up with smoke. So no pizza that night - again. I called the front desk, who noted the problem and said they would fix the problem the next day (again, no apology - I'm just a Marriott Platinum member, who cares?). I was so disgusted that I took a photo of the oven, which had been completely sprayed with oven cleaner, but had not been wiped down, but I can't get the photo off my camera until I get home (will try and post it later). I could have gotten down on my hands and knees and cleaned the oven myself, like I do at home, but hey - isn't that why I'm staying at a hotel on vacation, to avoid having to do stuff like that?", "title": "great place", "user": "CanadianOkeh", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52121926}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The next day they actually cleaned the oven (yippee), however the day after that housekeeping didn't show up at all. We didn't bother complaining. We're a family of 5, and since there were only 4 plates and sets of cutlery (despite the fact that we booked the room for 5 people), had brought up additional plates and cutlery from breakfast. They disappeared. Again, and again, and again - despite repeated calls to front desk, asking them not to take them. Housekeeping also threw out things which weren't trash - repeatedly, even when we hid them behind the TV, in a futile attempt to avoid the problem. Nothing really important, but just stuff we didn't want thrown out. Finally we asked to talk to a manager about all the problems we had, and after that, housekeeping stopped taking out trash that we put under the sink next to the trash bin, which wouldn't fit in the bin - groan.", "title": "What we've come to expect from Marriott", "helpfulness": 1, "user": "journeypaul", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52028155}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We just returned from our trip to Walt Disney World for 4 days. We stayed here for 3 nights. The breakfast in the morning is great and easy. The location to everything was pretty good. There is a grocery store right around the corner which was great. Nice reception from 5-6:30 too, with beer and wine. The downsides: our room had this constant odor (we never complained about it at the front desk, we just kept spraying nice smelling sprays), the walls weren't clean, the bathroom door had some weird stains, I just wiped them down myself before my kids came through. The towels down at the pool were kind of a joke, they were just bigger than a hand towel. We found that kind of humorous. You can also get to your room through the courtyard where there is a beautiful pool. But don't walk through after 10, then you can't get into the building. You then have to walk back through the main lobby and back around. Which is fine! But they don't tell you that. We even walked right by the front desk, where the receptionist was, and said hello, walked out to the courtyard to go to our room and she said nothing. We had to turn and go back around. They should have signs by the doors that you can't get completely through after 10. Just a thought! Not sure if we would stay here again.", "title": "Just OK, kind of older rooms, but OK for the price.", "user": "kitkat51", "date": "December 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 50584802}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed here for our son's birthday trip to Disney World. We researched the hotel online and saw the great reviews so we were excited to get a 2 bedroom residential suite. Needless to say our troubles had just begun! We checked in and went to the room they assigned- where my toddler son found a condom wrapper on the side of the bed, and a hand towel that was wadded up on the bed next to the condom wrapper. Also, every time the door to that bedroom was shut the small closet to I believe the heater? opened with dirty q-tips laying on the floor. So we decided not to leave and give the hotel another chance... we understand sometimes housekeeping does NOT do their jobs! Second room, different level-we go in and their is a VERY strong chemical odor, we could not figure out what it was other than my husband being told the carpets were recently cleaned and maybe it was the chemicals used to clean the floors. We decided that we would not complain and just open the windows. After being in the room for about 20 minutes we all started feeling faint, had very bad headaches and felt nauseous. My toddler decided that he would take off his shoes and he immediately said told us that his feet were wet. Huh?? So we took off our sandles and sure enough the carpets were soaking wet!!!! I guess the concierge had forgotten to mention that the carpets were JUST cleaned!! Finally after my husband calling down to front desk and complaining that now we were in our second room and hello?! They then put us in another room on again another level and everything seemed perfect...after 2 and a half hours of switching from room to room to room we finally made it to downtown disney right at dinner rush. When we got back to the room we had a message to call down, they gave us a free night which made us feel alittle better, and brought us a large goody bag with wine and food. After waking up and packing up to leave Orlando my sister pulls down her sheets to make sure she didn't leave any phone accessories and what does she find?? A pair of earrings that were NOT hers or any of ours! We we're disgusted, but what else could we do? We will not be staying at this hotel again! Our relative that works for Marriott could not believe what we told her, in her exact words we should have been given both nights free. All of us had terrible headaches all night from the chemicals that were used to clean room # 2.", "title": "Not clean, got put in 3 different rooms due to uncleanliness", "helpfulness": 1, "user": "heathermark28", "date": "November 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 50240550}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed at the Residence Inn Lake Buena Vista for 6 nights at the beginning of November while we were visiting Disney World. It's about a 15 minute drive to most of the Disney theme parks from the hotel. The multi-cultural staff was very friendly and cheerful, and most of the other guests we met in public places seemed to be happy.", "title": "Awesome staff!", "user": "cull_family", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49602048}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "For those of you who like to travel with your canine friends, we saw plenty of dogs at this hotel. But my one recommendation is that if you have to use a computer while staying here, bring your own! The two computers available for guest use were always in demand, and one of them had a virus, which a staff member was trying to fix all week long.", "title": "Very Accommodating", "user": "LCXY", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49407556}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We were very happy with our stay at the beginning of Nov. As Marriott members we were given the courtesy of an upgrade which we appreciate. The rooms are spacious and clean. If you have more than 2 people the living area seating would be a little uncomfortable. The staff was very welcoming. They asked if we were happy with our room and when we said we'd like a larger one they found us another one. It is convenient having the hot buffet breakfast available. Also, having the flavored water at the check-in desk, especially after a busy day, is refreshing.", "title": "It is ok for the money", "user": "jim_bowler", "date": "November 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 48851114}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "After checking out of the Ritz Carlton due to my wife's conference being over we checked into the Residence Inn using Marriott points I accrued. We were allowed to check in early to our family suite.", "title": "A comfortable stay", "user": "moogie14a", "date": "November 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 48401027}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The family suite consisted of one bedroom, a living room with kitchen, and then also a seperate, not walled or doored, area for the kids. It was a bigger suite then I thought we would have and was suprised.", "title": "Perfect Place to Stay", "helpfulness": 1, "user": "travelchick1", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48269505}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Residence Inn is off of Palm which is close to downtown disney hotels and shopping area, it is about 15 minutes away from the Disney World area and Seaworld. It is about 20 minutes away from the airport. Although nothing is \"next\" to the hotel, there is stuff within a short driving distance. The closet Walmart is on Palm, the hotel directions say 2.5 miles, it was closer to 4 miles away, which is still not so bad.", "title": "Very Mediocre, would not go back.", "user": "MissMouse1928", "date": "October 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 47283281}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I like the Residence Inn for the free parking, free breakfast. We were not around for the free manager receptions. The pool is open until 10 pm. I didn't find the breakfast to be overly busy, I did find that some of the guests were in a rush and woofing down their food and trying to get in and out as fast as they could.", "title": "Must stay at Hotel", "user": "buffy333Florida", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46626602}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "We were there on Halloween and our kids did get to trick or treat, starting at the front desk, and then we moved to downtown Disney.", "title": "Good value for the location", "helpfulness": 1, "user": "stephm0188", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 46316312}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "As part of a recent trip to Orlando I stayed in six different motels. The Residence Inn at Buena Vista is an older facility that is beginning to show some signs of age and in need of minor cosmetic repairs. The facility handles an extraordinary number of families all that appear to be going to Disney World. My room on the third floor was smaller than most residence inns but spotlessly clean. The breakfast room appeared more like a military mess hall in size and great efficiency. A huge facility but well stocked with a variety of meats and choices for breakfast. All done exceptionally well considering that there are upwards of 150 people sitting there at any one time.", "title": "What A Difference A Good General Manager Makes", "user": "DCSacramento", "date": "March 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58145669}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "What sets this Residence Inn apart from all others was the courtesy of the staff and the General Manager. The current general manager, Maria Martinez, came here recently from Denver. I met her while she was serving coffee at breakfast. She went from table to table to meet guests and was genuinely interested in what her guests had to say regardless of age or appearance. A general mangager extraordinaire. The entire staff echoed that same friendliness from the maids, the repair people, and the front desk. All extremely professional and helpful. I have no doubt that this facility will become even more popular as the months progress.", "title": "Perfect Spot for Disney World Vacation", "user": "Texantt", "date": "February 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55835194}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This was our first trip to Disney World and couldn't have gone better. The free breakfast was perfect with something for everyone. We rented a car and drove the 5 miles each day to the different parks. At night we would stop by the Qdoba or any other restaurant/fast food place on our way back to the hotel. This really helped with food expenses! The hotel pool was fine, but we only had time to check it out once. Rooms were roomy and typical of RI. 2 bathrooms seemed to help in the mornings with kids. When visiting Disney World, you really only need a hotel as a \"complement\". This was the perfect complement!", "title": "Hidden Gem, Outstanding Service", "helpfulness": 1, "user": "aander927", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55171065}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I love Residence Inns because of their high quality, reliability and no surprises. Lake Buena Vista Residence Inn is no exception. The well-kept grounds with tropical plants and trellis, beautiful spa/pool/fountain area, clean spacious guest rooms, sumptuous breakfasts, and a tireless front desk staff who attend to your every need, all add up to a rewarding experience with each stay. The front desk is anchored by Guest Services Manager Lexy Bapst who not only ensures reservation accuracy per your request, but constantly checks to ensure the accommodations and hotel are meeting your needs. The breakfast staff is also tireless. On one occasion they ran out of an item as it was close to closing time for breakfast. A staffer asked what I needed, and proceeded to prepare a fresh batch of the item. Now that's what I call service. This hotel stands out as one of the best, because of the quality, service, and a very attentive staff.", "title": "Great price, great room, great location.", "user": "hinges", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 55091849}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "this hotel is right near everything. Easy access to the highway, and \"I Drive\" and Disney are very close by. There are also a variety of restaurants from all you can eat to top end. If you absolutely are intent on gettin downtown, the cab ride is about $30-$35 so if you are with group its not too bad. There is also a complimentary breakfast that you can feed all the kids with. Anything from pancakes and sausage, all the way down to fruit and toast. And you don't have to wake up at the crack of dawn to get it. I think breakfast hours are around 6-9 or 9:30. You will enjoy the spacious rooms and if you are with a family, the suite works out well because of the multiple TV's in the room so you don't have to argue over whats on.", "title": "Accomidations at the last minute saved our trip", "user": "cobbfamilySlidell_La", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54595956}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 31, "average": 66, "very good": 204, "terrible": 18, "excellent": 276}, "aka": "Residence Inn Lake Buena Vista Hotel Orlando", "slim_ranking": 0.446808510638, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}