{"user_rating": 5.0, "review_count": 401, "name": "Residence Michelangiolo", "reviews": [{"rating": 5.0, "title": "Can't wait to Return", "text": "Just wanted to let the world know that this is a great residence & perfect for an above average stay in Florence. Angela was very welcoming & looked after our every need . We even got a bottle of Bubly for my birthday. Went with my two kids & we had the top apartment which was large & perfect for us. Can't wait to return & will definately book again.", "user": "Isafrench1", "date": "April 22, 2008", "id": 15230921}, {"rating": 5.0, "title": "Great place to Stay", "text": "We booked this hotel based on the reviews in Trip advisor and we were not at all disappointed, we had wonderful two night stay in RM. The villa is about 25 minutes walk from SMN station and takes about 10 minutes by Bus line 23a/b which stops in Piazza Ferrucci, 200 m from the villa. The location is quiet and scenic, away from the hussle and bustles of Florence and seemed to be a very safe area as well. The owners Angela and Cherubino were extremely friendly and took good care of us, they guided us to few good restaurants and suggested some good offbeat places to around RM. The rooms was clean, big and quite nicely decorated. There are few good snack bars and hotels around the villa. All the major attractions are within walking distance from RM (15-20mins). We highly recommend this hotel and once thanks to Angela and Cherubino for making our stay in Florence a memorable one…..", "user": "Krishna_Venkatesan", "date": "April 16, 2008", "id": 15071826}, {"rating": 5.0, "title": "A wonderful haven", "text": "Over the past few years we have discovered some splendid places to stay, courtesy of TripAdvisor, but Residence Michelangiolo tops the list, in terms of quality and value.", "user": "LondonerTravellers", "date": "April 14, 2008", "id": 15037843}, {"rating": 5.0, "title": "Amazing Service and Hospitality", "text": "Even before we arrived, the charming and helpful hosts Angela and Cherubino were already working on our behalf – booking reservations for museums and galleries, thus saving us much time queuing. It was through them that we found out about the stunning frescoes of the Brancacci Chapel in Santa Maria del Carmine, which we may well have otherwise missed.", "user": "blez22", "date": "April 4, 2008", "id": 14787922}, {"rating": 5.0, "title": "Everything was great!", "text": "The Residence Michelangiolo is a beautiful, quiet haven, situated in a smart neighbourhood a short walk or easy bus ride from the main sites, but a welcome distance from the crowds and noise of the city centre. Our suite, which included a beautiful spacious bathroom, was extremely comfortable and elegant - reminiscent of a set from “The Marriage of Figaro”, and overlooked the garden, an old church and hills beyond.", "user": "gracePortland", "date": "April 2, 2008", "id": 14739912}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed three days in residence michelangelo. The room was clean, large and beautiful. The historic center is at walking distace. Above all, the service was very friendly and personal. Ideal for a romantic stay.", "title": "Florence with a personal touch", "user": "Theo J", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117188290}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Angela our host was fabulous. She is very enthusiastic, knows Florence and always gave us great suggestions for breakfasts, dinners, etc. The walk to the city centre is about l5 minutes and very pleasant! It's quiet and peaceful and the view at the back of the house is wonderful is your room looks onto it. There is AC when it gets too hot and the room has huge soaring ceilings, tasteful decor and they are very large. We would not hesitate to recommend this to families who want adjoining rooms. We'd definately stay again.", "title": "charming and great location", "user": "santafefreak", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117127351}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Residence Michelangiolo was a real surprise. We needed a place with parking, and so chose this hotel which was close to everything, according to other reviews. What a lovely place and what sweet, helpful people! The hotel is in a lovely residential area with a few good restaurants and cafes within walking distance. Buses into the center of town are close by and a taxi ride is approximately 12 euros.", "title": "One we will not forget.", "user": "suzannerose", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116898292}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Thank you again, Angela and Cupido!", "title": "Classy, quiet and beautifully run.", "user": "GreginOz10", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116706328}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Had five days at the Residence and walked away very impressed. First impressions are of a beautiful villa on a tree lined street behind an ornate fence and gate. These impressions are not altered when you enter your room, which in our case had a high ceiling and double glass doors onto a terrace that overlooked a beautiful garden. Everything was spotlessly clean, and Angela the host was very friendly and helpful throughout, including giving us recommendations to great family run local restaurants and making transport bookings for us. The Residence is simply the experience you should hope for everywhere.", "title": "WE COULD NOT IMAGE A MORE PERFECT ACCOMMODATION", "user": "OurEurope", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116341344}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The location was perfect for us because we walked or used the buses or cabs, however it is on the other side of the river and a couple of km from the centre of town.", "title": "Fantastic hosts, great rooms and lovely ambience", "helpfulness": 4, "user": "belladonna01", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10723516, "likes": {"liked": "— The staff and location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The property was exceptional - a lovely big room, high ceiling, airy and with a view onto the back garden. Everything reported about Angela and her partner is true - knowledgeable, firendly and welcoming. We stayed five nights and could have stayed a month.", "title": "Lovely hotel", "helpfulness": 2, "user": "Colby21", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10628126, "likes": {"liked": "— Lovely accommodations with gracious hostess", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The local restaurents were great fun, relaxed, not full of tourists and good value. If you have a car the location and parking facilities are ideal.", "title": "Great little hotel", "helpfulness": 1, "user": "tellicobob", "date": "November 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10571031, "likes": {"liked": "— quality of the room"}}, {"rating": 5.0, "title": "Excellent all round!", "text": "A really great experience.", "helpfulness": 1, "user": "Bangor_NirelandFrank", "date": "November 1, 2007", "id": 10497951}, {"rating": 4.0, "title": "Perfect location", "text": "My wife and I thoroughly enjoyed our stay at the Residence Michelangiolo (RM).", "helpfulness": 2, "user": "Ant48", "date": "October 22, 2007", "id": 10218124}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our 10 day stay in Firenze was enhanced significantly by the exceptional service and wonderful room at this beautifully restored villa.", "title": "A True Gem", "helpfulness": 3, "user": "DesertPair", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10093382, "likes": {"liked": "— Extremely Friendly Hosts and Large Comforable Room", "disliked": "— Near a busy viale"}}, {"rating": 4.0, "title": "Excellent base for visiting Florence", "text": "Angela and Cherubino were the perfect hosts, assisting us with everything from finding our luggage, making reservations at quality local restaurants, booking private driver tours, and making us feel like highly valued guests with their warm smiles and positive can do approach.", "user": "Susseximpi", "date": "October 16, 2007", "id": 10087306}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our room was very spacious with high ceilings and included a small kitchenette, a large and very comfortable bed, 4 chairs, and a modern bath in spotless condition. Given nice weather with cool breezes at night, we slept with the huge windows open in spite of a fair amount of traffic noise from the busy viale out front. With all windows shut and the air conditioning on, it's very quiet, so you have a choice.", "title": "A home in Florence", "helpfulness": 1, "user": "cmenf", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10067653, "likes": {"liked": "— Room simplicity and cleanliness with all modern amenities", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We both enjoy walking and as others have pointed out it's only 15-20 minutes from most downtown sites, and less than 5 minutes to the local coffee shop. We will return here for sure.", "title": "Great Find in Florence", "helpfulness": 1, "user": "HoooHaaa", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10058179}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Residence is in a quiet position within a 20-30 minute stroll to the centre of Florence, with good bus routes if needed. The room was beautiful, large and clean with a very large and comfortable bed. The hosts were excellent and very helpful with suggestions and directions. We had the breakfast basket included in our rate for the room and this was a good way to start the day. Excellent value for money, would certainly recommend the Residence and was definitely stay there again if we return to Florence", "title": "stay in Florence", "user": "sparrow07", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10058010, "likes": {"liked": "— the comfort of the rooms", "disliked": "— the brekfast"}}, {"rating": 4.0, "title": "Nice place to stay", "text": "The Residence Michalangiolo has fantastic rooms, and is run by the nicest freindliest people you could hope to meet. It is easy walking distance to the centre of Florence or there is a great inexpensive bus service.", "user": "T1RSD", "date": "July 30, 2007", "id": 8256242}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "As there is no restarant and bar if you are hoping to meet other guests this hotel is not for you, but with a hotplate and fridge cleverly hidden in the room it is great if you want to do your own thing. You can drink your own drinks on a terrace or in the garden.", "title": "Outstanding Property", "user": "RedSoxFamily", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8252409}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My wife and I along with our 2 teenage sons lodged at the Residence Michelangiolo for 2 nights after spending time at a B & B in Bangno a Ripoli. The property is situated in a residential area approximately 15 minutes by foot from the center of Florence. The proprety is meticulously maintained with parking behind a secure gated fence. We did not use our automobile during our stay. The rooms were large, immaculate and well furnished. We looked forward to returning to our airconditioned and comfortable rooms each afternoon after spending long hot days in the City. Our host, Angela provided us with recommendations for dinner at restaurants within walking distance of the residence which were reasonable in price and quite good as to quality. We enjoyed walking around the vicinity of the property after dinner. Residence Michelangiolo is truly a jewel.", "title": "Idyllic hotel - Residence Michelangiolo", "user": "NandPJ", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8214896, "likes": {"liked": "— Warm welcome. High standards of quality", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We had a wonderful stay at the Residence Michelangiolo and were warmly welcomed and pampered by Angela and her husband. The residence is situated only a very short distance from all the major attractions of Florence, in a leafy residential avenue near to public transport or a 20min walk into the centre.", "title": "We loved Residence Michelangiolo", "user": "greenequity", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8140370, "likes": {"liked": "— Property and condition", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Wonderful stay", "text": "The beautiful rooms are large, well equipped and are furnished and decorated to a very high standard maintaining period features. No expense has been spared on the quality of fittings and finishings in the lovely and spacious en-suite bathrooms. Each room has a mini kitchenette hidden within a large cupboard complete with refrigerator, hob, microwave, crockery, wine glasses, etc. Each day the kitchenette is restocked with fresh coffee, tea, milk, juices, bottled water and light breakfast snacks.", "user": "VisitorFromNewYork", "date": "July 16, 2007", "id": 8126950}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "What a Treat it was to stay here; I was on a Special trip with my Parents and This truely was our home away from home. Our hosts Angela and Caribeno were Warm;Friendly and very helpful.", "title": "Tuscan Charm and Hospitality", "helpfulness": 2, "user": "sr3060", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7293501, "likes": {"liked": "— the owners", "disliked": "— no dining facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "the setting is beautiful on a tree lined street ; the Villa is beautifully renovated and was quite confortable to stay in. We had 2 rooms on the ground floor that both had nice kitchenettes that really came in handy . My room opened up onto the back patio area which was just lovely. I travel a lot for work and I loved it here, it was such a peaceful setting you would never guess it was so close to the center of town.", "title": "Great value - with kitchenette", "user": "SFduo", "date": "April 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7266970, "likes": {"liked": "— The room size and kitchenette"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "If your not hung up on being in the center of town I highly recomend this place. It`s a quick 5 min Taxi ride to the center or walkable in 15 mins.", "title": "Home Away from Home", "helpfulness": 2, "user": "DallasTexasProfessor", "date": "April 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7266028, "likes": {"liked": "— Personal attention", "disliked": "— No dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The Residence Michelangiolo is a great value.", "title": "48 hours in Firenze", "user": "1marklinman", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7259913, "likes": {"liked": "— location and the room", "disliked": "— nada"}}, {"rating": 5.0, "title": "Fabuolous Hotel", "text": "We had a very large room with 16 foot ceilings and windows looking out on the backyard. Our room had a little kitchen corner that was stocked with all the basics (including coffee, some snacks, and milk and drinks in the refridgerator).", "user": "vancouvergrizz", "date": "March 30, 2007", "id": 7253247}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Fabulous hotel, exactly as most of these reviews say. The ajoining rooms making up the apartment are just perfect for a family of 4. The quality of service provided by Angela is outstanding - we had had our money and credit cards stolen at Pisa Airport so the trip was not off to the best of starts (!) but on arriving at Residence Michelangiolo, Angela was incredibly helpful. She phoned the police and the airport on our behalf and even lent us some money until we had made other arrangements. That is what you call service. Oh, and she also recommends great restaurants - 'The Golden View' right next to Ponte Vecchio is touristy but good food and 'Rifrullo' slightly away from tourists, mainly locals in when we went and great food.", "title": "Believe the reviews.", "user": "CharlieBEngland", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8515731, "likes": {"liked": "— The service", "disliked": "— Location (20 min walk to city but not a huge problem)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Thank you Angela and your husband, for turning a near disastrous start into a lovely 2 day stay at the beginning of our Tuscan tour. A gem of a hotel.", "title": "great stay", "user": "parksie", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8505370, "likes": {"liked": "— The \"homey\" feel it had", "disliked": "— The small shower"}}, {"rating": 5.0, "title": "Florence can be quiet", "text": "Just everyone beware pickpockets at Pisa Airport (and also the incredibly unhelpful airport police)!!", "user": "TwoEuropeans", "date": "August 24, 2007", "id": 8492406}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We loved the Residence michelangolio! The owners were so friendly and the triple room we stayed in was big, which is hard to find in Europe. It was out of the city, which was kind of nice to be able to get away from the crowds to relax. It is an easy walk to the main places to see and the many museums that are there. The hotel owners made us reservations to the main museums which really saved us time by not having to stand in long lines!", "title": "Will return to the residence michelangiolo", "user": "cpbof", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8485353, "likes": {"liked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We would definetly stay there again if we get the opportunity!", "title": "A warm welcome and a fabulous room", "user": "thickpaddy", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8419568}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at the Residence Michelangiolo in the amazingly Beautiful Florence Italy at the start of December 2007.", "title": "Cute place not too far from the city centre (Lovely People)", "helpfulness": 3, "user": "pmathey", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 12051357, "likes": {"liked": "— Clean, beautiful surrounds, great people, large rooms", "disliked": "— Little further from the city centre but nothing a short bus ride can't fix (busses are only 1.20"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This place is just a bus ride from the central train station and once you arrive there it is a beautifuly large house with great surrounds.", "title": "Great hotel in Florence", "helpfulness": 2, "user": "gtbrent", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11982152, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Beautiful, historic building with great staff", "text": "The reception that we received when we got there and during our stay was amazing (any question was answered and always with a friendly face).", "user": "Jenga_7", "date": "December 24, 2007", "id": 11924599}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The rooms are the largest in Europe and have a great kitchenette.", "title": "An ideal Florence hotel", "helpfulness": 2, "user": "gianbur", "date": "November 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11010543, "likes": {"liked": "— Location, parking, service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Make sure you stroll up to the chruch on the hill (This churche was very old and had a mystique about it (We have already seen most of the major churches throughout Europe), where you can also see a copy of Michaelangelo's David in Copper. Amazing site seeing place of all of Florence (this view is not too be missed!). It only takes under 10 minutes to get there by foot (The pizza for 3 Euros below the chruch was fantastic).", "title": "Great Hotel, great location", "helpfulness": 2, "user": "mpopkin", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10792821, "likes": {"liked": "— The tranquility of the Residence and its surrounding areas", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "My husband and I stayed 6 nights at Residence Michelangiolo. We thoroughly enjoyed our experience. It’s a 15-20 minute walk (or a 5 minute bus ride) to the center of Florence. We preferred staying a bit out of the fray and it definitely made for a more relaxing vacation. Our room was immaculate and tastefully decorated, the bathrooms appear to be newly remodeled and in perfect condition. Angela and Cherubino (the owner/operators) were the perfect hosts, gracious, and available with suggestions on outlet shopping, car rentals, wineries for tastings, road trips, etc. We rented a car and took day trips to Siena and Pisa/Marina di Pisa (another benefit of staying here is the parking for a rental car as there’s ample space w/in the gated residence so no stress of having to deal with driving in the center of Florence). Something else great about staying here is the kitchenette. We were able to make coffee and start our day when we wanted and we even had a nice “picnic” of Italian meats, cheeses, and wine in our kitchen when we didn’t feel like going into town or fighting the crowds. There’s a great meat/cheese shop w/in walking distance of the residence called Bottega dei Sapori at P.zza Gavinana, 6 –Firenze. If we go back to Florence, we’ll definitely stay here again. Amy & Fred (Paris, France)", "title": "Home away from home . . .", "user": "akr31", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8399258, "likes": {"liked": "— The warm welcome and the spacious and clean room.", "disliked": "— loved it all!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "A great place to stay as several others have said.", "title": "Great place to see Florence from", "user": "Mark_from_Thailand", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8395174, "likes": {"liked": "— Angela & her husband", "disliked": "— Bird poop I found on my car in the morning"}}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "Angela & her husband are great hosts. Very helpful, eager to ensure you have a good stay, rightfully proud of Florence & the area.", "user": "McA29", "date": "August 9, 2007", "id": 8379957}, {"rating": 4.0, "title": "fantastic in every respect", "text": "I have to disagree with SkiingTourist below. This is a \"Residence\", which means you do NOT get meals. Having said that, Angela does provide very basic croissants, cakes & fruit juices etc. for you to eat if you want. We did not pay anything additional for cleaning?", "user": "brendaVictoriaBc", "date": "August 6, 2007", "id": 8361544}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "A great location as well - quiet but easy access into the centre, (via Bus #23). Nice little cafe & Trattorias close by as well. A short walk to the Pallazo Michelangelo, complete with it's stunning views & sunsets over Florence.", "title": "A lovely place", "user": "nvukovlj", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8262672, "likes": {"liked": "— Size of rooms, friendliness of staff", "disliked": "— A bit noisy early in the morning as room was next to the front door"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Residence Michelangiolo is one of the best hotels we have ever stayed in. We booked apartment for 4 people; both rooms were spacious, very clean, with two connecting terraces, small kitchenette, two bathrooms. It is very comfortable including all amenities you might need during your trip (great wifi connection!) and beautiful Florentine decor. We simply loved it! The location of the residence was fantastic, very convenient if you're coming by car as we did and plan on traveling around Tuscany. Personally we have enjoyed the fact that we were out of the touristic hub, yet close enough to walk to the city, it is in a very charming neighborhood with many local stores and restaurants around. And lastly Angela was a great host, very helpful and welcoming. Overall it's a wonderful place which makes you feel like at home, great Florentine experience!", "title": "Wonderful Florentine Experience", "user": "TerezaFromPrague", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116239803}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent 2 nights at this hotel and would definitely go back. We were late arriving and Angela greeted us with a warm smile. Her family was waiting to have dinner with her but she took her time letting us know about the good coffee shops for breakfast, how to get around town and offering to book tours for us. She guessed correctly that we were there on our honeymoon so she upgraded us to a newly renovated suite! The next day after touring the city and arriving back to our room, we had chocolates and a bottle of champagne with a note congratulating us on our marriage. The hotel is beautiful and the gardens surrounding the hotel add the perfect Florence touch. The walk to the city centre is about 15 minutes. If I go back to Florence, we will definitely be staying at this hotel again. I have nothing negative to say about this hotel.", "title": "Great hotel and close walk to city centre", "helpfulness": 2, "user": "zhaces", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116167715}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Michelangiolo is a wonnderfully restored old mansion with great atmosphere and very convieniently located close to all the attractions. The owner Angela is a great fountain of information and could give us good recommendations to local restaurants and other sights.", "title": "We loved it very much and would like to come back", "user": "jbuehler", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115835854}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "One minor disadvantage is the location close to a busy road, but with the windows closed there is no traffic noise to be heard.", "title": "Excellent location & great rooms", "user": "PaulzOudtshoorn", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115744177}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "From the moment we booked Angela was on hand to answer all our questions & help with advice & booking Taxi's etc. This level of personal service as well as the fnatastic location make this Residence a real find. The Hop-on-HopOff bus stop was 100m away & from the residence u can walk into the centre of Florence, or to the Piazzale Michelangelo, for great views over the city.", "title": "Wonderful, when in Florence Residence Michelangiolo is the place to stay", "user": "MarioMontevideo", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115062862}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We booked this hotel based on what we read in Trip Advisor.", "title": "All that you could expect and more", "helpfulness": 1, "user": "edgarsz", "date": "April 29, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 15473640}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "All the superlatives were fully justified.", "title": "Where else would you want to be?", "user": "Jollyvino13", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15446411, "likes": {"liked": "— Incredibly nice rooms for the money. Unheard of size and quality.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The location is perfect, far enought from the bustle, near enough to get anywhere in central Florence in 15 minutes by public transport..", "title": "Great Location", "user": "Happy016", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15326835, "likes": {"liked": "— Friendly Atmosphere"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The owners are very friendly and helpful.", "title": "Perfect location", "user": "ljorgens", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15297219, "likes": {"liked": "— Beauty of the room and the location", "disliked": "— There was no bathtub!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The room is huge, confortable and very clean.", "title": "We will go back !", "user": "AmvKiev", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15249951, "likes": {"liked": "— Comfortable, clean and well located!", "disliked": "— Room's floot cleaning could use some improvement."}}, {"rating": 5.0, "title": "A wonderful place to stay", "text": "We had a wonderful stay. The villa is out of the hustle, bustle and crowds of Firenze: but not too far. The room was huge by italian standards and everything inside was done beautifully. The only minor criticism we had was that our room, on the ground floor, got some entrance hall noise.", "user": "mdhAustralia", "date": "April 1, 2008", "id": 14722052}, {"rating": 4.0, "title": "Very pleasant stay", "text": "We booked a superior room for 120 Eur/night - reasonable value, esp with free parking, which is otherwise expensive in Florence. Very spacious and comfortable. Good kingsize bed, desk, chair, armchair, small dining table and chairs. Kitchenette with basic electric hotplates, sink, fridge, equipment. Breakfast basket of sweet packaged breads and rolls not very appetising. Ordinary bread would have been better.", "user": "Travelling_Aussie60", "date": "April 1, 2008", "id": 14705288}, {"rating": 5.0, "title": "A little paradise", "text": "Very quiet location, walking distance to centre (about 20-30 mins). No staffing after hours, no hotel amenities, but this suited us fine. City bus nearby. Very nice staff.", "user": "13SaintPa", "date": "March 22, 2008", "id": 14441944}, {"rating": 5.0, "title": "Fantastic", "text": "My wife and myself stayed there for four nights in February. The place is magnificent, spotless, comfortable etc. A little paradise! The people in charge, appropriately named Angela and Cherubino, are very kind and helpful. One welcome difference with Paradise is that you can choose to walk to the centre of Florence in ten minutes (leaving your car safely parked inside the Residence) or go for a drive round beautiful Tuscany.", "user": "thomascolpeperjp", "date": "March 19, 2008", "id": 14383516}, {"rating": 5.0, "title": "Great Value", "text": "My wife and I stayed at this hotel for four nights earlier this month. As the reviews say, its a wonderful hotel, our room was lovely and the owners extremely friendly and helpful. The first time we visited Florence was in October 2007, on honeymoon, when we stayed at the Savoy - we liked Residence Michelangiolo much more.", "user": "Rodfootball", "date": "March 10, 2008", "id": 14186355}, {"rating": 5.0, "title": "Lovely Romantic Weekend Break", "text": "Myself and my boyfriend, (couple late 20's) stayed in this accomodation in late February. We arrived very late, 1:00am and Angela welcomed us with a bright and enthusiastic welcome. The room was fabulous and created a real period setting. There was a stand alone bath with a shower hose attached however this was not ideal for boys who \"don't do baths\", we stayed in the junior suite and so this may not be thecase with other rooms. The location was a queit exclusive area, 20 minutes from the centre and we walked by Piazalle MIchelangelo on the way. This was an excellent start to our trip.", "helpfulness": 1, "user": "Dublin_Lady", "date": "March 2, 2007", "id": 6899463}, {"rating": 5.0, "title": "Marvellous", "text": "I would have no hesitation in recommending this residence to any of my friends visiting Florence.", "helpfulness": 4, "user": "MrBridges", "date": "January 24, 2007", "id": 6688375}, {"rating": 5.0, "title": "Luxury, peace and chill", "text": "We have just returned from one week at this Residence, and it was wonderful. Our arrival was not great - we had flown for many hours to Milan, then a train down to Florence - we were exhausted - and the young woman who runs the hotel immediately had me sign up for full payment on my credit card before even seeing the room. When I realised what I'd done, about 30 minutes later, I felt very disturbed and unhappy.", "helpfulness": 3, "user": "hendersonic", "date": "January 5, 2007", "id": 6555052}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I felt I'd been rail-roaded into something, which was not nice, expecially as the internet booking site said I'd pay at the end of the stay.", "title": "An Absolute Gem", "helpfulness": 3, "user": "jomarcol", "date": "December 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6476880}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "And our first room, though large and clean, was not thrilling, in that it faced the main road. Not a very busy main road, except at peak traffic times, but noisy for someone who comes from a very quiet corner of New Zealand. And the bathroom was the usual tiny Italian hotel bathroom with a hand-held shower.", "title": "Loved Residence Michelangiolo", "helpfulness": 3, "user": "sjw721", "date": "December 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6454125, "likes": {"liked": "— Large rooms and very, very clean", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My wife and I wanted our stay in Florence and Tuscany to be a special one, and we were absolutely delighted with the wonderful Residence Michelangiolo. Our host, Angela, was extremely helpful in providing directions and hospitality. The Michelangiolo is a perfectly charming Hotel situated in a very peaceful and beautiful section of Florence. It is a few short blocks to bus stops and a taxi station, as well as family cafes and an expresso shop, which also has a nice selection of local food and wines. It is a casual walk along the river to the historic center of the city, and a short drive further up the hill on Viale Michelangiolo allows one to experience a marvelous view of the Florence skyline. It is a short 40 minute drive from the hotel to the fascinating village of San Gimignano, a small walled medieval hilltop town. The hotel thus served as a focal point for visiting numerous charming villages in Tuscany.", "title": "Classic Gateway to Firenze and Tuscany", "user": "JRH-SanAntonio", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7218183, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My wife and I loved our stay and look forward to returning to Florence, Tuscany and the Residence Michelangiolo.", "title": "a jewel in a fantastic city", "helpfulness": 1, "user": "tercow", "date": "March 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7209065, "likes": {"liked": "— angelina", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "spotlessly clean, great hosts,excellent location. my wife and i had a junior suite which was brilliant as you can never have too much space. florence is not a budget break,but if you want something special, this is it. we cant wait to go there again.", "title": "Very nice stay", "helpfulness": 1, "user": "serrov", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7155277}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Very nice experience. We enjoyed our stay very much. The rooms are large, quiet and well decorated.", "title": "Absolutely first class", "helpfulness": 2, "user": "Julie M", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7153115, "likes": {"liked": "— Beautiful bedrooms", "disliked": "— Very limiited breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The staff is very kind and the service is very attentive.", "title": "Superb, friendly, grand without being pretentious. Great for the kids", "helpfulness": 4, "user": "parkies", "date": "March 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6936212, "likes": {"liked": "— Friendly welcome, cleanliness, palacial rooms, just about everything!!", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This is a great hotel. The service is wonderful with a very accomodating staff. The rooms are spotless, quiet, and well decorated. On the negative side we would have preferred to be closer to the city center. It is about a 20 - 30 min. walk to the city depending on where you are going. There is a bus stop nearby, but we never used it. Also, as with many hotels in Italy, the shower is very small. I was glad I am a small person. However, I would not necessarily let these issues stop you from staying at this hotel. It is a very good value for the service and room we received. I would definitely stay here again.", "title": "Delightful", "helpfulness": 1, "user": "WhereRWeGoingNext", "date": "March 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 2.0}, "id": 13969111}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My Fiancee & I stayed at the Residence Michelangelo on the strength of the positive reviews on Tripadvisor. Our stay was a fantastic experience; our room was one of the most impressive in which we have ever stayed, there’s a certain ‘wow’ factor as you walk in - recently & tastefully decorated; spotlessly clean; so much natural light from those large windows and yet so beautifully quiet at night. Angela and her partner were perfect hosts, providing a warm welcome at all times and giving restaurant & walk recommendations. Angela noticed that it was my Fiancee’s birthday and much to our pleasant surprise laid on a bottle of Riesling & truffles on our return from our day out - it really put a smile on our faces. We didn’t find the walk to the centre of town a problem, it is about 15 to 20 minutes but you get to experience so much more of the real city that way. We highly recommend Residence Michelangiolo.", "title": "Many Thanks Angela!", "helpfulness": 2, "user": "ShakesMagoo", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13811990, "likes": {"liked": "— Room & Service", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "La Dolce Vita", "text": "This place is simply wonderful, unless you want a lot of excitement. It is a 1920s house converted to a hotel of sorts but really it is a house a 15 minute walk from the hubbub of Florence, which can be too much at times. If you crave quiet and civility this is the place for you. The rooms are charming and homey. If you want the services of a boring business five star hotel, please don't stay here. Save the place for those of us who love life and aren't spoiled brats!", "helpfulness": 4, "user": "minimalbue", "date": "January 18, 2008", "id": 12772743}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed at the residence and would highly recommend it. Angela and Cherubin, our hosts, were extremely helpful and friendly. We had no troubles and the residence is spacious, clean, warm in all senses of the word, and very welcoming. We travelled as a family of 4 adults (parents and 2 university aged children) and had adjoining apartments which were more than adequate for our needs. The residence supplied everything we needed and more - internet assistance, language assistance, directions, maps, restaurant recommendations and bookings etc. Absolutely wonderful. Highly recommended for maturer guests, maybe not young childen as it is quite a walk (15-20 mins) to the city and restaurant areas. We enjoyed the walks after great food and service as recommended by our wonderful hosts.", "title": "Highly Recommended.", "helpfulness": 3, "user": "cathydel", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12430993, "likes": {"liked": "— Friendly service and lovely rooms.", "disliked": "— Could hear the phone ringing in the office downstairs early in the mornings."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at this charming villa in late November 2007 and absolutely loved it.", "title": "Beautiful, Quiet Villa with Lovely Owners", "helpfulness": 3, "user": "reneeskiSF", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12160520, "likes": {"liked": "— Comfort, decor, cleanliness, owners, location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I enjoyed together with my two friends the freindly welcome, the nice airy and spacious room where we slept in three, the possibility of cooking and the perfect cleaniliness.", "title": "Very pleasant and homey", "user": "travel1077", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115012510}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The surronding garden and the possibility of parking the car in a place so close to the center of the city is extremely convenient.", "title": "Excellent accommodation only mins from the heart of Florence", "user": "Liz1070", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114866583}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The closeness of the city by foot or with two different busses that run every 15 minutes makes it a perfect location.", "title": "Good Location", "helpfulness": 2, "user": "MarkBath", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114630623}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Both I and my friends are suggesting this residence as a perfect choice.", "title": "This is a WOW for the price", "user": "Jojo-bigD", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113624322}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Thank you Angela for the pleasant stay", "title": "relaxing", "user": "Hahuang", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112694812}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Having the huge front gates to the Vila open upon our arrival is somethg we will never", "title": "beautiful villa, but too far from center", "helpfulness": 2, "user": "ChampagnePrincess", "date": "November 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 5.0, "location": 1.0}, "id": 120996752}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Forget. This is the most private, quite, special place we've been. You get the \"key to the house", "title": "Large, spacious room, excellent customer service, beautiful in all ways", "helpfulness": 1, "user": "Gretchen S", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120430178}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "As well as the front gate, which makes you feel like the diplomat the street suggests. The room and kichenette were immaculate. The wi-fi was great and allowed us to stay in touch, make our next reservation and just go on line with ease (we had a new tablet with us and it worked great", "title": "We loved it", "user": "D_W267", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119848624}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "However, with all that, it does have some big downsides...it's really too far from all the sights. If you're like us, you like to get a lot in in one day. If you stay here, once you are out - that's it - you are out and not visiting your room again until you're day is over. No going back to the room to rest, refresh, nap, etc..", "title": "Wonderful stay - would love to come back!", "helpfulness": 1, "user": "NZTrev", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117472461}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The other two problems are: no breakfast (which I did not think was going to be a problem) which turned out to be a huge problem. This is not the U.S., there are no places close by to get a bacon and egg sandwich - that is unheard of here. So going forward, I would always pick a hotel with breakfast when visiting Italy.", "title": "Very Happy and will return", "user": "Barry K", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117273513}, {"rating": 4.0, "title": "an interesting place to stay in Florence", "text": "Nice large rooms, garden a plus, especially when travelling with kids. Not exactly in walking distance to tourist attractings/sightseeing points in Florence, but a bus stop is just 200 m away from the Residence.", "user": "Schniggl", "date": "September 18, 2007", "id": 8750599}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "A great place to stay in Florence. Booked on line, no problems.", "title": "Perfect !", "user": "MickWoods", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8711328, "likes": {"liked": "— Location, the building itself and of course the owners.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Arrived at airport, short taxi ride to \"Residence Michelangiolo\"", "title": "Outstanding hotel", "user": "mcbabci", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8672814, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Greeted by owners personally, who were very helpful throughout our stay. We booked a room on the ground floor with garden access which was very nice, it was a large room with A/C which was great the temperatures at the time were well in to the high 30'sC", "title": "friendly owners and lovely rooms", "user": "JOUK1", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8658298, "likes": {"liked": "— spaciousness and freindliness", "disliked": "— lack of fresh breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Thank you Angela and Cherubino for making our stay very enjoyable !! We had a wonderful time in your hotel and fully recomend it to anyone !!!!", "title": "Loved the Michelangiolo.", "user": "MJM1999", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8525884}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This is a lovely villa in a quiet part of Florence. The room was huge and the bed and bed linen were new.", "title": "Lovely Place to Stay", "helpfulness": 2, "user": "mchelenblue", "date": "April 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7474590, "likes": {"liked": "— High Ceilings and quality bed linen and towels", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The bathroom was also large with plenty of white fluffy towels.", "title": "Excellent Location and Superb Service", "helpfulness": 1, "user": "PaulRoss", "date": "April 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7418354, "likes": {"liked": "— Size of the room.", "disliked": "— Got no negatives to give, just a couple of additions (see review) would make it perfect."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "It was a pleasent stroll along the river into the City", "title": "Great Quiet Place to Stay in Florence", "helpfulness": 1, "user": "TunaSlayer", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7416490, "likes": {"liked": "— Angela"}}, {"rating": 5.0, "title": "Warm and Welcoming", "text": "Would recommend without hesitation both the villa and the city of Florence", "helpfulness": 2, "user": "rlward1313", "date": "April 15, 2007", "id": 7365259}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Me and my Wife spent our honeymoon here and right from the start, we got a 5 star welcome by Angela.", "title": "The Perfect Honeymoon!", "helpfulness": 3, "user": "cyngen", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7341468, "likes": {"liked": "— Friendliness and cleanliness.", "disliked": "— CNN sucks; need English movies on TV."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Our room was spacious, beautifully appointed, quiet, and full of sunshine. It had a large, deep bathtub which was perfect for a hot, relaxing soak after a long day of site seeing. We also appreciated the mini frig stocked with free beverages and the speedy Internet access.", "title": "Brilliant place to stay", "helpfulness": 4, "user": "Radiohelen", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12129905, "likes": {"liked": "— Beautiful high ceilings, grand room, the kitchen in a wardrobe.", "disliked": "— the yellow bedspread"}}], "location": {}, "variance": {"poor": 1, "average": 9, "very good": 67, "terrible": 0, "excellent": 324}, "aka": "Residence Michelangiolo Florence", "slim_ranking": 0.0773480662983, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Residence Michelangiolo welcomes you into a Liberty style Villa dating back to 1917, totally renewed with exquisite details that define the elegance and charme of long ago. The Residence is situated in one of the most exclusive and peaceful areas in Florence, on Viale Michelangiolo, which allows you to reach the historical center of the city with a few minutes pleasant walk. The Residence has 8 Superior room furnished whit every confort."}