{"user_rating": 4.5, "review_count": 190, "name": "Residence Inn Portland Airport at Cascade Station", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We were in Portland to visit our son and needed a convenient stay for a couple of nights. We got a very good rate because of a family connection and could not have been more pleased. The people at the front desk were very friendly and helpful, the room was large and well equipped, the breakfast was quite good and offered enough variety, and the location was all we could have asked.", "title": "Not sure it could be any better", "helpfulness": 1, "user": "Atkinson", "date": "January 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53952611}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Though the hotel is just a few hundred yards from the main runway at PDX, the windows are quadruple paned and we could barely hear the planes taking off--about like your neighbor starting his car in the morning. Amazing!", "title": "Met Every Expectation", "helpfulness": 1, "user": "CaribeTraveller", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50955755}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The kitchen in our room was well equipped, though we scarcely used it. The shower was outstanding. The television was huge and brand new. My only complaint was that the Golf Channel somehow disappeared from their menu without explanation.", "title": "Brand New and Very Nice", "user": "yastreb", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49711523}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "We used the indoor pool and spa and found them both delightful. The spa was hot enough (a rarity in many hotels) and the pool was just right. There was an exercise room (we didn't use it) that had two treadmills, two elipitcals, a recumbent bike, and some weights.", "title": "Super find...Amazing place to stay!", "user": "chattime", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47561121}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Even at full price, this is a good deal.", "title": "Really Nice Place!", "helpfulness": 1, "user": "RRSAMIC", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46791165}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Residence Inn at Portland Cascade Station is my new favorite....", "title": "New Chic Hotel", "user": "LChan-V-", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46322926}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The decor is contemporary, facilities are clean, design and layout is very refreshing...", "title": "this is a great, modern hotel at a bargain", "helpfulness": 1, "user": "MDcomment", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39965234}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This is a new, modern hotel with large suites and every accomodation you could want. The staff is very friendly and attentive. When we went to our room all we could say is \"wow\", this is really nice.", "title": "Wow! Spectacular Hotel!", "helpfulness": 1, "user": "rozzihs", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39769722}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This is one of the best Residence Inn I have ever stayed. The room, bathroom and kitchen were very clean and well equipped. The fitness center was very nice as well. The breakfast was a standard fare for the hotel in this class. The front desk staff was very friendly and the maintenance staff was very responsive to our request. I do not have any problems recommending this hotel to my friends and colleagues.", "title": "Excellent Choice close to Portland Airport", "helpfulness": 1, "user": "Fortwood", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70200287}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "I have stayed at and have visited many Residence Inn's and this was by far the nicest I have been to. The hotel is part of a newly developed area adjacent to the airport. I was impressed by the manager's reception in the evening and the breakfast in the morning, they both provided a more extensive food offering than what I have experienced at similar hotels. The room was very comfortable and clean. Upon arrival I noticed that the hotel was directly over the flight path of arriving a departing flights and wondered to myself how quiet the room what going to be. I was pleasantly surprised to find that there was absolutely no air traffic noise that I could detect from within the hotel whatsoever. My room was on the first floor and right next to the hotel basketball court and I could hear the ball being bounced in the afternoon, but it was muffled to the point that I forgot that it was even there. Based on another reviewers comments I decided to return my car to the rental company upon arrival and use public transportation for the duration of my stay. The public transportation system is very efficient, affordable, easy to use and just across the small parking lot from the hotel. I used the metro to go into downtown Portland and then back to the airport, it was so easy and affordable I kept thinking to myself, why doesn't every city do this?", "title": "Convenient, clean and relaxing", "helpfulness": 1, "user": "liaft", "date": "June 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66684716}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "New, clean, great hotel. The king suite was wonderful. The location of this hotel is the best...easy access to airport and the Max rail which stops in front of the hotel takes you downtown within 30 minutes. I highly recommend this hotel.", "title": "The Best Hotel", "user": "jma1234", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62549935}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Well, I couldn't have been happier. I chose this Marriott brand hotel due to closeness to the airport and based on recent reviews. I was staying 2 nights before departing to Hawaii. I rented a car for one 24 hour period and spent a day touring Portland-which I must say is incredible. The room (a studio) was very large, had top of the line furniture and appliances. I could have lived here for an extended period. You could walk to the nearby shopping center and restaurants. The staff was very accomodating and the breakfast buffet was better than most restaurants! The light rail is actually in the parking lot so you don't even need a car. My husband and I travel a great deal and have stayed in a lot of nice places but this one really set a new standard to be a 6 star!", "title": "THIS SHOULD BE A 6 STAR HOTEL", "helpfulness": 2, "user": "DebbieSanAntonio", "date": "April 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62180540}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "If you stay a number of Residence Inns like I do (or even if you don't) this one takes the prize for being the best I've seen in this country, in terms of design, location, newness, and everything else.", "title": "Wow - Coolest (and Best) Residence Inn There Is!", "helpfulness": 2, "user": "hotelreviewer333", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59927474}], "location": {"country": "United States", "city": "Portland"}, "stars": 3, "variance": {"poor": 4, "average": 17, "very good": 53, "terrible": 5, "excellent": 111}, "aka": "Residence Inn Portland Airport At Cascade Station Hotel", "slim_ranking": 0.153846153846}