{"user_rating": 4.5, "review_count": 83, "name": "Residence Inn Louisville East", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Had no problems, staff great, clean, breakfast had lots of hot foods, the size of the rooms are much bigger than you would think. I like this type of hotel.", "title": "Great and Clean", "helpfulness": 1, "user": "mollybeenhere", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 57729648}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Marriott should revoke their franchise license. This was the dirtiest hotel room I've had in a long time.", "title": "Dump", "user": "rpn-ne", "date": "February 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 55651132}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The accommodations are nice for the price if you disregard the high decibel heating unit that sits outside or the fact that I can hear every step of the guest above me. Or, if you disregard the staff at the front desk that was forced to leave the computer in the lobby which they were using to research cars (not kidding).", "title": "Awake at 11:41 PM", "user": "craigmische", "date": "December 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 51644710}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Although situated in a convenient location for East side business, this hotel is very disappointing. For starters, the staff all seem to be tattooed work release inmates with no idea what the words customer service means. The room was in poor condition with soiled carpets, holes in the curtains, loose toilet seat, and old style television. Apparently they lay out two USA Today newspapers because each morning I went to the lobby early and I couldn't find any. I was told by the unapologetic desk attendant the newspapers were already gone. I've stayed at larger hotels with a higher census than what was staying at this hotel and I could always get a newspaper.", "title": "Not your Father's Residence Inn", "helpfulness": 1, "user": "matewan24", "date": "October 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 47374633}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The breakfast is plentiful, but the dining area is upstairs with no elevator available. If you stay here on a Monday, don't get the backside which faces the backside of a strip mall. At 4 am the garbage truck empties the dumpsters right outside your window which startles you from your sleep.", "title": "Overall enjoyed the stay, however, hotel is outdated", "user": "gjnbln", "date": "June 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32377941}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "My business had 20 rooms rented in October, 2011. We used the rooms for two nights during a conference at the Shelby Conference. As always the rooms at the Residence iinn were very comfortable and roomy. My room was a little difficult to find at first as I walked into a courtyard and my room was actually in the front facing the road. The outdoor pool and recreation area was spacious, but it was too cold to use. There were both hot/cold breakfast and hospitality in the evening. The Hospitality time in the evening almost could be used for dinner as it contained a potato bar and chicken fingers. The rooms were clean and the internet access worked great. We are planning on staying here again next year for the 2012 conference,", "title": "Busiiness stay in October", "user": "CardFanDubG", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123439945}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "I've stayed in hotels all over the US and the service at the Marriott Residence Inn on Hurstbourne in Louisville is better than several of the Ritz Carlton hotels I have stayed at. I was a bit bored on Sunday evening so I filled out a comment card and left it on one of two bedroom suite's desks. I mentioned that the only items missing were a cork screw and a baking sheet. When I returned from meetings in the afternoon both items were on the kitchen counter! What great service!", "title": "5 Star Service at a Reasonable Price!", "user": "CorporateGirl2", "date": "January 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 123186310}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Other details worth noting --- the all suites hotel was remodeled in 2011 in loft-style, extended stay rooms tastefully decorated and including new dishwashers, stoves, full-size refrigerators, working wood burning fireplaces, granite counters, three flat screen tvs, and comfortable beds. The hotel accepts dogs for an extra $100 fee. The hotel is very close to two malls, countless restuarants and Starbucks, and about 10 minutes from downtown using local roads or the highway. Also, there is an Aveda salon and spa across the street, and the hotel offers grocery service. They have a well-managed hot and cold breakfast --- with clean buffet stations and bus service. The wifi is fast and logon is easy and there is no shortage of outlets to charge your iPhone or run your laptop. Since this is a business traveler's hotel, kids and non-purposeful guests are sparse, allowing real work to happen --- my business partners and I were VERY glad for this and sincerely thank the staff for operating this Excellent facility free of non-sense. If you are discerning travelers who usually stays at pricier hotels for their service and quality you won't be disappointed here. In fact, save yourself a few dollars for a better bottle of wine or bourbon to enjoy while relaxing at the Marriott Residence Inn.", "title": "Great Stay for the Breeders Cup", "user": "travelingfloral", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120478423}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We stayed here for the Breeders Cup 1st weekend in November. We had one of the two story suites,, fabulous!!! Very cozy living room and the staff was really helpful! Would definatly stay again .", "title": "Spacious room", "user": "michiael", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116363092}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed 2 nights in the bi-level suite penthouse with the family while I did business in the area. The room is amzaingly big & spacious.", "title": "Not bad", "user": "wdc3293", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 115363894}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here for Kentucky Derby weekend on our first trip to Louisville. We could not have been more satisfied with this hotel. The staff was so friendly and helpful. Our room was large and comfortable but does need updating. The manager told us that they are about to undergo a complete renovation with stainless steel kitchens with marble countertops and a more up to date decor. The location is great being close to the interstate and close to lots of good restaurants and shopping. We had never stayed in a Residence Inn before and were not aware that they give you a wonderful hot breakfast every morning and a light dinner every evening. This hotel, with it's great staff, helped to make our first Kentucky Derby trip a wonderful experience.", "title": "Very good deal", "helpfulness": 1, "user": "BoysBaBa", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108090598}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I absolutely loved this place! It was a big surprise! The room is big and was completely equiped, all very clean. Now I want to use whenever I go the chain of Residence Inn by Marriot! The wifi was free of charges.", "title": "A comfortable place!", "user": "KarrySantoyo", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100280063}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "While this Residence Inn was built some years ago, it has been well maintained, Our first floor room was clean with the exception of cookie crumbs on top of & under the dark cover at the foot of the bed. Don't know how the housekeeper missed it. The manager's reception was on the second floor above the front entrance & registration area. The tasty pulled pork barbecue, baked beans, tossed salad, chips, desert & drinks filled us up. The next morning's breakfast at the same location offered a nice variety of hot & cold items. Our room was quiet, comfortable & dark. A night light would have made it a bit safer finding one's way to the bathroom. The bathroom exhaust fan was old and very loud & the ceiling above the tub was somewhat low. This property is close to the University of Louisville Shelbyville Campus which has lots of quiet sidewalks & open space to enjoy walking.", "title": "a pleasant stay", "helpfulness": 1, "user": "bearded_bard", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82487165}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Was able to reserve a 2 story unit over a weekend at a great rate, much cheaper than airport and downtown locations. It was worth the extra drive. Kids had their own room upstairs, making for a very peaceful stay.", "title": "Excellent family value", "helpfulness": 1, "user": "ilBuckeye", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 72651977}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Unit had a full kitchen. 2 bathrooms. Very clean and comfortable.", "title": "Super clean, friendly staff", "helpfulness": 1, "user": "Computerage", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57748249}, {"rating": 4.0, "title": "Tidy and comfortable, if a little off the beaten path", "text": "Our family of 4 spent two nights here in a studio suite. The room was fresh and clean and stocked with large, fluffy towels when we arrived. The second day the towels had disappeared, but a call to the front desk remedied that.", "user": "almabalma", "date": "April 10, 2012", "id": 127588954}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Breakfast is two big steps above the typical free hotel spread. It included a variety of hot items, oatmeal, DIY waffles, donuts, bread items, good coffee and juices.", "title": "Mixed feelings about our last stay", "user": "CatFoodFlambe", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127163394}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Our only frustration Was the weak wifi and the walk (outside) to the lobby for breakfast in a heavy downpour.", "title": "Good for Family Travel", "helpfulness": 1, "user": "Alycia J", "date": "March 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 125894106}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Facility was excellent - room was clean as a whistle, everything worked. Desk staff handled a last-minute early check-in without a problem.", "title": "Nice Location", "user": "GlenJMart", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125505768}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "However - something needs to be done about the staff that handles the breakfast area. My wife and daughter chose to sleep in fo, and arrived an hour before the stated closing time. The two women who staffed the dining area started packing up with forty-five minutes to go, and turned down direct requests from several guests to restock the serving line a full half-hour before closing time.", "title": "Fantastic Place To Stay!!!", "user": "GHawg", "date": "February 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125323896}], "location": {"country": "United States", "city": "Louisville"}, "stars": 3, "variance": {"poor": 4, "average": 7, "very good": 19, "terrible": 3, "excellent": 50}, "aka": "Residence Inn Louisville East Hotel Louisville", "slim_ranking": 0.125, "description": "The newly renovated Residence Inn by Marriott Louisville East is an upscale apartment-style hotel offering spacious guest suites with fully equipped kitchens. Our studios and penthouse suites features complimentary high speed internet access and flat screen TV’s with digital satellite. Conveniently located off I-64 and I-264, this hotel is near many restaurants, Oxmoor and Summit Shopping Malls, Churchill Downs, and Slugger Museum. We are walking distance to University of Louisville Shelby Campus and major business.The hotel also provides a complimentary full hot breakfast and evening reception (Monday thru Wednesday), outdoor swimming pool, and complimentary passes to Power House Gym fitness center. Whether for business or leisure, the Residence Inn Louisville East is your ideal “home away from home”."}