{"user_rating": 3.5, "review_count": 235, "name": "Residence Inn Orlando International Drive", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We were able to reserve a 2 bedroom penthouse suite at a great price with 1 free night when you stay 4. The room was ok. The furniture was worn in the living room. The beds were not comfortable. The windows were extremely dirty. The set up of the room was great. When you walk into the room you were in the living room (ceiling fan) with a small kitchen area to the right, Straight ahead was a bedroom with 2 queen (?) beds and a full bathroom. There was a tv in the living room and one in the bedroom on the first floor. There was a flight of steps leading to the other bedroom. It was a penthouse (open to the other areas) with a king size bed, ceiling fan and a 19 inch tv. You could not watch tv on the second floor if someone was watching tv in the living room (unless you were watching the same show) due to the noise level. There was a full bathroom in the penthouse area. The bathroom on the second floor was old. Some of the tiles were coming up from the floor. The wireless internet worked great. We did not make it for the manager's reception but we did eat breakfast daily. We were in building 5 and it was a short walk to the lobby building. It was cold when we were there but we were finally able to use the pool on the last day. While we stayed here, we went to Universal Studios. It was only a 10 minute drive to the park.", "title": "Ok stay....", "user": "CCCLady", "date": "February 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 56615308}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I stayed for 2 nights at the Residence Inn Orlando International Drive during a week long Disneyworld Trip in January 2010. I stayed the other 4 nights at another hotel. Like most Residence Inns, the place was clean, had a kitchen, free breakfast, happy hours during the weekdays, coin operated laundry ($2) (3 washers, 3 or 4 dryers), etc.", "title": "Beware of staying on 1st floor, you can hear every step of the person on 2nd floor", "user": "herbherb", "date": "January 22, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 1.0}, "id": 54115859}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The only negative, and it is significant, is that when I was in bed around 11pm and around 7 am in the morning, I can hear every step the person on the 2nd floor made. And it was very annoying. The only \"good\" thing was that it was not after midnight or 5 am in the morning.", "title": "Kids & Pets Welcome", "helpfulness": 1, "user": "Jackman1", "date": "November 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50104406}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "So...I would not recommend anyone stay on the first floor, insist on having a room on the second floor.", "title": "very good floor plan for group// we weren't tripping over each other", "helpfulness": 1, "user": "disneyrules", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49547489}, {"rating": 4.0, "title": "Wish I could have Stayed Longer!", "text": "Last comment: great location to freeway entrances. However, the hotel is located in a very busy intersection, with lots of traffic. So, if you are driving in and out at night, it will be a short wait to get out.", "helpfulness": 1, "user": "iamkarkar", "date": "November 2, 2009", "id": 48333257}, {"rating": 1.0, "title": "We were robbed!!!", "text": "We stayed for 10 nights. By the end of our stay, coming back from a park around 6pm we found out that someone got into our room and took everything we had. From clothes to groceries. Everything. Even suticases. We came back home with the same clothes we had on that day (as we had nothing else to wear) and a \"we are sorry\" note from management. And Marriott says they can't do anything else for us. We are amazed!", "helpfulness": 7, "user": "SaoPauloTravelagent", "date": "July 30, 2008", "id": 18438185}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "It was good experience, room was clean, conditioner not so loud (which was bothering me very much usually). Staff was nice and helpful.", "title": "loved the view", "user": "butterflyAlaska", "date": "June 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17286934, "likes": {"liked": "— closeness to the amuzement parks, closeness to the busseness meeting place", "disliked": "— small"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "But what I really loved was a view from the front window ( we were staying at the first floor so the sliding glass door was very convinient way for me to take sunset-pictures :)", "title": "Good Hotel - would come again", "helpfulness": 2, "user": "Momof3Naperville_IL", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14056535, "likes": {"liked": "— Cleanliness, spacious rooms, proximity to parks, shops and restaurants, value for money", "disliked": "— lack of poolside service (but wouldn't expect it from this type of accommodation)"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "They warned that it was no view - that's right, no view to the ocean or something. But it was excellent view to Orlando landscape.", "title": "Nice Room, No Problems", "helpfulness": 1, "user": "Spade22", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12362862}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "What was not good - I particularly asked for the foam pillows (My neck doesn't like \"alternaive\") and they didn't give me that. Disadvantage of the place was space. This room (two person one) was like for one person studio-like.", "title": "pretty dissappointed", "helpfulness": 5, "user": "ljwflys", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8737214}, {"rating": 5.0, "title": "Home away from Home", "text": "We were relocating to Florida and this hotel made our stay be the best. It was the apartment like that we needed for the two weeks. The room was clean with no smells, service was wonderful, the grounds were nice. It was great!!!!", "helpfulness": 2, "user": "CharmedMaryland", "date": "September 11, 2007", "id": 8693014}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the hotel for ten days and liked it very much. The room was clean and well kept. The staff was helpful (unfortunately, as we left very early, there was nobody there to help us with the luggage). Breakfast was excellent and it was very helpful to have it being served from 6 to 10 in the mornings. The social hour was also good, even though we were unable to be there more than once during our stay. The only snag was the fact that one of our beds was not made one day because we left an empty bag on it, since the hotel has a stranger policy of not touching personal objects left in the room. We have been in Orlando many times before and this was the best value/money experience we had. We definitely recomend it and we intend to go back many times.", "title": "Good Value at International Drive", "helpfulness": 1, "user": "Sarment0", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8590404, "likes": {"liked": "— Room size and amenities", "disliked": "— The stairs without any help to carry the luggage to and from the car."}}, {"rating": 3.0, "title": "Find better at same plrice", "text": "Recently stayed here while in Orlando for a trade show. The room was comfortable (but not as big as other RIs I have stayed at), and the breakfasts were very good. However, I had very noisy neighbors (and I mean noisy from 10:00PM to after midnight), and the management would not do anything about it. I found out that other people at the show were staying at much much nicer places for the same or less money (like the Peabody). Check around before staying here.", "helpfulness": 1, "user": "AVisitor80126", "date": "June 23, 2007", "id": 7969956}, {"rating": 4.0, "title": "Stay here if you have a meeting at Wyndham Orlando Resort", "text": "I had a meeting at the convention center at the Wyndham Orlando Resort. I didn't really want to stay at the Wyndham, so I started looking around. The Residence Inn has free breakfast, free internet access and free weekday social hour, and the rooms are very spacious. When I arrived for my meetings, I found out that the Wyndham is very spread out so that most of the rooms are far away from the convention center. It turns out that my room at the Residence Inn across the street was closer to the convention center than most people staying at the Wyndham. In addition, at the Wyndham they charged an additional \"resort tax\" that allowed you to use the pool and other amenities that were free at the Residence Inn. I've seen the other bad reviews, but I had no major problem with the Residence Inn. I did have a problem the first day with the housekeeping staff. I had placed the magnet on my door for \"no service\", but when I got back to my room, someone had come in and cleaned it. The next day I moved the magnet closer to the handle, and they did not enter my room again. Other than that everything was fine. If you are comparing it to other Residence Inns, you might be disappointed, but if you need a place near the Wyndham convention center, you will be very happy. Also if you think you need to be at the Wyndham so that you'll have internet access while you are in your meetings in the convention center, forget it. Everyone in my meetings complained that the Wyndham's internet access was not working in the hotel rooms or the convention center. Here's some advice if you are staying here to be close to the convention center. The rooms closest to the convention center are right on the road. On the other hand, the property is somewhat spread out, so if you try to stay away from the road, you will be further from the convention center. This hotel is closer to the Wyndham convention center than any other hotel.", "helpfulness": 3, "user": "mrjanto", "date": "June 8, 2007", "id": 7805580}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The Marrott Residence Inn was probably the most pleasant hotel I have stayed at in Orlando, and we typically visit once a year. I was a bit nervous after having read some of the older reviews on this site, but was not at all dissapointed upon arrival. The property was probably newly renovated, and although it isn't sparkling, it is very clean and had everything that my husband, 20 year old daughter and nephews and neice (ages 9 - 17) needed for our 5 night stay.", "title": "Extremely pleasant stay", "helpfulness": 6, "user": "staceydaze", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7674087, "likes": {"liked": "— Saving money on meals/location/large hotel room/cleanliness/security guard", "disliked": "— loud bathroom vent hooked up with light"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed at this hotel for only 1 night while passing through Orlando to go on a cruise out of Port Canaveral. I booked on Priceline and got a great rate. Then I started reading these reviews. I was really nervous. I am very critical and wondered if I had made a mistake. Not so at all! This hotel was recently renovated and the beds,tubs, and everything looked brand new. It was also super clean. This is one of the few hotels that I didn't feel afraid to put my bare feet on the floor. They have free internet in the room, and a wonderful free hot breakfast! There is an outdoor pool that was very clean. Next door to the tiny fitness room is a place to do your laundry for $2.00 to wash and $2.00 to dry. The front desk gentleman was very friendly. The only two negative things I have to say is that they have no theme park transportation (if that is important to you), and the people that stayed above us kept yelling at there son all night as he raced across the floor late into the night. Not the hotels fault. Just some stupid idiots who have no respect for other people.", "title": "Wish we could have stayed longer!", "helpfulness": 1, "user": "luv2traveleverywhere", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38852479}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Sure it's an older property but for the amount of wear & tear all the hotels in the area must get, it is holding up nicely. Few minor things - in room internet a little slow & beds were to hard for our tastes. Not to say someone else wouldn't like them. Minor cleaning issues on the back o a bathroom door but a trip to the nearby Wal Mart for food supplies & clorox wipes solved that. Booked through Mariott's site & extra requests for pillows fulfilled before we arrived. Pool nice place to relax after a busy day at the parks. Breakfast was a little crowded at times but not unmanageable - plenty of selections from fruits, cereals, eggs, waffles, etc. Room was the 2 story / 2 beedroom. No noise heard from neighbors or slaming doors. Didn't feel scared for my family on the property. Mamagement would always ask if we needed anything when we were in the lobby or if they saw us on property. The Mariott Club lady next to the front desk left daily messages for a free gift but I assumed a timeshare pitch came with it...could be mistaken. All in all it was a plesent stay for the money. Sure it's ot the best place in Orlando, but for our needs, it was more than adequate. Free parking / no resort fee also plays into the picture as most other properties in the area have that as an additional charge.", "title": "Not as bad as everyone makes it out to be.", "user": "KenoReno", "date": "July 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36178190}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My mom, 6 yr. old son, and I stayed here for five nights from June 2nd-June6th. It was great! The room was very spacious and nice. The breakfast buffet was wonderful, and the pool area was very clean. My son keeps saying he wants to go back to the hotel in Flordia. The price was very reasonable. Great for families on a budget - espcially because of the free breakfast buffet.", "title": "Great hotel!! Would definintely stay again!!!", "user": "joshsmomIllinois", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32184771}, {"rating": 2.0, "title": "would never stay again................", "text": "first off...lets start with i am a hospitality employee, so i know what standards to expect....the staff was friendly, but other than that...not too much good to say. It was raining when i checked in, so after being given my keys upon check in...arrived at the room to wade thru 3 inches of water to get the front door. this hotel has a huge drainage issue...then i was moved to another room that had door lock issues and maintenance had to come and let me in my own room...twice in one day had to have the door keys reprogrammed...needless to say........i checked out early and went to another hotel...would never stay at this hotel again...NOT to mention...was a mile or so from the convention and the hotel management chose not to have bus service to a major trade show....was crazy and not worth the drive....", "helpfulness": 3, "user": "caseyann", "date": "December 13, 2008", "id": 22688098}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This is an older Residence Inn, probably one of the first built by Marriott. It's a two story walkup, with an old kitchen. The hotel need a renovation. Compared to the newer ones, it's pretty tired. Dragging your big bags up the narrow stair case is a chore. But it's pretty popular judging by the full parking lot. I wouldn't stay here again.", "title": "Tired old Residence Inn", "helpfulness": 2, "user": "johnsmith47", "date": "August 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 18780518, "likes": {"liked": "— Price", "disliked": "— No elevator and tired worn out interior."}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 29, "average": 46, "very good": 77, "terrible": 11, "excellent": 72}, "aka": "Residence Inn Orlando International Drive Hotel Orlando", "slim_ranking": 0.617021276596}