{"user_rating": 4.5, "review_count": 383, "name": "Residence Inn Virginia Beach Oceanfront", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "On the beach, oceanfront view, allow pets, valet parking, super clean....what more could I ask for?", "title": "Great little getaway!", "helpfulness": 1, "user": "Leslie R", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145897628}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The staff was incredibly courteous and accommodating.", "title": "great location, great view", "user": "kylespmcm", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145824184}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Rooms were clean and well stocked. All the appliances functioned well and the front desk pantry sold a variety of food items if you didn't want to go out.", "title": "Excellence service", "helpfulness": 1, "user": "Dawn C", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145756366}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Also, laundry was readily accessible.", "title": "Great Staff, Great Place, Great Space", "helpfulness": 2, "user": "LaVida", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145346997}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "It's right on the beach, every room has an ocean view and it's pet friendly. Couldn't ask for more at the price point. Staff was very accomodating and personable. Rooms were clean. Hallways could use a bit of revamping. Balcony was a bit small and if a/c unit was on the exhaust vented directly on anyone occupying the balcony. Two double beds in the seperate bedroom with one of them right up against the huge picture window, which we thought was fantastic. Easy walking distance to plenty of great bars and restraunts.", "title": "Thank you for making room for us", "helpfulness": 1, "user": "Bellawatch", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144375365}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We go to the Residence Inn Virginia Beach every April and we love it.", "title": "home away from home", "helpfulness": 3, "user": "adrep70", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152724423}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The accomodations are all suites, tastefully decorated and they all look out over the ocean. Each has a little enclosed balcony. They offer a full kitchen.", "title": "Exceeds Expectations", "helpfulness": 2, "user": "jay O", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152534023}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The staff are very helpful and considerate and most of the staff have been there for a few years.", "title": "Overall good stay, just a loud heating unit", "helpfulness": 2, "user": "Roberto F", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 152465263}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The breakfast room offers a great array of breakfast items....hot & cold and the coffee is on in the lobby all the time.", "title": "Stay here only if you plan on an internet vacation - Wifi is horrible!", "helpfulness": 2, "user": "Sunsnowfamily", "date": "February 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152305687}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This hotel is the only \"pet friendly\" accomodation on the beach. The place is immaculate and they also offer free WIFI and for those not bringng a laptop, there is a computer in the main lobby for guests to use.", "title": "the Staff. make you feel at home", "helpfulness": 1, "user": "Lance B", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152039490}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "First, let me state that what really \"broke\" our trip was the weather. We planned a family (wife and two daughters under 12) spring break getaway in Virginia Beach for five days and four nights. The first night was spent with some local relatives and the remainder at a beachfront hotel. When my wife and I travel with the kids, we always try for hotel properties that offer one-bedroom suites w/pullout sofas and some kitchenette amenities. For this trip we also wanted an in-door pool as we knew it would definitely not be swim in the ocean weather.", "title": "Spring Break broken", "helpfulness": 1, "user": "Farmerica", "date": "March 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 155752607}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We settled on the Residence Inn by Marriot and found a $169/night rate that included free breakfast. I also signed up for Marriott Rewards this time. We arrived at the beach on Sunday afternoon with a cold rain and sleet storm passing through. This was the first sign that the weather would not be on our side for this vacation. Nonetheless, we looked forward to spending time together.", "title": "Wonderful Staff", "helpfulness": 1, "user": "Robert S", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155616863}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "The hotel's location was perfect and the room was as described; a very good size for the four of us. However, our first night was a bit of a disaster as we had an extremely loud heating unit that was inexplicably located in the corner of the bedroom across from the bed and next to the television. ( note-heating the room was necessary as the evening temps dropped into the low 30s during our stay). We didn't immediately complain about the noise and only mentioned it when the front desk called to check on how our room was. They sent a maintenance tech to the room promptly, but he did absolutely nothing, said the sound level was \"less than in some other rooms\" and that there was nothing he could do to muffle it. Needless to say, my wife and I had one of the worst nights of sleep in a hotel room of our lives. It was difficult to sleep and stay asleep with the noise. It even drowned out the sound of the television when we tried to use it to block the heating vent noise. I eventually turned the temp down low to keep it from running so frequently, but this had everyone shivering when they woke in the morning.", "title": "HOME SWEET HOME", "helpfulness": 3, "user": "david f", "date": "March 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155483532}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The next morning I complained in person to the front desk and they sent up an extremely competent maintenance manager ( the Monday morning guy as opposed to the Sunday night guy we had at first.) He muffled the door of the heating unit by stapling a towel over the openings and later in the day sent a second tech to add a second buffer towel. He also explained that the heating unit placements in the room are a design flaw throughout the building and that the hotel is gradually correcting it. We really appreciated his candor as well as his efficiency and were very impressed when he offered to have our rate reduced for the first night's stay because of the lack of effort by the first maintenance man.", "title": "Fantastic!", "helpfulness": 3, "user": "TomK959", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155470200}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Along with the colder than expected weather, we also had a few hours without water the next day when a major water main break caused north Virginia Beach to shut off the water supply for repairs. Obviously, this was not the hotel's fault, but this on top of the cold weather and the unrestful first night's stay prompted us to leave a day early and cut the trip short. Upon check out the next morning, the hotel reduced the daily rate by $10 and did not charge a cancellation fee for the early departure. This was acceptable, but my wife was miffed at how the staff was not immediately communicative about the order to boil drinking water that came for the city government the previous day.", "title": "Terrific Ocean View", "helpfulness": 3, "user": "Magothy", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154683309}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We always enjoy staying at this property. The staff is wonderful and we always feel so welcomed. They try to make our stay as nice as possible. We usually visit during the \"low\" season and find the stay very relaxing.", "title": "Wonderful property", "user": "Greyhound56", "date": "February 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151679177}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel is located right on the boardwalk of the Virginia Beach oceanfront, one of the cleanest and most family-friendly beaches on the east coast. It's within easy walking distance of many good restaurants and shops, with everything from beach gear to local saltwater taffy. The staff is wonderful, always pleasant and going out of their way to make sure the guests are happy. All of the rooms have a breathtaking ocean view, with wall-size windows and balconies. If you have pets, they welcome all sizes. Parking is limited out front, but a free valet service is included, and they are quite responsive.", "title": "Great location and staff", "helpfulness": 1, "user": "A_Traveler_from_afar", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150757632}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Let me begin by backtracking before our actual stay. In October of 2012, my wife and I found out that we would be adopting our first child from Virginia Beach. In November, my wife and I visited the area to scout it out. We decided to visit the Residence Inn because we knew they had kitchenettes. Upon entering, we met Lillian who excitedly found someone to show us around the facility. From that point, we knew we wanted to stay there.", "title": "Made starting our family a fantastic experience!", "user": "Jon S", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150117339}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We arrived at the hotel on January 13 with our newborn son in tote and checked into our room. It was very clean and accessible. Most importantly, it provided all the room we needed for newborn items. The breakfast was very filling and fantastic. Darlene was always asking how our son was doing and genuinely cared. The housekeeping staff was always quick to provide extra towels, trash bags, etc. The front desk staff was nothing less than phenomenal. Everyone was quick to help us around the area and provide any needs (I wish I could remember all the names). I guess I can chalk the forgetfulness up to becoming a new dad, but I won't forget the service. I would never hesitate to recommend this hotel to anyone in the area, extended stay guests, or any adoptive families in the Virginia Beach area.", "title": "Thanksgiving Stay at Residence Inn Oceanfront, Virginia Beach", "user": "P L", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 146156362}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "This hotel was chosen for oceanfront location in off-season with great rates. We were visiting with family and needed a one bedroom accommodation for 3. The front desk staff was very friendly and helpful with all aspects of our stay. We were acknowledged as Gold Elite Members and presented with a small bag with a bottle of water and cookies - nice touch! The room was clean and had generous amount of towels for 3 of us. We were notified of limited housekeeping but felt additional toiletries were needed. The ocean view was great and the holiday light display out our window was a bonus. The kitchen facilities were great and had everything we needed. The indoor pool was listed at 82 deg but was not that warm. The tile floor around the pool is very slippery when wet, this needs to be addressed. This hotel allows dogs which we saw on numerous occasions but did not hear any barking. In fact for a sold out holiday weekend, it was very quiet. There is not sufficient parking for guests but they offer valet parking. Our van was parked and brought back in a very timely manner from a secured lot. It was not inconvenient at all. Breakfast was ample with good selection. Overall we were very pleased with this Residence Inn and would stay again but only in off season.", "title": "Nice hotel, a little worn, beware the dogs", "helpfulness": 4, "user": "neilmj", "date": "November 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 146069218}], "location": {"country": "United States", "city": "Virginia Beach"}, "stars": 3, "variance": {"poor": 15, "average": 34, "very good": 104, "terrible": 4, "excellent": 226}, "aka": "Residence Inn Virginia Beach Oceanfront Hotel Virginia Beach", "slim_ranking": 0.0526315789474, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}