{"user_rating": 4.5, "review_count": 377, "name": "Residence Inn Chicago Downtown", "reviews": [{"rating": 5.0, "title": "Convenient and Clean", "text": "If you are looking for a hotel that is close to shopping, the lake and the finest restaurants in town, this is the place. A short cab ride will get you to a Bears, Bulls or Hawks game and if you want to go to a Sox game or to see that other National League team in town, you can always take your car in and out of valet as often as you like without an additional charge. The $47 a day valet charge isn't cheap, but at least you have some flexibility and the car stays on site.", "user": "BeachTravel114", "date": "March 18, 2012", "id": 126268935}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "The hotel is a short walk to Gino's East, Magnificent Mile Shopping, Navy Pier, etc. and there is plenty of night life in the area because this is also the gold coast area of Chicago with plenty of high rise condos.", "title": "We stay here everytime we go to Chicago!", "helpfulness": 2, "user": "Whasabae", "date": "March 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126264542}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel offers a free breakfast in the morning and your kitchen is fully stocked so you can prepare meals or just have some breakfast food on hand for the mornings. It's like staying in a studio or one bedroom apartment in the high rent area, without the high price.", "title": "Great Location. Spacious Room.", "user": "Karkman", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126200305}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This hotel is in a great location. 1 city block off of Magnificent Mile shopping. Close to Cheesecake Factory, H&M, 900 Shopping Plaza, Watertower place and in view of the lake. There were four of us ladies who went for an overnight shopping/sight seeing weekend via Amtrak. We stayed in the 2 bedroom suite. 1 King, 1 Queen and a sofa sleeper, full kitchen and living room. Great view! Quite. Free breakfast buffet offers everything from cereal and yogurt to eggs and make your own waffles. Staff is friendly and they worked with us and our train schedule which required an early check in and a late check out. Total cost for hotel stay for 1 night, $345. Will always stay again.", "title": "Room 310", "helpfulness": 1, "user": "lakedog66", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126093499}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I love the Marriott Chain and this hotel was very good. My wife and I were in town to celebrate her birthday and you cannot beat the location to restaurants, shopping and entertainment. THe room was clean and spacious except for the closet space and bathroom sink area. Those were way to small compared to the rest of the room. Good solid hotel and the staff was Great.", "title": "One word, awesome!", "helpfulness": 2, "user": "McGeepers", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125203144}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were so pleased with the entire staff, they were pleasant, helpful and sincere. We enjoyed everyone from Kristen welcoming us to Tammy and her ablitiy to make sunshine on rainy morning in the breakfast room. We love Marriott properties but we had never come across such a happy and helpful staff each of the 6 days we stayed at the hotel. They put the H in hospitality. The location was perfect for touring shopping and transportation.", "title": "Outstanding staff", "helpfulness": 1, "user": "bandogal", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129728456}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is the 3rd time we have stayed at this property. I cannot say enough about the people who work there as well as the location. All of the employees we encountered were top notch professionals who made you feel welcome and were so helpful and friendly. The front desk staff members were all knowledgeable and worked very hard to accommodate our needs.", "title": "Consistently outstanding!!!", "user": "preciouscottoncandy", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129143512}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "As for the location, it is perfect...walking distance to the Magnificent Mile. The linens were absolutely snow white and beds comfortable. The dining room staff personnel were very hospitable and made you feel so welcome every morning when you went to breakfast. The breakfast was wonderful with the best scrambled eggs you will ever eat. I hated to leave this marvelous hotel...it was perfect...AGAIN!!!!", "title": "Not a good value", "helpfulness": 1, "user": "hawkeyemocha", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 129140758}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "We stayed here on a girls shopping trip for two days. Hotel seemed outdated and old. Value was not good. We had the 2 bedroom suite. It only had one bathroom in the room and it needed a renovation in all areas with the exception of maybe the kitchen. We were given a bottle of shampoo not consistent with the other toiletries leading us to believe that it was from a different hotel. A dirty rag was left in our room and upon arrival there were crumbs all over the kitchen counter. For $389 a night this was way overpriced.", "title": "Wonderful option with kids in Chicago.", "user": "RaeRae79", "date": "April 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128970884}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We went to Chicago with our young kids and wanted a Place that was convenient for adult shopping but also kids things--American Girl store, Children's museum, Navy pier. The rooms were great, inclusive breakfast helper to defer food costs in the city, and the staff were sweet with our little ones. We would definitely stay there again.", "title": "excellent location and stay", "helpfulness": 1, "user": "trav2learn", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127733551}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Spent a weekend here with my daughters and grandaughters for a family \"Chick trip\" Easy walks to anywhere. Two bedrooms with a full kitchen Nice Breakfast was great Couldn't ask for more!", "title": "Loved it!", "helpfulness": 1, "user": "jojosgranny", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130401299}, {"rating": 3.0, "title": "Great Hotel but Watch Your Bill", "text": "When I checked into the hotel, it was early afternoon and they didn't have a studio cleaned yet so they just upgraded me to a two bedroom. Very nice. Everything about the room was great. I liked the bed being that is was pretty firm. But when I found my bill the next morning it had a $27 charge for parking in the garage. I used the trains to get here and didn't bring my car. When I went to the front desk to get a corrected bill, the guy just finishing up with the desk agent said they did the same thing to him and even tried to say he had spent an additional night. Great accommodations but look closely at the bill.", "helpfulness": 2, "user": "gbcdave", "date": "May 22, 2012", "id": 130393171}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I had the weekend from hell, just checking out from a Marriott that induced asthma! I jumped into pet central! I understand that some hotels are pet friendly and all!!! But this one had 2-3dogs everywhere I turned. Maybe I never read reviews prior to checking in, but I must say I have never seen so many dogs in 1 hotel. The rooms were nice, clean, updated and with good views! But breakfast the next morning was a big shame. The upside was free WiFi and 32\" LCDs. Other than that, I would say please insist your guests stay on the floors meant for pets and use the service elevators!!!", "title": "Pet Central!!!", "helpfulness": 2, "user": "Nora0709", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130357709}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "When we stayed here first in December, we received an upgrade to a 1-bedroom suite; this time we were not so lucky, allegedly because the hotel was full. We were told the better studios are on the top floor where we stayed. Although the studio is half the size of the 1-bedroom, it still is larger than a normal hotel room – and of course has a full kitchen. We stayed in a hearing-impaired room which had a special doorbell; a full handicapped room was across the hall. This room had no bathtub, but the shower was large and pretty great. As usual, the room was clean, and the breakfast was more than adequate. We are staying here again next week and look forward to it. This hotel has a great location and is a value for being right there off the Mag Mile.", "title": "Residence Inn Redux", "helpfulness": 1, "user": "ConnieHighland", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130062038}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My fiancé and I stayed at this hotel for the Chicago Marathon in October 2011. The hotel had everything we could have possibly needed: breakfast every morning, free WiFi in the rooms, clean rooms, kitchenette with full-sized fridge and dishwasher. The elevators are a bit small. The hotel is also pet-friendly, so while we didn't bring a dog, it was fun to see those who had taking their dogs out for a walk and getting a dog treat from the concierge. The hotel is only a couple of blocks from Lakeshore and is within easy walking distance of Navy Pier, the Magnificent Mile, the river. No need for public transportation if you're staying at this hotel unless you're visiting neighbourhoods outside of the Loop. Would definitely stay here again!", "title": "Great location, free WiFi and includes breakfast", "helpfulness": 1, "user": "AndreaMHenderson", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129978376}, {"rating": 4.0, "title": "Perfect Location! Super Friendly Staff!", "text": "What a great 4 day stay I had in this hotel in a perfect location. The staff was incredibly friendly and helpful throughout my stay. Donna from Sales was out every morning at breakfast greeting people and making sure that everything was ok with their accommodations. This location is one of the best in the city--2 blocks away from Michigan Ave. and about 4 blocks away from Rush St. Also right across the street from Rosebud Steak House which is a staple in Chicago. Like most Residence inns, this hotel is extremely convenient. No frills but none needed by me. Fitness room is adequate with pretty good equipment. But if the weather is nice go run on the lake. It's only 2 blocks away as well. I HIGHLY RECCOMMEND!", "user": "Gregoryg63", "date": "April 8, 2012", "id": 127496922}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Perfect located in downtown Chicago, 5 minutes away from Wrigley Building, lots of pubs, restaurants and bars nearby. Confortable suite - perfect for 3-4 people, only you have to share the bathroom. Sufficient breakfast options, free wifi in the room, free access to computers in the lobby, nice sitting area for reading, hanging around in the lobby as well. Right across is famous Harry Caray's Restaurant, verytasty food. On the left next street accros - Howl at the moon - dueling piano bar: perfect for a night out with friends! Good choice! Nice view fron the fitness center &pool on the 27th floor!", "title": "Great location, perfect for a city break", "helpfulness": 1, "user": "miles_more", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 126749095}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Went to Chicago for a quick get away (with 60 degree weather in February!) and was more than happy with our choice of this Residence Inn - the room was HUGE, the breakfast and evening happy hour buffet were perfect to tide us over until we seriously hit Chicago's restaurants and the location was quiet and close to everything we wanted to see. The price through Marriot.com was more than reasonable. Parking is expensive but a plus is that it is in and out valet and our car was always ready when we wanted it.", "title": "The BEST location", "helpfulness": 1, "user": "ryebeach", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126653934}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at this hotel for two nights during mid-March 2012. We had two rooms for our family.", "title": "Great service, excellent location, reasonably priced", "user": "GoldenBear_Husker", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126598744}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "A quick list of pluses/minuses for this hotel:", "title": "Great location, great room, great price!", "user": "Flair4GoldBranin", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126389700}], "location": {"country": "United States", "city": "Chicago"}, "stars": 3, "variance": {"poor": 12, "average": 38, "very good": 147, "terrible": 4, "excellent": 176}, "aka": "Residence Inn Chicago Downtown Hotel Chicago", "slim_ranking": 0.367469879518}