{"user_rating": 4.5, "review_count": 100, "name": "Residenza Del Moro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at this lovely residence in July 2011. Quiet (not sure it is always as quiet as the road on which the hotel stands was closed at one end due to building renovations on the street) and seemingly tucked away from the main hustle it was nevertheless in a really convenient location. Our room was spotless and had a very big bathroom. There were some really lovely touches like the turn service including bedside floor mats each evening. As well we discovered that we could order afternoon tea and have it delivered to our room (or the lovely first floor garden) beautifully presented in a teapot and with \"proper\" teacups plus biscuits. I chose this hotel on the basis of the garden and it did not disappoint - we spent each morning enjoying a leisurely breakfast and reading the papers downloaded to the ipad courtesy of free wi-fi. The breakfast food was pretty standard fair and the coffee was not great but the setting made up for it. All the staff we met were very helpful and we rarely saw any other guests so it felt like we had the place to ourselves most of the time.", "title": "Quite special", "user": "cammg", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125265258}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Residenza Del Moro is a charming boutique hotel in the heart of Florence. Our Suite La Limonaia was very spacious with original beautiful high frescoed ceilings, massive and oh so comfortable bed. I felt like a princess waking up in palace. It is just so original and gorgeous and antique. We visited right after the New Year's when it was already 15 below zero. But don't be concerned when travel in the winter it was quite warm in the room. It is located just steps from all the attractions, shopping and restaurants. The service was very good. Staff was nice and helpful. We appreciated free of charge WiFi as well. The bathroom was a nice size and had a bathtub and separate shower.", "title": "Hidden gem in Florence.", "helpfulness": 1, "user": "Helen34438", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123356036}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Our continental breakfast was included. I think breakfast was the only poor part and I would like to see it improved.", "title": "Perfect palace in Florence", "helpfulness": 2, "user": "MarkandCat", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121884675}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Overall this place is full of charm and romance. I would recommend it to couples, friends and solo travelers. I am not sure your little ones would appreciate this small luxury hotel.", "title": "Wonderful Boutique Hotel", "user": "CrestlineMD", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121869203}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Amazing place, great staff, breakfast to die for and our suite (Acova) was absolutely stunning - frescoed ceilings, massive jacuzzi bath, and the biggest most comfortable bed. Stayed here for our 9th Anniversary and loved it - incredibly romantic, and just steps from the best restaurants and shopping streets in Florence. Some very picky travelers (who are probably best sticking ot ther large \"luxury\" chains) may say a little bit cracked and faded in some places, but this is the real Florence - hundreds of years old and absolutley full of character - and everything was spotlessly clean and worked perfectly. An amazing place to stay!", "title": "Palatial luxury in Florence", "helpfulness": 1, "user": "Martin_and_Steggs", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115725799}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed in the Giardenia suite - and were blown away.", "title": "Unbelievalbe room in a non-hotel", "user": "anon73", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133827299}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "The suite is huge, with 20 foot high painted ceilings, 4 poster bed, nice bathroom, lovely sitting room, and a private garden. We didn't see any others, but I am sure they were just as nice.", "title": "Excellent hotel - more than I expected", "user": "DeltaMilesRule", "date": "July 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133200996}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Breakfast is very limited to some cold cuts and cereals. Eggs can be cooked to order for additional fee.", "title": "Peace and Love", "user": "Brisoso", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 129784929}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I wouldn't call this a hotel though. We've stayed in small properties before, but this one felt much less as a hotel and more like a rented apartment. Not a downside, just a vibe I got.", "title": "A true feeling of Firenze", "user": "NancyKrasne", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129254319}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I would say that for 300-600 euros/night, and for only 11 rooms, it wouldn't be too much to ask to throw in some scrambled and hard-boiled eggs, and not charge 5 euros for them.", "title": "Walls like a dream", "user": "AhasverSaoPaulo", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128996337}, {"rating": 5.0, "title": "Excellent in every way", "text": "Traveled through Italy last Summer, Florence was my favorite. This hotel is tucked away quietly but located centrally in Florence. You are close to everything! Walk down to Giovanni's, which is on the same street. You will experience authentic Italian food and hospitality. I'm going back in 2012 and making my travel plans to go back to this place. The staff is friendly and will guide you and treat you like family. This hotel is beautiful in every Italian style way. I love love this place. Make sure you take a trip out to the Tuscan country. The most gorgeous scenery. Florence is \"magical\"... you'll see. And DON'T forget the gelato. I haven't found anywhere in the U.S. that is even close.", "helpfulness": 1, "user": "ehillard", "date": "July 22, 2011", "id": 115664246}, {"rating": 5.0, "title": "A Magical Place!", "text": "We stayed in the Gli Affresco room in May for 6 nights. It was a delightful experience! We were charmed by the spacious, spotlessly clean rooms and the lovely terrace, and the staff was excellent. Most notably was the customer service offered by Carmen, who went one step above at all times to make our stay more pleasant. She seems to possess the managerial qualities that we, as business owners require in our firm. I would highly recommend this hotel to anyone, it is worth the money spent. It was a magical experience we hope to repeat someday.", "user": "dd5304", "date": "July 15, 2011", "id": 115389201}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here only one night but wised we had stayed longer. The staff upgraded us to a suite (the Del Moro Suite) which was absolutely beautiful. We had some wine in the garden in the afternoon, enjoyed the breakfast, the staff were wonderful. Couldnt have been more pleased!", "title": "Magical Place", "helpfulness": 1, "user": "petd0c", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114906063}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I’ve stayed at the Residenza del Moro at the beginning of my tour of Northern Tuscany and it was a perfect, mood-setting start. I’ve got a Marchese Suite and it is really palatial, with a very high ceiling usual for the piano nobile, the first floor where all the ballrooms, halls and other public areas are usually situated. Next morning the breakfast was served for me in the garden, which is also in the same level – one floor above the street. The buffet is not of cruise ship all-you-can-eat-and-more variety, but very European: all the essentials are there but without overflow.", "title": "The closest you can get to renting a Florentine palazzo without actually renting one.", "helpfulness": 2, "user": "Alexander_Suraev", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108898697}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The staff is very friendly and competent – but what else you can expect from a luxury hotel?", "title": "Interesting Stay", "helpfulness": 1, "user": "sunfun18", "date": "May 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 107716132}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My partner and I stayed at the Residenza del Moro for three nights. Beside the fact that the ancient building is very charming there is no point to stay at this place since the service Residenza del Moro can offer to its guests is very poor.", "title": "Speechless..... very disappointing", "helpfulness": 4, "user": "ChiquitaRome", "date": "April 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 104054192}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We were in a - supposed - very nice room, the Limonaia. The bathroom had not been used since longtime, the bath tub was full of dust, the toilet was broken and the shower sinked. When we politely complained they told us that it was not possible to fix it. The following day they offered us to move to another room but we refused.", "title": "Great Hotel", "user": "jawga1", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85998969}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We gave a tshirt for the laundry but, at the date of our departure, the laundry was not ready. Fair enough - they could have sent it to our address asap! After one week they told us that the tshirt was on his way but after two weeks the tshirt had not been delivered to our address... and the hotel manager NEVER called us to provide his excuses. By the way we paid for the laundry!", "title": "simply the best", "helpfulness": 1, "user": "DroitwichTravellers", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85976932}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "In a nutshell: very disappointing! Not worth going there!", "title": "Wonderful end to our romantic break", "user": "iainwho", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84417338}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The Residenza del Moro was the best hotel during our 13 day trip to Italy. The staff was wonderful. Rooms were fanastic. Would return there again. Be sure you eat at the restraurant across the street from the hotel. Wonderful place.", "title": "AMAZINGLY BEAUTIFUL!!!!", "user": "casspu", "date": "October 11, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 82993784}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 1, "average": 4, "very good": 14, "terrible": 1, "excellent": 80}, "aka": "Residenza Del Moro Hotel", "slim_ranking": 0.14347826087}