{"user_rating": 4.0, "review_count": 86, "name": "Residence Inn Pittsburgh Airport Coraopolis", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I stayed there for one night while in Pittsburgh for a youth soccer tournament. The staff was friendly and helpful. The room was ready upon my arrival. Parking was close to the entrance. The room was clean and spacious. Two bedroom unit with two bathrooms, living room area and kitchen. Large, flat panel TVs, shower water temp and pressure was good. The beds were comfortable although the mattresses were a little too soft for my taste. The room was quiet, the AC worked well and had no complaints. Basketball court and outdoor pool on site. Breakfast was very good. There was a variety of hot and cold options to accommodate most dietary needs. The hotel is situated in a quiet street with a great variety of dining and shopping options within a short driving distance. I would highly recommend this hotel and would stay there again.", "title": "Great hotel, location with reasonable price", "user": "zeus751", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127956206}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed at this hotel for less than 6 hours after a cancelled flight in Pittsburgh. It met my needs fine, but if I were to stay longer I probably would've looked elsewhere. There didn't seem to be much around the hotel, especially restaurants. But, the location was very tranquil. Hotel seemed a bit worn.", "title": "Par for Residence Inn", "user": "java3882", "date": "March 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126486455}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Plenty of space for two adults and two kids. The rooms were outdated. I could smell cigarette smoke coming in from one of the bathroom vents. Towels were rough and my wife had some skin irritation. TV channel selection is poor for the children. Expected a little more in January for $200 per night in Pittsburgh near airport.", "title": "Two bedroom", "user": "R J", "date": "January 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 123420851}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed at the Residence Inn Pittsburgh Airport Coraopolis for two nights in December when we were in Pittsburgh for a meeting. I was looking for something near the airport at a reasonable price. This place was just okay. It is looking a little dated and worn, but it would have been okay except for one major inconvenience -- none of the sheets fit on the beds! I don't just mean a little bit, I mean that the sheets hardly eve covered the bed. You couldn't even just try to get in in the most careful way -- by the time even the soundest sleeper woke up, you would find you'd been sleeping on the mattress directly. Ugh. Hey, Residence Inn, get some decent linens, okay? That's just a minimum standard for any inn or hotel.", "title": "Can't they find sheets that fit?", "helpfulness": 1, "user": "Sarahste", "date": "January 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 123282834}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The location was great - a quiet spot near a shopping center area, and about 10 minutes from the airport. The rooms are regular Residence Inn suites, so they are spacious with average-quality furnishings. This place is showing its age, and the rooms and lobby have obvious wear-and-tear. There are not elevators in all the buildings.", "title": "Good location, so-so room", "user": "Renaissance_Anna", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120436606}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "My family and I travel back home from overseas every summer and we use Pittsburgh Int. Airport as our final destination. We've stayed at the Airport Marriott on several occasions because we like the chain, but now with two children we need more space. The Residence Inn is exactly what we like in a hotel. Location was just a short distance from the airport and just one exit away from all the popular restaurant chains, stores and groceries.", "title": "Why didn't we stay here before?", "user": "mauncg", "date": "June 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132917215}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Check-in was fast and friendly. They gave us a second floor room with both elevator and stair access. The location (Room 230) was perfect since we spent a lot of time on the sports court and in the pool. Everything, from the room, to the lobby to the pool was immaculately clean. Breakfast the next morning was good and my son especially liked the fact that he could make his own waffles with all the fixings. The front desk manager that morning was very kind and helpful when I inquired about a late check-out, which we were given.", "title": "Unfortunate", "user": "Deanna A", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 130435635}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We will definitely be staying here in the future.", "title": "Pittsburgh getaway", "helpfulness": 1, "user": "Gbaz13", "date": "May 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129999454}, {"rating": 4.0, "title": "Nice hotel, great staff, near airport", "text": "This hotel could have been great. The rooms are pleasant enough but need new furniture and carpeting. The sofa, armchair and beds were all so soft you sank into them at least a few inches. The windows do not insulate from the noise of the trucks on the highway. The staff was friendly and helpful even though they had not opened the pool yet and it was in the high 80s. The hotel is smoke free but you could smell smoke in the hallways and it was apparent that some of the residents smoked at least outside of the building. The breakfast was good and the person who cleaned the rooms did a good job. The downside was that we had quite a lot of stink bugs in our bedroom. We killed at least half a dozen but some got away. Don't stay in room 389. When I mentioned this to the front desk clerk upon leaving, she merely thanked me for telling her. She didn't apologize or offer a discount for having to share the room with these uninvited guests.", "user": "OCTodd", "date": "May 9, 2012", "id": 129675640}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stayed here while going to a Pirates game. Check in was a breeze. Room was clean. The reason why I rated so low was because of the horrible customer service. They were in the process of changing the tvs. The tv in my room wasnt working. When I called the front desk, was told to track down the installers myself. Seemed as if I was bothering her.", "title": "Just Okay", "user": "Liz B", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 4.0}, "id": 129307785}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The property consists of multiple buildings. The rooms are plenty of space, including a small living area, small kitchen, bedroom, and bathroom. Everything was clean. Was easy to blackout the room to block out parking lamps and sun. There is free breakfast and free after-work get-together, although I didn't participate in either. There is also free internet, which worked just fine.", "title": "Clean, roomy, with small kitchen", "user": "brian796", "date": "September 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140881136}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I don't think the property has an exercise room. Also expect a mixture of business travellers, airport travellers, and long-term stay persons.", "title": "If you don't have dogs, don't stay here", "user": "tballmom101", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 139033419}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "So, I think it's really nice that this hotel allows pets. It is very hard for people traveling with dogs to find a decent hotel. This hotel is perfect for them. However, if you don't have pets...um, not so much... I found the elevators smelled of pet urine. In July, with the warmth, that's not very pleasant. The rooms were older. They could definitely use some modern decor. The kitchenettes are wonderful. The staff was very pleasant. The lady that works the 'happy hour' in the evenings is a hoot! The pool area is nice. The breakfast is nice and features a nice variety day to day. Plenty of hot & cold options. They do not have ice machines in their buildings! That was extremely inconvenient. All hotels need ice machines. The luggage carts are VERY hard to come by. When you do find one, it's covered in pet hair. I think they do the best they can with what they have, but there is room for improvement. I think if they just used one of the buildings for 'pet' rooms, it would be much better. The pets are scattered randomly, and I didn't enjoy a barking dog in the room next to me. I would never bring my barking dog to a hotel that would disturb others.", "title": "Great experience, Wonderful staff!", "user": "meggy1017", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 138035120}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have stayed at this residence Inn a few times and am always pleased. My most recent trip was with my family, including twin toddlers. The staff really went out of their way to be helpful and kind to us. The kids loved the attention and we hated to leave. Everything was clean and well stocked in the room. The suite was spacious. THere is a marketplace so you can get snacks and drinks. They have complimentary drinks and snacks during weeknights, which is so nice too. Including beer and wine. The breakfast spread was excellent, with eggs, pancakes, sausage, oatmeal you name it. The airport shuttle was fast and the drivers were friendly. We really enjoyed out stay, and plan to stay here anytime we fly in and out of Pittsburgh. The only minus I can think of it is out of the way but the shuttle from the hotel can sometimes take you to a restaurant. You won't be disappointed.", "title": "Fantastic Staff", "user": "James6214", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137922872}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The staff after the first day greated me by name and were always well dressed. The dining was fantastic and the rooms were great. The cleaning was good and they were able to acomodate cleaning at night", "title": "Never a problem", "user": "packmule92", "date": "August 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137830757}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My family and I stayed at this hotel from Aug. 10-18, 2012.", "title": "Lots of room for family", "user": "fannymay25", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137724768}, {"rating": 4.0, "title": "Great place to stay prior to flight", "text": "I had some trepidation with staying here after reading the reviews but with two 12 year old boys, we really needed for them to have their own space. Check in was a breeze and the staff were very helpful and friendly. The rooms were clean and spacious though the decor is definitely dated and the couch and chairs have seen better days, very uncomfortable if you are sitting for any period of time. The air conditioning in the room was a little loud however, the \"white noise\" made sleeping easy. The housekeeping staff were very good and always kept towels and supplies well stocked. The pool and spa were very clean( and warm) , and the breakfast was varied with a choice for everyone. It was a 5 minute drive to restaurants and stores, and the empty parking lots of businesses nearby ( in the evenings) is a great spot for kids to skateboard or roller blade. When travelling with kids, I would definitely stay again at this hotel ( I understand from the staff that they will be having an update of their rooms at the beginning of 2013) . When booking this hotel, keep in mind that it is not a luxury hotel and that guests are often there for a longer term stay. As the suites are outfitted with kitchens, you will smell food odours throughout the halls . Having a BBQ available for use was very convenient as was the managers social from Mon. - Wed. evenings where you could have an alcoholic or non-alcoholic beverage and a light dinner ( no cost to guests).", "user": "B1Brian", "date": "August 2, 2012", "id": 136075383}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "This hotel was good value for our money and we would stay here again.", "title": "A real stinker of a property", "helpfulness": 1, "user": "dru37", "date": "August 1, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "rooms": 1.0, "service": 1.0}, "id": 136017293}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I have stayed in many Res Inns and this is on par with most of them. The rooms a clean and nice and the bed is comfy. Fan in the bathroom was a little noisy as was the A/C was a little loud, too. Really nice reception with some local delicacies served up along with plenty of free adult libations. The lady who monitored the activity was a hoot. Very outgoing and fun. Kudos to her! I rarely get to Pittsburgh but would certainly stay here again. Like another review said, getting to the airport is a five minute drive.", "title": "Great Place to Stay to Catch an Early Flight", "user": "timeout4travel", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135450830}, {"rating": 5.0, "title": "Wonderful stay", "text": "Oh boy, where to start? How about check-in day. Room is 80+ degrees and we call the front desk. The good fellas from engineering come, explain that previous ownership installed screws inside the thermostats to prevent guests from turning down the a/c, and proceed to remove said screw. Now we're cool. Next, the phone rings. It's our friendly neighbors on the ground floor (we're on floor #2) complaining about the noise we're making...\"keep it down, we're trying to sleep\". Problem is, we're making no noise. So what's the issue? Walking on our level shakes the whole building, making it seem in the level below that we're having a raging party. Next, the front desk calls. We need to keep it down, the neighbors are complaining about the noise we're making. Oh boy.", "helpfulness": 1, "user": "sumisukuri", "date": "June 30, 2012", "id": 133103135}], "location": {"country": "United States", "city": "Pittsburgh"}, "variance": {"poor": 5, "average": 13, "very good": 37, "terrible": 1, "excellent": 30}, "aka": "Residence Inn Pittsburgh Airport Coraopolis Hotel", "slim_ranking": 0.411764705882, "description": "Just 5 miles from the Pittsburgh International Airport and offering free shuttle service from 6pm-11pm daily, the Residence Inn Pittsburgh Airport Coraopolis offers studios and one-bedroom suites all with fully-equipped kitchens, separate living and sleeping areas, ample work space and free high-speed Internet access. This Pittsburgh Airport hotel also serves a free hot breakfast buffet and manager's receptions are hosted Mon-Wed. evenings."}