{"user_rating": 4.5, "review_count": 130, "name": "Residence Inn Shelton Fairfield County", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I booked this hotel through our corporate system, due to the proximity of business I was conducting in the area. I came in on a red-eye to hartford, and made the 1 hour drive to the facility. The desk staff (though check-in isn't until later in the afternoon) found me a room so I could rest and conduct business...which is 'First-rate' in my book. They are close to local food, establishments and traffic routes (although far enough away that you don't hear any of the traffic).", "title": "Great staff-not bad facility", "helpfulness": 1, "user": "smhasert", "date": "March 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14387792, "likes": {"liked": "— Friendly and helpful staff", "disliked": "— limited space for breakfast/managers reception"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "If I had to make a recommendation, I'd say to find a way to get more space for sitting in the main lobby for the breakfast and managers reception. Having so few tables makes these cramped. Minor issue...I'd recommend to others.", "title": "Ok Place, Not as nice as other Residence Inns", "helpfulness": 4, "user": "Tuckers", "date": "August 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 8422367, "likes": {"liked": "— Location was good. Room size was large", "disliked": "— Staff not very professional. Room had seen better days. Not worth the money they charge"}}, {"rating": 5.0, "title": "Well run facility - nicest staff", "text": "We just returned from a one night stay at the Residence Inn in Shelton, Ct. I chose this hotel because of the good reviews here on tripadvisor. I must say, this was not our favorite place. There wasn't anything 'wrong' with it.. Just a few things that made it not a very positive experience.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 1, 2006", "id": 5415339}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "First of all, the front desk staff, although friendly, almost seemed bothered by us coming to check in. It was about 5pm, and there were 3 of them standing there - no one acknowledged us until we said something. The guy who actually helped us check in was nice enough, but he kept leaving to go do other things in the middle of checking us in. Its a 2 minute process, but he couldn't just stay there and do it. He was busy chatting with one of the other workers. It just was not a very professional first impression.", "title": "Good Spot - For Families & Business Stays", "helpfulness": 4, "user": "Beantowngal", "date": "June 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5296846}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "Then we got to our room. It was right there near the front, with the window facing the street. It was so noisy in that room! I thought maybe the window was open, but it wasn't. I needed sleep (we had just driven 5 hours), so I went and asked for another room. Again - I was bothering them by asking... After a few huffs, I did get another room. The soda machine in the lobby was broken, which is probably not their fault. I asked if there was another place to get some drinks. All they said was that they called the Vending Machine people but they had not come out yet.", "title": "A Sagging Mattress Ruined Our Stay at this Hotel", "helpfulness": 4, "user": "CraigCT", "date": "September 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 3898975}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "PROS:", "title": "Very Disappointed", "helpfulness": 1, "user": "Criticaltraveller", "date": "January 15, 2010", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 1.0}, "id": 53567281}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Pleasant and friendly staff", "title": "Would not stay here again.", "helpfulness": 2, "user": "StBernardlover", "date": "December 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 52118689}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Nice complimentary breakfast", "title": "Super location", "user": "nyusual", "date": "May 29, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 31121526, "likes": {"liked": "— Convenient location", "disliked": "— no lift"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Convenient location", "title": "Comfortable and convenient", "user": "Jibster", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 28154212}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Free parking", "title": "Good location, subpar property", "helpfulness": 1, "user": "Ravenduffer", "date": "September 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 19865463, "likes": {"liked": "— away from 95", "disliked": "— shabby exterior"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The beds were very worn, and they kind of slanted in towards the middle. They were actually kind of comfortable, but we only had one person in each bed. IF there were two in one bed, you'd be forced into the center & into each other.", "title": "Nice Basketball courts with Wireless Internet Access", "helpfulness": 7, "user": "biddingforhotel", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3674877}, {"rating": 4.0, "title": "Great find in Shelton with all the perks!", "text": "Jonathan working here weekends for one and half year and working at Ramada Hotel at Straford CT and is very knowledgable of all the hotels in the area and he said this is the hotel he like the most too. I guess when an employee likes his job will work happily and share all his best tips to the customers...", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 2, 2004", "id": 2508548}], "location": {"country": "United States", "city": "Shelton"}, "stars": 3, "variance": {"poor": 9, "average": 12, "very good": 28, "terrible": 4, "excellent": 77}, "aka": "Residence Inn Shelton Fairfield County Hotel", "slim_ranking": 0.5, "description": "Serenely located in the close proximity of many corporations, universities such as Yale and area attractions for the whole family to enjoy, which include The Beardsley Zoo, CT Sports Center and the Webster Arena at Harbor Yard. The Residence Inn offers an ideal location for an overnight stay or extended stay conveniently located just minutes from Perkin Elmer, Bic, Unilever, Prudential and Sikorsky Aircraft and easily accessible to the Merritt Parkway and I-95.Our peaceful atmosphere is complimented by our outdoor swimming pool, BBQ area accessible by all of our guests, basketball court and badminton court, fitness center and free passes to the renowned Fitness Edge Sports Center for all of our guests. Our homelike surroundings invite you to relax, and our community atmosphere makes you feel like you are not far from home. We emphasize the work life balance by offering free Wi-Fi, guest laundry, complimentary hot breakfast and light dinner every Monday-Thursday. Spacious suites feature a separate living room with fireplace, kitchen and eating area, private bedroom with bath and upstairs another bedroom and bathroom. Other rooms include a one queen size bed with fireplace, kitchen and living area or rooms with two queen size beds. Parking is complimentary for all guests. Our mantra for the Residence Inn in Shelton which we hope you also enjoy is:“It’s not a room. It’s a Residence”.Come visit us soon!!!"}