{"user_rating": 4.0, "review_count": 341, "name": "Residence Inn San Diego La Jolla", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We booked here for an event that was being held near by. After staying at many Marriott properties over the years this one left me disappointed.", "title": "I bit disappointed", "user": "monla", "date": "October 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 85513836}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "First of all we had two rooms. They were both clean and well appointed. However, one of the rooms had a moldy pizza left in the refrigerator and the other one wreaked of smoke from a fireplace that was lit on the floor above it. Also, the parking situation is less than desirable. This is a very large property however the parking is rather cramped. We saw two cars receive fender benders in less than 24 hrs. However, it's a great property for families traveling with children.", "title": "Like a vacation home without the price tag", "user": "CaliforniaTraveler73", "date": "October 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 84282526}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I stayed at a penthouse suite which included two queen size beds in the first floor, a separate loft upstairs with a king size bed, two bathrooms, a fully equipped kitchen, and a spacious living room with a fireplace. This particular suite could easily fit six people. The room had a lovely decor with updated amenities; it was overall clean and comfortable. Additionally, they offered free internet access, free parking and free buffet breakfast and snacks in the afternoon. Plus, it's only a few minutes drive from downtown La Jolla and San Diego - but they also offer complimentary shuttle service on weekdays within a five mile radius to certain locations. We paid about $169 total including taxes. You couldn't ask for more! It's like a home away from home. Some minor shortcomings? Check in was a little slow - and our requests for hygiene items were also not immediately forthcoming. Parking on weekends can be a pain too; it was packed when we arrived there in the late evening. Overall though, it was a great stay!", "title": "Good facilities, good location, good service", "user": "jamco1984", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83163234}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I really liked staying in this hotel. Is really well located (malls and restaurants around) in the beautiful La Jolla, CA. The hotel had a lot of renovations happening at this period which was sort of annoying, but everything else was really pleasant. The breakfast is really good and there are free happy hours between monday and thursday. I really recommend it.", "title": "Good location, average experience", "helpfulness": 2, "user": "BrownEyeGirl88", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78561169}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We just returned from a 3 night stay at the Residence Inn w/ our 3.5 yr old & 14mo old. We stayed in a King Studio unit using Marriott points. Overall, we had an average experience, the King studio was a bit too small for our family, but the room itself was ok and the full kitchen was definitely helpful. Free parking is good but lot was small and sometimes parking was very tight.", "title": "Comfortable Stay for 1 night", "helpfulness": 1, "user": "number777", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78500520}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We have stayed at this Residence Inn a couple times on vacation to the San Diego/La Jolla area. Most recently we were here over the 4th of July.", "title": "Never a Bad Experience", "helpfulness": 1, "user": "flygalaz", "date": "July 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71047336}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Pros:", "title": "Great Stay - Clean & Convenient", "helpfulness": 1, "user": "prioritiesstraight", "date": "July 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70821178}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "*Location – Not on a beach nor any great views but in a quiet residential/light business area with plenty of free parking. Very close to the UCSD campus. Easy access to anywhere from here (beaches, shops, restaurants, etc.).", "title": "Less than good experience", "user": "jt_n_3", "date": "June 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 68382484}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "*Quiet", "title": "I love Residence Inn", "helpfulness": 1, "user": "riccoq", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68243557}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "*Very Clean", "title": "Good Location, Great Rooms and Service", "user": "Englishman35", "date": "June 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 66441477}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed here for 4 nights during a vacation to San Diego. We had a studio unit for my husband & me and our 6-year-old son. Our son slept on the sofa bed, which usually works well. The room was a bit smaller than I expected, as we had to rearrange the furniture to get the sofa bed to pull out. The property has about 30 buildings in total. The buildings look similar to lodges. The buildings with the studio units have 8 units per building – 4 on each side, with 2 upstairs and 2 downstairs on each side.", "title": "Comfortable stay. Not luxurious, but wasn’t looking for luxury.", "user": "lkl6300", "date": "August 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 76720879}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed here using Marriott Friends & Family rate and had no trouble with the front desk processing our forms. I had seen another review where the reviewer said they had a lot of trouble getting the hotel to accept their Friends & Family status.", "title": "Different stay from before -watch out for points", "helpfulness": 1, "user": "historyteacher50", "date": "August 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75117420}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Pros: Easy parking. Free Wireless Internet. Great location for activities in La Jolla and points north of San Diego. Breakfast is good. Good closets. Good lighting. Easy check in.", "title": "Think long term.", "user": "callover325", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 74696907}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Cons: Breakfast gets crowded! Go early. I did not see any area for recycling in the hotel (at the front desk or rooms). The bathroom was small.", "title": "Beautiful Suite!", "user": "CaliforniaRoadtrip09", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 73802261}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I stayed at this property in May and we came back down again in July. With the summer influx of soccer teams, camps, families and tourists, the hotel was not as I remembered. Parking lot was filled with huge trucks and SUVs. We paid almost double what we paid in May for a mediocre stay. I could have paid the same amount and stayed at a location close to the beach. Breakfast was so crowded, even though we went early, and we could not find a seat. I had called the manager Mr. Flores to call me if there was any opening for a penthouse suite that weekend. Of course he did not call me but I was able to book it on my own by going on the hotel website.", "title": "Great home away from home!", "helpfulness": 1, "user": "jbarnett01", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72799228}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Breakfast is just crazy, you would think Americans are starving the way these people fed. This accomodation comes with breakfast, the staff tries to keep the areas clean, but yogurt and fruit are in open containers and there are so many dirty adults and children, stay away. The coffee is bad, too. The WI-FI is spotty, it sometimes works. The TVs are cheap flat screen LGs with basic cable. Parking can be crowded late at night. The accomodations are basic but the apartments are quiet. This is a place for families. Location, Location. I suggest you go eat Elijas on La Jolla Villa Drive for breakfast, nice clean quiet diner. There are several grocery stores nearby, Ralphs and Whole Foods, and CVS are all there. I suggest you buy food/drinks for when you will be in the apartment.", "title": "Pigs Eating at the Trough", "user": "MarianaG", "date": "November 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88309826}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Spacious, convenient and well suited for kids, the Residence Inn in La Jolla worked very well for our family and also for other families going to the wedding in La Jolla. The complementary breakfast buffet was delicious and so filling we often skipped lunch. I would highly recommend this place.", "title": "La Jolla - Perfect for a family!", "user": "letsmiles", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86433529}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "This Residence Inn is great for families, as the breakfast and dinner buffets provide enough variety for children. Many families stay at this hotel, and there are several outdoor BBQ grills for families to gather and cook their own food.", "title": "Good Family Hotel, Bad Business Hotel", "helpfulness": 1, "user": "ScarfGirl85", "date": "November 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 86229001}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "However, as a business traveler, I did not particularly care for all the children running around the premises unsupervised. Because of the amount of casual travelers at the hotel, the breakfast and dinner buffets turn into a messy food-war zone, with food spilling all over the serving area.", "title": "Party Central in the Room Upstairs", "user": "XQU", "date": "November 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 86220425}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel was recently remodeled, which I quite like due to its modern decor and color scheme. The rooms are quite new, which is nice. However, there is no one-bedroom apartments, only studios. The front desk could attempt to be friendlier.", "title": "disappointed, not worth the price", "helpfulness": 2, "user": "ponderingsam", "date": "November 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 85621595}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 22, "average": 42, "very good": 129, "terrible": 13, "excellent": 135}, "aka": "Residence Inn San Diego La Jolla Hotel La Jolla", "slim_ranking": 0.391304347826, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Thrive on extended stays at the Residence Inn La Jolla, California hotel with refreshing amenities, spacious suites and convenient lodging near top attractions. Visit one of the many nearby breathtaking beaches and coves, unique shops and Torrey Pines, the legendary La Jolla golf course. Our all-suite hotel in La Jolla offers easy access to Balboa Park, the famous San Diego Zoo, SeaWorld and Legoland. During your stay, enjoy relaxing services provided by the La Jolla Spa MD or dine at the best San Diego restaurants nearby. Start your day off with a free hot breakfast buffet and end it with a complimentary social hour every Monday-Wednesday. All of our suites in La Jolla, California offer fully equipped kitchens and separate living and sleeping areas. Business travelers will appreciate our large, well-lit desk and free high-speed internet. When you're looking to relax, take a dip in our heated pool, soak in the spa or have some fun playing sand volleyball. We aim to be your favorite La Jolla all-suite hotel."}