{"user_rating": 4.0, "review_count": 723, "name": "Residenza Cannaregio", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The hotel itself is not the problem. In fact the staff were quite helpful and friendly. The problem was trying to find the hotel. We did our homework before looking for the hotel by asking at the local tourist info desk. The girl working there circled the wrong area on our map - not a good start. Spent hours looking for the hotel and it didn't help that many of the locals didn't know of the address or the hotel! I'll suggest buying a detailed map of Venice as the hotel is in the Jewish Ghetto area and not in the central tourist area of San Marcos.", "title": "Difficult to find", "helpfulness": 3, "user": "awc825", "date": "February 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4410083}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We had a weekend in Venice as our first wedding anniversary gift to each other. The hotel is lovely - away from the main hustle and bustle it is in the lovely unspoilt Ghetto area of the city.", "title": "Beautiful Hotel - will be back", "helpfulness": 13, "user": "JandSDerbyUK", "date": "January 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4348538}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "A pleasant walk to the water bus stop through winding alleys and small shopping streets. Places to eat nearby.", "title": "Nice hotel", "helpfulness": 3, "user": "NomadoUk", "date": "January 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4332077}, {"rating": 4.0, "title": "Highly Recommend", "text": "Hotel - we stayed in a room with a canal view - a mezzanine bedroom with beautiful exposed ceiling tiles and beams - bed was big and comfy! (tv was there is you like that sort of thing in the bedroom)Furnishing contemporary wood - squarish. The main room below had leather sofa, TV, mini bar, pc terminal and huge windows to see the canal.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 9, 2005", "id": 4103003}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The hotel was wonderful. Very modern and updated. Great setting. The breakfast was American and good. 1/2 mile from a vaporetto stop S.Alvise", "title": "4 Star at least", "helpfulness": 4, "user": "Termc9074", "date": "March 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4729374}, {"rating": 5.0, "title": "residenza cannaregio", "text": "Stayed at the Residenza Cannaregio in the old Jewish area of the city.The hotel had been modernised the rooms were spotlessly clean and the staff extremely helpful.Our rooms were ready eventhough we arrived early.It is quite a walk from St Marks square but you explored more of the city because of this (and more of the bars!)", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 7, 2006", "id": 4590408}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Also in this part of the city visit an old coffee shop where they roast their own beans called Tostatura Giornaliera on the Rio Tera S.Leonardo.", "title": "lovely hotel", "helpfulness": 15, "user": "wiltshirelass", "date": "March 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4590010}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My boyfriend and I visited the Residenza Cannaregio at the beginning of February this year. Firstly, what a fabulous time of year to travel to Venice, the weather was perfect, chilly, but clear blue sky every day.", "title": "Peaceful retreat", "helpfulness": 6, "user": "MiddlesbroughVal", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4566417}, {"rating": 5.0, "title": "A Great Hotel", "text": "The hotel was lovely, quiet, and out of the main tourist area. We didnt find it hard to find at all, a little bit of research, and the entire journey from the airport to the hotel took us little over an hour, and cost us 15 Euros each.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 17, 2006", "id": 4466183}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Really enjoyed this hotel. The room was great. We had a lounge downstairs and bedroom upstairs. It was extremely quiet ( I hear everything and heard no noise from the room ).", "title": "Great hotel", "helpfulness": 2, "user": "GeoDevon", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8661877, "likes": {"liked": "— the room", "disliked": "— breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The only complaint was the poor breakfast. Very little choice. Cold tea and coffee..........but I was happy because I had slept well.", "title": "Good Value !", "helpfulness": 2, "user": "trottersontour", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 8537055, "likes": {"liked": "— Quiet yet convenient location.", "disliked": "— Old world charm, and peace and quiet."}}, {"rating": 5.0, "title": "Loved Cannaregio!!!", "text": "Recommended.", "helpfulness": 2, "user": "CC7Bern", "date": "August 29, 2007", "id": 8534682}, {"rating": 5.0, "title": "Top Hotel", "text": "This is a really good, value for money hotel.", "helpfulness": 2, "user": "Gurugilly", "date": "August 29, 2007", "id": 8534391}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff are very friendly, proffesional and helpful.", "title": "Perfect...", "helpfulness": 2, "user": "lansonlady", "date": "August 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8504173}, {"rating": 4.0, "title": "Nice hotel", "text": "We had a great time. Dont believe anyone who says its hard to find. Get a map! Remember Venice's alley ways are like our roads. Modern hotel, we had a large room on two levels. Breakfast was ok. We didnt use the restaurant as there were loads of other places nearby.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4089462}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Arrived on 10/7 and stayed for a week. The rooms are hip, spacious and comfortable. We chose the location to escape from the hustle and bustle after long days of exploring. The neighborhood is perfect for mingling with locals. The location is terrific - just a couple of blocks away from the St. Alvise vaporetto once you arrive, then only 15 minutes to Rialto and just under 30 to San Marco (walking). We only took the vaporetto twice - the best way to explore Venice is on foot. The staff are lovely and go out of their way to be accommodating. Finished our evenings sipping on a prosecco in the cool bar or outside in the courtyard. Highly recommend this little gem and will definitely stay there again when we return!", "title": "This hotel rocks!!!", "helpfulness": 9, "user": "AmyMc11", "date": "October 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4043048}, {"rating": 5.0, "title": "Great value. Great location. Highly recommended.", "text": "I too would go along with just about every other review of this hotel. Having been to Venice before, this has to be one of the best in the city. Sure there are 5* hotels overlooking the Grand Canel but if your budget doesn't quite stretch to over £500 a night then go for the Cannaregio.", "user": "Art4All", "date": "November 10, 2007", "id": 10736667}, {"rating": 5.0, "title": "Recommend this hotel to anyone!", "text": "It's in a quiet location but easily walkable to all sites. Anyone who's experienced Venice during the summer season or on holiday weekends (and the tens of thousands of fellow tourists clogging the narrow streets and squares), returning to the calm of the Cannaregio is a real delight. Other benefits are that it's a reasonably short vaparetto ride from the airport. If you want to spend 100+ euros on a one-way water taxi then fine but it never ceases to amaze me that people are happy to pay these exhorbitant and over-the-top charges. Having paid just 24 euros for a more than enjoyable return vaparetto trip to the Marco Polo airport, the thought of getting to and from airports like Heathrow, JFK, Narita etc in the future just fills me with horror.", "user": "jamaicabound22", "date": "October 27, 2007", "id": 10373485}, {"rating": 4.0, "title": "Quiet hotel, remote location", "text": "Cannaregio staff are very friendly and helpful. Although the bedrooms (including deluxe ones) are certainly more than adequate they're not quite luxurious and whilst the breakfast, for some, may be a little disappointing, this is really just nitpicking. The hotel is spotless and I couldn't find a fault with it. It was also probably the quietest hotel I've ever stayed in and it was nice not being pestered by staff checking the mini-bar or offering a turn-down service at every opportunity. Never quite sure what that's about anyway?", "user": "FreedomTravel", "date": "October 25, 2007", "id": 10318113}, {"rating": 5.0, "title": "GREAT! Would most definitely stay here again", "text": "Overall: HIGHLY RECOMMENDED.", "user": "bagelflip", "date": "October 21, 2007", "id": 10205799}, {"rating": 5.0, "title": "Excellent hotel", "text": "We stayed at the Residenza Cannaregio for three nights and were completely satisfied with everything about it!", "user": "39stepsBrussels", "date": "October 17, 2007", "id": 10089397}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This was the first time we traveled to Venice and the fifth city that I had visited in Italy. Therefore my assessment is based on comparison on other hotels in other cities and countries.", "title": "nice hotel but perhaps better hotels can be found?", "helpfulness": 2, "user": "screenname060309", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 11670045, "likes": {"liked": "— cleanliness, price, staff", "disliked": "— odd location?"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel has certain characteristics that might be interesting to know. On the positive side, one can mention that the hotel is very clean and the staff very helpful. We had no problem with any issue that could be solved.", "title": "Excellent stay", "helpfulness": 4, "user": "eylon", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11576181, "likes": {"liked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "There were however some details, that new guests should be aware of:", "title": "Noisy rooms", "user": "araf", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 11147770, "likes": {"liked": "— in quiet residential area", "disliked": "— lack of soundproofing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I called the hotel beforehand and asked about directions. Coming by Ryanair and landing in Treviso, I was advised to take the bus shuttle to Venice and afterwards take the water bus (vaporetto) line 52. We did this but when we arrived at the station called Saint Alvise, it proved not very easy to find the hotel. I have taken a picture of the map that demonstrates the address to the hotel with the bus stop marked with an arrow. It is actually very easy to find the hotel. Leaving the station and moving straight away form the stop there are two bridges. The hotel is close to the bridge on the right. I am writing this because the hotel area was rather deserted at night and it could be very difficult to find the hotel if we had not somebody to guide us. It could be frustrating since the streets are dark and name of the streets seem to be hidden and incomprehensible. The sign to the hotel is also very small and not at all lit. I met some other tourist having the same problem with other hotels, so maybe it is not unique problem for this hotel.", "title": "Beautiful!", "helpfulness": 2, "user": "brutte78", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11130425}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The fact that the hotel is a little bit off tourist track can be both a blessing and also problematic. When you want to come back to the hotel during the day, it would be rather difficult to go back outside again if you are very tired. It is only 5-7 minutes back to the tourist track and not much longer.", "title": "Great hotel, lovely location, even at high tide!", "helpfulness": 2, "user": "Julie27", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11077956, "likes": {"liked": "— Clean rooms, excellent service"}}, {"rating": 4.0, "title": "Nice hotel but not without issues.", "text": "Nice hotel with clean, comfortable room. The staff was fine. Not a rant or a rave about them. The location is a bit out of the way. it was a 60 Euro water taxi ride to the hotel from the train station. It took maybe 10-12 minutes. The water taxi ride to the airport from the hotel was 100 euro. The hotel restaurant was pretty bad (both service and food). The bar was small but nice. The woman attending the bar on our first couple of days was rarely there. I'd have to go looking for her. The last day we had a very nice attentive bartender. Our stay wasn't bad but I'm sure there are better options in Venice.", "user": "NewEnglandSteve", "date": "October 13, 2007", "id": 10074736}, {"rating": 4.0, "title": "Good Hotel, average room", "text": "We find it interesting that almost all of the reviews are generous when describing the rooms. We found our room of less than average size for the price and we were unable to get a positive result from the air conditioning. It was noisy and had a habit of turning itself off. Having said that the reception staff said that the AC was centrally controlled and showed some surprise when I reported the noise factor to them. It was still noisy when we left, 5 days later, on the 11th October. For that reason I would suggest that you avoid room 227. Our friends room was somewhat larger with AC which was both quiet and effective. Luck of the draw.", "user": "YokelNorthants", "date": "October 12, 2007", "id": 10070626}, {"rating": 5.0, "title": "Best hotel you could find in Venice", "text": "Everything else about the Hotel was first class, including very friendly staff. Breakfast was adequate, with hot coffee, fresh fruit and usual fare for Italy. Have to agree with others that the \"fruit juice\" is difficult to identify by taste.", "user": "Minhao", "date": "October 2, 2007", "id": 10029430}, {"rating": 5.0, "title": "Perfect!", "text": "Being a four, we found the water taxi's to and from the Airport excellent, quick and good value.", "user": "Indyrk", "date": "September 18, 2007", "id": 8751733}, {"rating": 5.0, "title": "Exceeded All Expectations", "text": "We didn't get lost once due to the Hotel map Chiara (She answered my e-mail) sent us some time before we left the UK.", "user": "Mari1", "date": "September 13, 2007", "id": 8707894}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 28, "average": 61, "very good": 321, "terrible": 11, "excellent": 302}, "aka": "Residenza Cannaregio Hotel Venice", "slim_ranking": 0.377952755906, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}