{"user_rating": 4.0, "review_count": 341, "name": "Residence Inn Philadelphia Center City", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Thanks to Josh, a front desk staffs and I believe he is one of the best front desk staffs in this hotel. He is very accommodating, pleasant to deal with especially feeling exhausted after traveling for many hours from our trip, I find him very helpful. Indeed there is a rude night front desk staff we have encountered with during our stay though, just be aware. In general, this place is good.", "title": "Good location. Staff service is good except one.", "user": "Ranaldo", "date": "September 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 41628045}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This was my first stay at a Residence Inn. I booked it due to its proximity to the Pennsylvania Convention Center (on Penn Square, a 5 min walk to the CC). I also knew I'd be in my room (working) quite a bit, so I wanted a larger room.", "title": "Excellent Location for the Convention Center", "helpfulness": 2, "user": "Moffman", "date": "September 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41312037}, {"rating": 5.0, "title": "Marriott Should be Proud", "text": "I got their standard jr. suite, which has a king bed, plus a quasi-separated sitting room / kitchenette with fridge, cooktop, microwave, coffee maker and dishwasher.", "helpfulness": 2, "user": "NJHistoryGal", "date": "September 6, 2009", "id": 39949265}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The little workdesk is ok, with a relatively comfy chair, but not exactly ergonomically friendly ... but I've yet to find a hotel with a good workstation that doesn't hurt my neck/back/etc.", "title": "fantastic value and location", "user": "khhensley", "date": "August 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37927137}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I was on the sixth floor, and there was some traffic noise. That doesn't bother me, but be advised that you should ask for a higher floor if it does bother you.", "title": "OK. A few hiccups, but good value in a great location", "user": "Jim_PSU", "date": "August 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 37558958}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Every year we go to Philadelphia for a few nights to show our son something new.", "title": "Good Family hotel", "helpfulness": 1, "user": "trvldivaPa", "date": "October 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46888719}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "We chose to stay at the Residence Inn City Center, Philadelphia. Hotel is very central and directly on the Philly Pflash route. We love using the Philly Pflash to get around. Hotel was clean and comfortable. Our room was plenty big for the three of us. We had a King bed and a double sleeper sofa. It also has a table, chairs, microwave, full size refrigerator, stove and all the utentils you would need to make your own meals. Our room over looked Market Street and it was fun to watch the city night life from our window. The hotel has a large breakfast room with plenty of tables and chairs. There are even flat screen Tv's to get the morning news! Very nice selection for breakfast!", "title": "Nice place, but staff....not so much.", "user": "RoseOfMexico", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 46507890}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Right around the corner to the left is a Dunkin Donuts, to the right is a convenience store for film, snacks,souvenir, ect. Down the street about 3 blocks there is a Chili's restaurant. It is a great restaurant with varied family menu. We usually go there everytime we are in Philly. From the location, to the rooms, to the complimentary breakfast this is a great hotel for families.", "title": "Good location to sight-see", "helpfulness": 1, "user": "Rhino2525", "date": "October 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46491822}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Pros: very convenient to shops, restaurants, great view of city hall, gorgeous/comfortable room, free (huge!) breakfast!", "title": "Nice place, very convenient", "user": "SherieVL", "date": "October 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46425079}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Cons: Park your car there (no where else to park!) for $35 with valet! Went to check in & clerk said my reservation was not paid for (I went through priceline)....took approximately 45 minutes to clear this up - very annoying when it's late at night and I just spent and extra $35 I didn't plan on spending. (clerk even said she did not know who/what priceline was).", "title": "Nicest Residence Inn I ever stayed at!", "helpfulness": 1, "user": "wakeandbake", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45825569}, {"rating": 4.0, "title": "Nice stay, great location", "text": "I'll agree with most of the posts on this hotel. The location is great. If you're up to walking, you can pretty much walk anywhere from this hotel. If you don't feel like walking, but feel like checking out the sites the Philly Phlash stops right outside the hotels front door. We used this service one day to we planned visiting the museum, Eastern State Penitentiary, then going back to the historical areas. For a family of 4 it was $10 for all day off/on services.", "user": "Eric95403", "date": "July 8, 2009", "id": 34184487}, {"rating": 4.0, "title": "A perfect spot", "text": "The room was great. It was a little worn and some of the furniture had cracks, but that didn't effect our stay one bit. After a week in other hotels w/ all of us staying together in one room, it was nice having our own seperate room and having the kids on the sleeper sofa (kitchen always a plus too). The sleeper sofa was supposed to be queen sized, but it was probably a bit smaller. The kids definately didn't have as much room in this as they did a normal queen at other hotels.", "user": "Norfolktravellers", "date": "June 18, 2009", "id": 32630318}, {"rating": 3.0, "title": "Spacious Rooms, Slow Internet, Slower Elevators", "text": "Someone complained about the elevators and internet service. Elevators seemed very quick to us. We stayed on the 14th (actually 13th) floor and with the expection of one time, the elevators were very prompt which actually surprised me. The internet service was wireless and it wasn't as quick as home, but it was still good. I've been in hotels where the wireless was just a waste of my time to even try and log in and use my laptop. I had no problem here, very responsive.", "user": "ericericeric", "date": "June 1, 2009", "id": 31341650}, {"rating": 5.0, "title": "Stayed here for over 40 nights", "text": "Staff (including the valets) were very helpful and friendly. The Reading Terminal was very close (but closes early 5 or 6pm) and had a great selections for food. There are numerous other selections nearby too. You definately won't starve...and if you have a sweet tooth for Dunkin' Donuts, there is one on the first floor on the corner.", "user": "FunPastime", "date": "May 10, 2009", "id": 29690532}, {"rating": 2.0, "title": "Beware Of the Valet Service", "text": "Our three night stay was very pleasant. I wouldn't hesitate to stay here again if I ever came back to Philly. Oh yeah, we also did go to a Phillies game...didn't bother with the subway (the wife was a bit nervous about trying out the Philly subway because of all the homeless in the area and especially with the possibility of traveling late night after the game), we drove down Broad St and it was fairly quick. Just down the road, but many stop lights.", "user": "Bruise01", "date": "January 25, 2009", "id": 23877606}, {"rating": 5.0, "title": "One Night Summer Stay", "text": "We stayed at this Residence Inn as a celebration to pick up our son from his Mission Year in Camden, N.J. Finding the hotel was a challenge, just in navigation, but once we were there the service was excellent. The check in process was smooth, even with us being there 2 hours early. The valet parking was seamless and they were very open about the price so there was no confusion later.", "user": "makua", "date": "August 9, 2009", "id": 37185469}, {"rating": 4.0, "title": "Great hotel", "text": "We had the two bedroom suite and it was very nice and worth the high price we paid. The beds were ultra- Marriott comfortable - even we were wakened to a 4am fire alarm.", "user": "LisaFromTO", "date": "August 5, 2009", "id": 36849699}, {"rating": 4.0, "title": "This is a handsome hotel, but not flashy.", "text": "The breakfast was a good start for the day - bottom line - the service was excellent with everyone we met and I would stay there again if in the area.", "user": "dcdame", "date": "July 27, 2009", "id": 35972335}, {"rating": 4.0, "title": "Good Hotel in a Nice Location", "text": "My boyfriend and I stayed here for one night (for the Billy Joel & Elton John Concert at the Citizens Bank Park). It was great, clean, comfortable beds and free breakfast. It was a bit hard to find and we asked a few locals where the hotel was and they had no clue. We just parked our car in an underground parking garage just down the street, it's right beside the Couryard Marriott and up the street from the Marriott (parking was only $27 overnight versus their $41 I think for valet without the tip!). The parking garage was guarded 24 hours so I felt that my car was safe, which it was. Lots of pillows on the bed and had a great nights sleep. Check-in was fast and when you get into the elevator, you have to put your room key in first before you press your floor which was also a nice safety feature. We were in room 1010 and faced the main road, hear a bit of traffic since it echos but no biggie, still slept fine. Do get to the 2nd floor for the free buffet breakfast before 9AM, no later than that because you can still get your food and get a table before the rush! We got there around 9AM and by 9:20AM, it was packed with people waiting in line to get food and trying to find a table. Some people took their plate of food up to their rooms but if you want more or forget something, you have to go all the way back. Breakfast was okay, you can definitely find something to eat and it's free! By the way, there is a Macy's right beside the hotel!", "user": "Foodie26", "date": "July 22, 2009", "id": 35468889}, {"rating": 4.0, "title": "Good", "text": "If you want a big, gorgeous lobby, a restaurant and room service, this is not your hotel. It does offer an impressive free breakfast buffet. It has everything from cereal and biscuits to eggs, bacon, pancakes and waffles. Also, a 24-hour Dunkin Donuts is in the same block. The hotel's location is great; both subway lines are steps from the front door. The staff was helpful and cheerful.", "user": "benfbrown", "date": "July 13, 2009", "id": 34597422}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3, "variance": {"poor": 31, "average": 49, "very good": 159, "terrible": 4, "excellent": 98}, "aka": "Residence Inn Philadelphia Center City Hotel Philadelphia", "slim_ranking": 0.488095238095}