{"user_rating": 4.5, "review_count": 450, "name": "Residence Inn San Diego Downtown/Gaslamp Quarter", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This hotel is in a prime location within the Gaslamp Quarter. A block from the Padres stadium and walking distance to the convention center. All the restaurants and bars you could want (casual, nice, etc.) within walking distance too. The hotel itself was nice, clean, and did the job! The staff were courteous and helped me with advice on where to run (beautiful waterfront!). The gym was a bit weak. The free breakfast at Residence Inns is a big plus and the rooms were very comfortable. They only had valet parking as an option and it was a bit pricey.", "title": "Great location", "user": "travelnut5613", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157433455}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Very nice hotel. Good location and very clean room. We did not have reservations and they were very accomodating. Asked for a room away from the elevator and staff was very helpful to help out. Lots of good places to eat within walking distance. Breakfast included. Parking is very expensive, not included in the cost for the night stay. There are parking garages close. We parked in a garage right next to the hotel and it cost us $26 for less than 24 hours! My only personal complaint is the bed was too hard. Didn't sleep very well. Not sure if I would stay there again unless I asked for a soft bed (if possible). Free wi-fi. All and all very nice hotel.", "title": "Weekend getaway", "user": "mrsmunkyby", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 157371477}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Residence Inn is becoming my fast favorite. Nice room. Great customer service. Very good breakfast. Close to convention center, about 5 minute walk. Very accommodating for my early morning east coast teleconference. Didn't use kitchen, but looked functional. Reliable wi-fi. Can't ask for much more. Very quiet room.", "title": "Great Room. Superior Service.", "user": "MetroMatch", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157141391}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Great location of this Residence Inn, blocks to Petco, just off the main drag of the Gaslamp and near the convention center. Rooms were laid out a bit odd, as I couldn't see the tv clearly from the bed due to the placement of the vanity, but the service was good and the room was spacious and clean.", "title": "Good hotel, great location", "user": "lawrencemon", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 157095227}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Tip: You can save money on parking by going to the deck less than 2 blocks away on 6th for $10/night.", "title": "Perfect hotel, pefect location", "user": "Marie B", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157074687}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This has to be one of the nicest Residence Inn properties that I have ever stayed in. Ideally located in the heart of the Gaslamp Quarter, this hotel is modern and comfortable. Like all Residence Inns we had a small kitchen, but who needs that with all the wonderful restaurants within walking distance. Breakfast was included in our rate and it was a really nice spread of food with the usual buffet standards of cereal, bagels and fruit, but also included make your own waffles, and hot breakfast items. For those wanting to maintain their fitness routines there is a small fitness center upstairs adjacent to the pool. Although I did not use the pool, it is small and doesn't appear to get a great deal of sun. But San Diego has great beaches instead.", "title": "One of the best Residence Inns I have stayed at", "helpfulness": 2, "user": "WHERESWAUGH", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159646675}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My only minor complaints were that there was no in-room safe and the parking through the hotel is expensive - $38 night. There are plenty of self- park lots nearby, but they don't have the in and out privileges that the hotel valet had.", "title": "met all expectations", "helpfulness": 2, "user": "marcnjerri", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159581716}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "If I found my self in downtown San Diego in the future, I would definitely consider staying here again.", "title": "Great location...thats about where it ends", "helpfulness": 5, "user": "Jessica M", "date": "May 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 159544994}, {"rating": 5.0, "title": "Super stay", "text": "helpful and pleasant front desk staff, nice room and bathroom, kitchette was a plus with refridge, quiet, good location near restaurants, nightlife, convention center, etc....easy to walk to many attractions from here", "user": "Bulldog92", "date": "May 2, 2013", "id": 159436244}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I just spent the last week here on vacation with my husband and one year old daughter. The location was nice to be able to walk around and get a bite to eat but terrible when it came to wanting some peace and quiet at night. All weekend long there were people hollering and sirens outside our window well into the early morning.", "title": "Great location, service and breakfast were terrific too", "user": "Jolysa", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159363175}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "My husband loved the big refrigerator. This hotel offered good value, it was fairly spacious, clean, friendly staff and good location. The breakfast was good. The layout was awkward as the bathroom sink light , which was outside the bathroom, shone brightly on the bed and the TV was on the wall, parallel to the couch! making it hard to see the TV from the couch. There was a World Market nearby where you could stock up on beer, wine and snacks.", "title": "Good for long term visit", "user": "PittsburghBambi", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158713465}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The service was great. I especially appreciated the kindness and hospitality of Cathy the front desk receptionist. She was fantastic! When we arrived there was a complication with the billing of the rooms. Cathy was very thorough and accomodating. She made sure we understood what was happening and why. She made sure our questions and concerns were addressed. Our stay was lovely. Cathy even went the extra mile to write a hand written note wishing me a pleasant stay. She is the type of employee that makes the Marriott, Marriott quality.", "title": "Fantastic!", "user": "Jessica A", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158621503}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "From the doormen to the front desk to housekeeping, the staff were exceptionally friendly and helpful. Our room was well-appointed and felt like an upscale hotel. This Residence Inn is perfectly located within easy walking distance to many excellent restaurants and the water. Loved the breakfasts on the second floor. Truly surprised at how good everything was.", "title": "A Warm Welcome and Stay", "user": "Travel_When_Where", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158402839}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "The Gaslamp Residence Inn is a great hotel, particularly for families. We've stayed at many Residence Inns and this is the top one. Friendly and helpful staff, especially at breakfast. (Make-your-own waffles are a must.) For other meals, loads of choices nearby. Nice outdoor pool, too. Parking ... yikes. About $40 per night, which seems excessive since the hotel rates are not inexpensive. Other parking options nearby. Overall, I wouldn't hesitate up stay here again.", "title": "Outstanding hotel, great location, would stay here again", "user": "hojmatt", "date": "April 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 158243068}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The rooms were very nice - very comfortable for a \"residence\" hotel, which can sometimes feel worn down. This one was newer and nice and had the feel of a more upscale hotel. It was very convenient to the Gaslamp, the stadium and the harbor. I would definitely stay here again.", "title": "Nice Hotel", "helpfulness": 1, "user": "lotusesq", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157847124}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Stayed at RI/Gaslamp Quater for a conference at the convention center last week. This hotel was not on the original hotel conference list but I'm glad we thought outside of the box. Didn't know what to expect but pleasantly surprised from the curb to the front desk to our room.", "title": "Great accommodations - Great customer service!", "helpfulness": 1, "user": "Lily54", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159303734}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Usually with a conference or large business hotel, check-in is less than pleasant due to the volume of people coming and going. We were greeted by a genuinely friendly and pleasant front desk staff member. When asked if it was possible to check in early, we were told our assigned room was not ready but there was another room available. Our bags were brought up by a friendly bellman who kept our car at the curb until we decided where we were going to park - hotel valet or a local lot. We eventually chose the hotel valet.", "title": "Good location, good price", "helpfulness": 1, "user": "Melbourne_FLJill", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 159299288}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The room was great - clean, large, fully equipped kitchenette, great bed, great housekeeping service. The only downside was the street noise on Friday night that lasted until about 2am. Not sure where it was coming from but there was a Padre's game that night and the town was hopping. Would not have minded it but we had an early wake up the next morning.", "title": "Perfect Place to stay", "user": "Dkissel", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159291109}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "-Price included complimentary breakfast of eggs and meat as well as belgian waffles, cereal, fruit, yogurt, etc. and a happy hour with complimentary appetizers.", "title": "Friendly, comfortable, convenient!", "user": "LL137", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159200545}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "-Much closer to the convention center than it looks on a map - easy couple of blocks - 5 min. walk.", "title": "Not your typical Residence Inn", "user": "amylister", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158840971}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 6, "average": 27, "very good": 137, "terrible": 6, "excellent": 274}, "aka": "Residence Inn San Diego Downtown/Gaslamp Quarter Hotel", "slim_ranking": 0.0555555555556, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Embodies the urban and eclectic styles of the modern-day Gaslamp Quarter. Guests enjoy the residential feel and strong sense of space in a comfortable and progressive setting. Start your day with complimentary hot breakfast, stay connected with complimentary high-speed-internet-access and step out into the vibrancy of downtown. Conveniently located just 2 blocks from the Convention Center and PETCO Park. Relax by the lobby fireplace and rooftop pool, rejuvenate in the fitness center and full-service lounge."}