{"user_rating": 4.5, "review_count": 376, "name": "Residence Inn by Marriott Boston Harbor on Tudor Wharf", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We bought a weekly pass for $15 on the \"t\" and took the \"t\" from logan airport to the North Station. It was a quick walk from there to the Residence Inn. A bit hard to locate at first, I found it to be an ideal location as the week went on. Room 719 had a nice view of the water and I was happy to see the windows opened a bit to let fresh air in. Breakfasts were complete, and convenient. We paid $229/night which was fair. The gym was a bit small, I tried to jog outside but got a bit lost. The treadmills had small tv's to watch but there were only 2, and 2 stationary bikes and one eliptical trainer in this small gym. One treadmill seemed broken. Rooms were clean, and spacious. Even tho just my husband and I were in the rooms it was nice to be able to close the bedroom door and sleep while he watched late night tv. Housekeeping did a nice job of cleaning every day. It was a short walk to the north end, lots of great Italian restaurants, Mikes pastry, and the \"t\" station was right next to the Gardens where hockey and basketball are played. We got last minute Red Sox tickets on stubhub and took the \"t\" to the game. Easy to get around by walking or on the \"t\". Bunker Hill monument within walking distance, and a red marking, just outside the hotel makes it easy to follow the Freedom Trail. Our flight didnt depart until 4pm so we got a late checkout at 1 and stashed our luggage at the front desk without problems until it was time to take the \"t\" to the airport. I would stay here again if I returned to Boston. There was a small pool and spa, but I'm not crazy about getting into a tub of warm chlorine so I didnt use them.", "title": "Ideal location, great stay in Boston", "helpfulness": 4, "user": "alacraft", "date": "October 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46481701}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "While this hotel didn't have many buzzes and whistles, it was clean, the rooms were nice, and the staff was very friendly.", "title": "Clean, pleasant hotel, with a friendly staff.", "helpfulness": 2, "user": "whitegown9", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46389637}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I did have room service while I was there as well, and while the selection was limited, the food was delicious and delivered incredibly quickly.", "title": "Very nice stay!", "helpfulness": 2, "user": "DRD", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46202028}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I really have no complaints about this hotel.", "title": "Too much money for the location", "helpfulness": 1, "user": "Corn&Beans", "date": "September 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 39713891}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Great place- fantastic views, nice pool, a short stroll to Bunker Hill, 15 minute drive into Cambridge, just across the bridge from the Italian district. Very friendly and helpful staff.", "title": "Very good choice for a family of five", "helpfulness": 1, "user": "LEllen12", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 39446679}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We stayed at this hotel from wednesday-tuesday with our three children. we absolutely enjoyed it...The two room suite was absolutely convenient for a family of five. We saved so much money on breakfast food. The hotel offers a full hot breakfast too!", "title": "Two Thumbs Up", "user": "boston4life", "date": "December 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51777345}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had a great stay at this hotel when traveling with our 8 1/2 and 5 year old. We had a room with 2 queen beds which was plenty big for us and the bedroom was closed off from the living area which meant when the kids went to bed, we could still stay up and hang out (and they could slip out into the living room in the AM to watch TV and not wake us up right away). The hotel had a great breakfast every morning--scrambled eggs, taco shells, potatoes, cheese, french toast, pancakes, cereal, oatmeal, etc. The indoor pool was small but just fine for our 2 kids every morning and no one besides us ever seemed to use it. We were able to park for free in a small \"lot\" right behind the hotel--we were told by the staff that we were parking at our own risk and were warned of a recent break-in back there but it's an extremely well-lit area, visible from the hotel rooms and we had no problems leaving our car there for the 5 days we were there. The location is about a 10 minute walk to the nearest T station (North Station) and getting around Boston was very easy from this stop. The water taxi was also only about a 10 minute walk from the hotel and took us right over to the aquarium. It's also about a 10 minute walk to the North End which made for lots of great Italian dinners and pastries. Oh, and there's a small playground area in Paul Revere Park which is across the highway from the hotel and on the way to the T station. It's a pretty scenic location too, located right on the Freedom Trail and the wharf with some really nice views of boats and a very cool bridge that is lit up at night which the kids really liked. All in all, we were very happy with our stay, although it was a little pricier than we usually spend on a hotel. But...I guess considering we were all able to comfortably live within one room, our breakfast was included, we had a pool available, and we ended up not having to pay the $30+/night parking fees, it all worked out okay!", "title": "great for family vacation", "helpfulness": 5, "user": "littlegrrl", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8514471, "likes": {"liked": "— free breakfast, size of suite, good location to T station"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This is a clean pleasant hotel in a great location for tourists. A quick hop across the bridge and you're at north station with easy access to the rest of the city.", "title": "Perfectly decent tourist hotel, with REALLY comfortable beds!", "helpfulness": 3, "user": "viross5000", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8457711, "likes": {"liked": "— The really comfy beds", "disliked": "— Poor local knowledge of staff"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The bedrooms are large and clean with a kitchenette. The bed and pillows were extremely comfortable - despite jetlag I slept very soundly! The bathroom was the only disappointment - very small and somewhat shabby, although by no means dirty.", "title": "I Love Boston!", "helpfulness": 4, "user": "OPGatoRx", "date": "July 29, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8255314, "likes": {"liked": "— Great location", "disliked": "— Double billing of hotel stay vs prepaid package"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Breakfast was fine - there is the usual selection of fruit, bagels, muffins etc together with some hot food which varied from morning to morning.", "title": "Wonderful Water View & Comfortable Suite", "helpfulness": 2, "user": "EllenAdena", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8252740, "likes": {"liked": "— The comfort and convenience of a two bedroom suite with a full kitchen."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We didn't eat in the hotel - Boston has some great eating places and we didn't think this would be one of them. However, the terrace is the perfect place for an early evening drink overlooking the marina.", "title": "best hotel", "helpfulness": 3, "user": "Late-Travellers", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8192645, "likes": {"liked": "— great location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our room was immaculate, comfortable & the view was amazing. We were celebrating our anniversary and since we have some food allergies, we consulted Dottie and were so pleased with her recommendation - we ate there twice! Dottie made us feel like we were old friends. She remembered our names, remembered our anniversary, remembered what we did for the day, remembered what we were doing tomorrow and made sure our cab was there when we needed it. We were having a great weekend but Dottie made it a wonderful weekend. I'd go back again in a heartbeat!", "title": "The Most Accommodating, Helpful & Pleasant Staff - Thanks, Dottie!", "user": "Debbie1959058", "date": "April 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61949312}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Stayed here with mobile but elderly mom - with her in br and me on pullout. Good location - a 15 min walk to subway and tucked next to glorious old neighborhood of Charlestown. Nice breakfest. Free internet in room. Last year we were at the Back Bay Hilton. This year here and ... we prefer this location.", "title": "yes", "user": "halitozis", "date": "April 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 61847524}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The room was everything that we could have hoped for. We got a suite, last minute, for very cheap. The front desk was more than accommodating for all our needs.", "title": "Wonderful accomodations, but not clean.", "user": "dysalexic", "date": "April 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 3.0}, "id": 60875084}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The only thing I will complain about is the cleanliness of the rooms. As a housekeeper for a high end inn, maybe I'm a little picky, but I spotted lots of hairs in the tub and bathroom as well as blood or some stains on the walls. I feel like the housekeeping staff could take a little more time to make this hotel a great value.", "title": "So comfortable!", "user": "shfkjdhfdsj", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60279634}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Also the linens were poor and when I called down to get a couple of extra comforters (I mean, it's cold in April in New England!!) they said they had no more and brought up a very thin and worn fleece blanket as a substitute.", "title": "Outstanding for what we needed", "helpfulness": 1, "user": "Comish32", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 60276572}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed in May 2010 and found most hotels in Boston city center very expensive as it was graduation week. This hotel is a short walk (15-20 mins) out from the centre but this did not bother us. The location is close to the USS Constitution, Bunker Hill Monument and is right on the Freedom Trail. We used the hop on and off trolley to get us around as there was an offer if bought one day you got another day free. There are a few places to eat near by. We had a room with a seperate lounge and a kitchenette, the staff we very helpful and even remembered our names. Breakfast buffet is free and covers most foods from healthy to not so healthy. There was a small gym and pool but as the hotel is on the harbour walk we went for a run as it was more enjoyable. There is a great pub the Warren Taven 5-10 minute walk, very sociable and friendly.", "title": "Perfect for us", "helpfulness": 3, "user": "GeorgeLittleman", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66711148}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I've stayed at Residence Inn's across the country. This one is average compared to others. For a short Boston visit its not bad. But long term there's not enough options around it compared to the nearby competition. With just a handful of dining options unless you walk across a bridge to the Boston side it's not the best location for more than a couple of days.", "title": "Your extended business traveler", "helpfulness": 3, "user": "Chase71", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 66656927}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The breakfast was good. The night time service was cheese, crackers and nothing hot. At least on a Wednesday evening. But I've stayed at Residence Inn's where every offered meal was a meal. Not cold finger foods.", "title": "Great rooms, convenient location", "helpfulness": 1, "user": "elawson", "date": "June 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 66375323}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The staff however was excellent and accommodating", "title": "Excellent value in Boston", "helpfulness": 1, "user": "sundance211", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63798020}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": ".", "title": "Great location with kids", "helpfulness": 1, "user": "bebecailin", "date": "May 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63635117}, {"rating": 4.0, "title": "Excellent room, good service, but stop the music, please!", "text": "The Marriott was extremely comfortable and clean. I slept so well. We had a room that overlooked the harbor and we could see the Old North Church. It was just blocks away from the Italian neighborhood and Faneuil Hall. I would definitely recommend it.", "user": "Jackmi", "date": "March 29, 2010", "id": 59811648}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This hotel is good for families staying for more than 3 days, because of the full kitchen suite. However, there isn't any supermarket or 711 to stock your kitchen. The hotel claims that they will buy your groceries if you provide them a shopping list and they will charge it to your room. We didn't bother to stock the fridge with anything because we were only staying for the weekend. The complimentary breakfast is great every morning. Also, if you want room service, it's only available after 5:30pm.", "title": "Not a fabulous hotel, but still worth a try", "helpfulness": 1, "user": "dimpliciouzz", "date": "March 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14328847, "likes": {"liked": "— the view", "disliked": "— the room wasn't that modern"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "If you're interested in sightseeing keep in mind that the nearest train station is over the bridge, but it isn't a bad walk at all. It turned out that this hotel was very convenient for us because we went to a Celtics game our first night and the TD BankNorth Arena was right after the bridge. We found it interesting while taking the train around some areas that the stations were actually rather close to each other so each stop was very quick. Honestly we could have just walked and covered the same areas but it was a little chilly.", "title": "Great hotel with a great view but not the best location for tourists!", "helpfulness": 1, "user": "lip89", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13062037}, {"rating": 2.0, "stay_parameters": "Stayed June 2005, traveled with family", "text": "Another attraction not too far from the hotel is the New England Aquarium which is worth checking out. Legal Sea Foods is right across the aquarium and is always a great choice if you can't decide where to eat.", "title": "Great Hotel, Poor Location", "helpfulness": 5, "user": "ellie01", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 1.0}, "id": 12042757, "likes": {"liked": "— The hotel had everything you needed", "disliked": "— The location"}}, {"rating": 5.0, "title": "Waterfront - Marina - Great Views - NICE Rooms - Great Service", "text": "The next time I'm in Boston I would try another hotel that's a bit more modern but this hotel was ok. It's kept very clean and secure and the waterfront view with the boats is worth the price.", "helpfulness": 6, "user": "22601go", "date": "December 13, 2007", "id": 11533229}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I stayed here during my wedding in December and booked all the guests here as well since it was close proximity to the Navy Yard where I was getting married. I was very impressed at how new the hotel is and how friendly the staff is. The place was built in the last few years and is tucked away close to the Charlestown Navy Yard. It is quite nice coming into the lobby and it has a continental breakfast area that I was atucally quite impressed with. There is a fireplace that makes the place cozy. The rooms are quite nice as well. We stayed in a junior suite and there was a small kitchen in there in a seperate area and a couch. The views from the rooms are awesome, with a great view of the city and the large Zackum Bridge. You are right on the harbor so it is great to see the scenery. I would say for tourists this isnt the best location. You are across the river in Charlestown which is a $10 cab ride into the city. If you are going to pay this kind of money to saty here, stay within the city limits. This place is more for people that want to stay outside the city and stil be close. I would recommend this place!", "title": "Pleasant surprise", "helpfulness": 5, "user": "dcer1432", "date": "December 2, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 11201011, "likes": {"liked": "— Location Location Location!!!!", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Nice view of the river and marina, and an easy walk to the Garden for shows/events. The room was not very clean. There were multiple smudges and specks on the walls, doors, sink/faucet, etc. and the furniture was worn. The linens were of a very poor quality, with thin, scratchy towels in the bath area and old, droopy pillows on the bed. The breakfast was nice and the eating area is very cozy - fireplace and views of the marina.", "title": "Could be cleaner", "user": "TX_TnE", "date": "February 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 57112664}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "So we stayed 3 nights. we took Amtrak into Boston from Albany and got a cab from South Station, $13.00 with tip. the room was great with 2 rooms , 2 TVs afull kitchen. the pool satisified the 12 and 13 year old and the breakfast (free included was great). Internet is included free. ohers have complained about the location but we found many restaurants and sights to see. You could see the masts of the Constitution from our room. we overlooked a marina. The water shuttle was $1.70 each and let us off right at the Aquarium, this shuttle was a 8 minute walk from our room. Taxis are always available and we found a place to eat within walking ditance on Saturday night at 9:45 PM. The staff were amazingly friendly and helpful and there is even free food weeknights. The location is not an issue.", "title": "great", "helpfulness": 1, "user": "dannycl", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56302541}, {"rating": 5.0, "title": "Great stay and awesome staff", "text": "I'm at the hotel now and the staff is the best I've ever came across even Disney great location you can walk acroos the bridge or get in a cab to go were you want to go I will be back soon as the Celtics play the Lakers again the arena is only a 10 minute walk ALL I CAN SAY IS THIS IS GREATWITH A HARBORVIEW ROOM.", "helpfulness": 1, "user": "pokerolls", "date": "January 30, 2010", "id": 54787926}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We enjoyed our stay at the Marriott in Charlestown. Room was clean, well appointed and very quiet. The bed was a little too soft for my liking but not uncomfortable. Valet parking is $32, so park yourself at Constitution Wharf (no in and out privlege there) for $20. Easy walk to the North End and great view of the harbor. Breakfast was good, but crowded at 9:00am on Sunday morning. Front desk staff was okay, not particularly friendly but got the job done. We would definitely stay here again.", "title": "Great Location and good value", "user": "L0vie", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 53709488}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I have stayed at this hotel every time I stay over in Boston. The location of this hotel is great and the price is much better than the hotels in the center of the city. We usually walk over the bridge to the North End (little Italy) where you can find any number of top notch Italian eateries. Our FAVORITE is Giacomos at 355 Hanover Street (617-523-9026). This place is the absolute best. They don't take reservations, only take CASH, no desert, no cofee, just great-frsh-homemade food. Rachel Ray ate here and loved it too. You can also pick up the Freedom Trail in the North End. The Old North Chuch where Paul Revere raised the lantern is amazing. There is a portrait of George Washington and the booths that famous families from the 1700s used.", "title": "Great Place to Stay", "helpfulness": 5, "user": "johnrd216", "date": "November 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11100055, "likes": {"liked": "— Location", "disliked": "— Beds were a little stiff"}}, {"rating": 4.0, "title": "Great hotel and location", "text": "Keep going through the north end down Hanover Street and you'll end up in Quincy Market. Here there are all kinds of bars. My personal favorite is the Black Rose, a nice Irish bar with live music.", "helpfulness": 4, "user": "wow47", "date": "November 15, 2007", "id": 10843356}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Hotel is also a great place to stay for concerts at the TD BankNorth Center. You can see the arena from the hotel. It's a short walk or like a $10 cab ride-you pick.", "title": "Good location", "helpfulness": 4, "user": "murphykelk", "date": "September 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10020558, "likes": {"liked": "— Location", "disliked": "— Room Service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "The hotel is also very close to the US Constitution and Bunker Hill. The Constitution is a must see. It is actually an active war ship with a full-time Navy crew on board. In the naval yard they also have a WWII destroyed and a few other ships that you can tour. The museum has a lot of information about the naval yard.", "title": "Location is great", "helpfulness": 3, "user": "NC123Nj", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10008778, "likes": {"liked": "— The breakfast", "disliked": "— the view"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Overall we have found this hotel to be our place to stay in Boston.", "title": "Great hotel!", "helpfulness": 1, "user": "LJ233", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8824051}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed here before moving onto the Resdence Inn in New York. Glad we did because the NY Inn is far superior, and I would have been quite disappointed. The room was good and had a hob with saucepans, so I was able to boil water for tea. The room looked over the busy Charlestown Bridge. I'm glad it wasnt summer, as I would have wanted to open the window and there was no way you could because of the noise of the traffic. We tried breakfast only once, but all the hot buffet items were already cold and it was only 6:30am (jet lag!), however, we were able to toast bagels so all was not lost. My real bug bear was that we went out one day and came back at 3pm to find our door propped open. We just walked as anyone could have. There were a couple of other rooms with their doors also propped open. When I rang reception they apologised and said it must have been housekeeping. I couldn't help feeling a bit suspicious, and left the door sign on saying No Service for the rest of our stay. Overall, the hotel was just OK.", "title": "This hotel is just OK", "user": "Maccbean", "date": "March 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 7214492, "likes": {"liked": "— Fridge and ability to make tea", "disliked": "— Lack of security"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed at the hotel for about a week and booked a suite with a king sized bed. The room was a good size for 2 people with an 80lb dog; there was a decent sized bedroom with a small bathroom, an eat-in kitchen and living room with dog-friendly couch, TV and desk.", "title": "Great Breakfast, Great Staff & Dog Friendly!", "helpfulness": 1, "user": "lbr8", "date": "February 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6813346, "likes": {"liked": "— Great staff and great breakfast.", "disliked": "— Poor water pressure."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The best part about the hotel was the complimentary breakfast every morning. And this isn't just run of the mill continental breakfast, it's a breakfast buffet - fruit, oatmeal, pancakes, cereal, toast, waffles...they even made my husband special eggs every morning (a small tip goes a long way).", "title": "Hair, hair everywhere!", "helpfulness": 3, "user": "TeddyBear03", "date": "February 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6757358, "likes": {"liked": "— The staff", "disliked": "— The cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The staff was super friendly and tended to any needs we had. It's in a great location in Charlestown, right next to a dog park and good restaurants.", "title": "Superb Beds!", "helpfulness": 1, "user": "sammylynn", "date": "January 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6720589, "likes": {"liked": "— Outstanding beds", "disliked": "— I liked everything"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The cafe food wasn't all that great and room service was even worse, but I'd still recommend this hotel!", "title": "What a great hotel!", "helpfulness": 7, "user": "JoBos", "date": "October 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6011230, "likes": {"liked": "— Location, views, comfortable atmosphere", "disliked": "— Try to get a room at the end of the hall (ending in -24) for great views."}}], "location": {"country": "United States", "city": "Boston"}, "stars": 3, "variance": {"poor": 10, "average": 37, "very good": 135, "terrible": 4, "excellent": 190}, "aka": "Marriott Residence Inn Boston Harbor On Tudor Wharf Hotel", "slim_ranking": 0.207792207792, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Boston's rich history is right outside your door when you stay at the Residence Inn by Marriott Boston Harbor. Our hotel offers a choice of studio, one or two bedroom suites, with amazing views of Boston Harbor views and beautiful interior decor. Unique amongst Boston extended stay hotels, our pet-friendly hotel offers a stylish retreat at a substantial value; free wireless Internet access, heated indoor pool, complimentary daily hot breakfast buffet and evening socials Monday through Thursday."}