{"user_rating": 4.0, "review_count": 174, "name": "Residence Inn Hanover Lebanon", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Everything one could want and more. Every room is a \"suite,\" two bedrooms with a living room between. Convenient parking. Good buffet breakfast. All the amenities. A great place to stay while visiting patients at Dartmouth-Hitchcock Hospital. Walking distance.", "title": "A perfect accommodation - clean, pleasant, breakfast included.", "helpfulness": 1, "user": "dcmarlins", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47181082}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Price is very high but facilities are excellent.", "title": "A big disappointment - will not stay again!", "helpfulness": 2, "user": "Maggiesmominnh", "date": "October 15, 2009", "detail_rating": {"rooms": 2.0}, "id": 46949263}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "An overnighrt stay with a handicapped client was a mistake. I had asked for a handicapped room with walk in shower. The only thing for the handicapped person I was with was the grab bars in the bathroom. There was a regular shower/tub with a wooden seat that could fold down. This young lady is in a wheelchair and cannot walk. No way was she to get in that shower. Thank goodness I had the good sense to give her a shower at home the night before. A queen size bed and a pull out sofa bed for 3 of us. That was ok when I made the reservations. Upon getting ready for bed I pulled the sofa bed out to sleep on it and there was no mattress. I ended up folding it back up and sleeping on the couch with my feet hanging over the side. How uncomfortable! I will not book the place again for a presurgery stay.", "title": "Love Residence Inn - But not this one", "helpfulness": 1, "user": "weintrja", "date": "October 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 46446076}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We visited the Hanover, NH area to check out Dartmouth and stayed here because we've found Residence Inns to be a fairly reliable stay despite the location. First impression, these are smoke-free hotels, the minute we entered or room my daughter could smell it had been smoked in (recent guest or house cleaning break room). Next when my daughter took a shower the water would not drain out of the tub. Called the front desk at 10:20 PM. They said they'd send someone up. They call us at 10:40PM that the maintenance guy went home. Told us that they'd send up the front desk person who was going on at 11PM to take a look. At 11:20PM still no front desk guy. Called down to the desk, waited 12 rings..no answer. Tried again at 11:30PM...10 rings no answer. Wife called the external number, one ring, instant pickup. This is great. Guy named Jeremy won't do anything for us...allegedly called the manager...nothing. Two showers this morning - 8\" of water still standing there in the tub. Wife walks over to put on a lamp...no bulb. What's with this? Not recommended....bottom of the Residence Inn chain.", "title": "Suite room", "user": "allstates", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 45331327}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "From the Mt Wash to the Residence Inn ,not a come down by any means we booked a room and got a suite that was very nicely furnished and looked quite new with cooker,dishwash,and all the bits you would need for a long stay.It was quite busy I think it was your Labour week end.The breakfast was very good but you had to be on your toes they only had one waffle machine.In the grounds is a Mexican style bar and restaurant it was very pleasant.Over all very clean spacious and comfortable.", "title": "Very Nice", "helpfulness": 1, "user": "Erin S", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36019086}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "I made reservations at the Residence Inn in Lebanon for two friends who needed to visit Dartmouth Hitchcock Medical Center for cancer treatment. The reservations was originally made for two days figuring the night before the surgery and the night of. (Sunday-Tuesday)", "title": "Unexpected situation", "helpfulness": 1, "user": "Hawaiiantraveler66", "date": "April 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 14984456}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "Unfortunately the husband of the woman who was going in for treatment became ill the day of arrival. He too was admitted into DHMC for tests. That evening they found out he had a massive stroke.", "title": "Very nice newer hotel near some of the major attractions in the area", "helpfulness": 2, "user": "lip89", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13028962}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I was called on Monday and asked if I could extend their reservation and I said I would take care of it. I called the Hotel directly and spoke with one of the Managers and asked to have their reservation extend until Wednesday. He said the hotel was sold out but their reservation had already been extended by someone.", "title": "Stay at the Courtyard !!!!!", "helpfulness": 1, "user": "PHD_traveler", "date": "December 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 12175141, "likes": {"liked": "— Location", "disliked": "— Level of Service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Tuesday morning came and the hotel informed the woman who just got out of the hospital and her husband that is about to go into surgery that she had to leave. They had no rooms available. The woman explained the situation and got no where. The hotel didn't even offer to help them look for another hotel.", "title": "Nice hotel but noisy", "user": "BettyMerdoya", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 12037898}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I got a call and within 15 minutes I had another reservation 8 miles away in White River Junction VT at the Comfort Suites for $79.00. (See my review of that hotel)", "title": "OK apart from the heating system", "helpfulness": 1, "user": "2fromTrona", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10077221, "likes": {"liked": "— Loud heating system"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The Residence Inn was a convenient and comfortable home base during a recent week's work at the Dartmouth-Hitchcock Medical Center. Though a bit overpriced ($229 a night for a two-bedroom suite), the hotel seemed to be one of the better area offerings.", "title": "Nice Staff and Convenient to Dartmouth Medical Center", "helpfulness": 2, "user": "JRZ_GYRL", "date": "August 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 8440238, "likes": {"liked": "— Front desk staff, free high-speed Internet", "disliked": "— Sparse parking, lackadasical housekeepers"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The front desk staff was extremely helpful with directions and restaurant recommendations. Residence Inns are far from luxurious, but the rooms were sufficently spacious, and the beds were reasonably comfortable, and generously loaded with fluffy pillows. Bathroom toiletries included nicely scented (quince) soaps, shampoo, conditioner, and lotion. A free bag of microwave popcorn and a jar of individually-wrapped jelly bellies in the room were nice touches; as were free local newspapers, USA Today, and Wall Street Journals available each morning near the front desk.", "title": "Appalling treatment", "helpfulness": 2, "user": "jonben", "date": "October 28, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 6022732, "likes": {"liked": "— Appalling attitude of staff and lack of basic amenity."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "The included buffet breakfast had a nice selection of hot and cold offerings; but most mornings, items such as oatmeal and bananas were depleted by 8:30 am. French toast was fresh and tasty one morning; hard and unwelcomely crunchy the next.", "title": "Good value", "helpfulness": 5, "user": "moulder24", "date": "October 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5975094}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "A lack of parking spaces and less than conscientious housekeeping were my only criticisms. Two dead bees on my windowsill were my roommates for the duration of my four-night stay; and a blanket was left in a rumpled ball on the floor next to the couch for three days straight. The candy jar, almost empty when I checked in, was not refilled during my stay.", "title": "Nice to have a suite", "helpfulness": 4, "user": "unnamed", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5904446}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We arrived at the property at 5.45 pm after a long drive through the White Mountains of Vermont. After checking in we went to our room and were pleased to see a proper two room suite, but our pleasure was immediately spoiled by a printed note saying the hot water would be off until 6 pm. With two children wanting a swim and then all of us wanting showers, this was not good news.", "title": "We were blown away!", "helpfulness": 6, "user": "Cindy C", "date": "July 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5464827}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Visited the Lebanon/Hanover area during Easter weekend with my husband. Stayed at Residence Inn for 3 nights and had a comfortable and pleasant stay. This is a hotel that caters to business travelers and long term stayers during the week and families on the weekends. The hotel was pleasantly decorated and check in was a breeze. Our room had a king bed, kitchen , bath and sitting area. It was one open room but I did see that they have suites that are two rooms and some even have fire places. All the appliances in the kitchen worked and made our stay very enjoyable since after a long day of driving we were able to go to the Co-Op Grocery across the parking lot and get food to go and cook and or warm up in our room. The room was very clean and there was no noise that could be heard from any other rooms or guests. My husband had stayed at this hotel before and said that wasn't always true. We were on the third floor so this may have made a difference. The only complaint I had was at breakfast on Sunday morning we arrived at approx. 7:30 AM and all the food was demolished by families with numerous children running wild and sticking their fingers in everything. The staff did occasionally refill some items but not the fruit or what I would consider healthy items. In al it was a nice hotel and an enjoyable stay.", "title": "Comfortable Stay", "helpfulness": 1, "user": "pulpoeater", "date": "April 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28143573}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This hotel should loose all of its stars. It does not even deserve one.", "title": "The worst Residence Inn in the world", "helpfulness": 1, "user": "monchotico", "date": "October 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 20921036, "likes": {"liked": "— the staff and the cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Upon my arrival 2 nights ago, I waited for 10 minutes to be registered by the manager on duty, because she was busy on the phone taking care of some personal business.", "title": "All you need", "helpfulness": 1, "user": "mpd401", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17267444, "likes": {"liked": "— Comfortable and homey", "disliked": "— whirlpool"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008", "text": "The toilets smell like urine and I let it go the first night but after our complaint on the second night, the management sent 2 teenagers to spray some perfume on top of the urine, so I complained again because the smell was still present and they said that they would be sending somebody the next morning ( I guess that they will do that after I have departed the hotel). The shower courtain with the metal pipe almost fell on top of me because the screws were loose. This is the definitely the last time I'll stay in this hotel.", "title": "Bedbugs!!!!", "user": "rosalindfranklin", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 16867168, "likes": {"liked": "— nice suite", "disliked": "— BEDBUGS"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I have stayed at least 100 nights at other Residence Inns and never had a complaint, until today. My opinion about This chain changed drastically after tonite. Specially after calling Marriot central office and speaking with Mr Rodney Haynes who said that nobody could do nothing because the hotel was full.", "title": "Worked well for business stay in Hanover", "helpfulness": 2, "user": "RoyWally", "date": "June 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16806186, "likes": {"liked": "— Convenient location and overall quality", "disliked": "— Slow elevator"}}], "location": {"country": "United States", "city": "Lebanon"}, "stars": 3, "variance": {"poor": 10, "average": 23, "very good": 61, "terrible": 7, "excellent": 73}, "aka": "Residence Inn Hanover Lebanon Hotel", "slim_ranking": 0.666666666667}