{"review_count": 122, "slim_ranking": 8.0, "name": "Restaurants at the Four Seasons Hotel", "reviews": [{"rating": 5.0, "title": "Out of this world", "text": "Everything about this hotel is perfect. Location food staff rooms pool beach. Cannot say anything negative at all. Was a holiday of a lifetime. Mam n dad renewed their wedding vows here in August 2011 and the wedding was perfect the staff were fabulous and I cannot rate this hotel highly enough.", "user": "Bev S", "date": "September 24, 2012", "id": 141180497}, {"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "We ate here for the third time this year and can't praise it enough. The food is of a very high standard and the service is exceptional. We were not staying in the Hotel but decided we had to eat there as we enjoy the service and atmosphere so much. You get what you pay for as the saying goes. We had two courses, wine and water and the bill was approx 80 euros. Not somewhere the average person could use on a weekly basis but perfect for a special occasion or a special treat.", "title": "Oriental Restaurant", "user": "RobertaFyti", "date": "September 20, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 140745493}, {"rating": 5.0, "title": "The Main Hotel", "text": "This Hotel is Excellant from the luxurious accomodation and the srevice is second to none. It was nice to be in an atmosphere where the customer is top and always right which is lacking in so many places these days. Dont miss a meal in the Chinese Restaurant. Its like going to a second home and bieng looked after by Family.", "helpfulness": 1, "user": "Christos E", "date": "September 18, 2012", "id": 140570701}, {"rating": 5.0, "title": "Colours Cafe", "text": "Fab good value all day continental breakfast. Wonderful patisserie. Attentive and friendly staff. Good choice for breakfast, lunch or any time - no excuse required.", "helpfulness": 1, "user": "mossa14", "date": "September 16, 2012", "id": 140395840}, {"rating": 5.0, "stay_parameters": "Visited August 2012", "text": "Fantastic service. stunning cakes and lovely lovely hot chocolate. If you fancy a lazy breakfast or afternoon treat go here. The staff here certainly go the extra mile to provide top quality service to create a truly memorable experience for you.", "title": "Gorgeous cakes and amazing hot chocolate", "helpfulness": 1, "user": "heaton45", "date": "August 31, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 139016559}, {"rating": 5.0, "title": "chinese", "text": "amazing meals bit expensive but very high class shame as some members of staff spoke little greek and english", "user": "gmna", "date": "October 22, 2012", "id": 143458225}, {"rating": 5.0, "title": "Impressive!i couldnt find anything wrong", "text": "Amazing place to eat!the food was great!huge portion nicely cooked!didnt find the place expensive for what they offered!must try the peking duck and ginger beef!dim sum are the best i have tried in cyprus!cant wait to visit again!", "user": "lola2882", "date": "October 6, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 142142828}, {"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "If you are visiting Cyprus and don't happen to be staying at the superb Four Seasons hotel and are in need of an excellent culinary experience, then look no further than the main restaurant of this establishment. The buffet, which we had as a Sunday treat was quite simply exquisite! its 45 euro's a head but well worth it. The staff complete the experience, there are very few establishments where people are so nice and so passionate about what they do. If you eat outside there is a very attractive and well maintained Japanese water garden with some very attractive Coi Carp swimming about.", "title": "best by far!", "helpfulness": 1, "user": "Derrick792", "date": "October 2, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 141804393}, {"rating": 5.0, "title": "Class", "text": "ENJOY! Its only 50km from Larnaca and not much further from Paphos, either way you wont be disappointed.......and there is a brilliant Chinese too!!", "user": "chris c", "date": "September 28, 2012", "id": 141491401}, {"rating": 5.0, "title": "scrumptious", "text": "Have always loved the four seasons, dined in the Chinese restaurant recently which was beautiful. absolutely faultless evening with impeccable service as always. Cocktails and dessert in the bar were wonderful too.", "user": "lechapeaux", "date": "September 25, 2012", "id": 141287762}, {"rating": 5.0, "title": "dinner at tropical cafe", "text": "Me and my husband went to the four seasons Christmas evening intending to eat in the best restaurant . As we were to early in the evening the restaurant was not opening for couple of hours so we eat at the tropical cafe . Well it's rather more than a cafe it was amazing we had a full menu 3 courses all of which was fantastic . Without doubt the best meal we have had in Cyprus .", "helpfulness": 1, "user": "UkSand", "date": "December 29, 2012", "id": 148270581}, {"rating": 5.0, "title": "Top class food at the best hotel in Cyprus", "text": "Try their top class Chinese restaurant for a lovely evening out or the Marco Polo for their famous buffet lunch.", "helpfulness": 1, "user": "Philokypros A", "date": "December 18, 2012", "id": 147668446}, {"rating": 5.0, "title": "Oriental Anniversary", "text": "Enjoy their sushi, their lovely cakes or their excellent ice-creams at the veranda, almost 10 months of the year!", "user": "Cmilie", "date": "December 9, 2012", "id": 147040519}, {"rating": 5.0, "stay_parameters": "Visited November 2012", "text": "Highly recommended.", "title": "Vivaldi hits all the right notes", "user": "Looksee999", "date": "December 4, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 146791684}, {"rating": 5.0, "title": "Recommended", "text": "Anniversary meal at the Four Seasons Oriental truly magnificent.Excellent food and very good wine selection. Staff very helpful and efficient.Liked it all, nothing to dislike.", "user": "jackkeogh", "date": "November 24, 2012", "id": 146083192}, {"rating": 4.0, "stay_parameters": "Visited October 2012", "text": "We were staying over for a night at the Four season and ate in the Greek restaurant. We expected it to cost a lot more than it did and the food was very good and very good value for money. I would highly recommend it to anyone out for a special night.", "title": "Night at the Four season.", "helpfulness": 1, "user": "Colin V", "date": "November 18, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 145658067}, {"rating": 5.0, "title": "Greek Restaurant", "text": "Amazing food and service. We expected authentic Greek food but it turned out to be contemporary, which was still great", "helpfulness": 1, "user": "Spencer C", "date": "November 16, 2012", "id": 145530874}, {"rating": 5.0, "title": "Best Chinese on the island", "text": "It's really fantastic to see management invest in service.... This is what the four seasons has done hands down. The food is outstanding , atmosphere great the price on the expensive side but surely value for money. An absolute must if limassol", "helpfulness": 1, "user": "Alexis N", "date": "November 11, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 145157400}, {"rating": 5.0, "title": "Value for money and excellent atmosphere.", "text": "Yes, it is a very nice place to go there, and the prices are very reasonable. Thanks for the excellent service as well.", "helpfulness": 1, "user": "christosPashiardis", "date": "November 5, 2012", "id": 144643833}, {"rating": 5.0, "title": "Top Class", "text": "Expensive but worth it. One of the finest dining experiences in Cyprus and certainly amongst the best in Limassol. Also, not far from Taps Bar, a great little bar to finish your evening with!", "user": "297Paul", "date": "October 25, 2012", "id": 143676270}], "location": {"country": "Cyprus", "continent": "Europe", "city": "Limassol"}, "variance": {"poor": 1, "average": 8, "very good": 24, "terrible": 2, "excellent": 87}}