{"user_rating": 4.0, "review_count": 1772, "name": "Revel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel has a long way to go before it reaches the level of a premium \"resort\". Customer service, including the over 10 minute wait to speak with a representative, is poor. Long lines at registration; no available beach chairs and unbrellas; over a 30 minute wait for a valet who never arrived ,made for a disappointing stay. The crowd is young, hip and loud. Pool area seemed inadequate for the number of rooms. Food service, on the other hand, was excellent. Restaurants visited (Azure, Village Whiskey, Lugo and Mussel Bar) were all great! Breakfast room service was extraordinary! And our room was luxurious. So there it is : the good, the bad, and the ugly . The Revel has it ALL.", "title": "A long way to go", "helpfulness": 4, "user": "MaryE54", "date": "August 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 136396494}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Not only did we spend $30.00 each for 15 of us to go in...we were forced to take the stairs 6 flights up.... Beer was $8.00 and a drink $14.00 ROBBERY....beers were hot and drinks were water down. When time to leave....Female Secrutiry tries to force us again to go down 6 flights of stairs....Are you kidding me....after a few drinks and in 5 inch heels....you do it. She tries to bully me....Male secrurity comes tells me I have to leave ask me for my ID....cause I am 86th from there......WHAT....LOL little man your like 23 years old....RESPECT....I am not a little girl nor am I drunk....Close to 40 and its 2:30 am and I am tired and want to go....I AM NOT GOING DOWN THE STAIRS!!!!!!!!!!!!!!!! We spent well over $1500.00 easily there...to be told we cant take the elevators....I want to leave anyway so if you want to feel like a MAN and escort me out as if I acted up and needed to be thrown out so you can feel better about myself....then FINE take me in the elvator so you can feel like a MAN to make up for your height bold punk. WHAT A JOKE.....Hope he feels good for pretending to kick me out just cause I wanted to use the elevator.....", "title": "HQ Security", "helpfulness": 2, "user": "Portuguesa73", "date": "August 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 136391567}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "They need to find a staff that wants to work In a customer service industry. From the check in front desk to the 'supervisors' , bad.. This non smoking hotel obviously Dosent accommodate it's employees, because when I came back to my room after dinner, someone had stopped in for a smoke ! How dare they!", "title": "Don't go.", "helpfulness": 3, "user": "Laurie9814", "date": "August 6, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 136388622}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "My girlfriends and I all went to the Revel this Sat night for a bachelorette party. I have been to AC a million times but have yet had the chance to check out Revel until now. I have also been to Vegas about 8 times so I can compare this hotel to many of the others I have stayed at.", "title": "Bachelorette party for girls in their 30's", "helpfulness": 1, "user": "Delre_Travel_1980", "date": "August 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136383104}, {"rating": 3.0, "title": "Revel has potential!!", "text": "I will break it down by pro's and con's", "user": "Vjnitti", "date": "August 6, 2012", "id": 136363408}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Incredibly nice hotel, amazing pool, casino is luxurious, warm and ultra stylish. The rooms are unbelievable, hands down over Borgata. Very modern, clean, really great place. However, there was no ipod dock in the room and toilet is separate from the sink even though the bathroom is huge. Shower is huge. View is fantastic. One unusual thing is the hotel check-in is three escalators up! Mussel bar and One are really good. This is the place that makes your stay memorable. Everyone with me was shocked at how cool it was. Even the women staying and hanging out here are smokin hot. Will not stay anywhere else in AC from now on.", "title": "Las Vegas in AC", "user": "Joefrombrooklyn", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136490350}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "It's about time that AC put an awesome hotel of this caliber on the boardwalk. The place is a masterpiece of architecture. Now on to the specifics...", "title": "Lots of potential, but needs time", "user": "araino1", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136462270}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Parking: Self parking is only $5, and there were numerous spaces on lower floors. This made it easy to grab my bags and walk a short distance to the hotel. But, there was a lot of confusion when trying to pay to leave the next morning. I heard one lovely parking attendant tell a lady having trouble with the pay machine that she needed to shut up and wait while she finished talking to her friend. Made sense considering the woman having trouble paying had about 15 cars behind her.", "title": "Beautiful, Modern, but crowded", "helpfulness": 1, "user": "dwert5", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136458505}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Floor plan: This might be the most confusing floor plan of any casino/resort that I have ever been to. If you want to find the poker room good luck, as they have tucked it away on some middle floor that you can't access from the main escalator bank (which is a really cool sight). Also, if you are not staying at the hotel it is even more difficult to maneuver the hotel/casino as half of it is roped off for hotel guests (which is nice when you are a guest, but not when you are still waiting to check in).", "title": "Right or wrong...the first impression is the most important impression.", "user": "Nocal577", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136441300}, {"rating": 4.0, "title": "place is beautiful staff unprofessional and scary", "text": "Pool: The pool is very cool as it is on the 11 or 12th floor roof. But, it was totally packed and drinks were wildly expensive. The pool isn’t especially kid friendly either, as it is more like a bad Panama City like club on Saturday afternoons. I especially liked how the bartenders would just come up with amounts that they wanted to charge for beer buckets on the spot. At one point we realized that we were paying more for a bucket than we would've paid for individual beers. Now that's one way to rope in return business!", "helpfulness": 1, "user": "nicole b", "date": "August 6, 2012", "id": 136405461}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I'm giving this hotel a 4 because the room was amazing and the hotel itself is beautiful. They have areas that only hotel guests can access, which I think is great. The fact that its smoke free was good (its nice to go back to your room and not smell like a smoker). They have a lot of self check in kiosks around the lobby, which are really easy to use, the only downfall is that you can't ask for anything specific, like a high room or a certain view. We did self check in and ended up on the 2nd floor. So if you don't care where your room in, the self check out is great. I didn't give it a 5 for three reasons. One is because all of the restaurants and stores are really expensive and limited. They don't have any shopping that an average person can really shop in. The cheap pocket books are $100+. The restaurants are expensive, and not very filling. Unless you get apps and dessert, expect to leave hungry and a lot lighter in the wallet. Another reason is because the casino is terrible. It's beautiful, clean, smoke free, but don't expect your money to go far. Your lucky if you get 10 minutes of play from $20. I would definitely stay there again, but I would eat and gamble somewhere else. The last reason is because the door of the room are paper thin! I couldn't hear a thing through the walls, but every time someone passed by the door you can practically hear them breath. That's not good when you have a bunch of obnoxious drunks trying to find their room! Oh and when last thing, if you stay there, bring a sweater...even in the middle of a heat wave! They have their air conditioning turned up so much you actually want to go outside on the hottest, humid, sticky summer day!", "title": "Beautiful Hotel...very expensive!", "user": "alison k", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136342286}, {"rating": 4.0, "title": "If you like AC and prefer modern and new..", "text": "This is a fun one night get-a-way for singles to married couples. Pool area is small, but very entertaining (Jersey Shore meets hipsters and couples getting away for the weekend w/o the kids)...loud music on Saturday with great drink service at the pool. The cafe by the pool is disappointing, but dinner at the tapas restaurant was good and breakfast room service was impressive. Rooms are huge, clean and modern and all have ceiling to floor windows with an ocean view. Everyone was helpful and friendly, no complaints about service.", "user": "Debbie_1972", "date": "August 5, 2012", "id": 136337906}, {"rating": 2.0, "stay_parameters": "Stayed August 2012", "text": "If you have traveled to various well-run resorts around the the world you will be very disappointed with Revel. I agree with those reviewers that say it is similar to a cruise, however the service is horrible, the staff is unknowledgable about just about everything, and the crowd leaves much to be desired. Check-in has no flow. There are lines but who knows if you are in one that will lead to an actual staff member. Then once you check in, if you ask how to get somewhere within the building nobody seems to know. We asked a young lady how to get back to the hotel from where we were in the shops and she said \"I'm not sure.\" We asked a young man standing by a door how to get to the pool and he pointed us in one direction....which was wrong. When we were led back on the right track it turns out we had to go through the door by which the young man was standing! He held it open for us at least, after having misled us five minutes prior. These were both employees! There were other examples where this happened again and again. Shouldn't employees know the basic geography of their place of employment? When you call any of the restaurants to make a reservation expect the call to be answered by an exasperated individual who will tell you they have no openings for days. When I spoke to the woman who answered the phone at Amada she specifically (and rudely) said \"We have no openings for ANY time tonight\" and hung up. HQ Nightclub is full of Jersey Shore wannabes and that \"fistpump\" racket and the doormen are rude as well. The plus was that we had a nice room with a decent view. There is definitely a certain clientele Revel will attract over time, but my prediction is that it won't be a sophisticated one with a discerning taste.", "title": "Save your money and travel to a well-run Caribbean resort", "helpfulness": 2, "user": "FiveCityDweller", "date": "August 5, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 136281159}, {"rating": 1.0, "title": "A NON SMOKING DELIGHT", "text": "this is a brand new beautiful casino and resort.....It is impossible to find a hotel as beautiful and welcoming as this one is....The fact that it is entirely non smoking is a huge ...plus...it is wonderful to be able to play in their lovely casino and not breathe smoke......I will be going back very soon.", "helpfulness": 2, "user": "Terry P", "date": "August 4, 2012", "id": 136250015}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel is amazing! First, Our room was very clean with with a big bathroom. The room as two really cool features. 1) The remote to a nice size flat screen tv also controls the lighting and the HVAC. 2) The room also has a touch screen tablet which I thought was a great convience. All of the service staff that I encountered were very helpful and polite. You really can tell that they spared no expence to make this a five star hotel and casino.", "title": "The hotel is Amazing.", "helpfulness": 1, "user": "keith821", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136243603}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Great rooms...excellent dining choices..no surprises at check in only very accommodating", "title": "AC's best...", "helpfulness": 1, "user": "tgh527", "date": "September 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 177700338}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "staff.....while still on the Boardwalk, good walk to center casinos. Great overall ...we've been back sincex and will return again. Village Whiskey a great spot for lunch and burgers.", "title": "Awesome Experience", "helpfulness": 1, "user": "MorrieBreyer", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177698159}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The design of this property is over-the-top gorgeous! Not the typical tiky-tacky interiors of the other Atlantic City casinos.", "title": "Beautiful and Welcoming Hotel", "user": "Sandra M", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177636242}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The various restaurants are all delicious!", "title": "Beautiful hotel but", "helpfulness": 1, "user": "tulip90", "date": "September 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177590098}, {"rating": 3.0, "title": "Mostly Good.. Some Eh", "text": "The facility is very clean.", "user": "Charles S", "date": "September 17, 2013", "id": 177582448}, {"rating": 4.0, "title": "Beautiful hotel lets just hope it survives.", "text": "We checked into this hotel after spending 2 nights at the Tropicana. It was a night and day experience. The rooms here are amazing. Floor to ceiling windows with spectacular views. The room was large and very comfortable. We loved the outdoor/indoor pool and hot tub as well. It really is an impressive hotel, but despite the long line at check-in to tell us otherwise the hotel seems dead. You will not find the shops within the hotel/casino unless you are looking for them, and I guess we were the only ones looking because we were literally the only people in the stores. This was a Sunday afternoon. This is where the Revel and Trop greatly differ. The Trop's room are very basic/outdated and can be loud, but when you go downstairs to the main floor it is like you were dropped in the middle of a party. The Revel, on the other hand, has this great hotel space, but there is no life to the hotel/casino. They have restaurants, nightclubs and bars, but some of them you have to really seek out in order to find them. I am not a gambler, but like AC for the beach, shops, restaurants, and nightlife. This hotel has the potential to really appeal to that type of crowd, but I don't think this hotel has found out who it wants to appeal to.", "helpfulness": 2, "user": "Jennifer M", "date": "September 17, 2013", "id": 177540209}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "This hotel has the best Bed, I stay at many, many hotels and this is my best rated good night sleep hotel, Clean and Comfortable. Become a Revel Card Holder they give great incentives and use your card all the time for credits.", "title": "Great Night Sleep", "user": "Beautyboxstudio", "date": "September 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 177471576}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I have returned to AC many times. My East Coast Vegas. It was time for REVEL. The Hotel is much like a Vegas hotel, Large, really large, HUGE. Beautiful, a lot of Marble. and space. Did I say it was BIG? What I'm getting at is if your not in good health, or not into walking consider this, I wear a fitbit over 10000 steps average a day. That's miles. I really liked the HOTEL staff. They did their best and it really helped. What I mean by that is they did explain how to get the TV and temp. of room to work with the TV REMOTE. The room was exceptionally clean, and the bedding fantastic. The front OCEAN Suite was spectacular. Really one of the most beautiful rooms I have ever stayed in. Motorized curtains on this floor to ceiling glass windows left a view that would stop me in my tracks every time I came in. Breakfast was as expected... Really Good. Pricing 50 for 2.", "title": "The Hotel Is Super High Tec", "user": "Stever516", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177466693}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "A great new hotel in AC. The rooms are nice and modern. The equipment are the newest and best but not everything works. The rooms and the hotel part needs a better cleaning management. In my room there are several spots which are dirty and several nasty spots on the new chairs are not what the guest is looking for. The restaurants are nice but some of them are very pricy!", "title": "New great hotel but needs some improvements", "user": "Hahee", "date": "September 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177449975}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Overall a great designed hotel and a very nice casino( the best one in AC) but the hotel has a real problem with friendliness and cleaning. Maybe some more employee could help, sometimes very short staffed.", "title": "Best Atlantic City has to offer!", "user": "AriOnTheRoad", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177448660}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This review is about customer service.", "title": "Please! Let me talk to a person!", "helpfulness": 4, "user": "mkatzmann", "date": "August 8, 2012", "detail_rating": {"service": 1.0}, "id": 136534654}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I was taking out of town guests to a show and dinner at the Revel last week. To prepare, I called the Revel's toll free number several times in order to make dinner reservations and buy tickets to the show. When I called the number, I never got connected to a person; it was an answering service that said they'd call me back if I left my number and a message about what I wanted to do. I left this message many times and never got a call back for 2 weeks. Other times I was told that in order to speak with someone the wait would be 30 minutes.", "title": "The best service and hotel by far!", "helpfulness": 1, "user": "Stabroek", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136533463}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I finally got in touch with ticketmaster to buy the tickets to the show, and I called the Philly restaurant to get the number for their Revel restaurant", "title": "Hipster Central! FYI Smoking or Non is BIG DEAL here! 08/04/12", "user": "jlamruiz", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 136527954}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Revel does not list the phone numbers for their restaurants.", "title": "great resort....but", "user": "prouss134439", "date": "August 7, 2012", "detail_rating": {"service": 4.0}, "id": 136509593}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "It took me hours to book this one night trip, and I eventually cancelled the dinner reservations because I was so annoyed.", "title": "Unsurpassed beauty; understaffed horrors", "helpfulness": 1, "user": "Robin B", "date": "August 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136497308}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Rooms were nice, and surprisingly quiet (though the central air unit was difficult to operate -- always overriding your settings -- and occupied a creepily large space in the wall that felt like someone was hiding in there, watching you sleep).", "title": "Nice enough room and location, but TERRIBLE service", "user": "Gemutlichkeit", "date": "September 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177952572}, {"rating": 5.0, "title": "amazing we loved it", "text": "But service is ridiculous -- and I mean that in the traditional, non-ironic sense of the word.", "helpfulness": 4, "user": "poisonivy918", "date": "September 19, 2013", "id": 177812672}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I had an issue on the night of my check-in, and was assured verbally that someone would be at the room in 5 minutes to take care of it; no one ever showed up. Phone messaging systems always tells you that your \"estimated wait time\" is 2 minutes, though I waited 20+ minutes at least twice. And, no one seems to have any authority to actually solved problems.", "title": "Fabulous Experience!!!", "helpfulness": 3, "user": "cecil t", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177791687}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I also had a problem with the bill after I left. (Not with the charge; just getting a copy of the invoice). Every time I called, I got a different story of which department could help me, and, was told that copies had been sent, even though I never received them (despite trying multiple email addresses, in case the spam filter caught it). The issue was finally resolved about 7 days after I checked out. And then, about two weeks after that, I got an email from them apologizing for the delay and sending me a copy of the bill I had requested.", "title": "Absolutely Lovely", "helpfulness": 1, "user": "vacattack", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177782194}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "They don't have their customer service act together. Which is a shame, because it's actually kind of a pretty property!", "title": "An Excellent Hotel and Casino with Great Restaurants, Decent and Professiona Staff", "helpfulness": 1, "user": "Rana1960", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177734353}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We have just returned from 3 night stay at the Revel. What an amazing place. I find it hard to believe anyone could write a negative comment. The rooms are amazing, clean and very comfortable beds. We did not encounter one unfriendly or unhelpful staff person. The view from our room was spectacular ! It is very bid and not close to the other resorts but that is one of the good features. You could just stay here and keep busy everyday. The machines or new, not expensive and fun to play. We will definitely return", "title": "Fabulous stay", "user": "Renie125", "date": "September 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 177435037}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "A business conference I attended was scheduled here. Understand first that this property has had labor issues, financing issues and is accused of violating NJ's Consumer Fraud Act. All of this has been publicized, both on TV and in area newspapers. Staff turnover have been high and I could see the problems from the moment I arrived at the check-in desk on the Lobby floor.", "title": "Lovely to look at, but...", "helpfulness": 3, "user": "SVOwner", "date": "September 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177428683}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "They failed to apply simple queueing theory: multiple servers and a single line. You take your chances. There was no line supervision. My colleague and I registered at the same time, but with different front desk clerks. Thomas handled my colleagues transaction quickly and asked some key questions (number of keys, bed size, etc). Jennifer never asked and didn't seem to care much, apparently because I was the only thing standing between her and her 'break'.", "title": "They are really working hard to turn this place around.", "user": "WheresTheBeach_26", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 177412788}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our rooms were on the 10th foor. They're nice rooms, but a guest has ZERO clue about how to use equipment, the Cisco VoIP phones, ice machine location, etc. This hotel is the only one I've ever seen that has no guest services book. I asked the concierge about it. He had no idea what a 'guest book' is. Probably never worked in the hospitality industry before -- and he's a concierge! Our fellow attendees confirmed the same was the case in their rooms. I had no plastic liner for the ice bucket. I ended up filling with ice one of those laundry bags. The sink drains were left in the close position and the only way pop it up is by getting your fingernails under the rim. Tough to do when the pop-up is closed.", "title": "The best hotel casino in Atlantic City", "user": "zeke421912", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177382843}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Glasses used one day were not replaced the next day. I had two bath towels and two hand towels on day one. I had four hand towels on day two. The room safe was 'locked' when I arrived. That means the housekeeping staff isn't doing its job.", "title": "2nd time around", "helpfulness": 4, "user": "Jay H", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177359616}], "location": {"country": "United States"}, "variance": {"poor": 161, "average": 288, "very good": 521, "terrible": 140, "excellent": 662}, "slim_ranking": 0.0819672131148, "description": "Revel offers casino players the newest and most expansive casino resort in the history of Atlantic City. Located along the city’s world-famous boardwalk, and designed to offer endless views of the Atlantic Ocean, the casino offers 130,000 square feet of gaming space, the largest contiguous smoking casino in Atlantic City, 2,400 slots, 130 table games, the high-limit Pearl Slot Lounge and high-limit table game Ultra Lounge. Revel features 1,399 ocean view rooms, indoor and outdoor pools, gardens, lounges, a 32,000-square-foot spa, 14 restaurants serving world-class cuisine and down-home favorites, a collection of boutiques, nightclubs, a dayclub and live entertainment on its stages at The Social and Ovation Hall."}