{"user_rating": 4.0, "review_count": 871, "name": "Rhinefield House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Set in the New Forest, it has beautiful surroundings. The room we had was comfortable. The staff were attentive and the food in the brasserie was surprisingly good. It is a good base from which to explore the New Forest. We would go back again should we plan to visit the area.", "title": "Beautiful setting", "user": "Dunedain", "date": "April 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27669322}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The chef started arguing with the waiter about whether or not he had given my order for a burger. I could hear the chef screeching at him from the far side of the restaurant where I was sitting. She eventually agreed he had ordered it and said ok 2 mins. two minutes for a home made burger costing 12.50??. It eventually arrived and I can onkly say it had been nuked. Breakfast next morning and what looked like a pip from a water melon hif=ding between my mushroom and undercooked black pudding. Not as under cooked a sthe sausage though. Judging by the tomato they had been expecting to start serving at 7am and as I was first in at 8am it as well as the bacon was rubbery", "title": "Great hotel shame about the Brasserie and cooked breakfast", "helpfulness": 1, "user": "SandsDevon", "date": "April 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27286619}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I saw the head chef at the reception as I was checking out and said do you mind if I make a comment about the brasserie. He said not but carried on reading his book as I described my experience. When I finished he said he would have to investigate in a tone that left no doubt he had no intention of doing so. During my stay i spoke to two other couples who asked me if i ever got my burger as they had heard the kerfuffle in the brasserie. They both said they had stayed before and while the hotel is in a lovely spot they could not believe how poor the brasserie was. I have spent several night in the hand picked hotels over the last few weeks and this is very, very poor. I should have sent the meal back but couldnt be bothered as by the time it arrived I was back in my room watching the game.", "title": "a great place for a getaway!", "user": "emilyjane1", "date": "March 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26590885}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "Please please sort it out as it is a magical spot but badly badly let down by the catering and not surprising really with such a surly head chef", "title": "great hotel", "user": "Kelly176", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26409603}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I really paniced after reading a couple of the reviews on here as we desperately needed a couple of days away. I didn't need to as the hotel was fantastic. The location is beautiful (the car park a very short walk from the hotel, nicely hidden, so you wake up and see trees rather than a car park!). The room was good, bed very comfy, not amazingly decorated or anything, but all the facilities you'd find in a 4 star. The food in the brasserie was okay, the food in the Armarda was absolutely fantastic....would go back for the food in that restaurant alone! The service by some was great, by others was average. We will return at some point.", "title": "Lovely situated hotel - good touring base", "user": "EastMidsPollyAnna", "date": "March 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 26069038}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Beautiful surroundings/grounds. Our room wasn't huge but perfectly comfortable. Good food in Armada restaurant. Service a little slow in bar area which was also lacking in atmosphere. Breakfast was particularly good - can't remember when I was last served proper loose leaf tea!", "title": "Beautiful location", "user": "Sharon1506", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143554164}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our classic room was well away from the wedding taking place on Saturday and didn't notice it at all.", "title": "Great hotel, great service, excellent location", "user": "Shivvy68", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143457219}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "I've dreamt of staying at the Rhinefield House Hotel since I was little and spent most summers camping in the Forest with my family... I booked a Classic Weekend Break for my me and my husband as a surprise to celebrate our Wedding Anniversary. I was informed on booking that there would be weddings over the whole weekend, however was comfortable that their room recommendation would mean that we were well away from the celebrations and this did infact prove to be the case, the weddings didn't impact our stay at all. The Classic rooms are well equipped (hubby loved the big telly), very comfortable and very clean. Turn down service was included and nice to get back to after a long day walking/riding.", "title": "Overall very good hotel for a relaxing break. Armada Restaurant recommended, The Grill not so much.", "user": "helenyw", "date": "October 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 143434038}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Over and above all the positives of this lovely hotel the staff absolutely stand out for me. From the moment we first walked in until after we had checked out they couldn't have been more accommodating, friendly, helpful and just really very good at what they do. They really did make this special weekend an unforgettable one.", "title": "Disappointing", "helpfulness": 2, "user": "Lizzie294", "date": "October 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 143377205}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We ate both evenings in the restaurants - the first, Friday, in the Amada Restaurant which was lovely, service impeccable, great wine list, beautiful room. The second, Saturday, in the more casual Grill but again, service impeccable, etc. We wouldn't usually eat in the hotel but venture out to local restaurants or pubs but are both really pleased that we did. The breakfast is perfect - with a good (and very fresh) continental buffet as well as hot choice (made to order) selection.", "title": "Extraordinary Food, Special Suites, Gorgeous Grounds", "helpfulness": 1, "user": "indytravelgirl", "date": "October 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143295885}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband took me away for my 40th birthday to rhinefield house in July, we stayed for 2 nights.", "title": "Fantastic place to stay.", "user": "amanda s", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141966306}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I could not fault this hotel in anyway, the food was outstanding and the staff could not do enough for you, if there was something you wanted then they would get it or do it.The room and views were stunning. I am looking forward to our next stay there.", "title": "Lovely stay", "helpfulness": 2, "user": "Lorraine B", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141932087}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Thankyou Rhinefield.", "title": "Fantastic place to stay", "user": "AnnieCKent", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141909476}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We enjoyed one of the celebration packages for my mothers 80th birthday. Included were afternoon tea, evening dinner in the Alhambra room, executive bedrooms and breakfast .", "title": "Just what we hoped...and needed.", "user": "Whitespirits74", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141752833}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My concerns about the poor standard of service mentioned in other reviews were completely unfounded. We had dedicated staff serving us at dinner and breakfast and nothing was too much trouble. Even though there was a wedding going on at the same time we had no problems at all.", "title": "Lovely Hotel", "user": "randomusername1567", "date": "October 1, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141741326}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "From the moment we arrived at the hotel we just felt special, with Simon Chatting away as he took us to are room and the housekeeping girl smiling and saying hi was very welcoming. We then arrived in the room which was amazing, so spacious and worth the upgrade reception had convinced us on with plazma in the bathroom and lounge area. We then indulged in afternoon tea and too be truthful so filling but tried desperately not to leave a crumb of the wonderful pastries and scones. When we ate in the restaurant the staff were so lovely, Robert was recommending the wines to match the food and we had a bottle we would never had tried before the whole meal was mouthwatering.", "title": "Amazing Hotel, Fantastic Food and Fabulous Staff", "user": "ollie_74c", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22341493, "likes": {"liked": "— beautiful views", "disliked": "— had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "We did not stay in the hotel as we are local, but just dined in the Alhambra restaurant, on Friday evening, Nov. 14, 2008, having ordered a private dining room. We had the Alhambra Smoking Room (which of course is not smoking now). We booked ahead for drinks in the bar, and were seated at a reserved table, next to a window. We were greeted by our head waiter, Chris, who graciously greeted us and promptly saw to our drinks. After half an hour, having a relaxing break, Chris replenished our drinks and alighted with them and us, to our private dining room. We were greeted with a lovely table setting and a cozy and unique Arabian themed private dining room, complete with room-long couch covered in pillows.(Which on this occasion we did not use) A lit, domed, multi-patterned curved ceiling, and a warming stove fire completed the ambience, along with wood carvings and tiles on the floors and walls. It was such a lovely setting, along with an elegant table setting. The food was creative, delicious, and well presented. My husband had the corn-fed chicken, which he loved, and said was terrific. I had the halibut , which was perfectly cooked, slighlty crisp on the outside, tender and moist on the inside. The sauce was perfectly wed to the fish, and to die for. The service was unparalleled, as they seem able to dance that fine line to impart great attentiveness without being intrusive. We had an absolutely fabulous evening and intend to return again and again. Kudos to the staff and chefs at Alhambra!", "title": "Perfect Evening at the Alhambra!", "user": "mrssgrant", "date": "November 16, 2008", "detail_rating": {"cleanliness": 5.0, "service": 5.0, "location": 5.0, "business": 5.0}, "id": 21907844, "likes": {"liked": "— Alhambra restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Rhinefield House is in a beautiful setting in the New Forest. The hotel occupies a lovely Victorian Mansion (which has been largely preserved) with two extensions; one in the same style as the house and the other a monolithic dark glass structure that complements the main building.", "title": "Fantastic setting; great service", "user": "Its_not_difficult", "date": "November 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21902629, "likes": {"liked": "— Setting and service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "From the moment that you arrive the staff look after your every need with an unintrusive manner where nothing is too much trouble. The quality of the food, from an extensive breakfast menu, to lunches and snacks, to the excellent (and reasonably priced) Brasserie and topped by the elegant dining in the Armada Room , is excellent.", "title": "Total Luxury - worth every penny", "user": "Jtq4u", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21822384, "likes": {"liked": "— Exclusive feel about it", "disliked": "— having to go home at the end"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The rooms are very well appointed: tasteful furnishings / large firm beds / large tvs with Sky / modern bathrooms (inc a tv) / sitting area / complementary broadband etc. The furnishings in the lounge area are rather tired but this minor quibble is more than compensated by the dedicated team of waiting staff on hand throughout the day.", "title": "Very lovely romantic place but could use more staff!", "user": "TippyK", "date": "November 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21621438, "likes": {"liked": "— Romantic settings", "disliked": "— Service"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Looks great from the outside.................Shame about the disgusting, filthy bedrooms and showers. The food ground into the carpets and rotting ham scattered around the breakfast room floor (for THREE days)", "title": "Worst place I've ever stayed", "helpfulness": 1, "user": "daragirl", "date": "March 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 25685248}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Inept, inefficient staff to boot. Amazed it hasn't been shut down.", "title": "A great hotel in wonderful location", "user": "Caz1962", "date": "March 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 25457394}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Just returned from a 3 night break at Rhinefield. Beautiful building in the middle of the New Forest, we stayed in an executive room in the new part of the hotel, good sized room wth a sofa which was great for reading, a large bed and plenty of storage space, as well as a fridge - which came in handy. Bathroom was not too big but well equipped with a decent sized bath and separate shower.", "title": "Ignore the negatives.....", "helpfulness": 1, "user": "the_pr0f", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25329396}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We ate in the Brassiere for two night sand the Armada Restaurant on our last night, all the meals were excellent. The managers running both restaurants were excellent. I have read one comment on here about not having the breakfast 'set-up' explained to them (how cereals and juices are in the separate Alhambra Room) well that wasn't the case with anyone staying the 3 mornings we were there.", "title": "poor quality for a four star hotel, with ordinary food and inexperienced staff.", "user": "rhine33", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 25086093}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "One slight niggle is the lack of bar/lounge areas, could do with one nearer the Armada Restaurant and also some times the staff struggle to understand what is required due but that didn't stop us from having a wonderful break.", "title": "Lovely New Forest setting", "helpfulness": 1, "user": "aelfred", "date": "February 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 24637172}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I took my partner to this hotel for his Birthday, i was very aprehensive on booking as it was going to be a surprise so naturally i want everything to be perfect. when i drove up the long drive way , i was not disapointed, The building is stunning. On arrival to reception the staff were very friendly and welcoming and had a very nice feel to the place. Our room was lovely executive room, which had a lovely view. Having a t.v in the bathroom was amazing, the room was spotless. We had dinner in the Armada Restaurant, what can i say the room was beautiful, food was excellent and the staff really looked after you.", "title": "Beautiful Hotel", "user": "surreyTracy", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142734495}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel as a whole had a wonderful warm atmosphere with very attentive staff. it was a shame we only had the one night stay but i would like to think i would visit again!!!", "title": "Fantastic location", "user": "Jane M", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142698824}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The setting of Rhinefield House is stunning - it is surrounded by the New Forest, so you're in woodland within a few hundred yards of leaving the hotel. And the hotel itself looks fabulous - like something out of a gothic mystery.", "title": "Relaxing spa day", "user": "emzo52", "date": "October 12, 2012", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0}, "id": 142676523}, {"rating": 5.0, "title": "Fabulous place to unwind..", "text": "Our room was large, with a wonderful Art Deco-style bathroom. There were some very nice touches, such as the jug of fresh milk on the tea tray and the armchairs beneath the window. The TV set (which we didn't use) was huge. Although the hotel says you can use wifi in your room, you can't if you're trying to connect with a Mac. One of the staff came up to the room to try to help, and he did his best but couldn't make it work. He said the hotel will soon be upgrading their Internet access for the rooms. I must admit I was a bit surprised that the wifi in the hotel rooms wasn't compatible with Macs, as this is clearly a hotel that caters for business people and surely they can't all use solely PCs. Anyway, we took the MacBook downstairs and were able to use it with no problems.", "user": "Jo H", "date": "October 6, 2012", "id": 142117465}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed on a Sunday night, which meant we were eligible for a special Sunday deal that gave us a cream tea, dinner and breakfast. This sounded great. The cream tea was perfectly OK although the scones were a bit doughy. But it was the dinner that was the big disappointment. The Armada restaurant was fully booked so we ate in the Grill Room. And here we hit the snag of non-meat eaters trying to find something veggie in a menu that consists almost exclusively of meat and over-elaborate fish dishes. We eventually settled on macaroni with a blue cheese sauce, served with chestnut mushrooms and asparagus. It turned out that the mushrooms and asparagus were a modest garnish on top of the macaroni. And looking round at the other diners' plates, it seemed that vegetables rarely make an appearance in the Grill Room unless they are forming the frilly green bits around a steak. This was also rather disappointing. It would have been nice to order a green salad, or possibly even a plate of broccoli, to go with the macaroni.", "title": "Wonderfully attentive staff", "user": "Lucy K", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141975363}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We had friends to stay over the weekend and during a long walk in The Forest we stopped at The Rhinefield House Hotel for a cup of tea and a light bite. Yes a bit bedraggled but never-the-less customers. We were a party of 6 and since my wife and I have used The Rhinefield a number of times, including stays before we moved to the area, the fine dining restaurant and as we did today for just quick refreshments in a lovely surrounding. We wanted cakes with our tea and I asked the Maître De to explain how many cakes there were on the very inviting cake stand on the table nearby. It was if I was speaking another language. Anyway I ordered 2 cakes for each of us and we got 20 Mmmmm. Then they tried to deliver another batch, confusion continues. The cakes were very nice and when we had finished I asked for the bill. The waiter brought me someone else’s bill and I pointed this out to him and then he brought ours. I studied the bill and I was very confused could not work out why we had 4 selections of cakes. I asked him how many cakes there were to each selection, to which he replied “is this a trivia question sir”. Now I don’t mind paying that sort of money for the surroundings and the lovely tea and cakes but since we have been going to The Rhinefield for a number of years, well before it became part of The Hand Picked Group. The standard of service has significantly dropped and the rudeness of the staff today has made me write this long overdue review. Sorry Hand Picked Hotels you just lost a customer and a local one at that.", "title": "Service definately down hill", "helpfulness": 2, "user": "Lyndhurstking", "date": "October 20, 2012", "detail_rating": {"value": 3.0, "location": 5.0, "service": 1.0}, "id": 143286378}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The first night of our honeymoon was spent at Rhinefield house 7th October 2012 . The Hotel itself is beautiful and the grounds well maintained. The cream tea was delicious however the lounge staff fairly distant and not welcoming.", "title": "Honeymoon", "helpfulness": 6, "user": "Rae S", "date": "October 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 143251879}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We had booked an inclusive offer and the allocated room was lovely, well decorated and clean. The complimentary strawberies and sweets were delightful.", "title": "Beautiful hotel, staff were friendly and helpful.", "user": "Kayleighaw", "date": "October 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142856220}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Unfortunately the staff at the hotel are its failing point. Although we were told to look at both menus for the evening meal we were booked into one particular resturaunt rather than given the choice and when this was queried by us (as we prefered the other) a very loud patronising 'scene' followed. In full view and hearing of the entire lounge the staff member repeadly refering to the 'package' we had booked and that as part of the 'package' we had been pre booked into the armada resturaunt. On several occasion I asked the staff member (? restuarant manager) if he could keep his voice down. Sadly not!! My husband then said he would go to reception and discuss the issue and was told 'please go ahead as reception will deal with me anyway'!", "title": "Beautiful Hotel & Grounds", "user": "Skilovingme", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142843675}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Eventually we were given a table in the other resturaunt (next to an empty table which remained empty all evening) several other tables in the restuarant were also empty - why the fuss?", "title": "Beautiful and indulgent hotel (especially for a minimoon!)", "user": "danspursfan", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142796141}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "From the minute you see the hotel, it has the 'wow' factor, looking like a castle set in beautiful forests. We were made to feel welcome straight away as we were welcomed by friendly receptionist Natalie and a lovely wood fire, checked in quickly then she showed us the restaurant and guided us to our room, whilst chatting to us which was nice and made us feel valued as guests. She kindly helped us get our luggage in the room and after explaining where everything was, with a big smile wished us an enjoyable stay and to ring her on reception for anything we needed. Very good first impression.", "title": "Very special..Will definately return.", "user": "Davetravel13", "date": "January 17, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23627040, "likes": {"liked": "— Staff and the location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Room was lovely, very warm and clean, big bed with a large plasma tv and everything we could need, lovely views and it is definately worth requesting a garden view. We soon settled in and spent the day exploring the grounds and forests.", "title": "Really Special", "user": "Brussel", "date": "January 4, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 23244922, "likes": {"liked": "— The cozy room", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "On the way to dinner, we were greeted by Roary in reception who was also very friendly, he took us to the restaurant and took care of our every need. The food was gorgeous and we had an enjoyable meal, it would be nice to have some soft music in there as it was abit quiet.", "title": "Very Very Disappointed", "helpfulness": 2, "user": "Owlsnest", "date": "January 3, 2009", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 23218024, "likes": {"liked": "— The room was a good size", "disliked": "— Staff"}}, {"rating": 4.0, "title": "A balanced opinion!", "text": "Great nights sleep, we didnt want to get up in the morning! On the way to breakfast we were greeted by natalie again who remembered our names, breakfast was good but we were unsure of the process and had to get up to search for juice (which was all set up in a seperate room). We settled the bill with natalie and she printed us off a AA route planner to get to beaulieu motar museum, definatley worth a visit aswell.", "helpfulness": 4, "user": "booksearch22", "date": "December 17, 2008", "id": 22813563}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We had a lovely stay at the hotel and would definately come back again, all the staff were chatty, happy and made every effort to help make our stay enjoyable. The location is excellent and we look forward to going to going back soon.", "title": "disapointed", "user": "vianne8", "date": "December 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 22801149, "likes": {"liked": "— breakfast", "disliked": "— dinner / room / bar area"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 60, "average": 116, "very good": 227, "terrible": 47, "excellent": 421}, "aka": "Rhinefield House Hotel Brockenhurst", "slim_ranking": 0.6, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}