{"user_rating": 4.5, "review_count": 109, "name": "Riad les Hibiscus", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I would highly recommend this hotel if you are looking for somewhere in the hub of things, that is close to the sights - within easy walking distance, that is clean, friendly and welcoming. Rooms are spacious though basic throughout but more than adequate. Breakfast served round the water feature on ground floor or on roof if weather ok - food is simple but fresh and sets you up for the day. A great place to see Marrakech from.", "title": "Hotel extremely central, is welcoming, clean and relaxing - best to arrive during the day.", "user": "Emmy100", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99145257}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Arriving during daylight would make finding this little gem easier as taxis cannot access the immediate area of the medina so you have to walk - signs are not that obvious and the bustling street activity make the surroundings look so different at night compared to during the day.", "title": "Wonderful Refuge from the Medina", "helpfulness": 2, "user": "roboyce", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 98069948}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Excellent traditional Riad located right in the heart of the Medina. Amazingly quiet despite the hustle and bustle of the surrounding area. A few additional notes below:", "title": "Very clean,outstanding service, friendly staf, excellent food by Karima.", "user": "Soesoe1", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 95261842}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Positives:", "title": "The perfect escape", "user": "sarahtamp84", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85372423}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "- The location is very convenient for taking in the sights and sounds of the Medina/Souk", "title": "A haven of peace and tranquility.", "user": "GarethLuker", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84861697}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The Riad has a great location very near the Medina but when we stepped inside the first thing we noticed was the quiet. It is a lovely building and we stayed in the Iris room which had plenty of space and a great style and charm to it. The staff was very friendly and helpful - coming to meet us at the Medina to help us find our way there, and going to pick up bus tickets for us as well. We were able to use the Riad pc to check email and the small breakfast was quite good. The room and Riad was as good as the pictures look on the the website. Nothing negative to say - we would not hesitate to stay here again and hope we have the opportunity to do so!", "title": "Local Gem", "user": "LFa1234", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62602173}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed in the riad for 7 days and we got a lovely big room on the first floor, l'orchidée. The room was very quiet, although it was on the street side (it was more of an alley in fact), we didn't hear any noise from outside. The whole riad is such a quiet and peaceful place, it's just amazing it's only a few minutes away from the hustle and bustle of the souks and the square! The staff is very friendly, discrete and always available. They really wanted us to have a great time at the riad and helped us a lot in finding our way around. The area around the riad is also safe, you can come back in the night without any fear. Breakfast could be a bit more elaborate, but it was ok. We certainly recommend this place!", "title": "a perfect place to relax", "user": "ginoann", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60152029}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Les Hibiscus is 3 minutes walk unladen from the main square - Place of Execution in the centre of Marrakech. After about midday, taxis are not allowed in the sqaure, so its a 15 to 20 miniute walk with luggage from the far side, across the sqaure and down the souks - not easy with luggage, crowds, and motorbikes. motorbikes are allowed at all hours and are the blight of the narrow alleys. There are 8 rooms in Hibiscus, all inwardly facing. Some are unpleasant, dark, and adjacent to the communal sitting, smoking or playing area. You can't close the windows or you'd smother, so its not very relaxing. The hotel had our booking wrong, by room kind and by the number of nights. They were apologetic but there is an air of Inshallah about the place. Breakfast was included and when we were there was served indoors due to a winter of bad weather - nice fresh orange, coffee, pancakes, bread - French style. Rooms are dark, long and thin and not really designed to stay in but its a peaceful respite from the clamour outside and very handy for the souks. There is a VERY small pool, paddling maybe but not big enough to swim. The hamman advertised wasn't running when we were there. Its a quiet location until the recordings from the mosques start at 4 am.", "title": "Not what it said on the tin !", "user": "amy000", "date": "March 22, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 59228781}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This Riad is absolute value for money. Its tucked away down a little side street no more than 3 minutes from the main square and 2 minutes from the Souks. Its a lovely quiet and tranquil place with a very relaxing feel to it. The staff are helpful when you need them otherwise you feel you have the place to yourself.", "title": "Perfect!", "user": "susielou36", "date": "March 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58062325}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We couldn't have asked for anything better.", "title": "A magical place", "user": "karen_teich", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57852362}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Small riad close to the main square. Very Calming. Breakfast simple. Friendly staff.", "title": "Lovely place, quiet, friendly and enjoyable.", "user": "Madge79", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82702008}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was our first trip to Marrakesh and although arriving at night, we had very sketchy details of the Riad's location. It is very close to Djemma el Fna but down a long narrow but well lit alleyway in the heart of the medina. From the outside, the Riad appears inconspicuous with no hint of the smart, attractive interior beyond. We stayed for 3 nights and found all the staff very helpful and friendly especially Yasim (sic); see below.", "title": "A tranquil hideaway right in the heart of the Medina", "helpfulness": 1, "user": "CptSuntan", "date": "September 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79681453}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The rooms are all ensuite and very clean although somewhat narrow but I guess that's just the style of the architecture. The breakfasts were adequate continental style; bread, jam, Morrocan pancakes, fresh orange juice, and coffee, but enough to set you up until lunch.", "title": "Tranquil sanctuary", "user": "bubbleso0o", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75865936}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "Despite being close to the square, the Riad is amazingly tranquil and a nice escape when the heat & madness of the city begins to drive you crazy. Thankfully, the courtyard is open to the sky and contains a small plunge pool to cool off in .", "title": "A calm oase, in a busy city", "helpfulness": 1, "user": "Ben G", "date": "August 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74556449}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "One word of caution - we arrived in late evening and after being transferred to the outskirts of the Medina by private car (from ResortHoppa not the Riad), we were put in the hands of a very old man and his cart to take our baggage into the Medina. For some reason, either by accident or, more likely, a pre-arranged scam, the old man managed to get lost! We were then joined by a younger man who happily lead us about 50 yards down the Derb to our Riad and then demanded 100 MDs (about £10) for his time and that of the old man. Whilst I would quite happily pay the old man for his service (he must of been at least 80!) the guidebooks advise about 3-5 MD's per bag. Luckily Yasim (sic), the hotel receptionist came to our rescue and saw them off. He was a star.", "title": "great location is you want to be in the centre of it!", "user": "topsyturvey_10", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72813923}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This was an oasis of calm in the middle of an absolutely mental city! The customer service is top class and the location is perfect, right off the square so no more than a few minutes walk but it is still so peaceful and quiet inside the riad. This does mean that you are thrown right into the madness as soon as you come out of the small alley the riad is down but you're certainly in the thick of it!", "title": "Great choice!", "helpfulness": 1, "user": "charlenedj", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114916148}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "If you are staying in room Alamanda please keep in mind there is no toilet door, just a curtain, not ideal for a couple but we got by! I don't know if the other rooms are the same.", "title": "A charming and quiet riad", "helpfulness": 2, "user": "Hydronly", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 113299908}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Breakfast got a bit boring but we stayed in a few different hotels all over Morocco and it was the same everywhere!", "title": "A little piece of heaven in amongst the chaos", "user": "Morocco0707", "date": "March 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100465982}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "You should absolutely take the offer of the taxi as you will not find this on your own. It is a bit over priced but it means you dont have to haggle for one as soon as you're off the plane and someone will take you right to the door. If you decide to try finding it on your own then walk down Derb Debacci off the square and turn right at the Pharmacy sign and go down the alley to the very bottom where you will find a wee green door on the right.", "title": "Good weekend in Marrakech", "user": "travellingcj", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99777484}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Pool was small but did the job and there are sun loungers on the roof.", "title": "lovely hotel, great location and design", "user": "Rosemary181060", "date": "March 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99286342}], "location": {"country": "Morocco", "region": "Marrakech-Tensift-El Haouz Region", "continent": "Africa", "city": "Marrakech"}, "stars": 4, "variance": {"poor": 1, "average": 3, "very good": 29, "terrible": 1, "excellent": 75}, "aka": "Riad Les Hibiscus Hotel", "slim_ranking": 0.270216962525, "description": "Only a stone's throw away from the picturesque markets of Marrakesh and the famous Jemaa El Fna Square !"}