{"user_rating": 5.0, "review_count": 628, "name": "Riad Laaroussa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Riad Laaroussa is a beautiful riad in every way. The rooms are amazing and if you imagine yourself on the ideal Moroccan holiday, Riad Laaroussa is what it looks like. In addition the staff--absolutely everyone--is exceptional. They are warm, efficient, and infinitely patient. They were extremely accommodating of our young children as well as older guests. Furthermore, the location is ideal, it's in the heart of the media but somehow is a quiet oasis in the city. And if all of that doesn't impress you, book a night just for the food. Wonderful breakfasts and dinners not to mention lovely cookies, tea, and wine arriving before you even realized you wanted them. Wonderful. We're already planning out next visit.", "title": "Gorgeous hotel with warm, wonderful service", "user": "Patricia T", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159014326}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I stayed here for two nights when we visited Fes and we loved it! We stayed in the yellow room but was upgraded to the orange room on the second night. The entrance was not elaborate and when we first arrived at the door we were skeptical about this riad and thought we had made a bad choice. But as soon as you stepped into the riad, the atmosphere was totally warm, refreshing and lovely. Each room has unique decor that was thoughtfuly selected by the owner. The staff was extremely friendly and went out of their way to make us feel welcome. When we checked in, our room was ready with candles and fireplace ready lighted up. Breakfast on the roof terrance was completely fantastic. We really enjoyed our time at this riad and would highly recommended it for anyone who comes to Fes.", "title": "More than expected", "user": "Chris T", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158902059}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Lovely Riad. We were in the red room first, but there are no doors to the bathroom, it is just one big open plan. Very romantic but not for the bashful. So we moved to a larger grey room with a fireplace. Romantic, spacious and lovely. Biscuits and Moroccan tea free during the day :) Like a previous poster said, they have a cat. A very friendly cat. But more important than the cat, they have two big dogs.. very sweet and very friendly. The Riad is a home, to a couple with two kids, and to everyone who stays at the hotel. It really did feel like home. The staff is super nice. Not just nice, but super nice. So accommodating. The food is first class. There are lots of stairs to climb so if you have bad knees do be aware. This is DEFINITELY a place we will come back to again.", "title": "stay here", "user": "salampeace", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158269118}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "From the moment we stepped through the door we were instantly made to feel totally at home. All of the staff (not just the wonderful hosts Cath & Fred) were amazing and felt like friends rather than staff. Our two boys aged 10 and 13 loved the room (The Cream Room) and the breakfasts on the rooftop - they also loved the 2 resident Labradors and cat. I spent a morning with the chef shopping at the local markets in the Medina and then helping in the kitchen to prepare and learn about tagine cooking which was a fantastic experience and definitely a highlight. The in-house hammam was also fantastic. If I could return to any part of Morocco it would be Fes and the Riad Laaroussa.", "title": "Everything and more than I hoped for!", "user": "Sarah-Jane2013", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158262172}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Beautiful, unique rooms and great service. Day begins with a full breakfast on the roof terrace overlooking the Fes medina. Riad is centrally located in the medina - great for exploring and for getting lost. Most shopkeepers and other Fassi knew the riad and were able to help us get back to it when we were lost so this wasn't a concern. Wonderful service provided by Sabah and Karim. The owners, Fred and Cathy, were on site (they live next door) and very friendly and helpful. We weren't lacking for anything. If I return to Fes, I'd stay here again.", "title": "Beautiful, unique rooms and central location", "user": "jaimebien", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158234689}, {"rating": 5.0, "title": "Fantastic!", "text": "Riad Laaroussa was home in Fez for 2 nights, and hopefully will be home again sometime soon. The staff was extremely kind, spoke great French/English, and helped my family and I to navigate the old town with a great guide and recommendations. The suites are situated with a seating area around a fireplace, which was extremely cozy and comfortable after a long day touring around. It's a beautiful spot in a quaint, historic city. I recommend for families, couples, or anyone stopping in Fez.", "user": "McPbr", "date": "April 3, 2013", "id": 156516892}, {"rating": 5.0, "title": "Terrific!", "text": "Riad Laaroussa", "user": "cyb3r13g0", "date": "March 31, 2013", "id": 156116611}, {"rating": 5.0, "title": "YES!", "text": "Riad Laaroussa was a spectacularly great riad; in fact it was the best riad we have ever experienced, in terms of services, our room, facilities and food.", "user": "Leopoldo R", "date": "March 28, 2013", "id": 155881726}, {"rating": 4.0, "title": "A medieval Moroccan sanctuary", "text": "About Our Stay", "user": "Temple B", "date": "March 20, 2013", "id": 155200825}, {"rating": 3.0, "title": "Fantastic position in the centre of the medieval medina, however make sure you use a guide to make the most of your experience.", "text": "# of Members: 3", "user": "Timbosan", "date": "March 17, 2013", "id": 154830448}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Fez was our favorite spot on our visit to Morocco. That has as much to with the wonderful city as it a tribute to Fred and Cathy at Riad Laaroussa. We travel often (see how many reviews I have) and do our best to find smaller, boutique hotels wherever we go that give us the true flavor of the place we are visiting. Riad Laaroussa not only fits that bill, but offers the charm and luxury right in the middle of the Medina.", "title": "Not just in Fez or Morocco - Probably the best boutique hotel we have ever visited anywhere!", "helpfulness": 2, "user": "Msk6261", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160006351}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were greeted at the train station by a driver and then met at the Medina walls by someone to transport our bags through the maze that is the Fez Medina. I can't imagine how we would have found it on our own that first day but by the end of our visit, we were old pros at navigating the city.", "title": "Fantastic Riad", "user": "ktw53721", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159838333}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "As soon you enter the Riad, you are transported into another world. It's elegance and attention to detail are evident. Apparently, the original building was a palace of historical importance. Our independent Fes city guide told us it was where the document of Independence for Morocco had been signed many, many years ago. The courtyard landscaping and overall architecture of the Inn are just beautiful. It was obvious every detail was considered in the renovation, not only for the comfort of the guests but in regards to the integrity of a former palace of Morocco.", "title": "Bliss in Fes top-class Riad Laaroussa!", "user": "Dia_Carstens", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159698912}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Our suite was immense and comfortable and beautiful and romantic and relaxing. The bedding, linens and towels were all top quality. And Oh.....our bathroom.......... Copper sinks and exotic woods! W", "title": "Paradise!", "user": "DJBEnnis", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159651978}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Climb to the rooftop for a beautiful view on a relaxing veranda that doubles as the breakfast room, the restaurant and the wine bar. Even if you don't leave the Riad, you could spend your day relaxing here on lounge chairs with sweeping views across the city and wait for the lulling sounds of the succession of Calls to Prayer from around the city. Our dinners, snacks and breakfasts we had here were elegantly presented and truly delicious. We also spent time in the Hammam and had 2 wonderful massages.", "title": "Can't praise the staff enough", "helpfulness": 1, "user": "Karen S", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159130138}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Loved this place. Everything from our beautiful room to the impeccable service to the warm and personable owners to the food. I would stay here again in a heartbeat and can't wait to go back. We stayed in the Blue Room, which was gorgeous.", "title": "Perfect place to stay in Fes!", "user": "ankazobe", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158209153}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Fantastic morning breakfeast on the rooftop - fresh squeezed OJ can't be beat.", "title": "Beautiful Riad", "user": "Jennifer R", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157726732}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The staff was so friendly and helpful, they were very accomodating and sweet.", "title": "Spectacular Raid and Terrific Owners and Staff", "helpfulness": 1, "user": "GlenB992", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157373602}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The location is prime and we always felt safe getting to / from the Riad.", "title": "Excellent", "user": "HannahMistral", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157371146}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "There is a house cat - so if you aren't a fan of either the sight or smell (everywhere!) of cats, this isn't the place for you.", "title": "1001 nights with Sabah & team", "user": "FrankyPascal", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156876817}], "location": {"country": "Morocco", "region": "Fes-Boulemane Region", "continent": "Africa", "city": "Fes"}, "stars": 4, "variance": {"poor": 1, "average": 5, "very good": 36, "terrible": 0, "excellent": 586}, "aka": "Riad Laaroussa Hotel", "slim_ranking": 0.0235294117647, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "In the heart of the Medina of Fez, Riad Laaroussa opens its doors to you for an exceptional place in a relaxed atmosphere. An immense 17th-century palace, 8 suites and rooms surround a beautiful courtyard with orange trees so that you can relive the splendor of Fez. A huge terrace, a variety of spacious living areas, comfortable and warmly decorated and a very caring staff are at your disposal to make your stay memorable. At Riad Laaroussa, you can also enjoy our spa with a private, authentic hammam and relaxing massages as well as enjoy quality Moroccan cuisine on one of the terraces with breathtaking views."}