{"user_rating": 4.0, "review_count": 267, "name": "Richmond Marriott", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Had a wonderful stay here. Everything was so clean and the staff was very friendly from the front door coming in to walking me to the car when leaving. I will stay again for sure! I'm not one to write reviews, but really felt the need to today!", "title": "Exceptional", "helpfulness": 1, "user": "billpl", "date": "July 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170056668}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I travel for work, and I always stay at the Marriott. There are a couple reasons.", "title": "Been Staying Here for Over a Year", "helpfulness": 1, "user": "Andrew C", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169823641}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "1. Location - It is right downtown off all the major roads. While many can consider the area sketchy, there are a lot of up and coming restaurants and bars in walking distance. There are some great running routes that offer flats, hills, and more. Need a larger gym than what is offered? Walk on over to the YMCA which is only a few blocks away.", "title": "Frequent Business Traveler", "user": "BellV2013", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169778534}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "2. The Staff - They are the friendliest staff I've ever met. Early on I thought they were being disingenuous, but they are really THAT friendly. They go the extra mile for every guest. I am fortunate to have access to the lounge. Unlike most Marriott hotels, this lounge offers real meals that are unique and not just some fried chicken fingers.", "title": "Great Service at this hotel!", "user": "sksksk77", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168836875}, {"rating": 5.0, "title": "Very Nice Hotel", "text": "I travel frequently for business and always look for a home away from home. This hotel far exceeded my expectations. Upon arrival the staff was prompt, professional and very friendly. I received concierge access and was very pleased by what they had to offer throughout the day. The hotel, my room, restaurants and the concierge room was well maintained and clean. If ever I return for personal or business matters, I will stay at this hotel.", "user": "A_Ruizcalderon", "date": "July 23, 2013", "id": 168793511}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Richmond doesnt have much to see but this hotel made my stay so enjoyable. Had a religious convention at the Colliseum just a block away and the service was wonderful! Staff very friendly and always there to see if you needed anything. Rooms were lovely. Had the 18 floor with a great view! Hope I can get the same hotel next year!", "title": "Wonderful weekend", "user": "traveltwin1951", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168301131}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I spent over two years staying at this hotel almost every week. I have stayed at Marriott (JW, Courtyard, Fairfield...and the Ritz) properties all over the US and this Richmond Marriott is the best I've been at. While the JW's and Ritz have nicer rooms/amenities I have not stayed at one Marriott property where the whole package is better than in Richmond. The JW and Ritz properties, as mentioned, have nicer amenities and physical plant but they don't have a concierge lounge and their \"service\" while courteous, is very generic. At the Richmond Marriott the team is very personable. Whether the front desk, the concierge, the bell hops or the valet team everyone goes out of their way to make every guest (not just the platinum elites) feel welcome. I've seen this staff deal with some very tough customers and situations and they always did it with the utmost professionalism and courtesy. The team treats each guest with a genuine sense of warmth and caring...and that's very important to me. Staying for over two years, I have seen the hotel and staff in a variety of situations. Air conditioning break downs, huge conventions, and also lulls during the holidays...etc. The management is dedicated to making things right. When there were problems with the physical plant they were fixed quickly, the maintenance team does an outstanding job of keeping things running smoothly. They recently replaced all the beds and they are a huge upgrade...better than the beds at the JW in Orlando. Really can't say enough good things about this hotel, the management and the staff. I'll give shout outs to some of the staff...and apologize to those I've neglected. Cathy, Crystal, Brian, Nigel, Richard, Mary and John were people I interacted with most frequently and were all fantastic...props to the Richmond Marriott crew.", "title": "Frequent Business Traveler", "user": "Douglas G", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168176961}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed for 5 nights over July 3-7, and did most of our eating in the room, since our conference was taking place in the Coliseum next door. Housekeeping staff was invisible, but every afternoon we came back to a nice clean room with even our own stuff carefully arranged. The hotel staff also accommodated a few unusual requests and NEVER said \"sorry, we can't do that.\" (Once, I needed a LOT of one dollar bills, and the woman at the front desk cheerfully gave me every last $1.00 bill they had.) The bell staff was also very efficient and flexible - we needed extra time before checking out, and the bell man went away after partially loading the cart and returned an hour later so we could finish getting ready. Only downer the whole time was that the exercise room had several broken machines that hadn't been repaired. Even so, I was able to get in 2 abbreviated workouts.", "title": "Very enjoyable stay. Accommodated our unusual schedule.", "user": "snowbirdBrunswick_MD", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168124740}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Really friendly hotel staff, probably the most personable staff I have ever dealt with. Everyone went out of there way to accommodate and seemed very genuine. Spotless room, and the breakfast buffet in the restaurant was very good. Would certainly return next time in Richmond.", "title": "Great Experience", "user": "Lindsay T", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168037566}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Got in late at night. I am Marriott Gold. Barely acknowledged me at checkout. I had booked a room with a king bed guaranteed. Given a room with 2 queen beds and the man at the counter on the far left did not even bother to mention that to me, I don't fuss, so I didn't call down despite feeling like it and expressing my displeasure.", "title": "Disappointed", "user": "FTLAW", "date": "July 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 167347000}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Had a quick stay over the weekend, although there was a lot going on it seemed as if the staff handled it quite well. The check in process was quick but friendly. The one agent mentioned the new beds which felt great. The hotel was well maintained and cleaned. Overall the stay was great, will be back if in richmond", "title": "Great stay, great staff", "user": "Gsoongnart", "date": "July 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 168719142}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "Setting aside the fact that my card was charged incorrectly, the front desk staff should let guests know that if you use a debit card,in addition to full hotel bill ( which was fine ) but it will also hold funds for valet parking ( up to $26 per day ) even without asking if you would be using valet. I DIDN'T DRIVE! I understand a certain amount over the room cost can be held for incidentals but the amount should be disclosed before its held! And over $50 per day is not reasonable. It's been over 7 days and they still haven't fixed it (still pending at the hotel) And again the amount should be disclosed before. I will never stay at this location again, in fact I'm done with Marriott hotels overall. No matter how nice the staff was, and they were great. The entire stay was ruined by this billing problem and the lack of concern from the people I talked to. I wasn't just upset because its not what I wanted to hear, but the general lack of empathy.", "title": "Not a good value", "helpfulness": 1, "user": "Mitasazama", "date": "July 22, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 168594714}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "To start off...I have stayed at this property several times in the past year. I am in the Richmond area almost monthly and this is one of my favorite properties to stay at. The Lobby was recently renovated and is fresh and inviting. Front desk staff continue to excel in Customer Service and friendly folks to deal with. (Truly exceptional service). This property hosts a \"Starbucks\" which is nice for a cup of coffee both day and afternoon pickup. The Sports Bar has very good food at reasonable prices and great atmosphere.", "title": "Location, Great rooms and Exceptional Service", "user": "95traveler", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168432863}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "With this recent trip I found myself turn sick upon arrival with some type of stomach virus. The staff was extremely quick when I called to get an additional blanket. The beds are extremely comfortable and made my time in bed more manageable. The hotel restaurant went above any beyond when I made a special request for a bland meal to manage my stomach virus.", "title": "Amaaaazing Stay", "user": "jj H", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168351572}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The property has a nice indoor pool and pretty impressive gym as well as a tanning deck.", "title": "Good staff; location ok", "user": "LSC06", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 168310277}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Went to see a concert at the National Theater and this Marriott's location is only 1 block away. Staff tries very hard to accommodate guests, especially Platinum members. Happened to be placed in a room next to a wedding guest room block. Guests were noisy and had to be warned by security multiple times before settling down for the night. Breakfast was included as part of a Marriott Platinum/Gold membership special and was quite tasty. All in all a decent stay based upon the circumstances.", "title": "Noisy but convenient hotel", "user": "dnumgis02", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 172121362}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Made up my mind to go to Tarrant's Cafe for dinner before choosing a hotel (it's that good) and the Marriott is only 4-5 blocks away. Had no trouble walking to and from hotel. Worst part of the walk was seeing all the empty storefronts on Broad Street. Have stayed in many a Marriott and this one served its purpose. Staff friendly and helpful as always. Room what I expected including being clean. Rate was excellent. Save some money and park in the public lot behind the hotel. Paid $8 for the entire weekend.", "title": "Walking distance toTarrant's Cafe", "user": "CWnut", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171883111}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "A bright open lobby. My friends did not like the restaurant in the lobby. Overall comfortable room but I was dismayed by mildew in the grout in the bathroom. Very disappointing. The counter in the bath seemed low as well. The front desk staff was friendly. I have to say while the person helping me was friendly she was a bit clueless about by simple requests yet she did accommodate me after I had to be very specific. For instance, if one is leaving a note for a guest rather than handing me a post it to write the note hand me paper with an envelope that can be slipped under the guest's door by the staff.", "title": "Decent Stay Except for One Important Thing", "user": "dctraveler6010", "date": "August 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 171799230}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The hotel location is central but on a one way street making access to the garage very awkward. One has to drive a couple of blocks away to turn to park in the garage in the next block that has adjoining bridge to the hotel. One can't turn directly out of the hotel driveway to the parking garage. Haven't seen more awkward set up to get to parking, but once parked the parking was convenient with the adjoining bridge.", "title": "Standard Marriott property in a listless location", "user": "Wayne_son_of_Murray", "date": "August 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 171717870}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Overall it was a pretty decent stay except for the mildew.", "title": "Frequent stays in Richmond", "helpfulness": 1, "user": "sailorinKS", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171086923}], "location": {"country": "United States", "city": "Richmond"}, "stars": 3.5, "variance": {"poor": 15, "average": 50, "very good": 109, "terrible": 14, "excellent": 79}, "aka": "Richmond Marriott Hotel", "slim_ranking": 0.282352941176, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "In the heart of downtown, the newly renovated Richmond Marriott offers a blend of luxury and Southern charm. The well-appointed guest rooms and suites at this Richmond hotel offer great views of this city and we offer a complimentary shuttle to a number of diverse dining and entertainment venues. Other upscale amenities or conveniences include our Revive® luxury bedding, lobby Starbucks Coffee Shop and concierge desk."}