{"user_rating": 4.0, "review_count": 480, "name": "RIHGA Royal Hotel Kyoto", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "Location is quite convenient for Kyoto station (though not as much so as the Granvia) and the room we were given was well above-average. Revolving restuarant at the top was worth teh visit, f a little over-priced. Breakfast buffet was disappointing and a bit of an unpleasant scrum. Staff were friendly and would stay there again, but only if the Granvia was full...", "title": "Quite a good hotel...", "helpfulness": 8, "user": "Kinnik", "date": "May 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3446975}, {"rating": 4.0, "title": "Awesome for the price - excellent service", "text": "On my last assignment in Kyoto, I had the pleasure of staying at the Rihga Royal for 7 nights.", "helpfulness": 56, "user": "A TripAdvisor user", "date": "July 14, 2004", "id": 2295011}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This hotel is in the centre of Kyoto.It is 10mins from the train station and taxi fare cost was 1500 yen to the hotel.", "title": "Excellent location", "helpfulness": 1, "user": "courtod", "date": "March 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7202861, "likes": {"liked": "— location spot on for the centre of Kyoto", "disliked": "— Bathroom clean but needed updating,but hey I know we don't stay in there all day."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "It is on a corner and a stones throw is the shopping district and the famous eating area Pontocho.Room was average size very clean and had been updated,but bathroom was still mid 80's with plastic walls.But bathroom though in need of update was very clean.", "title": "Hugely helpful staff make this grea", "helpfulness": 2, "user": "email_queenLondon", "date": "February 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6777125, "likes": {"liked": "— The staff and the location"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Had a great stay at this hotel - the staff are all enormously helpful, and can't do enough for you. It's also in a good location, just round the corner from the station with all the shops, restaurants etc there, and it's just a short taxi ride to Gion.", "title": "Not well kept", "helpfulness": 4, "user": "sdab", "date": "December 19, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 1.0}, "id": 6472890, "likes": {"liked": "— The staff is friendly", "disliked": "— It is very old"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "As others have pointed out, the hotel may not be the most modern design but it's clean, comfortable and cute in a retro kind of way.", "title": "Don't judge a book by it's green cover", "helpfulness": 15, "user": "cleeksock", "date": "July 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5491619, "likes": {"liked": "— great room, awesome location", "disliked": "— less than friendly staff"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "The only thing I'd say is not to bother with the restaurants - after a long flight, and on our first night in Japan, we decided to take the easy option and eat in. The food certainly wasn't bad, but it was pricy and not that generous - and we were the only people in the place. (Having said that, you can say the same for most hotels unless you're in the top-class 5 star places.) And it doesn't really matter as you're spoiled for choice nearby, so you'd probably only consider it if you were feeling as jetlagged as we were!", "title": "Not so nice", "helpfulness": 3, "user": "MarisaCosco", "date": "June 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 5347139}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We spent five nights here on our very first trip to Japan. The location, a few minutes walk from the JR Station is very handy for public transport (metro, buses and shinkansen). It's only 10 minutes walk, although we used the free shuttle bus on arrival and after check-out. Our room was best described as \"compact\", although there was room for a small table and two chairs. View nothing special although we could see the shinkansens passing by in the middle ground. Our rate was room only, so to minimise costs, we bought breakfast supplies the previous evening from Lawsons on the way back from the station and ate in the room. Our room did have a Japanese hot water \"kettle\" so we could make instant coffee no problem. Our room was a little hot as the aircon output was rather feeble. I could see this possibly being a real concern in the summer, not sure if they turn up the airflow then.", "title": "Pleasant, well-run place with good location", "helpfulness": 9, "user": "Gordon2112", "date": "June 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5300413}, {"rating": 4.0, "title": "A Plush Hotel", "text": "We ate in the hotel's teppanyaki restaurant one evening (special occasion) - fairly expensive, but totally sublime food, and a surprisingly good wine list. Other times we ate in one of the many inexpensive restaurants in the station area (in the shopping centre underneath, and in the food court up on the 11th floor). These places were a real revelation - delicious and filling meals in sit-down restaurants for under GBP15 each. I'd feared we wouldn't be able to afford to eat well in Japan, but the scare stories are ill-founded.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 21, 2006", "id": 5185460}, {"rating": 2.0, "title": "Did not like", "text": "The hotel staff seemed very pleasant and helpful (there are certainly plenty of them, so we never had to queue to check in/out, change money or arrange our onward luggage transfers). Had no communications problems, a large proportion of the guests are westerners.", "helpfulness": 20, "user": "ready5", "date": "September 8, 2005", "id": 3887040}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "My wife and I stayed for 3 nights and found the hotel very clean and comfortable. The prices in the hotel bars and restaurants are a bit steep, but then with a free bus service running between the hotel and the main train station every 10 minutes, who cares? There are more than enough bars and eateries there to satisfy everyone from the adventurous to the burger & chips fanatic. Very polite staff. I cannot fault the place.", "title": "Great staff!", "helpfulness": 3, "user": "peachbum83", "date": "July 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3639045}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Just came back from a trip to Japan and Hawaii with my husband, 8 year old daughter and 6 year old son on Aug 24, 2005. I stayed at the Rihga Royal Hotel in Kyoto and did not enjoy it very much. We had just stayed at the Palace Hotel in Tokyo (see my review) and compared to that this hotel was a disappointment. The staff were very polite and efficient but acted as if we were an inconvience to them or a trial to bear--no smiles and a very grim manner. The room was very small compared to our hotel in Tokyo but we did have the 2 twin bed room which is their smallest and our Tokyo room was one level up from their smallest. In fact we had booked this hotel because my travel agent told us it had larger rooms than many Japanese hotels! Also, the room looked as if it needed to be redecorated with wallpaper starting to peel. The view was covered by beautiful rice paper screen but when you opened them you were looking on a courtyard filled with HVAC systems or something. There is a pool for an extra charge and my husband and kids had a nice time swimming there one night (especially since it was so hot and muggy in Japan!). While they were swimming, I had a suina (Chinese-style) massage at the spa Carju Rajah located in the hotel (I think on the 8th floor). It was amazing (though somewhat expensive)! They mostly did not speak English at the spa and I don't know if the hotel staff would help out but if you can arrange a massage there I highly recommend it! Also, speaking of English, I was surprised at how limited many of the staff's English was. The hotel was very popular with foreigners; there were LOTS of people in the lobby and they were mostly Caucausian. However, when I would ask things, especially to bellhops or staff in the gift shops, etc. I would have a hard time communicating in English. I also speak Japanese fairly fluently so I would switch into Japanese and between the two languages I would be understood. Probably if you don't speak Japanese you would just have to keep asking or find a different staff member who spoke English better but I was surprised at this in a hotel that obviously catered to foreign visitors. They do have a shuttle to Kyoto's Train station, which has many restaurants and shops and is less than 10 minutes away, which is very helpful. I found the drivers, though, were another instance of the rigidity or unhelpfulness of the staff. We had been waiting close to 10 minutes as we had just missed the previous shuttle bus and the bus had unloaded all of the people. We started to go up to the bus (remember that this is August in Japan and the heat and humidity are incredible!) and the bus driver told us to wait. He got back in the bus, pulled it forward about 10 feet and then opened the door and told us we could get on. And in case you think this was just foreigners being impatient, another time when we were on the bus and stuck in traffic on the road just in front of the train station, a Japanese man came up and knocked on the door and asked to be let in. The driver told him he had to wait until we had pulled into the station. A minute later, still in the same place, an older Japanese lady knocked on the door to be let in. When the driver told her to wait at the bus stop, she pushed onto the bus saying she had already waited and it was too hot to wait anymore! And then when we got to the station where the man was waiting, the same thing happened to him that happened to us. The driver let everyone off, then got back in and drove forward 10 feet and finally let the poor man on. Again, this attitude of the staff of the Rihga Royal Kyoto was so different and unwelcoming compared to our experience at the Palace Hotel in Tokyo that it really took us by surprise. On the positive side, the hotel was very clean and the hotel gift shop had lots of nice souvenirs to take home as omiyage (souvenirs).", "title": "Great Hotel", "helpfulness": 12, "user": "dizzy21", "date": "June 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3558744}], "location": {"country": "Japan", "region": "Kinki", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 23, "average": 99, "very good": 243, "terrible": 9, "excellent": 106}, "aka": "Rihga Royal Kyoto", "slim_ranking": 0.278571428571}