{"user_rating": 4.5, "review_count": 288, "name": "Ritz-Carlton Dallas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband & I just returned from our stay. We booked directly with the hotel's online reservations. I had mentioned to a staff member via email when inquiring about specific spa services that my husband & i would be celebration our 10th ann & his bday. In the evening after we had checked in they had brought up a lovely chocolate & fruit desert which we thoroughly enjoyed. The entire staff was very helpful & cheery. Beautiful hotel. This is a new hotel so it was neat being the first one to stay in our room. It is in good location. We either walked were we wanted to go or took the trolley. We did have to take cabs a few times for a few things. Increase the cab rate about $5-$15 from what the hotel tells you. They said cab would be $35 from airport--it was $48. They said cab would be $15 to Northpark Mall--it was $22. Food in Ritz restaurant--ok, this was a disappointment for us. To ecclectic & just not very good. But service was great & again when they found out we were celebrating our ann./bday they brought us out these complimentary little deserts which were very good. Spa----excellant! If I had to come up with a complaint on this hotel it would only be that in our room the TV was on the dresser to the side of the bed rather than in front so if you are watching a movie, after awhile it becomes uncomfortable. But this was minor.", "title": "Lovely Ritz Carlton", "helpfulness": 4, "user": "bellaherna", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10042159, "likes": {"liked": "— Staff, Luxurious accomodations, spa", "disliked": "— food at Fearings, tv to side of bed not in front"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Overall--we thoroughly enjoyed this hotel. Dallas--well, not too much to do......", "title": "Brand New Ritz", "helpfulness": 7, "user": "tiffanyfig", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10038850, "likes": {"liked": "— Restaurant and bar", "disliked": "— Pool"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "The RC in Dallas is definitely a beautiful hotel – but I’m not sure if it is worth the price. The rooms are clean and big, but nothing spectacular. The service was great – ate at Fearings for breakfast only which was good. I was there for 3 nights on business and then my husband came up for the 4th night. We did go to the bar Friday night which was extremely busy and full of the hip Dallas crowd – we did have fun and a great mini-vacation – just not sure I would shell out all that money to stay there again. In the fall we stayed at the Palomar for 3 nights – also great service, modern, and much more reasonable.", "title": "Nice hotel - great service", "user": "Texan_Family", "date": "February 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 24686593}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "What can I say..... our first wedding night and this hotel was spectacular! Service, Food, all of it - 5 stars!! We had the bed and breakfast deal - the food was soooo delicious!!! We will be staying here again!!!", "title": "Best Hotel in Dallas!!! 5 Stars", "user": "nancygamez", "date": "February 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24480455}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I stayed at the Ritz Carlton at Dallas for 3 nights arriving on December 31st for the Cotton Bowl game between Ole Miss and Texas Tech. I thought the RC was the best hotel we have stayed in for quite a while. We are regular RC guests and we have stayed at their properties in NYC, SF, NO, Laguna Beach, Amelia Island, DC, St. Thomas, Jamaica, Cancun, Atlanta, St. Louis, et al. I think the RC Dallas beats them all. The service was outstanding. I booked my room through the hotel and all my dinner reservations, a car to the ball game, my wife's spa reservations, etc. through Robert at the Concierge. He was outstanding. Dean Fearing had a restaurant at the Mansion on Turtle Creek but left to open his own place at the RC. We had dinner there on the 2nd which was outstanding. DF came out to speak to us and we enjoyed that. The room service, housekeeping and bell service was outstanding. We will go back again soon.", "title": "Best Hotel In Texas.............", "helpfulness": 1, "user": "axle", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23300950}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Spent Christmas night here on our way to visit family. Decided to stop and take in the King Tut exhibit; booked a suite with the King Tut package.", "title": "You do live in a hotel.", "user": "Chellebell", "date": "January 1, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 23169009, "likes": {"liked": "— Fearings food and staff", "disliked": "— Snotty residents of the property"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The reason for my review title is this-people, you chose to live in a hotel, so don't act all put out when hotel guests are on the premises.", "title": "A little disappointed...", "user": "MissBonie", "date": "December 31, 2008", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 23140732, "likes": {"liked": "— Brunch at Fearing's", "disliked": "— No assistance with bags."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "For starters, it's a rare case when I get to stay at a hotel of this caliber, but I do have a generally high bar. That being said, this place met all expectations.", "title": "Met expectations", "helpfulness": 1, "user": "outidej", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 89556479}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My room was spacious, clean, and comfortable. The decor was both classic and modern. It could have used more power outlets strategically placed around the room. The alarm clock had an iPod dock. The TV was a large flat screen with good picture. The room had a large desk. The bathroom, done up in granite, was maybe the nicest thing about the room; It was large, had a separate room housing the toilet, had a tub and a seperate shower.", "title": "Beautiful hotel with fantastic rooms", "helpfulness": 1, "user": "beccarette", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86325348}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The 24-hours workout room had ProCore equipment and had employees from the spa down the hallway frequent the room during the day, supplying water and wiping down the machines.", "title": "Fantastic Stay at the Ritz!!!", "user": "wdm73", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85721457}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Of course, being a luxury hotel, the in-room snack bar prices were as high as you would expect.", "title": "Exactly what you'd expect of the Ritz Carlton - with great service", "user": "sb1London", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 79914094}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The location is on the edge of downtown. There's a some high-end restaurants across the street, as well as a strip mall with a Wells Fargo bank, a Pei Wei restaurant (of P.F. Changs' fame) and a Potbelly Sandwich Shop (a divine toasted sub shop that originated in Chicago).", "title": "Extremely friendly staff gives travelers Texas hospitality.", "helpfulness": 2, "user": "TXCtrow", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79582794}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Very enjoyable 4 night stay arriving Oct. 2, 2008. Fourth time at this property, but first time to review. Each stay has seen continued service improvements. Spa services last two stays and both times were very satisfactory. First time on club level at this property...very good food choices and good flavor for the most part...room service was extremely prompt and very good. Most staff members seem genuinely eager to please; Maricela in the club lounge was very personable and helpful; Kudos to concierge Dean for his efforts, attention and information...he even offered to go out of the hotel late one night to get my wife a soup the hotel did not have on menu...only negative comment would be when we were preparing to check out...It was exactly noon and we were putting the final touches on packing(maybe would have been 5-10 minutes late) when a young managerial trainee type knocked on the door asking if we required any assistance...he stated that he had already ordered our vehicle pulled up front and had a bellman in tow...I felt he was pushy and was trying to rush us out...what if We wanted to have lunch in the Hotel?!? This incident is all that is between a 4 and 5 experience rating.", "title": "Nice getaway !", "user": "rzrback62", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 20712813, "likes": {"liked": "— comfortable, clean rooms", "disliked": "— thin walls/hall noise"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Stayed overnight for the Eagles concert the night that Ike came ashore and the experience was incredible start to finish!", "title": "Simply the Best", "helpfulness": 1, "user": "eireland49", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20091843, "likes": {"liked": "— The staff! Always concerned about your needs and recall your preferences if you have been there more than once.", "disliked": "— The fact that I can't go there every weekend."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Dinner at Ferrings with the new Fall menu was outstanding--loved the Foie Gras and the new Halibut preparation; the sommelier Alec picked the perfect wine, service was impeccable. Wish I could eat here every night!", "title": "Great Service, Comfortable Suite", "helpfulness": 1, "user": "TallulahB", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19901094, "likes": {"liked": "— House car, helpful service", "disliked": "— Some minor room repairs needed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Going to the American Airlines Center in the rain--no need to walk or take a cab, Richard will drop you off in the Bentley and pick you up at the appointed time.", "title": "Improving and Excellent", "user": "NativeAustinite", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 19851851, "likes": {"liked": "— extras like bottled water, welcome iced tea, comp. frozen drink at the pool", "disliked": "— No 2-4pm afternoon tea time snack presentation on the club level : ("}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "The bar scene after the concert was ALIVE--who needs entertainment with this kind of people watching and great service from a non-stop, attentive staff.", "title": "Very Nice but not perfect....", "helpfulness": 1, "user": "monacoguy1", "date": "August 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19134830, "likes": {"liked": "— The luxury and impeccable settings of the room and the hotel", "disliked": "— Curtains do not fully block light ."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Absolutely wonderful hotel and experience. You must dine at Fearings. We sat across from Troy Aikman at dinner and the chef personally came around several times to see how everything was.", "title": "Great Experience", "user": "Austinguytexas", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19114027}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We booked and checkin with a Junior Suite including Breakfast and Valet parking, great deal for the price. However, at checkout we were notified that the average ticket for breakfast is only $60-70 per diem and anything over was charged to the room. I was irritated that this was not written or advised when booking the room nor at check in, and the front desk clerk removed the extra charges immediately. Room service for breakfast can easly get to $100 for only two ppl.", "title": "Staff went above and beyond!", "helpfulness": 2, "user": "katiey424", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18887851, "likes": {"liked": "— the staff", "disliked": "— the parking fee!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The Spa was excellent. Would definitely recommend at least one treatment there.", "title": "Great Winter Weekend Getaway", "helpfulness": 2, "user": "sahdoggiemom", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18651282}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The service was impeccable and definitely 5 star. We will definitely be staying again.", "title": "IT'S WORTH THE PRICE", "helpfulness": 1, "user": "Mike10902", "date": "July 7, 2008", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 17634549, "likes": {"liked": "— rooms, restaurant and pooll", "disliked": "— the price"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We decided to take an in-town vacation and celebrated a special occasion at the Ritz-Carlton Dallas. The service was impeccable. Every staff member greeted us and went out of their way to make our short stay special.", "title": "OPULENCE!!!!!", "user": "pimptown", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17185581, "likes": {"liked": "— Luxury", "disliked": "— No Parking only valet"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I stayed at the Ritz for a few days in January 2011 for a business function. The staff were wonderful. They greeted me by name every morning and were incredibly accomodating throughout my stay. In particular, I'd checked out in the morning only to return later that afternoon when I missed my flight, and not only did they check me back in at my corporate (reduced) rate, they made every attempt to put me back in the same room which I felt was above and beyond.", "title": "Fantastic Service", "user": "Nitra315", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113449691}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "One of the perks of staying at this property is the complimentary house Bentley which will take you to any destination within 5-10 miles of the property - that was a nice value-add. The rooms were immaculate - the bathrooms were large and spacious with separate shower, tub, bathroom and vanity areas. Even though I was staying for business, coming back to that room made me feel like I was on a mini-vacation. I wouldn't hesitate to return. And the plus, my room rate was less than $200/night - for a Ritz, that's a steal!", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Theogeor", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111653290}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I stayed at the Ritz-Carlton hotel during a recent visit to Dallas. The first impression when I arrive was great. I was checked in without even a minute delay and the staff were also very friendly and within less than 10 min since I arrived I was in my room with all my luggage.", "title": "Excellent hotel", "user": "2197050046", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109873571}, {"rating": 5.0, "title": "perfect!", "text": "The room was also great (Up to the Ritz standards of course) with a very nice comfortable bed and nice big bathroom with both shower and bath. I would say its in par with the best rooms I have ever been in other top 5* hotels.", "user": "mflickermd", "date": "May 3, 2011", "id": 106703135}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "As my stay was short I did not manage to use a lot of the facilities of the hotel but breakfast was very good quality (although no buffet) and the bar was a good place to relax (but very busy which is not usual for hotels bars..). Price wise is what you expect from a hotel of that class", "title": "Best Beds!", "helpfulness": 1, "user": "Orange1231", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106194344}, {"rating": 5.0, "title": "Perfection", "text": "I stayed at the Ritz as part of an overnight spa escape for myself and a friend. We were treated like royalty from start to finish. I have stayed at many Ritz Carltons and this is probably my favorite one in terms of service. All of the staff members, from the valets to the bellhops to the front desk and room service staff, were genuinely friendly and went out of their way to make sure our stay was perfect. We were upgraded to a beautiful corner room on the club floor, which was unexpected but certainly appreciated. The food presentations in the club lounge were decadent, and the club lounge host/concierge was wonderful. Our time in the spa was relaxing and we enjoyed our top quality treatments. We checked out the hotel's bar and patio, which was very lively on a Friday night, and we walked to a couple of other nearby hot spots as well. We ordered late night room service and the food was delivered promptly, with a smile. The next day we were given a late checkout so that we could enjoy a couple hours of sunshine at the pool, which was on the small side but still very pleasant. When we reluctantly checked out, we felt truly relaxed and pampered. Kudos to the staff at this Ritz for getting everything right! We will be back.", "user": "SanFranciscoSfgal", "date": "April 6, 2011", "id": 103089929}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "This hotel is wonderful and meets all of the expectations that one would have of a Ritz Carlton property. The Ritz Dallas has a top notch bar and restaurant. My husband and I stayed in a corner room and we were very happy. The location is fabulous. You are close to the financial district and Uptown. If you have time to sight see, hop on the trolley and check out Uptown and the art museum. For shopping lovers, the flagship Neiman Marcus is in Dallas and close to the hotel!", "title": "Beautiful Hotel", "user": "gaslamplover", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101972228}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We loved every minute of it. The customer service/staff was wonderful. Their attention to detail was impeccable. They valet your car and then relay who you are to the front desk people so as soon as you go to check in they call you by your name. The room was very spacious. The bed was nice and comfy. Separate shower and bath. The bathrobes were so nice and plush. The spa area is great. They have a separate area for men and women. They have a whirlpool, steam room, dry room, shower with 5 heads, a relaxation room and shower rooms. The area was nice and private. Definitely a must to try. One drawback though is they do not have free wi-fi. However, if you ever want to splurge on a hotel I would definitely recommend trying this hotel.", "title": "Amazing", "user": "csolis", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101678944}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed one night at the Ritz for an event we were attending in Dallas. The hotel is nice but a little ordinary. The room was nice; the bathroom was beautiful. The bathroom had a window next to the tub that had great views of the city. This Ritz property has a house car (a Bentley!) that can be used for short transfers on a first come first served basis. We used the car to our destination and the driver was very friendly and accommodating. We had breakfast at Fearing's and it was wonderful. About $75 for 2 people. Fearing's is a first class restaurant that we have dined at for dinner several times and it never disappoints. I don't feel like the tables are too close together as another reviewer discusses.", "title": "Pleasant Stay", "user": "TravlinTXFamily", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101054812}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I just got back from a business trip to Dallas and wanted to offer my whole-hearted endorsement of the Ritz-Carlton Dallas. Extremely convenient to Dallas' Love Field, this hotel far exceeded my expectations for the money.", "title": "Lodging Well Done!", "user": "ChrisJones5", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99927771}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "I recently stayed @ The Ritz-Carlton, Dallas on 29 December 2008 for 1 (one) evening. While the hotel is very nice, it's nothing to go crazy over. Upon arrival, the doormen were very friendly, including Isaac & Michael!!--both were attentive & warm. As I walked into the lobby, both the concierge & front desk agent (Gregg), greeted me by name, which was very gracious & welcoming. Gregg was polite, asking me how my trip was & briefly told me about the amenities. He as slow with directions & aloof at times. Upon check-out, he never asked me how my stay was, etc., which was rude & not acceptable @ Ritz Carlton's. The Front Desk was not staffed properly, as he was the only agent for several hours & caused much waiting among other guests. Also, the concierge left at 7pm on a weeknight, & was never there in the AM--not sure what that was about?! Patricia, also a front desk agent was nice, but nothing special. Ana, at Indulge, the hotels boutique, was super kind & I give much kudos to her!! The AM doormen were sweet as well, but not as engaging---they were just kids. However, I hate going to a Ritz & having Average Service at the front desk--if i'm paying $$$ to stay there, then the service should be beyond incredible & it wasn't here, which makes me so mad--people shouldn't he hired if they're rude & can't make a conversation with a guest--RUDE!---The lobby was pretty, with a huge floral arrangement in the center. The location is uptown, near many shops & restaurants. My room (543) was a corner king, which meant the room had two large windows & a window in the bathroom. The bathroom was nice, but the tub was not deep-soaking & had a cheap look/finish. The shower had a great fixture & the hot water was good. The amenities in the bath were BVULGARI, which are amazing, but it lacked other amenities usual in other Ritz properties--i.e. bath salts, sachets, loofah, etc etc... The bed was incredible!! There was a flat panel TV with great reception, as well a desk, mini-bar, iPOD dock, DVD player, armchair w/ ottoman, umbrella, coffee/tea maker, etc. When I arrived, my room had been turn-downed, with extra chocolates on the pillows, the bed pulled back & ice in the bucket--nice touch. The fitness center, pool, & spa all looked very nice. There was a set-up in the fitness area with chilled towels, bottled water, apples, magazines, etc. I work in the Hotel Industry, & this hotel was just rated #1 in the US by Zagat, but I'm not exactly sure how that is true. Yes, the hotel is Good, but it's just that & nothing more. I've stayed in much nicer Four Seasons & the room at this Ritz was OK, but just missing something, as was the rest of the hotel It's as if the whole place was un-exciting. Nothing blew me away. I only paid $209, & was in the area over the holidays, which is why I stayed, but the rack rate is $369-$429 & up & the rooms are ABSOLUTELY NOT worth that---. I'm glad I stayed, but wouldn't return. Hope this helps! Happy New Year & Safe Travels! PW, NY, NY 30 Dec 08", "title": "Nice Hotel, but nothing to Rave about", "helpfulness": 3, "user": "patrickwNewYork_NY", "date": "December 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 23113718, "likes": {"liked": "— Great Bed!", "disliked": "— Dusty behind bed"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "As an alternative to spending days in the kitchen cooking a huge holiday dinner, we spent 2 nights over Christmas at Dallas' new Ritz Carlton. It was time well spent, one of the most satisfying lodging experiences I've ever had at a very competitive rate for such a property. Comments follow; feel free to email with questions.", "title": "Elegant, attentive service, truly worthwhile visit", "helpfulness": 1, "user": "Mgz", "date": "December 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23022002, "likes": {"liked": "— Location, elegance, and service, service, service", "disliked": "— Pool heater broken, pool smallish, no whirlpool"}}, {"rating": 5.0, "title": "Loved the atmosphere!", "text": "LOCATION", "helpfulness": 2, "user": "Just4hertravel", "date": "December 23, 2008", "id": 22973292}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "On the south end of McKinney Ave, this hotel is directly adjacent to Crescent Court, and a short walk to numerous bars, cafes, shops and restaurants along McKinney Ave. The free trolley also runs in front of the hotel. I walked one night to/from Idle Rich, a great Irish bar, about an 8-10 minute walk. It's a great location.", "title": "Don't bother.....they don't!", "helpfulness": 3, "user": "eyerep74", "date": "November 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 21954760, "likes": {"liked": "— The Club on the 7th floor, the Valet service was excellent", "disliked": "— The bed alone made me just want to pack up and go home! I couldn't wait to leave this hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "ROOM", "title": "Excellent Hotel, Ritz Carlton Experience", "helpfulness": 1, "user": "yamanote", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21693808, "likes": {"liked": "— Only about a year old, and the facilities are in excellent conditon", "disliked": "— Occasional lapses in service."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Yes, this is is not just an ordinary 5* hotel, this is a real luxury hotel. When we arrived, we were greeted very friendly by everybody, at check-in I politely asked for an upgrade (we already booked one of the more expensive rooms at the club level) and politely got a Deluxe Suite. The room was very nicely equipped, with nice colours and very stilish. The bed was extremyly comfortable and the bathroom spacious. Also the closet offered enough space for 2 large suitcases on a support.", "title": "Luxury with a little flaw", "user": "Zuerich", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99302204}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The room was also very clean and well mainained, but, the only little disappointement was that actually the bathroom floors were clean, but not sparkling clean, that menas, that there were still some shadows, spots and traces on the floor. Probably it has been cleaned with a mop, but not scrubbed with a brush, what I expect in a luxury hotel. Well, I know, that is very picky, but at this level I expect perfection.", "title": "Outstanding customer service", "user": "RenaeEdward", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98221701}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Speaking of perfection I can write about the club lounge which actually was perfect. Beginning from the setting and the nice décor over to the nice selection of drinks. Especially the cocktails, made to your order were nice. The food was very varied and sophisticated, but served in very small portions. Breakfast had also very exclusive components, the only thing missing was some sort of hot items, the only thing was oatmeal, which is not very exciting, why do they not serve some scrambled egg with bacon? The staff at the lounge was very friendly and did everything possible to serve and entertain the guests.", "title": "Misrepresented truth and didn't care", "user": "stevetanyaTexas", "date": "January 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 94296469}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Fearings restaurant was ok, but there is not enough distance between the tables for a restaurant in its class and also the quality of the food, although being very good, can not keep up with the best restaurants in New York or Los Angeles (or Europe).", "title": "Excellent Customer Service-does not disappoint for a Ritz", "user": "frintern2", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91168712}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "So, if we return to Dallas, of course we will return to the Ritz and we definitely will book a room on the club level.", "title": "Great experience: where to stay in Dallas", "user": "Ben_from_Brooklyn", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89755529}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Stayed 2 nights over Thanksgiving holiday to watch the football game in town. We (group of 6 guys) stayed on the club level. We had two rooms - one regular and one suite that were adjoining. The hotel is brand new and the rooms are amazing. They are very well appointed and they were very spacious - plenty of room for 6 guys. The bed, tv's, bathrooms, bath amenities, etc... were all first rate. The club was very nice as well. Very comfortable with typical (excellent) RC club offerings. Service was excellent as well. Staff was very accomodating and worked professionally, yet in a personal, casual manner. Did not have a chance to explore other areas of the hotel (e.g., pool, restaraunt), but the lobby and check-in very nice and check-in was a breeze. Dropped into the rattlesnake bar for a quick few drinks and it was very nice and people were super friendly. All experiences with staff were first rate RC quality. Location was in the middle of the city (as far as I could tell) and several bars/restaraunts as well as shopping were all within easy walking distance.", "title": "Awesome", "helpfulness": 1, "user": "aristophanesny", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11074547, "likes": {"liked": "— Rooms on the club level were very nice"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I would definitely reccomend this hotel for business or pleasure.", "title": "OK stay", "helpfulness": 2, "user": "peonies18", "date": "November 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 10907771}, {"rating": 5.0, "title": "up to it's reputation", "text": "I visited the hotel with a group of friends for a celebration weekend. Dean Fearing's restuarant was FABULOUS! The food and atmosphere could not have been better. The waitstaff in both the dining room and bar gave excellent service as well.", "helpfulness": 5, "user": "doormark", "date": "November 8, 2007", "id": 10691950}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Wish our hotel experience could have been the same. We checked in to find the room a bit untidy. There was someone else's trash in the trashcans and visible dust on the furniture surfaces.", "title": "Beautiful hotel, excellent service", "helpfulness": 2, "user": "sailorgirlmn", "date": "October 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0}, "id": 10208220, "likes": {"liked": "— new, Ritz Carlton excellence"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I completely agree with previous review that the pool area is lacking big time. Unattractive and pool attendant not helpful. We asked if an umbrella could be moved to give us partial shade and were told no. We did it ourselves. Drink service beyond slow.", "title": "A truly outstanding experience!", "helpfulness": 14, "user": "UncleVictor", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10065545}], "location": {"country": "United States", "city": "Dallas"}, "stars": 5, "variance": {"poor": 9, "average": 17, "very good": 60, "terrible": 6, "excellent": 196}, "aka": "Ritz-Carlton Dallas Hotel Dallas", "slim_ranking": 0.048128342246}