{"user_rating": 4.0, "review_count": 1654, "name": "Ritz-Carlton San Juan Hotel, Spa & Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Well reading the reviews about the Atlantis in the bahamas made me look for a alternative vacation, so I thought why not puerto rico its non-stop from chicago no change of planes no hassles thru customs but I have never been. I read the reviews of the Ritz and said why not well my wife said it was her best vacation yet and we go to Hawaii every year. We spent three nights and all were fun and relaxing, took in the spa and the pool not very crowded, to in the weight room and trainer services, part of resort fee but paid that thru expedia. If you are looking for first class treatment take a few days and go to the Ritz in Puerto Rico you won't regret it.", "title": "Fun and Relaxing", "helpfulness": 5, "user": "texashookum", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5957931, "likes": {"liked": "— upgraded to junior suite", "disliked": "— need more furniture"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "First let me say that this was our 1st time staying at a Ritz property. It was beautiful. There is staff EVERYWHERE, willing to help and open doors, and let you off the elevator first, and get you whatever you need and call you by your name. We came over after staying at Embassy Suites, which was a great great great hotel as well. I believe that the atmosphere here is a bit stuffy, with a lot of roaming business people who tend to make the ambiance pretty tense. When walking into the $22 p/person breakfast buffet (which was pretty good), we were sort of looked down upon. The stares we got by other guests were not at all friendly. Being from New York, it was very easy for us to laugh it off though. But it was still a very uncomfortable feeling for both my boyfriend and I. Anyway, the pool is absolutely breathtaking. Those chairs will put you right to sleep. Fresh citrus water and fruits were always available to keep you cool. The Ritz's private beach is a few steps from the pool and is just as beautiful. Since its a private beach, it is one the best places to relax. Go Kayaking or sailing. It is included with your stay and since you're on vacation, make the most of it. Don't forget to relax on the hammoks too. Although food is expensive, you have to expect it when you stay here. We ate at the hotel only once for the breakfast. We also ate at Denny's 1 day which was just around the corner. Plaza las Americas was a 15min. ride and perfect if it happens to rain. Some of the staff is friendly, while some offer their services with a fake smile...we tried to joke around to relax some of them, but I guess they are just not used to it. All in all, I think I would stay here again but only for an anniversary or special occasion. Despite the weird stares and tense atmosphere, it is a beautiful hotel, and the rooms definintly make you feel like royalty. I agree with 1 review, the water pressure wasn't all that high. But the robe and marble counters and floors made up for it.", "title": "A memorabe experience", "helpfulness": 9, "user": "amazingrace214", "date": "October 14, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5955540, "likes": {"liked": "— The Pool, Beach and Room", "disliked": "— Some staff"}}, {"rating": 5.0, "title": "Ritz Carlton", "text": "My husband and I just got back from an anniversary trip to San Juan where we stayed at the Ritz Carlton. We got a good price on our room through a special we found. Normally we could not afford to stay at a hotel like the Ritz and it was a real treat. I read many reviews before our departure and did not encounter any plane noise or thin walls that the reviews noted. The employees at the Ritz were fantastic and they went out of their way to make sure everything was to our liking. We walked a little ways down the street and found affordable restaurants like Denny's, Metropol, and Mi Casita for all of our meals. The area around the hotel was not that great, but after all, you are not in the continental US. Anyone who has traveled to any of the islands would understand that the way of life if just a little different. We loved Old San Juan, visited El Yunque, and enjoyed our hotel. We hope to go back soon!", "helpfulness": 4, "user": "Bonita2", "date": "October 4, 2006", "id": 5908779}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "We stayed at the Ritz Carlton San Juan from Friday, 9/29 until Monday, 10/2. The service was head and shoulders above any other hotel we have stayed at. The location is very near the airport but that enabled us to enjoy more time there during our short weekend stay. We heard the airplanes but, even though our room faced the airport, they never woke us up or bothered us. The casino was fun and very laid back if you are used to Vegas or Atlantic City -- slow dealers, free drinks and food!", "title": "Now I know what 5-star means!!", "helpfulness": 9, "user": "NJ2Mom", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5907643, "likes": {"liked": "— service, location, food, atmosphere", "disliked": "— water pressure in the shower"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "One MINOR complaint; the water pressure in our room was terrible. Others we traveled with said the same thing. If you want better (but still not great) shower pressure, use the shower in the spa/fitness center.", "title": "Fantastic Trip - Unforgettable Time", "helpfulness": 15, "user": "nonnarosie", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5823667}, {"rating": 5.0, "title": "excellent experience", "text": "We stayed at the ritz for a week in march 05. The hotel is beautiful and the staff could not be more friendly. Every request was honored with pleasure. Pool area is very nice, and the hotel being on the beach is a nice plus. The food/drinks are very pricey, so finding other areas to dine/drink is recommended if you are on a budget. The intercontinental hotel, which we walked to from the ritz (~5-10min walk) houses ruth's chris steak house and momoyama japanese cuisine, both very good. The 101 lounge is a nice little hole in the wall type bar right next to the ritz. Great for grabbing a drink at about 1/8th the price of the ritz, literally. lupis is a mexican/sport bar restaurant about two or so blocks from the ritz, again, good food and great price. They also had a cover band playing when we went and seemed to have good music other nights when we walked by. Walking to these areas we felt safe as there always seemed to be a police presence.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 13, 2005", "id": 3269855}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "So given the overall quality of the Ritz and not feeling discouraged by finding other areas to eat aside from the in-house restaurants, I highly recommend the ritz in san juan as a place to stay. I would not hesitate returning.", "title": "The best place to relax", "helpfulness": 8, "user": "PLUMBO", "date": "March 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3255896}, {"rating": 5.0, "title": "A Ritz is a Ritz...", "text": "Let me start by saying I am a very critical person, but there is nothing to criticize about the Ritz. The beach was fabulous, there was great live music at the pool and the lobby lounge, and the casino was a lot of fun. There was a tic-tac-toe game with a live chicken (a better use of chickens than the cockfighting arena near the hotel) and we beat the chicken! Nobody on the staff or the other guests was snooty. The native Puerto Ricans who were at the casino were extremely friendly, especially when I played the free bingo game with numbers called out in Spanish and incomprehensible English. We barely had a desire to leave the hotel for food or anything else, although we did venture to Old San Juan and the rainforest for nice outings, but being at the hotel was better. If you want to relax and not be bothered by anyone, and have everything handed to you on a silver platter, this is the place!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 28, 2005", "id": 3234430}, {"rating": 5.0, "title": "What's not to like", "text": "We had a great stay as you come to expect from the Ritz Hotels. The service is excellent... recommend the club level with great food throughout the day. The club level will actually save you money with breakfeast, lunch and cocktails provided. The pool is very nice. Small beachfront, but the nicest in the area. The Sushi restaurant and the seafood buffet were excellent. This is not the serene, isolated carribean get away but an excellent retreat for those who want instant access to warm weather with a short connection from the US.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 25, 2005", "id": 3230331}, {"rating": 5.0, "title": "Has it all", "text": "My wife and I and our two children just returned from a stay at the Ritz Carlton in San Juan (February 19-22) and like they say, \"it's the Ritz, what's not to like.\" Actually, on a scale of 1 to 10 I would give it a 9. Although I rate the hotel five stars (excellent) on the rating scale, I did so only because the four star rating is for above average and in my opinion the hotel is closer to excellent than above average. Prior to arriving at the Ritz, we stayed two nights at the Marriott in Condado Beach. Although the Marriott now owns and/operates the Ritz Carlton chain, there is no comparison between the two properties. With that said, we did have an oceanfront room at the Marriott (which allowed us to sleep with the balcony doors open) and were unable to get one at the Ritz. However, that turned out to be a blessing in disguise. With the exception of a few rooms at the Ritz, none of them have balconies and the windows do not open and we were on the so-called garden-view side of the hotel at $550.00/night and the rooms facing the water were even pricier with no real added benefit. Some reviews talked about the hotel's proximity to the airport which is great when arriving and leaving any really had little, if any, effect on our stay. Although you could hear the occasional airplane taking off when at the pool, it was not a negative. Everthing that others are writing about the hotel is pretty accurate. The staff is as friendly as can be, the hotel and grounds are immaculate, the bathrooms and rooms are very nice and meals at the hotel are expensive. We were somewhat disappointed that our room (612) had a large coffee stain in the middle of the carpet and the carpet in general was somewhat dirty but after pointing this out, someone from the hotel quickly came and scrubbed out much of the coffee stain but truth be told, the entire carpet really needed to be cleaned. We had dinner two nights in the lobby restaurant which also allows you to order from the Chinese restaurant in the casino which we could not eat at because the kids are not allowed in the casino. The first dinner was great but the dinner order the second time was completely messed up (after waiting almost an hour to get it) and the hotel insisted on not charging us for the dinner which was nice. My only real complaint is that the pool did not appear to be heated and was very cold. In fact, the only people in the pool were kids and most guests (including the kids) simply used the jacuzzi. Perhaps in the summer a heated pool is unnecessary but not so in February. Other than that, the hotel was great and we would definitely stay there again.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 27, 2005", "id": 3091483}, {"rating": 5.0, "title": "Service with a smile", "text": "Spent a few days at the Ritz (first time at this hotel) 12/7/05 - 12/11/05 with my husband, 2 daughters (11 and 9), and my parents to unwind after 4 days at Disney World. What a treat! Service with a smile - and incredible food, rooms, spa, beach, pool, etc. Just what we were looking for and it was right there at all times. While it is a bit pricey for food, it is well worth the price for the pampering. The staff is extremely accommodating and never harried, always pleasant and extremely professional. A pleasurable time for everyone in our diverse party. We expecially loved seeing the iguanas around the pool area - Ritz iguanas are a breed unto themselves!", "helpfulness": 3, "user": "eranie957", "date": "December 27, 2005", "id": 4301482}, {"rating": 4.0, "title": "Property Ok; Service Amazing", "text": "We stayed for a week in December. Overall execellent. On the downside, they took over an older property and therefore the building is a little worn. My biggest problem with the building is that most rooms have no balcony (the few rooms that do are a FORTUNE). In a place like PR, it's nice to have a balcony to unwind on in the morning or evening and hear the crash of the waves. Without a balcony, you feel a little captive in your room. Also, the rooms on the east side face an apartment building. You should definitely pay the few extra dollars for a pool view. Ask for a high floor as well so that you will also have a view of the ocean.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 25, 2005", "id": 4300220}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "That being said, on the service side, this place in a Ritz all the way. You will not find better service in PR. Every staff member treats you like a king. No questions asked. Nothing you ask for is ever a problem. The beach is beutiful too. The casino is very nice and open all the time. In sum, what this hotel lacks in terms of property it gains (and then some) in service.", "title": "Don't Be Swayed", "helpfulness": 5, "user": "shonuffnyc", "date": "December 14, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4242107}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Overrated. Essentially, this is a Sheraton/Marriott with Ritz prices. While certainly nothing bad, this hotel does not rise to the level of expectation for something called a Ritz Carlton. The rooms are nothing special, and the service is only adequate. Our sheets were not changed in our rooms, turn-down service was basically asking if we needed more towels, and all food service was slow. Again, there's nothing ultimately wrong with that, but I certainly expect more when I pay Ritz prices. Food is fine, but the pool bar uses a machine for the frozen drinks, not a blender. Which works, just not what I expect or necessarily prefer for what I pay.", "title": "The Ritz experience, with a few hiccups", "helpfulness": 6, "user": "murrayhill", "date": "December 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4240980}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "This was our first time staying at a Ritz-Carlton, though we've dined and gawked at others. We headed down for a 48-hour R&R break and decided on a little splurge using the Fine Hotels & Resort Rate offered to American Express Platinum Card holders.", "title": "Lifestyles of the rich and famous!!", "helpfulness": 5, "user": "HWTraveler86", "date": "December 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4163126}, {"rating": 2.0, "title": "safety to an extreme", "text": "I spent a few days at the Ritz Carlton in San Juan last year. I went to visit some friends who have a beautiful home outside of San Juan and brought back a bunch of beautiful flowers from their garden, to put on a vase in my room. A day before my departure, another good friend came over to visit and I asked him to take the flowers with him, so that they would not go to waste. On his way down the elevator, one of the hotel managers made a sarcastic comment complementing the flowers. On his way out by the beach, the pool staff again asked him where he had obtained the flowers from. He explained. When he was about to get into his car, a security guard stopped him and again asked about the flowers. My friend was finally let go, but we were left with a sour taste in our mouths. We support security, but wasn't this a bit ridiculous? Otherwise, the pool is HEAVENLY. The beach just ok.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 14, 2004", "id": 1784488}, {"rating": 4.0, "title": "Very Nice For What It Is: An Urban Resort", "text": "We have just returned from a four-day stay at this hotel. The previous reviews of this and other San Juan hotels left us puzzled, so I thought I'd try to provide the straight scoop. This is a very fine URBAN resort hotel, with a pleasant beach attached as a bonus. There is no question that this is the finest hotel in San Juan, and the staff is well trained and generally eager to provide a lovely experience. As an added bonus, the hotel is a pleasant five-minute walk from the El San Juan, which has fabulous nightlife in its elegant lobby. BUT: This is not the Caribbean resort of your dreams -- it is basically urban. If you need or want to stay in San Juan itself (as we did) this is beyond any dispute the finest choice you could make. (The closest competitors in San Juan, such as the Marriott or the Water Club, are pale imitations of the Ritz and nowhere near as nice.) However, Puerto Rico does offer many other high-end \"beach resorts\" some distance away -- typically, 1-2 hours drive outside of San Juan. If you're looking for a typical luxury Caribbean resort, you may be happier at one of those choices (Horned Dorset, Wyndham in Farjado, etc.). If you have already decided in stay in San Juan itself, howver, the Ritz is absolutely your best choice. BTW, if you're in San Juan, go for dinner at Pikayo -- rated, for good reason, as one of the top 100 restaurants in the world for 2003.", "helpfulness": 12, "user": "VoyageurHeureux", "date": "April 13, 2004", "id": 1782953}, {"rating": 1.0, "title": "Terrible experience", "text": "Terrible experience. In a nutshell, I had a pair of designer sunglasses stolen from my rental car by the Valet attendants. After reporting the problem to several managers, I left without the problem being resolved.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 26, 2004", "id": 1746695}, {"rating": 5.0, "title": "LOVED IT!!!!!!", "text": "It appears that the management of this particular hotel has not been empowered to do whatever it takes to keep a customer. In today's competitive business environment, that is a recipie for failure. The management in this Ritz Carlton could benefit greatly from attending some customer service seminars. Just a thought!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 24, 2004", "id": 1742874}, {"rating": 5.0, "title": "Paradise Found", "text": "This has got to be the BEST Ritz-Carlton hotel I have EVER stayed in!!!! I have read the previous reviews and am completely flabbergasted, by their negativity!!!! The Ritz-Carlton is a dream, and the staff couldn't be more elegant or sophisticated!!!! The food was GREAT, especially at the Carribean Grill!!!! During my stay, they treated me like a queen (they also remebered my name and the fact that I love cheddar cheese soup at night!!!! I am definetly staying here again!!!! I can defineatly see why the Ritz is a leader in the hotel industry!!!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 15, 2004", "id": 1726507}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Just came back from a 1 week stay in Puerto Rico and the Ritz was fabulous! I can clearly say its by far the best hotel on the whole island. The service is excellent, you are treated like royalty from the second you walk in. The spa was great, and the concierge very helpful (they helped make great suggestions, try Aguaviva in Old san juan!) The restaurants at the hotel are wonderful as well. We ate at Prime 787 which was very comaprable if not better than the best steak houses back home with impecibale service (they even wrote us a thank you note!) We also had the famed seafood buffet which was spectacular. Granted, the location is a bit weird, literally right next to the airport, but honestly who cares when the hotel is so nice.", "title": "Ritz is the best hotel in Puerto Rico!", "helpfulness": 4, "user": "LBashir", "date": "July 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5497744, "likes": {"liked": "— Service", "disliked": "— Location (next to airport)"}}, {"rating": 4.0, "title": "Beautiful Hotel & Beach / Weird Location", "text": "If you are going to Puerto Rico, stay here, trust me you can't go wrong with the Ritz.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 13, 2006", "id": 5464996}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We truly enjoyed our 4 night stay at the Ritz Carlton on Carolina beach in San Juan. They were nice enough to upgrade us to a Jr Suite on the 7th floor with overlooking the pool & the beautiful beach. The room was nicely decorated and had a very large bathroom. We inspected our sheets very closely and they didn't have any holes like the other TripAdvisor guests had complained about. The nightly turn down service was a nice touch as well. The pool and beach were both very clean and there were plenty of available chairs in either the sun or the shade. The poolside wait staff was very slow (waited 30 minutes with the flag up and no one stopped) which was also a bit disappointing.", "title": "How is this not a 5 star hotel?", "helpfulness": 8, "user": "mmislove", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5459682}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The Ritz is located adjacent to the San Juan airport which makes for a very inexpensive cab ride when you first arrive. The airport noise outside the front of the hotel is what you would expect when you are roughly an 1/4 of a mile away from the only runway to an International airport. Lets just say that you do not want to have a room that is on the airport side (non-ocean view) of the hotel. The good news was that we couldn't hear anything from our room but I am sure the windows in the room directly across the hall were shaking all day long.", "title": "Amazing Stay at the Ritz!!!", "helpfulness": 3, "user": "prczar", "date": "July 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5440126}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The casinos are full of locals during the evenings and they are especially crowded on the weekends. They offer a brief distraction but definately not worth spending more than 30 minutes or $20 which ever comes first. We chose not to eat at any of the restaurants at the Ritz since we aren't keen on paying $34 for a $7 dollar steak.", "title": "Perfectly Ritzy", "helpfulness": 4, "user": "Bilteach", "date": "July 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5424805}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My boyfriend and I went to San Juan to ring in the New Year. We stayed at the Ritz which is in Isla Verde. I had a good time overall. The service was excellent throughout our stay. We were there from Dec. 30 until January 3. We knew the staff by name by the time we left and they knew us by name. There were a lot of families there with small children which surprised me. However, I didn't see it as a problem and actually enjoyed watching the little ones enjoy themselves in the pool. Isla Verde is not a resort area. We had a 3rd floor room with really no view for about $800/night. The room was very standard but clean. We didn't expect to spend a substantial time in the room anyway. We just wanted to stay in a nice hotel with such amenities. Unlike the other premium hotels on the strip, the Ritz was overall quiet and only frequented by the guests of the hotel. Intercontinental and El San Juan had too much going on for my taste because of all of the attractions in the hotels. Also, the Ritz provided every service that you can possibly imagine. This allowed the guests to retreat in the hotel for the duration of their stay if they liked. The casino was nothing to write home about but if you are a gambler I guess it will be ok. I am not a gambler. The spa services were ridiculously overpriced. I am unsure if the prices quoted to me were holiday prices or everyday prices. I just believe that a manicure and pedicure for $160 is absolutely RIDICULOUS. Although it was extremely pricy for the holidays, I definitely enjoyed the Ritz. If I went back again, I think I would stay in Old San Juan because it is less touristy and feels like you are on an island with rich history and tradition....plus I may be able to find a cheaper yet still enjoyable experience.", "title": "A relaxing experience...", "helpfulness": 5, "user": "Welltraveledone", "date": "January 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4329382}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "The main reason why I didn't like this hotel is the area. Not safe at all. My husband was robbed one block away from the hotel (long story). Down the road (about 6 blocks) in front of a Walgreens, I heard the police yelling at a guy who had just robbed a business and attempted to carjack a lady!", "title": "Area not Safe", "helpfulness": 11, "user": "suelovestravel", "date": "January 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 4324572}, {"rating": 5.0, "title": "Casual Elegance at the Ritz", "text": "The hotel is okay. Definetely not a 5 star. I have stayed at the Ritz in Cancun and Hawaii, and this Ritz does not compare.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4317089}, {"rating": 3.0, "title": "Ritz Kids", "text": "Do not attempt to drive in Puerto Rico unless you are a trained race car driver and are willing to forget your manners.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4314660}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We recently returned from a one week stay at the Ritz Carlton, and the key phrase for this review is \"my pleasure\". We arrived at the hotel on a Thursday afternoon. As we stepped out of the taxi we were warmly greeted and our luggage quickly collected. In the short check-in line, tropical fruit juice and cold hand towels were waiting for us. We stayed in a standard room on the 3rd floor, which was spacious enough for myself, my wife, and our 14-month old daughter. The room had the standard comfortable beds, nice sheets, and quality bath amenities that you could expect from a Ritz, along with newly installed flat-panel TVs. We had a nice view of the gardens and some of the pool area, but had to crane our necks for the ocean view. Our requests for a refrigerator and a crib were met soon after we settled in, with an unsolicited offer from the porter to try and get us an upgraded room. Be aware that the hotel is close to the airport, so it is not a resort in the middle of nowhere, but rather an oasis in the city that might be subject to some runway noise. The beach is ok, with large hammocks and beach chairs available. The pool area is lovely, with plenty of available lounge chairs. The pool attendants were great, laying out towels, moving umbrellas and setting up the playpens/portable cribs that are available. One thing that surprised us was the number of people that went to the pool desk, got towels and avoided the attendants. Another surprise was the number of kids under 5 that were there over the weekend. We thought we'd be one of the only ones, but for those first few days, the pool area was full, with a good number of small kids. Throughout Sunday evening and Monday morning, many of the weekenders with kids packed up, and the hotel transitioned to a decidely more business, less leisure guest mix. This left the pool area more sparsly poulated and quiet for the remainder of our trip. Throughout our stay, the hotel was 95% full, but you could never tell. We found that the hotel did not nickel and dime on the whole, although there were some exceptions. For example, the hotel provided free bottled water in the rooms, with extra bottles available on request. Some items at the pool like soft drinks and fries were actually reasonable for a luxury hotel. On the other hand, the $6 ice cream bar was a bit excessive. Breakfast was $23, expensive if you are eating at home, but what you might expect at a quality hotel with a fairly comprehensive buffet. You can also order specific entrees like 2 eggs, toast and hash browns for $10, but order anything additional (juice, cereal, etc.) and it starts to make sense to pay for the buffet and have all the variety. The concierge was helpful in arranging babysitting, dinner reservations, and providing general travel information. What really made our trip was the responsive service level provided by the entire staff. We were always greeted with a warm hello or good morning. Virtually no request was refused, and service was delivered promptly and always with a smile and \"my pleasure\". To put it simply, much of the staff knew our daughter by name, and seemed to genuinely enjoy playing with her, and seeing to our needs. Overall, I would say this ranks among the top hotels I have stayed in. If you are looking for a more isolated location, or a self-enclosed megaresort this is not the place for you. If you are looking for a low-key luxury experience, then this is your place.", "title": "Not worth the money !!", "helpfulness": 8, "user": "jLawrencem", "date": "December 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 4306086}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The grounds and the room were in very good condition. A freindly staff greeted us upon arrival, and checkin went very smooth.", "title": "Nice Place, But horrible Service", "helpfulness": 1, "user": "jeffreycowart", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 21433996, "likes": {"liked": "— Nice beach and pool area", "disliked": "— Poor Service, No pampering, which you should get at a Ritz Carlton"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Our only real complaint was the overall service. We really expected to get great service and be pampered. That is not what we got. Absolute minimum time to get anything is 30 minutes. When we got there, we went out by the pool and ordered 2 bottled local beers. They are $8 each, and it took 30 minutes to get them. We were 25 feet from the bar, so needless to say the next round we went directly to the bar. Then we tried to order a sandwich from the bar, 45 minutes later our cold sandwich arrived.", "title": "Fast get away weekend excellent!!!!!!!!!!!!!!!", "helpfulness": 1, "user": "blackie162", "date": "October 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21397383}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The next morning at breakfast the trend condinued. I went and ate down the street where the prices were reasonable, but my mother opted to eat a $25 fruit plate. It took 45 minutes, and we had to ask twice where it was, just for a fruit plate.", "title": "Typical Ritz", "helpfulness": 2, "user": "ERM10", "date": "October 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 21396694}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The beach in front of the hotel is in good condition, and they provide chairs, umbrellas, and towels for you to use free of charge. The pool area is also very nice, again towels and lounge chairs are available.", "title": "Great Experience", "user": "boricuajetsetter", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21095686, "likes": {"liked": "— The pool and beach area", "disliked": "— Not close to my favorite part of San Juan-The Old San Juan"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The hotel is very close to the airport, so be prepared to listen to them all day long take off. Didnt seem to be an issue at night, luckily we could not hear them in our rooms.", "title": "Best hotel in Puerto Rico", "user": "BoriTraveler", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20929353, "likes": {"liked": "— Everything", "disliked": "— No complains, excellent in all aspects."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This hotel while being a Ritz Carlton did not meet my expectations. What sets a great hotel apart from a good hotel are the things that you do not see but come up and surprise you. Maybe its the economy but all the \"extras\" you expect from A Ritz or Four Seasons were not there. The staff is very friendly and will help with any situation but the overall feel was not great. As this was our first stay, I asked many people who have been going there for many years, and almost all said what I felt and many said that they would not return. The rooms are fine (that is after we were moved from our room as there was mold under the windows and on the carpet.....gross). Internet is VERY spotty. What amazed us was that we were told that the hotel was full yet not all the restaurants were open. Be sure to book them ahead of time and stay far away from \"Mare\" the seafood restaurant. Prices were very inflated as it is a Ritz, but come on 18 for a pool side hot dog and 22 for a pool side ceasar salad with chicken? The magic question is would I return..........the answer is NO.", "title": "Not up to standards of a Ritz", "helpfulness": 2, "user": "addostone", "date": "January 2, 2009", "detail_rating": {"front_desk": 1.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 23179187, "likes": {"liked": "— Pool area and the view", "disliked": "— Mold"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed in the Ritz-Carlton for 5 nights during a recent vacation; the service was excellent (if somewhat spotty), but the overall experience was less than what we expected from a Ritz.", "title": "Not what we expected from a Ritz-Carlton", "helpfulness": 2, "user": "ajones24", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 23061393}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We are frequent travelers and during the past 5 years we have taken 10 extended vacations and never had occasion to complain about anything; we're not easily ruffled, and it takes a lot to make me call guest services--something we had to do several times during our stay. Here are the things we had to complain about:", "title": "Very Dated - Very Expensive - Not 5 star!", "helpfulness": 2, "user": "Diane R", "date": "December 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 23050808, "likes": {"disliked": "— Badly in need of refurbishment - over priced - not 5 star - poor Ritz Carlton property, very very busy hotel!"}}, {"rating": 3.0, "title": "If I had the choice again . . .", "text": "1) When we took a blanket out of the closet to put it on the bed, it was wadded in a ball and had a huge piece of dried cheese stuck right on top. Disgusting. Housekeeping brought a new blanket immediately and it was warm and fresh.", "helpfulness": 2, "user": "Visitors4", "date": "December 13, 2008", "id": 22696013}, {"rating": 3.0, "stay_parameters": "Stayed November 2008", "text": "2) We had a standard room which could be used as an adjoining room. On the third day, someone checked in to the adjoining room and we could hear everything they said, even though they were speaking in normal voices. I could hear the man whistling \"Little Drummer Boy\" - that's not right. We were woken up at 1:30 AM when the couple returned from a night out; they received 4 phone calls within 20 minutes and we heard every word of every call. That should not happen at a Ritz. To the credit of the Ritz staff, we called guest services at 2:00 AM and asked for a non-adjoining room, which they quickly located for us and we were moved within 15 minutes. Excellent service.", "title": "Lovely Hotel....Spotty Service", "helpfulness": 1, "user": "TravelNut70", "date": "December 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 22421025, "likes": {"liked": "— Lovely grounds and room", "disliked": "— Some service issues"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "My trip to the Ritz Carlton, San Juan was amazing. The Ritz is a wonderful hotel that met all of our expectations for a quiet, luxurious long weekend.", "title": "Putting on the Ritz", "user": "FinickyNYC", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14552315}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The service and ambiance was superb. I was taken aback when entering the hotel the bell man immediately knew our name.", "title": "Ritz Carlton Easter 2008", "helpfulness": 1, "user": "mynystateofmind", "date": "March 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14527907, "likes": {"liked": "— Service/Rooms/Beach and il Mulino", "disliked": "— Food/Buffet at Mare's Restaurant at the Ritz"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The rooms were clean, welcoming and comforting.", "title": "Ritz best place in P.R. by far", "helpfulness": 4, "user": "ssmall34", "date": "March 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14428494}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed on the Club level and were impressed with the plethora of gorgeous food and beverage presentations. I never knew what a great value the club level is, I will be sure to book Club for all remaining Ritz Carlton stays.", "title": "Great Time at the Ritz", "helpfulness": 1, "user": "dvar", "date": "March 20, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14409666, "likes": {"liked": "— service"}}, {"rating": 1.0, "title": "A Hassle a Day Pontiac Vacation for a Cadillac Price", "text": "On our last night, I was fortunate enough to have a lucky hand at the Casino.", "helpfulness": 1, "user": "NJBusAtty", "date": "March 19, 2008", "id": 14399890}, {"rating": 5.0, "title": "Great restaurants!!! Caribbean Grill and Vineyard were great!!!", "text": "I've read all the reviews that said that most of the staff at this hotel couldn't speak good english, and all I have to say to that is that it was all bull! It was my wife's and I anniversary, and we decided to eat at the Vineyard, there we were greeted by a beautiful tall, blonde Puertorican woman named Lizzie (by the way she looked like she was from France, not Puerto Rico and spoke PERFECT english). My wife then wanted to know where the Casino was and Lizzie very kindly, left her stand and escorted my wife all the way to the casino. To top that off, after we left, we were curious about all the other restaurants on the property, we asked the hostess and not only did she show us the menu of each, but she also showed us to them!!! The next day, we saw her at the Caribbean Grill (she seems to be an all around girl). She welcomed us by name, asked us how we spent out anniversary and sat us in a great table. Then we were greeted by an excellent waiter named Christopher who also spoke perfect english and got us our order promptly and efficiently. The only complaint I have is with housekeeping, who are a bit slow and they REALLY need to work on their english, and room service, which are a little slow (but the food was still very good). I had a little trouble with the check in, but the agent (another beautiful blonde) was very polite and courteous and excused herself for the inconvenience. I have stayed in the water club, and there all the women are beautiful and know it and they treat you like it is your priviledge to speak to them. Their english is terrible and the service is slow. All I can say for the Ritz-Carlton san Juan is that they have an excellent staff, eager to please, a great property, and most of all, GREAT service. I will definetly return for my next anniversary (mw wife would not have it any other way!)", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 25, 2004", "id": 2116682}, {"rating": 5.0, "title": "Loved the Ritz Carlton--would definitely return.", "text": "My husband and I went to San Juan for our anniversary and stayed at the Ritz Carlton. I must say without a doubt that it was one of the better hotels we have ever stayed. The restaurants were great, the pool area was outstanding (all of the pool chairs, floats, etc. appeared to be new) and above all, the staff was FANTASTIC. We would definitely stay there again. In fact, my sister and I are planning a week stay in San Juan in June and will stay at the Ritz Carlton.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 28, 2004", "id": 1847626}, {"rating": 5.0, "title": "Diverse Guests, Wonderful Hotel and Staff", "text": "Like many others, I was perplexed by the contradictory reviews offered for this hotel... until I went. The Ritz San Juan is a beautiful property with wonderfully pleasant staff, particularly the club level staff. We had a very nice stay and would return in a heartbeat. The guests were as varied as the reviews before you. Many were very pleasant, but many were quite demanding and obnoxious toward the staff. A lesson to take with you wherever you may go- treat others as you would like to be treated and it will pay great dividends. Don't let the poor reviews keep you from this wonderful hotel.", "user": "Tim-Sue81", "date": "April 25, 2004", "id": 1835815}, {"rating": 5.0, "title": "Love The Ritz", "text": "We stayed at this hotel for a few days before a cruise.Hotel is very nice,clean.Pool beautiful beach nice,Ritz supplies beach chairs umbrellas & some water activities boogie boards,kyak,water bikes.you can also catch jetskis & bannana boats here.If you want to stay in town or nearby old san juan this is perfect spot.if you are looking for a quiet resort i don't thnk this would be it,this hotel close to airport,which isn't a problem but for a long stay could be. Snacks in lounge excellent,so are restaurants, skip friday nite seafood buffet not worth it.All in all would recommend & stay again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 20, 2004", "id": 1793919}, {"rating": 5.0, "title": "Great Easter Week", "text": "After reading some of the recent reviews we were very concerned about staying at the San Juan Ritz, during Easter week.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 16, 2004", "id": 1788248}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We just returned from a week at The Ritz Carlton in San Juan. Let me tell you what a beautifully maintained property it is. We were amazed at how clean everything is and how many people are working constantly around you!!!", "title": "Perfection!!", "helpfulness": 7, "user": "bobnmolly", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5628651, "likes": {"liked": "— The beautiul surroundings and the impeccable service", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We took our two children, aged 6 and 9. They loved the Ritz Kids Club. It is pricey, but they went two afternoons and one evening. They went to the pool, went to the beach, played games, did arts and crafts... They loved the staff and had to be pulled away each time.", "title": "KIngdom by the Sea?", "helpfulness": 6, "user": "stone2", "date": "August 16, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 5618403, "likes": {"liked": "— comfort", "disliked": "— local"}}, {"rating": 5.0, "title": "Totally enjoyable", "text": "We had a pool view room on the club level. What an amazing view. We were upgraded from city view (which is actually airport view) I called the hotel three days before check in and had a nice friendly conversation with a front desk clerk and requested it. Upon arrival, they told us that we would receive the upgrade, but that the room would not be ready as they could not evict the previous occupants!!! They were very gracious and gave us an interim room on the club level and paid for our lunch at the poolside restaurant. When our room was ready, they called us and gave us our keys and we were set. Great service!!!!", "helpfulness": 5, "user": "Margaret100", "date": "August 14, 2006", "id": 5609208}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The room had luxurious bath towels, and Bulgari shampoos and a soft bathrobe.", "title": "The Ritz was fabulous, especially....", "helpfulness": 6, "user": "flojos", "date": "August 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5578023, "likes": {"liked": "— suite", "disliked": "— casino"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "The club level was well worth it. We ate breakfast and lunch there everyday. We only ate dinner out and saved tons of money!!! The breakfasts had juices, fresh fruit, danishes, toast, bagels, hard boiled eggs, meats and cereals. Plenty!!!! The lunches were soups, salads and different sandwhiches. They had huge freshly baked cookies that we ate daily! After dinner we would go to the club for coffee and desert. The club staff looked after us so well and went out of their way to help us with everything.", "title": "Wonderful stay, clean beach", "helpfulness": 4, "user": "littlemama_n_va", "date": "August 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5559100, "likes": {"liked": "— the beach and the staff", "disliked": "— somewhat snooty tourists"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We just returned from this wonderful hotel/resort. We were amazed when we checked in a walked into our 10 floor ocean view room. The view and the room were great! The beach service - chair set up, etc was terrific. While I will agree that the drinks are a little pricey, part of the fun is sitting on the beach and having it delivered to you.", "title": "Terrific Hotel", "helpfulness": 4, "user": "Traveler109", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5535419, "likes": {"liked": "— The view", "disliked": "— The bathroom"}}, {"rating": 5.0, "title": "Short Stay", "text": "We did enjoy heading to the El San Juan for evening entertainment, as the Ritz was a little more subdued - however it was great to return to the quiet after a LOUD evening of live music someplace else!", "helpfulness": 3, "user": "maggie41", "date": "July 29, 2006", "id": 5526168}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "I would highly recommend staying at the Ritz.", "title": "Great Hotel", "helpfulness": 4, "user": "hilsanti", "date": "July 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5522633}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "My husband & myself went to the RC around thanksgiving, we had a great time, and the hotel was beautiful, clean and just amazing. The staff was friendly and very helpful. The restaurant food was excellent and the staff in the restaurants was above average. The hotel lobby was decorated for the holidays, which was absoltuty gorgeous. We truly enjoyed our short visit and will be looking forward to a return trip.", "title": "gold standard", "helpfulness": 5, "user": "jhh", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5506745, "likes": {"liked": "— service and organization", "disliked": "— airport noise, some windows sealed"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I stayed for two nights at The Ritz Hotel and in my book its a five star hotel. I reside in Puerto Rico and stayed in various hotels in the island as well as in the states and this hotel tops them all.", "title": "The Ritz was Great !!!", "helpfulness": 8, "user": "Chrismigs65", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 5501053, "likes": {"liked": "— The staff", "disliked": "— Too close to the airport, too far from San Juan"}}, {"rating": 3.0, "title": "mixed", "text": "We just returned from a week's stay beginning 4/16. We are frequent Ritz Carlton vacationers so I do have a good basis for comparison. Some of my disappointments could have been avoided by doing a better job of assessing the whole san juan situation. THe Ritz sits on the ocean and you can look out certain windows of the property and see the landing strip of the airport. We never heard planes while inside our room but did hear them outside by the pool area. The sound varied depending upon the traffic route. I think I was expecting Isla Verde to be a little bit more like Cancun- I knew it would have more of an urgan 'strip' hotel feel but was really disappointed by the neighborhood the Ritz is in. Tons of litter in areas outside the Ritz, sidewalks not easily navigatable. We walked to the El SAn Juan and my 9 year old had to literally step over a drunk guy whose feet were sticking out of an alley. (and this was 10 am) I will never return to SAn Juan, although it is convenient in terms of travel and timing.", "helpfulness": 6, "user": "lcookster", "date": "April 25, 2005", "id": 3403296}, {"rating": 2.0, "title": "This property should not carry the ritz name", "text": "The beach is not stellar. It is not a 'walkable' beach and the sand is brown and the water not clear. Just not a pretty beach. This does not compare with other beaches we have been to. The pool area was okay, but actually not as impressive as others. There were always seats to be had, although the seats themselves are packed pretty tightly together and in rows. I thought the water temperature in the pool was fine.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3399465}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "We had booked an Executive suite at $975 a night. Our view was really high rise (and often) run down apartment buildings or other resorts. The bedroom area was beautiful but the living room area was not as attractive. Only in picture and the rest bare walls. A low level cabiner holding a TV, so that the top of the TV was no higher than the top of the coffee table. Why didn't they just use the taller units that are found in the bedrooms. The sofa can convert to a sofa bed, but was not comfortable at all if using as an actual sofa. We asked to be switched and booked 2 adjoining oceanview rooms for a bit more money. The front desk staff handled this very well. However, when we checked out they had continued to charge us $975 plus $489 for the second room. The King bedded room should have been $600. This took a while to manually rectify at checkout. Our cleaning and turn down service was fabulous. We also tip every day and I think that makes a big difference. So I had no issues at all with the housekeeping staff.", "title": "Perfect relaxation", "helpfulness": 7, "user": "mhpw", "date": "April 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3396218}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "I am really picky about restaurants- the food at Prime 787 was wonderful and the service was really some of the best I have had. It is expensive but really made our stay. We ended up eating there 4 or 5 nights. The service at the outside pool/beach bar was not good. The bartenders were not that helpful or friendly. Often we would be there for opening at 10:30 am to get sodas etc and they would tell us they needed to find ice, couldn't open for another 20 minutes. Others said they got great service by attendants pool-side but we didn't see much of that during our stay. Again, I am comparing this to other Ritz properties. The sushi was pretty good but the Chinese food was really terrible. Outside bathrooms by the pool were dirty and not maintained throughout the day. The Spa was fabulous. The only downside is there is no inside route to the spa, you have to leave the hotel and walk outside. Over 7 days of huge rain this became a bit annoying, but the service was outstanding. Great workout room and hourly exercise classes etc..", "title": "Enjoyed our stay here and the staff was excellent", "helpfulness": 6, "user": "Grohe", "date": "April 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3390311}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Our son is 9 years old and although the Ritz Kids club is supposed to be for 5-12, the activities were not age appropriate. The staff is delightful however. So I think if your kids are younger they would love it. Our son didn't want to go after the first morning. When he went there was one first grader and two 3rd graders and when I arrived they were making paper native american head dresses. My son thought that was a little 'baby-ish.' But I want to reiterate, the staff there was wonderful. The casino was fun but people weren't tripping over themselves to provide food or drinks.", "title": "Cleanliness and Maintainence Issues here", "helpfulness": 9, "user": "Canterbury417", "date": "April 6, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 3339935}, {"rating": 5.0, "title": "Fabulous time at The Ritz!", "text": "Just returned back from 2 nights at The Ritz and looking back at the negative reviews, I'm glad I was not disuaded by some of them and decided to stay at the best hotel on the island!", "user": "Sunshine118", "date": "March 18, 2008", "id": 14376392}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The service was outstanding, the grounds were magnificent and the staff went above and beyond to make our stay wonderful.", "title": "Good Hotel for $700 Per NIght", "user": "EHB", "date": "March 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 14350131}, {"rating": 2.0, "title": "Before you stay here, think twice if you think you get what you pay for!!!!", "text": "We had an ocean view which was gorgeous! The room was pristine in every way! The sheets were so soft and the bed was unbelievably comfortable. Neither my husband or I heard any noise at all from the airport (and we're both light sleepers!)", "helpfulness": 2, "user": "renz13", "date": "March 17, 2008", "id": 14339609}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "It was luxury beginning to end.. We ate breakfast/brunch in Los Mares both mornings and loved the food and the service.", "title": "Not great but OK", "helpfulness": 1, "user": "trvlplanetv", "date": "March 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "business": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14100994}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Also, the spa was beautiful and I was lucky enough to attend one of the Salsa classes with the instructor, Marisol and she was terrific! Really enjoyable. I would highly recommend a stay at The Ritz. You won't regret it!", "title": "Nice Hotel, but pricey", "helpfulness": 1, "user": "janesk", "date": "March 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 2.0}, "id": 14093214, "likes": {"liked": "— Service", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We absolutely loved our stay at this classic hotel. We stayed one night before our cruise, and were upgraded to an executive suite on the club level. The club level lounge is a GREAT perk, I would recommend it.", "title": "a great experience!", "helpfulness": 5, "user": "BernieMaggie", "date": "November 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4152237}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "The staff never said \"no\" to us, they were amazingly accommodating. We asked for late check out at 2 PM, so that we could enjoy the pool, and relax, the response was \"no problem.\"", "title": "The Best!!", "helpfulness": 3, "user": "kt02363367", "date": "November 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4122081}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "We walked the beach the afternoon we arrived, which we enjoyed. The day of departure we enjoyed the pool area, which is beautiful. I had run along the coastline, leaving the hotel after taking a left, and passing the airport. A nice option for those runners visiting the hotel. This was recommended to me by the attendant in the gym. She said that it would be fine by day, although not recommended after sunset.", "title": "Beautiful Resort Life!", "helpfulness": 5, "user": "townlaw", "date": "November 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4119750}, {"rating": 5.0, "title": "Fabulous!!!!!", "text": "Although the hotel is older, it is superbly maintained.", "helpfulness": 5, "user": "ladybugrina", "date": "November 7, 2005", "id": 4091897}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The hotel is not inexpensive, but this is a case of \"you get what you pay for.\"", "title": "Outstanding!!!", "helpfulness": 17, "user": "babyhansm", "date": "October 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4044058}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We stayed at the Ritz for one night precruise. From the check in to check out everything was great. The hotel bar had comfortable seating (couches & chairs), a welcoming atmosphere, warm lighting and entertainment, not to mention the mojito's & plantain chips were wonderful.The pool & beach were very clean and accomodating. The service on the beach was excellent, as soon as you come through the glass doors and down the steps the beach the guys that set up your chairs are there to help & very tolerable. They are there for whatever you need. The only downfall is the beach has rocks that you don't see until you trip on them. My foot went completely into a hole in one & cut my heel, my husband tripped over another. The casino is clean but didn't spend much time there.The Blvgari soap & shampoo are awesome. Check out is a breeze, on the TV in the room, so easy.", "title": "Can't wait to stay again", "user": "chicagoblonde", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22152561, "likes": {"liked": "— The pool & beach", "disliked": "— N/A"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008", "text": "For a business traveler, this hotel has some things to offer, namely: nice beds and bathrooms, proximity to the airport, decent in-house restaurants, an air of quasi-luxury, and a passable bar/lounge. With that in mind, memo to hotel execs: two things any business hotel absolutely must have are (1) easy access to Starbucks --FAIL-- and (2) wireless internet in every room --FAIL. These are not hard to accomplish, and something pretty much every Hampton Inn has managed by now. So even as a business hotel, it misses the mark.", "title": "Good for business travel; worthless as a resort", "helpfulness": 1, "user": "greeper", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 22146727, "likes": {"liked": "— nice, clean, had a goodlooking crowd", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "As a resort, I would love to have been in on the meeting which informed the planning and decisions behind this property. It's as though they decided to have a resort and left all the planning to someone who had never been on vacation.", "title": "There Are Worse Ways to Spend a Tropical Vacation . . .", "helpfulness": 5, "user": "HoratiusCocles", "date": "November 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 22103845, "likes": {"liked": "— The visual presentation, in the lobby and from the room", "disliked": "— I'll never know the full price of the room, but I suspect it was enormous"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "First --why on earth would you situate a resort on the most inhospitably windy point on the entire island. The wind is insufferable, strong, constant, and nagging. It blows the dirt-like sand everywhere, and every chaise is coated to the point where they don't appear blue, but brown. You can't hear the person next to you, it's so loud. I'm surprised more reviews don't mention this. It is very, very inhospitable, the windiness (the staff told me the wind was typical). Another point about location -- remote from everything. $50 bucks round trip to Old San Juan.", "title": "Travel Professional Gives the Ritz San Juan a Thumbs Down", "user": "marybrenta", "date": "November 23, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 22102242, "likes": {"liked": "— Pool", "disliked": "— Bed"}}, {"rating": 5.0, "title": "My \"Go To\" Hotel in San Juan", "text": "If you are going to have a windy beach and pool area, for god's sake, heat the pool. I'm here on a weekend that is jam-packed, and have seen 9-10 people use the frigid pool the entire time. It is FREEZING, and when you get out, the wind is chilling. It doesn't help that the pool is beneath a forest of palm trees that effectively blocks the sun almost entirely. The hot tub has the usual resort problems. It's not hot. It's filled with infants and screaming children. Why bother, really?", "user": "A TripAdvisor user", "date": "November 21, 2008", "id": 22066793}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We have been going to the Ritz since it opened 12 years ago. Yes it always takes some time at check-in before your room is ready; we bring a carry on with a change of clothes and use the spa to change clothes. This is the best resort in San Juan, others do not come close. We tried a few and were disappointed. We always stay on the club floor and it feels like home when we arrive. The club staff is always there to take care of your needs. We have breakfast and lunch on the club and usually grab a cocktail before heading out for dinner. Many people eat all meals and desserts on the club as well. We ate at IL Mulino twice this year and the service and quality of food is fantastic. We had Valentine’s dinner there and it was awesome. Ruth’s Chris steakhouse is nearby at the intercontinental and Morton’s is a short taxi ride at the Hilton. There are many excellent restaurants in Old San Juan as well. We usually spend one afternoon shopping (Coach, Polo, Guess, Burberry and many more). I would rather use the beach instead and just relax. San Juan has a feeling of being in a city with a tropical feel; you have to know this before going. Many people are disappointed about all the buildings, the airport etc. We like looking at the planes taking off while you are swimming in the ocean, others complain about the noise. The resort has a city feel as well, many of the rooms do not have balconies. The rooms are very clean (never had a bad experience) and the cleaning staff is great. Call them when you check-in a let them know what time you want your room cleaned and turned down, they will accommodate all requests. Keep an open mind as well, many guests think that just because they are staying at a Ritz Carlton that they should be treated like royalty. Be prepared to spend money, nothing good is cheap. If paying $20 for a burger is not your thing, then don’t come here!", "title": "Another great time in San Juan!", "helpfulness": 1, "user": "PTM1962", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57654367}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My recommendations: If you can stay on the Club level (Worth it!) and take advantage of all it has to offer, it will save your money in the long run. Tip the Club staff; they go beyond the normal level of service. Have dinner at Il Mulino. The quality and service are great. The Ritz does make you feel special and that is what vacations are all about. Enjoy!", "title": "92 Dollar per day Resort Fee From Hell", "user": "tabarber99", "date": "March 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 57524427}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "This is your basic Ritz, a nice hotel, service is spotty. We only had three nights away from our kids and paid top dollar for ocean front club level -- 659 dollars a night. Check in was bumpy -- at 2:45 pm we waited in line downstairs for fifteen minutes then were whisked up to club level where we waited another twenty minutes to be told by a rather surly woman that our room was not ready and \"we have till four come back at four\" It went on and an until I requested the front desk manager who found us a room immediately. Rest of stay was uneventful, until we got our bill and discovered we were being charged $92.26 PER DAY for a \"resort fee\". The room tax was only 89 dollars a day. I have stayed in Ritz hotels all over the world and sometimes they charge you 25 bucks a day for a \"resort fee\" but $92.26? Apparently they add fifteen percent to your bill to tip the bellman and pool guys (who we tip anyway). The front desk manager on duty did not return our call. My husband had to go down and fight with them for an hour to resolve the issue. It was a nightmare. Not a good way to end a romantic trip. I am in the process of writing to the corporate headquarters and the hotel GM to express my indignation. As a result of this experience I will probably not ever stay in another Ritz again --- there are other choices in the high end luxury market that do not try to tack exorbitant fees onto the bills of loyal guests who are already paying top dollar. BE WARNED BEFORE YOU BOOK!!", "title": "Great Girls Trip", "user": "kannm", "date": "February 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57150639}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed at the Ritz Carlton SJ on long girls weekend in March of 2008 and dropped by again in June of 2008 with family on a layover to St. Thomas.", "title": "Over priced, under achieving........save your money.", "user": "goooooocats", "date": "February 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 56945915}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "To begin with, we had a fairly big snafu on the part of management, but it was dealt with with such grace and generosity that it has become the standard of what I expect when a mistake is made on the part of a hotel. What could have ruined a nice weekend, was totally saved by the actions and honest apology of the hotel manager.", "title": "Great relaxing get away", "user": "JamieCleveland", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 56939993}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "My stay at this hotel occured Jan. 12-17, 2010. I was impressed with the bell service, prompt elevators, and quality of the food. Anything positive during my stay is heavily over-shadowed by being severely attacked by bed bugs on the 7th floor. Never did I expect for this to happen at a Ritz property. After the first night, I noticed three bites in a line on my left foot and one on my back. I ultimately ended up with over 100 bites on my feet, legs, arms, shoulders, neck, and my face!!", "title": "Bed bugs at the Ritz in San Juan", "helpfulness": 6, "user": "TravelsfromKY", "date": "February 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 54950742}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "I had no choice but to visit my dermatologist once I returned home, who told me he'd never seen anything this bad. He prescribed me oral steroids, topical steroids, and anti-itch medication. It was at this point that he told me I, due to the biting pattern of my spots I've definitely been exposed to bed bugs.", "title": "Great staff, mediocre hotel", "user": "VWFreak", "date": "January 25, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 54323049}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Two other people within my company who stayed on the same floor also had bites in the same pattern. The hotel will tell you it's sand fleas, but we never spent time at the beach due to the storms everyday.", "title": "Amazing Hotel, Staff, and Good Times", "helpfulness": 1, "user": "Blondechel", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54196984}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I'm mortified by this experience! Although bed bugs have nothing to do with hygeine, the social stigma surrounding it does! Please do not stay here! No matter where you stay, always check the room thoroughly. You never want to deal with this.", "title": "What a Disappointment", "user": "Cam31", "date": "January 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 53972995}, {"rating": 2.0, "title": "Clueless and lazy staff. Horrible surrounding neighborhood. All for an exorbitant price.", "text": "The service from the staff here is excellent and so is food at BLT Steak. Other than that, the rest of the hotel is nice, but not at the level you'd expect from a Ritz.", "helpfulness": 2, "user": "judy017", "date": "January 12, 2010", "id": 53291793}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The Ritz is a wonderful island hotel. It is elegant, yet unpretentious. Impeccably clean, with comfortable rooms and superb bedding. I've never stayed at such a clean hotel in the Caribbean. The bathrooms are huge, with nice marble. Our \"courtyard/pool\" view was really just the tops of palm trees and blue skies above.", "title": "Casually Elegant, Super-Clean, But Expensive", "helpfulness": 1, "user": "sraema", "date": "November 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 21845765, "likes": {"liked": "— Location, Cleanliness, Service", "disliked": "— Food/Drink Prices"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The pool is very nice, laid-back vibe, moderate size. Wonderfully comfortable chairs and plenty of servers. Obviously this is not a huge Sandals-style pool scene. The beach was very nice. If you want many shades of blue in your ocean, you will be disappointed. This is middle-of-the-road as far as Caribbean ocean colors. The added 'resort fee' pays for chairs/umbrellas/kayaks/floats/sail boat.....", "title": "Great long weekend!", "helpfulness": 1, "user": "EdinATL", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21680641}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Airport only a 5 minute cab ride, $10.50. Yes, you hear planes when outside. No, it didn't bother me one bit. It only seemed to occur once or twice an hour. But it was not overpowering nor intrusive. You hear the plane start to rev up, so it is not shocking or sudden. The positives outweigh that negative as you are on the beach so soon after landing. Likewise, we hopped a cab back to airport less than 2 hours before our return flight. We got as much out of our last day as we could, and thus huge pluses. If you take the 1:30 to 2:30pm non-stops back to the states, you will still get a few hours of sun before you leave.", "title": "Fantastic Stay at the Ritz!", "helpfulness": 1, "user": "wheretonext77", "date": "November 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 21626879, "likes": {"liked": "— Staff and the Resort (resort grounds as well).", "disliked": "— Long wait for poolside lunch."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008", "text": "Food/Drink Prices: Expensive. But if I compare to other resorts and not the States, it is closer to that reality. Mojitos $14, angus burger $18. The kicker was a fried grouper sandwich at lunch was $38 . Ouch! I'd expect to pay approx $40-50 for a steak when on an island, but a 6 to 8 ounce grouper fillet on a bun was murder. Otherwise, yes it is expensive, but so is the El San Juan and the Intercontinental and the.....", "title": "Substandard, overpriced", "helpfulness": 1, "user": "DanaZ", "date": "November 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 21531321}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "A great plus is the proximity to the El San Juan Hotel. We walked on the street and it took less than 10 minutes. That is THE place to be on a Thursday Friday or Saturday. Color and sounds and energy. We intended to hit the nightclub, but the expansive lobby was so great that we did not feel the need. Latin bands, DJ, 3 bars, ultimate people watching. Amazing! On the walk between the hotels we hit a nice Mexican place and a nice PR restaurant Platos (concierge recommended). Dinner at Platos with 2 rounds was less than $100, reasonable compared to Ritz restaurants.", "title": "Excellent Hotel in San Juan", "helpfulness": 1, "user": "KKenia", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21506239, "likes": {"liked": "— Cleanliness, Timely Service with a smile, location, beach.", "disliked": "— I don't have any complaints. I am a very difficult person to please, so this should tell you how good the Ritz is"}}, {"rating": 1.0, "title": "Organization", "text": "I have been a member of the casino for more than three years,the first time that I have been invited", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 20, 2005", "id": 4040840}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "for a birthday activity,was this year. For my surprise", "title": "one word to describe = UNBELIEVABLE", "helpfulness": 8, "user": "tekcomp", "date": "October 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4031232}, {"rating": 5.0, "title": "Superb Service- Overall a Great Weekend.", "text": "I call three days before to reserve and already it was", "helpfulness": 12, "user": "A TripAdvisor user", "date": "September 26, 2005", "id": 3940022}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "full", "title": "Excellent Service from top to bottom", "helpfulness": 3, "user": "jmc318", "date": "September 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3933212}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "ARIEL RODRIGUEZ CENTENO", "title": "What a difference compared to other years!", "helpfulness": 6, "user": "MarcoMilanez", "date": "September 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3927028}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "We (group of couples) have been going down to the RC at San Juan and consistently find it outstanding. The rooms were big and clean and feature flat screen tvs and all the amenities you would need. Bathrooms are big. Housekeeping was very good. The grounds are very well taken care of. Beautiful resort. Pool is very nice and large (Never seen it crowded) and the beach is also very nice. One really nice thing about this hotel is it is very \"cozy\". Everything is very close, the pool, the beach, the gym, etc and yet it does not feel cramped at all. The gym / spa are excellent. Massages are top notch and the facility is very clean. My wife took many classes at the gym while we were there. I took a tennis clinic with Miguel and really enjoyed it. It was hard to book time with him for lessons so do in advance. We ate at BLT and it was awesome. Food and service were great. Skipped Mulino's. Interesting where they put Mulino's. It is located in the casino where the big screen tv / bar used to be. Kind of a bummer that the bar is no longer there. It was nice when you wanted to take a break from the tables, plus on Sunday's you could watch the football games there. They made a lounge upstairs, but its out of the way and I never saw anybody in it my whole stay (I think they should have put Mulino's upstairs). Did I mention the casino ?", "title": "Love The Ritz San Juan", "helpfulness": 4, "user": "aristophanesny", "date": "December 15, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6446867, "likes": {"liked": "— Pool / Beach", "disliked": "— Christmas decor was majorly scaled back this year. Why ?"}}, {"rating": 5.0, "title": "Great Stay", "text": "In all would definitely reccomend this hotel.", "helpfulness": 1, "user": "jaxlax90", "date": "December 14, 2006", "id": 6441494}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Just came back from the Ritz Carlton PR. We stayed on the Club Floor, if you can please upgrade and stay on the club floor. The food and service from the staff are well worth the extra price. Overall great 5 Star hotel, the only negative was the slow service by the pool. Thanks again to everyone who worked in the club floor lounge. Definitely the nicest hotel in PR!!!!!", "title": "Great hotel for business or vacation", "helpfulness": 5, "user": "mommy_o_traveler", "date": "December 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6344051}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This is a great hotel for either business or vacation – expensive, but nice. I stayed at the Ritz Carlton from Nov 28 - Dec 2. The first 2 days we held a business meeting there and we were all impressed with the hotel rooms, the meeting rooms and the service. The meeting rooms had wireless internet service and the business lunches were very good. The corporate rate was amazing: $165 (it amounted to $200 after taxes and resort fee, which is still a great deal). We didn’t get a room with a balcony, but the rooms still had a combination water view/pool view. Our prior meeting was held at the Caribe Hilton and this is a much better place to go for a meeting. We had dinner at the Italian restaurant in the hotel (Il Mulino)– very good and very expensive. The portions are extremely large, so if you’re in a group I suggest sharing entrees or ordering the appetizer sized portions. The last 2 days of my trip my sister joined me for a few days of vacation. I was able to get the corporate rate for the remaining 2 days – what a deal! I got a pedicure at the spa – even though I e-mailed my request for a spa treatment without the 24-hour notice, they were able to accommodate me at the requested time. The posted rate was $75 but it ended up costing around $95 by the time they added tip and tax. This was the most I have spent on a pedicure – I hope it lasts. The spa service was friendly and professional. The fitness center was great and the classes were very good – not easy at all. If you take a few classes a day you are bound to return fitter than you arrived. Most of the cardio equipment had their own TVs. All headphones were cleaned after use. Water bottles and fresh towels were placed on all pieces of equipment, and the instructors would hand out cold bottles. The one negative about the fitness center was they only had 2 elliptical machines (which everyone wanted to use), and they were very much in need of service, making loud banging noises if someone used them. I found the noise quite annoying while I was exercising - They should have placed “out of service” notices on them. The pool and the beach were nice. There was just one pool and one hot tub, but there always seemed to be available chairs. There were always lots of towel guys hanging around to find you a chair. My only complaint about the pool area was the lack of beverage/food service. There were only a few people taking food and drink orders – not enough to cover everyone. Not one approached us to ask us if we wanted something – we had to chase them down or go to the bar and order on our own. I found this surprising because the ratio of hotel service people to guests was extremely high throughout the rest of the hotel – twice when I asked how to find something ( a restaurant or meeting room), someone took the time to walk me there. The rooms were nice. The air conditioning was adjustable and there were flat screen TVs and free internet. The one thing we didn’t like about the rooms was the lack of an internal privacy lock and lack of “do not disturb” signs (called “shh” signs in the hotel). Our room did not have a “shh” sign, and a member of the housekeeping staff walked in on my sister while she was getting dressed. We then asked for a “shh” sign for the door, which disappeared the next day (perhaps taken by another guest who needed one). I would prefer a privacy lock on the door. I had an evening flight, and the hotel provides “changing rooms” rather than let you check out beyond 1:30 PM. Overall, this was a very nice hotel, which is why I’m taking the time to write this, and I would definitely go back. This hotel is highly recommended for business travel and for a business meeting location. It’s also a nice place for vacation travelers who aren’t pinching pennies and are OK with $24 breakfasts and $14 pina coladas.", "title": "Amazing Relaxing Thanksgiving", "helpfulness": 5, "user": "PlateMan", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6230410, "likes": {"liked": "— Everything, but picking one the staff", "disliked": "— waking up early to get pool chairs"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Intro:", "title": "The Perfect Honeymoon Hotel", "user": "9brady", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6161224, "likes": {"liked": "— service", "disliked": "— the San Juan Hotel and Casino is within walking distance."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the Ritz June 23rd-28th, 2006. Don't listen to the reviews telling you not to stay at the Ritz. It is an excellent hotel with top-notch service, especially in comparison with the other hotels San Juan has to offer. We arrived in San Juan and checked in at the El San Juan (hotel next to Ritz) - at 3 am, with music still blaring from the pool deck keeping my husband and I awake, I called the Ritz and booked the rest of our vacation with them. We got to the hotel at 10:30am, and we're treated like royalty from the first minute we stepped out of the taxi. They took our baggage, insisted we eat a delicious breakfast, and had us in our room when we arrived! You are in Puerto Rico and if you have any cultural experience, you should know what to expect. It's not Hawaii, but that's not why you should go there. I've stayed in nicer Ritz's, but I've also paid A LOT more. You won't find a better hotel in Puerto Rico, and it's still a wonderful resort. Food was great at all restaurants - especially Prime 787. If we return to San Juan, we'll be staying here, hands down, there is no contest.", "title": "Can't go wrong at the Ritz!!!", "helpfulness": 5, "user": "acptravel", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5422563}, {"rating": 4.0, "title": "Good Deal if you Get a Discount", "text": "I was able to book this hotel at a pretty substantial discount (under $200). At the discounted rate, this was a great hotel. But if I had paid $400+ a night, I would have been pretty upset and bitter about the whole situation. The hotel room is a typical Ritz Carlton room, and has a large bathroom and a flat screen tv. Very few rooms have balconies and the windows don't look like they've been washed in 10 years. But the real problem with the room is that you can literally hear everything in the neighboring rooms. If your neighbors decide to watch tv at 2:00 am, then you will hear it. If your neighbors have a baby and it decides to cry in the night (happened twice for me), you will wake up too. If you want to sleep until 10 am and your neighbors wake up at 7 am and decide to have a normal conversation, you will not be sleeping in that morning. Its like being in a motel! That being said, the pool is gorgeous (but crowded on the weekends) and the beach is really nice too. We had hit or miss service in terms of getting beverage service at the beach/pool. I think its because its a little understaffed. Given I paid less than $200 a night, that was ok with me. If I had paid double the price.... then it would have been upsetting. The beach water isn't quite as pretty as other Caribbean islands. Oh, and its a $19 taxi ride each way into Old San Juan, which adds up! And a $17 per day resort fee, which is sneaky, in my opinion. While the food at the hotel was pricey, I didn't think it was any more outrageous than any other resort hotel. Given all this, I would definitely go back as long as I could book at a discount. I thought the staff was very friendly and the hotel did try to add a lot of those extra touches that differentiates a 3-star from a 4-star hotel.", "helpfulness": 3, "user": "Greenie2", "date": "June 28, 2006", "id": 5406098}, {"rating": 4.0, "title": "A Quick Rainy Getaway", "text": "My family and I just returned back from a 5 day / 4 night stay at the Ritz Carlton San Juan. I enjoyed the Ritz Carlton, as it was clean, the staff was friendly, the location was convenient to the airport (7 minutes), and convenient to Old San Juan (a must see!). The hotel grounds were beautiful!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 23, 2006", "id": 5376666}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "I was prepared for the food to be expensive (from reading other reviews), and yes it was! Unfortunately, it was only average tasting food. The cost.......$45.00-$55.00 for lunch for 2-3 people. I went across the street to THE METROPOL restaurant (a recommendation from reading other reviews) and ate there our last night in San Juan. Better value for your money, and the Pina Colada's are just as good, and cheaper. The cost of a Pina Colada at THE METROPOL $7.00 The cost at The Ritz $14.00", "title": "Not the Best Ritz", "helpfulness": 6, "user": "ATR25", "date": "June 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5350884}, {"rating": 5.0, "title": "Just Amazing", "text": "Because it was close to the Airport, we could definitely hear the noise from the planes taking off. I did not like that.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 14, 2006", "id": 5349283}, {"rating": 2.0, "title": "Nothing Special", "text": "I spent 3 days at the ritz with high hopes. This place is not much to write about. The check in was slow, they did noot have my room ready until 5:30. The rooms are small and very comfortable but nothing exciting. The people are friendly with the exception of the pool side lunch place. They are more interested in ignoring the customer than servicing your needs. The beach guys are nice and will help with any request for 20 bucks. Blt was slow but good food. The casino is full of local old ladies who line up on the slot machines. There is no action at night, i suggest walking to the el san juan there lobby is always the hottest place in pr. So the rits is not really a ritz its just a nice room on a nice beach", "user": "sandmannLasVegas", "date": "April 21, 2008", "id": 15199965}, {"rating": 4.0, "title": "We were happy but stayed with a discount", "text": "We stayed at the Ritz Carlton for 5 nights, at a significant corporate discount. Without the discount, I don't think we would have been quite so happy, but with the discount, we were pleased. The room was clean and spacious, the beds very comfortable, and the staff was really pleasant. The pool was extremely crowded our first day there (a Sunday) but that did not happen again during the rest of our stay (we left on a Friday). And you always had the option of having chairs set out for you on the beach, which was really nice. The pool was also great, and the grounds are beautiful. we even saw some very cool lizards running around, and at night, if you walk around you can hear the frogs singing. The little touches are nice - like the NY Times supplement, the fruit at the towel stand, the fact that at any given time, staff were always around and were always helpful. The casino (and the whole hotel) is now non-smoking, and that was great too. I think overall it is a great place to relax and get away, with very easy beach and pool access that is comfortable and clean.", "user": "ctrevor", "date": "April 20, 2008", "id": 15174319}, {"rating": 5.0, "title": "Fabulous Service at the Ritz!", "text": "Complaints would be the food - on every level. For what you pay to stay there (full price or not), I think they should include a continental breakfast. The hotel restaurant options are all very expensive. We ate at Il Mulino one night and were extremely disappointed both with the service and the food. The poolside restaurant menu was really limited, overpriced, and the food not very good. We discovered a small diner a block off the property called Cafe Piu, which has fabulous gelatto and a really nice staff, and just relied on it heavily for breakfast and lunch. Other than that, there are not a lot of restaurant options within walking distance (other than fast food) so getting to the good restaurants required a cab ride or a car rental.", "user": "HaveBagsWillTravel6", "date": "April 15, 2008", "id": 15053248}, {"rating": 4.0, "title": "Good hotel, great location, thumbs up overall", "text": "The service at the San Juan hotel was outstanding. We stayed 4 days and 3 nights to celebrate a mile stone birthday for my mother.", "user": "hank1105", "date": "April 14, 2008", "id": 15039814}, {"rating": 4.0, "title": "Very Good but not great", "text": "Over the course of the 4 days - the Ritz employees remembered our names, wished my mom a happy birthday everyday and remembered everything that we were doing. They truly made it a memorable event.", "user": "katieh", "date": "April 14, 2008", "id": 15035152}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Two of my girl friends and I went to the Ritz for a three-night getaway. We decided to splurge and were really looking forward to top quality all around. We found that some things were very good and others quite mediocre, if not disappointing. However, I will noted that at the end of our stay, the manager, Ramon, thoughtfully addressed my concerns and gave us a deduction on our bill, which we very much appreciated.", "title": "Nice, but not the Ritz we expected", "helpfulness": 2, "user": "GettingCozy", "date": "February 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 55585792}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "To address the comment made by another writer about the 7th floor having bed bugs - we stayed on the 7th floor and were just fine. However, we hadn't read that review before we came and then other guests told us about it - about the review and that they had been on that floor and their room smelled funky like bug spray. We were quite alarmed upon hearing it, and at first the staff at the Ritz did/said little to appease our concerns and also could not switch our room b/c the hotel was full. The next morning, however, Ramon promptly told us that the hotel (and all hotels) are frequently checked for bed bugs and insects and that there are none, but rather, people can be bitten by sand fleas. Still, he had an exterminator come to make absolutely sure. We appreciated this measure.", "title": "Huge, greedy, resort hotel in ugly setting", "helpfulness": 1, "user": "JRLP", "date": "February 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 55490526}, {"rating": 5.0, "title": "Awesome, solid experience. Can't go wrong.", "text": "The good", "helpfulness": 2, "user": "Jenna181", "date": "February 7, 2010", "id": 55375052}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "-The pool area was nice. You can have an umbrella if you like. Waiter/waitress service at the pool, though slow at times and you need to flag them down.", "title": "Everyone loves this Hotel", "helpfulness": 2, "user": "Parity", "date": "February 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55339476}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "-The spa was very nice. I had an amazing massage.", "title": "Wish We Were At The Intercontinental", "helpfulness": 3, "user": "AUJ", "date": "February 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 55284025}, {"rating": 3.0, "stay_parameters": "Stayed April 2008", "text": "Just returned from San Juan for a 3 night stay. The property was extremely crowded, trying to find a seat at the pool was quite a challenge. I found service to be extremely slow and almost non-existent by the pool. The hotel was very clean but just not quite what you would expect from a Ritz. Our room was very basic, not many balcony rooms to be had. Ok, I know it's the Ritz but things are soooo overpriced it's ridiculous! 3 drinks by the pool $50. 50 minute massage with tip $171. The beach is okay, it happened to be extremely windy while we were there so you were getting whipped in the face with sand most of the time. It was definitely not a very tropical location. If you want that \"island\" feel this is not the place to go. Don't get me wrong, overall, we did have a nice time. The casino was fun, BLT was a great restaurant, I didn't get to experience Il Mullino but heard it was fabulous. For close by nightlife to to El San Juan the lobby bar is great, live entertainment and a fun atmosphere.", "title": "nice but not quite what a Ritz should be", "user": "vacationqueen1", "date": "April 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14853572, "likes": {"liked": "— pretty pool, close to airport", "disliked": "— service"}}, {"rating": 3.0, "title": "Nice property, too crowded and bad service", "text": "We stayed here for one night at the tail-end of our honeymoon before catching our plane home. The property is beautiful, but in case it's not clear from the property description... it is located right next to the San Juan airport. The airport is probably a two minute drive from the hotel. Our room was on the San Juan facing side and looked out onto the airport runway. This didn't seem to create noise issues however as I guess the hotel must be far enough away or the flight pathways don't go directly over the hotel and so the noise isn't really noticeable. In fact, some might consider it a great convenience if you're looking for a \"quick-strike\" vacation because you don't have to waste time in ground transport when you arrive in San Juan.", "helpfulness": 2, "user": "intltravels", "date": "April 5, 2008", "id": 14815252}, {"rating": 5.0, "title": "The BEST hotel in the area", "text": "The hotel is extremely crowded... at least it was when we were there. It seemed there was always a queue at the reservation desk and the restaurants were packed (I think there are only two - one by the beach and the italian restaurant next to the casino). Crowds can be ok if they are managed well. Unfortunately, the hotel staff seemed incapable of handling the crowds very well. The wait times were very long at the reservation desk both to check in and to check out.", "helpfulness": 2, "user": "prtraveler323", "date": "April 5, 2008", "id": 14815132}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "My take-away from our stay here was it's a great hotel if you're looking for a get away to a pretty hotel with a nice beach and you don't mind navigating crowds. It's a terrible hotel if you're looking for a \"forget the world\" experience- quiet, peaceful, service like you're the only customer that matters, etc.", "title": "Much to recommend", "user": "sueeMaryland", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14740443, "likes": {"liked": "— The beauty of the property--the grounds, lobby and room.", "disliked": "— The noise from the airport."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I stayed at the Ritz for the first two days of our honeymoon before taking a cruise from P.R. From the moment we walked in the door we were impressed. While checking in we", "title": "Definitely not a Ritz!", "helpfulness": 2, "user": "Bella513", "date": "March 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 14589609}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "I stayed at the Ritz-Carlton San Juan for two night during Labor Day Weekend. The hotel and service was fantastic. We loved it. The property is beautiful. We had an oceanview room and didn't hear any airport noise. The view was beautiful and it didn't even seem like we were near the airport. There was live music in the bar which was a nice touch as well. I also enjoyed the spa which was outstanding. They gave us a glass of wine with the pedicure service which was pretty nice. I had one of their signature body treatments the Hawaiian Lomi Lomi Massage and it was outstanding. The spa service is top notch. I would stay at this hotel again in a heartbeat. I've stayed at other hotels in the surrounding area and they don't hold a candle to this hotel.", "title": "Simply the Best", "helpfulness": 9, "user": "Elle08", "date": "September 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5806657, "likes": {"liked": "— spacious room", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I would first like to say that I've stayed in over a dozen Ritz Carltons worldwide as a result of my frequent business travel. I've also stayed at several other fine hotels including the Four Seasons, St. Regis, etc. If you are used to staying in these type of hotels then please read this review VERY carefully.", "title": "Nice place for airplane noise and slow service", "helpfulness": 15, "user": "novatravelreview", "date": "September 13, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 5797439, "likes": {"liked": "— Going home", "disliked": "— The Ritz"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "1) The hotel is located smack under the main airport. This means 2 things - noisy airplanes taking off over the beach while you relax and dumping jet fumes all over you it also means that \"city view\" rooms are \"runway view\". Even the double pane glass does not drown out the noise completely.", "title": "The Best Hotel in San Juan", "helpfulness": 8, "user": "Greatraveler", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5789493, "likes": {"liked": "— The pool and the beach area", "disliked": "— Prices at the restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "2) While the staff is incredibly friendly, they also act as if they are on vacation. Don't expect to be asked for a drink more than once per hour at the beach and dont expect any sort of real service at the lobby lounge bar. The table next to use had to go flag a waitress after waiting 20 minutes. She said she would be right there. 10 minutes later she still was not there and the couple go up and left. The best service is at the beach side grill, but don't expect too much.", "title": "Love going there", "helpfulness": 5, "user": "My_Visit", "date": "September 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5783955, "likes": {"liked": "— Service", "disliked": "— If you're looking for romantic get-away, stay away on holidays when there are too many children"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "3) While you expect to pay a premium for food and ammenities at the Ritz Carlton, this Ritz has taken it to another level. $18 for a \"Ritz Burger\" which tasted like a frozen beef patty. $7 for 2 pieces of sushi at the sushi bar. While the sushi was fresh they cut very small pieces that barely covered the rice...COME ON, for $3.50 per piece you could cut some fish!!", "title": "Just as we expected from the Ritz", "helpfulness": 9, "user": "jemill00", "date": "August 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 5729213, "likes": {"liked": "— The luxury in this resort setting", "disliked": "— Cost of non-included items (bar, restaurants)"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "I have a very prejudiced view of the Ritz. My wife and I had a wonderful time there. It is a wonderful, beautiful place to stay. Everything is top notch. But we were lucky and used travel vouchers for our 5 night stay and didn’t have to pay a dime for our stay. The Ritz is very expensive. I am not sure you get your moneys worth. It is a little expensive for our lifestyle. But…..the place is awesome. It has a great beach. Free water equipment so I boogie boarded all the time. I cannot say enough about the staff. We stayed there 3 nights and then went to the western part of the island to see how the real folks live, then we finished off out adventure back at the Ritz for 2 nights. The staff remembered our name! They were very interested in our travel to the west side of the island. They were very sweet. I highly recommend the snorkeling day trip that the hotel arranges. It was a very well run operation. I say if you have the bucks, stay at the Ritz!", "title": "Very nice place to stay. Staff very helpful.", "helpfulness": 6, "user": "tlcarlson", "date": "January 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "service": 5.0}, "id": 3012751}, {"rating": 5.0, "title": "Worth every $", "text": "After spending 6 nights here (just got back yesterday) and wondering around Isla Verde and (old) San Juan, the Ritz is hands down the best hotel in the area (over el san juan, convento, etc.). It is 5 minutes from airport (but you really do not notice it)...we landed at 2 and were checked in, changed and on the beach with a drink by 3.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 20, 2004", "id": 2906147}, {"rating": 3.0, "title": "Very good but...", "text": "The beach is beautiful (unlike the beach by the el san juan which appears much more public, this beach is more quiet and relaxing...hammocks and lounge chairs are pentiful ).", "helpfulness": 17, "user": "A TripAdvisor user", "date": "December 20, 2004", "id": 2905330}, {"rating": 4.0, "title": "Screams 5-Stars at its best! Loved it!", "text": "The staff was terrific...fast check in/out, great conceirge (you must try the restaurant in the Museum) and we were upgraded to one of the best rooms in the hotel with one request. The room was not big, but very nice...bathroom was very good.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 30, 2004", "id": 2856905}, {"rating": 5.0, "title": "5 Star", "text": "Food was good...particularly, the sushi bar.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 18, 2004", "id": 2832558}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "4) The concierge is not knowlegeable. We asked to book a trip to a neighboring island. It took about 45 minutes for the lady to find out that there were no travel tours because it was \"off season\". We also asked which restaurant would have a sunday brunch. The concierge pointed us to the Ritz Carribean Grill which of course did not have a brunch when we got there.", "title": "Great Sevice Joe clifton, NJ", "helpfulness": 6, "user": "jovis10", "date": "August 20, 2006", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5628706}, {"rating": 5.0, "title": "very,very, nice", "text": "we stayed at the marriott for two nights, before staying at the ritz. There is no comparison. The Ritz is lovely and very clean. The staff is very friendly and couldn't be more helpful. The restaurants are o.k. overpriced. But you can eat out locally and have good food. I would definitely recommend the hotel as one of the best. It is on the quiet side. I would not bring teenagers here.", "helpfulness": 3, "user": "kyamin", "date": "June 30, 2004", "id": 2240879}, {"rating": 5.0, "title": "WE LOVED IT !!", "text": "My husband & I just returned from our vacation we stayed at the ritz carlton", "user": "A TripAdvisor user", "date": "June 28, 2004", "id": 2226198}, {"rating": 4.0, "title": "Nice hotel", "text": "the staff was very friendlty (first rate) !!", "helpfulness": 3, "user": "jayne94", "date": "June 20, 2004", "id": 2207783}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "rooms are very nice the bed is like sleeping on a cloud take metropol (cuban food) food is very good & reasonable prices. !! (across the street in walking distance.", "title": "We loved the Ritz and would definitely return!", "helpfulness": 2, "user": "Tosca3", "date": "June 1, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 2137214}, {"rating": 4.0, "title": "Loved The Ritz", "text": "the pool & beach are nice !!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 30, 2004", "id": 2130816}, {"rating": 4.0, "title": "great time at the Ritz", "text": "just returned from PR. Feb. 17,24,04 at the Ritz. As usual had a great time. Hotel and staff were great , will be back soon.", "user": "A TripAdvisor user", "date": "March 11, 2004", "id": 1720558}, {"rating": 4.0, "title": "A few problems? Sure. Still a great place to stay? Definitely.", "text": "My husband and I just got back from a 4-night stay at the Ritz-Carlton in San Juan, and overall had a wonderful stay there. We found all the staff to be very helpful and friendly, always greeting us with a smile.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 8, 2004", "id": 1713372}, {"rating": 1.0, "title": "Disappointing. Terrible. Horrific.", "text": "The property was beautiful, especially the pool area and lobby. It is true that the rooms could use some updating - especially new carpet - but our room and bathroom was large (at least for our NYC standards), comfortable, clean, and nicely decorated. We had no trouble getting a king size bed, and another reviewer put it nicely, it was \"like sleeping on a cloud\". On the weekdays, housekeeping was a little slow to get to our room (twice it was not done by 4pm), one night we did not receive turndown service, and I had to call to get new bathrobes when housekeeping removed them and forgot to replace. This didn't bother us too much since we were rarely in the room during the day, and during the weekend the housekeeping staff was much more on top of it. The pool area was indeed crowded, but we were always able to find chairs (even getting there late morning/early afternoon). There is some airplane noise on the beach, less at the pool, and we never noticed it inside the hotel. The beach is beautiful, but windy - at least when we were there - and they have nice hammocks set up under the palms. We did not eat dinner at the hotel restaurants, preferring to head into Old San Juan, but the breakfast at the Caribbean Grill was always delicious.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 2, 2004", "id": 1687690}, {"rating": 1.0, "stay_parameters": "Stayed January 2005", "text": "Also had very tasty Cuban food at Metropole (5 min. walk from hotel) - and for $35 for two people, dinner, beer, and dessert, it's a great deal for a casual meal. The nightlife at the Ritz is pretty quiet, except for the casino on the weekend. However, a very happening bar/nightclub scene is only a short walk away at the El San Juan. That was a fun place to spend an evening, but I don't think I'd want to stay there as a guest. Overall, the Ritz was exactly what we were looking for - a peaceful, beautiful place to enjoy the sun and be pampered. For us, the few problems were merely momentary annoyances, and did not affect our enjoyment of the vacation. We would definitely stay there again, and highly recommend it to others.", "title": "This is what the Ritz is like??", "helpfulness": 3, "user": "JLBWaterbury_CT", "date": "March 1, 2004", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 1686378}, {"rating": 1.0, "title": "Far cry from other Ritz Properties", "text": "We just spent three nights at the Ritz Carlton, San Juan. This hotel is an embarassment to the Ritz franchise. The management staff was rude, completely unhelpful, and dishonest. They did nothing to accomodate us or make up for the mistakes they continued to make. Although most of the bellboys and waiters were nice, some were downright lazy and seemed bothered to have to help us (not surprising given the horrible management style of the entire place.) Needless to say, we will NEVER be returning to this hotel and I have warned everyone I know to stay away. I would venture to say we would have gotten better service at a Holiday Inn. Disgraceful.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 1, 2004", "id": 1686242}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "My husand and I recently spent three days at the San Juan Ritz Carlton, begining with Easter Sunday, and were terribly disappointed with the hotel service, definetely not at par with other RC resorts. The staff is polite but not eager to please. Had to request silverware on several occasions, while dining on very mediocre food, at the resort restaurants. In general it was not a terrific experience and we would not recommend this resort. Also beware of the Metropol restaurant across the street. My husband became the recipient of a severe bacterial infestation after eating one of their fish preparations and pretty much spent his time between the bathroom and bed until the antibiotic he prescribed for himself, fortunately he is a physician, kicked in on Tuesday when it was time to leave. Good to be home. Wish we had done So. Florida instead.", "title": "Disappointing Experience", "helpfulness": 2, "user": "pina", "date": "April 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 4.0, "service": 3.0}, "id": 3321364}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Just spent 5 days at the Ritz San Juan. Very nice staff, hotel is not a premier property. I felt my room needed a face lift. Wall paper in bathrooms old and in need of change. Rooms very small. Hotel very expensive for what you get. I would not recommend San Juan if your looking for a great beach. Yes, you do hear the planes all day at the beach. Not a horrible problem, but you can hear them. I would not stay there again. I really was expecting more luxury than what I was charged.", "title": "Over Stated", "helpfulness": 2, "user": "ral63", "date": "March 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 3311369}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "My wife & I stayed here in March, 2005.", "title": "A fair analysis of the R-C San Juan", "helpfulness": 11, "user": "jofog1", "date": "March 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 3293901}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Pros:", "title": "A delightful retreat", "helpfulness": 4, "user": "GlobalFlyer", "date": "March 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3290004}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "Finest hotel in Puerto Rico, without question. Service is fantastic, Resort has very nice outdoor area with pool and lush gardens. It is the first hotel out of the airport, which makes for easy quick getaway. Lots of activities and tours daily. Kid-friendly, in Ritz-Carlton style. Very nice spa facility with a great gym, many classes daily & tennis courts. An oasis in Isla Verde.", "title": "Great Place", "helpfulness": 4, "user": "tddn", "date": "March 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3281836}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Our stay was just what we expected from the Ritz....First class service at a beautiful resort. The staff here are some of the friendliest and hardest working people I have ever met. They really understand service and go above and beyond to please their guest.", "title": "Loved the Ritz!", "helpfulness": 1, "user": "babygirl722", "date": "October 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 20885532, "likes": {"liked": "— Fabulous, family friendly resort that has it all.", "disliked": "— Thought the room was a bit dated and small"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The rooms were just OK - we were on the Club Level and felt that the room was a bit small. Bathroom was very nice and overall the room was well maintained but a bit older and nothing special. We had a beach view which was really nice.", "title": "Nice stay", "helpfulness": 2, "user": "Armando_73", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20391413, "likes": {"liked": "— I got what I was expecting. To relax and a good service.", "disliked": "— -"}}, {"rating": 5.0, "title": "Perfect", "text": "The Club Level was really worth it for a family of 4 and the staff in the lounge was fantastic! They were constantly offering the kids hot chocolate with whipped cream and always making sure that my husband and I had all that we needed. They really made us feel at home and spoiled us as well.", "helpfulness": 1, "user": "Keoki73", "date": "September 7, 2008", "id": 19855594}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Beach and pool were gorgeous. Casino was just so-so. I like a little more action and felt that the place was not as liveley as the casino at the El San Juan, which is a short walk away.", "title": "Loved the Ritz-Carlton", "helpfulness": 2, "user": "travelingcheap", "date": "September 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 19800733, "likes": {"liked": "— Non-Smoking Casino and Excellent Pool!!", "disliked": "— -"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We had dinner at both Il Mulino and BLT Steak. I thought Il Mulino was just OK but BLT Steak was fabulous.", "title": "Best Hotel in San Juan", "helpfulness": 5, "user": "captain77", "date": "August 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19241040, "likes": {"liked": "— Wonderful Service", "disliked": "— Proximity to airport"}}, {"rating": 4.0, "title": "Nice hotel OK location", "text": "Enjoyed our stay at the Ritz. The hotel is very clean and the pool area is beautiful. The beach is small but nice enough. The people who work here are very friendly and try to do their best. Yes they could use a couple more waiters on the beach. You almost feel sorry for the two that are running around to accomodate everyone. Just dont go to the beach thirsty. Stop by the lobby entrance everyday they provide a super tastey fruit juice. We had dinner at Il Mulino and it was pretty much exactly like the Il Mulino in Chicago, New york etc. I made a reservation through the hotel but upon arriving they didn't have it? Not surprised by this because truthfully the hotel seemed alittle mismanaged. Asked the concierge 4 diffrent time to help me set up a trip to Culebra and each time they told me they would call me and never did. I finally set it up for myself. By the way for 60bucks a person on a short flight (Isla nena fajardo airport) it was worth it. beautiful beach soft white sand clear blue water. Just be sure to bring off the mosquitos are crazy there! For a nite out go to Old San Juan theres a lot more happening there. The Ritz dies down pretty early at nite. For premium shopping hit Condado this is a beautiful area with alot of construction going on but it is nice for daytime walking around. Cafe De Angel is a great spot for lunch with super food at reasonable prices. The Ritz is great. San Juan is ok. Not to muchto do in San Juan but gamble. You will have to leave that area to really enjoy Puerto Rico. One final warning do not go to Lupi's (down the street from the Ritz) it is gross. The worst Mexican restaurant I have ever been to. Never got past the fake guacamole(they say is fresh) to order anymore.", "helpfulness": 8, "user": "bullwrinkles", "date": "November 9, 2006", "id": 6093140}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I recently stayed at the ritz in san juan. We selected the ritz in san juan because we wanted to relax at close beach location.", "title": "the ritz san juan - the real deal", "helpfulness": 26, "user": "pagination", "date": "November 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 6044368, "likes": {"liked": "— the location", "disliked": "— the grounds. the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Overall i thought the rooms were nice however we could hear our neighbors every night.", "title": "The real Ritz Carlton San Juan", "helpfulness": 11, "user": "alex8495c", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6026291}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "the service was good but not the best i've experienced.", "title": "Good Enough Discounted.", "helpfulness": 44, "user": "TRAVELINGLIFE", "date": "October 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6008173, "likes": {"liked": "— ROOM/BATHROOM", "disliked": "— SECURITY/DO NOT DISTURB SIGN NO RESPECTED"}}, {"rating": 3.0, "title": "I wish I could be a mystery shopper", "text": "the grounds were a let down. the beach was just ok. i think i selected the wrong beach destination.", "helpfulness": 54, "user": "bartleby2006", "date": "October 23, 2006", "id": 5985287}, {"rating": 2.0, "title": "Is this value for money?", "text": "My company does business with the Ritz-Carlton, and so I stayed at the Ritz-Carlton. I was prepared to be impressed, but, I told my boss \"my people are Motel Six people, I don't know how to handle this kind of royalty treatment\"....", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5339270}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "All I could think of the whole time was \"this is too pricey...\"", "title": "If you're blue and you don't know where to go to...puttin' on the Ritz", "helpfulness": 5, "user": "FamilyFlight", "date": "June 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5297141}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The people were friendly. (But they're friendly at budget motels too)", "title": "Want to go back with kids in October!", "helpfulness": 6, "user": "thebets", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5287702}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The lobby was very pretty and so were the grounds. I'll grant that.", "title": "Great time at the Ritz!", "helpfulness": 4, "user": "BrownSugar622", "date": "May 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5231699}, {"rating": 1.0, "title": "Very disappointing", "text": "The breakfast buffet was pretty but I didn't eat it because it was so pricey (no sense in having my employer pick up the check $20+ when my diet says I should eat toast and coffee...)", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 22, 2006", "id": 5188123}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "This Ritz is not your normal Ritz. We called it the \"I am Sorry Ritz\". I do not know how many times we were told after a mistake how sorry they were. It took forever to get a room even at 5:00 PM and nobody in the lobby on a Sunday. I was promised a 150.00 credit and never got it for waiting til 6:30 PM for a room. The beach is full of sand fleas so that is a bummer. The hotel is clean and thats about all I can say. I was hungry all day long. At night they only have a limited number of seats at the two restaurants so you must call a day or so ahead. I ate in my room two nights out of six. The menus at the hotel restaurants are very limited. The pool is nice but no music, bummer. No people in the hotel knew any thing about the hotel. In six days at the pool I was asked about a drink a sum total of 7 times, but they were real sorry. The gift shop is totally a waste. A couple of bags of chips and a couple cookies. No cokes or liquid drinks of any kind. I bought most of my pepsis at the bar, but be careful the maids will throw away any food or drinks in the rooms. They did it to me twice. The casino is the one bright spot it is very nice. In summation I do not think this is a normal Ritz Carlton. If it is they do not deserve the prices they charge. I got better service in Vegas and in Aruba at 3 star hotels.", "title": "Do Not be fooled by name!!", "user": "tom79762", "date": "February 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 56785489}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "I stayed at the Ritz in San Juan with a large group that was on the island to view a college basketball tournament. I know this hotel is quite expensive, but hard for me to give exact details as my pricing was part of a larger package that included things outside of hotel (dinners,transportation,tours) so it is hard to give an exact detail on price.", "title": "Very Nice Hotel, but...", "user": "SHU1996", "date": "February 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56518415}, {"rating": 3.0, "title": "Not worth the money", "text": "Hotel is very close to airport, which is a good and bad thing. It is in a bit of a noisy area, planes going overhead, and also outside the hotel at the street. The neighborhood around the hotel is not really a touristy area per se, but there are a lot of options for food and drink in walking distance. While the area around hotel was not luxury, I still think it was pretty safe and many people, both guests and residents walking around, even at night. Several restuarants around, including fast food joints, as well as small strip malls, with drug stores like Walgreens - purchase snacks or other items outside hotel gift shop.", "helpfulness": 1, "user": "chicagofamily04", "date": "February 17, 2010", "id": 56295726}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The hotel was very nice. Lobby was nice, including a seating area with a small bar. Several nice, but expensive hotels in the hotel. We ate at the breakfast buffet several times, and ate at the il Mulino restaurant in hotel. The food at il Mulino is very good, they have several locations around the world, including NYC. The casino was a nice size, with a decent crowd and choice of games. Pool was very nice, beach was nothing special.", "title": "Not the Ritz Carltons I am Used to!!!!!", "helpfulness": 2, "user": "roccodog", "date": "February 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 56163406}, {"rating": 5.0, "title": "Thumbs up for the Ritz in SJ and Elmer's mimosas too", "text": "Service was so so. Getting drinks at pool took a while and the cost was siginifcant. Pool attendents set up chairs, umbrella and towels for you, but expected a tip. Chairs were nice and padded, but were often wet due to rain or people sitting on with wet clothes. I found this annoying, even when extra towels were placed on chairs they eventually soaked through.", "user": "llombardo24", "date": "February 11, 2010", "id": 55707454}], "location": {"country": "Caribbean"}, "stars": 5, "variance": {"poor": 108, "average": 272, "very good": 453, "terrible": 67, "excellent": 754}, "aka": "Ritz-Carlton San Juan Hotel, Spa And Casino", "slim_ranking": 0.214285714286, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}}