{"user_rating": 4.0, "review_count": 535, "name": "Ritz-Carlton Philadelphia", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "So, apparently this is what a Ritz is these days. I haven't stayed in one for a while, but was attending a conference based in one so gave it a try. It only served to reinforce my stereotypes. I continue to prefer Four Seasons, Hyatts and boutiques. This is a hotel for people who like frumpiness and appreciate the overly-dramatic, intensive type of service.", "title": "Helpful staff, aging and disappointing facilities", "helpfulness": 1, "user": "rsp1", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 144927740}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "For the price (and given the hotel name) the room is shockingly simple. There is a surprisingly small flatscreen TV. I had to move furniture to plug in my phone near the bed. Actually, good luck finding any power outlet that's not on the desk. The clock radio takes CDs (!) (there is no cord to plug in an iDevice). To its credit, the bed is very comfortable.", "title": "Central Hotel with Amazing Club Lounge.", "user": "CraigNewcastle", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144882148}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "Internet service was ok. It stopped working a couple times, but quickly came back. Speeds are what you'd expect (poor).", "title": "Overall very good", "user": "ct3408", "date": "November 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 144881553}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The bathrooms were nice, but they didn't provide any amenities outside the usual. Also, the products were generic in plastic tubes. I expected more (eg, bliss/kiehls at competitors).", "title": "Interesting Space, Poor Management", "user": "Drapeaued", "date": "November 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 144598883}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "It has the usual over-priced breakfast; however, the order was delivered incorrectly (which they promptly and apologetically remedied). The bill was also wrong - the hotel added valet parking when I didn't have a car. The $8 bottled ice tea for sale on the bedside is a nice touch (well, $10 when you add taxes/fees)...", "title": "Business in Phila", "user": "bcarpou", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144596404}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "A beautiful hotel with a great location within Philly. Surrounded by great restaurants and theater.", "title": "Great location and staff", "user": "denali13", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142487983}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Valet and door service were great. Concierge was extremely helpful in getting us dinner reservations on a busy restaurant weekend in Philly. Room was nice. Bed very comfortable.", "title": "OK service, superb location, but showing a little wear", "user": "RazzTazz23", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 142437301}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Very accommodating with a late check out request. Only one reason for not getting 5 stars, they charge for internet access. At $400 a night, wanting to charge for wifi is insulting.", "title": "Excellent service", "user": "Yeny925", "date": "October 7, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142221976}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We stayed for several nights at the Ritz in Philly. We booked a club floor superior room. It appears on further research, we were given a standard room with club floor access, which is a little annoying.", "title": "Wonderful Stay", "helpfulness": 1, "user": "desilady1", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142001947}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The Good - The club floor is great. Nice view, beautiful decor, wonderful service. Free internet in the club lounge, lots of wonderful food and the people staffing it are great. Also great is the door staff, who were very quick to lend a helping hand or grab a cab. The lobby area is amazing. We spent some time in the lobby bar which was very nice. Also great is the location - smack in the middle of everything. We walked most everywhere or took a quick cab ride. The towels were fluffy. The bed was very comfortable.", "title": "Exceptional Service", "user": "jim m", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141878873}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "My husband and I checked into the Ritz Carlton, Philadelphia for a conference he was attending only to be told they had oversold and we didn't have a room, even though we had made a reservation months in advance! I've never had this happen before, and to experience it at the Ritz was very surprising and a big letdown. They sent us in a cab to the Courtyard by Marriott which was right around the corner, The cab driver was very irritated to only drive us a few blocks. He basically threw our luggage out of the trunk. Had we known we would have walked and gotten there a lot faster and with less stress! The Ritz did pay for our night at the Courtyard Marriott, but my husband was getting reimbursed as it was a work trip, so that didn't do much for us. Housekeeping was also not especially friendly, even though we left them a tip each day. I went to the spa and had a great massage with Jim. But there is no hot tub or anything of the kind which seems a bit odd for a spa not to have. They said it was because its a historical building and they can't have standing bodies of water. Huh? At any rate, the service here is good, once you are actually able to actually check into a room. Prior to that, it was not a good experience.", "title": "Nice hotel but not all I had hoped for", "user": "SB4SD", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143230370}, {"rating": 4.0, "title": "It's the people", "text": "From the champagne at check in to James at the concierge desk to the guys out front, everyone cares about making your stay memorable. It's impressive that so many are all the same page. It's head and shoulders above a typical hotel experience. Nice job everyone.", "user": "Mike K", "date": "October 16, 2012", "id": 142976886}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The location of this hotel is excellent for central Philadelphia, is very close to our office and close to shopping on Market St. My room was huge, with the King beds dwarfed by the large empty space in the middle of the room - it felt like it needed some furniture, and could easily have had another couple of tables just to fill the gap. Because of this the large TV was too far away from the bed.", "title": "Cavernous room needed furniture!", "user": "Phil176", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 142639413}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This is nit-picking though on a beautiful hotel with a high standard of service. The eggs benedict in particular makes the stay worthwhile.", "title": "Not Worth it", "user": "martinjld", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142607530}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I had to stay here on business. The lobby was very nice and the guest service was great. The king bed room was nothing better than average with not much space. The bathroom had a nice size counter but that's it. There wasn't much space to move around and the water pressure in the shower was terrible. The flat panel TV was nice with lots of channels to choose from. The Internet was pretty bad. Wired or wireless it was slow and intermittent. After calling the front desk and being told the Internet was fine, I was connected to tech support which really did nothing...the connection was still junk. Others I talked to said they were also having issues with the Internet. Ritz Carlton's are never as good as people think they are.", "title": "Great location, very poor internet", "helpfulness": 1, "user": "GoDuke_78", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142567707}, {"rating": 3.0, "title": "Spectacular food service at wedding - but who wants to have to call an engineer at midnight to shut out the room lights?", "text": "iiMy wife and I recently stayed at the Ritz Carlton for a Friday evening wedding (even though we live in a Philadelphia suburb). By the end of the evening, I was prepared to write a spectacular review. From the champagne offered to us as we checked in, to the attentive service of the gentleman who shined our shoes, we were very impressed with how well run the hotel seemed to be. I was particularly thankful to the catering staff, and Chef Patrick and his team of waiters - I have a food allergy, and had called ahead. When the wedding began, the staff was aware of my needs, and had prepared alternative meals for the courses I could not eat. I have resigned myself to spending effort and time to explain my allergies to wait staff who always seem surprised that I am attending an event, but here my every need was anticipated, not only with an accomodation, but with excellent food.", "user": "sgrstan", "date": "November 3, 2012", "id": 144403279}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Then we tried to go to sleep after the wedding. Unfortunately, the lamp by the side of the bed was linked to the hall entrance light - shutting off the entrance light also completely disabled the outlets by the bed. I need electricity to power a medical device at night, so when the choice seemed to be doing without my medical needs, or sleeping in a fully lit room, I called the front desk. An engineer, was promptly dispatched to our room. It turned out that a plug hidden behind the bed caused the problem; the engineer changed how the lamps and other appliances", "title": "Grand ageing property", "helpfulness": 1, "user": "Avidtraveler919", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 144078634}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "were plugged in, and had left by 12:30.", "title": "Is this really a RItz or a Marriott in Ritz clothing?", "helpfulness": 1, "user": "Nhcouple090909", "date": "October 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 143792159}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I don't know if that was the responsibility of the maintenance staff, of housekeeping, or someone else from the hotel, but I unfortunately the image I will take away from this visit wil be waiting for the building enineer in the middle of the night, rather than the well run wedding and catering staff.", "title": "Champagne upon arrival cant be bad...", "user": "Jessvan", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 143698323}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Spent one night here on business and stayed on the Club Level. The Club was rather a small room but all the amenities were there and the Concierge Camilla was extraordinary. If you are staying at this hotel ask for a room where the bed is not up against the hallway wall. Every time someone opens or closes their door the sound runs along the wall and wakes you up. We had dinner in the 10 Arts restaurant in the lobby. Save your money.", "title": "Great Service - Great Location - Property Just Ok", "user": "MotoMoto2364", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143267970}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 5, "variance": {"poor": 53, "average": 74, "very good": 161, "terrible": 26, "excellent": 221}, "aka": "Ritz-Carlton Philadelphia Hotel", "slim_ranking": 0.380952380952, "description": "Walk in the footsteps of America’s forefathers and become a part of history. Stay in one of America’s most venerable cities at one of the finest hotels in downtown Philadelphia and absorb the character of landmark buildings as you spend your day exploring Independence Hall, the Liberty Bell and other cultural treasures. Making its mark in a spectacular historic building, the luxury Philadelphia hotel’s location offers easy access to fine dining, upscale shopping, and Philadelphia’s business district."}