{"user_rating": 4.5, "review_count": 58, "name": "River's End Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We had reservations at the Timber Cove Inn. We drove along the cliffs in the storm and when we got there it was closed due to a power outage. I was wet, tired, and hungry and I couldn't stand the thought of the drive all the way back home.", "title": "A Romance with River's End", "helpfulness": 2, "user": "WineCountryLiving", "date": "April 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 102852071}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We found River's End on the way back-in Jenner. Evan told us we could look at the cabin before we", "title": "Great Sleep, Great Food", "user": "Krlos D", "date": "March 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101591989}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "took the room. We were so thrilled", "title": "Stunning, remote location to unwind.", "helpfulness": 1, "user": "EmilyCharlie", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79225727}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "by the romantic little cabin and the sound of the surf.", "title": "Bring warm clothes", "helpfulness": 1, "user": "tr4par", "date": "July 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72916238}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "They kept their kitchen open late", "title": "Best Birthday Ever", "user": "weyesowl", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59346413}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "What a treat! We stayed in cabin 2 (the best in my biased opinion) for a long weekend and had an amazing time. We have driven by this place for years on our way up to Anchor Bay and I am so glad we decided to finally stay here.", "title": "AMAZING experience!", "helpfulness": 3, "user": "kabonham", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125709178}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The rooms are tastefully updated with comfortable beds and couches and a charming wood stove and deck overlooking the gorgeous landscape. Everything is within walking distance. Watch the seals as you drink coffee on the deck. The room is equiped with everything you'd need for an \"unplugged\" weekend: wine opener, coffee and tea, mini fridge, etc.", "title": "Great get away for couples", "helpfulness": 2, "user": "Biochem", "date": "March 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 125651983}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "No cell service means just that: NONE at all. No TV. No phones. Just a perfectly quiet weekend.", "title": "Best Stay Ever", "helpfulness": 3, "user": "ldybg781", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123977582}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The restaurant is a whole other story: AMAZING doesn't begin to describe the food/ambiance/service.", "title": "Rustic, Romantic, for Ocean Lovers", "helpfulness": 2, "user": "ougeekgirl", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123807795}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I stayed in Cabin 4 for 2 nights (3/2 and 3/3/201annoya2). The view is nothing short of amazing looking out at the mouth of the Russian River. You can hear a variety of wild life and watch the harbor seals hunting for fish in the river.", "title": "Romantic hideaway", "helpfulness": 2, "user": "snooba", "date": "January 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123656023}, {"rating": 4.0, "title": "Spectacular!", "text": "I was a bit reluctant to stay here based upon several of the reviews I had read. I was so glad I took the gamble. My experience at River’s End was tremendous. I’m already anticipating my next stay there.", "helpfulness": 2, "user": "Muriel12", "date": "August 14, 2008", "id": 18957532}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "First, guests need to remember that these are, indeed, older cabins. They are not modern luxury suites (good luck finding anything like that on this stretch of the coast). With that said, the cabins are more than adequate. We stayed for two nights in Cabin 2 and one night in Cabin 4. Both featured queen beds (which were both immensely comfortable) and gas-flame stoves that were operated by a general thermostat in the room. We were there in August, but the stove would kick on in the wee hours of the morning, filling the room with warmth and light from the flame—very nice. The bathroom in Cabin 2 was quite a bit smaller than Cabin 4, but both featured sink, toilet and shower. Cabin 2 had two rather dated and ratty chairs in the living area. Cabin 4 had a much nicer leather loveseat. All cabins have coffee makers as well as spacious balconies that overlook a small bay and the Pacific. The views are amazing and the sunsets are unspeakable.", "title": "Absolutely Stunning", "helpfulness": 1, "user": "NoSlackers", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16367517, "likes": {"liked": "— Views", "disliked": "— Leaving."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We spent every morning and evening watching the wildlife from our balcony: hummingbirds, family of quail, osprey, ducks, pelicans, sea gulls, harbor seals.", "title": "Rustic and romantic.", "user": "Blaize76", "date": "December 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 11689872, "likes": {"liked": "— The view and the bed.", "disliked": "— No breakfast."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The cabins have no televisions or phones, which was a big plus for us. It allowed us to completely disengage. I do wish small fridges were available.", "title": "A little weathered, but the views are worth it!", "helpfulness": 1, "user": "Cyclone05", "date": "December 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 11685876, "likes": {"liked": "— Views", "disliked": "— Not much to do in town (Jenner), I guess"}}, {"rating": 3.0, "title": "Desperately needs a makeover!", "text": "I have only a few modest complaints: the cabins could have been a touch cleaner. Both had layers of dust in certain areas (baseboards in bathrooms, baseboards around bed, dust saturated the area under the bed). Linens were clean and bathroom facilities were clean, so the basics were covered. A more thorough cleaning and updating of carpet would make a big difference though. I’m surprised the owners aren’t more in touch with this. With such a beautiful location, pride of ownership would seem more apparent.", "user": "dlriver", "date": "October 14, 2007", "id": 10075523}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Stayed here for one night with a large group of girlfriends in July. The location is just gorgeous, as it overlooks where the Russian River intersects the Pacific Ocean. Although the cabins are very cozy, they are a little basic and run down. We stayed in cabin #2 which conveniently had a parking spot right next to it. Inside the cabin was one king sized bed, an oversized leather chair, a leather love seat and a fireplace all situated in front of two huge windows so you can take in the great views. The bed was unbelievably comfortable and I had a great night's sleep. The shades that cover the windows are the old vinyl roll up ones and they were actually a little tricky to use. They should be changed because they really cheapen the rooms, as does the dark brown carpet that makes the rooms look dingy. My biggest disappointment was with the bathroom which seemed more like a summer camp's bathroom than a $150/night cabin's. The extremely dated formica countertop was separating from the wall and there was water damage on the trim along the wall. The counter is also very low, abnormally low. There is only a shower, not a bath tub and anyone taller than 6 feet would be hard pressed to fit in it since the ceiling is low and slants down toward the wall as well. The bathroom is equipped with a small mini fridge, hairdryer, and coffee maker with complimentary tea. The toiletries are Bath & Body Works ones which were very nice. Since our group stayed in multiple cabins, we got to peak into the other ones and cabin #2 actually seemed larger than the others. Our cabin had more floor space which meant an air mattress could comfortably fit on the ground in case you need to sleep more people, which we did. Something of note is that River's End is meant to be secluded so there is no phone in the room, no wi-fi, no TV, and no cell phone service, so plan accordingly because this makes getting directions, planning meals, etc impossible. In summary, the location is above average but the accommodations themselves are just average. If the cabins underwent a light renovation, it would improve the property and increase the value for your money.", "title": "A Little Run Down", "user": "LuvSLO", "date": "August 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 136984004}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This was the perfect place for us to say goodbye to Route 1 after a leisurely two week trip up from Los Angeles. As other reviewers have pointed out the view from the cabins here is just terrific. Crashing waves, beautiful sunsets, - can't be beaten. The cabin we had (no. 4), was simply furnished but comfortable and there was a balcony to sit on to admire the view. If you are a television addict or need to use your mobile/cell phone however this will not be the place for you. Television not provided and no signal for 'phone either at the cabins or for some distance around. The restaurant is very good indeed and has an excellent wine list (as it ought to considering the area it's in). Would recommend for a short stay.", "title": "Wonderful view, excellent food, basic accomodation.", "helpfulness": 2, "user": "52Asher", "date": "June 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131395720}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Best view on whole trip to CA. Cabin was rustic, not fancy, but very comfortable and the view was absolutely amazing. We had dinner one night at River's End Restaurant and the service and food were wonderful, plus we caught sunset from their porch. We drove over from Napa along the Russian River, stopped at Armstrong Woods to see the Coast Redwood trees and stayed 2 nights at River's End. One day we drove up to Fort Ross and spent the day there, dinner that night at River's End and next day drove south on 1 to San Francisco, stopping in Tomales to eat oysters at Hog Island Oysters. The drive is exciting (a little scary for me, but some people would love it). I would definitely recommend River's End. We loved it.", "title": "Location, Location, Location", "helpfulness": 2, "user": "peacekjc", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131193845}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Best thing about this was the amazing view out the windows. Even in the rain the birds and crashing waves are terrific. Room is very basic, no closets, no TV, no telephone (and no cell service!) (maybe not bad!). Quite expensive for what you get. Restaurant also has amazing views and very good food - pricey though. Have to travel 20 minutes for breakfast. Restaurant is closed several days.", "title": "Fabulous view, fair accommodations", "helpfulness": 2, "user": "katiepenney", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129203343}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Simple but comfortable and peaceful small cabin with most beautiful ocean and river views. Comfortable bed. Bathroom basic, but acceptable. Attached restaurant was first class with excellent wine list and service. No breakfast available, so next time (and I would definitely go back) will bring some cereal and milk (refrigerator in cabin), and enjoy breakfast on deck, watching the birds and the seals. Wonderful place over all; highly recommended.", "title": "wonderful views, relaxing getaway", "helpfulness": 2, "user": "TobyNewYorkCity", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127834099}, {"rating": 1.0, "title": "lived here all my life", "text": "We stopped in on a whim since we've been by so many times. Parking was awful, we walked in, and literally looked up and down. My husband blonde blue eyed, me, black hair, brown eyes. He's Norweigian, I'm Amerian Indian. We were told to find a seat. We asked \" Is the balcony open?' we were directed to the balcony...\"there are plenty of seats!\". the door was shut behind us, 20 min. late we knocked on the door, we banged on the door, and the only way out was along the walk outside, by then we just left. Never again. And I tell ALL my friends. Thanks so much for treating the north coast lifetime residence so well. There's so many finer places to go. I'm sure you won't miss us, we SURELY won't miss you.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 26, 2004", "id": 2848550}, {"rating": 4.0, "title": "Best view in California", "text": "Stumbled across River's End Resort during our recent holiday to California, and decided to stay. The view is absolutely unbeatable, and our overrding memory was sitting on the balcony, watching the seals and pelicans whilst the sun set. We travelled all the way along the Big Sut coastline as well, but for us, this was the one place that we both agreed was just stunning.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 22, 2004", "id": 2772599}, {"rating": 3.0, "stay_parameters": "Stayed June 2004", "text": "The cabin itself was comfortable, although not luxurious, and perhaps in need of some touching up.", "title": "Great view, nice linens, quaint", "helpfulness": 11, "user": "etseqmts", "date": "June 21, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 2208270}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed in Room 5 at River's End \"Resort.\" The room is located in a", "title": "Great views, but bad news!", "user": "DrKeith918", "date": "June 29, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 4.0, "value": 1.0, "rooms": 2.0}, "id": 8024721, "likes": {"liked": "— Bed and bed linens", "disliked": "— Lack of cleanliness and upkeep"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "very private area just below the restaurant. There are beautiful water views from the deck, bed, and shower. Just don't look down at the river from the weathered deck (spotted with recent bird droppings), for there, abandoned along the banks of the Russian River, is an eyesore of an old, dirty recreational vehicle. It is quite a spoiler to an otherwise outstanding view. The expansive arcadia door which leads from the room to the deck was extremely difficult to open and close. Had the problems with Room 5 stopped there, however, I would not be writing this review. Loud conversations and frequent walking across the wood-slatted patio area above the room by late-dining restaurant patrons was very annoying. After the restaurant closed, employees made even more noise, as they completed their work by what sounded like dropping heavy objects on the floor and lumbering up and down the stairs within the two-level storage and preparation area. The noise finally stopped at 11:30 p.m. It was in the bathroom, however, where the greatest deficiencies were evident. Dust/dirt was caked everywhere along the edges of the bathroom vanities where the natural wood paneling meets the wood edging just above the tiled backsplash. The tops of all bathroom switchplates looked as though they hadn't been cleaned in years, one of the vanity lights was burned out, and cobwebs were attached to portions of the wood paneling. The bath towels were worn (one was frayed at the edges) and the closet area contained no clothes hangers. The most disturbing problem, however, and a real safety concern, was the shower. Water temperature fluctuated wildly from warm to icy cold to scalding hot --- instantaneously. Showering was, essentially, impossible. So severe was the evening showering experience, that my traveling companion chose to forego a morning shower. The bed and bed linens were the best features of the accommodations, but neither that nor the views are sufficient to warrant a stay at River's End.", "title": "what a view!", "user": "philbfam", "date": "May 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7556530}, {"rating": 5.0, "title": "Great seaside location", "text": "We stayed in one of the rooms under the restaurant on a Saturday night, after a day of geocaching along the coast. It is wonderfully relaxing and romantic to have a room with such an incredible view. Being able to see the beautiful river area, to hear and see the crashing surf, to be above the tree level and have birds flying even with your deck, to watch the seals pull up onto the beach, and to walk upstairs to a gourmet meal and watch an absolutely incredible sunset....all of this is a gift a couple should share with each other. While the Inn is not modern by any notion, who would want it to be? The Rivers End Inn is a great spot to stay.", "helpfulness": 2, "user": "TreeOfLife", "date": "August 19, 2006", "id": 5624683}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Very comfortable, in a pleasant neighborhood. And the view is unique, overlooking the river running into the ocean, with continual avian traffic back and forth. We had cabin 3: small but cozy. Restaurant was closed (Tuesday and Wednesday) but that encouraged us to get out on the road and look around. Perfect getaway -- no tv, no phones (well, we did smuggle in a laptop with DVD player).", "title": "Awesone view", "helpfulness": 3, "user": "phillycmc", "date": "October 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4045713}, {"rating": 3.0, "title": "No One At Home", "text": "Stayed in cabin 4. Large room with a couch, gas fireplace and deck. The comfy bed in front of a large picture window looking out over the Russian River joining the Pacific. What a wonderful way to fall asleep and wake up. No TV, but that was OK. The only suggestion is glasses other than wine glasses would be nice for drinking water. Overall a charming and romantic, and recommended place", "helpfulness": 1, "user": "686WarmSprings686", "date": "December 13, 2004", "id": 2877542}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Fabulous... be sure to see our pictures below.", "title": "Cozy with a Fabulous View", "helpfulness": 4, "user": "Lindora M", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118588297}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Jenner is where the Russian River meets the ocean, and there were lots of hikers and kayakers enjoying the spectacular surroundings. We noticed the cabins when we were in Jenner three and half years ago when we were passing through and ate dinner at the excellent Rivers End Restaurant.", "title": "Fantastic value for an amazing ocean stay", "user": "Nor-Cal-Travel-Gal", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117815093}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We came back through Sept 23rd of this year and were able to book one of the seven cabins that same day, for $149 for one day. There is not a lot of commerce in Jenner, so options would have been limited. Our cabin was about 450 square feet, with queen size bed (no kings offered), good-sized bathroom with roomy shower, leather loveseat, oversized chair and KILLER VIEWS from the French doors and large window.", "title": "Great price for Sonoma Coast", "user": "chef2rn", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117057010}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The cabins overlook the river where it meets the Pacific, and we watched birds and harbor seals enjoying the calm water from the privacy-screened deck that runs the length of the cabin, and has two Adirondack chairs. A mini fridge and coffee maker were also provided. Although the décor is rustic (natural pine paneling and tongue and groove ceiling), the bathroom floor is nicely tiled and the unit is very clean and comfortable. The carpet looks fairly new. There is a thermostat-controlled gas stove for heat if you need it. We didn’t care about the lack of modern communication conveniences, but some travelers might. (There is no TV, phone, or internet. To get a cell signal, you need to drive up the road 5 minutes to the beach on the other side of the river, where you get 4 bars on Verizon.) The restaurant is first rate and right next door, but you’ll need to drive to breakfast.", "title": "A Charming simple place, with an unbelievable view and a great restaurant", "user": "kdech", "date": "July 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0}, "id": 115399135}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We really lucked out scoring a last minute room at such a reasonable price—I suspect it was because tourist season had just ended. We want to come back for a long weekend in May with our kayaks, and will book in advance and expect to pay more. There is a lot to do within a reasonable driving distance, so I think the area is very busy in-season.", "title": "Fabulous experience", "helpfulness": 1, "user": "Emily519", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111518734}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 6, "very good": 16, "terrible": 3, "excellent": 32}, "aka": "River`s End Hotel Jenner", "slim_ranking": 0.333333333333}