{"user_rating": 4.0, "review_count": 604, "name": "Riverside Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Great location, well kept, but for some reason it attracts an older crowd, so I felt out of place. Excuse me, but I have preferences. Other than that, too bad that because of location they have to charge for parking.", "title": "It looked like a seniors citizen retired home", "user": "GRojas", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 113530218}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "When will we the day when Internet becomes like electricity or water ... an utility you don´t charge for, it becomes part of your overhead, and part of the roomrate??!", "title": "Super time in Ft. Lauderdale and especially strolling Las Olas and riding water taxi!", "helpfulness": 1, "user": "Rivetblue", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 113210687}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Really terriffic weekend. My best friend and I had tickets for a concert at the Broward Center for Performing Arts so we decided to make a weekend out of it. The hotel is so convenient, walk out the front door and you're strolling through the great shops, galleries and restaurants of Las Olas. Walk out the back door and you have the water taxi and the pool is just across the (quiet) street.I hadn't been to Ft Lauderdale in 10-12 years, things have changed a bit along the beach, but the area near Las Olas is terrific. Lots to do, clean and everyone was very friendly. The hotel is really pretty. We stayed in the newer section. The only thing I would suggest to Riverside is to replace with better beds. They were comfortable, but we expected much better quality and in keeping with the hotel ammenities they need to be plusher. Overall very happy and would definitely visit again.", "title": "Riverside was the ideal spot for a school reunion!\"", "user": "Valgate", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113104294}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "A diverse group from across the country got re-acquainted in Ft. Lauderdale for the perfect weekend! Food in the hotel was fabulous - the lobby bar accomodated our crowd with style, the pool was relaxing and the perfect ambience, the rooms were quiet...it was PERFECT! Those that wanted to hit the beach did so easily. Those that wanted a boat tour went by the rest of us in the pool and shouted along the way - it was great! The shopping was perfect - some stores even open on the morning we left (Sun.) to catch that last minute fun item. Several parking options for those driving. Walking distance to a 7-11 for those wanting to grab a non $5 bottle of water! Safe to walk at night -- found a terrific Greek restaurant that sat all 27 of us last minute in a huge row and fed us a veritable feast! For an\"older\" hotel, this was every bit as elegant, clean and well-run as any high-end franchise. Loved it and I am very picky!", "title": "Nothing Special", "user": "BocaDeb", "date": "June 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 112441313}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The bartender in the lobby bar on Friday night handled our large crowd with a smile and finesse -- it all went off without a hitch.", "title": "Loved this hotel", "user": "bolt17", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 112257230}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Stayed at the Riverside for 5 nights after booking a package on Expedia. The nonrenovated rooms are not too impressive and there is an unpleasant perfume-y smell that pervades, but it was kept clean and staff did a good job otherwise. Don't expect a free upgrade no matter how empty the hotel is. Great and plentiful hot water in the showers. Location is good -- right on E. Las Olas, amidst the tony little shops and restaurants -- but could be a bit much if you are looking for something low-key. Beach is nice and easy to get to -- not more than a 5-minute drive. I probably wouldn't stay here again but it's fine if you can get a good deal.", "title": "Just OK", "helpfulness": 3, "user": "linda528", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6516980}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Stayed in an exectutive tower room in December 2006.", "title": "Great location, Great Stay", "helpfulness": 5, "user": "JuanEsperanza", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6473505, "likes": {"liked": "— Location", "disliked": "— Check out the pool by the river"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The hotel has a great location on Los Olas Blvd, close to many good restaurants and directly on the New River.", "title": "Great Location, nice staff", "helpfulness": 1, "user": "der_badener", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6307988, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Rooms are large and comfortable, views are nice from the upper floors. The pool is located along the river and was rarely used when I was there - a great little retreat.", "title": "Wonderful property", "helpfulness": 9, "user": "livewell2", "date": "November 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6052881, "likes": {"liked": "— location", "disliked": "— price, but worth it once in a while"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The hotel is convenient to downtown, the river and Los Olas Blvd. The beach is a 15 minute drive. I would pick the Riverside over any of the beachfront hotels that are at the same price point. The Riverside has a much better value and facilities and the beach is not far away.", "title": "Can't wait to come back!", "helpfulness": 9, "user": "Imatravler", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5800032, "likes": {"liked": "— Beautiful, luxurious surroundings. Relaxing view from the terrace.", "disliked": "— No negatives here!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I ended up staying at this hotel through Priceline. After reading mixed reviews I was not sure what to expect. While I can only comment on rooms in the Tower section, everything about the experience was fabulous. The best feature for us was having the Cheesecake Factory literally part of the building which we didn't realize until getting outside and walking around. It is not direct access but still part of the building. We had an awesome pre-cruise stay and will most certainly go there again. Do not hesitate to book this hotel. It is a beauty and the service was outstanding and friendly.", "title": "Great Hotel. Do not hesitate to stay here.", "user": "TPodmenik", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103960350}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Loved the hotel. Booked through priceline", "title": "pre cruise stay 4/2/11", "user": "fnmWisconsin", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103693485}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Hotel was very nice, staff at front desk were nice too. Got there around noon, and room was available immeadiately. Went up to the room for a quick change then a walk to Ft Lauderdale beach.", "title": "Great place to stay!", "user": "DebinCarb", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103399531}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Was was a little longer than I thought it would be, but very nice. If you get tired you can catch a cab anywhere along the way.", "title": "Riverside Hotel a nice pre cruise stay", "user": "randy48", "date": "April 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 103179894}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Ft Lauderdalebeach was awesome. Very clean, no rocks, lots of bars, restaurants and gift shops. Ocean water was warm.", "title": "Love this hotel", "user": "GRNCHLE", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103090044}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I spent two nights at the Riverside Hotel in Fort Lauderdale about a week ago. Our trip to Fort Lauderdale was for the express purpose of going to the King Tut exhibit at the Fort Lauderdale Art Museum - thus, our selection of this hotel which is within walking distance of the museum.", "title": "Kind of a mixed bag", "helpfulness": 8, "user": "aerofl", "date": "February 23, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4497428}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "We drove from our home on the Southwest coast of Florida and had no difficulty finding the hotel on Las Olas Blvd., though we were a bit confused that the actual car entrance is on the block behind the hotel, not directly off of Las Olas which only has a pedestrian entrance. No matter, just a few extra turns. Valet parking was efficient and friendly. It may have been a mistake, but there wasn't a charge for valet parking on our hotel bill at the end of our stay.", "title": "No Problem at the Riverside", "helpfulness": 4, "user": "captfred", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4468563}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Checkin was very quick, though the hotel lobby seemed to be crowded during our entire stay with pre- or post- cruise passengers and all their luggage. Our room was in the executive tower on the 10th floor, above what was a 7 or 8 story parking garage.", "title": "beautiful hotel", "helpfulness": 3, "user": "love_child56", "date": "February 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4455501}, {"rating": 1.0, "title": "Location only", "text": "The room was spacious and decorated in the ever popular Tommy Bahama tropical style. The room was clean and had all the usual hotel elements - king bed, armoire with TV, mini bar, small table with two chairs, desk, etc. We had a small balcony looking out towards the Atlantic, though the actual view was more of the kitchen vents on the roofs of nearby restaurants. The bathroom was large and well supplied with towels and toiletries. Hot water and good water pressure in the shower.", "helpfulness": 3, "user": "SavvyNewYorker", "date": "January 31, 2006", "id": 4399671}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "The location of this hotel is excellent and was perfect for our needs. We parked the car and walked everywhere - King Tut exhibit, restaurants and shops right outside the front door. A very lively part of Fort Lauderdale, especially on the Friday and Saturday nights we stayed. Lots of outdoor dining on Las Olas and a wide selection of cuisines at the restaurants. If you want to watch the street scene, reservations for outdoor dining are a must.", "title": "Stay in the new towers", "helpfulness": 7, "user": "mtinga", "date": "January 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4391502}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I stayed in a tower room, 2 queens, for 3 days ($139/night) and was pleasantly surprised. It was roomy and the bathroom was clean and spacious. I dined at two of their restaurants and found it to be fresh and delicious. All of the staff including the cleaning lady, front desk and restaurant waiters were very friendly and helpful during my visit. I would stay at the Riverside Hotel again.", "title": "Had a wonderful stay", "helpfulness": 5, "user": "tkatrip", "date": "August 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5579602, "likes": {"liked": "— location", "disliked": "— not being within walking distance of the beach"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "I keep reading about these people who had views, and I wonder why I had no view. Literally, no view. The rooms were painted with a frosted color and the windows did not open. (I had 2 rooms and both rooms were like this.)", "title": "I'm jealous!", "helpfulness": 8, "user": "Osnab", "date": "April 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4995583}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "I had major problems with the AC not working in the first room, and I had to call the front desk 3 times in a period of 6 hours. The first 2 times they assured me maintenance would come up \"right away\". The 3rd time they insisted he had come and fixed the problem. I had left a note for the mtc man in the door, and the note was exactly where I left it. I don't care for liars.", "title": "Mixed bag", "helpfulness": 7, "user": "Sue W", "date": "April 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 4983284}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I went in person to the front desk after the lie and asked to be moved to another room, which they did do. While the AC did work in this room, the toilet did not flush. I asked again for mtc to come to my room, but after 30 minutes, he'd still not come and it was around 10:00P and I was ready for bed.", "title": "Great hotel", "helpfulness": 6, "user": "tampa,fl", "date": "April 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4981469}, {"rating": 1.0, "title": "Never again", "text": "In both rooms, by the way, there are sheer drapes and heavy drapes, but the heavy drapes don't close at all (there's no string or pully - they are designed that way, so the sunlight was streaming into the room at 6:30A the next day. Way to spend your vacation, hu?", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 5, 2006", "id": 4939104}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Just returned from a wonderful weekend at the Riverside Hotel. Nice change from the beach area, and fun to walk to shops, King Tut exhibit at the art museum and restaurants. Had a great dinner at the Grill Restaurant at the hotel-pricey but excellent service and good food. Our room in the tower overlooked the city and the New River, and we enjoyed coffee on the balcony as the sun came up and we watched the city come alive. Fun also to look out at the lights and relax on the balacony before bed. We booked room directly with the hotel which guaranteed a tower room for only $4.00 more than the website which goes through Utel Hotels, and was better deal than discount websites which had only non balcony rooms in older part of hotel. Our rate of $224 first weekend in March included continental breakfast. Hotel personnel were friendly, efficient and responsive. Heated swimming pool overlooking New River and it was fun to sit at the pool and watch the yachts go by. Was a 15 minute drive to the ballpark to watch Dodger Spring Training game and water taxiis stop about a block away from hotel.", "title": "Wonderful Weekend Getaway at the Riverside Hotel", "helpfulness": 5, "user": "Lovemypooch", "date": "March 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4588107}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Previous reviews made mention of the poor condition of the rooms in the main hotel, they were exactly right. Unless you are guaranteed a room in the tower building, do not stay at this hotel. The room felt like a college dorm; cramped, terrible furniture, tiny bathroom, noisy, and dirty. While the location is good, there are other options in this area that seem much more worth the $200 this hotel charges. As a regular traveler, I've seen a lot of good and bad hotel rooms; this was one of the worst. The hotel informed us they are in the process of rennovating all the rooms, but when we asked to be moved they told us it would cost more. The one and only redeeming quality was the pool, which was pretty and sat right along the river. However, I will never stay at this hotel again and would discourage anyone else from staying here either.", "title": "Not worth the money", "helpfulness": 6, "user": "142Travel", "date": "March 6, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4586679}, {"rating": 2.0, "title": "For the money you would think...", "text": "Just stayed here on 3/2 to 3/4/2006. Was here about 5 years ago before it grew to 5 times the size! Let me go with the few good things first. Tom at the front desk, friendly even though he was confused by the reservation/point of sale computer system, he has a great attitude. Great friendly room service. Great courtious house keeping staff. Great swimming pool along the river. Now the bad stuff...bell staff very slow. Could not wait any longer so we pack muled out of our room, production equipment and all. I travel as a tour manager for a musician. Brand new mega story tower addition with no fitness center. Instead they tell you to walk 4 blocks away to a stinking little place with too many people stuffed in it and then you have to pay $7.50 use it plus .50 cents a towel. Not to mention that the walk to the place is through a bad scetchy neighborhood. Tells me that the Riverside has a disregard to your safety. I've been to Holiday Inn expresses that have free passes to neighboring fitness centers or they have one of their own. No late night valet parking. Front desk service very slow.", "helpfulness": 4, "user": "HubieJones", "date": "March 5, 2006", "id": 4584456}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Will most likely stay here againg because I don't choose my hotels. The whole place is under staffed.", "title": "a nice place", "helpfulness": 3, "user": "laura5969", "date": "March 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4568804}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "the front desk staff seems a little unorganized but friendly. the room was small but comfortably furnished and clean. the bed was very comfortable. however the elevator is the smallest one i have ever seen. the pool is really heated and private it is across the street gated and locked poolside menu is available by phone at the pool. the hotel is a great location on los olas blvd. there is a gondola ride in the evenings available by the stork cafe. also a few blocks up is florida diner open 24hours good eats and cheap too huge portions. we ate at several of the restaurants on the blvd all were excellent. it is fun just to people watch and sit out front at the bar/restaurant excellent food. very nice staff. loved the bath toiletries they smell so good. would stay again.", "title": "Riverside was OK", "helpfulness": 5, "user": "thurschild", "date": "February 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4517206}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This hotel is located amongst the great shopping area of Las Olas Boulevard, so the downtown location makes it perfect if that's what you're looking for. Definitely stay in the Executive Tower rooms - they are the newer rooms and are wonderful. I didn't eat at the restaurant in the morning - found a quaint coffee shop instead, but the patio was filled with patrons that came in off the street so it must be good.", "title": "Beautiful downtown location", "user": "Baygirl23", "date": "April 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103048857}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "For a pre-cruise night we booked the Riverside on hotwire so didn't know what to expect. Well it was a fabulous little hotel in a fabulous downtown area of Ft Lauderdale. Built in the 1930's - what a great spot. Very comfortable rooms - slept great, and very quiet - a big plus. Staff were very friendly and helpful. Another plus - you can get to the parking garage from an elevator inside the hotel.", "title": "Great little hotel in a great area ...", "user": "Diorbum", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101191804}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Walk out the front door onto Las Olas and the street has all kinds of restaurants, bars and cafes with outdoor patios - we took advantage of the patios and enjoyed.", "title": "great hotel no complaints", "user": "michael186411", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101157116}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "This hotel is definitely worth revisiting, and so is the area.", "title": "Great pre-cruise hotel", "user": "ojaidenny", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100909008}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Kate G", "title": "Great location, comfortable hotel.", "user": "KT-BRT", "date": "March 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100361147}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Riverside Hotel is in a great location. It is within walking distance to restaurants and small shops and a short distance from the beach. The hotel does not have great signs directing you to the main entrance to the hotel. Our room was very clean, but on the small side which made it a struggle to find space for our 2 small carry-on sized luggage. Upon checking-in, we asked the woman at the front desk (unfortunately, I can't remember her name) if there was any way she could give us a better room. Her response was to laugh and say, \"Not for the price you're paying.\" The bathroom was very small as well. It did not have a full tub, only a stall shower. The shower was so close to the toilet that while sitting on the toilet, my legs were practically in the shower stall. (Sorry for the graphics) The windows did not have full curtains, so the sun woke us up early every day. Also, our bed was extremely saggy in the center of the mattress. Parking is not free, nor is the use of the in-room refrigerator.", "title": "Fair Experience Overall", "helpfulness": 1, "user": "KCH_11", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 111465853}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I wasn't expecting much from this hotel when we booked on Hotwire for a one night pre-cruise stay. I must say we were pleasantly surprised when we arrived in the nice lobby and other public areas of the hotel. The front desk clerk (Terry P.) made us feel very welcome and gave us some great tips on dining and shopping in the nearby area. All other staff members were also friendly and polite during our stay. From previous reviews we knew to ask for a newer Executive Tower room which was worth the small upcharge. The room was large and spacious with a nice balcony and view. The room and bathroom were very clean and the bath products were high quality. The location was what set this hotel apart from others we've stayed at in Ft. Lauderdale. It is on a prime dining and shopping street which provides great choices and activities. We will definitely consider staying at this hotel again.", "title": "Classic Hotel in a Prime Location", "user": "xxx123", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109514090}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our room in the old 1936 building was small but nicely furnished and very clean. Equipped with an iron, hair dryer, tv, radio, coffee maker, basically all we needed. From our window we had a nice view of Las Olas Blvd which is perfect for a stroll, eating or shopping. The service was amazing. Everyone and anyone who worked at the hotel who we bumped into was courteous and helpful. The lobby is beautiful and the elevators and hallways clean and nicely lit at all times. It has two small bar areas and a very nice restaurant. The pool area was perfect for just my husband and me and it would be just as good if we brought our grandaughter with us. Though there is no attendant plenty of clean towels are available and the area was very clean. You can order food or drinks from a phone by the pool. The view from the pool is also very nice since the hotel is on the Intracoastal and you can see some very expensive yachts going by. It was a perfect romantic get away for us and we hope to return soon. The only reason I did not give it 5 stars is because the room was small but it certainly deserves the 4.", "title": "Excellent stay, great old fashion hotel", "helpfulness": 2, "user": "daskysdalimit", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107691274}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I would tell anyone who is heading to Fort Lauderdale to definitely come the the Riverside Hotel. It is the most historic hotel in Fort Lauderdale and is probably in the best location of any of the hotels in the area. Walk out the front door and you are on the famous Los Olmos Blvd. Los Olmos is the main street in the downtown area and has all the stores and restaurants you will ever need to see. At the back of the hotel are the riverboat tours. The rivertaxi's are good value but it becomes boring when the staff constantly talk about travellers leaving tips. Everyone in the hotel is most helpful from the concierge, bellmen and front desk. They have a great restaurant which is open for breakfast, lunch and dinner right at the front of the hotel. Our room had fantastic views from the balcony this is the best place to stay. Definitely would recommend to everyone.", "title": "Excellent hotel in fantastic location.", "user": "CheshireLyn01", "date": "April 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 105815115}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We arrived after a long drive from St Petes checked in at 3pm to be told the room would not be available for approx 45 mins, before I could comment I was offered coupons for a free breakfast and a drink at the bar, a nice gesture but slightly disappointed we had to wait, the lobby is very impressive, once we got to the room we were not disappointed we had booked a tower room with a corner balcony the views were amazing, We loved the pool and enjoyed watching the boats sail by, like others have mentioned the Cheesecake Factory next door had great food at very reasonable prices however they did charge 9 dollars for a glass of wine, we loved the location and the classy shops close by, I went to the sunglass/optician next to the hotel to ask if they could fix my sunglasses, they guy Scott was great and after around 30mins of fiddling about he managed to fix them like new and said no charge. All in all great hotel, wonderful location and would highly recommend to anyone staying in the area.", "title": "WONDERFUL HOTEL", "user": "kimdowie", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105664366}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 3.5, "variance": {"poor": 48, "average": 67, "very good": 225, "terrible": 27, "excellent": 237}, "aka": "Riverside Fort Lauderdale", "slim_ranking": 0.255639097744, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}