{"user_rating": 4.5, "review_count": 318, "name": "Riverwalk Vista", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "After the fantastic reviews on Tripadvisor we chose to stay in San", "title": "Great location too much noise", "user": "BostonWagga", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 68200841}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Antonio for a long weekend. The Riverwalk Vista is a great location for", "title": "Historical pleasure", "helpfulness": 1, "user": "oldhickory5", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67736596}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "seeing the tourist attractions (in much over-rated city of San Antonio).", "title": "Enhanced my trip", "user": "JNW", "date": "June 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66550561}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Our room (Hemisfair Vista Queen Standard) overlooking the Tower of the", "title": "Comfort, location and atmosphere!", "user": "JPandF", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66101125}, {"rating": 4.0, "title": "Cozy place in the middle of all the San Antonio life! Best Location!", "text": "Americas was comfortably furnished with rustic furniture.", "user": "VintageGirl2010", "date": "May 26, 2010", "id": 65399654}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Quaint hotel, but the entrance is a little odd. You have to be buzzed in the first time and then you take the elevator or stairs up to the third floor to check in. There is a desk on this first floor, but it didn't seem to be manned by any staff, which doesn't seem very welcoming. This is a historic hotel so it could be that they are just working with the space that they have. Our room was nice, but there were a couple of negatives. Being a historic building, we had a huge column in the middle of the room. It added character to the room, but it was in such a central spot that I was concerned my husband would walk into it in the middle of the night getting to the bathroom. We used his laptop as a night light so that would not happen. Huge floor to ceiling windows were nice, but they needed to be cleaned. The wood floors were pretty, but creaked quite loudly in some areas and there were 2 spots were the nails had come up - very dangerous when barefoot. The best thing about this hotel is location. It is fabulously located right across the street from the Riverwalk, about a block form the Alamo and walking distance to the convention center. Despite the few negative things I mentioned I would probably stay here again, just because of the location.", "title": "Fantastic Location, but some concerns", "helpfulness": 2, "user": "WHERESWAUGH", "date": "November 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88137926}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I spent three nights at the Riverwalk Vista while visiting San Antonio for a professional conference. I selected the hotel based on its Trip Advisor reviews. This is a very nice, small hotel in an historic building with a lot of character. It is not immediately on the river, but overlooks the Riverwalk. It is also very centrally located and is close to the convention center.", "title": "Lots of Character", "helpfulness": 1, "user": "Saltrat", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85986968}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The entire hotel has wood floors, including the rooms, which sport giant 10' windows. There are old photos of San Antonio and the property throughout the property. The bed was very comfortable, the linens were high quality, and it had nice amenities like free bottled water in the room, continental breakfast in the morning, cookies throughout the day, and wine in the early evening. As mentioned above, it is a small hotel and the office was typically staffed by one (friendly and helpful) employee.", "title": "Means well - but not there yet", "helpfulness": 1, "user": "1ellabella", "date": "October 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 82947232}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "My only criticism is that, while the hotel has free wireless, it didn't have the juice to reach me in room 302. There is also wired internet in the rooms, but that didn't help me use my iPad.", "title": "Perfect little hotel in the middle of riverwalk area", "helpfulness": 1, "user": "kelangst", "date": "October 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 82897316}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "If I return to San Antonio, I will stay here again.", "title": "Lots of rich wood detail, Lots of noise, too", "helpfulness": 2, "user": "NewHavenTraveller", "date": "September 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 81524179}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I stayed here for 5 nights during a professional conference and chose it due to reviews on TA. The inn exceeded all my expectations! It is right in the middle of attractions in downtown San Antonio, overlooks the Riverwalk (just cross the street, go down the stairs and you are there)! The convention center is a short walk away, the mall one block up. The rooms have character but do not leave out the comfort; the staff go out of their way to be helpful. Breakfast was delicious, with choices of hot or cold food. As I needed to go to my conference some mornings before breakfast was set out, the inn keeper gave me yogurt, fruit and an oatmeal bar to keep in my fridge in the room the nights before, so I had a decent breakfast. I did not find the inn any noisier than many other places I have stayed; the white noise machine lulled me to sleep easily each night. It's a beautiful place to spend the night in a historical city!", "title": "A gem of an inn with a great location!", "user": "flapenny", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81119756}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "What a great hotel! It is right across the street from the Riverwalk. We had a great view from the Hugman Suite. Each day there is a fresh breakfast from 8-10 with quiche, cereals, homemade bread, and more. There are cookies at 3 and wine at 5. The room was amazing with a fantastic bed, white noise machines and a beautiful bathroom. The service was outstanding as well - everyone who worked there was so friendly and helpful! Would recommend this place to everyone!!", "title": "Could not have asked for better hotel!", "user": "xiphoid76", "date": "September 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80201575}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Recently stayed overnight in this lovely hotel and will return to it each time I visit San Antonio. The doorway entrance is somewhat hidden, but if you follow the directions they provide, you can find it easily. We followed their instructions to park in the nearby loading dock to drop off our bags. After they rang us into the building, we were greeted as we exited the elevator and taken directly to our room. We then drove one block away to the parking garage recommended by them. The garage was so close that upon check-out, we just wheeled our suitcase directly to the car from the hotel. At the hotel, the 17 foot tall windows are as wonderful as other reviewers describe. The fresh baked cookies, the wine in the early evening and the breakfast the following morning made us feel as if we were staying in someone’s home. The leather furniture in all of the sitting areas throughout the building were welcoming and we almost decided to stay indoors rather than visit the Riverwalk. But we eventually did, and it is a quick walk across the street and down some steps. You can’t get any more convenient than that. We had been concerned with street noise, but the provided white noise machines worked perfectly. The bed was one of the most comfortable I've found traveling causing us to sleep in late the following morning, something we never do. Throughout the building, there were books to read, games to play, antiques to explore, even classic movies which could be checked out and watched in your room’s DVD player. The shower was refreshing and the provided bath amenities were luxurious. All in all, this is a wonderful and unique hotel that offers a great value in a fantastic location.", "title": "Pack your bags and get here as quickly as you can", "user": "TravelingCheryl", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80094511}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "my husband and I stayed here for one night in August and had a totally fabulous time! The staff were charming, friendly and professional. The rooms are gorgeous,absolutely beautiful and Huge! Lisa recommended an amazing restaurant (Boudros)to us, on the riverwalk- best meal we had in our three week road trip.Some reviewers have mentioned parking problems- really don't understand this- its really a minute directly across the road to the car park- Not a problem! Cannot recommend the Riverwalk Vista highly enough- thank you for an amazing stay! Sue and Dave", "title": "fabulous!", "user": "MillyA", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77956764}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Took a road trip from Dallas to San Antonio and back for five days and this was the best hotel we stayed in. Loved the hardwood floors, tall ceilings and big windows. Very clean with nice touches, like the old-fashioned teddy bear and the live fish on the desk. Even the bathroom had style. The decor everywhere was beautiful; truly southern without being kitsch. The breakfast was very good. And the location is perfect for a tourist, right next to the riverwalk and the alamo. Only drawback was that parking is not available, although the lot across the street is not far and isn't too expensive. Will always stay here if I'm in San Antonio.", "title": "Wonderful!", "user": "travelingdino", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77388171}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "My sister-in-law & I spent 2 nights at the Riverwalk Vista & couldn't have had a better time. I love older, historic hotels so this was just perfect for us. It was just around the corner from the Alamo and across the street from the Riverwalk. Since our visit was so short we wanted a place that would allow us to walk everywhere & this was it.", "title": "Great Time", "user": "BopeepHarrison_TN", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77207307}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Others have stated problems with parking - it was a little awkward but easily handled by two 60+ women. The staff at the hotel was friendly and helpful. When the fridge in our room wasn't working they told us to just use their kitchen fridge. The common room where we had our breakfast & wine was inviting & allowed us to meet & visit with other hotel guests.", "title": "Absolutely lovely!", "helpfulness": 1, "user": "AnnaBKR", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75353400}, {"rating": 5.0, "title": "Clean, cozy and comfortable", "text": "I like when the hotel itself is part of the travel experience - the Riverwalk Vista was just that and more!", "user": "MiraFrank", "date": "July 29, 2010", "id": 72864175}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Riverwalk Vista has all the charm of a bed and breakfast - without the tackiness. It has the cleaniliness, decor, and amenities of a luxury hotel - without the high price. The staff was lovely and not at all intrusive. The breakfast and welcome cookies were delicious. Some reviewers speak of street noise, but this was not at all a problem for us. (White noise machines were in the room if a problem had arisen.) Parking was a bit of a hassle (you have to park in a deck a half-block away), but with the wonderful location of the hotel, you can't expect to park onsite. My husband and I adored this place and will definitely stay here again if we ever are again in San Antonio.", "title": "Great hotel right off the river walk.", "user": "stubaby68", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70930217}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great hotel/B&B. Unfortunately, I was only in for the night and spent a total of three waking hours their, but I can attest to the fact that the bed was extremely comfortable, the room was clean-clean-clean and the hotel itself is beautiful. I will definitely be back. The staff was very warm and accomodating, I checked in late at night and early in the morning, and there was someone there, ready to deal with my demand for hot tea. It is true that due to the location and age of the building there is some street noise to deal with, but between the air conditioner and the white noise machine, I didn't hear anything and slept like a baby (but I live downtown in a major US city, so maybe I am more accustomed to noise). Also, the proximity to the riverwalk (as well as its actual location near the riverwalk-- really, it is in a prime spot) both explain and justify any street noise. As for the crickets, there was a dying cricket in my room, but we decided to ignore each other. Finally, the hotel/B&B does not have a fitness center or pool, but apparently they have worked a deal out with a local hotel to use its facilities. In all, I highly recommend this little gem and will be back! Anyhow, give this place a chance and if you stay there, don't forget to read and then sign the guest books (located in each room)-- some of the prior guests were very descriptive about what they enjoyed about the room, hotel and city!", "title": "Fantastic Hotel with one BIG cricket problem", "helpfulness": 1, "user": "emilyq", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 70665510}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 3, "variance": {"poor": 6, "average": 18, "very good": 69, "terrible": 8, "excellent": 217}, "aka": "Riverwalk Vista San Antonio", "slim_ranking": 0.028818443804}