{"user_rating": 4.5, "review_count": 7, "name": "River Rim Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was our second time staying at this property in the same cabin as last time (Grove 2). We enjoyed our stay, but we were a bit disappointed by the property this year. We found the cabin to need a bit of deep cleaning (spider webs on light fixtures), cracked plastic drinking cups, a few standard items that should be in a stocked kitchen (like dish soap), but were not available. I don't mind bringing some items myself, but when I pay over $200 a night, I expect the little things to be there. Also, pool was full of debris when we used it, and closed completely one of the days we were there. The pool is one of the main reasons we choose this property. May I suggest to the management to remove the rose bush full of thorns that sits right next to and hangs over the pool. The bench that is built into the pool for sitting along the side cannot be used because the thorns are in your face and hair. The mattresses the room with 2 double beds need to be replaced. Very worn out and uncomfortable. We enjoy this property and may stay again, but will probably book elsewhere for next year. Overall, it is a very good choice for this area with modern accommodations, and close river access.", "title": "Another good stay, but a few disappointments", "user": "Tessa C", "date": "July 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169170057}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "It's important to keep everything in perspective. You come to Concan to float the river. The rooms seem a little expensive, and the cabins could provide a few more amenities (like a bath mat), but it was still a great time. Our rooms were walking distance to the Frio and the folks at River Rim are awesome.", "title": "Float the Frio", "user": "Harry M", "date": "July 13, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 167421802}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stay there several times of the year and are never disappointed. It is always clean, the staff is pleasant and ready to help plus I can take my dog as long as we keep him on a leash. I used to spend the summers on the Frio River and it is always a stress reliever and very relaxing for me to be close to or in the water. Everything is within walking distance and VERY family oriented.", "title": "great place to stay any time of the year", "user": "smartin62", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165645940}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "River Rim exceeded our expectations by a long shot. We stayed the week after Labor Day; so, we got off-season price. We stayed in \"The Back Porch,\" and it was very roomy w/a kitchenette. Everything was super CLEAN! They didn't charge an extra fee for our dogs which completely sold us. We could walk with our tubes 9/10 mile to Mager's Crossing to put in and get out @ our room about two-hours later. It's only a short walk to the river from any of cabins on the property. The ONLY negative (and I hate to even mention it because everything else was so wonderful) is the matress was a little saggy. We wouldn't have even noticed if we weren't 50 years old. :)", "title": "Perfect & Pet-friendly!", "user": "HeatherMacy", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 140297845}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We travel to Concan, TX every year for a few days of relaxing on the Frio River. We always rent a cabin, and this year decided to try River Rim Resort on the Frio. Reservations were made only about 2 months prior to our stay, and we went during the high season, so cabin was a little pricey. We stayed on a Monday-Wednesday night in a 2 bedroom, 2 bath cabin - Grove 2. We paid about $250 per night, and a 3 night stay was required.", "title": "Great stay on the Frio River", "helpfulness": 6, "user": "Tessa C", "date": "August 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136736672}], "location": {"country": "United States", "city": "Concan"}, "variance": {"poor": 0, "average": 0, "very good": 4, "terrible": 0, "excellent": 3}, "slim_ranking": 0.3}