{"user_rating": 4.5, "review_count": 88, "name": "River's Edge Motel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "nice hotel loved the river,friendly staff.beds wre realy hard and pillows did not sleep well at all was ready to leave,other than that it was nice.", "title": "nice", "helpfulness": 1, "user": "sandy11santee", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 125248422}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Older hotel, but clean and bed very comfortable, You can walk out on balcony that looks over the water", "title": "cherokee stay", "helpfulness": 2, "user": "jriceyork", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123322155}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This is actually one of the cheaper places to stay in town, and is also one of the nicer places I've stayed here.Clean rooms and bathrooms, nice staff, and a WONDERFUL VIEW! We were down the street so we missed the elk walk by across the river, but that did not stop us from sitting on the balcony for hours talking, even in december! When we head back to Cherokee we WILL stay here. We didn't go to the casino, we went for the shopping, which there are shops right across the street, and more within talking distance.", "title": "WONDERFUL!", "helpfulness": 1, "user": "qryztufre", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122364938}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Stayed here at the beginning of a leaf peeper trip in September. The room was clean and comfortable. River view is wonderful. Road is quiet at night, so no worries there.", "title": "Great River View, Clean, and Comfortable", "helpfulness": 3, "user": "SanJoseLuv2trav2", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121597950}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Really loved, loved being on the river like this. Sat on my balcony and just drank it in.", "title": "Loved being on the river", "helpfulness": 2, "user": "LoveLife75", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120313782}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Pros: location, price, clean, decent overall look (not overly 'motel-ish'), nice deck on river, walking distance to shops and restaurants.", "title": "Not the ritz but great location and value.", "helpfulness": 1, "user": "Countess24", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116269206}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Cons: not the 'I'm on vacation' feel that a hotel has, no pool, river in front not good swimming/wading, parking is right ON the road (about an inch or two from end of car to road).", "title": "Clean and comfortable for an affordable price", "helpfulness": 3, "user": "dembert65", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115469353}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "For one night, it worked for us. Not sure if we would do a full week.", "title": "Locally owned", "helpfulness": 3, "user": "aspenbc", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114905991}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "My family and I stayed at River's Edge Motel for one night on July 11, 2011. I chose River's Edge based on the positive reviews from previous Trip Advisor guests. I was not dissapointed. The room had been recently remodeled and was very nice. The beds were comfortable and the room was very clean. The balcony looking on to the river was awesome. The free wifi worked well from our room. The room had a small fridge and a coffee maker which is all my family requires for a short stay. The motel is conveniently located near Cherokee attractions and shopping (we were in town for the Cherokee Indian attractions). I would definitely choose this motel for future visits and would plan on spending more time in Cherokee, NC in order to enjoy more of the attractions. River's Edge is a nice place to stay and I would definitely recommend this motel to family and friends.", "title": "Wonderful and clean!", "helpfulness": 1, "user": "RockC218", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 113379176}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "A nice, locally owned \"motel\". You would probably pass right by, looking for a chain hotel, but this is a nice place to stay. It was clean and quiet and on the river. It had a balcony overlooking the river.", "title": "Great Motel - No Complaints", "helpfulness": 3, "user": "texasbass", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113260173}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We booked this hotel for our romantic weekend trip because the rooms at Harrah's were full and we are so glad they were. The room including bathroom were spotless. The bed was so comfortable and there were plenty of pillows. The sound of the river rushing by at night with the sliding glass doors open for both sound and breeze was great. We loved sitting on the balcony at night and listening to the river and watching the moon rise over the trees. My husband loved that he could fly fish right outside our room and I loved that I could watch him and read my book on the balcony at the same time. The hotel was convenient to Harrah's so we got to play the slots (we actually won enough to pay for our stay and buy new tires when we got home - yippee) We like this little motel so much that we will probably not stay at Harrah's again and instead stay here.......", "title": "Great weekend stay", "helpfulness": 4, "user": "yomaryjo", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129759771}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our room was large, very clean and comfortable. The free wi-fi came in handy while we passed time sitting on our balcony over the river. The shower was excellent! Would recommend this motel, it is great value for money.", "title": "Excellent value for money", "helpfulness": 1, "user": "Dromomaniacs", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128324456}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "I booked this hotel through hotels.com. We paid only $56 per night! The location is supreme, the front desk staff (especially Bonnie) were exceptional, the rooms were very clean. The beds are comfortable, but I would bring my own pillow next time. The motel is right on the road, so you have to exercise caution if you don't back your vehicle in. Each room has a balcony that overlooks the river. The view is great! It is located very close to shopping, restaurants and the park entrance. Downtown Cherokee is right down the road. We usually always stay at Hilton/Hampton and i was a little hesitant about booking somewhere we had no prior knowledge of. I am thrilled that I chose this place and we would not hesitate to stay here again and will suggest it to anyone we know planning a trip in the area.", "title": "Great place to stay in Cherokee", "helpfulness": 3, "user": "dbae27", "date": "April 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127703877}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This Motel is a small \"Motor Lodge\" style motel. The rooms all have balconies that are right over the trout river which makes a very pleasing sound as the water rushes by. The beds are VERY comfy and for the price I don't think you can get a better value anywhere. There are no real amenities to speak of but the location on the river is worth the price. Definitely go to Peters down the road for breakfast, it's really good. They only serve breakfast but they do it well. Pauls across the street within walking distance is kind of hit or miss to be honest, we've never had an issue with the food but the service can be a bit slow. The indian taco is worth the drive.", "title": "Great for the money", "helpfulness": 1, "user": "Doug S", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127468563}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Unfortunately with Harrahs growing in this town I fear for the survival of these smaller places. I feel their time may be coming to an end, as is the whole vibe of the Cherokee experience, I'm afraid soon it will be like Gatlinburg and who wants that?", "title": "great smokey mnt ride", "user": "Melissa T", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125957673}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We thought this place was perfect. The covered patio sits right out over the beautiful view of the river. It was very clean, and the people there were great. Yes, it sits right on the road,(barely room to park your car), but there is no night traffic, hence no noise. Not fancy, but I didn't want it to be. I wanted a nice, clean, relaxing place to stay. And this is definitely it. I would stay here again.", "title": "Great little place to stay", "helpfulness": 2, "user": "Lucyhome", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118058962}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "My family has stayed at this motel several times and we have NEVER been disappointed. The staff is always very friendly and the rooms are always extremley clean. The view from the patio is quite nice looking right over the river. At night you can close the screen patio door and sleep with the door open listening to the river go by. It's like tent camping but far, far more comfortable. The beds are amazingly comfy and even with being so close to the road there is virtually no noise inside the room. It is not a luxury motel but it is very nice and I have no problem recommending it to anyone. The only issue is the parking, being a motor lodge it's right on the road which is kind of tricky at times. Particularly on the weekends. Other than that its a great place to stay.", "title": "Great Find", "helpfulness": 3, "user": "travelingredheads", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117942349}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel is well located in the downtown area - the rooms appear to have been recently updated - basic rooms but they were clean, confortable bedm lovely linens, wonderful river view. Decent TV, bathroom and coffee maker. Be aware it is a \"basic motel\" so don't expect a breakfast area, pool or other amenities. Reception staff were very friendly.", "title": "Clean and comforable", "helpfulness": 1, "user": "AdeleG63", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116827598}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Enjoyed our stay! The room was on second floor with a private balcony! The beds were very comfortable. They have recently updated the carpets, lighting, drapes, and bedding. My only suggestion would be, to get screen doors for the balconies!", "title": "Updated and Clean!", "helpfulness": 1, "user": "kwpc", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116747449}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We were in Cherokee for the Ultimate Elvis Tribute Artist Contest at Harrah's. I chose this motel based on other reviews that I read. I knew that my husband would love the balcony and I was right. The beds were very comfortable which was a big plus for us. My husband works out of town a lot so he spends a lot of time in motels and he always complains about the beds. The view from the balcony was gorgeous! While I was at the contest, my husband stayed at the motel and sat outside on the balcony and watched people tubing down the river. We are planning a trip back on Labor Day weekend for the Travis Tritt concert. We will definitely stay here any time we are in Cherokee.", "title": "We loved it!!", "helpfulness": 1, "user": "michelvis", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116302650}], "location": {"country": "United States", "city": "Cherokee"}, "stars": 2, "variance": {"poor": 2, "average": 7, "very good": 36, "terrible": 1, "excellent": 42}, "aka": "River`s Edge Hotel", "slim_ranking": 0.0740740740741, "description": "Recently remodeled and located on the Cherokee Indian Reservation in the heart of the Great Smoky Mountains, River's Edge has everything to offer. You can sit on your own private balcony overlooking the Oconaluftee River, or just step out the door to choose from convenient restaurants, stores, and attractions."}