{"user_rating": 4.5, "review_count": 569, "name": "Rivertide Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I stayed here with my family and this hotel is great. The rooms are very spacious and are just in the pictures. Everything is clean and new. The location is good while not on the beach it is only a short walk. The breakfast is very very basic and the quality is just okay, but you have a full kitchen so it really doesn't matter that much. Safeway is only a couple of blocks away and with a full kitchen you can bring in supplies. The pool was not very busy even though the hotel had lots of families staying. My one minor complaint would be the sound proofing. As you walk down the hallway you can hear everything that is going on in the other rooms. We could hear a bit when we were in the room but not so much that I would say it was a problem.", "title": "Lives up to the reviews", "user": "ryjenw", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 35743448}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "This was our second visit to Rivertide Suites and we would certainly stay there again. The place is clean, modern, comfortable and affordable. The staff are courteous and helpful. There is always free tea, coffee and hot chocolate in the comfortable seating area of the foyer, where they serve an adequate complimentary breakfast. When we were there, guests were offered appertizers, wine, beer and soft drinks at 5.30. Very conveniently situated near the beach and touristy shopping area - easy strolling distance.", "title": "Great place to stay", "user": "addysett", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35119791}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed in Seaside for 3 days just before the 4th of July weekend. We live in Seattle and have been to Seaside a few times before for summer vacation, but never stayed in Rivertide before.", "title": "Best hotel in Seaside", "helpfulness": 1, "user": "soekotjo", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34449206}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "The hotel exceeded all our expectations. We booked a river view 2 bedrom, and was given a corner unit with a wraparound patio, but had a more limited view of the river. Since we really wanted to have a full view of the river, we called the front desk and was given another unit right away. Very curteous and nice staff! The river view was awesome, we will definitely get a river view again the next time.", "title": "Family & Pet Friendly", "user": "Seattle1968", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34181133}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Since we were there for the beach, having the washer and dryer in the unit was a real heaven sent. And the two bedroom unit was certainly cheaper than getting two rooms in a regular hotel. The room was also very quiet, even though there were clearly many families with young kids on our floor.", "title": "Love this newer hotel in Seaside", "helpfulness": 1, "user": "zambonne", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33980067}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "A background on me: I'm a single mother and travel agent, and very picky about hotels because of my profession.", "title": "Excellent stay, great staff, BEAUTIFUL rooms!", "helpfulness": 1, "user": "brookesummer", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33202588}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I travelled with my three year old son to the Rivertide Suites condo property in June, and was very impressed with the hotel.", "title": "Awsome Stay!", "user": "PortlandBrock", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32852975}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Some information...", "title": "Perfect Birthday Getaway", "user": "andreafua", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32702431}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The rooms are amazing. We stayed in a studio suite, and it was gorgeous. The TV was nice because of the rain during our stay, I plugged my iPod into the TV and we watched a movie. The kitchen, the bathroom, the sleeping area... everything was very, VERY clean. The bathtub was jetted and clean, and the water pressure was great. (Silly, but a really common complaint about hotels - no water pressure!)", "title": "Rivertides Suites was perfect", "user": "Allan J", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32282086}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The staff was great, all you have to do is ask, and they will help you find whatever you need. The parking was secure, the area great, I didn't feel uncomfortable or unsafe at any time.", "title": "Best Hotel in Seaside", "user": "sheby_1", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32237723}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "What a wonderful find. We enjoyed and excellent rate at an excellent property. Check-in staff were friendly and helpful. The studio room was large and well appointed. The bed and bedding were comfortable and we enjoyed being able to spread out and enjoy the living area with a flat screen TV, fireplace, and comfortable furnishings. The manager's reception was nice as was the included breakfast. We were not even approached about a timeshare and left wishing we had booked more than one night. Our room was not riverview but was quiet. The staff here make the property outstanding.", "title": "WOW!!", "user": "doloresandjeff", "date": "June 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31859119}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This was an absolutely wonderful experience. The room was beautiful and comfortable. We had the small suite. It has a full kitchen, washer and dryer, fireplace, flat screen TV, jetted tub. It felt like a small condo. The bed was amazing. The service was courtious and friendly. Even the workout room was fine. Any downside? I will admit that I love my breakfast and continental breakfasts leave me wanting so we didn't partake of that, but it looked excellent in so far as continental breakfasts go. Also, the pool is smallish. Other than these very small shortcomings, I can find nothing bad to say. After being here for five nights it felt like home and we hated to leave. The price for the room is an awesome value. Would i recommend it to a friend? I already have. Can't wait to come back.", "title": "An Awesome Experience.", "user": "mikeyd53", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30618345}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "and to think I almost stayed at the Microtel! For less than $10 more for a Sunday night stay, I had a great stay here.", "title": "what a find!", "user": "saab_sister07", "date": "May 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29926625}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The studio room was fully equipped with a full kitchen (scaled-down appliances), a luxurious (by my standards) bathroom with a whirlpool tub and granite counters, a comfy couch, flat screen TV, fireplace and a washer and dryer. The room was spacious and the bed was comfortable. The toiletries were very nice as well. There were a few dishes in the dishwasher (as one other reviewer noted), and I added one or two more, but it wasn't a big deal, and I would rather they conserved resources by only running it when it was full.", "title": "Great chill out location", "user": "sinner5", "date": "May 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29500946}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The location was fine; it was a few minutes' waIk to the beach where I went to watch the sunset.", "title": "Very nice stay", "user": "halverbk", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 28773944}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "After some basic research, it seemed like a no lose choice;Rivertides suites was a great place to stay for 3 nights. $81 a nite for a studio. Pool can get crowded,but the breakfast is nice.", "title": "Great value,top notch suite style condos.", "user": "pjpeeps", "date": "April 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27676166}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The room was cleaned well,but we arrived to a dishwasher full of unwashed dishes. not a big deal-just an observation. Also,when a kitchen is available,paper towels,sponge,napkins could be supplied? I admit I didn't ask,should I have? Again,for the price of this level of room,not a huge deal.", "title": "very supprised", "user": "oceanlover4life", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27408540}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Rivertides Suites has an excellent level of customer service, Sean was cool and helped out with some eating choices. Most all the employees encountered were friendly and helpful. Parking was plentiful, and the walk into Carousel Mall/Restaurants/Broadway/Beach was very short(5 min-10 min).", "title": "Absolutely top class room", "user": "NewtonLondon", "date": "December 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22705543, "likes": {"liked": "— The room", "disliked": "— Old-fashioned town"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I was passing through on my way back from our trip and decided to stay in Seaside again. We were unable to get a room at the other hotel we wanted so we decided to take a change and stop in and see if this place would. As soon as we walked in we were welcomed by a very friendly and smiling front desk staff. It was in the middle of some kind of reception that was being held that we were told is done everynight. That was the second pleasent supprise. Next was the rate. Even though it was just the two of us the only room they had was one of the two bedroom suites(which is way to big for us) but they offered us a great rate for it. very affordable. When we got up to the room the first thing we noticed was the fireplace and kitchen. This wasn't just a \"mini kitchen\" it actually had everything there so that you could cook if you wanted. Yes that included an oven. It was nice to relax in the jetted tub after being in the car all day. We have found ourselves a \"home away from home\" .We will return", "title": "A great find on the Oregon coast", "user": "HI_50", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21156027, "likes": {"liked": "— Great front desk staff and beautiful suites.", "disliked": "— Nothing comes to mind... I think we liked it all."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Booked with some trepidation because little choice - ended up with 2 bedroom suite as only option for two of us! However, this accommodation was of a very high standard even compared to the luxury hotels in Hong Kong and Singapore. It's amazing given that the town itself is somewhat old-fashioned. Really good location for touring. Room facilities very good for longer stays eg. laundry and families. Very good value for money.", "title": "Nice Place", "helpfulness": 1, "user": "7608", "date": "October 19, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 5.0}, "id": 21016480}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 10, "average": 19, "very good": 102, "terrible": 8, "excellent": 430}, "aka": "Rivertide Hotel Seaside", "slim_ranking": 0.130434782609, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "A first-class All-Suite hotel located along the extraordinary Oregon coast in Seaside, Rivertide Suites welcomes guests with spacious suites, plentiful amenities and first-rate service. Guests who stay with us rate our quality, cleanliness and attention to detail best-of-class in the North Oregon Coast community."}