{"user_rating": 2.0, "review_count": 23, "name": "Rivington Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Now known as Rivington Lodge, this was a very cheap place to stay. The mould in the grout in the bathroom was a little off putting, but the room had been cleaned and the shower had good pressure and lots of hot water. The bedroom itself was large and had been recently painted. The bedding was clean and crisp but the mattress was well worn. The double sofa bed looked a little grotty and I didn't open it out to check it. The furniture was adequate but was well worn and the tea/coffee making facilities were welcome after a long drive. Checking in at the spa shop was not a problem and probably makes sense in keeping costs down. The location on the service area means that there is some traffic noise from the motorway, but it didn't disturb our sleep too much. This was the cheapest place to stay in the area and was perfect for an overnight pit stop, but I would not have stayed for more than 1 night.", "title": "Cheap place for a stop over", "user": "SuzyWho", "date": "December 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121706725}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "Room was clean and all facilities worked. Got an internet deal for £40 which was for room only. The only thing that let it down was the location - Bolton West services is very run down and the self service restaurant is pricey.", "title": "Adequate Accomodation", "helpfulness": 1, "user": "keendartfan", "date": "June 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3548427}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "This is a converted travelodge hotel in the services entrance does smell a bit damp but rooms nice clean and bedding clean for 25quid booked anything inc last minute you can't go wrong with it. The beds are good as well at end of day a motoway services hotel at that price is great considering parking over night would cost 20-22pounds worth extra for room and parking free then, in services is a spar so prices a little more cheaper than motoway services they also have a microwave you can use also a burger king subway and costa I will definate ey be stopping here again, thanks guys!! :-)", "title": "Cheap Hotel great value!", "user": "ScottFRobson", "date": "August 11, 2012", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 136932576}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "You certainly get what you pay for £24.99 for this fleapit was day light robbery,noisy rooms,smell of damp throughout room, bathroom in terrible order.Tea,coffee cups were filthy and clearly havent been cleaned for a very long time.If one person takes note of this and does not stay here I will have done you a massive favour. Staff could not have been any ruder they run a service station where you have to get the keys and they were not interested in our complaints.Pay the extra and stay somewhere else,it will be worth it.", "title": "Simply Awful", "helpfulness": 2, "user": "stevegMidWales", "date": "July 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 134375896}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The room I had was clean and warm. The bed was noisy (springs twangy). The shower flooded the bathroom as the curtain was short and I had to use the towels to mop the floor. There wasn't any soap or shower products. The reception staff were absent so apart from check in, I didn't see any staff to talk to. I didn't have the breakfast, as at £7.00 each seemed dear for what was on offer, especially when Tiffanie's in the town center did a better breakfast for half the price. A bit underwhelmed really", "title": "cheap stopover but you get what you pay for", "user": "oldandbold", "date": "July 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 134174590}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed here as we were aware it was possible to get a good rate at short notice. The rooms had plenty of natural light, were bright and airy and well decorated. They also had plenty of internal lighting.All the facilities worked, and for the price (£24.99 for a cancelable rate) we were very impressed. The heating was very adequate too Plenty of tea/coffee available. The staff we came across were very plesant and helpful. It is unusual to have to book in at the Spar Shop in the Service Area but the fact that there is no receptionist in the building is reflected in the price.We would be very pleased to return to this lodge.", "title": "CJ", "helpfulness": 1, "user": "ChristopherN979", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130066416}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Overall a very plesant stay. As it is on a motorway service area try to ask for a room at the back of the building which overlook Rivington Pike, these are quieter than the motorway facing elevation.", "title": "good value", "helpfulness": 2, "user": "brum1982", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125770518}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "We stayed here last night. Overall the hotel isn't too bad, it needs a refurb but it was clean, good sized room, tv, brand new travel cot (sheet given on request) towels, tea making, lovely hot shower. It's dirt cheap though so you get too many idiots staying, a large group of 'kids' were there purely to drink, smoke and cause chaos! Put right next to our room when we had a 10 week old baby with us, I was not happy!! But to get dressed to walk to the reception (in Spar!) to complain was just not happening. No staff in the building so the idiots just run riot, it's a shame as it wasn't that bad but people can do what they want there so beware- you'll need massive earplugs and a bottle (or two) of red to get any sleep...", "title": "Not bad hotel but full of drunk kids!", "user": "TravellingM", "date": "May 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 161916502}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "When we got there the windows were open , when it was 1 degree. The windows did not lock . Heater in bedroom was poor . No toilet rolls in bathroom. TV was small . No wifi . Room smelt as well . Cobwebs in room. Dirty carpets . Dirty bath . Heated tower rail was broken . Tea and coffee making had only 2 tea bags no sugar . Lighting in room was poor .to get to rooms from other side of motorway is dangerous to also no lighting to show your way . The room smelt of smoke . It's noisy too .", "title": "Awful worst place ever stopped in", "user": "Mjdj1689", "date": "January 12, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 149508471}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "No nets on curtains so people can see in to", "title": "Never again!", "user": "mctraveller301", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 148787049}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Walls are thin heard people in next room really being loud .", "title": "Get what you pay for", "user": "craig s", "date": "November 24, 2012", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 146113734}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "All in all dirty smelly noisey . Infested . Smoke ridden rooms . no staff you have to sign in at the spar shop at the garage. and they sid not seem to care either .Would not say to anyone to stop here . It's disgusting", "title": "Cheap 'n' Chearful", "user": "rauschaxleman", "date": "November 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145252442}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Booked in here for a few nights whilst our house purchase went through. It was a nightmare. They let anyone in. Drunks everywhere, fights, it was like a scene from a western, you could not make this up. We were woken one night by a couple screaming and fighting. We and others complained to the desk reception, which is in the Euro garage petrol station. The forecourt attendant sent a cleaner to sort out the problem, he weighed about 5 stone wet through, and couldnt speak english, bless him he tried. A few guest finally made the couple leave.", "title": "Awful, awful, awful", "user": "andi4ka", "date": "November 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 144623639}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "DAMP, DAMP, DAMP, If you like DAMP, and the smell of DAMP, then this is the place for you.", "title": "poor hotel", "user": "rache_lee_12", "date": "October 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 144012371}, {"rating": 1.0, "stay_parameters": "Stayed October 2012", "text": "The property sits in low ground, and the surface water run off from the carparks fills the blocked drains, then you get a lovely smell eminating through the property. Ive never seen so many air freshners in a hotel.", "title": "I should've slept in the car.", "user": "stillwideawake", "date": "October 20, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 143315497}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Please management take the old photographs off the websites, these are not the existing building, they are very old from the previous hotel chain.", "title": "Very comfortable stay", "helpfulness": 1, "user": "Julie S", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142238571}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The cleaners want medals,they try their best. Avoid at all costs if possible.", "title": "Ideal for a stopover.", "user": "Heather A", "date": "September 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141592580}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 4, "very good": 2, "terrible": 12, "excellent": 3}, "aka": "Rivington Hotel Bolton", "slim_ranking": 0.944444444444}