{"user_rating": 3.0, "review_count": 253, "name": "Rochester Plaza Hotel and Conference Center", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I stayed at the Rochester Plaza again this year while there for a music convention. Check-in was reasonably quick, considering the crowd attending the event. I found my room to be very clean, with rather dated furnishings, but all in good repair. Bathroom was very clean, with a small selection of toiletries. The alarm clock could not be set correctly, but that wasn't important to me, as I used my cell phone. Other reviewers are correct: the hotel parking fills up very quickly, so you will probably end up parking in the public lot across the way, which really is no big deal. Another thing to keep in mind is that downtown Rochester is actually a pretty deserted area after hours, and don't count on finding a CVS or grocery store within walking distance. I think if you can get a good price you would be ok staying here, but I would probably find a hotel outside center city when I'm in Rochester again.", "title": "Clean with comfortable bed", "helpfulness": 2, "user": "Bandlady", "date": "December 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121811336}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "We paid about $150.00 a night for this hotel. What we received upon arrival was a) not what the website led us to believe we would receive; and b) not worth that price. The website tells you that on-site parking costs $4.00 & we were prepared to pay. When we arrived at 9:00 pm, the lot was full! They told us that we were on our own – and that we would find alternate parking in a garage across the street. The website also promised a spacious desk with chair; this was important as we were there on business. There was a small desk with an arm chair (not a desk chair) – so it didn’t reach the table. This rendered the desk completely useless and we were forced to work on the beds. Our room was dimly lit with grout in the bathtub, peeling wallpaper, and sliding closet doors that are off the track. The white comforters had visible stains. (At least the beds were comfortable.) I ordered a garden burger from room service, as I’m a vegetarian, and was brought a hamburger instead – after waiting thirty minutes. We checked out the menu for the hotel restaurant, which was posted online, and when we walked downstairs to eat – the menu was exactly the same as room service! When we asked if they had the food that was listed on the online menu, the waitress said “I don’t know what you’re talking about”…before admitting that the website hasn’t been updated in a long time! The entire experience was one thing after another that continually proved that this hotel has serious managerial issues. Please don’t waste your money. If you’re looking for a hotel to connect to (or that is in the vacinity of) the Rochester convention center – try the Hyatt or Radisson.", "title": "Less of a 'Plaza', More of a 'Strip Mall'", "helpfulness": 3, "user": "jmasc1", "date": "December 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 121500293}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I used this Hotel for an overnight stay for my daughter.", "title": "excellent customer service", "helpfulness": 1, "user": "badboy1228", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121106878}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "They picked her up at the airport. Friendly check-in. Nice big room. Clean.", "title": "Mystery hotel booking, rated 3 1/2 stars, I think too generous.", "helpfulness": 1, "user": "kittykittygrrl", "date": "November 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 120573119}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Overall nice. Stayed only overnight.", "title": "Clean, comfortable and downtown", "helpfulness": 1, "user": "mcahill6912", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 120206829}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed at The Rochester Plaza Hotel July of 2010 for one week. We were treated like Royalty, and like family. I stayed there July 14, 2011 for 3 speacial nights with my young grand daughter, and we were once again welcomed like family.", "title": "Our second stay was even better than the first!", "helpfulness": 2, "user": "KatSzalay", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115690237}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "A very busy weekend with weddings, sports groups and many other activities, and it appeared seamless to me! I am in the Hospitality business and know what is what and what one should expect when staying at a fine hotel. Many of the same staff from last year were working, lots of familiar faces! That always tells me the staff are happy.", "title": "Just OK", "user": "STLJhwk", "date": "July 5, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 4.0}, "id": 115045778}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I would actually highly consider working at RPH if I decide to relocate to be near my family there!", "title": "WORST HOTEL I HAVE STAYED IN!", "helpfulness": 1, "user": "apophis08", "date": "June 27, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 114804642}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We stayed for one night on the first leg of our east coast road trip. The location was good if you are in Rochester for an event; it was a bit out of the way if you are just passing thru on I-90. Generally the place was kinda run down. I opened the door to the bathroom and the towel bar fell off the wall. The windows are very old. There was lots of street noise at around midnight. There was a wedding the night we were there and there were some very loud obnoxious people at the bar. The staff was very helpful.", "title": "The Staff is Wonderful...", "user": "pmorena", "date": "June 23, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114682152}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I have stayed at many hotels and this is by far the worst. Only one front desk host was helpful and courtious. The one at night went from rude to down right beligerant. The restaurant staff in the lobby bar and grill seemed down right angry that we were even eating there. 3 different fire alarms over 2 days which caused the evacuation of the hotel and me to be late to an important dinner meeting. After the first one I informed the desk that the smell of pot smoke was stron through my entire floor the staff did nothing. At each fire alarm the staff would not answer any other guests questions or even direct us where to go to evacuate. There was a wedding that took up the entire parking facility-which was very small- and even though we paid the desk clerk told us we had to \"figure it out\". We ordered room service and it never came to our room. The houskeeping staff barely made our beds and we had to ask for new towels. Our bathroom ceiling was caving in from mildew. The entire room smelled old and musty. Do not believe the pictures on their site-I was in 4 separate rooms of people on the trip with me and all of the rooms were sub-standard. I could hear the tiniest noise outside my room and through the walls to the next room. I could go on and on with examples. Do not stay here-you will definately regret it!", "title": "Yuck.", "helpfulness": 1, "user": "2cruisersb4kids", "date": "May 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 106655636}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Located right downtown near some excellent restaurants, this place was a hidden wonder for me. I was in town performing with Chuck McCann at the George Eastman House for a charity that included the reenactment of old radio shows and the dedication of Chuck's papers to this esteemed museum of images. The hotel was a wonder. The bar was well handeled by James and Tim and the front desk an endless source of assisstance. They have changed radically from some of the earlier poor reviews and you would be well severed to check it out. I stayed for almost a week in rm 722 with a great view of the river and skyline. I am posting a video of a great susnset from that room on YOUTUBE very soon under the title \"Room 722 in Rochester Plaza Hotel\" so check it out for yourself.", "title": "A real haven in a downtown location", "user": "purkasz", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117245528}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family and I stayed at this hotel one night on our way to Niagara Falls. We found this hotel to be clean with large rooms. It is conveniently located to many restaurants in downtown Rochester. We did not use the pool or the restaurant, so I cannot comment on those facilities. The rooms could be updated a bit, but it is very clean.", "title": "Nice, Clean Hotel", "user": "KarenGregNY", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117231840}, {"rating": 3.0, "title": "How does this rate 3.5 stars?", "text": "I booked this hotel through Expedia's unpublished rates. At 3.5 stars, I was expecting the Radisson. I was surprized when I saw the hotel name, but was willing to give it a try for the excellent nightly rate. I was also very surprized when I called and they told me I could bring my dog.", "helpfulness": 1, "user": "beav", "date": "August 14, 2011", "id": 116726019}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Well... right down the street from Kodak's world headquarters, one might hope for a little bit more. Everything needs updating, including the flooring, elevators, bathroom, and bedroom wallpaper. The furniture looked like Motel 6 style. The cups were all plastic-wrapped. There was no door on the closet. No waste paper basket in the bathroom... Sproadic hot water in the shower. The first night was quiet, but the second, we were right above a wedding in the grand ballroom where the music resonated within us until midnight. The bed was very comfortable.", "title": "Although in the city it was very relaxing", "user": "Thabosslady", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 116586408}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Would I stay here again? Not likely.", "title": "We love this hotel", "user": "sungirl015", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116531359}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The bathroom tiles in need of repair. Room needed to be painted. Rug worn and dirty.", "title": "Rooms dated", "user": "ccvr", "date": "October 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 119678973}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "No shampoo or conditioner. No glass cups, only plastic cups. Parking limited. AC not working, only heat coming out. Some ceiling tiles looked moldy.", "title": "Horrible", "user": "Sam_Aksh_T", "date": "October 13, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 119276937}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We checked into the hotel on 13 Oct 2011 - temps outside were max mid 60's and min of late 40's - not a time to use the heater yet. The hotel has no AC on as they said the switch was done for heating systems - My 15 month old baby was not able to take the heat inside the room and was cranky all through. We called up to ask for a tablefan atleast to ease her out - it was not available till we called up atleast a dozen times. We were harrased for a table fan which was easliy available once we threathed to go to the consumer court.", "title": "Very nice hotel, would stay there again.", "helpfulness": 1, "user": "Myzlou", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118002487}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The managers there are not cordial at all - they act as though they are doing a favour to us by letting us stay in the hotel - well, we are paying for the services, its not charity.", "title": "Stones throw to BCBS Arena!", "helpfulness": 1, "user": "lisa418_11", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117991106}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We came in - there was no trolley to carry our luggage to the 6th floor - we had to take 3 trips to the parking lot and back to the room to get our luggage in there.", "title": "A very good hotel that exceeded expectations\"", "user": "Mark16", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117986092}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 42, "average": 58, "very good": 60, "terrible": 46, "excellent": 47}, "slim_ranking": 0.965517241379, "description": "The Rochester Plaza Hotel is a deluxe full service hotel in the heart of downtown with comfortable accommodations, excellent service & attractive prices. Whatever the occasion, make the Rochester Plaza your destination!"}