{"user_rating": 4.0, "review_count": 441, "name": "Rocky Gap Casino Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The Rocky Gap Resort is adjacent the Maryland State Park of the same name. The rooms are a decent size and adequately furnished. We had reserved a lakeview room and it ended up on the ground floor with a mostly blocked view of the lake and everyone could look into the room walking by. The room was also near the indoor pool and the hallway stunk of chlorine and was very humid. I probably should of asked for a different room but didn’t. The room like the rest of the building is showing wear and tear and could use a thorough cleaning. The dining room has exposed heating ducts and you can see the buildup of dust on them. The landscaping around the outside screams for a good weeding and pruning. We did not use the spa (pricey) or golf but found the kayak/canoe rentals convenient.", "title": "Showing its age", "helpfulness": 2, "user": "Steeler_Pens_fan", "date": "August 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136769965}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Rocky Gap Lodge has a lot of potential, but it falls short in several areas. I don't know how this place has managed to maintain its AAA Four Diamond rating. Be sure to check out my photos for some good and bad examples.", "title": "Does not live up to 4-Diamond Rating", "helpfulness": 3, "user": "TheHighwayWarrior", "date": "August 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136291142}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "THE GOOD:", "title": "our first stay, hopefully many more", "user": "Jake S", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 136189089}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "If you're looking to get away from the hustle and bustle of city life, the location is amazing. The lodge is right off the interstate, but it feels like it's a lifetime away. The lodge sits right on Lake Habeeb, and the views from the back side of the hotel are breathtaking. The hotel has a lot to do around the lake, including hiking trails, swimming beaches, and paddle boats. The public spaces of the lower level and lobby level of the hotel are very attractive and well maintained. The rooms are a good size, they include two sinks, and they include many premium cable channels. The hotel also has a couple good dining options. For a lodge in a state park, the main restaurant has surprisingly good food, and then grill near the golf pro shop also has pretty good food and friendly service.", "title": "Enjoyable stay again!", "helpfulness": 1, "user": "MaryO19", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136108005}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "THE BAD", "title": "Looked forward to a great time, but just disappointed", "helpfulness": 1, "user": "LauraE724", "date": "July 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 135822362}, {"rating": 1.0, "stay_parameters": "Stayed July 2012", "text": "The room was dirty there was a old baby bottle that had looked like it had been there for months. They don't have any activitys that they don't charge u extra for an there prices are really high. Then after I left the hotel I noticed extra charges on my card and when I called the hotel about it they said they would have to call me back an never did. I had to fill a dispute with my credit card company to get it fixed.", "title": "Dirty, overpriced and made charges to my account I did not ok.", "helpfulness": 1, "user": "salestravler", "date": "July 16, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 134581274}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I spent just one Monday evening and night. The lakeside setting is beautiful, and the chairs, lounges, and small boats available for relaxing by the lake are plentiful. The lakeside and other grounds were quieter than we expected, and the lodge did not seem busy on this weeknight. Our King lakeview room was spotless, and fine for this short stay, but the bathroom is very small and would be inconvenient for a longer stay (only room for one person at a time to get ready for the day or evening). We were on the 4th floor, at the end of the hall and away from the elevator: the view was lovely and the room was very quiet.", "title": "Beautiful setting, quiet weekday experience", "helpfulness": 2, "user": "SmallWorldAA", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134095179}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Service was spotty: slow and seemingly distracted in the lounge, friendly and attentive in the Lakeside restaurant. Other reviewers have noted front desk service problems; I was greeted by a friendly, polite young woman at check-in, but I did note that she did not volunteer any information about the resort (unlike what is, in my experience, typical at resort check-in). The food was good, but seemed overpriced for the quality.", "title": "serenity and relaxation", "helpfulness": 2, "user": "Maverick09", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134040685}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Overall, a very good experience, and we would return to this property if we were in the area.", "title": "RELAX, REVIVE, RETURN!", "user": "CyndieG", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133919665}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "What a great place to enjoy the lake view and play on a quality golf course. We love to visit and get away for a few days. An ideal location with quality amenities and friendly, helpful staff. The restaurant is not the greatest but everything else is fantastic.", "title": "A great place for family", "user": "JonelleAnnapolis", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133899120}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is a tough place to give an \"overall\" review, because we've had both a good and not so good experience. Overall, this place has a lot going for it, but they have some glaring issues that need to be addressed.", "title": "The Good and the Bad", "helpfulness": 4, "user": "stumpsva", "date": "July 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133555800}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The GREAT - this is an outdoor resort, and I was pleased with how it lived up to it's billing. You could spend a weekend or a week and always have stuff to do. Canoes, kayaks, fishing, mountain biking, hiking, swimming - most rentals are $10 an hour, a very reasonable rate. I'd love to come back with my kids. The resort has also done a lot right in terms of planning out the space and how it sits on the grounds. Lots of nice little places with lounge chairs along the lake, nice walking paths, etc. Very Well done.", "title": "Relief!", "user": "NPotomac4", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133525023}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The GOOD - for the price we paid, we were pleased with our room - we got a \"pay for 2 nights get the 3rd night free\" - if I had paid full price I'd have been disappointed. Our king bed was worn down on one side, so it felt lopsided. The chair in the room had one arm broken. The walls were thin enough that a crying baby woke me up at 3am two nights in a row. It wasn't bad for what we paid... but again, I would have felt cheated had I paid their full price or more.", "title": "all about the outdoors", "helpfulness": 2, "user": "lmoore473", "date": "July 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133214965}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "THe BAD - food service was just awful. I see a lot of reviews here complaining that the food was too expensive. I don't mind paying a high price if I get what I paid for... but with the food, we never got what we paid for. The food at the pool-side bar was poorlly prepared and they messed up every order we put in. The Lakeside restaurant - upscale and pricy - the crab cake was dried out, and I swear they used cool whip on the key lime pie. If I were in charge of this hotel - I have worked as a hotel cook for years in my youth - I'd completely REVAMP all menus. Offer more selections. Offer healthier items, more than 1 vegetarian option, and for pete's sake, offer Dinner-sized salads in the main restaurant. Variety and better quality.", "title": "Outdoors paradise", "user": "nursenatie", "date": "June 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132759697}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "SERVICES - The rental desk was great, and the equipment was in good shape. The SPA was OK, my wife loved her facial and massage, I didn't care for the steam treatment, but this was more the option I chose. The pool is a bit too small for this size resort, and the jets on the jacuzzi were broken, but it was kept up nicely and was OK. yes the excercise room is small, but so what. Go outside and rent a bike if you want a workout. Housekeeping was OK but not exceptional. Front desk staff was fine.", "title": "Good spot a stay in the area!", "helpfulness": 1, "user": "LivvyMark", "date": "June 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132556280}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our family just got back from a weekend at Rocky Gap Resort. It is tucked on the water in Flintstone, MD--a place I didn't know existed until a couple of weeks ago. It has the feel of an old French Chateau, but never had me feeling like it needed updating. (No small achievement!) I would have given it a 4.5 if I could--and that would only be b/c the food was pretty average.", "title": "Great for do-ers and view-ers!", "helpfulness": 1, "user": "LightQueen", "date": "July 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135804474}, {"rating": 2.0, "title": "Really disappointing place to stay", "text": "What I loved:", "user": "Proudpapa1", "date": "July 29, 2012", "id": 135720260}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "1. If you wanted to sit in front of a fireplace and read-- you could. There were plenty of terrific spaces for quiet and peace if you wished for that.", "title": "For a work function, I'd say adequate and unique, but not for those wanting a lively time, unless rural is your thing", "user": "Lor411", "date": "July 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 135493138}, {"rating": 5.0, "title": "A great place to relax!!!!", "text": "2. It has it's own little beach.", "helpfulness": 2, "user": "jswider", "date": "July 23, 2012", "id": 135204820}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "3. You can camp at the National park area beside the resort if you don't want to go the resort route.", "title": "Decent view, not at all worth what they charge...", "helpfulness": 2, "user": "karebear0221", "date": "July 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 134866540}], "location": {"country": "United States", "city": "Flintstone"}, "stars": 3, "variance": {"poor": 33, "average": 68, "very good": 179, "terrible": 29, "excellent": 132}, "aka": "Rocky Gap Lodge And Golf Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A popular resort that promises cozy comfort in the woods - it is situated in the heart of Rocky Gap State Park."}