{"user_rating": 2.0, "review_count": 81, "name": "Rodeway Inn", "reviews": [{"rating": 5.0, "title": "Loved this sweet little place! Great for corporate stay-overs, families.", "text": "Travelling for business on L.I. there are very few inexpensive really \"nice\" places to stay. This one is charming! The staff is very professional and polite. The \"lodge\" facilities are very warm and comfortable, with evening snacks and of course breakfast. One evening I was there, a \"major\" game of some sort was playing on a large flatscreen TV. Quite a group of people were lounging on over-comfortable furniture, eating snacks and having a great time.! Nice to be part of, when away from friends and family. The rooms are large and comfortable with great beds! The bathrooms are small but functional and each one I've been in has had a large jacuzzi tub/shower. Refrigerator/coffee maker included. So try it!! I won't go any place else now.", "user": "Molly C", "date": "May 2, 2006", "id": 5029543}, {"rating": 5.0, "title": "Great value", "text": "I travel because of business, what a present surprise I have to admit I was pleasently suprise", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 14, 2006", "id": 4973294}, {"rating": 5.0, "title": "home away from home, but better", "text": "the hotel was very clean, staff very attentive and location, location, location. shopping, dining, entertainment all a stone throw away.", "helpfulness": 2, "user": "leslie g", "date": "April 12, 2006", "id": 4967507}, {"rating": 1.0, "title": "Stay Away!!", "text": "While waiting for our new home to be finished my family of six stayed at the Huntington country inn,", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 21, 2006", "id": 4367398}, {"rating": 1.0, "title": "This place needs help", "text": "Our stay has been the most wonderful and pleasant experinence we may not leave.", "user": "garshj", "date": "January 18, 2006", "id": 4361407}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I decided to give this place a chance after reading some positive reviews on this site. I wasn't expecting much - we were just looking for an inexpensive place to stay for one night, but I would not recommend this motel. It didn't feel safe to me, and for the price or even a bit more, there are many other options in the area. The motel's website has pictures of the rooms and they appear to be decent. One reviewer even stated that the rooms were better than they appeared on the website. This is false. Our room was dingy and the bed was horrible. It also didn't feel/look clean. The whirlpool tub also serves as the shower, and was located in the main room as opposed to the bathroom. Maybe in another setting this could be considered romantic, but not when the tub is inserted in the wall and located behind a sliding shower door. I hope this helps!", "title": "Not Recommended...", "helpfulness": 1, "user": "KLM1970", "date": "October 16, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 2.0, "value": 1.0, "rooms": 1.0}, "id": 5960384}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I made a reservation for two rooms for two nights at the Huntington County Inn directly on their website. I printed the reservation and waited for the promised email confirmation which never came. I later called to confirm the reservation and was told that they don't email confirmations and that the front desk receives a different confirmation number from the one given on the website reservation. OK. When we checked in, the receptionist at the front desk told us that the rates were different (and much higher) than those I had reserved on their website. When I produced the printed reservation he backed down and said that he would honor the original rates we received. He was very polite, but hostile. He also made a point of telling me that he was doing us a favor and upgrading us to rooms with king sized beds. I didn't bother to tell him that the original reservation already promised that. When we checked out, the attitude was the same from another staff member who charged us about $25.00 more than agreed upon in the original reservation. I had to defend the reservation details once again and the difference was refunded back to the credit card. The rooms were slightly superior to those at an average motel and featured quality bedding and new whirlpool bath shower combinations.", "title": "Acceptable Motel, Unprofessional front desk staff", "user": "W.Whitman", "date": "September 22, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 5821870}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I stayed at the Huntington Country Inn for 5 nights and had a very pleasant experience there. The room was spacious and had many extras - coffee pot, fridge, whirlpool tub & steam. The breakfast was good, the pastry fresh. My room was very quiet and the staff were friendly. I did not need to ask for anything so my experience with staff was limited. I would definitely stay here again.", "title": "Very Nice Place", "user": "Sableable", "date": "August 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5718924}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My family and I stayed at the Huntington Country Inn for 3 nights while attending a family wedding in the area. The rooms were very nice, and it was obvious that the owners take great pride in the hotel and its upkeep. The continental breakfast was awesome, and was kept replenished well past 10AM every day that we were there. My only complaint was that even though the carpet in our room appeared clean, walking around in stocking feet left my socks disgustingly dirty. Also, the steam in the shower didn't seem to be working, but with the high humidity in NY at the time, we didn't need to use it anyway.", "title": "A very nice hotel", "user": "RLynnC", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5499815, "likes": {"liked": "— The accomodations and the continental breakfast", "disliked": "— The dirty carpet (which didn't appear dirty)"}}, {"rating": 5.0, "title": "A Great Room for the Money", "text": "Would I go back? Absolutely. I'll just remember not to take off my shoes next time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 4, 2006", "id": 5034298}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I'm not sure why this hotel has attracted so many negative reviews. We stayed in the last of the row of rooms on the right of the car park, rather than in the main block, and the room was fine. The price was reasonable, especially for a Saturday night on the coast.", "title": "Could be better, but could be much worse", "helpfulness": 1, "user": "ColinMac", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7378995}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The room had a fridge and a balcony with a view over the harbour. Not especially close to the harbour, but you could see it (as well as the freeway and the railroad).", "title": "Find somewhere else!!", "helpfulness": 2, "user": "Chlemen", "date": "August 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5542641}, {"rating": 3.0, "stay_parameters": "Stayed July 2004", "text": "WiFi worked OK, breakfast was as good as most other complimentary contintal breakfasts, and better than some. Checkin was courteous and the room was clean.", "title": "Nothing Special, But Decent", "helpfulness": 2, "user": "liketotravel48", "date": "March 25, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 4733128}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "We stayed there for 2 nights at their \"suite\" for our family of five while waiting for another hotel reservation. Where should I begin...First it's way overpriced but we didn't have a choice since everywhere else was booked and the outside looked nice enough..so we thought. We checked in at 4PM!! and the room was still not ready. While the bathroom is large the towels have either holes or stain on them. I used the hair dryer and it shocked me, the microwave did not work, the pull out couch was broken, the airconditioner is only at the living room area thus no cool air in the bedroom.We were there during the heat wave SoCal was experiencing. We were in the 3rd floor and didn't not want to open the widows for fearing one of my kids will go through the large window with no safety rails of some sort and with I-5 right outside you cannot sleep through the noise. The pool was very small, the ice machine is located only on the first floor so, if you're on the 3rd floor and all the way on the other side of the building then you have quite a walk to get some ice. Also, their internet service is not secured so be aware. My advice look somewhere else if you have a choice.", "title": "You get what you pay for", "helpfulness": 4, "user": "Walklady", "date": "May 28, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 3506714}, {"rating": 1.0, "stay_parameters": "Stayed April 2004", "text": "This hotel fit the needs of our family of 5 as we stayed in Oceanside to visit family in July 04'. Their house was a little too small to accomodate all of us, so we stayed near the beach at night and spent time with them during the day.", "title": "Ocean View if you stretch your neck", "helpfulness": 2, "user": "Chrissypoo", "date": "May 22, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3491877}, {"rating": 1.0, "title": "Room had cockroaches", "text": "Where do I even begin to talk about this particular hotel. First, as the saying says \"You pay for what you get\" it's completely true in this situation. My wife and I wanted to stay someplace close to the ocean while we were apartment hunting in the Oceanside area and this hotel seemed like it was reasonably priced. Well, we enter the hotel lobby to check in and we were promptly greeted by a very unfriendly front desk attendant who seemed to have the \"Oh, I have to help these people\" attitude going on. We check into our room which had multiple things wrong with it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3438345}, {"rating": 3.0, "title": "Favorite of Marines", "text": "1. Tile missing in the bathroom", "helpfulness": 3, "user": "kurock_chalk", "date": "October 19, 2004", "id": 2757046}, {"rating": 2.0, "title": "Be wary!", "text": "2. Holes in the walls", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 19, 2004", "id": 2476898}, {"rating": 1.0, "title": "Beware", "text": "3. Incredibly smelly odor", "helpfulness": 8, "user": "frugalguy", "date": "January 20, 2004", "id": 1558984}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "Great deal in Eureka which has become an expensive hotel city. Micro/Fridge and DSL in the room was A+ too ...", "title": "Clean, Quiet and affordable", "helpfulness": 2, "user": "Baxter2006", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6021695, "likes": {"liked": "— great staff, clean", "disliked": "— walkways were in need of resurfacing"}}, {"rating": 1.0, "title": "no compassion", "text": "yeah it was my fault but I booked this room from Coos Bay OR. By the time we got to Crescent city we were wet clear through. We were riding the coast 101 highway and it had rained on us all day. By the time I reached crescent city all I wanted to do was dry out. I called the hotel to cancel and was told they would bill it any way. They did. Is there some compassion here for motorcyclist. I will never book with this hotel again.", "user": "A TripAdvisor user", "date": "June 1, 2006", "id": 5290056}, {"rating": 2.0, "title": "Meh.", "text": "Arrived here on March 18 (dark and rainy) and immediate first impression is this looks like the hotel straight out of Identity. Front desk service was passable but the continental breakfast is lacklustre at best. (Only serving pastries, muffins and coffee/juice.) Room was mediocre, bathroom was clean but very small (only a shower - no tub) and carpet was dirty. I pulled the blanket up to my neck in the dark while going to sleep and felt something crunchy under my chin. Turned on the light and saw it was caked with mud and grime from the previous occupiers. Microwave and fridge are useful touches, but would not stay here again, especially when the Red Lion Hotel across the street looks so much more appealing.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 27, 2005", "id": 3305753}, {"rating": 2.0, "title": "Never staying _there_ again", "text": "Functional and clean, but hardly \"nice\". Lots of road noise and the staff are pretty cursory.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 5, 2004", "id": 1539464}, {"rating": 3.0, "title": "Convenient, but a little noisy", "text": "Amazing amount of hassle involved in getting some belongings I managed to leave behind by accident returned to me before leaving the US - the stuff was returned (just) in time, but not before I'd had three different and conflicting stories from three different staff members.", "helpfulness": 5, "user": "Occasi0nalTraveler", "date": "December 24, 2003", "id": 1530473}, {"rating": 1.0, "title": "What a dump and staff could care less", "text": "Old, worn, smelly, broken, and needs to be torn down. And the staff could care less. Twice the hot water went out. We never could use our phone. Place is a dump. What can I say-- don't stay there.", "user": "CookieWaters", "date": "June 26, 2005", "id": 3612819}, {"rating": 5.0, "title": "excellent value", "text": "found this gem on the internet. It's not really an Inn more an upmarket motel. Still, for $90 I had a huge room, comfortable bed, massive whirlpool bath, toiletries in bathroom were super, microwave, coffee machine, iron and board, tons of TV channels, hairdryer, sliding doors to beautifully kept grounds, small pool, wonderful do it yourself breakfast (you won't go hungry). Great location, mall around the corner, lots of restaurants nearby and drug store and supermarket across the road. Friendly staff, pc for guest use in reception. nice gazebo to sit in and relax.", "helpfulness": 3, "user": "uklauren", "date": "August 31, 2004", "id": 2505757}], "location": {"country": "United States", "city": "Huntington Station"}, "stars": 2, "variance": {"poor": 9, "average": 6, "very good": 3, "terrible": 55, "excellent": 8}, "aka": "Huntington Country Hotel Huntington Station", "slim_ranking": 1.0}