{"user_rating": 4.0, "review_count": 24, "name": "Roman Rooms Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We stayed at this B&B for three nights on a short trip to Rome, and had an incredible time. Tucked away from the busy Roman streets, our room was the perfect sanctuary after a long day of exploring. All rooms face an open courtyard, which really reduces noise levels and makes you feel like you are a local, rather than a tourist. The room was very pleasant and decently sized for Europe. We had a full bathroom and two beds. Everything was meticulously cleaned. When we woke up in the mornings, the breakfast would be laid out for us: several kinds of toast and pastry, spreads such as patte and peanut butter, espresso and juice. It always kept us going until lunch! The room-keeper, Tom, was very helpful with directions and good restaurants. Also, the B&B was in an excellent location: a few blocks from the Termini, right around the corner from a metro station, and about a 15-minute walk to the Coliseum and Forum. For around €120 per night for a triple room, it met all of our requirements and more. We would definitely stay here again.", "title": "Fantastic B&B", "helpfulness": 3, "user": "dogbone1002000", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7291782, "likes": {"liked": "— location, cleanliness, price", "disliked": "— nothing!"}}, {"rating": 3.0, "title": "New but nice", "text": "Still working out some kincks but has good potential. Right by a metro stop and a close walk to the train stations, this B & B is up and coming. The rooms are nice size, breakfast is simple but got us through till lunch. The entire place was newly redecorated and was all up to date.", "helpfulness": 10, "user": "ladybugDZ", "date": "July 17, 2006", "id": 5476272}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 2, "average": 3, "very good": 8, "terrible": 1, "excellent": 10}, "slim_ranking": 0.22842851188}