{"user_rating": 5.0, "review_count": 554, "name": "Rome Armony Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Words escape me when I try to describe my stay at Luca's B&B. Nestled in the most important corner of Rome, Rome Armony Suites is simply a must-stay for your Rome vacation. Luca (and Andrea) are the best hosts, going above and beyond the call of duty to make sure you hit all the best sites of Rome, eat the best food, and enjoy your stay in the best city in the world. Except for the Coliseum, I would say that every must see place/monument/site is within walking distance of the Armony Suites and even that is a short train ride away. My only regret is that we only stayed 2 nights--I could have stayed forever!!!!", "title": "500% Above and beyond!", "user": "Nadia C", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137885621}, {"rating": 5.0, "title": "GREAT STAY!!", "text": "Grazie Luca!", "user": "rsoh", "date": "August 20, 2012", "id": 137756140}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed 3 nights at the Rome Armony Suites in August. Luca was an amazing host who was very helpful. We arrived at 11am very jet lagged and tired and Luca was there to greet us and had the room ready for us so we could rest. He treated us like friends and always had great suggestions for things to do and places to eat. The location is in a quiet area close to all sites. The breakfast was in a little cafe just around the corner with great pastries and the hosts at the cafe were always very friendly. The rooms were clean, comfortable and very modern. I would not hestitate to recommend Rome armony suites and look forward to staying with Luca the next time we visit Rome. Thanks Luca!!", "title": "Beyond our expectations!", "user": "denelizalex", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137506393}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My daughter and I stayed 4 nights at the Rome Armony Suites in July. The location is great, within walking distance to all the sights. Luca was amazing. It seemed as if we had known him forever, he treated us like family. He had great suggestions for seeing and eating in Rome as a Roman would do. The room was very nice..it was great to have air conditioning, because it was hot when we were there. I can't wait to return to Rome with my husband. I will absolutely stay at Rome Armony suites again.", "title": "It really is that good!", "user": "KimnMike65", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137414743}, {"rating": 5.0, "title": "The best host", "text": "My husband and I were on a 3 day short break. We had visited Rome before and had lived in Italy for 2 years some time ago. Luca and his son Andre made this holiday for us. We ate some of the best food we have ever eaten in Italy thanks to their recommendations. They really did go the extra mile in helping us navigate around a city we thought we knew quite well. The tips and hints and suggestions were all invaluable and sensible. The only hesitation I have in writing this review is that more people will use these apartments at a time when we want to return. We will be back!", "helpfulness": 2, "user": "Mariela Z", "date": "August 14, 2012", "id": 137222669}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There's a reason why this place has been #1 on trip advisor list out of hundreds of B&B's on Rome. I only trust Trip Advisor reviews to choose my lodgings when we travel and we have never been disappointed with the recommendations we have gotten.", "title": "Great location", "helpfulness": 4, "user": "catseattle1", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139427796}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The large room was already booked so we ended up staying in one of the standard queen room. It turned out to be just fine. Don't be scared by the numeric size of the rooms. There're are plenty of closet spaces for all your extra luggage from all the shopping, en-suite bathroom large enough for two people to do their business at the same time, and ULTRA comfortable bed. Lucca is a frequent traveler himself and told us how important it is for him to get a good night sleep when he's traveling. That's why he spent the extra money to get Custom hand made mattresses for all his guests. You can get everything hand made from a true artisan in Italy everything from leather shoes to mattresses, I guess.", "title": "Exceeded our lofty expectations", "user": "154932Bill", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138980218}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We opted to pay 50euro for the airport pick up service. The driver met us right at the door just as he promised, and was a easy drive into city. The metro station is 4 blocks away, but it's a very looong four blocks when you're tired and have luggage to carry. Also, the sidewalks in Rome are pretty rugged so your roller suitcases will not roll very easily. Once you're at the building, do not bother looking for a sign that says \"Armony Suites\" or even a mention of the B&B because there is none. The B&B is located on the 3rd floor of a very typical multifunctional Roman building. Instead, look for \"#3\" on the wall and very hugh wooden door. And ring the bell with the name Lucca, not Armony Suites, again, because it's not there. Another thing, I noticed that in Italy, the street level is actually not the first floor. The first floor actually starts on the second floor. For example, by my American count, the B&B is located on the 3rd floor but on the elevator, you would actually press #2.", "title": "Best place to be in Rome", "helpfulness": 2, "user": "BluePeteHawaii", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138727762}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "And the location is just amazing. Everytime we got confused, we would just look for a main street that contained the name \"Cola\" and we would find the B&B right away. And the map Lucca gives you is very helpful, but is NOT drawn to scale.", "title": "Don't look anywhere else!", "helpfulness": 2, "user": "bonzovt", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138026904}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "And the streets are very safe. We did not feel the need to use our concealed money belt at all. In fact, we felt stupid taking money out of our money belt inside my husband's pants at a store the first day, when everyone had their money in their normal wallet, in a purse, or in pockets.", "title": "Best of the Best", "user": "Rob M", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137910296}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Thank you Luca and Andrea for making our first stay in Rome so enjoyable.", "title": "The perfect place for your holiday in Rome", "helpfulness": 2, "user": "AmandaG117", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135033553}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We loved the room, the location and all of the great tips for getting around Rome.", "title": "Great place to stay", "user": "dergorg", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134967939}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Especially the restaurant recommendations which meant we were welcomed like family friends whenever we arrived at a restaurant and never felt like tourists.", "title": "Fantastic! Passionate service in a well positioned, peaceful apartment", "helpfulness": 1, "user": "oliveo1l", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134539304}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "For anyone who doesn't speak Italian or who feels they can't communicate there is no need to worry as Luca takes all that anxiety in his stride by providing the best advise and service imaginable.", "title": "The Clear Standard to Judge All B&B's By...", "helpfulness": 1, "user": "Mike S", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134369170}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Arriving back at Rome Armony after a day sightseeing, Luca would be there to hear about our day and offer ideas for the next one and give restaurant choices and even arrange tickets for places we hadn't managed to book ourselves.", "title": "Amazing B&B in Rome!!!", "helpfulness": 1, "user": "April H", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134127191}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We stayed 3 nughts at the end of July. Great location, nice rooms (1 night superior, 2 nights superior dekuxe) , great breakfast around the corner in a nice coffee. Luca was great! We will recomnend this b&b to our friends!", "title": "As exprcted - Great", "helpfulness": 1, "user": "redly1", "date": "August 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136552465}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Our time at the Rome Armony Suites was amazing! The spacious, cool, extremely clean rooms, were an afternoon oasis from the heat of the city in July. The furnishings are simple, modern, and CLEAN! However, the thing that sets the Armony Suites apart is Luca! He greets each of his guests as friends and spends time helping you fine tune your plans to maximize your time in Rome. He reccommends restaurants and menu items even! I planned our trip using Rick Steves book which was wonderful, but Luca was able to take our itineraries and add sights and restaurants that only a Roman would know! Luca will not steer you wrong! I would send any of my friends or family members to stay with Luca at the Rome Armony Suites without a single hesitation!", "title": "Feel Like a Roman!", "helpfulness": 1, "user": "Jenny T", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136018849}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "All thanks to Luca. Rome is an amazing city made even more pleasurable by becoming one of Luca's friends and staying at Armony suites. Luca goes out of his way to make each and everyone of his guests feel like the most important person on earth, he will tell you the very best places to eat (and i mean the best) and the easiest way to get around and see what you want to see with a virtual tour courtesy of google maps. Nothing is too much trouble for Luca ...................The rooms are very modern and spotlessly clean. Luca, you're one of the nicest people we have ever met and we hope very much you get to live that dream you spoke of.......................................Paul and Linda from Oz.", "title": "We came, we saw...................we lived Roman!", "user": "Paul Z", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135315516}, {"rating": 5.0, "title": "The Best", "text": "The best place to stay if you are traveling with your family.", "user": "Navvigoddess", "date": "July 25, 2012", "id": 135299602}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Enjoyed the food, enjoyed the kind nature of the staff", "title": "DON'T BOOK ANYWHERE ELSE! I promise you - a stay at Armony will make your holiday magic.", "user": "Vanessa M", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135036279}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 0, "average": 2, "very good": 17, "terrible": 0, "excellent": 535}, "aka": "Rome Armony Hotel Rome", "slim_ranking": 0.000416840350146, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Rome Armony Suites is an elegant bed and breakfast in Rome in the Prati district of Via Cola di Rienzo and Castel Sant'Angelo a short distance from the Basilica di San Pietro. Thanks to its strategic location you can reach all the main attractions of the city of Rome."}