{"user_rating": 4.0, "review_count": 40, "name": "Rongratana Executive Residence", "reviews": [{"rating": 4.0, "title": "Very nice apartment, miltxed opinion on service", "text": "We stayed in a 2 bed apartment for 3 nights in March. Overall opinion is great, beautiful, spacious, quiet apartment in a good location - although its on a one way road so when you think the taxi/tuk tuk drivers are trying to rip you off, they probably aren't! Also within walking distance to the main shopping areas.", "user": "RW2008", "date": "April 12, 2013", "id": 157498390}, {"rating": 1.0, "title": "awful place to stay", "text": "We had no issues with our stay until the morning we left, we ordered our breakfast (which gets delivered to your room) for 7am as we were leaving at 7.20am but it never arrived. We eventually went to reception to check out and they were pretty much clueless, we asked for a juice or water before our taxi arrived but even that proved too difficult. A disappointing end to a nice stay but would recommend and stay there again.", "user": "Saime H", "date": "January 26, 2013", "id": 150643283}, {"rating": 3.0, "title": "Nice apartment, staff somewhat lacking in customer service skills", "text": "However, the man who works on reception was very helpful and professional - they need more like him working there.", "user": "GandA10", "date": "January 15, 2013", "id": 149717185}, {"rating": 1.0, "title": "Hotel looks good but services and manager is way too irresponsible.", "text": "Hi,", "user": "Tripradap", "date": "December 31, 2012", "id": 148407446}, {"rating": 5.0, "title": "Prisvärd lyx", "text": "Unfortunately we stayed in this hotel for one night and paid for 2 nights. pls pay attention about your payments in the check in and check out time. They took 2 nights from my credit card and did not pay it back. The room was ok but no service at all. The reception stuff is indifference, do not pay attention to customers. Briefly, I was cheated an will never stay in this hotel again.", "user": "Madelenee", "date": "December 9, 2012", "id": 147040947}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This hotel has offered us better than our expectation. It was our first time staying in service apartment or so called Executive Residence. There was a room for improvement. But this place does not need to as being unique place to stay in Lang Suan Area...and more importantly....staying there made us feel like Home...", "title": "Better than my expectation", "helpfulness": 2, "user": "PoomyTheBear", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143204403}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here in a very well appointed serviced apartment, six people for two nights worked out to around SGD 50pppn. Excellent location, opposite the Grande Hotel Ville Bangkok.", "title": "Great Facilities", "helpfulness": 1, "user": "Sammone40", "date": "September 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 139962219}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel is about ten minutes walk from the nearest BTS with nice hotels surrounding it.", "title": "Elegant rooms and an enjoyable stay!", "helpfulness": 1, "user": "lwa3", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136272311}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The front desk staff are very friendly, the breakfast was included in our stay between 7am and 10am and was pretty good fare.", "title": "This is NOT a 5 star accomodation!", "helpfulness": 3, "user": "Eva K", "date": "July 31, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 135860633}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The beds were comfortable, the bathrooms spacious and clean. The thing that stood out about this hotel was that it was clean and the staff were attentive as well as the rooms were very nice inside.", "title": "Great location, lovely apartments, but average amenities.", "helpfulness": 1, "user": "Adil C", "date": "July 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133144377}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The rooms were very nicely furnished. The rooms were very comfortable and spacious. I booked with Booking.com so I had a good rate or 2 bedroom apartment adjacent with a studio room. There were 6 of us. All the beds were kings. It was bothersome to have to have a card key all the time to use the elevators but I guess it's good for security. The CCTV channel shows the lobby in the tv so we can see the people coming in the hotel. WiFi was great and internet connection is fast and free. It was a loong walk to the sky train. The swimming pool was tiny. Gym facilities are okay.", "title": "Great apartment", "helpfulness": 4, "user": "MakatiSister", "date": "April 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 127709856}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The Rongratana executive residence is very centrally located-- a 10 minute walk to the sky train, a few minutes more are the big malls. Lovely, quite area surrounded by similar establishments and lots of nice restaurants and cafes. Our 2-bedroom suite was simply lovely, furnished in white, wood and silver. The bathrooms were clean and the kitchen was very well equipped. Breakfast was served en suite, although basic (eggs, choice of sausage or bacon) and coffee was tepid. They did not bring extra coffee in a pot so we had to make do with the instant coffee that was provided. Around the corner was a nice gourmet store stocked with an extensive wine selection. All in all, value for your money. I would definitely stay there again.", "title": "What a find!", "helpfulness": 4, "user": "pobletedelarama", "date": "March 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126127145}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Truly lovely little property. Right next door to the Mariott Executive Apartments on the Lumpini Park side. Booking.com and Agoda seem to have different map sites for its location!!", "title": "Rongratana - A welcome relief.", "helpfulness": 5, "user": "GenerationExpat", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125122447}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "I got a good discount from an online hotel site and then the hotel upgraded us from a single bedroom to a double bedroom. All the fittings and appliances worked fine. I was very pleased with the high standard. Everything worked and was in excellent condition. Kitchen had a rice cooker and a coffee maker. No drinks or snacks in the full sized refrigerator but 711 is only 5mins walk away.", "title": "Fully equipped apartment, in prime downtown Langsuan area", "helpfulness": 4, "user": "Ed1982_10", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124792743}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Skytrain is near. MBK is close, (MBK sells everything) catch the skytrain from Chitlom to Siam/Central and swap sides (platform) and go to National Stadium, there is an overpass right into the MBK centre.. its about 15-25 baht from memory o/w.", "title": "Pleasant Surprise", "helpfulness": 6, "user": "MJCCL", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123898117}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Booked a 2-bedroom suite through booking.com. Few days before check-in date, I received an email from booking.com to update my credit card details as hotel had problem pre-authorising it. I updated with another credit card number, called the hotel on a Sunday to make sure they recd my NEW card details and told the staff to make sure the reservation dept don't cancel my booking. The next day I recd another email asking to update my credit card details and that if I have already done so, pls ignore the email. 2 days before my check-in date, I recd an email from booking.com informing that my reservation has been cancelled as I failed to provide a VALID credit card for hotel to pre-authorise.", "title": "Terrible experience! Avoid!", "helpfulness": 10, "user": "zbenxx", "date": "June 24, 2012", "detail_rating": {"service": 1.0}, "id": 132688787}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Fuming mad, I called the hotel and asked what happened. The staff cannot provide a satisfactory explanation. Kept telling me hotel tried to pre-authorise a charge on my card but unable to. I told that it is impossible! There is nothing wrong with my credit card and I have been using it to make purchases. I asked for the manager's name and number. Called the manager, Paul, on his mobile phone, he refused to pick up my call. Called back to hotel again and was told by the same staff that the manager called her and told her something is wrong with my card. WOW WOW! This fantastic manager dare not answer my phone call but can call back to inform his staff that my credit card has problem?!!! I asked the staff to provide me with the credit card details they recd from booking.com. I double check and everything is correct. Card number, expiry etc. Nothing wrong. I called my credit card centre and check on whether there were any attempts from the hotel to pre-authorise a charge on my card. Guess what? The answer is NO. Nothing at all. Bank informed me there is nothing wrong with my credit card. I then called hotel again to demand an explanation. I left my number for the manager to call me back. No one returned my call. In the end, I have to book another hotel as I was told by the staff they have released my room to other guests.", "title": "Unpleasant experience", "helpfulness": 5, "user": "chipopi", "date": "June 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 131656691}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I ended up staying at Anantara Sathorn Bangkok. Fantastic hotel. Great service, great hotel. No such nonsense from them. Maybe a blessing in disguise for not staying in this horrible hotel. Horrible management.", "title": "Great value hotel", "user": "ilandere", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129119356}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Booked 4 nights for 4 ppl a long ago through booking.com.", "title": "AWESOME & UPGRADED", "helpfulness": 6, "user": "Spit_sp2385", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128210225}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "3 weeks before the trip I received an unclear mail from the hotel stating that the hotel policy never allowed AMEX payment and that \"anyway this type of room is fully booked\" so my interest would be to cancel the reservation.", "title": "highly recommend - at the right price", "helpfulness": 7, "user": "wanton-chaos", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128088646}], "location": {}, "stars": 4.5, "variance": {"poor": 2, "average": 3, "very good": 18, "terrible": 5, "excellent": 12}, "slim_ranking": 0.525170068027, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}}