{"user_rating": 3.5, "review_count": 501, "name": "Rooms Ocho Rios", "reviews": [{"rating": 4.0, "title": "It's Like a Best Western!", "text": "We had a great time. The hotel is nice - the rooms are clean and pretty and the staff are very friendly. It is quite modern. It immediately reminded us of a Best Western in the Southern United States - right down to the laundry rooms with ironing boards.", "helpfulness": 13, "user": "README", "date": "January 16, 2008", "id": 12708536}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The location is terrific - it's located on a very nice beach in the centre of Ocho Rios. The centre of town is very close and there is so much to do and see that it is an amazing location. When our tour rep told us that it was the best location for a hotel, she wasn't kidding. We went with our 2 kids - 10 and 13, and I don't think we will ever go all-inclusive again. The excitement, character, beauty and adventure made an amazing vacation. I think the hotel was a nice introduction to Ocho Rios and a huge and diverse group of people that we will definitely stay in touch with.", "title": "Rooms...a unique experience...", "helpfulness": 13, "user": "LyseOttawa", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 12199097, "likes": {"liked": "— location"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The life guard, Brian, was awesome. The pool is nice and clean and there is always an available chair. The food at the resort is good. The local food on the street is incredible (and much cheaper - it's about $16 to $23 per dish at the hotel and about 300J or $2.10 at local takeouts in town - what a difference!). The hardest part about leaving the resort is that a lot of people who are selling products and services are right at the front gates of the hotel - it's a bit intimidating the first time you go out, then you realize that if you are friendly and pleasant (just say \"no thank you\" if you don't want something at that time) then the Jamaican people will be very friendly towards you.", "title": "Nice Hotel...", "helpfulness": 4, "user": "rjjj_r", "date": "December 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 11513910, "likes": {"liked": "— The rooms were very nice", "disliked": "— Expensive to eat and drink at..."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Have a great time if you choose to go. We had fun at Rooms and we will go back to Ocho Rios, but probably to one of the older Caribbean style hotels that we saw there.", "title": "The best of times !", "helpfulness": 3, "user": "gerry6666", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11230266, "likes": {"liked": "— Friendly staff.", "disliked": "— The breakfast."}}, {"rating": 5.0, "title": "I've had the time of my life", "text": "Hotel was clean, with a good view of the ocean, restaurant (with room service), pool side bar (expensive), games room (slots), fitness centre, pool, little gift shop, in a beach front setting.", "helpfulness": 6, "user": "Kurlie", "date": "November 23, 2007", "id": 11012840}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I stayed at Rooms on the Beach July 15-19. I like so many others had read the reviews. This is my third trip to Jamaica, but the first time I have stays at Rooms. First of all when we checked in we had paid for Ocean View with Balcony, 2 rooms, but they were not available, so they put us in two Junior Suites, with the promise that we would receive our Ocean View Rooms the next day. Well the next day came & we still did not have the Ocean/Balcony rooms, they overbooked the hotel and there were just not enough rooms. They informed us they would continue to look. The front desk is not to friendly especially Shanda she is rude and will roll her eyes at you in a minute. The manger is better. Well they informed one of our party that they could get our rooms on Tuesday night, we checked in on Sunday and were leaving on Thursday. We had already unpacked so we stayed where we were. The bath rooms could be cleaner and the tile on the floor. The worse part is the towels, you have to almost sale your first born to get them to bring you towels. We were infomed that there was a towel shortage and they prefer if you reuse your towels for days at a time. (no way). The continental breakfast is the same each day, toast, danish, muffins, jelly, coffee and juice. No fruit, can you believe it . An island with fruit hanging from every tree and none at breakfast. I don't know about the lunches are suppers at the restaurant. I only saw a couple people eating there. Well enough of the negative, the beach was beautiful, Rooms sits right on the beach, the drinks were GOOD and reasonable. We visited Bob Marley's Village up in the hills, Dunn River Water Fall and off course the Straw Market and T-shirt Warehouse. The hotel is located in a very good spot, with all the shops you can walk to and places to eat. We loved Mama Marley's. I will visit Jamaica again and I would love to stay downtown, but not at Rooms, unless they do some improvements.", "title": "Love Jamaica, disappointed in Rooms", "helpfulness": 5, "user": "JGrayson", "date": "July 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8229251, "likes": {"liked": "— The view of the ocean", "disliked": "— No enough/no towels and having to keep asking for them in rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "This has got to be the absolute worse hotel I have ever stayed at. We went to Jamaica for a wedding and after the very hot rehersal, the hotel said they ran out of rags for us to bath with, We did not get rags tell the next evening.", "title": "Never Again", "helpfulness": 1, "user": "DrPam", "date": "July 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8138657, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I bathed my daughter with a towel. The bathroom especially the tiles were filthy. The bath was rusty and dirty. I placed a rag in the bath so my daughter could stand on it. Teh comforter was dirty and had spots all over it.", "title": "Rooms on the Beach, WHAT VALUE", "helpfulness": 4, "user": "UF2015", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8100703, "likes": {"liked": "— The staff were very attentive", "disliked": "— The panhandlers and street vendors"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I GUESS YOU DEFINETLY GET WHAT YOU PAY FOR, BUT I THINK IT IS A DISGRACE TO BE A SUPERCLUBS HOTEL.", "title": "Love Everyone At Romms", "helpfulness": 4, "user": "beckp49", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8051136, "likes": {"liked": "— View was great", "disliked": "— NONE"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I WOULDN'T RECOMMEND THIS HOTEL TO MY ENEMIE.", "title": "Not as bad as they say", "helpfulness": 3, "user": "butterflyRI", "date": "July 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8050719, "likes": {"liked": "— beach & location", "disliked": "— no fridge & community iron"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I found the Rooms advert whilst browsing through the Jamaica Tourist newspaper during a recent visit with my family from London. Our trip was to attend to some family business in Mandeveille, and it was my job to find us a little break once everything was sorted.", "title": "Pleasantly surprised!", "helpfulness": 7, "user": "Angel54London", "date": "November 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10944038, "likes": {"liked": "— Being on beach, well equipped/quality furnishings.", "disliked": "— Having to climb stairs wish suitcases due to no lift access."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "On arrival at the hotel (late Sunday evening) I was initially impressed with the availability to my requests of sea view and balcony. On entering our rooms we could not believe the high quality of luxury and convenience we were walking into. I was certainly flavour of the month with my brothers. Going off to sleep at night and waking to the sound of the waves splashing against the shore was sheer heaven.", "title": "Best beach access you're gonna get for the price", "helpfulness": 6, "user": "planetstepper", "date": "October 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10054798, "likes": {"liked": "— Right on the beach, great view, affordable", "disliked": "— Not all inclusive, public beach, pool was often closed, sometimes noisy at nights and in mornings"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Staff were very helpful and friendly and the convenience of having washing/dryng facilities and use of a real iron/board made life so much easier.", "title": "Rooms were a Great deal !", "helpfulness": 18, "user": "JACKSON357", "date": "September 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8711041, "likes": {"liked": "— Nice beach, Central town location, Excellent value, great balcony view", "disliked": "— inconsistent shower water temps; WAY over-priced restaurant & internet cafe"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I would certainly visit Rooms again and again. My only complaint is Rooms undersell themselves with the advert, as I was sure they were shots of another hotel. How wrong can you be!", "title": "Rooms on the Beach", "helpfulness": 2, "user": "Dreams26", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8431388, "likes": {"liked": "— Access to the beach", "disliked": "— No elevator"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "If you don't want to pay the 5 star prices, this is the best place you will find that actually has direct access to the beach. It has a great view of the water--every room has a view though not every room has a balcony.", "title": "Overall good- but mixed feelings!", "helpfulness": 7, "user": "wmcrary", "date": "August 3, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 2.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 8315828, "likes": {"liked": "— proximity to town", "disliked": "— some of the front desk staff hospitality, bathrooms repair/updating"}}, {"rating": 1.0, "title": "Do not stay here!", "text": "Liking the atmosphere of smaller resorts better, we chose to stay at Rooms on the Beach when we visited Jamaica for the first time. We were very disappointed. I will start with the beach. In pictures we noticed that about 50 -100 feet out it was roped off. Being people who love swimming in the ocean and snorkeling, this made us nervous. So much so, that we called the hotel prior to booking our vacation. We were told by the hotel staff that they were not sure what the ropes were in the pictures but assured us that there were no problems with the beach or the water. We then asked if there was snorkeling right off of the beach or if we had to take a boat out. We were told that we could opt for a boat but that snorkeling from the beach was just fine. This was all lies! The water is roped off because the hotel sits only yards from where the cruise ships come in. So not only can you not swim out far or snorkel for fear of being hit by a boat, there is also no view of the ocean from the beach or your room. We spent 4 days staring at the side of 2-3 cruise ships. Because we had called and asked before booking our stay this made us very angry. On our second day, we decided to take a boat out past the ships to snorkel. We were told 65 US dollars for 90 minutes of snorkeling. We tried to negotiate but they stood firm. Asking around we found out that most of the boat owners in that general area were brothers, cousins and friends so the $65 rate was very firm! We decided to go out since snorkeling was one of the main reasons we go to the beach. At first we were pleasantly surprised...the boat was a glass bottom boat. When we got out about 10 yards past the ships and the captain dropped anchor we were mad. Being in the shipping lanes, the water was stirred and mirky and fish were few and far between. I asked the captain if he would take us out further and was told if we wanted to pay the daily rate of several hundred dollars he would take us out \"a little further\". Having realized we had been taken, we decided to make the best of it. After 1 hour of snokeling, the captain pulled anchor and called us in. When we complained that it had only been an hour (not the 90 mins we were told) we were told that the 90 minutes of snorkeling included travel time. The whole thing is just a scam. On day three we decided to go looking for a beach to snorkel from. My husband and I are seasoned travelers and walking through huge cities like NY and Chicago or the jungles in Mexico don't bother us. But by the third or fourth block we realized we were in over our heads. Downtown Ocho Rios (not the touristy section where the markets are but the \"locals\" downtown) is not a safe place even at 1oclock in the afternoon! We took a cab and asked him to take us somewhere we could snorkel. We went 4 blocks he stopped told us we were there and that we owed him 7 us dollars. Even by NY standards that was a rip-off! The place he took us was a little better, sorry don't know the name of it. Being that Jamaica is an island I am sure that there is snorkeling somewhere, but we never found it.", "helpfulness": 8, "user": "Booman", "date": "June 17, 2007", "id": 7869827}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The markets at the tourist's downtown are over priced and the pushers are extremely rude. Having visited Mexico many times we are used to the people on the beach trying to sell their stuff but those people were nice. Even when you would say \"no\" they will talk to you and be nice to you. But our experience in Jamaica was quite different. When saying \"no\" even as polite as possible, you just wait for the backlash! An example: the ladies with their combs and beads would approach me to braid my hair. Not wanting braids I would always say \"no thank you\" and keep walking. One particular lady was very pushy, grabbed my shirt and was trying to tug me towards her chair. When I held fim and still said \"no thank you\" as nice as I could, she got right up in my face and screamed \"then you should cut it all off\". I was completely taken aback.", "title": "My Experience At Rooms", "helpfulness": 3, "user": "mika4578", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7867503}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The hotel itself is not maintained well. My husband had to fix the toilet one night because the maint. staff wasn't on duty. We could have waited until the next day to have a toilet if we wanted to wait for them to fix it. The food at the hotel wasn't bad. A lunch we had poolside was actually very good, but way overpriced. A hamburger with fries, a club sandwich with fries, two sodas, and one side ceasar salad was 40 US dollars. The menus didn't have prices so buyer beware. The pool at the hotel is as small as it looks in the pictures. Swimming is not really an option it is more like wading. The beach would have been nice if it wasn't for the trash and staring at the ships. There is literally trash everywhere. In the ocean, on the beach, in the rivers. It is a very dirty place (Ocho Rios in general - not just at this hotel).", "title": "Don't even get me started!!!", "helpfulness": 7, "user": "Mama02", "date": "June 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 7780848, "likes": {"liked": "— The area of the hotel", "disliked": "— The service and the room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "If you do vacation here (do not recommend) there were 2 places where we got marvelous dinners. One is a place called Dave's lobster shack. And beware..it is a shack. It is down this long dirt road that is very dark (if you startle easy go during the day) at the end of town and Dave's is at the very end of this road right by the water. It is dirty and scary looking, but if you are looking for the best lobster you have ever had, this is your place. The lobster is as fresh as you will get. Dave has his own fishing boat, so the lobster are coming in the same time you are. There are no menus or listed prices so haggle your price before being served...and don't worry, you'll get the same quality even when you haggle. The other place is an actual restaurant called Evita's. It is Itallian and very yummy. It is set atop a hill with an open patio. The view of town is awesome. If you go after dark, all you see is lights and you can forget about the trash and nastiness below. This is \"fine dining\" so they prefer you not wear your beach clothes. You will need to make reservations. You will have no problem finding their number. It is a well known place.", "title": "Seeing Is Believing ( One Love)", "user": "pella11", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7730716, "likes": {"liked": "— LOCATION, QUIET, FRIENDLY STAFF.", "disliked": "— AT TIMES THE LIFE GUARD WAS OFF DUTY DURING SOME OF THE DAYS."}}, {"rating": 4.0, "title": "Had a wicked time", "text": "One big thing if traveling with your children, there are drug pushers everywhere. Middle of the day, walking down a busy street, we were offered just about everything. When you say \"no\" they act offended, and we were once even asked \"what do you mean you don't smoke\"? When sitting on the beach, it is literally everywhere! My husband had to intervene when one particular \"pusher\" would not leave 2 13-14 year old girls alone after they said no.", "helpfulness": 6, "user": "Millichops", "date": "May 24, 2007", "id": 7694183}], "location": {"country": "Caribbean"}, "stars": 2.5, "variance": {"poor": 75, "average": 107, "very good": 160, "terrible": 57, "excellent": 102}, "aka": "Rooms Ocho Rios Hotel Ocho Rios", "slim_ranking": 0.461538461538, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}