{"user_rating": 4.5, "review_count": 94, "name": "Rooms Hotel Kazbegi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "After a drive from Tbilisi and seeing how small Kazbegi was i wondered what the hotel was like. As soon as we pulled up we were greeted by the staff and they checked us into our room, 207. For three people the room was cramped however for one night it was fine and the beds were comfortable. The bathroom was new and very well kept.", "title": "A great hotel", "user": "Meh-self", "date": "July 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169203843}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The view from the room of the town and Mount Kazbek was brilliant and there was a small balcony with a chair on. Because the hotel is situated on a hill there is quite a steep walk to and from Kazbegi however cars can drive right up to the doors.", "title": "Brilliant Location and Views, Comfortable Rooms.", "user": "jsl71", "date": "July 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168861253}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The food is the best in the town and there is a wide choice of both hot and cold foods on the breakfast buffet. The restaurant is large and there is a bar area just around the corner. The sandwiches are particularly nice.", "title": "Top Class", "user": "Ingolfsson", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168263925}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "The hotel provides books in English, Georgian and Russian for guests to read either in the library area (just in front of the bar) or outside. Seating is provided in both places and it is a great place to relax. Books for adults and children are available. Was impressed by the books and would definitely have liked longer in Kazbegi.", "title": "Loved it!", "user": "MariaMirabela", "date": "July 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167832495}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "First the good things. The location is spectacular, looking over the town and with stunning views of the mountains. Get up at 6am and hope to see Mt Kazbeg in blue sky. The hotel is well designed with lots of attractive wood everywhere and great public areas, including the enormous terrace. Rooms are fine with huge beds and good bathrooms. Food is good, particularly breakfast; we had two dinners and two breakfasts.", "title": "Cosy atmosphere that will make you feel like home!", "helpfulness": 1, "user": "LaRusseaux", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 167141242}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This hotel is superbly located with amazing views across the broad valley to Mount Kazbek and other high Caucasus peaks and up the valley towards the Dariel Gorge. Make sure you have an odd numbered room, as these have the mountain view rather than the car park view from the even numbered rooms. The building has its origins in the Soviet period and although it has been converted and modernised still has the look of a prison block. Inside it's quirky. The public areas are very attractive with lots of soft furniture and interesting features, together with a large outside veranda with seating that makes the most of the amazing views. However, the rooms are not so impressive and don't live up to the 5 star billing. Our room had no coffee making facilities, an empty mini-bar, very poor lighting that was inadequate for reading before bed, no shelf in the shower to put soap/shampoo on, no safe, no suitcase rack etc etc. None of these issues is major but just made it feel second class, which was disappointing. But the views are something special.", "title": "Excellent location", "user": "Steve-G23", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 175184978}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Hotel features great location with stunning views. Design of main terrace, restaurants and rooms is great. However there is inconsistency in service quality. Openly speaking after my first visit when at busy times I had to wait for each ordered drink in restaurant for 15 minutes and sometimes it was forgotten, I told myself that I would not return. But later on friends told me that service improved and I checked it out once more. Certainly, as there were not a lot of people service fas very friendly and responsive. Food was good. But I guess all is going to depend on amount of guest in hotel. Should expect delays when crowded.", "title": "Mixed feelings", "helpfulness": 1, "user": "Armands F", "date": "September 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175046881}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Although not very preposessing from the outside, the hotel has been stylishly designed in the public areas within, with beautiful wooden floors, comfortable leather armchairs, interesting objets and great vintage Georgian film and theatre posters. Buy a drink from the friendly barman and sit looking out the floor to ceiling plate glass windows at Mt. Kazbek on the opposite side of the valley...hard to beat. Unfortunately the design of the restaurant is less successful, and one has the feeling of sitting in a madhouse refectory, but this can be overcome by imbibing the correct quantity of Georgian wine. The rooms are very much of a standard contemporary hotel style; minimalist and clean, but rather small and uninspiring. That said, one should not be spending much time in them, and every single one has a great balcony with amazing views. Prices are still reasonable; I would recommend going before they ramp them up!", "title": "Stunning views and stylish bar", "helpfulness": 1, "user": "WiglafMoscow", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 173607336}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The hotel is huge and very busy with people from all around the world chilling out in it's restaurant and hall. However, you get the feeling of coziness despite the hotel's size, because the big ground floor hall is divided into smaller zones with bookshelves and small tables.", "title": "It's as if you are in a chalet, but looking at the Mount Kazbek", "user": "Bugaguli", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173473220}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The big front terrace has a magnificent view to the Mount Kazbek and Holy Trinity Church.", "title": "Wonderful and natural escape", "user": "Alroy13", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173326554}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "First of all the design of the hotel is great - sort of modern scandinavian style. The rooms are very clean but could be a little bigger, especially the bathroom. The shower with the wooden floor is a bit to much - too designer less practical. The view is amazing (you must ask for the rooms with the view). The outside terrace is huge with big comfortable seats, blankets and pillows available if you ask and also an awsome view. The breakfast buffet is fantastic - fresh, big choice, delicious. The same with the restaurant menu. Excellent service and very friendly english speaking staff.", "title": "Everything was great!", "user": "mojeopinie", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166959268}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Suddenly this hotel appears after a fairly long and arduous drive, and what a sight it is! I waBut i Ss lucky enough to be given a room with an amazing view of Mount Kazbeg and the stupendous Stepantsminda church. The room was lovely, with one or two minor complaints - there was no room safe and the lighting was poor. But you spend most of your stay looking at the view! The bar was comfortable and modern. There was a good choice of beers at reasonable prices. The Bar / Lobby area contained as many books to borrow as an average small library. A huge adjoining terrace had the amazing view, and was clean and comfortable. I got the impression that many of the staff were new, or in training as things were somewhat disorganised at times. English was not widely spoken, even among some of the younger staff. I am sure that minor difficulties will disappear in time, and that this hotel will soon be a tourist attraction in its own right.", "title": "An amazing hotel in an amazing part of Georgia", "helpfulness": 1, "user": "Christopher O", "date": "July 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166939440}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Rooms Hotel is simply amazing. I would expect a property like this to be located in the Swiss Alps or the Colorado Rockies, so the fact that it exists in a small town in the Caucasus is all the more awesome.", "title": "Amazing, unexpected gem - go to Kazbegi just for this hotel!", "helpfulness": 1, "user": "gubbiofarabia", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166719727}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The setting is obviously spectacular but the allure of the hotel is so much more - chic retro-Soviet minimalist decor, super friendly and knowledgeable English-speaking staff, extensive list of Georgian wines, fast wifi (not to be taken for granted in this part of the world), fleece blankets on the terrace in case you get a little chilly taking in the view... seriously, I can't rave enough. The restaurant is also excellent and has a great mix of Georgian and non-Georgian options - in the unlikely event that you need a break from khachapuri, the salads and soups are fantastic.", "title": "Perfect facilities, but slow service", "user": "Flower53_10", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166716419}, {"rating": 4.0, "title": "Fabulous location, impressive building", "text": "We only had the pleasure of spending 1 night but I think you could easily fill 2-3 days doing excursions around Kazbegi (Gergeti church, Gveleti waterfall, etc.) and using the hotel as your home base... I can't think of a more perfect place to come back to after a day hiking in the mountains!", "user": "Drph24", "date": "July 3, 2013", "id": 166184264}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed for one night in aug 2013. Very nice views over the church of holy trinity and the mountains. The room was very clean, room and bathroom with wooden floors. Probably expensive for the country stds but well worth the 107 usd we paid.", "title": "amazing views", "user": "nat2509", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172791308}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The hotel location is amazing - worth the 3 hours drive from Tbilisi. Road construction between for approx 10 km after Gudauri which makes the drive uncomfortable.", "title": "Amazing Hotel - Poor Management", "helpfulness": 1, "user": "Lara F", "date": "August 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 172090329}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "I loved the view and the design of the hotel though seems like it is rushed as still construction going on in some areas.", "title": "beautiful hotel", "user": "CristineOcenar", "date": "August 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171753784}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Rooms:", "title": "Excellent hotel in Stepantsminda", "helpfulness": 1, "user": "Tali O", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169552037}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "- Try to get the rooms ending with odd numbers for the village, valley and mount view however could get noisy if groups in terrace.", "title": "beautiful design, poor service", "user": "Lisa K", "date": "July 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169422941}], "location": {"country": "Georgia", "region": "Mtskheta-Mtianeti Region", "continent": "Europe", "city": "Stepantsminda"}, "variance": {"poor": 1, "average": 7, "very good": 33, "terrible": 1, "excellent": 52}, "slim_ranking": 1.0}