{"user_rating": 4.0, "review_count": 518, "name": "Room Mate Lola", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Excellent hotel which is situated just a block or two from the city centre. Only downside is that the location is in the red light district - not a busy RLD, just a few tarts and a couple of sex shops evident, andt it causes no problems at all. the positives really make up for this one negative - excellent well appointed rooms, very clean smart hotel all over and attentive staff. Great breakfast which goes on until noon and check out is also noon, which means no rush on your last day. We also arrived before noon and checked in.", "title": "Lived up to the other Reviews", "user": "DaveHampshire", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27184374}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Malaga is a good city - the hop on hop off bus is expensive, but a good way to get bearings. Nice centre and some attractive parts, but get down to Torremolinos which has had a face lift and is great for lunch or evening meal. Mixed results on eating out in Malaga, mostly good, but avoid Alegria, which was poor and expensive.", "title": "Even better than reviews", "user": "BarryRolfe", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26811933}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Excellent hotel,right in the middle of city with really helpful staff and great rooms and breakfast. Couldn't ask for more.", "title": "Hola Lola", "user": "JammieDodger", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24887037}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Dont miss the Picasso museum.", "title": "Enjoyed Malaga & Lola", "helpfulness": 1, "user": "EnglishRose169", "date": "February 16, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24639649, "likes": {"liked": "— Clean modern hotel", "disliked": "— No bar"}}, {"rating": 5.0, "title": "Great hotel great location great value", "text": "This was our second visit to Malaga and our second stay in Lola. Once again, we loved both.", "user": "A TripAdvisor user", "date": "February 11, 2009", "id": 24461449}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "hotel is centrally located but it's a quiet area. quality fittings in bedroom and bathroom. bed was geat . had 3 terrific and peaceful nights sleep. the breakfast is welcomed. but not good for the health conscious. the only cerials on offer were cornflakes and ricicles, it wouldn't cost much to provide muselli, or dried fruits, or mixed fresh fruit salad. they could claw the money back by cutting back on cakes & sticky buns. but hey don't forget its a great place to stay. oh yes - free internet and hotel supplied the wire connection.", "title": "centrally located, cool and stylish.", "user": "rhodbear", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 29407573}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "tip - visit the picasso museum after 5pm to avoid the crowd. visit larios shopping centre in hot part of day -the coffee bars and tapas bars offer great value- get a10 trip bus from the office around the corner from hotel (about 250 metres on the main drag towards the centre)", "title": "relaxed and stylish", "user": "tontylondon", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 28933698}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The location is surprisingly low key for this 4 star hotel. However, the place is stylish and comfortable and great value. The staff are relaxed and unobtrusive, though very efficient. I'd definitely use it again/", "title": "MALAGA GREAT CITY", "user": "montechester", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 28866849}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "stayed 3 nights hotel very near city centre,malaga is a realey great city ,it is very clean very good staff,good breakfast,and at agood price, what more do want.", "title": "Very nice hotel", "user": "hobomo", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28702903}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "Nice room, very friendly and very helpfull staff, breakfast is untill 12 and there's a lot of choice, in the center of Malaga in a quiet street. Perfect!", "title": "Excellent stay in Málaga", "user": "missfalk", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28500595}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "After staying with Room Mates in Madrid for serveral times now I chose Room Mate Lola in Malaga and we were not disapponited. I love the breakfast which is the same in all hotels but good, avariety of spanish dishes like tomato sauce, tortilla de patatas, manchego and ham but all presented in a - what should I say - Scandinavian style. Pluss they have musli, yoghurt, croissants. And also that you don`t have to rush down as you can have breakfast untill 12! Lola is situated in the \"red light district\" I pressume but we felt safe and it was only 5 minutes walking to the main street. We were upgraded and got a spacious business room which had all we needed. I like the Room Mates Hotels for 3 reasons: price, breakfast and stylish design. I feel that I get value for money :)", "title": "Central location, great breakfast and good service", "user": "OsloTravelgirl", "date": "August 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37160871}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "That was a real pleasure to stay with Lola hotel in Malaga. So clean, so nice, in the very center of the city and near to the beach - you can't expect anything more :)", "title": "The best choice you can make!", "user": "jaqub", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36951310}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Room Mate Lola was a big surprise. I wasn't expecting such a nice hotel in such a great location for such a reasonable price.", "title": "Fantastic Location", "user": "walruslady", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36590605}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel offers free wireless internet at a shared computer on the ground floor, or they will also lend you a cable to get free wired access in your room. They also have a free breakfast buffet in the mornings (served until noon!) which is very nice with toast, cereal, cheese, fresh fruit, coffee, and juice.", "title": "Stay there!!!!", "user": "Romangirl79", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36062257}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel is within a 10-minute walk of both downtown Malaga and the bus/train stations, so it's easy to get anywhere you want to go. The staff was very courteous and helpful. I'd definitely recommend this hotel!", "title": "Great surprise", "user": "AngieLechuga", "date": "July 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 36041968}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "+ stylish hotel, friendly staff, central location, good value", "title": "cool and trendy for malaga", "user": "kroz", "date": "July 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34499025}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "- only wired web access in rooms, breakfast crockery was dirty... maybe the dishwasher needs an upgrade!", "title": "Look no further - the Room Mate Lola is perfect!", "user": "HAK_9", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34481666}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This is a great hotel - modern, stylish and very well kept. The room we stayed in was nice and spacious with an extremely comfortable bed, and the bathroom was just as great. The staff is friendly and very, very helpful. The hotel is in a really good position only a couple of minutes' walk from the historic city centre and all the shops and restaurants. Even the beach is within easy walking distance. So - we really couldn't find anything to put a finger on. Hope to be back soon .......", "title": "Great value for price", "user": "purpleladyLeuven", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33041210}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This is a fairly new hotel ideally located in the city center of Malaga. We paid 65€ for a double room including a delicious breakfast. Clean rooms and friendly staff. Only negative: beds are very very firm and when we stayed there there were roadworks in front of the hotel and so a room at the back of the hotel would have been better.", "title": "Brilliant contemporary hotel, would definitely stay again!", "user": "jonesjabat", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31071342}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Me, my boyfriend, my mum and dad have just returned from a short break in Malaga staying at the Room Mate Lola. We could not find fault in the hotel at all. It is a very modern, sleek, stylish little place. All the staff working there that we encountered were very friendly and helpful. The rooms and general decor of the hotel is very contemporary. We stayed in Room 102 which was great, it had a flat screen TV, massive and very comfortable bed, simple yet sleek bathroom with a powerful shower. Breakfast was continental style which offered everything you could want, fresh breads, pastries, cereals, fruit, juices, hot drinks etc. No complaints at all. The only tiny downside was a bit of noise from some building work going on over the road (obviously not the hotel's fault!), and maybe the location if you were staying there with kids, as it in a red light area, but having said this we did not feel intimidated and had no problems at all. It is only a 5 minute walk into the centre of the town. I would definitely stay here again, recommend it to others and found it very good value for money. Tip: For a traditional Spanish bar in Malaga centre - try the El Pimpi Bodega - A cavernous place with lovely Tapas and great atmosphere!.", "title": "Just what you need in a hotel", "user": "BaronVonH", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30963550}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 19, "average": 64, "very good": 237, "terrible": 5, "excellent": 193}, "aka": "Room Mate Lola Hotel Malaga", "slim_ranking": 0.152173913043}