{"user_rating": 4.0, "review_count": 1741, "name": "Rosen Shingle Creek", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "I got this place by accident on Priceline. I was looking to get a simple 3 star on International Drive, but got upgraded here to Rosen Shingle Creek on the next road over- Universal Blvd.", "title": "Beautiful resort property. Great pools (4 of them!)", "helpfulness": 1, "user": "bush242", "date": "May 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130635795}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Coming from New York, I'm sort of a spoiled world traveler, so when I got this place, my curiosity was peaked - as the reviews are so mixed. Well, I got to say- dollar-for-dollar (value), this is probably one of the top 3 places I ever stayed. I like Doral in Miami, but you pay thru the nose- triple the price! The Rosen property is beautifully manicured. Beautiful clean pools - 4 of them. The lobby is spacious and airy. With the tall glass windows, I'd like to experience a lightening rain storm here.", "title": "This Resort is Fantastic!", "helpfulness": 2, "user": "WL001", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130610451}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "It's a shame this property doesn't get better reviews. Minus out the unreasonable idiots who gripe about the $16 parking and give negative reviews- and this place would be in the top 20 in Orlando.", "title": "Booked through priceline mobile app for $54/night", "helpfulness": 4, "user": "Traveling504", "date": "May 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 130586081}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The restaurants I believe are a bit on the high side, but the Oceola cafe offers a wonderful $18 munch buffet. Braised beef ribs, chicken- nice salad bar.", "title": "Will not stay again!!", "helpfulness": 5, "user": "Sara P", "date": "May 24, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 130547027}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Last night- Angela (Annelka? Not sure of her name.), but she was very nice,and took the extra time to find us a king sized bed- given the hotel was crowded. A great experience overall.", "title": "Over-priced, very little luxury with rude staff", "helpfulness": 3, "user": "gtrb8", "date": "May 24, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 130545495}, {"rating": 5.0, "title": "Rosen Shingle Creek Resort", "text": "Amazing place to stay. Family friendly. Beautiful, clean facility with many luxuries and ameneties. 6 restaurants, convenience store, 3 pools and more all on the resort. Centrally located to all attractions.", "user": "AngelaV8", "date": "March 2, 2011", "id": 98720582}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "I recently stayed @ the Shingle Creek with the US Army for our Yellow Ribbon ceremony. The grounds were well kept,rooms were great. The staff were very friendly and very helpful with any questions/concerns. It was nice having someone available even at 4:30 am to arrange a later check out. My only \"issues\" with the hotel was in my room our shower didn't get as warm as I had expected it would. But,with such a great time behind me, I look past that issue. I would love to come back.", "title": "Great get away.", "user": "rljbc36", "date": "February 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 98335110}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This was a very nice place to stay. Everything was clean and fresh. The rooms were very comfortable. We had breakfast in the Cafe'. It was good, but, a bit over priced for breakfast. The grounds were beautiful. Bring your walking shoes, because you will need 'em. It was about a 15 min. walk from where we had to park to our room. Overall, it was a very nice get away for a no-kids anniversary weekend with my hubby.", "title": "Very nice", "user": "kdd75", "date": "February 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98289229}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "If you're not in a hurry, this is great place to stay. The room was clean and beautifully decorated, the furniture was all top notch. The bed was very comfortable and the amenities were very adequate (bath robes, an ironing board, hair dryer, and more). But, if I had walked all over any of the \"Parks\", then arrived here, only hike it into the hotel and then out to my room, I'd be disappointed. Internet service is available, but there's an additional charge. Parking was an additional charge and not exactly close by. A nice plus is the Publix Grocery Store across the street, which is probably a mile away but still convenient.", "title": "Clean, Attractive, Nice Location....Prepare to WALK", "user": "LWx42b2", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98278542}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stayed here for a conference, which was on-site, and had a fantastic experience. The hotel grounds include a golf course, a jogging trail, and a nature walk.", "title": "Terrific resort", "user": "John60612", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98274670}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is a happy place. Everyone you meet is smiling and having fun. I never say any Grumpy Gus' on our trip. Got this on priceline and that was my first surprise. 2nd came when we realized it was a golf resort which was perfect since this was for my husband's birthday. Check-in was a no wait experience at 4pm. That is the first in a long time. Check-in was a breeze and we were given a lovely room on the 10th floor overlooking the 8th green and the nature trail. The rooms were very nice. Children could be heard in the hallways sometimes but the rooms were quiet inside. The golf resort staff, restaurant and bar staff and all the hotel staff we encountered made us feel welcomed and at home. The stay wasn't perfect. We didn't know, until my husband went to check in for his game, that the valet had failed to send his clubs to the golf storage room and they sat in bag storage instead. The person at the golf club went to find them when they couldnd't be located. My husband's club are as important as his wife, so this was a big deal but was handled very well by the golf staff. Checking into our room, it appeared very clean; however, I went to wash my hands and the sink in the bathroom was stopped-up very badly. Housekeeping should have caught that. Also, there were no glasses in the bathroom, they failed to refill the kleenex dispenser and they failed to give us coffee for our 2nd morning. These things were remedied by maintenance and guest services so well that we didn't even think of them as a problem but a minor incovenience. Maintenance came to repair the sink and, on the 2nd day, to replace a bulb in the bathroom and both times they were quick and polite. This is a resort so we payed for parking and internet but we have come to expect that at resorts. Why? Who knows? I liked the idea of a quiet pool for adults. We ate outside by the pool one day and at A Land Remembered for lunch twice. All the food was so great that we didn't feel like we needed to go elsewhere to eat. A Publix is across the street for drinks and snacks. This turned out to be one of the most relaxing weekends we have experienced in a long time. Came home feeling refreshed and renewed.", "title": "If you go to Orlando, this is the place to stay", "helpfulness": 2, "user": "IRB33785", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124929814}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is our second stay at The Rosen Shingle Creek. We stayed local (using Priceline for an unbeatable deal) and knew what to expect. We had stayed before and had our complaints of a resort that so many people say that they \"love.\" We were, and still are, not amazed by the service that is offered to The Rosen's guests. With so many choices for 'beautiful' accommodations, it's difficult to understand why this hotel would stand-out. Nice facilities, decent restaurants, many amenities...but it's in the details when you advertise as \"luxury.\" You could put a rock in a very pretty box and guess what you'd have? I rock in a pretty box. That's pretty much the experience at The Rose Shingle Creek. I paid attention. The only exceptional service was the gate guard asking if this was our first time, where we said \"no,\" and he said \"well, welcome home!\" These touches are what makes the difference to discerning travelers. Having said that, there are deals to be had on this resort. Never pay the published price. If you do, I would suspect you'd feel cheated. The pools are nice, but basically unattended. Good luck at finding someone to bring you a cocktail or snack. The front desk staff is pedestrian, at best. The actual structure is quite beautiful inside. Again, sad that it's decor is geared to an elderly clientele (this would be my guess). I would recommend that you do not purchase the wireless internet. It is accessible from your guest room, but don't expect functionality in the lobby or pool areas. During our stay, the credit card readers at the in-sight restaurants/shops were no functioning. Big, long, lines...no added help to aid (or apologies) to help with the extra time handwriting receipts for room charges/credit purchases. We do enjoy the \"value\" of their spa...quiet, seemingly unused, and adequately appointed, I'm not sure you could find a better bargain for the facilities (no extraordinary service, however). It appears that with the \"markdowns\" that are available from mass market websites, that this resort has attracted some particularly unappealing guests. Hallways were loud...could hear laughing/partying from our neighbors and throughout the corridors. Please note that the price we paid was comparable to a 3-star hotel, so there is some guilt in complaining. I cannot imagine, however, paying their websites rates and receiving such sub-standard service. NOT an exceptional resort.", "title": "We thought we'd give it another try. It's still not service-oriented", "user": "todd_fix", "date": "February 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 124927226}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed at this resort 2/12-2/15 for a conference. The accommodations and service were excellent. We had an end room with a great view of the pools and golf course. Bed was very comfortable.", "title": "Enjoyable visit", "helpfulness": 1, "user": "Jill T", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 124923386}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Although this is my first review of the property, I have stayed here many times over the last 5 or so years. Like most have commented, this place is huge. It is a convention hotel, period. Yes, there is a great golf course and other “resort” amenities, but first and foremost it is a convention hotel. If you are looking for a hotel for a Disney or other theme park vacation, I would not recommend Shingle Creek; there are other properties with similar amenities much closer to the parks. Now, if you want to get away for the weekend, play some golf and just relax without leaving the hotel, then Shingle Creek is a great choice. The hotel is always very presentable and the staff is great, mostly college students from UCF, but they are very attentive. The golf course, which I have played several times, is always in tournament shape and offers a nice challenge. The pools, lounge areas, and outside bar are always clean and well staffed. Food at all the restaurants is good, including the steakhouse at the golf club. As others have mentioned, there are extra charges for several things including the fitness center (have never used), in-room internet (lobby is free), and parking is usually around $20/day for valet. They do not charge a “resort” fee like some other area hotels, so the extra charges are not that bad, just be prepared. If you get a good room rate, then your stay can be a good value compared to other properties. Looking forward to many more stays at this property and will update my reviews as they occur.", "title": "Great all-in-one property", "helpfulness": 1, "user": "Gehrig438", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124921650}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "In Orlando for business (trade show), booked accomodations based on proximity to Orange County Convention Center and PRICE.(Priceline) I had luxury resort accomodations and amenities, at super bargain price.", "title": "Great Value", "helpfulness": 1, "user": "enorms", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124906522}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Stayed there for three nights with a suppliers convention.The hotel was spotless and all staff that I had contact with were helpfull and friendly.Pool is decent and only ate at one of the resturants,it was the breakfast buffet (can't remember the name) food was good and I thought reasonably priced.", "title": "Very nice convention geared hotel", "user": "Timwestcreek", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100434761}, {"rating": 5.0, "title": "Very nice property, parking a little far away and $12/day", "text": "Spent 4 nights here for a business convention. This property is top notch. Rooms not large, but include a refrigerator and flat screen tv with what appeared to be some hd channels. In room coffee was nice. I was told that the convention host provided the in room internet service, so I can't say if they normally charge for this. The room was priced handsomely around $250/night. Very nice property and rooms, the guests seemed to be enjoying the pool as I worked. There is a golf course on sight, which others told me was a nice layout. Great property and convention facilities, everything you could want. But why is the self park so far away? This was a drag and on top of that you pay $12/day.", "user": "Fusebuddy", "date": "March 14, 2011", "id": 100170793}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "So I just checked in this morning. Kiersten on front desk was super helpful finding me a room in the same wing as my parents who are here also. Hotel room is nice - reminds me of an upscale Marriott Courtyard with the separate washroom/toilet etc. Property is beautiful with great views, very peaceful.", "title": "Pretty nice resort - just watch for the taxi scam", "helpfulness": 5, "user": "LeahHaydock", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100082832}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Pool is great, lots of towels and no nonsense with towel cards like Marriott Harbor Beach for example. Great service at the pool bar - excellent margarita on the rocks.", "title": "Eh", "helpfulness": 1, "user": "HonestReviewForU", "date": "March 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 99826577}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Internet is wired in the rooms - boo - when will hotels realize that you don't want to be stuck at the desk wired to an ethernet cable? It's $9.95/day for \"regular\" access - seems OK. The user interface is a bit clunky but there's a help desk number to call and I was online in around 3 minutes. So no major complaints.", "title": "Mixed Emotions", "user": "LynnLJM", "date": "March 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 99802092}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Rosen Shingle Creek is a huge resort with all the amenities that that you expect from a 5-star resort: 1500 rooms, golf course, spa, pools, hot tub, arcade, several restaurants, banquet / conference facilities, etc. The rooms are spacious with a classical decor. One very small quibble is that, for such comfortable, luxurious beds, the pillows were small with cheap foam filling. They have a small market that is open 24hrs - very convenient. I tried 2 of the restaurants and the food was excellent as was the service. What prevented me from giving an Excellent rating is the fact that they charged extra for both WiFi and use of the fitness center. 5-10 years ago, WiFi was a \"luxury\" but these days, everyone from business people to families travel with tablets, laptops, smart phones so it should be included in the price of the room. As for the fitness center, I don't remember the last time I had to pay extra to go work out in a hotel... It is one of the nicer fitness centers that I've seen a hotel but it still irked me to have to pay extra for its use.", "title": "Huge, beautiful resort but...", "user": "sensfan12", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 130818760}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "So overall, I would recommend this resort as it has all the amenities that you need but be prepared to pay extra for some of the basics....", "title": "Can't wait to go back!!", "helpfulness": 1, "user": "nycnaper", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130779930}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "To start off I am a very picky person. I research a lot and try to pick the best possible place. And let me tell you this place was serene from the moment we entered the gated entrance. I like the fact that this is away from the main roads where most of the tourist hotels are. This place has a presence, very grand. The main lobby is magnificent, extremely clean and welcoming. Lots of greenery and water fountains to make you feel at peace. Its has a lot of rooms and very large place, but you still feel the peace and serenity. Location is close to major roads and highways. Hotel is within 30 minutes from airport.", "title": "AMAZING RESORT!", "helpfulness": 1, "user": "Douglas A", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130760359}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The rooms are very clean with a mix of modern and traditional feel. The views overlook the golf course, which is nice. I have no complaints about the room, loved it. Make sure you ask for a room near the elevator though, because this place is so big, rooms extend quite far away from the elevators.", "title": "As good as it gets in Orlando!", "helpfulness": 2, "user": "golfergals", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130713711}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The pools are awesome, there are three huge pools, with hot tubs. Lots of room for everyone. Very clean pools. I didn't get a chance to use the gym and sauna, but my wife had used the spa services, and loved it, raved about how friendly the staff. There are plenty of choices of restaurants in the hotels, although we didn't try. There is a Publix (full scale supermarket chain in florida) right across the street. We bought bottles of water and fruits to take to our room. Very convenient. You do have to pay about $16 for self parking for 24 hour period, with in and out privileges, valet was $20. You also have to pay spa, gym fee for access per day. There is a fee also for internet. Even with the fees, this place is worth it, given we got the hotel for cheap through bidding.", "title": "Excellent, will be back", "helpfulness": 1, "user": "NP1976", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130686081}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We attended a convention for several days that was held at the Rosen Shingle Creek Resort and stayed here in the hotel as well. The rooms were very comfortable, though not extraordinary, and the common areas were very nice.", "title": "Very nice stay for a convention", "helpfulness": 1, "user": "MrsT21", "date": "February 17, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 124741264}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The staff at the hotel and convention center were great -- everyone was very friendly and extremely attentive. The food served for the convention was very tasty, and the hotel made some special accommodations for us with some special events during the convention that really took the service above and beyond.", "title": "Loved This Resort!!", "helpfulness": 1, "user": "Meghan H", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124690595}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "As far as location, the hotel is an easy drive to Universal, Sea World, and even Disney World.", "title": "Beautiful Sleep!", "user": "Merdog", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124635488}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Our family just returned from a week at this resort and it was fantastic! My kids did not want to come home. The staff was friendly, grounds were beautiful and the housekeeping crew were fantastic. Their disney plush toys were always in a fun, new spot upon our return every evening to the resort. It was a magical stay for all of us. A special thank you to Troy for his assistance before our arrival with our reservation. We cannot wait to return!!", "title": "Four Stars Confirmed!", "user": "gjohns45", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 124541125}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "The Rosen Shingle Creek is truly remarkable. Yes, it's a big place and it requires some walking it is totally worth it. I went ahead and splurged on valet parking and don't regret it. The valets were very helpful and polite. My car was brought around when I called and I was on the road in time.", "title": "Scary!", "helpfulness": 1, "user": "Airchuck", "date": "February 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 124485334}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed for one night. Everything was perfect. The property is gorgeous. All one has to do is look out a window on the back side of the hotel and see the four swimming pools surrounded by beautiful landscaping to appreciate the quality of the planning and construction that went into building the resort. The web site says that there are 14 restaurants on the property. I ate at two and they were both very good. I also used the spa and found it to be much better than average. I plan to return soon.", "title": "Outstanding!", "user": "jim33625", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124476796}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We booked this resort by chance using a discount travel site. We got a steal of a deal on this enormous beautiful resort. You could spend most of your trip exploring this place and not see it all. The rooms were spotless and beautiful, the staff friendly, the grounds and pools stunning. This place is truly top notch.", "title": "Can't wait to stay here again!", "user": "MegCole", "date": "February 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124429186}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Overall the stay was very nice. Clean. Pleasant staff. The Italian restaurant needs some help. Was dining by my self and was seated at what seamed more like a diner bar than a nice restaurant. It took forever to get waited on. It was as if you weren't really dinning just some schmuck bellied up to the bar. In my opinion there should not be seating there. It is way too busy Had people buzzing by but no one noticed i was not getting waited on, including a couple of guys sporting high dollar suits which i would assume were manegers. Ordered a $100 bottle of wine. And waited. Finished three full glasses of sparkling water and waited. Finally got frustrated and went to the bar. The bartender did try to make it right and brought my dinner to me but was so irritated I declined his offer. Went to the sushi bar and had dinner These guys were top notch the sushi was great.", "title": "Nice place.", "helpfulness": 1, "user": "valleylumber", "date": "February 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 124398127}, {"rating": 1.0, "title": "Reservation problems / bad business", "text": "On 2/9/12 I saw on RSCR's web site that they had a golf/ stay package starting at $199.00. It included 1 night stay and 1 round of golf for 2. I called reservations, told them what I wanted and she quoted me a price of $149.00, plus tax. I repeated everything that was on their web site and asked her to confirm that this was the same package. She confirmed that it was, so I booked it for 2/17/12. I told some friends about it and they called RSCR to also make reservations. RSCR told them that the package didn't exist at that price, so they pulled up my reservations. RSCR told them that my package didn't include golf. I called RSCR, spoke to manager Jeff and explained the situation. He went back and listened to the phone tapes, confirmed that his rep. had offered the golf /room package of 1 night stay and 1 round of golf for 2 inclusive at $149.00, plus tax, but he would not honor my reservation. My cost would be $309.00 , with golf included. His resolution to the problem was to \"let me\" cancel my reservations. For the record, their policy is 5 day advance cancellation at n/c. I was 8 days out, so thanks again for nothing. Just for the record, what ever happened to the $199.00 all inclusive package that is advertised on the web site?", "helpfulness": 6, "user": "CHARLES W", "date": "February 9, 2012", "id": 124356021}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This is the 2nd time we have stayed at this hotel. It has a great location and is close to Sea World, International Drive, and Universal Studios. Resort is nice and clean with lots of good recreation opportunities such as 3 large pools, hot tub, walking/jobbing track, tennis, golf, fishing, etc. The dining choices are numerous on site and the food is good too. We all agree this is a great hotel in a great area. Two down sides that we noticed are: 1) They charge for parking! $16/self or $21/valet a day even thought they have HUGE parking lots. 2) No balcony on the standard room.", "title": "Nice Large Hotel Close to Sea World / Universal Studios", "user": "David M", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124342211}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "No.", "title": "Second Rate Hotel, First Class Cost", "helpfulness": 4, "user": "vagabiztravlr", "date": "May 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 130437698}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I cannot recommend this to anybody. Too many things wrong for a hotel that positions itself so highly --- and then fails to deliver.", "title": "Review of hotel", "user": "Gina A", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130431802}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Problems:", "title": "FANTASTIC!!! A++++++", "helpfulness": 1, "user": "Megan S", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130404251}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "- $16 / day for \"self-parking\". Despite many complaints on TripAdvisor, this policy persists.", "title": "Great potential - poor service, inferior housekeeping", "helpfulness": 2, "user": "HighTechTraveller", "date": "May 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 130397245}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- $25 /day for Internet. Steep", "title": "Great value! Amazing resort.", "user": "Angie T", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130370844}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We had the pleasure of staying three nights at the Rosen Shingle Creek. It is a gorgeous hotel, in a fabulous location, with top notch service.", "title": "4 Star Hotel, great value!", "helpfulness": 1, "user": "MommaFox", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124892497}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We had a king room on the 9th floor with a view of the enormous parking lot and I Drive area. The room was clean and nicely decorated. The bathroom spacious and clean. The bed itself was very comfy! Only negatives room-wise were the towels. A little ratty and just a lower quality than you would expect at such a nice hotel. Really surprising, actually given the quality of everythig else on property. It obviously did not affect my ability to enjoy my stay, just something I noticed.", "title": "Nice resort that includes a nice long walk.", "helpfulness": 1, "user": "FlaTripper75", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124884744}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We had breakfast at the buffet restaurant downstairs one morning. We did not order from the buffet, but opted for the regular menu. I got a fruit and cheese plate that was delicious. Our server, Mohammed, was polite and attentive.", "title": "Gorgeous Resort!", "helpfulness": 2, "user": "TravelLover41484", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124872412}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The parking lot is definitely gigantic and so is the hotel itself. As many reviewers have noticed, the parking fees are really insane. As often as they are mentioned as a source of contention by guests, I am surprised that the hotel doesn't choose to address this in some other way. I did not use wi-fi or the gym on this trip.", "title": "What a wonderful place to stay!", "user": "PalmBeachFloridaGirl", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124823691}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Service personnel were attentive on the whole. Prompt check-in, bell service, and valet. Friendly folks everywhere. Fellow guests courteous.", "title": "This place is HUGH", "helpfulness": 2, "user": "toby495", "date": "February 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 124765367}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This is the second time that we stayed at the Rosen Shingle. We stayed for 5 nights. The hotel is absolutely gorgeous. The rooms are a good size with a great view and were cleaned timely each day. The ice bucket was left unchanged twice during our stay (my pet peeve) but was promptly corrected upon notification. My family and I were vacationing, but there was also a conference in progress. There was a noticeable decline in customer service, including the valet losing our keys. During a busy period, the valet station threw our keys in the \"key bucket\" (full of keys which had not been properly put away). After waiting for almost 30 minutes for our car, the valet began searching for our keys. Having paid $21.00 a day for valet parking plus my usual tip, I was very annoyed. In room internet is $10 a day. Children enjoyed the pools and the beds slept well. The hotel is in a great location near famed attractions, shopping and restaurants.", "title": "Beautiful Hotel - Expensive Parking", "user": "C V", "date": "May 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130539646}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I have stayed at this hotel for both personal and business and each stay has been the same...WONDERFUL! The staff is friendly, the rooms are excellent, and the food is amazing!", "title": "ALWAYS A GREAT STAY!", "helpfulness": 1, "user": "AnW520", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130522966}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Not only is the Rosen Shingle Creek Resort a grand hotel, it is an all inclusive location for conferences and trade shows.There are a number of pools as well as Restraunts on site along with a gorgeous golf course for those of you who want to talk business on a more relaxed manner. The hotel is convenient to the airport and just a note of interest for those of you who like to pick up a few groceries for your room there is a new grocery store across the street from the hotel.", "title": "What a Great Place for a Conference", "helpfulness": 1, "user": "JVerschoyle", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130514017}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Spent almost a week at Rosen Shingle with Family. Great location, just minutes from Disney area and just under an hour drive to Cocoa Beach! Room was as expected, plenty of options for dining on the property, nice pools, and a great little \"convenience store\" right there in the resort. Very helpful staff, comfortable beds, and got a good price on the room. Just wish I had brought my golf clubs, as a beautiful course is right there on the property. Breakfast buffet was average, expected a little more, but overall, it was an enjoyable trip had by the entire family.", "title": "Good Times.....", "user": "brentcoe32", "date": "May 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 130461087}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed for a conference. Rooms and facilities are standard-nice. Place is huge as the title say, it sits in a golf course. It reminded me a lot of the big hotel casinos in Las Vegas. Stakehoese is overpriced and the stake substandard, I paid 40+ $$ for a stake that came overcooked. On the conferences side it is ridiculous not to have wi-fi available. In Orlando you need a car, in this place you need a car to get to your car on the parking lot.", "title": "Huge, nice hotel. Golfer's paradise I suppose...for conferences so so", "user": "Cuchovivas", "date": "May 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 130454080}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Love.Love.Love this hotel...I will be coming back again and again as long as I get it for a bargain price. Let's just say that we NEVER mind paying $20 per night for valet plus tip because we've always get the room for such a bargain...ok, enough of this. Here are the other reasons why I love this hotel:", "title": "AWESOME deal: 2-Star Price for a 4.5-Star Resort.", "user": "AlohaHana", "date": "February 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98069464}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "1. It has 4 or 5 pools (can't remember exactly). We love the adult pool at night and use the zero-entry pool during the day (good for kids).", "title": "NICE HOTEL - NOT WORTH THE PRICE !", "user": "scalderin2", "date": "February 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 97990682}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "2. Spa has sPecials (love that!)...not sure if that is always the case though.", "title": "Just so-so and too many extra charges", "user": "luli38", "date": "February 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 97146788}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "3. The Market is open even after midnight forLiquor, Midnight snacks or dessert run.", "title": "More than I could ask for", "user": "Dave1099", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96785451}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "4. Love to visit during slow seasons. It is an enormous hotel, so it's very nice and peaceful during these times. You feel like your one of 5 people there. Love that!", "title": "Perfect in every way", "user": "Saidude2", "date": "February 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 95331001}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Rosen Shingle Creek Resort was an “Awesome” place to stay. We thoroughly enjoyed our stay from the moment we arrived until we departed. The staff was very polite and professional and was able to accommodate all of our needs in a timely manner. The room was spacious and modern in décor, with plenty of towels, pillows and toiletries. Our bedroom view overlooked the golf course and was amazing. The resort was centrally located to all of the Theme Parks, which was perfect since that was the main purpose of our vacation. I only wish we had more time to take advantage of all of the amenities that this resort had to offer. We are looking forward to staying here again this year!", "title": "The Rosen Shingle Creek Resort was an “Awesome” place to stay!", "user": "Cyrax1701", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99590907}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "The negative reviews make me laugh. Here's a couple of things that I noticed that were complained about in the reviews:", "title": "What is there to complain about? Awesome stay!", "user": "disneyworldnerd", "date": "March 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 98994468}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "*Parking: Yes, it is twelve dollars a day to park. But no, it is not a country mile to get inside. It isn't a motor lodge! You can't pull right up to the door! I was a little peeved with the price (I knew it was coming because of the reviews) , but something that nobody has mentioned is that they have a courtesy shuttle that runs that will pick you up and take you to the front door! Seems to run more in the evening that the daytime.", "title": "Beautiful Hotel", "user": "bubub01", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98954453}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "*Prices: Why pay full price to come? We had a website \"negotiate\" a price that was under $100 night including tax. The market is expensive, but there is a beautiful, new Publix supermarket across the street for shopping.", "title": "Not worth the Money", "user": "1968Travelgirl", "date": "March 4, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 98934563}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "*Service: Rosen was as friendly and helpful a hotel as my wife and I have seen. Friendly service from the front desk to the workers we passed in the hallways.", "title": "Wonderful Stay In a Very Beautiful Hotel (Just Bring Your Own Soap)", "user": "Larchmere", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98924440}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 80, "average": 188, "very good": 545, "terrible": 50, "excellent": 878}, "aka": "Rosen Shingle Creek Hotel Orlando", "slim_ranking": 0.151975683891, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Rosen Shingle Creek proudly presents a combination of 1,500 luxury guestrooms and suites that are functional and classically styled with soothing earth tones and sumptuous bedding. Most guestrooms feature views of our beautiful manicured gardens, pools, and Shingle golf course. Our alluring suites, ranging from expansive hospitality parlors to the 1,744-square-foot presidential suites provide the perfect atmosphere for intimate gatherings."}