{"user_rating": 4.5, "review_count": 137, "name": "Rosewood Sand Hill", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We were impressed with the amenities and the room, which is quite spacious and nicely decorated. However the security afe was not working (battery was not installed), and wrong newspaper were delivred (we asked for FT, but San Francisco Chronicle was sent). The breakfast at Madera was pricy, and the waite was long (over 30 min.)! Food was of good quality, however. Check-out was problematic also.... They did not honor the promotion rate we secured weeks ago on the Rosewood's website, and they did not take the credit card on file, either. We had to spent over 30 min. for the hotel to fix the problems at check out, and almost miss our flight because of that. Note: Stayed there in March 2009 when they were just opened...I hope their services and computer system have improved since. But still didn't believe they have any excuse to performed so badly. First impression counts!", "title": "Luxury Hotel with unevent services--What a disappointment", "helpfulness": 1, "user": "bibi t", "date": "February 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125250381}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Fantastic high tech room, good pool, hot bar, excellent food, tremendous view, very close to campus.", "title": "Best place when visiting Stanford", "helpfulness": 1, "user": "silasabby", "date": "February 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124432849}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Silicon Valley has been described by many as a souless place - not so the Rosewood. Everything about the experience reflects a high-touch, luxury experience and, despite the proximity to the 280, a relative sea of tranquility.", "title": "An Island of Luxury in Silicon Valley", "helpfulness": 2, "user": "Boh_1", "date": "January 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123630379}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Rather than repeating many of the very accurate previous reviews, form the perspective of Salomone in the technology sector, the Rosewood is in close proximity to the always important Sandhill and Page Mill Road locale of technology companies and venture capitalists, offering a great opportunity to meet, deal or simply chill either inside but the fire, or outside on the terrace. The after sunset crowd is also fascinating, a mixture of businessmen, couples and those wishing to meet the next billionaires. The only negative is the restaurant itself which offers truly average food.", "title": "Sprawling property with luxurious rooms", "helpfulness": 1, "user": "tripgal1", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121905137}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Overall, worth a visit, worth a drink, and definitively worth a stay if you are in the area.", "title": "best hotel in the bay area", "helpfulness": 1, "user": "truth40", "date": "December 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0}, "id": 121535796}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "OK, the freeway is close by, but I didn't really feel that it affected my stay at all. This is quite a beautiful property, with spacious rooms and bathrooms, and lovely common areas. For me, not sure if I would pick it for a leisure vacation, but if you have business in the area, or are visiting Stanford University, you simply can't do better, and will be very grateful for this choice. I know I plan to use it a lot.", "title": "Really quite beautiful", "user": "kingsroadgal", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129758862}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Nice touches...Sprinkles cupcakes greet you when you check into your room; for breakfast, coffee and mini muffins are left in the lobby early in the morning; gym is open 24 hours and is very nice and large; and free self-parking. On top of this, the rooms are well-maintained with great linen and a huge shower. Large countertops in the bathrooms to lay out your toiletries. I felt really comfortable in the room. Also beautiful grounds and pool.", "title": "impeccable service, great food, lovely rooms, but pricey", "user": "savage55555", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129541549}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Defects are the freeway noise, which didn't bother me, but does detract a little. Also, the rooms are spread out, although I did find parking around the back of the hotel which was much closer to my room and made things considerably more convenient. The other thing I didn't like is that the rooms are basically directly facing each other as they are in buildings which run parallel to each other. I didn't feel that the privacy was what it could be. You definitely will want to close your curtains at many points when you are in the room. I think you definitely need a car at this hotel, at least I would, but there are many nice areas to explore closeby, such as downtown Menlo Park. Oh, and the hotel is pricey, but you do get a lot for the money.", "title": "Best hotel in Menlo Park and Silicon Valley", "user": "JerryR10", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129428566}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I will definitely come back to this property.", "title": "Your view is the highway", "helpfulness": 4, "user": "Cristina M", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 129073627}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "the experience at rosewood sand hill is one of really amazing service all around. having traveled substantially at top end resorts and business hotels i've rarely encountered service like this as consistently as it was displayed at rosewood. basically every single employee delivered flawless service. the food at rosewood is excellent--both at madera and in the bar. the rooms are really nice, and the pool area is beautiful. additionally, we had a substantial problem with our room and it was corrected elegantly. generally a great place to stay. the rack rate is very expensive though for what you get, and even at heavy discounts the hotel is probably a bit overpriced. i suppose this is what comes from not having any real competition--the closest comparable hotel is all the way at 101. no question rosewood is the best hotel for the stanford/VC area.", "title": "The Best Choice in This Area, But Not Without Shortcomings", "helpfulness": 4, "user": "theLuckiestGuy", "date": "April 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128284160}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed while my son was interviewing for medical residency at Stanford. This resort was above all expectations and I have stayed at other Rosewood resorts. The rooms are incredibly quiet even though it was at 100% occupancy. No noise at all, the blinds really do block all the light so if you want to take a nap you can. The beds are super comfortable.", "title": "incredible service and facilities", "helpfulness": 2, "user": "LaurettaYoung", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121218215}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The towels are plush, the amenities in the bathroom are top notch including the bath salts. Altogether amazingly wonderful.", "title": "a most pleasant stay and experience", "user": "Joseph A", "date": "November 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120837381}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The Madera restaurant deserves its rave reviews. Every small detail was well done. The food was perfect. The service superb.", "title": "Service above and beyond.....", "user": "glbltrotter", "date": "November 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120756697}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The spa was well worth the expense. Best facial ( from Joy) and Massage ( Kim) I have ever had in my entire life and I am over 50 and been to many highly rated spas.", "title": "False promises", "helpfulness": 1, "user": "D18V", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120554385}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The only downsides are things that the property may not be able to control. For example there are so many FLIES outside. They land on you as you sit on the pool deck or your patio and we were here in the WINTER. They are inside the lobby too and land on you at the bar, in the restaurant. Beats me how to get rid of them in a way that doesn't drench everything with pesticide-- maybe import some fly eating birds ( but then they poop everywhere). That was quite annoying actually. The local taxis are very poor. Every single time we had issues as did other guests. The drivers are frankly unsafe AND don't have a clue where anything IS. Even when we asked to be picked up at the \"oval at Stanford\" which is a local landmark the barely English speaking driver wanted an exact address for his GPS. Then on the return to the hotel he didn't know where the Rosewood was and couldn't spell Sand ( as in Sand hill drive) so my son had to get out his GPS on his phone and direct the driver who turned the wrong way on a one way street. My advice is to rent your own car-- also you WAIT and WAIT for a Taxi-- at least half an hour, there don't seem to be any taxi stands at tourist areas...", "title": "Fantastic Resort in the heart of Silicon Valley", "user": "JHeieck", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120443909}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The Rosewood Sand Hill hotel is one of the best that I've stayed at. It feels like an up-market Asian five star hotel but in the US. The rooms are extremely large with beautiful bathrooms. There is an excellent gym with both cardio and weights that is open 24 hours a day. The food is excellent. The only one small downside is that the hotel is located right next to a highway: although you don't hear the highway from the rooms themselves, you do hear some traffic noise when you are walking around the grounds of the hotel.", "title": "Fantastic hotel", "user": "KitweTraveller", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127053269}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Lovely hotel with outstanding service. Perfect for events -- particularly business.", "title": "Excellent service; perfect for business", "user": "MackGold", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126652216}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "THE ROSEWOOD is a very upscale hotel, not your run of the mill hotel rooms, everything is 4 star, the rooms are tastefully decorated,and the ambiance of the hotel is special, Their restaurant has a Michelin star, you wont be disappointed.", "title": "An upscale hotel property.", "user": "barbaralee57", "date": "March 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125969669}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed here in March with a group of my colleagues, who are all in the hospitality business. We are a hard bunch to impress, and the staff at The Rosewood seemed to anticipate our each and every need. The room amenities are luxurious, and I love the walk in closet in the room. The Rosewood is in the heart of Silicon Valley, where it's hard to make a name for your menu since there are so many fantastic places to eat. I had two of the most delicious and memorable meals there - one in the restaurant, and the other was a banquet function. The spa and the pool and the general layout of the hotel make you feel like you are worlds away even though I live 20 minutes from the hotel. I will definitely visit again, and next time just for pleasure.", "title": "Stayed for business and pleasure", "user": "liza77", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125717003}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I LOVE staying at this hotel. We don't live very far from the hotel, but when hubby and I want a weekend getaway without kids, this is my top choice for luxury and pampering. It's very upscale but casual--very Silicon Valley.", "title": "Pure Luxury", "user": "triptakers", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 125322710}], "location": {"country": "United States", "city": "Menlo Park"}, "stars": 5, "variance": {"poor": 4, "average": 8, "very good": 29, "terrible": 2, "excellent": 94}, "aka": "Rosewood Sand Hill Hotel", "slim_ranking": 0.25, "description": "Nestled amid 16 pristine acres in Silicon Valley, Rosewood Sand Hill® melds the rich heritage of relaxed California Ranch architecture with fragrant gardens and stunning Bay Area views of the Santa Cruz Mountains. The hotel appeals to an array of guest experiences with resort-like amenities, lush courtyard gardens and local charm. Whether relaxing in the largest guestrooms on the peninsula, indulging at Sense® spa or delighting in the freshest of fare at the Michelin-starred restaurant, Madera, guests enjoy unparalleled attention to detail and service."}