{"user_rating": 5.0, "review_count": 98, "name": "Rosehaven Inn Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We found this place last minute and were very pleased we did. Beautiful grounds! Clean, comfortable rooms. Welcoming and pleasant hosts. We couldn't have asked for much more.", "title": "Wonderful Find", "user": "greegor22", "date": "July 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133406119}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second time coming to Rosehaven Inn, a perfect romantic getaway. With just four beautifully appointed rooms, complete with gas fireplace and jacuzzi, it is the perfect combination of early American elegance in a bed and breakfast with the modern comforts. Kelly and Sean make all of their guests, who range from older couples to college students, feel welcome. I especially liked the wallpaper on the ceilings, which add warmth to the dining and living rooms. This is a classic bed and breakfast, complete with the quiet sitting rooms and ticking grandfather clock. The surrounding area has wonderful trails and a spectacular gorge with waterfall. It's very close to Hunter Mountain, which now has snowtubing for non-skiers.", "title": "A Perfect Romantic Getaway", "user": "NYVacationMaven", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124199663}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The house was exactly like it looked in the pictures. The breakfast was amazing both days and it was nice to talk to the other guests. Kelly and Sean were really helpful with suggestions for snowshoeing and even lent us a phone charger when we forgot ours at home. We stayed in room #1, which has a gas fireplace and whirlpool bath, which were both perfect after a long winter hike. We would definitely recommend Rosehaven Inn for anyone looking for a clean and cozy B&B in the Catskills. Make sure to follow the directions on the website which are perfect and your GPS may not find the address.", "title": "Cozy B&B in the Catskills", "user": "JillNYC2612", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123520851}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Rosehaven was very clean and very homey. We stayed in room #3 which was very spacious and clean. Kelly and her husband were really nice and helpful in directing us where to hike. Breakfast was delicious both days, although it was a bit early... would be nice if they had a longer breakfast time frame than 8:30-9:30. The whole house was extremely quiet.", "title": "Great weekend away", "helpfulness": 1, "user": "kh83", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121143112}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This was my boyfriend and I's first trip to a bed and breakfast together (my first time ever, too) and we LOVED it. We needed a quick getaway from NYC and we couldn't have asked for anything more - beautiful, clean home, perfect room to really relax, quiet... I recommend bringing a bottle of wine (they have glasses you can use), some bubbles, and relaxing music.", "title": "Romantic and relaxing stay", "user": "Pattyios", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119793646}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "9/10 - 16/10 was a delightful week spent in this beautiful B&B with gracious hosts who shared their knowledge of the area abundantly. Breakfasts around a family table where a delight with dietary needs catered for with minimum fuss. Kelly is a very thoughtful hostess who takes care of little details that make guests feel special. I would stay nowhere else when I visit the area again.", "title": "A Rare Delight", "helpfulness": 1, "user": "Elseline", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119426742}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I went away for a quick weekend getaway over a three day weekend, we had spoken with Kelly a few times before coming up and were really excited-- and when got there we found the place was very charming. The view and scenery and mountains were very calming and relaxing, the rooms were clean and very well done and decorated and the beds and linens very clean and comfortable....", "title": "Nice rooms, great stay, few minor touches missing to make it really exceptional", "user": "michnyc1", "date": "September 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118413903}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The drive into the main part of town is less than five minutes, and there were lots of great places to eat, or have a drink, and lots to do nearby.", "title": "A Lovely Time at the Rosehaven Inn", "user": "Anna W", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117412168}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Only critique- the in room mini fridges have complimentary beverages- ONLY SODA. No bottled water, no pitchers of water left out at the coffee station. We drink lots of water a day, and had to run out to the market and stock up. At the price for the room for a weekend, it should have been there, with out having to ask for glass of iced water. Also, you have to be down for breakfast early; its served between 830am-930 am only. Kelly makes fantastic breakfasts, but it is whatever she has prepared for the morning- no choices.", "title": "One of the nicest BB's we've ever stayed in. We can't wait to go back.", "user": "sla390", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116211419}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Walked into CURRANS restaurant- DO NOT GO! No where does it suggest to make reservations- snarky bar tender yelled out to ask if we had reservations (no maitre d or hostess- I mean where does the bartender act as hostess- while still behind the bar??) . I was immediately put off by her tone and demeanor. She said the best she could was 830pm that night (it was 7 pm). Would not have been so bad, but she didnt offer us a seat at the bar, or one of the tables on the bar side? So rude. Walked out, calmly (although I was dying to tell her off) and went down the street to a fantastic restaurant, and was SO GLAD WE DID!!", "title": "Charming, well appointed but a bit dark", "user": "islabery", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 115716694}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We travelled from New York for a relaxing getaway and we certainly found just that in Rosehaven Inn. It was simply wonderful. The rooms are just as they are described and pictured: luxuriously appointed, quite spacious and incredibly clean. The house itself is absolutely gorgeous, from wraparound porch to the beautifully decorated common rooms to the exquisite wallpapers. Moreover, the grounds and surrounding scenery are simply stunning. Best of all, innkeeper Kelly is a delight. She gave us exact directions that helped us find the inn after dark, as we arrived very late. Although she had retired for the evening, she left us a welcoming note that explained everything we needed to know about the workings of the room. She's very attentive at breakfast, ensuring that each guest has the breakfast they desire. And she's full of info about the area's amenities, including her new restaurant venture. We had an outstanding dinner at Curran's on their prix fixe night (a real bargain). The food and service were excellent. The chef even offered vegetarian options not on the menu. Our getaway was a very special occasion for us. It was made all the more special by staying at Rosehaven. We can't wait to return!", "title": "Fantabulous", "helpfulness": 1, "user": "GayleNYC", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86183297}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Me and my girlfriend stayed at the Rosehaven this past weekend and we had a great time. Kelly and her husband were terrific hosts. The inn was very nicely appointed, very clean, very welcoming, and the breakfast was excellent. The house itself is beautiful. What really makes a B&B stay pleasant are the hosts. They provided not only a great breakfast both days but also tips as to where to hike and where to eat. This is a really well run B&B. The breakfasts included and egg dish both days, fresh fruit, fresh baked banana bread, breakfast cinnamon roll, pancakes, pecan waffles, fresh coffee, and orange juice. The mid October timeframe was great since the area foliage was in full-color stage. It was quite stunning. The room had a jacuzzi, fireplace, spacious bathroom, television, in room mini-fridge, and wonderful views of the property and surrounding landscape. They were totally cool with us leaving a little after checkout time on Sunday so we could hike the local Kaaterskill Falls. We hiked the escarpment trail by North-South Lake (7 miles with amazing views), drove to Belleayre Mtn for Oktoberfest, took a drive to Woodstock, and went to Saugerties on the way home. Highly recommended", "title": "Rosehaven Inn was Great", "user": "NYCRJR", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83955774}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We celebrated our anniversary here and were not disappointed. Jane was innsitting for Kellly, and what a gem she is!! Kelly need not worry that her inn, guest, (and her animals!) are well taken care of in her absence. Jane cheerfully greeted us and made us feel welcome from the minute we walked up the steps to the inn. The wrap around porch was great. We had some cheese, crackers, and wine there one afternoon after hiking and also enjoyed browsing the books about the local area that are found in the sitting room.", "title": "PERFECT IN EVERY WAY", "user": "fumble", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83223813}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Jane was very knowledgable about the area, and we also received tips from the other guests about hiking. We went to the beer and wine festival at Hunter Mountain and met up with another couple also staying at the inn. This was their 3rd visit and we can understand why they keep coming back.", "title": "Truly Wonderful Experience", "user": "spoiledbrat06032", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 81661201}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed 3 nights in Room 2. It was beautiful! The bathroom is very spacious! The deck was wonderful, and a lot bigger than I thought it would be.", "title": "Great two day getaway from City, tasteful rooms with gourmet breakfast!", "user": "perlman98", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77410306}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Came back for Memorial Day weekend after having such an amazing stay last year. It was just as good! Hosts are so lovely, welcoming and knowledgeable about the area. Bedroom was very comfortable, bed was heavenly, bathroom enormous, plenty of hot water. Air-conditioning works very well or you can go with open windows and the ceiling fan (important in the summer even up in the Catskills!). The common areas are just gorgeous too - the details in every piece of furniture, stained glass, and wall covering make it so special. Breakfast was simply outstanding - each morning we were welcomed with a smile, coffee or tea, orange juice, a baked good (the scones are still my favorite), a sweet dish (in our three days we had Belgian waffles, pancakes, and insanely delicious baked French toast with a blueberry bottom), and an egg dish. Diet buster :) We were so full that we didn't even need lunch on our hikes. On that note, get their advice - great knowledge of local area and how to enjoy these beautiful mountains.", "title": "Another fantastic stay at this lovely B&B", "user": "TravelCuties", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112090370}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Writing this review makes me want to go back!!!", "title": "This place is the best!", "user": "jlc16", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97632981}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Enjoy the Catskills!", "title": "Perfect Getaway", "user": "adriene81", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95773039}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband and I stayed at Rosehaven twice and plan to go back. The place is beautiful and very relaxing and peaceful. The rooms are gorgeous with very comfortable beds and furniture and the bathrooms with the spa bathtubs are fantastic. The innkeeper, Kelly, is great. She makes you feel right at home and gives fantastic recommendations for things to do in the area. Her restaurant in town, Curran's, is amazing. We went skiing at Hunter when we were up there in the winter and over the summer Kelly recommended we hike down the river below Kaaterskill Falls and it was amazing. There are tons of great restaurants and shops in town, and lots of great things to see and hiking to do nearby. The area is really beautiful.", "title": "BEST B&B I HAVE STAYED AT!! AMAZING EXPERIENCE", "user": "LISAHoboken_NJ", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94312198}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This was our first stay at a B&B and I must say we were exremely happy with our choice to stay at Rosehaven Inn. We arrived after check in time. Kelly left our key along with a letter with info regarding places to grab a bite to eat when we arrived, breakfast times, etc.... We stayed in room 3, it was very spacious. The room had everything you could want or need (except for an iron). Plenty of drawer and closet space (had hangers in it). There was soap and shampoo in the shower (which was very appreciated being that my boyfriend thought I packed the soap and I thought he packed it! lol). There is also a pillar candle next to the tub, very relaxing, not very comfortable for two people, down fall is that there are NO steps to get in & out of the tub so be careful. The bed was amazing!!! Everytime I go away, without fail, I don't get any sleep. I slept better in their bed than I do in my own :)) Room was immaculate.", "title": "Great B&B", "user": "tapks_10", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87999717}], "location": {"country": "United States", "city": "Haines Falls"}, "variance": {"poor": 1, "average": 1, "very good": 10, "terrible": 1, "excellent": 85}, "aka": "Rosehaven Hotel", "slim_ranking": 0.5}