{"user_rating": 3.5, "review_count": 337, "name": "Rosedale On The Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I would highly recommend Rosedale on the Park. We tried to book via the on line web site but it wasn't a secure site so we booked through expedia. Apart from that slight hitch we had a fantastic time, when we checked in we were told that we were going to be upgraded to a larger suite and it was fantastic. We had a seperate bedroom with a very comfy bed and a larger sitting room with kitchenette. The staff were all very friendly and we tried out the room service and the food was fantastic. We ate breakfast in the hotel and got the buffet for $70HK each, a discount of 30% because we were guests. I would recomend this hotel for either a long or short term stay.", "title": "Great Hotel", "helpfulness": 5, "user": "T-A-UK", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8450779}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "After reading a fair few reviews on this site and having decided I didnt want to pay for 5 star on this trip I settled for Rosedale on the Park which seemed to have pretty good reviews, compared to the hotel I had previously booked which didnt fayre too well.", "title": "Average to above average, good value.", "helpfulness": 10, "user": "Sherro74", "date": "May 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7673734, "likes": {"liked": "— Price and location", "disliked": "— TV had only 2 English channels and 28 Chinese, small winge as didnt really want to watch TV.."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Anyone who has stayed in Hong Kong will know that the difference between 4 star bottom and 5 star top is very significant and in most cases you really do get what you pay for..", "title": "Lovely Hotel", "helpfulness": 6, "user": "WelshLady", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7280349, "likes": {"liked": "— Location"}}, {"rating": 3.0, "title": "Small rooms", "text": "With Rosedale, it is cheap, I compared it against 3-4 other 4 star hotels I knew of and it was about $70aus cheaper so thats a bonus. Rooms are small, but again, experience in Hong Kong tells you that you will get a small room in 4 star on a budget.", "helpfulness": 1, "user": "DuncyBoy", "date": "December 15, 2006", "id": 6445032}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "I was upgraded to an exec room which is no different to a superior, but it is higher up, had a nice view and a double bed. The bed was fantastic, really comfortable with a big Duvet so I slept like a champion 3 nights in a row which is good for me when travelling.", "title": "very good", "helpfulness": 7, "user": "Porker2", "date": "December 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6340976, "likes": {"liked": "— use the MTR to get around, and buy an Octopus card to do it..."}}, {"rating": 5.0, "title": "Great Place. Good Value", "text": "This hotel is lovely. The staff are friendly, the rooms are clean and well presented. Services are up to expectations, and the location is superb.", "user": "greg-nz", "date": "January 20, 2006", "id": 4366396}, {"rating": 4.0, "title": "Other than small room, its a nice place to stay", "text": "By Hong Kong standards the rooms are normal in size. For a modest charge, I suggest an upgrade from a Standard Room to a Baby Suite. That gave us plenty of spare room and a kitchenette with microwave.", "user": "Almaden", "date": "December 14, 2005", "id": 4242092}, {"rating": 5.0, "title": "Big Bang for your Buck!", "text": "We stayed 6 nights and will definitely return.", "user": "A TripAdvisor user", "date": "September 10, 2005", "id": 3891945}, {"rating": 4.0, "title": "Great Place at Rosedale", "text": "Rosedale On The Park is no longer a Best Western. The Hotel itself was much smaller than expected but the location to an MTR Subway station and Victoria Park was nice. There are stores and restaurants within easy walking distance. Our room was amazingly small for 2 adults with full sized bags. If you are over 6 foot tall, you may find the bed to be too short. Floor space is almost non-existent in a room with two beds… if someone is sitting at the desk, the other person has no choice but to climb over the beds to get past. The bathroom is on the small side too… almost no counterspace for two people to put their stuff. Our non-smoking room was very clean, and well maintained. Our view from the 12th floor was straight into an old apartment building so basically we keep the curtains closed. Rooms closer to the top of the building have better views over the building we faced. FREE internet access in the room was a nice touch and if you don’t have a computer, they have one available free in the Sky Lounge on the top floor. The free mini-bar consisted of 5 cans (beer/soda) on our first night. The staff of the hotel is friendly and professional.", "user": "BigHorse", "date": "August 30, 2005", "id": 3816543}, {"rating": 5.0, "title": "Great value for money", "text": "The location of the hotel was fabulous as it was only five minutes walk from Causeway Bay which is the centre of some major shopping. In turn, it is right across the street from Victoria Park and half a block away from the Hong Kong Central Library, which has hundreds of computers offering free internet. The rooms were clean and cosy and were equipped with every little thing one could need including: a free first round of mini bar goods including water and pop, free toothbrushes, free slippers, down comforters etc. The staff was friendly, although there were a few minor mishaps due to miscommunications. The lobby is clean and elegant, and everyone tried to be as helpful as possible.", "user": "warrenma", "date": "May 29, 2005", "id": 3508149}, {"rating": 4.0, "title": "Great hotel for the price", "text": "Considering the price this is a very good hotel. The staff was very friendly and happy to help when we needed them. Free internet access was very usefull even if you can also go on the internet in the library next to the hotel, the location of the hotel is excellent, very close to the park, shopping and the metro. We tried the roof bar but it was a waste of time.", "user": "A TripAdvisor user", "date": "May 19, 2005", "id": 3484880}, {"rating": 3.0, "title": "Not bad for a budget hotel", "text": "Stayed here in October 2004. Room was small for 2 people, average service from the staff. We upgraded to a deluxe room without a inter connecting door to excape the noise next door. The deluxe room was exactly the same, same size, same interior except it was in dark wood not beech. If darkwood is supposed to be classier, they need not have bothered. It looked worse!", "user": "Dezzydez", "date": "April 8, 2005", "id": 3343978}, {"rating": 5.0, "title": "Top Class", "text": "They porter helpfully informed us that all rooms were the same size apart form the suites on the top floor.", "user": "Tipperary", "date": "March 23, 2005", "id": 3296612}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Okay, let's give this boutique hotel an exhaustive review because the property has earned a fair shake.", "title": "Great place for a second stay!!!", "helpfulness": 17, "user": "dekenney", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6334991, "likes": {"liked": "— The junior suite for the money.", "disliked": "— The walking."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "If this is your first trip to Hong Kong and likely to be your one and only visit, start looking elsewhere and be prepared to pay for your stay! Most importantly, don't complain - you will get that for which you will pay! The great thing about Hong Kong, as opposed to Shanghai, is that your money has value. Despite paying for service found wanting (e.g. Westin -Shanghai) or paying for rooms which should have a view and don't (e.g. Westin - Shanghai), Hong Kong has great hotels in great places like the Admiralty and Central areas. Be prepared to pay for the Harbor View, bite your lip and shell out the dough. You will get your money's worth and everyone will be pleased.", "title": "Met all expectations!", "helpfulness": 14, "user": "hemikiwi", "date": "November 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6307804, "likes": {"liked": "— Junior Suite at a relatively low cost. Free broadband in suite and rooms.", "disliked": "— Most Suites and rooms have interconnecting doors which means you may be unlucky with noisy neighbours, but we heard nothing from ours."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "However, if this is your second, third or fourth trip to Hong Kong, then the Rosedale on the Park (much like the Royal Park in Sha Tin) is a real treat. The property is clean as a whistle, situated close to the Trams for endless tramming for pennies and close to the bus stop for cheap rides around town, as well as up to the peak (#15) and over to the Star Ferry (#8). The elderly should be cognizant that staying at this little wonder will require a fair amount of walking unless the local cabs (ready and waiting) are used for quick trips to the shopping areas in reasonable proximity (Times Square and the Island Area). Don't be discouraged - all the hotels require a little hoofing.", "title": "Impressed", "helpfulness": 3, "user": "happymeghappy", "date": "November 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6233308, "likes": {"liked": "— Staff service and location", "disliked": "— Room was a little small"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Between Rosedale on the Park and the Park Lane, the junior suite at the Rosedale is a much better deal than a standard room at the Park Lane. They are more than likely priced comparably and the junior suite is a far superior deal. The Park Lane appears, deceivingly, to be a better deal, but the Rosedale on the Park simply shines.", "title": "Great Value Hotel", "helpfulness": 2, "user": "meltraveled", "date": "November 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6146154, "likes": {"liked": "— Well priced and conveniently located", "disliked": "— A bit dated"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "A great fish venue is right across the street and a more than reliable steakhouse is right around the corner. A 7-11 is close, too.", "title": "Great Hotel. Great Location.", "helpfulness": 1, "user": "BettyInToronto", "date": "October 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5949060, "likes": {"liked": "— Location", "disliked": "— Wait time for elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Had a very nice stay at Rosedale for 1 week. Everything was in order. I had a junior suite, and it was like having my own small 2-rooms appartment; one bedroom and one livingroom. (1 TV in each room). Nice standard, clean and bright decorated. I stayed at the 20th floor, and had a small view over towards Victoria Park/channel/the Kowloon side.", "title": "Great. Like having my own appartment.", "helpfulness": 3, "user": "Max_Norway", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5941579}, {"rating": 2.0, "title": "Get a suite.", "text": "If you stay here, get a suite, otherwise it’s not worth it. From the website, you can’t tell the difference between all the “non-Victorian” suites so here’s the deal. Aside from the Victorian, all the suites are the same, the only difference is how high up the floor is and accordingly the better the view. The views from the hotel aren’t so hot, so I’d recommend going with the cheapest suite, which is a nice size room and twice as large as a much more expensive regular room at the Grand. For the price of a junior suite, in a “Budget Hotel” you can’t beat it. We did have a problem with the reservations. We booked over the internet and neither of our two rooms was available when we arrived. We had to take a suite on a lower floor, but, same room, just less of a view and cheaper. The breakfast that came with the room was nice, the people friendly. Be prepared to explain to taxi drivers how to get there, many don't know where it is. Try showing them your room key, it has the address on it.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 14, 2006", "id": 5349423}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 14, "average": 87, "very good": 197, "terrible": 3, "excellent": 36}, "aka": "Rosedale On The Park Hotel Hong Kong", "slim_ranking": 0.27486437613, "description": "Rosedale On The Park rests at the corner of Causeway Bay, Hong Kong’s most vibrant and energetic area for shopping, dining, entertainment and business. With a view over the historic Victoria Park and the iconic Victoria Harbour, Rosedale Hong Kong brings you a hotel for tranquility and comfort right at the edge of excitement and life."}