{"user_rating": 4.0, "review_count": 628, "name": "Rott Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Rooms clean quiet and private despite being in the heart of the city. Check in quick and efficient. Breakfast buffet staff seemed overwhelmed during morning rush and we had to wait for table. Lobby quiet and had simple elegance. Would stay again as can't beat location and overall value.", "title": "Good clean quiet in the heart of Prague", "user": "PBenjung", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115554415}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Located just around the corner from the famous clock tower and adjacent to the Hard Rock Cafe, we were concerned that this would be a noisy spot. We had a good-sized room on an interior courtyard and were very happy. Best breakfast we had in Central Europe; excellent staff; good wi-fi and internet connections. Can't do better on price in such a central location.", "title": "Excellent location, great service", "user": "CJN5", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115157450}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "for a 3 star hotel in prague this cannot be beat - it has an awesome location / less than 100 yards than the astronomical clock yet it is quiet which i wanted. the staff are very very helpful and very friendly - i have been travelling europe and this is by far the best 3 star hotel i have ever stayed in - i tried to write a review yesterday but forgot my passport - in the meantime they sent a bottle of champagne to my room for my birthday without even me telling them.", "title": "awesome", "helpfulness": 2, "user": "MassachusettsJerry", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115101575}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "you will not be disappointed with this hotel. again, i think it is awesome", "title": "Great Hotel,Great Location,Great Staff.", "user": "lStephano", "date": "July 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115051882}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had a great stay in this hotel at the end of June. Staff could not be more helpful,especially at Reception. Breakfast was of a high quality and good variety.", "title": "Perfect location, beautiful hotel", "user": "EinMtnVw", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114941849}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I stayed 8 nights at the Rott, during a week-long conference in July 2011. I selected the Rott for two reasons: (1) friends in Prague checked it out in advance; and (2) they offered a substantial pay-in-advance discount (I paid just 72.25 euros per night, and just 68 for the final night). The Rott was excellent. Clean, friendly desk help, great breakfast. It's right next to the Hard Rock Cafe, but totally quiet; I never even heard anyone in the hall (I was on the top floor). There are two elevators, which helps. And very important for the summer (as much for the street noise as the weather): it's air-conditioned. The location simply cannot be beat: 5-10 walk to everything. Highly recommended.", "title": "Fine hotel", "helpfulness": 1, "user": "Genings", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116281243}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I stayed with my husband for three days and it couln't be in a better location, a few steps to the famous clock in the Old Plaza. the hotel is right next to Hard Rock Cafe, but never loud or crowded. Excellent service, people at the front desk were very helpful, nice and friendly. Wireless internet in public areas yet I was able to connect from my romm since it was on 2nd. floor on top of the restaurant. I would defenetly would stay in this hotel on my next visit to Prague.", "title": "Excellent location and service", "user": "Teteita", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116275122}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Everything about this hotel was exceptional.--location, staff food room. We would go back tomorrow!!", "title": "Wonderful little jewel", "user": "rwadge", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115917545}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The room was long and narrow, with single beds along one wall. The air conditioner was at the door and slightly around a corner, but it did work. The desk people were very friendly and helpful. I especially liked the old windows (double) that opened, and the view from the room was charming. I always like a good view, and at night the church nearby was lit up. The room was very quiet, and the street below not very busy. The hotel is just half a block off the main square, so a good location. Breakfast was fine. Certainly an adequate hotel, but the single beds were not my favorite..", "title": "Friendly, quiet, old.", "user": "34oceanspirit", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115878262}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "What a Deal, Booked a Deluxe room for myself, Partner and three year old son.", "title": "Rott has got the Lot! Awesome Location, Hotel, Price & Breakfast!", "user": "Luke-Ivana-Josh", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115726607}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Centrality - You feel like you are always a few minutes from the hotel", "title": "Centrality makes Hotel Rott a winner stay in Prague", "helpfulness": 3, "user": "MauroMartins", "date": "April 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 105740111}, {"rating": 5.0, "title": "Beautiful Prague experience", "text": "Good service - clean, neat, nice waiters, cook prepared some nice soup for our 1-year old, hotel taxi to wherever you want", "helpfulness": 2, "user": "TexansinBrussels", "date": "April 21, 2011", "id": 104876368}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We just returned from a stay at Hotel Rott in Prague. I never really know what to expect, even if all the reviews are great. From the moment we arrived until the moment we left, we felt very well taken care of. Our room, which was more like a two-room suite, was beautiful, much more than we would have expected. All employees from the front desk to bellhop to housekeeping were always kind and helpful. We had about a three minute walk to old town square. In fact, we walked nearly everywhere. Prague is a beautiful city, and Hotel Rott is a beautiful place to stay.", "title": "Splendid Hotel", "helpfulness": 1, "user": "LeChaud", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104833242}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The luxurious rooms are large (14' ceilings), comfortable, clean, equipped with all amenities; the staff are unfailingly cordial and helpful; the included breakfast buffet is huge (e.g., 3 kinds of eggs, 4 meats). But even in the absence of those factors, a decisive issue is location: Hotel Rott is 1 short block from Prague's Old Town Square, so close to the center of activity that one can return to the room just to drop off parcels or change clothes. Wenceslas Square and the Charles Bridge are short walks away. I would not consider any alternative for my next visit.", "title": "We loved it and would sure stay there again.", "helpfulness": 2, "user": "bbolt065", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103377730}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "I have nothing but good to say about Hotel Rott. The dorrman and front desk attendants were always kind, helpful, and smiling. We had a room that faced to the front street of the Rott which was great to open the windows and look out at the sights and people below. The Hard Rock Cafe is next door which I read about in a TA review before we went, but I am sure glad I did not let that hold me back from staying at the Rott. This hotel could not have a better location. It is right in the middle of everything you will want to see. Easy walking distance!!! And just a half a block around the corner is the main square!!! Another plus the Hotel Rott has, is its own wonderful Mercedes to drive you to the destination of your choice. Yes there is a fee, but you know ahead of time what that fee is and they could not have been more accomodating when wewent to the State Opera House or the airport. We loved the Rott and certainly go back. Great breakfast as well!", "title": "Absolutely fantastic hotel, great staff, great location", "helpfulness": 1, "user": "cjeynes", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99375226}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed in room 102, which has a nice little patio at the back. The hotel is literally 100m from the main Prague square. The rooms at the back of the hotel are really quiet, which is great while being in the center of the city. Breakfast was good, the staff were very helpful (eg when I used the small conference room or for printing boarding passes) and the hotel has been renovated and is very nice. The price was very reasonable (an average of 92 Euros/night including one Sunday night), for a top class hotel that deserves its 4 stars. I chose this based on other reviews here and I was not disappointed.", "title": "Excellent location, great hotel !", "user": "RivieraGuy", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114882752}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This hotel is in a great location for a first time visitor to Prague, and the rooms were clean and nice, although they felt more like college dorm rooms then hotel rooms. Staff was friendly and the breakfast was good. My only complaint was the room had twin beds placed head - to - foot, which is not an ideal way to spend a romantic holiday with my husband. Otherwise I would recommend this hotel.", "title": "Great location, clean and comfortable hotel", "user": "Fishy4sale", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 114756975}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We're about to leave Prague after a 4-day visit. No hassles and everything was OK. We went for a nice pricely executive room, which we found as expected, always well clean and tidy. Breakfast was at par and the staff professional and kind.", "title": "Everything was OK!", "user": "Qarlins", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 114741328}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "We experienced no particular noise during the sleeping hours, however we could do nothing to ward off the early daylight, due to the lack of dark curtains.", "title": "I am very happy that we chose Hotel Rott .", "helpfulness": 2, "user": "leylous", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 111354458}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We positively suggest this accomodation.", "title": "The Perfect Prague Hotel", "helpfulness": 1, "user": "LancashireLad42", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109915711}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 25, "average": 61, "very good": 255, "terrible": 11, "excellent": 276}, "slim_ranking": 0.16369047619, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Located in the very heart of historic Prague at The Little Square (Male namesti), Hotel Rott is just a few steps from the famous Old Town Square and Old Town Astronomical Clock.Hotel Rott is on four floors, consisting of two buildings and offers 94 rooms, meeting facilities, café and a restaurant.One of the buildings proudly displays beautiful frescoes inspired by Mikolas Ales paintings.Our hotel provides the perfect starting point for all business and sightseeing locations in the city."}