{"user_rating": 4.5, "review_count": 72, "name": "Rounceval House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Lovely little hotel - clean, characterful and comfortable. We had a large ensuite room with exposed beams and neutral decor. Staff were friendly and recommended local restaurants, and served a nice breakfast too. My partner can't eat wheat and the owner was happy to cater for him which was excellent. From the owners recommendations we went to Bistro 58 just down the road for dinner and had one of the best meals we've had in ages! Hotel has its own parking and the owner was nice enough to let us use the free parking for a few hours after check out to look around the town.", "title": "Great hotel", "user": "Amy C", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132202665}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed at the front of the building and with the window open could hear a bit of traffic from the road, but it's a small town so it really wasn't that bad at all and was pretty silent after 11. Another plus is that the owners are trying hard to be environmentally friendly, with eco-friendly toiletries and information on how they're reducing their carbon footprint.", "title": "Wonderful, characterful hotel", "user": "diwa1", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132089807}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Just returned from our 3 night stay and cannot fault the hotel at all. Room was spacious and very comfortable. Breakfast was great - all fresh, local produce, and the staff were very, very friendly. Mark, the owner, takes obvious care of his wonderful hotel, and was only too willing to give advice on the area - places to eat etc. He told me that the hotel dates from the 1700's - and it has been converted from the grand home it once was into a wonderful little hotel which is well worth a visit. Both Bath and Bristol are very easily accessible from Chipping Sodbury which is a lovely little market town with lots of good eating options. I think that it is often the little touches which leave a good impression - and this is where Rounceval House excels; from the local bottled water in the bedroom to the sweets on the reception and the eco-friendly toiletries and fluffy white towels in the bathroom. The whole atmosphere and ambience of the place was so very, very welcoming and friendly - i can't praise it highly enough.", "title": "Excellent Service, great rooms, and well worth a stay", "helpfulness": 1, "user": "smc1717", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131631387}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Great rooms in small (about 10 rooms) hotel. Welcomed by the owners, the Lloyds, who had good recommendations for local attractions and restaurants. Well worth a visit and a special trip.", "title": "Great Short Stay", "user": "YvonneRobinson", "date": "June 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131395539}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed here Jubiliee weekend for one night! We opted for a family room as we had an elderly relative with us and needed to be close as they are rather infirm. The room we were allocated was at the top of the house (loft space), it had character with beams, it was a good size, clean and comfortable. The adjoining room was of a good size and would be ideal for a young family. As it was a loft room, the view was restricted, but there were small windows letting light in and they could be opened to let in some air if required. Bathroom was cute, also beamed, so you needed to watch your head, but all added to the character. All appropriate toiletries were supplied. Tea and coffee facilities in the room All in all a comfy stay. The dinning room again was clean and well presented and our breakfast was very very good, after helping ourselves to fruit and cereal we then opted for full english and it was cooked to perfection. Definately recommend. This B&B is in the town of Chipping Sodbury so well located for local amenities. Also close to Bath and 20 mins away from Castle Coombe race circuit.", "title": "A Real Gem", "user": "shelley208", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127677486}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I first stayed in the amazingly fantastic Hotel July 1st 2005 it was our wedding night.", "title": "Honeymoon Heaven", "user": "Nessie24", "date": "November 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120715984}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We had a low key wedding and ended up drinking in Chipping Sodbury high street and walked up the high street to our palace.", "title": "As good as ever", "user": "srp973", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120577606}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "I just adore the building and the people that owned it back in 2005 were so pasionate about the Hotel as a whole package and the work they have done is totally amazing.", "title": "Perfect!", "user": "msgs0912", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120396598}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Our room was facing the main road but there was no noise to keep us awake. The curtains were lovely and heavy lined so they kept the noise and bright sunshine out.", "title": "Beautiful Hotel", "helpfulness": 2, "user": "Tarmum", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119978644}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Our breakfast was lovely freshly cooked to order and there is a great selection of other breakfast to choose from.", "title": "Fantastic family suite", "helpfulness": 1, "user": "Hconnell", "date": "October 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119111828}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed for one night but wished it was more. From the friendly welcome we received to the comfortable room and the tasty breakfast, the experience we had at the Rounceval House was wonderful. We look forward to staying again in the future and trying some of the other unique rooms!", "title": "A quick visit but an excellent one!", "user": "labcity64", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125511947}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I stayed here with my daughter the night before my wedding in chipping sodbury and also on our wedding night. Several of our friends also stayed. What a lovely hotel the building is fantastic and the owner could not have done any more to make us welcome. The room was huge, there were fresh flowers and they had left chocolates and a card for us when we returned on our wedding night. What a nice touch. They were very flexible regarding check in times for our guests. All of our friends loved the hotel too.Breakfast was very tasty. Everything you wanted including fresh fruits. Our breafast table was decorated with the confetti from our wedding. We would definetely recommend this hotel. It was a very memorable experience one you want to remember on your special day.", "title": "lovely welcoming hotel", "helpfulness": 1, "user": "Trudie25", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123590300}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "We stayed for 1 night only with other family as we were attending a family party. Room was lovely, warm and comfortable. The bathroom was esp toasty and was very welcoming after being out in the cold. Breakfast was cooked brilliantly and very tasty, filled me up for the rest of the day!", "title": "Comfort in Chipping Sodbury", "helpfulness": 1, "user": "Lijonel", "date": "December 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122241339}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Chipping sodbury is a very quaint town and everyone seemed very friendly. Thoroughly enjoyable weekend.", "title": "Fantastic Hotel would recommend to anyone", "helpfulness": 1, "user": "grandcan123", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121658067}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have stayed in almost all of the the rooms at the rounceval and they are all extremely clean, tidy, warm and welcoming. some are querky with the bath in the room (great for watching the tele while having a soak). The welcome is also very very good. Breakfast is superb including fresh berries every morning.I would recommend this hotel to everyone.", "title": "Home from home", "user": "KirbsSoham", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120772070}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed with a party of 10 for a friends wedding nearby. We stayed in room 7 which was spacious with a nice clean bathroom. Everything was spotlessly clean. There was the usual complimentary bathroom products & tea/coffee making facilities. The shower was a bit odd, it either came out in a full stream like a tap or sprayed out to the side, I managed very well under the full the stream though. I can understand the comments about the noise if you were on the lower floors due to the sound of footfall on the lovely wooden staircase but we didn't hear much in our room. Breakfast was delicious. Fresh fruit, yoghurts, croissants etc & the full English fry up was superb. The owner of the hotel is very helpful & can offer advice about where to eat etc. Had a really lovely weekend.", "title": "Excellent weekend break.", "user": "tulip", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142782464}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "For our purposes, this was a lovely hotel. The welcome was friendly and helpful, and our room at the top of the house was comfortable, nicely furnished and spotlessly clean. The beamed ceiling was low, and there was a warning not to bang your head on the low doorway, but that's not unusual in old buildings. Wifi worked fine; didn't try the TV. The bathroom had a half-size bath with shower over, there were plenty of fluffy towels, and nice environmentally-friendly toiletries. Only quibble about the room (and this might be just me) were those pilfer-proof coathangers (does ANYONE still take coathangers from hotel rooms?) which were even more awkward than usual as the wardrobe stored them back to front, rather than side to side. I'd seen on TripAdvisor that people complained about noise (we heard none, either from other guests or the street outside) and wooden stairs with no stair carpet (but then our room was at the top of the house so no one was tramping past).", "title": "Nice hotel, centrally located", "user": "Fran R", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140412223}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The public areas, a cosy sitting room and pleasant light-filled dining room, were quiet. Breakfast started really well, with juice and a lovely selection of fresh fruit - strawberries, blueberries, blackberries and melon. Tea, a cafetiere of decaffeinated coffee, and choice of brown or white toast all arrived promptly. Unfortunately the cooked breakfast let it down a bit - the bacon was so tough I couldn't eat it, and the fried eggs were cooked solid. But the field mushrooms were lovely. And butter, marmalade and jam came in little dishes, rather than disposable packaging.", "title": "Great little hotel", "user": "Kate C", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134495555}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel is situated on Chipping Sodbury's main street, with private parking behind it. It is a short walk to plenty of pubs and restaurants to choose from for lunch or dinner. Just one proviso about finding the hotel: it is on Rounceval Street, but the main street in Chipping Sodbury rejoices in no less than five different street names over its length, and our satnav did not recognise Rounceval Street: when we arrived it thought we were on Horse Street.", "title": "3rd stay here and love it!", "user": "lucy2909", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133336497}, {"rating": 4.0, "title": "Rounceval House is quaint and clean", "text": "We'd certainly stay there again. The following night we stayed in a nearby hotel: huge, rather grand, former stately home, with swimming pool, spa, facilities from A-Z (and room rates to match): I know which I preferred!", "user": "MostlyLeisure", "date": "June 21, 2012", "id": 132471867}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 2, "very good": 21, "terrible": 0, "excellent": 49}, "aka": "Rounceval House Hotel Chipping Sodbury, Cotswolds", "slim_ranking": 0.5, "description": "The house has a wealth of character with old oak beams, original fireplaces, and an oak staircase. There is also a bar and sitting room with cable TV, and a garden, for guests to enjoy. Bedrooms and the dining room are non-smoking. Our extensive breakfast each day is produced using fresh local produce."}