{"user_rating": 4.0, "review_count": 318, "name": "Rowley Manor Country House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "A wonderful find of a hotel, Excellent food, excellent room, excellent service and excellent price! Well worth a stay. Very peaceful, warm and friendly setting. We will definitely go back again and again and again.", "title": "Anniversary Stay", "user": "Martin R", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141774031}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We got a deal from Travelzoo for dinner for 2 for £35. We went on a Sunday night.", "title": "Totally underwhelming", "helpfulness": 1, "user": "kirstyhall", "date": "October 1, 2012", "detail_rating": {"value": 1.0, "service": 2.0}, "id": 141766259}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Well... The starter was OK. The mains, roast topside and pork loin, nearly - but not quite - reach the standard of Sunday roasts served in pubs all over Hull. The beef was reasonable, for topside. The pok was overcooked and very, very tough. Both gravies were Bisto or similar. The roast potatoes were squishy, not crisp. The only good thing about the meal were the vegetables, which were properly cooked.", "title": "memorable stay!", "user": "Chelsea93paige", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141741630}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The dining room wasn't full but the staff seemed a bit harried. We had to remind one of the waiters to bring the wine we had ordered.", "title": "room was disappointing", "helpfulness": 1, "user": "092711name", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141738787}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Two out of four puddings were finished by the time we got there, 7.30pm. The substitutes were possibly from the freezer.", "title": "A bit like Fawlty Towers?", "helpfulness": 5, "user": "YorkResident42", "date": "September 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 141601568}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There were good bits, bad bits and the hotel and grounds were beautiful!", "title": "The Good, The Bad and The Beautiful", "helpfulness": 2, "user": "Dawn L", "date": "September 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 141312000}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Booked this hotel on a 'Monster' deal, mid-week B, B & EM. The public areas of the hotel were fantastic, with beautiful log fires and opulent decorations. The staff were all friendly and trying to be helpful.", "title": "Good for a short break", "helpfulness": 2, "user": "cytourist", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 141083769}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had difficulty finding our room as the signposting wasn't correct, but, after going downstairs, we were finally shown where we should go. The room itself was tiny, if we'd taken the cat with us, she would have been safe from swinging, and there was a small, but adequate, en-suite. There were complimentary sea kelp shampoo, body wash and soap. At first the room was very cold, but warmed up very quickly, once I'd put the heater on (perhaps because it was so small!). We had to ask 3 times for coat hangers and a remote for the TV - we're still waiting for the remote. There were lots of beer mats on the floor and we soon realised that they were there to prop up the wardrobe to stop the doors opening. We also had to prop up the window with my hairbrush and to get the TV to work, we propped it up with a saucer and the Giddeon's Bible. A lot of propping up here. The bed head wasn't attached to the bed and banged against the wall every time you turned over during the night.", "title": "Tired and overpriced", "helpfulness": 3, "user": "PaulBerni", "date": "September 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 140773948}, {"rating": 5.0, "title": "Spot on...", "text": "The evening meal was a bit of a disappointment. The Choice was very limited: starter - soup, salmon or quails eggs(!): Mains - fish, chicken, pork, veg pasta, steak (extra £5): Puds - very nice, bread & butter pud, ice cream, cheese cake, cheese board (£5 extra). As a veggie, I had to have soup - cold and tasteless - and veg pasta (ditto) I'm sure the carnivores enjoyed it, but it certainly wasn't worth £31.95. Plus, on no occasion were we asked if 'everything was alright', or if we' enjoyed the meal'.", "user": "f_m_lil", "date": "September 20, 2012", "id": 140749983}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Breakfast was another thing altogether. Quick service, plenty of choice and a Veggie option!!! In fact I would have preferred the breakfast as my evening meal. The restaurant overlooks fields with horses out running about and peacocks and peahens wandering about - beautiful.", "title": "Overnight DBB deal", "helpfulness": 1, "user": "PWG99", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 140233120}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We had a KGB voucher for a couple of nights B&B. Our room was lovely and cosy (Room 15) with a lovely bass bed which was very comfortable. Booked a table in the restaurant for the first night on arrival but then looked at the prices and had to cancel. I cant justify £31.00 per person without wine so went to the harvester down the road. (£20 for 2 of us with a bottle of wine) Breakfast was lovely tho. Not a huge selection of cold buffet stuff but the full English was lovely with quality ingredients. Rowley Manor is very secluded which was nice but only a short drive to Beverley and Hull both places great for shopping. Apart from the prices for the restaurant and bar drink we did have an issue with flies in our room. I assume it because of the stables next to the hotel.", "title": "Chilled couple of days", "helpfulness": 2, "user": "Withouthekids", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 139990096}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Made use of a \"Travel Zoo\" voucher to treat ourselves to a night away and, apart from feeling \"cramped\" in our twin room, weren't disappointed. Our beds were comfortable, the bathroom was large and the bath easy to get out of. The setting was rural and peaceful and we enjoyed the bird life. Its proximity to Beverley enabled us to visit the Minster. Our first impression of the interior of the Manor was that everywhere was spotlessly clean. The service was excellent and the staff were professional, cheerful and helpful. Sandwiches, salad and crisps were prepared especially for us at lunchtime. Dinner was tasty, hot and well presented. A page, in the menu, which related the history of Rowley Manor was interesting. Breakfast was cooked to order so was piping hot, a real treat in an age where the hot breakfast is often served buffet style. Overall, our stay was enjoyable and relaxing.", "title": "Enjoyable and relaxing stay", "helpfulness": 2, "user": "Jennifer D", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 139409084}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Had a couple of nights here while visiting relatives in the area. The double room in which we stayed wasn't worth the £100/night price tag and the cleaning was poor, maybe down to staff shortage problems. Evening dinner was ok, but the steak I had at Weatherspoon earlier in the week was far superior and at a third of the cost! The reception staff haven't a clue about what they are doing,lol. If you want to stay here look better to get a deal like the 'group on' offer but the hotel can't even get this correct £193 BB&D offer for £89 (The room, breakfast and dinner is only £163) Nevertheless £89 is a fair price as I would value the rooms at about £60 and the meal for two at about £30", "title": "Need to review their procedures and standards", "helpfulness": 3, "user": "Lisbon8511", "date": "September 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 139334800}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I've been busy over the summer so haven't yet written a review re our stay earlier this year. We used a Groupon voucher but I wish we had read earlier reviews and picked a date when a Superior room was available as our tiny room in steerage complete with avocado bathroom suite was poor. The Lounge/Bar area was pleasant but we were dissapointed with the meal in the restaurant. Expensive restaurant prices with mediocre food as well as apple sauce clearly out of a jar and wine from Aldi. The staff and owners were pleasant and the service was good.", "title": "Poor room, mediocre food - great service though", "helpfulness": 1, "user": "John M", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 139195324}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We had the pleasure of being guests at a most beautiful wedding at rowley manor last weekend. What an idyllic setting. We were very impressed with all the staff and excellent service. The food was a hot buffet that was served at a main table. It was a selection of mainly hot dishes - loved the chicken fricasse especially. The whole place and atmosphere was really special and we would certainly consider booking a short break here ourselves to celebrate something special. Great location for taking photographs - perfect English country house and garden.", "title": "Beautiful wedding location", "user": "Alan196611", "date": "September 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 139158337}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Recently had a night away here on a groupon deal, and what a great offer! Fantastic home cooked 3 course meal, steaming hot freshly cooked breakfast in the morning (no tepid buffet food!) and clean/ comfy room all for £89.(We paid £15 more for a room with a four poster bed) Friendly staff, beautiful countryside all around, free parking, relaxed atmosphere, fresh flowers in public places and open fires billowing out warmth in several downstairs rooms. Cosy, comfy and homely, we hope to return. Thanks all for a lovely stay.", "title": "what a little gem! we hope to return", "user": "SARobinson", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142875209}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We visited the restaurent on a special price deal. It has old world charm, a cosy fire burning in the bar, and although the food was very good, I dont think I would have paid the full price stated on the menu.For a venue of this quality there were a few small details not quite right, whether it was because of the special offer I do not know.For instance the wine waiter poured the wine straight into a glass without offering to taste first. small point I know, but I thought this was a usual custom", "title": "Restaurant", "user": "Jean H", "date": "October 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 142844546}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Just returned from our 2 night stay at Rowley Manor - a lovely country manor house with a long history set in beautiful grounds. This was a 2 night bed and breakfast deal booked via KGB. To our delight, the hotel had a half price evening meal offer so we ate in the restaurant both nights of our stay. Our large room was very comfortable (room 9) with fantastic views, the food in the restaurant was good (for 1 veggie/1 carnivore) and all the wines were very reasonable priced. The public rooms are very welcoming, as are the staff and we thoroughly enjoyed our very relaxing stay. I don't know what else the staff could have done to make our stay more enjoyable - well done to the Rowley Manor team!", "title": "Lovely Country Manor Hotel", "user": "janlouz", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142390495}, {"rating": 3.0, "title": "Nice, but no \"Wow!\" factor", "text": "Nothing was wrong, but nothing was special. The public rooms are lovely. The bedroom was just ordinary (though with good artwork on the walls) the bathroom was just ordinary (holes in the door where a clothing hook had once stood, defective shower, no bathtub), the bar had very limited drinks available, and the food was ordinary. As others have said (see Kirstyhall), main course choice at dinner was Loin of Pork, Coq au Vin, Salmon, or Roast Beef and Yorkshire Pudding - yawn! Just like a pub Sunday lunch. Shortest wine list I've ever seen but wine reasonably priced. Lost of helpful and friendly young staff, but more training needed, for example we were informed that our table was ready and left to carry our own drinks from the bar, and the wine was not opened in our presence. For a hotel that is off the beaten track, I just don't see what the selling point is to motivate people to go there.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 8, 2012", "id": 142275683}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Had a marvellous night on Friday 5th October for my Birthday.", "title": "Birthday Night at Rowley Manor", "user": "Goldendreamer", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142184516}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 30, "average": 53, "very good": 95, "terrible": 12, "excellent": 128}, "aka": "Rowley Manor Country House Hotel Yorkshire/Little Weighton, England", "slim_ranking": 1.0}