{"user_rating": 4.0, "review_count": 32, "name": "Rowton Barns", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stopped here for the one night as we were guests at a wedding at Rowton Castle. We had been told we could only check in between 12.00 noon and 1.00 pm but this was fine and we had an effortless check in. Room was lovely, clean and well furnished. Think the owners have taken on board previous comments about the pillows as we had two lovely big pillows each (certainly not flat). The bed is hard but we still found it very comfortable. Lovely decor throughout the barns and they had a very relaxing feel about them. It was just a short walk to Rowton Castle along tarmaced roads (walk to end of the drive entrance for Rowton Barns, turn left, walk to the entrance road to the Castle (on your left) and then along the road leading to the Castle). It would be adviseable to take a torch if you are walking back late at night. The following morning we found (along with a number of other guests) that there was no hot water and it was a case of having to boil a kettle to have a quick wash. The breakfast was lovely and all the staff we met were very friendly and helpful. Is an ideal place to stay in order to walk to and from Rowton Castle.", "title": "Lovely accommodation but no hot water in morning", "helpfulness": 2, "user": "Cakesy", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145223819}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had a most enjoyable stay at the Barns.", "title": "Kilomutts attends a wedding", "helpfulness": 3, "user": "K L", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140877113}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My wife and I were visiting the area and attending the wedding of a friend at the Castle next door. It was down to him that we had the great fortune to stay here; a most comfortable and welcoming couple of days.", "title": "Closed reception, no one at home - help?", "helpfulness": 1, "user": "wickedqueen", "date": "September 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 140536070}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The breakfast was the highlight of the stay. Fantastic. Good tasting, non fatty, soft yoke fried eggs, full English breakfast. The Chef was perfect with it's delivery and the lady waiting on our table was wonderful; polite, friendly and eager to please. They have a good team and to have someone with a sense of humour and great smile first thing in the morning can only give the day a great start.", "title": "Good location for Rowton castle but not good value for money", "helpfulness": 2, "user": "Bambora51", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 139899542}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The rooms were large and comfortable and we felt excellent value for money. The honesty bar was an added extra and nice to have in this miss-trusting age but, a tea and coffee facility would be good in this area particularly for a late night coffee and brandy!", "title": "It's ok", "user": "Spa_SeekerLondon", "date": "August 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 138303330}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Just back from a wedding at the Rowton castle, we stayed in the barns, the room was nice and clean but the bed was awful, it was a standard double bed but when you got into it you realised it was two tiny single beds pushed together, they where very uncomfy!!!!!!! We had two small towels in the bathroom, and I mean small, no soap or shampoo, and no shower. Would not stay again sorry .....", "title": "Terrible nights sleep!!!", "helpfulness": 2, "user": "cccattt", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 126719954}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This is a really lovely B&B in a beautiful restored barn. The exterior and interior are very tastefully decorated and the rooms are spacious, well appointed and clean. Particularly appreciated was the lovely bathroom with large bath! The staff were brilliantly friendly and kind and were extremely helpful. I was really impressed by the accommodation and overall appointments - much more of a 4 or 5* experience than the 3* I've given. It's also set in beautiful countryside with a lovely vista over the fields.", "title": "Really lovely hotel - but bring earplugs!", "helpfulness": 1, "user": "lestroischats", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 126268146}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "What brought it down a bit was that we found our room really noisy. We were right by the stairs, had a window opening out onto the gravel drive and I think we were under an immersion heater - so every time someone came back, walked up the stairs, or ran hot water we got woken up. My other half also said he was woken repeatedly by snoring through the walls (fortunately not mine!). Bearing in mind everyone's comings and goings this meant we were only able to sleep between 2-7am. I think if you're coming as a family or as part of an outing (such as a wedding party) and don't mind a fitful sleep this would be a really, really nice place to stay - but if you're after a bit of R&R this probably isn't it.", "title": "My experience at Rowton Barns was lovely.", "helpfulness": 3, "user": "beckilicious", "date": "February 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125193666}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Feb2012 family of 2adults 3children 4yrs and younger.Staff were very friendly polite and nothing was a problem if we needed help.We stayed in a family room which was very spacious and immaculately clean.Breakfast was cereal, yogurts and a full English which was freshly cooked on order.", "title": "Very Good Standard", "helpfulness": 3, "user": "dolphinAberystwyth", "date": "February 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124534755}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My daughter got married at Rowton Castle on the 9th February and we stayed in the barns with a number of other wedding guests on the night of the 8th. The location with reference to Rowton Castle is superb, only a few hundred yards away. The standard of rooms is very good. The barn was converted to high standard accommodation about 5 or 6 years ago and the conversion was done very well. The rooms are modern, light and spacious as well as being very clean. All of our fellow guests also thought the accommodation was good. The breakfast was very good and other good facilities were the comfortable large lounge and the pay bar.", "title": "lovely b and b", "helpfulness": 5, "user": "suzieQMidlands", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120586195}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Location here for Weddings at the Castle is spot on. I'm afraid it is overpriced and I wouldn't visit again, I'm 5\"6, the single beds that are provided in twin rooms, are less than single beds! (Around 2 x 6 instead of 3 x 6) If you want to turn over, you will fall out the bed, If your tall or larger than a size 8 I wouldn't recommend the twin rooms!. It was awful, you want a good night sleep the night before a wedding, didn't happen here! Breakfast was good, and the staff we seen (1 lady!) Was polite enough. I wouldn't return unfortunately.", "title": "Overpriced, but well located for Castle Weddings", "helpfulness": 2, "user": "ALB1990", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 138226847}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The location of the Barns is perfect if you are attending a wedding at the Castle, as we were. We opted for the Barns rather than other local B&B's because of this, even though it was more expensive.", "title": "Overpriced for a tiny room", "helpfulness": 1, "user": "Elkie G", "date": "August 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 136809908}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We were very dissapointed with the size of the room - the smallest I have ever stayed in. The bed was very hard & supposed to be a double, but our feed stuck out the end (I am only 5ft 4), I also nearly rolled out twice!", "title": "Handy for the Castle", "user": "Potty-Ottie", "date": "July 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 133331077}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Hardly any space to move around the bed to get ready, very thin walls & some proper curtains or blackout blinds would make the world of difference - I was bolt awake at 5am with bright sunshine lighting up the whole room - not good with a hangover!", "title": "Comfy!", "helpfulness": 2, "user": "Shopaholiday", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132651541}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The wet room was a nice idea, although the water gathered by the door turning the whole bathroom into a large deep puddle!", "title": "ideal for wedding guests", "helpfulness": 3, "user": "holidaycheshire83", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130528683}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 3, "average": 8, "very good": 12, "terrible": 0, "excellent": 9}, "aka": "Rowton Barns Halfway House, England - Shropshire", "slim_ranking": 1.0, "description": "Rowton Barns bed and breakfast, is an attractive barn conversion set in the beautiful Shropshire countryside. Located 6 miles west of the historic market town of Shrewsbury, and just a 5 minute walk from the prestigious Rowton Castle Hotel. Making us the ideal place to stay, when attending a wedding or other function at the Hotel."}