{"user_rating": 4.5, "review_count": 567, "name": "Roxford Lodge Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I have a very mixed review for the Roxford Lodge, and can absolutely see what both positive and negative reviewers have had to say about it. My husband and I booked this B&B after researching this website, and we spent six nights there.", "title": "Mixed review", "helpfulness": 5, "user": "SandraFalcon", "date": "July 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 2.0}, "id": 8135913, "likes": {"liked": "— Clean and efficient", "disliked": "— Painfully small room, lukewarm service"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The building is impeccably clean, as was our room and bathroom. Breakfast was wonderful, maybe the best we've had in Europe, with plenty of fresh fruit and cereals for those who choose not to eat the more substantive egg breakfast. The breakfast room was extremely small though, and did not accommodate all guests at the same time, so that could be an inconvenience when visitors are on a specific time frame or schedule.", "title": "Good B&B", "helpfulness": 2, "user": "Staines27", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 8133663, "likes": {"liked": "— Clean and relatively cheap", "disliked": "— Location - a bit of a walk into the centre"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "It is also very convenient if you rent a car, as the parking lot is secure, and free! The parking lot is also, however, very small and tucked in a narrow alleyway, and fills up easily, so if you are unaccustomed to driving the British/Irish way, that can make for a lot of difficult maneuvering getting in and out (believe me!).", "title": "Very nice, and surprisingly quiet", "helpfulness": 1, "user": "akampy", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8127785}, {"rating": 5.0, "title": "Wonderful Dublin Experience", "text": "For the staff itself, I have mixed reviews. They were efficient, and one or two were rather friendly, but they weren't as warm or as willing to go out of their way for guests as I would have expected after reading reviews on this site. We were indeed offered cookies, etc. upon arrival, almost every time, but that seemed more routine than anything else. It was fine since we did not require much help, but it was still noticeable.", "helpfulness": 1, "user": "mossbeach", "date": "July 8, 2007", "id": 8075363}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Perhaps my biggest complaint has to do with the location, and the room itself. Location: it was not bad at all for getting to the Dublin city center, once you understand that you need to walk a good 20 minutes (we are both moderately fit and able to walk quickly and easily) or take a bus. This made dining something of a problem. There was no option to just step out of the hotel and find a place for dinner (except for the one pub around the corner) or even buy a bottle of water. Given how rainy a city Dublin can be, this really became a bother after the first day. On the positive side, it did help to be a bit far from the city center, because it was a lot easier to get on some of the freeways or major roads when we took day trips.", "title": "Not Much Good To Report About THE ROXFORD!!!!", "helpfulness": 2, "user": "JerryNJ", "date": "July 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8041688, "likes": {"liked": "— Nothing", "disliked": "— Facility"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Our first stop in Ireland was the Roxford. Very nice hosts! Our room was adequate in size. Yes, there was a sauna in the room, but what did we care. For 4 people, we had plenty of room. Half our luggage arrived late and the hosts were gracious enough to not only help us track it down, but put it in our room. Service was great!", "title": "what we expected in Dublin", "user": "four-from-nc", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8457150}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The location was down below the museums and bustle of the tourist area. We walked a few times into the center, but found it very easy to catch the bus across the street to take us close enough to where we needed to be.", "title": "Give this one a miss", "user": "HainesyLondon", "date": "August 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 8372080, "likes": {"liked": "— Breakfast", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The restuarants around us were not what we were looking for. Priced for the business traveler not the family of four. So, we hopped on that bus and went into town.", "title": "Sweet and charming hotel in a lovely neighbourhood", "user": "xiv", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8236556, "likes": {"liked": "— charm, spirit and surroundings", "disliked": "— the toiletflusher"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Dublin is overall more expensive than any where we traveled in Ireland. If you accept this, you will appreciate all that you are getting for your money.", "title": "Gem of a hotel!", "user": "travelpal79", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8221583}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Yes, we would stay there again.", "title": "Roxford Lodge Very Nice Place INDEED!!!!!!!!!!!!!!!!", "helpfulness": 1, "user": "kancz", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8139040, "likes": {"liked": "— All"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "I don't see what people are raving about. This is a dumpy little B&B not far from the center of Dublin, but really!, the fourth best place to stay in the entire city? Our room was dark and claustrophobic and the combination portable sauna/radio (I'm not joking) took up at least 1/4 of the available floor space. I don't usually take much notice of the decor in a hotel room but this place was so bizarrely decorated even I was amazed. Instead of being \"a short stroll\" from the center of Dublin, it was a 20-minute brisk walk along a very busy road.", "title": "I don't get it", "helpfulness": 2, "user": "jbullock47", "date": "June 24, 2007", "detail_rating": {"value": 4.0}, "id": 7974554}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "On the positive side, the breakfast was substantial and, if you are driving a car, the free parking makes this place really economical.", "title": "Who are you really?", "helpfulness": 6, "user": "travellingsweeties", "date": "June 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 7802775}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We wanted a place that we could easily retreat to after a couple of hours of museum-going, walking, shopping, whatever, so we checked out after one night and moved to the Westbury. It was 2.5 times as expensive as the Roxford but, in my opinion, well worth it.", "title": "Great Find", "helpfulness": 1, "user": "erfield5", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7750783, "likes": {"liked": "— Touhg choice.....Too many things to select from....all excellent", "disliked": "— No weaknessess.....highly rated and justly deserved"}}, {"rating": 5.0, "title": "A Pleasant Hotel!", "text": "The Roxford does not know what it wants to be? To support its claim that it is a \"luxury\" accommodation, our room had an enormous sauna that took up 60% of the living space. So, you could take a sauna or open your luggage. Guess which one we chose? There are also Jacuzzi bathtubs that make for a life threatening climb in to the bath. With all this luxury they forgot to ventilate the bathroom. So, there is the added effect of an unwanted steam room. On the other hand, it looks like a bed and breakfast. Sadly, it lacks the helpfulness and charm of a friendly staff (with the exception of one lovely desk clerk) and has no hospitality to speak of. We arrived at 10:45am after flying all night from New York . Despite being told in advance that we could have breakfast even if we were not able to check in, we were rudely informed that he kitchen closed at \"half ten\" and the city center was a 15 minute walk. Not exactly the charming hospitality of some of the less expensive but more cordial B&Bs. So, what does the Roxford want to be? A luxury accommodation or a B&B? Now it fails at both. We checked into the Westin for the second night. It is a luxury accommodation with no false pretenses. Skip the Roxford.", "helpfulness": 2, "user": "Humst4", "date": "May 31, 2007", "id": 7725112}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 9, "average": 33, "very good": 146, "terrible": 3, "excellent": 376}, "aka": "Roxford Hotel Dublin", "slim_ranking": 0.0558659217877, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Roxford Lodge Hotel is situated in the heart of Ballsbridge, one of Dublin's most fashionable and exclusive areas. It shares its location with that of the World's Embassies, the Royal Dublin Society (RDS), Lansdowne Road Rugby Stadium, and many other luxury hotels such as The Four Seasons and Jury's Hotel to name but a few. This elegant Victorian townhouse is only a short stroll from the bustling centre of cosmopolitan Dublin, and the city's main tourist attractions."}