{"user_rating": 5.0, "review_count": 294, "name": "Royal Mist", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We picked this homestay on the basis of the reviews on tripadvisor. All of the fabulous reviews are warranted. This is a great place. Anil and Jeeva are wonderful hosts, helpful and knowledgeable, friendly, and just genuinely lovely people.", "title": "Simply fabulous", "helpfulness": 1, "user": "Miranda_L", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138744868}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "When we arrived Anil took us on a very informative walk around the area around their property and into the tea plantations. We learnt a lot from this experience.", "title": "Wonderful few days", "helpfulness": 1, "user": "rad9989", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138290829}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "They also helped us organise a driver for the next day and helped us plan our trip for that day.", "title": "Royal Mist - Royal Location - Royal Accommodation - Royal Treatment - Right Royal Hosts", "helpfulness": 3, "user": "bozcanyonman", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130451675}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The best part of the whole stay, however, was the food. We had breakfast and dinner at the homestay and it was the best food we had on our whole trip. Fabulous, delicious, homecooked Indian food. We requested vegetarian and spicy and they prepared a number of different dishes just to our taste and they were all outstanding. i am ashamed to say we stuffed ourselves at every meal!", "title": "Just right", "helpfulness": 6, "user": "afrababy", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130350185}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stay here.", "title": "Most homely experience in Kerala", "helpfulness": 1, "user": "TomCromarty", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129984639}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed 2 nights and wish we could have stayed longer.", "title": "delightful stay, we loved it", "user": "love2cookandtravel", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129970799}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Anil and Jeeva(and their helper Alphonsa) have been doing this long enough that they have it perfectly worked out.They provide the perfect blend of family familiarity combined with a professional level of privacy to do your own thing as well. Jeeva was gracious enough to allow me to sit in on the nightly meal preparation which I greatly appreciated and learned so much from, it was just wonderful.", "title": "outstanding way to enjoy Kerala", "user": "el_viejo_blanco", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129878675}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Anil provided us with enough local information that were able to maximise our time in Munnar and see the very best of what was on offer.", "title": "\"Outstanding and we'll be back\"", "helpfulness": 1, "user": "AllanP11279", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129732588}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The meals were delicious, relaxed and extremely moderately priced.", "title": "Tranquil and relaxing", "user": "GreenMabel", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129467830}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We would definately recommend this home stay as being welcoming, extremelly well priced and just so comfortable that we could not fault it on any level.", "title": "outstanding hospitality", "user": "Bev006", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129296439}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I have recently returned from a fabulous trip to Kerala and had the pleasure to spend four wonderful nights at Royal Mist. We (three of us) had booked for three nights but our stay was so relaxing and we were made feel so welcome by Anil and Jeeva and their children Nithin and Neeha, we decided to stay a fourth night. Being able to stay with a family who welcomed us into their home and offered such genuine hospitality, was certainly a highlight of our trip. The rooms were very clean, private and the bathrooms were large with plenty of hot water. They recommended what to do in the area and arranged a fabulous hike for us to do which was great. Jeeva gave a cooking demonstration which was really helpful. The food was delicious here, plenty of it and the fruit was also a treat. Breakfasts were also fabulous and the best we had in Kerala. We ate out on the varanda which enables guests to mingle which was very enjoyable. The location of the home is just lovely and is located in a neighbourhood that is beside the tea plantations with a lovely walking trail nearby. It was a lovely place to unwind and relax and watch the world go by. I highly recommend going on the guided walk with Anil. We mainly used the local bus to get into Munnar which was just at the road and this was very easy to do. Anil and Jeeva also arranged a driver for us for a trip to the top sation and our next destination and this worked out very well.", "title": "'Home away from home'", "helpfulness": 1, "user": "aoifestaunton", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128079669}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This truly is a lovely stay and I hope to be back some day. I have a feeling that I will be.", "title": "Ditto!", "helpfulness": 1, "user": "PjayP", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127990703}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Previous reviews pretty much say it all – Anil & Jeeva have created a model example of how to run a homestay. Everything was pretty much perfect from arrival to departure. On arrival we were given lots of information about the area and what sort of things were on offer. Later we did the evening stroll around the immediate area and tea plantation with Anil and his family and saw a great sunset.", "title": "A warm welcome awaits", "user": "DaveyHUk", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127965790}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The day after we booked one of the local guides to takes us trekking in the hills around Munnar – the scenery was spectacular and the walk itself not too strenuous – the walk took about 4 hours and was one of the nicest walks we have ever done. Anil dropped us off in Munnar and our guide brought us back in his tuk tuk! The day after that we hired a driver for the day – we went first to Top Station which was a wise move as it was pretty quiet when we got there – superb scenery once again. We then made our way back to Munnar stopping at the dams, various photo stops, the Flower Garden, Munnar for a late lunch, the Tea Museum, church, etc.", "title": "Fantastic Homestay", "helpfulness": 1, "user": "CDLondon_01", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127962610}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Food throughout our stay was good and plentiful – not too hot but very flavorful – lots of fresh fruit too.", "title": "Royal Mist - warm, friendly Homestay in Munnar", "user": "lynntrick", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127856238}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We have just returned from 15 wonderful days in Kerala staying in a number of homestays and retreats. Without doubt, our 2 nights at Royal Mist in Munnar offered the best of warmth and hospitality which was all due to owners, Anil and Jeeva and their delightful family. Add a helping of wholesome Keralan food prepared by Jeeva; a spectacular view from the covered balcony where you eat and from which you access the three clean and comfortable bedrooms; an informal and informative sunset hike with Anil through the hills containing trees of fruit, spice and coffee coming out onto just one of vast tea plantations, and it all contributed to a memorable visit. Don't even consider a hotel if you're planning a visit to Munnar: Royal Mist located on a steep hillside in a quiet neighbourhood is the place to relax, understand Indian life and culture and just savour the whole ambience.", "title": "The personal touch, warmth and hospitality make it special", "user": "bamforthworcester", "date": "April 13, 2012", "detail_rating": {"service": 5.0}, "id": 127806256}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Anil and Jeeva welcomed us into their home like old friends. Their house, set amongst the tea plantations, offers wonderful views over the valley. The bedroom was very clean and comfortable with everything you need to make your stay enjoyable. The food was excellent, freshly prepared and very tasty. Jeeva was only too pleased to let us into her kitchen to show us how to cook Kerala Style while Anil was ready to offer lots of information about the area.", "title": "In the hills at Munnar", "helpfulness": 1, "user": "JackyS49", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127788655}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Royal Mist has everything you need for a wonderful homestay - lovely people, good food and spectacular surroundings.", "title": "Fabulous! The best of the old-fashioned B&B", "user": "unsyncsteve", "date": "April 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127246267}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Anil, Jeeva, Alfonsa, Nithin and Neha welcomed me to their home as I got off the autorickshaw Anil had pick me up from the bus stop. I immediately knew I was home.", "title": "Our wonderful stay in Munnar", "helpfulness": 1, "user": "caroline15", "date": "March 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 126663597}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "A lot of places use the term \"b&b,\" \"homestay\" or \"guesthouse\" but are just ordinary hotels. Not Royal Mist! The entire family really made me feel at home, and we had a lot of great moments discussing a variety of topics. A surprise was the (western style) chocolate cake Jeeva bought from a bakery for my birthday! I was lucky in that the other two rooms had very compatible guests. So, we all hung out and toured together during the day, and after dinner with the family. Anil booked and negotiated at very good rates our touring around the stunning Munnar Hills. Jeevas a great cook and gave the other guests a lesson before dinner one night.", "title": "Cozy and so friendly!", "user": "Ottawa00", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126304466}], "location": {"country": "India", "region": "Kerala", "continent": "Asia", "city": "Munnar"}, "variance": {"poor": 0, "average": 3, "very good": 14, "terrible": 0, "excellent": 277}, "aka": "Royal Mist Hotel", "slim_ranking": 0.013698630137, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 4.5}, "description": "10km from Munnar town, down winding hilltop roads with spectacular views, Royal Mist Homestay is owned by Mr. Anil and his family. This particularly close knit family with two children aged 10and 15 are incredibly hospitable, welcoming guests as part of the family, whilst allowing them as much independence as they desire. The separate area of the guests’ rooms occupies the top floor of this modern house with an upstairs terrace, which looks out onto the valley and hills extending into the distance."}