{"user_rating": 4.0, "review_count": 3199, "name": "Royal Decameron Puerto Vallarta", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We were at the Decameron the first week of February and enjoyed it. The food was good and the staff was very friendly. We did experience a few problems however. First, when we arrived, the Decameron was overbooked and we were asked to stay downtown at the Qualton, which we did....... The Qualton is nice but not as well kept as the Decameron. There were forty of us in our group and we all spent Sunday and Monday morning there before being brought back to the Decameron. My word of advice is that \"IF\" they ask you to move, make sure it is worth your while to do so!!! They gave each couple $$$ to move --- and it was worth it even with our inconvienience to do so. The second problem was with our Apple representative at the Decameron, Manuel... He was less than efficient and caused us all problems in scheduling things we wanted to do. His assistant, Raul, pulled the rabbit out of the hat and saved the day for some that would have missed out otherwise. Most of us wondered why Raul was not in charge!!! The other thing that I wondered about is that there is no Creme de cocoa at the Decameron. I asked and was told they used to have it but do not any more. There are a whole lot of drinks that could be made using it and I wondered why but no one could tell me. Enough on the negative. We walked into Bucerias on a couple of occasions and bought a few things. It was interesting and we enjoyed it. We lucked out and got a room in Building A on Monday when we returned which was an ocean view and wonderful. We went to sleep every night to the surf. We did not make it to any of the shows but heard they were good. We ate at the buffet and the specialty restaurants and enjoyed them all. What surprised me was that we enjoyed the Thai restaurant the best. The food there was delicious. Everyone has their own ideas as to what is best though. The grounds were beautiful and they were working on things all the time. At first it seemed things were really far apart but once you got the layout down, it was easy to get everywhere.. The pools were great and the adult pool was everything they said it would be. No kid problems even though we are not bothered. Just another observation.. We went whalewatching on the Isis, a 65' (?) sailboat and snorkeled at the Marietta Islands where the people that snorkeled stated they thought it was some of the best they had done. The fish were beautiful and large. I didnt snorkel this trip but I did the last time we went and enjoyed it. (Our second trip) The whalewatch company has three sailboats and we had a wonderful day seeing a lot of whales and porpoises. The other sailboat is the Elias Mann, and I dont remember the name of the other one. They had breakfast treats for us, lunch, and beverages all included. Well worth the price!! Please excuse the \"disjointed\" content as I am typing as I think of things. Our friends did the canopy tour and loved it. They also did the truck trip in to the back country and enjoyed that too.(Vallarta Adventure??) We did that the last time we were in P.V. We tipped our room maid every day and were well taken care of. The beach is great. We enjoyed laying out and just enjoying the view. There were beach vendors who were great. If you did not want to see their wares you just said so and they were on their way. It seemed to me the main bargains were for silver and they did bargain. Just across the bridge going in to Bucerias was a lady selling hand woven rugs. I mention this because I thought they were exceptional. I think one of these rugs would last a lifetime. They were approx. $100. U.S. but I think they were probably worth it. We went back but no one was around so we did not get one. As usual, we know better than to leave and not get something important but we wanted to think about it... Sometimes if you snooze --- you lose..... This was our second trip to P.V. (our first was three years ago) and we probably will not go back in the near future. Only because there are so many other places to see. We enjoy viewing cultures of different people so we try not to return to the same place every year. Also, I think we enjoy the Caribbean side more than the Pacific. Again -Just a personal choice here. Any specific questions?? Drop me a line....", "title": "Decameron stay", "helpfulness": 22, "user": "BuckeyeJohn", "date": "March 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3247597}, {"rating": 4.0, "title": "Great Resort", "text": "The Royal De Cameron is a great resort for all ages. I found there was activities available all the time. The staff provided everyone with entertainment everynight of the week. The only negative comment I have would be at the hours between breakfast, lunch, and dinner where there was no food available on the resport. The staff was great and made the trip worth it. There was an excellent choice of food and activities on the beach, such as volleyball and watersports. I would definitely recommend this resort for anybody!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3237540}, {"rating": 4.0, "title": "My lovely time!", "text": "The trip lasted 7 days, It was January 5th - january 12/05. I went there for the International field trip with my friends in Travel and Tourism Program. I and i believe that all of my friends all had a perfec time which was nice weather, nice poeple, nice beaches, nice pools, good foods... I was sharing the room with my others two girl friends and we paid almost $750 US - all inclusive. Royal Decameron Costa Flamingos where i stayed at. It is 20 mins away from downtown. Hotel has 510 rooms in 5 buildings, 3 children's pools, 4 outdoor smimming pools, open 6 bars and plus 2 disco. They have a really good customer service and excellent offer for everythings. 7 days at this hotel, i felt piece of heaven. this place is good for both the veggie people and the active people. And Really is: I like it alots.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 28, 2005", "id": 3236835}, {"rating": 4.0, "title": "College Class Trip to Vallarta", "text": "In beginning January (5th-12th) 2005 we took a class trip to the resort “Royal DeCameron”, Puerto Vallarta, Mexico.", "helpfulness": 10, "user": "KumarWalker", "date": "February 28, 2005", "id": 3236481}, {"rating": 5.0, "title": "This place was excellent!!", "text": "After going through immigration and all that in Puerto Vallarta, we went to the exit of the airport where there were many buses going to different resorts and hotel in the area. A bus going to our resort was clearly marked and took us directly to the resort (30 min trip).", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3224009}, {"rating": 5.0, "title": "A Great Hotel....", "text": "The Decameron is truely a wonderful hotel. We had a great time. The rooms are kept clean, a little small if you're 3 people in a room though. We had the pleasure of being in building 1, Oceanview balcony-- that made the whole trip worthwhile. The food was good, there is lots of selection and a restaurant is always open. The Italian place is the best of all of them. We met plenty of people from England and Vancouver, not too many from the US. The hotel did have quite a few couples, so next time we will be going back with our boyfriends for sure. Overall, the weather was great, sunny and hot everyday. We had a lot of fun by the bar (Gabriel makes the best Tequila Poppers) The clubs in downtown Puerto Vallarta were a lot of fun as well. We did the pub crawl, which was sooo much fun. Visited 3 clubs in one night and met a lot of people staying at other hotels. Would definitely go back again. It was a great place to be.", "helpfulness": 4, "user": "Travel_Chica079", "date": "July 7, 2003", "id": 1129779}, {"rating": 5.0, "title": "A very memorable time!", "text": "The Royal Decameron was absolutely amazing. It was our first time travelling south and we had an absolutely wonderful time. Everything was perfect, our only problem was that there was too much food! The staff was incredible and the entertainment crew were great as well.", "user": "A TripAdvisor user", "date": "July 7, 2003", "id": 1129770}, {"rating": 5.0, "title": "Family friendly", "text": "Everything packed together made for a perfect vacation that will never be forgotten!!!", "helpfulness": 1, "user": "fourcads", "date": "July 6, 2003", "id": 1129639}, {"rating": 4.0, "title": "great resort!!!", "text": "We have just come home 2 days ago from our trip to Nuevo Vallarta.", "helpfulness": 20, "user": "mexicolover", "date": "February 7, 2005", "id": 3168474}, {"rating": 4.0, "title": "Great Hotel, great price!", "text": "Our 2 children ages 11 & 14 came along also and had alot of fun!!! We really did our research on this resort before going and it really paid off. So many tips that we had read in the other reviews came in handy for us since this was our first time at an all inclusive resort. So read, read, read as much as you can, the reviews are here for that purpose.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "February 5, 2005", "id": 3164188}, {"rating": 5.0, "title": "Loved the Entertainers and had an awsome time", "text": "As for the resort, we have absolutely NOTHING to complain about. We did get a room in Block 1 and I was a little worried since some of the reviews said that this was an \"older\" building and smelled. This was NOT the case at all! The rooms were just fine, not fancy but just what we needed to sleep and change in. We also found that this Block was away from the hustle and bustle of other areas and we liked this.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "February 5, 2005", "id": 3163890}, {"rating": 4.0, "title": "Second Time a Charm!", "text": "The food was really good. I do agree that breakfast was the best meal of the day for food choices. We only ate lunch 1 time in the buffet restaurants because the snack bar was great for burgers and nachos for lunch. The nice lady in the back cooking the burgers was so sweet and always had a smile for us. We only ate at 1 ala carte rest. and found it a waste of time to wait in line for a long time, we had better things to do with our week there.", "helpfulness": 27, "user": "dennise", "date": "February 5, 2005", "id": 3163873}, {"rating": 3.0, "title": "Very Nice Place!", "text": "I did find it handy to bring a thermal plastic mug with me and my husband wished that he had had one too so buy a cheap one somewhere and bring it, it also keeps the bugs out of your drinks as well.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3161071}, {"rating": 5.0, "title": "Loved it, loved it, loved it!", "text": "We stayed at the Royal Decameron for 9 days this past April. For the price, this place is the best! The food was always good (although we preferred the food at the buffets over that of the restaurants). The grounds are beautiful and while the rooms aren't luxurious by any means, they are serviceable. We spent very little time in the room anyway!", "user": "LEELEE114", "date": "May 7, 2008", "id": 15739615}, {"rating": 5.0, "title": "Great Vacation Site", "text": "We stayed in Bldg. 5 and had no problems with water temps in shower and we thought the bed was very comfortable. Bldg 5 is very close to the site of the disco and the evening performances, so I would recommend that you bring earplugs if you're noise-sensitive as I am. I never travel without earplugs any more, no matter whether I'm in Mexico, New York City, or Hawaii. They are a great resolution to noisy neighbors, parties, or the sounds of your neighbor's shower being turned on at 5 am.", "user": "GlennM", "date": "May 3, 2008", "id": 15620068}, {"rating": 2.0, "title": "Royal Decameron now has a cop prowling the grounds...", "text": "The pools are beautiful at the resort and there are always plenty of chaises to lounge on. They are made of hard plastic, so if you're the type to sit for hours, buy one of the inflatable rafts for sale in the gift shop to give you bum a break.", "user": "Wiscbabe", "date": "April 30, 2008", "id": 15506122}, {"rating": 2.0, "title": "Good and Bad", "text": "We went to several of the nighttime shows and had fun there. Are they Vegas class entertainment? No..., but the crowd has a lot of fun no matter what and that's the point of entertainment, right?", "user": "HappyOntario", "date": "April 29, 2008", "id": 15468223}, {"rating": 4.0, "title": "Exquisite resort setting...", "text": "The staff at the Royal Decameron was wonderful with just one exception. Throughout our time there, we were treated like royalty. Unfortunately, we ran into the one jerk that works there the day we checked out. Samuel, at the Tropical Desk was rude and condescending to me and my husband. I filed a complaint with the manager who managed to make me relax after the shock of being treated rudely after a wonderful week.", "user": "LovestoDance", "date": "April 27, 2008", "id": 15405066}, {"rating": 4.0, "title": "Good Atmosphere, great beach a little oasis", "text": "My husband and I have stayed in Puerto Vallarta many times. We had never to the north of the airport before. We found that this hotel had great service and friendly people. There where many families here. We never had to get up early to get a lounger and the beach was great. We stay for 10 days and found that everyone was doing there best to be helpful. I found the food the same as any buffet you would find anywhere with a little bit more selection. If you got tired of the buffets you could always book the Al la cartes.", "user": "26ocean5", "date": "April 17, 2008", "id": 15094566}, {"rating": 3.0, "title": "One Skers Opinion", "text": "If you go to this hotel you will find that there are cabs right outside the resort if you need to get one. Also the buses come every 10 min at the top of the hill and there is an OXO station where you can by food items and there is a ATM machine if you need cash. The exchange center at the hotel is not great I recommend going on the bus to walmart which is 20 min by bus.", "user": "skerlarry", "date": "April 15, 2008", "id": 15056055}, {"rating": 4.0, "title": "Second time and still loving it", "text": "The little village of Bucerias is a 15 minute walk north on the beach. There is a little market there to by Mexican goods at a cheaper price than in Puerto Vallarta.", "user": "travelagentmpls", "date": "April 15, 2008", "id": 15050326}, {"rating": 3.0, "title": "Satisfied with the Decameron", "text": "If you are looking for night life this is not the resort you want to be at. If you are looking for relaxation, a great beach with fantastic sunsets the you will like this hotel.", "user": "travellingislandgirl", "date": "April 13, 2008", "id": 15010572}, {"rating": 5.0, "title": "2nd time around & loved it", "text": "It may not have the glitz of some of the hotels but it has a great atmosphere and I would definitely go back.", "user": "ON-Member", "date": "April 11, 2008", "id": 14972440}, {"rating": 5.0, "title": "Pictures don't do this place justice!!!!", "text": "My husband and I stayed at the Royal Decameron the last week in Jan. 05, and had a wonderful time. The grounds are beautiful with lots of trees and flowers. When we arrived we were greeted with a pineapple drink which made for a great impression. We stayed in block 5 for a few days, this is at the back of the resort by the adult pool. This is the newest and quietest part of the resort. We then moved to block 3 in the centre of the resort, close to the beach. This is the only block with a elevator. Block 2 and 4 are very nice also and are central. The rooms are pretty basic with no shampoo, kleenex,iron, and writing paper, but are very clean. We left a tip and perfume sample everyday and they made swans with the towels, and even made a rose out of the toilet paper. It made it exciting to enter the room because you never new what the would make next. The rooms have a safety deposit box ($$) with a key. The food was great, I tried to try different things. We tried the Italian and Mexican restaurant and both were good. The only thing about the Mexican restaurant is that you didn't get a lot on your plate, so if your still hungry you can go over to the buffet. The day activities were fun(always something going on). Every night they had different things going on from jazz bands to a nightly flea market. The theatre was very entertaining and always included the audience. You must try the hamburgers at the snack bar , they are awesome!!! There are 4 pools to chose from ,so your always able to find a lounge chair. The beach was nice and clean. If you feel like taking a walk there is a 20 minute walk to a small town called \"Bucerius\". They have a great flea market with alot of variety. If you need a bank machine there is one in bucerius by the chinese looking market on the main road before the bridge. If you need to exchange money there is a place across from the royal decameron that gives a great exchange rate.(better than hotel). There is also a pay phone across from resort. If you use it at night just ask the guard at the gate for a flashlight. Make sure you bring a Thermal cup for drinks as they serve their drinks in small plastic cups, and your forever running back and forth for drinks. Sunset is awesome , so don't miss it!!! If you get a chance go out and rent the watercraft and jump some waves. Lots of fun!!!Well I hope this helps everyone and have a great time!!!", "helpfulness": 36, "user": "sharin", "date": "February 22, 2005", "id": 3216884}, {"rating": 4.0, "title": "Can't Wait to go back!", "text": "This was the best hotel to stay at in Buceras. Even when we first drove up to the hotel all we could see was the bright colours of the buildings and we knew that we were in for a real Mexican experience. The staff makes you feel right at home right at check in. There are four fabulous restaurants that served the needs of everyone, my groups favourite was the Japanese place, mostly because of the cute waiter who requested to serve us every night. The pools are ok but we spent most of our time at the activity pool and on the beach by the volleyball court where all of the action was. The on resort bars were open at 10 am and the latest bar was open until 1am. They were very convenient and served anything you asked for. I enjoyed about this resort, but the best part was the activities staff and the kayak boys. They were all good looking and they knew how to have a good time. I especially loved the pub-crawls with the staff, watching them play volleyball and playing volleyball with them. They were amazing!!! This resort is good for people of all ages too. We hung out with anyone from 20 to 60. There were a lot of families there but I didn’t make a difference because if you didn’t want to be around kids there was always another pool or spot on the beach for you.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 22, 2005", "id": 3214964}, {"rating": 4.0, "title": "Loved the Beach", "text": "We stayed at the Royal Decameron from 5 Feb to 12 Feb (the week prior we stayed at Las Palmas by the Sea) This was our first stay at Royal Decameron and our first stay away from the PV Hotel Zone,were we have stayed several times before. Our checkin was very efficient and we got our room with king bed in block 5. (don't ever ask for a non-smoking room as there is no such thing in Mexico) Of the several accomodation blocks only one has a elevator. We were on the fourth floor. This was a problem for some guests that we met, but switching rooms for them was difficult. The resort grounds are beautifull and well kept. The pools are great but my favourite was the beach which was huge compared to Hotel Zone hotels. All water sports including boogie boards, kayaks, canoes and hobie cat sail boats are free. There are plenty of palapas on the beach but many are reserved by 8 AM. (contrary to the rules) We found the food to be excellent at all the buffets. For most lunches we frequented the snack bars where the excellent burgers and natchos were a favourite. Several buffet dining rooms revert to ala carte restaurants for dinner, they include a Thai, Japanese, Italian and a steak house.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "February 21, 2005", "id": 3213177}, {"rating": 4.0, "title": "Royal DeCameron full of life!", "text": "The antiquated reservation system starting at 9AM the day you wish to make a reservation was a waste of time, requiring a second visit at 10AM to see if in fact you did get the reservations. Our dinners at the Thai and Japanese resuarants were excellent, good food, good service, especially our waiter Ignacio at the Japanese restuarant, but many of the tables were vacant, testifying to the poor reservation system and not the food. The only drawback to our stay at the Royal Decameron was the liquor, which was watered down, in fact to get a decent drink you had to ask for a double or triple which Juan Carlos at the volleyball bar was good at fullfilling. On our second last day at the resort, a note slipped under our room door offered us a stay at another hotel, many other guests had the same offer. The reason was that the resort had overbooked about 40 rooms and were scrambling to move some people out, friends were offered 6 bottles of tequila and a T-shirt to move to another hotel. (kind of tacky, eh). Even with the few problems that I mentioned we would recommend this resort and we will stay there again.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "February 18, 2005", "id": 3207236}, {"rating": 5.0, "title": "\"our best mexico experience\"", "text": "My thirteen classmates and I just stayed at the Royal DeCameron Hotel and Resort for a week this January. My first impression of this property was that it was so full of life. It has magnificent gardens and soothing water features in every corner of the grounds. It is painted in fun bright colours that really lift your energy and excitement about being there.", "helpfulness": 27, "user": "A TripAdvisor user", "date": "February 17, 2005", "id": 3199819}, {"rating": 5.0, "title": "Life is Good . . . Who can complain?", "text": "We stayed at the Decameron for the 2nd time April 1-15 with the same couple we went with in February of '07. As much as we liked it last year, I have to say we all enjoyed ourselves more this year; although I'm not sure why. Perhaps it was because we stayed an extra week, or perhaps it was our familiarity with the place. At any rate, we felt at ease throughout our stay . . . and that speaks very favorably of employee courtesies and conscientiousness.", "user": "John-Smithers", "date": "April 24, 2008", "id": 15301563}, {"rating": 4.0, "title": "Fun, Fun, Fun!", "text": "ROOMS", "user": "mtklein", "date": "April 24, 2008", "id": 15295206}, {"rating": 4.0, "title": "Lovely Resort", "text": "This year, we were given rooms on the 3rd floor of Building 4 which is central to everything. The rooms weren't quite as nice as last year in Building 6, but were nevertheless, comfortable and very clean. The showers are wonderful with lots of hot water and water pressure that you can't find in the U.S. If you've read any of these reviews, you know to bring your own shampoo, and you might also want to bring a bar of soap that lathers nicely in hard water. For an iron, you can borrow one from the desk (which one, I don't know) or do as we did and take along some spray wrinkle releaser (we are on vacation, after all). If you want to watch TV, the number of English-speaking channels will satisfy most people. We, like most folks, used our room to sleep, shower, and change. Otherwise, we were enjoying ourselves elsewhere.", "user": "PrincessAlberta", "date": "April 23, 2008", "id": 15275976}, {"rating": 5.0, "title": "Loved the Royal Decameron", "text": "POOLS", "user": "kategurl", "date": "April 23, 2008", "id": 15253421}, {"rating": 4.0, "title": "Beautiful place to relax and have fun", "text": "If you like quiet, Pool 5 is the place to be. It is a huge and beautiful, adults only pool. For us, it was too quiet (like a library)and we preferred the Building 6 pool, which is still very large, but", "user": "Mister_Misses_D", "date": "April 22, 2008", "id": 15224609}, {"rating": 5.0, "title": "Had an amazing Time!!!!", "text": "I had the pleasure of staying at the Royal Decameron Hotel at the beginnig of January as a class field trip. I'm taking Travel and Tourism at college and this was part of our international field study. I thought the resort was great the staff was really friendly and willing to assist you when you needed something. The food on the resort was great I liked how they had different types of restaurants so you could try different types of food such as the Japanse food. One thing abou this resort that I thought was amazing was the sunsets at night they were spectacular. I also really liked the entertainment at the resort as well. So all and all this resort was really great and would recomend it to anyone.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 15, 2005", "id": 3194199}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "We returned yesterday from a 2 week vacation at the Royal Decameron. What a wonderful place this is.", "title": "Great Vacation", "helpfulness": 15, "user": "streeves", "date": "February 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3194041}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "We loved it and will definately be back there next year. The only complaint was the resturant reservation system...and even that was not horrible. The staff was absolutely the friendliest we have ever encountered. Everyone bent over backwards to ensure that our stay was enjoyable. All the resturants were great...the buffets were great. We had bottled water every day. There were a couple of maintenance problems, but they were quickly taken care of. The shows were amazing. Can you tell we had a wonderful time?? If you would like any information, please feel free to email me and I will answer if possible.", "title": "What a deal!", "helpfulness": 6, "user": "BWF", "date": "February 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3181931}, {"rating": 5.0, "title": "Royal Decameron / Bucerias", "text": "For the dollar, you can't beat this resort. Awesome grounds, great amenities, wonderful staff, good food, clean rooms. It's not a five star, but the price is awesome for what you get. Expedia rates this as a 2 1/2 star, but others rate it as a 4 star. It's probably a 3 1/2 star, but the price is more 2 star. Don't hesitate to try this resort. Keep in mind this is Mexico and it's not $300 a night.", "helpfulness": 14, "user": "master_dman", "date": "February 11, 2005", "id": 3179227}, {"rating": 5.0, "title": "Wish we could go again!!", "text": "The wife and I stayed here last year and had a great time. The staff were friendly and attentive. Never had to wait in a line for anything. Always had something to do. The bar by the ocean was great. Bartenders were fabulous.", "helpfulness": 16, "user": "lilly65", "date": "February 11, 2005", "id": 3178714}, {"rating": 5.0, "title": "Great Resort!!", "text": "This was our first trip to the Royal Decameron and all we can say is WOW!! Everything that the hotel said about itself was true and even more. The rooms were clean and comfortable. The food was great and service was outstanding. The proerty was well maintained and we never wanted for anything. The Staff was friendly and always helpful.", "user": "tfts01", "date": "April 22, 2008", "id": 15226848}, {"rating": 3.0, "title": "Man, what a ride.", "text": "We read many reviews on this site about this resort and I can't believe some of the negative comments. I chalk it up to those people must have never traveled before in their lives. I would and will recommend this resort to anyone that ever asks for suggestions on where to stay in Vallarta. I can't say enought about the Royal Decameron Puerto Vallarta.", "user": "NBfamilly", "date": "April 21, 2008", "id": 15206570}, {"rating": 5.0, "title": "best holiday ever, definately going back. words cannot describe", "text": "The resort I found was really good. Food was good, you got one a day A La Carte meal. Bars were good and plentiful. Pools were good and plentiful. This is a huge resort so you never get bored. Rooms were clean and done everyday. You can tell they take care of their resort by seeing the amount of staff taking care of it every day. Good entertainment every night. The entertainment crew were around you day in and day out. That part was great. The part that makes us not go back is the country in general and the organisation. On our last night, we wanted to find out information about our shuttle to return home. No one wanted to help. They send us to the next desk, and the next desk. Then you ask for a phone book so you can it yourself, well of course they don't exist. Gimme a break. Another situation. My sister and a group booked to go on a zip-line trip, so a lot of money involved. They were given wrong information and time. They were stuck at a gas station for 3 hours. The other thing that really bothered us was the scheming individuals everywhere!!! They start at the airport. The first person that we saw (airport staff) sent us to a desk which we thought was for shuttle directions. It ended up being another resort that wanted to scheme us. Give us deals on this and that, just come visit our resort and pay $20 each kinda thing. This took very long as we didn't clue in until the end that this wasn't for our resort and we MISSED OUR SHUTTLE that we paid $160 for!! We ended up having a hard time after getting transportation, and even then we were flying by the seat of our pants. The transportation that we did end up going with was scary as hell. Fast driving. Asking us if we wanted to stop here. Stop here. Stop here. Plus this was late at night. Finally we made it, but really scrared. Mexico is a scary freaking place. I will never go again because of that. Too bad cause the resort was great.", "user": "TeirrahxxRevilo", "date": "April 21, 2008", "id": 15177708}, {"rating": 4.0, "title": "long kept secret for Canandians", "text": "My boyfriend and I stayed at the Royal Decameron for two weeks last July and loved every minute of it.", "user": "1bluegirl", "date": "April 20, 2008", "id": 15155675}, {"rating": 5.0, "title": "Wonderful Honeymoon!!", "text": "HOTEL", "user": "Lindsay26", "date": "April 19, 2008", "id": 15150180}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 3, "variance": {"poor": 195, "average": 405, "very good": 1316, "terrible": 99, "excellent": 1184}, "aka": "Royal Decameron", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}