{"user_rating": 3.5, "review_count": 249, "name": "Royal Azur Thalasso Golf", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We’ve just returned from a week away in Hammamet. (25.07.10 to 01.08.10). We had booked a week, half board in the Sol Azur (supposedly 4 star!) . Reviews looked good and it certainly wasn’t cheap. Well it was horrific, we absolutely hated it! I wanted to cry. Luckily for us the sympathetic Cosmos Rep (Maher) took pity on us and moved us to a better hotel up the road (Royal Azur- supposedly 5 star). Even so we missed over a day of our 7 day holiday. I’ve therefore done two reviews, one under each hotel on Tripadvisor.", "title": "not what we would call a 5 star", "helpfulness": 1, "user": "SARobinson", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 73427533}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Royal Azur is so much better than the Sol Azur, and we were very grateful to be moved, but it is still not what we in UK would call 5 star! Much cleaner, less smoky, less busy, staff more pleasant – but not a relaxing luxurious break.", "title": "lovely hotel in dreadful fresort", "helpfulness": 1, "user": "rolokildare", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 71603996}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The good stuff- clean & tidy hotel, efficient staff, on the beach front - which was lovely, sea was clean & warm, beach sunbeds were available- for free! Plenty of places to get food and drink. Taxis were outside the hotel when you needed them. Weather hot and sunny. Plenty of hot water in the rooms for showers etc. Air conditioning worked well. Quiet in the evening - no disturbed sleep. Breakfast times were 6.00 ‘til 10.30- really good span of time to suit. Exchange rate means everything was very reasonably priced.", "title": "very good hotel.", "helpfulness": 1, "user": "cooperman244", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71128702}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The not so good stuff- poolside was busy and we struggled to get a sunbed, breakfast food was the same everyday and although wide ranging did get quite boring. Nothing was really very tasty, just sort of filled a hole! The dinners were dreadful, we tried it twice and then paid to eat out the other nights! Tasteless, mass produced slop. Not an awful lot to see and do around the hotel, quite shabby, dusty and smelly in places. Not really a pleasant place to have a stroll after your meal! Twice we got a taxi to Yasmine Hammamet which was a lot nicer in many ways and only about £5.00 even though it was as good 20 minute ride. No seatbelts though and they drive like lunatics, i was terrified! Most restaurants we went to for lunch or dinner had the same menu, it did get tedious. We love to try lots of different foods, and eat an assortment of things throughout our holidays, but we found very little variety in drinks or food throughout the whole area.", "title": "Absolutely bloody brilliant", "helpfulness": 4, "user": "Gemsaloola", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68308957}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We won’t be going back to Tunisia.", "title": "Excellent All Round .................. Great value for money", "helpfulness": 2, "user": "perrycrimmins", "date": "May 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 65085925}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "You can't go wrong when staying at this hotel in the old part of Hammamet (north) but it's nothing like the fancy five star hotels in the new part of Hammamet (south). Compared to those it is more like a 3-3,5 star.", "title": "Decent hotel in the older area of Hammamet", "helpfulness": 2, "user": "Eric1313", "date": "May 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 64889680}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "We stayed in the hotel for three nights and used it as a base to explore the main sights of northeast Tunisia. The hotel had free parking for our rental car. The staff is very nice and accomodating. The restaurant food was decent, with some positive and negative exceptions (e.g. the eggs in the morning were very runny and the soup at night tasted like bad water, the pasta very plain, but some of the Tunisian dishes at dinner were excellent). The Internet is a bit expensive (5 dinar per hour) compared to other places in that area.", "title": "I can recommend the hotel anyway", "user": "DesertroseStuttgart", "date": "May 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64136969}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The hotel room is comfortable and we slept very well. The inside of the hotel looks fine, but you can definitely see many old parts, mostly outside. The pool is not that big and very very boring (lying in the sun is all the excitement you will get). The hotel was very quiet, also because there weren't many guests (at most 25) when we stayed there, even though it was the main tourist season... If you want more excitement, go to the new area in the south of Hammamet (we stayed there in the amazing MagicLife Africana hotel for 5 days of relaxation).", "title": "Friendly, food filled stay!", "helpfulness": 2, "user": "OrioleMcFlurry", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 62358182}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Very nice hotel right on the beautiful beach. Rooms are comfortable and the sea view is fantastic. Food and service was good. Excellent service was at the pool bar. Mr. Karim, Nabouli smiling all day despite the heat and stress. Very courteous, helpful and complimentary, and he served the best \"qahwa * arbi bläsh sokkor\" of the world. I can recommend the hotel anyway. and I'll be back there for a holiday.", "title": "Old world charm", "user": "nick_dow_ling", "date": "April 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62176523}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Had an extended holiday here thanks to the volcano!! Hotel charming, staff friendly and multilingual, food delicious and plentiful, view lovely, plenty of comfy seating round pool, bar and reception. Especially enjoyed the banter with the waiters - didn't feel pressured to give a tip so we gave one (reverse psychology?!!)", "title": "Friendly, well managed hotel", "helpfulness": 1, "user": "NottinghamPGTips", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 61178455}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed for 2 weeks and had a great relaxing holiday.", "title": "Excellent value for money", "helpfulness": 3, "user": "tjayBristol", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 41092899}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "We didn't get tummy upsets and found the food good. Sitting on the patio having breakfast in Oct was brilliant!", "title": "Lovely hotel - great food and beautiful beach!", "helpfulness": 2, "user": "travelaholic84", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 27160422}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Found staff all very helpful. Sometimes its how you treat them!", "title": "This Is Not A 5 Star Hotel", "helpfulness": 1, "user": "SilverSandSurfer", "date": "February 10, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 24448189}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Theres a fantatic little cafe up the road that does buckets (yes buckets) of english tea and lovely toasted sandwiches among other things. About £6 for tea & toasted sandwiches for 2 people for lunch (better than the pizza cafe on the beach)!! Staff very friendly. Out of the hotel, turn right and its on the left in a little courtyard past the shops opposite the hotel.", "title": "Shabby treatment by hotel", "helpfulness": 2, "user": "dingbats1956", "date": "January 13, 2009", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 23515420, "likes": {"liked": "— the lobby", "disliked": "— the reception staff/management"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "If you buy water or soft drinks in the supermarket opposite, keep them hidden in a large (non-plastic) when you return to the hotel or the security will take them off you. So don't buy 6 bottles at a time. The s'market is very good and has souvenirs at very reasonable \"fixed\" prices for those who hate haggling - like me. Clothes are upstairs.", "title": "Better than expected", "helpfulness": 1, "user": "Camberman", "date": "January 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 23277245, "likes": {"liked": "— Good food, good service and sensible drink prices. Beach front location.", "disliked": "— Rude behaviour of certain other guests. Lack of variety of entertainment."}}, {"rating": 4.0, "title": "very clean and friendly hotel", "text": "We have just returned from a weeks stay at royal azur. We had a lovely and relaxing time, the staff are eager to please very helpful and the maids clean your room, replace towels and bed sheets EVERY day, somedays she leaves petals on the bed and makes a nice pattern with nightwear. It was my birthday whilst there and she made the bed up extra special and put my card from the side on the bed then wished me happy birthday as we passed in the corrridor.", "helpfulness": 1, "user": "LL30Notts", "date": "April 5, 2010", "id": 60420427}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The staff arnt excellent at speaking english but they generally understand you. When you eat in the restaurant check your drinks bill as we had 1 waiter ask for 31 dinar when in actual fact the bill came to 17. The boss luckily asked us if there was a problem and he demanded the waiter gave us the right change, the waiter did look dodgy so just be careful. The food was very samey especially breakfast but the pancakes were yummy! dinner was good theres always something to eat.", "title": "Excellent Value for Money", "helpfulness": 2, "user": "Tarwelaan", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58915499}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "If you go to the medina be pepared to be hassled and they dont take no for an answer just say no and keep walking or they will talk you round.", "title": "Sound, clean, comfortable, friendly, polite.", "helpfulness": 1, "user": "Filosofo3", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48770892}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The weather was good we both got a tan but the pool and sea are both freezing this time of year. there is an indoor pool which is much warmer and if you have £30 per person left at the end of the week the spa had an offer on of a massage, turkish bath / steam room and use of the indoor/outdoor salt water pool which is lovely and well worth the money. All in all id go back but maybe when im a little older.", "title": "Great place for a late autumn break", "helpfulness": 1, "user": "Usk-Traveller", "date": "November 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 48758938}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed for one week March 8 to 15 at Royal Azur Thalasso Golf, Hammamet, Tunisia. I would strongly recommend this hotel for a number of reasons. The hotel is extensive with beautiful gardens and a fine indoor and outdoor pool situated right on the beach and one easy walking mile from Hammamet town . The rooms are bright and the bathroom/WC very modern. The housekeeping is first class. We had half board and the dining room is very well serviced by polite staff and the food is very considerable and fresh each day. Here you are welcomed and it is easy to find your own way round and obtain modestly priced tours and taxis once into town.", "title": "lovely hotel, service great very polite nice helpful staff", "helpfulness": 3, "user": "SomersetRosemary", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45217857}], "location": {"country": "Tunisia", "continent": "Africa", "city": "Hammamet"}, "stars": 5, "variance": {"poor": 27, "average": 38, "very good": 86, "terrible": 40, "excellent": 58}, "aka": "Royal Azur Thalasso Golf Hotel Hammamet", "slim_ranking": 0.543307086614}