{"user_rating": 4.0, "review_count": 788, "name": "Royal Decameron Boa Vista", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had to stay here for the second night of our delayed flight back to Gatwick. Another 'all inclusive' but no where near as opulent as Hotel Riu but still as despicable for what it does to the Island. You can read my review of Hotel Riu to see what these places are like save me going into another depressing dialogue.", "title": "Another soulless 'all inclusive' sucking the life blood out of the island", "helpfulness": 2, "user": "Samkirk9", "date": "January 11, 2010", "detail_rating": {"cleanliness": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 53212088}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We were placed in a room that had an inter-connecting door to another couple clearly not happy as to how they had been treated, which we had to listen to, as well as being able to smell their shower gel or whatever they were spraying on, so beware that you may not be as private as you would like.", "title": "Its an all inclusive, of course its wasn't good!", "user": "TravelPad", "date": "January 10, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 53120683}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "It is close to the beach and you have a private veranda. Then everything is the same as any other beach resort in the sun - pool, bar, restaurant - all complete with imported food (lots of fresh fruit, but what was telling was that there were no bananas - one thing Cape Verde has plenty of!!), watered down beer and soulless entertainment. Do yourself a favour and stay somewhere else (Spinguera, Ca Nicola, Casa Orquidea, Parques das Dunas) to stop places like this destroying the local culture, economy and environment.", "title": "Much better than we imagined", "helpfulness": 6, "user": "stockholmcouple", "date": "November 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 49427391}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "We only spent a night here as there were problems getting back to Gatwick in January due to the poor weather conditions. This was our second stay in an all inclusive because of the issues with the flight and the weather and I have to say that I wasn’t overly impressed. It’s a difficult one to gauge in terms of value for money as we didn’t actually pay for anything. However, I will say that the rooms were quite basic. All the little bungalow like units were all set out in small street like rows spiralling out from the central pool, bar, restaurant and reception area.", "title": "Flight delay", "helpfulness": 1, "user": "tiamaria3", "date": "September 17, 2009", "detail_rating": {"cleanliness": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 42393680}, {"rating": 1.0, "stay_parameters": "Stayed September 2009", "text": "The rooms are clean and tidy with enough space to move around without feeling cramped. There is also a small balcony area outside where you can sit outside taking in the views (if you happen to have one of the ones near the sea that is). The toilet and bathroom area are also clean enough and perfectly adequate but they like the entire apartment it does seem to be a bit dated and tired. Ours had a couple of mosquitoes in it and other people within our group complained of lots of these and cockroaches as well. We did see a large cockroach but this was around the pool area and not in the room itself.", "title": "one night was enough", "helpfulness": 1, "user": "loulou040", "date": "September 16, 2009", "detail_rating": {"cleanliness": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 42125349}], "location": {"country": "Cape Verde", "continent": "Africa"}, "stars": 3, "variance": {"poor": 38, "average": 112, "very good": 344, "terrible": 27, "excellent": 267}, "aka": "Royal Decameron Boa Vista Hotel Boa Vista", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}