{"user_rating": 4.5, "review_count": 1770, "name": "Royal Sonesta Hotel New Orleans", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "This was one of the most luxurious rooms that I've stayed in for a long time. To start with, an incredibly comfortable king mattress and down pillows, an immaculate, spacious bathroom, extra furniture. It's obvious that the room has been completely renovated and that it was redesigned for a guest's total comfort. The room is well-appointed and extremely well-lit. There is a larger-than-usual desk and 2 chairs for your workspace, as well as an armchair in the corner. The desk faces the window, not stuck against a back wall. There are 2 phones and one of them is a cordless for your convenience. The lights and lamps are well-placed, including the light switches. When I needed to reach out, there was the desired switch. Very well-thought-out lighting design.", "title": "Luxury room, unbeatable location in courtyard setting", "helpfulness": 1, "user": "IntrepidfromMontreal", "date": "April 20, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 1794033}, {"rating": 5.0, "title": "Gem amid the debauchery", "text": "The bathroom is the crowning glory, with wall-to-wall marble counterspace, magnifying mirror, recessed spotlights in the bathtub area (you can finally see yourself), nice toiletries, toilet pressure like you wouldn't believe (vacuum suction like in an airplane washroom). If you get a room facing the courtyard, you'll get a quiet night. You don't hear the street noise at all despite being right on Bourbon St. Where the hotel needs improvement is at the front desk. Too slow to check-in and check-out. It also took 2 hours for them to connect my phone before I could use it (should have been co-ordinated with my check-in). Doormen are also lacking. In summary, the service is a bit lackadaisical but your material comfort is guaranteed.", "helpfulness": 1, "user": "ballst89", "date": "March 30, 2004", "id": 1756036}, {"rating": 4.0, "title": "Had a great stay", "text": "I stayed at the Royal Sonesta from March 11th to March 15th after winning a performance award from my company, and it was a wonderful experience. Every staff member, especially those at the front desk, was very helpful and friendly, the housekeeping was prompt and thourough, and the courtyard and pool were gorgeous. Ask for a room overlooking Bourbon Street if you like to people-watch, but only if you sleep soundly, as the party seems to go every night until the wee hours (Some from our group had trouble sleeping; I said, \"Come on..it's New Orleans, man! You can sleep when we get home\"). We had several banquet functions as well, and the food and service were impeccable. One minor complaint...the bar at the dinner banquets served below bottom-shelf booze, and a classy, five-star joint like this shouldn't even have that junk in their liquor cabinet...I had to go to the Mystik Den to get a quality cocktail. Overall, though, outstanding. Stay if you get the chance, and explore the French Quater and New Orleans beyond the area surrounding the hotel", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 2, 2004", "id": 1624395}, {"rating": 5.0, "title": "Great Weekend Getaway", "text": "Unlike some negative reviews, staffs were helpful, our regular room was nice and clean (seemed recently updated). Like everyone say, can't beat the location. If you plan to sleep at night, make sure you ask for rooms facing courtyard. Well managed pool and courtyard area gives you a sense of being at a country inn while the hotel is right on Bourbon st. Overall, we had a great time at this hotel. I'd say better than expected.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 22, 2004", "id": 1563297}, {"rating": 5.0, "title": "Still the best", "text": "I loved the Royal Sonesta. I spent this past weekend there to a \"play tourist in my home town\" and I was not disappointed. I checked in Friday afternoon and was greeted warmly by everyone from the doorman to the front desk clerk. The concierge Russell made some great recommendations for dinner, shopping and even a city tour. I'll definitely treat myself to another weekend soon!", "helpfulness": 1, "user": "CL", "date": "January 14, 2004", "id": 1550912}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The Royal Sonesta is a fine elegant hotel in the middle of the debauchery that is Bourbon Street. I was there on business so the partying location was really not a bonus, and in fact looked pretty disgusting. Luckily, I had read the other reviews and knew to ask for a hotel away from Bourbon St. That did mean that the room faced a dark little courtyard and another side of the hotel, so I pretty much couldn't open the curtains. The room was nice enough, with a gigantic flat-screen tv. The bed was quite comfortable. The room had the strangest lighting switch situation, where I literally could not figure out a combination to make just the bedside light be on for bedtime reading. Old hotel, I suppose.", "title": "A decent hotel in a party location", "user": "Feverpitch", "date": "April 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 14891566}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The service and people running the hotel were wonderful and attentive and helped me fax a few papers for free at the front desk rather than shelling out $7 at the business center.", "title": "Nice location", "user": "Fademist", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14886391, "likes": {"liked": "— Location!!", "disliked": "— Cramped room (2 dbl beds)"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The gym was small and had two bikes, two treadmills, two elliptical and a few weights. It also didn't open til 6 am (literally locked shut) which is kind of a problem for someone there on business.", "title": "Wonderful", "user": "Aniki", "date": "April 7, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14855945, "likes": {"liked": "— Central location, cleanliness", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This hotel was very nice and smelled lovely! The room was a bit cramped and we were on one of the upper floors but it was nice. It is in a great location, right on Bourbon St. and we got a good rate for the room. Had we not got the great rate I'm not completely sure it would have been worth the money. We didn't have any problems with it being too noisy or anything like that. It was really nice not having to walk forever and a day just to get back to the hotel and it was nice to know that while you were out sight seeing, it wasn't that long of a walk back to take bathroom breaks. Oh, we went in May and it seems the pool is not heated, so it was too cold to swim in but we were too busy anyways.", "title": "The Royal Sonesta Hotel is ok", "helpfulness": 1, "user": "True_Tiger_Fan", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 14750926, "likes": {"liked": "— Check in / front desk", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I stayed here recently for a quick weekend trip with a girlfriend. It was great. Check in was very quick and courteous. Our room, 4001, was easy to find, comfortable and very clean. We had a view of the back of the building but it didn't matter to us, in the morning we has sunlight. The bathrooms are tiled and have granite counters. They give you a small basket of toiletries. It was clean and there is a good amount of counter top space.", "title": "Nice Hotel/Great Location", "user": "cajas1", "date": "March 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14616122, "likes": {"liked": "— Location and bed", "disliked": "— TV and Room Service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "March 23 2013", "title": "Awesome!", "helpfulness": 1, "user": "WendyFreckes", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155378231}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "This hotel is great, met all our needs. Our room was on the 6th floor facing the back so nice and quiet every night. Rooms large with 2 double beds. beds and bedding were excellent! Entertainment changes every night in the Jazz Club. Pool on 4rd floor is heated so also nice and has bar service. Have not one single complaint. Located on Bourbon Street so lots to do If you like fun. We headed out and saw all the highlights of NOLA. Mardigras World was a great place as was the swamp and plantation tour We also walked to the free ferry and crossed over to Algier and walked all over this quaint town. Walked to Lafeyette Cemetary quite a hike but worth it Can't wait to go back!", "title": "In the Heart of New Orleans", "helpfulness": 1, "user": "Lpfetzer", "date": "March 22, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 155321175}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had the opportunity to stay at the Royal Sonesta Hotel prior to our cruise in January. My husband picked it based on reviews he read here. We arrived to be welcomed by a doorman dressed in a long black cape, very nice and friendly. The front desk staff was fine and our room was ready. Keep in mind, you are in an historical building, not a chain hotel on the highway. That being said, the rooms are very beautiful with what could be original trim and doors/ windows. Our room faced the courtyard pool (a bit disappointing to find it under renovation. We had paid extra for the view only to find workmen instead). We could access our room from either the courtyard ( there is an outdoor wrap around walkway that connects all rooms) or from the interior corridor. The bathroom is updated with a nice selection of ammenities. The lobby is nicely done with gorgeous fresh flower arrangements that were among the biggest I have seen. The location is right on Bourbon Street and easy walking distance to everything in the area. We felt very welcomed and at home here. It was nice to be able to walk to so many close local restaurants and not need a taxi to get around. There is a coffee shop in the lobby and a restaurant on location but we didn't have the opportunity to experience either one. Would definitely stay here again.", "title": "Nice hotel if staying on Bourbon is important", "helpfulness": 1, "user": "preslb", "date": "March 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 155292882}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If you want/need to be on Bourbon St then this is the place to stay. The rooms are nice and very clean. Even right on Bourbon the noise level was not much of an issue. The hotel has a coffee shop and two restaurants/bars on site. I found that the drink prices at the hotel bar where very high compared to other places very near by. This hotel also has what looked to be a very nice pool and outdoor bar. Unfortunately, we vistited in March and both where deserted.", "title": "Amazing Hotel & Staff", "helpfulness": 1, "user": "PITA529", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155284621}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "In closing, although we enjoyed our stay the next time we visit we will most likely try another hotel. We found that for us staying on Bourbon is not a big deal. The entire quarter can be seen on foot and staying elsewhere might be cheep and a little quiter. Also, if traveling with kids this might not be the best choice because a gentelmens is located just outside the front door.", "title": "Best place to stay in New Orleans", "helpfulness": 1, "user": "SHEIDA S", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155242159}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "This was my first trip to New Orleans, and I'd stay here again in a heartbeat! The hotel is attractive and well-maintained, and the pool is lovely. We walked around in the hot sun exploring the city and looked forward each day to relaxing at the pool in the late afternoon with a swim and cocktails- perfect! The room was very clean and well decorated, but the walls were a bit thin- I tried to sleep in late and heard lots of activity in the hallway. We got a free newspaper delivered at our door each morning, and there was a fancy TV system in the room with cable, internet, and video games.", "title": "Highly Recommend...", "helpfulness": 2, "user": "Duxbury", "date": "August 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3790385}, {"rating": 4.0, "title": "Will only stay at the Royal Sonesta!!!", "text": "The concierge staff were fantastic (especially Russell)- very friendly and helpful. They booked tours for us and gave us great restaurant referrals. This hotel is located on Bourbon Street which can be pretty sleazy and stinky, but the location is central and we heard no street noise in our inner room. The outer rooms facing Bourbon Street might be noisy because the bars stay open way past 2:00 am. I read another review where someone had jewelry stolen, but that's due to carelessness on their part- the hotel provided an in-room safe, and experienced travellers lock valuables up in their suitcases.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 17, 2005", "id": 3781628}, {"rating": 1.0, "title": "Overpriced", "text": "It was my first trip to NOLA and I was thrilled to stay in a hotel right on Bourbon Street! Upon checking in, my friends and i were greeted by the doorman. The staff were super friendly and very helpful!! Talk about southern hospitality. We ate at Desire's twice - the red beans and rice was great and oysters are to die for. What I liked about my stay is that we had peace and quiet in our room (not overlooking Bourbon) and the hotel lobby had a nice and classy feel. The rooms were nice - we got 2 connecting rooms and they were both lovely and comfortable. The bathroom was spacious and I liked the extra drawers in the bathroom. We didn't encounter the water pressure issue I read on the other reviews. Housekeeping also kept our room clean when we wanted them to. However, the walls are thin but it didnt really bother us since we were always out. The pool was a nice plus. We also like the security in the lobby at night - since it was our annual girls' trip, we felt really secure. As soon as we step out of our hotel, it was a party!!! We will definitely stay at Royal Sonesta when we go back next year!!!", "helpfulness": 7, "user": "Tim_the_Taf", "date": "August 11, 2005", "id": 3754140}, {"rating": 5.0, "title": "Can't Say Enough Good Things", "text": "Stayed there with my family Aug 1 to 4 2005. Good points - its on Bourbon Street. Bad points - its on Bourbon Street + everything else. Asked for a quiet room months ahead, we were given a room next to the elevator: noisy, lots of convention goers yelling up and down the corridor at 3 a.m. Parking is difficult - they have a garage (about $30/ day !!) but its small and spaces are tight. My wife had to go to ER whilst we were there, they didn't even know where the nearest hospital was ! Constant feeling that they wanted our cash but didn't want to provide anything like service in return. Avoid.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3737339}, {"rating": 1.0, "title": "Disappointing service and unresponsive management", "text": "I had not been to New Orleans in years and was skeptical of taking my 7 year old son and staying on Bourbon Street. But staying at the Royal Sonesta turned out to be the highlight of our trip. We were there from July 27 though July 30. With two steps you are out of the craziness of Bourbon Street and you enter a refuge that was excellent in every way.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3726929}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We were overall happy with the Royal Sonesta. It was PERFECT location if you are looking for people watching and to have a good time. We asked for a room with a balcony over Bourbon and the first guy told us $100 extra where the lady that actually changed our room told us $75. The rooms were pretty clean, you can tell it is older, but what isn't on Bourbon street! We spent most of our time on our balcony (total of $184/night) just people watching. The service was good. Concierge pointed us to Petunias for breakfast which was GREAT, The Gumbo Shoppe for dinner which was pretty good. Friends recommended Dragos' which is just outside the city and it is UNBELIEVABLE- truly a must go!!! Great seafood (I hate oysters and ordered TWO dozen here!)", "title": "Great for the Price!", "helpfulness": 2, "user": "LaurenEk77", "date": "September 19, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5817059, "likes": {"liked": "— Location", "disliked": "— service"}}, {"rating": 5.0, "title": "Great Hotel", "text": "The concierge gave us directions to Starbucks' by saying \"two streets down and go left\"- he forgot to tell us is it IN the Sheraton Hotel on Canal and you would never see it unless you asked. We also wanted to watch a football game on Sun. so we asked who would have ALL the football games (not just NOrleans) and they told us to go to a Sports Bar down Bourbon, after walking there in the pouring down rain, we found they had ONE TINY tv and weren't playing our game.", "helpfulness": 9, "user": "mitzi610", "date": "August 3, 2006", "id": 5551113}, {"rating": 4.0, "title": "Pleasant Stay", "text": "I saw one user say he got a room for $80 and I think that would be worth it for a regular room not on Bourbon.", "helpfulness": 5, "user": "TomJr", "date": "July 31, 2006", "id": 5532697}, {"rating": 2.0, "title": "Hotel had problems,Bourbon Street scary", "text": "I think it is worth it if you get a balcony room and love to watch people walk by. It may be a little loud if you go to bed early- but why stay there if you plan on it? The hallways are beautiful and the flowers at the entrance smell extraordinary! But check your water bottle in your room before drinking- ours had been opened and replaced with tap! The maid did offer to bring us a fresh one for free.", "helpfulness": 8, "user": "Neal D", "date": "May 15, 2006", "id": 5071540}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Overall- a great trip! We will be back!", "title": "Alive and Kickin'", "helpfulness": 11, "user": "Giveypup", "date": "May 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5036071}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My husband and I were recently here for a convention! We loved our stay in the Royal Sonesta. We had a beutiful room with a private courtyard. The room was 2 levels with the kingsize bed up a set of spiral stairs. It was very clean and very queit considering it is on Bourban! the cleaning staff would come in at night, pull back the blankets and leave a chocolate on the pillows.", "title": "Awesome stay", "user": "7cinderella", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14487124}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "It was nice to be in the center of all the excitement on Bourban. We could come and go to drop off shopping, to take a break, or whatever we needed and still be a moment a way from Bourban. the staff were very friendly and helpful. The pool was also amazing to lay beside. Didn't go in but there was mention it was cold! I would definitley stay here again. Close to restraunts, shopping, bars, etc. Loved it", "title": "Loved this hotel", "user": "momcarlo", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14292662, "likes": {"liked": "— Location, service, elegant touches"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel is an experience in luxury. Yes, the address is Bourbon Street, but don't let that deter you from staying here. My 13-year old son and I stayed here for a quiet spring break getaway. Our room on the 4th floor had French doors that opened on to the pool and deck area. It was so lovely that it was hard to drag ourselves away from the hotel. The Desire Restaurant was great and delicious. The fresh shucked oysters were a real treat.", "title": "Mixed bag at the Royal Sonesta NOLA", "user": "austinmdpedi", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 14245882, "likes": {"liked": "— Great last minute rate", "disliked": "— Location on Bourbon Street"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We had room service every morning so we could just relax and enjoy the lovely view from our balcony. The fresh flowers on our food tray every morning was a splendid touch.", "title": "Great Hotel in French Quarter", "user": "KerryWho?", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14035999, "likes": {"liked": "— Location", "disliked": "— Pay $10 per 24 hour period for Internet connection. The internet should be free of charge."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Just completed a four night stay at the Royal Sonesta New Orleans.", "title": "Beautiful, classy hotel in a crazy, fun location!", "helpfulness": 1, "user": "Imatravler", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14024224, "likes": {"liked": "— Quiet hotel in the middle of everything!", "disliked": "— Nothing!"}}, {"rating": 2.0, "title": "the royal has slipped", "text": "I travel to New Orleans every year for business on an expense account.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 10, 2004", "id": 1545427}, {"rating": 5.0, "title": "Royal Sonesta all the way!", "text": "I used to love the Royal sonesta because of the location, the service and the accomidations. It is one of the older places in town and has a certain charm. I stayed there last fall and the room was clan but very worn and soiled, there was a dark brown path of dirty worn carpet from the living space to the bathroom. The staff acts like they are working in a five star hotel when they are really working in a rip off joint for the convention trade. I wont stay there again and you shoudn't either unless they drop the rates way down to reflect the drop in quality. The bar is still worth a visit for a nice quiet place where they build a great Sazerac.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 8, 2004", "id": 1543752}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "I went to New Orleans for New Years with my girlfriend, it was my third time visitng the city. We stayed for 5 nights. This is an exceptional hotel. The rooms are nicely decorated, not extremely spacious but a good size, appropriate for the price. Everything was fully functional, clea and the view of buorbon street was awesome.", "title": "Exceptional hotel and service", "helpfulness": 9, "user": "TL-NYC-1", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5029945}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "THe hotel loby, bars, retaurants and boutiques are fantastic, especially the oyster bar. The hotel lobby is beautifully decorated and the staff extremely attentive to the needs of guests. The bellhops are knowledgable and took care of the little details like getting cabs to come onto crazy bourbon street. No hidden charges, no nickel and diming, just plain honest hardworking staff.", "title": "Beautiful hotel", "helpfulness": 6, "user": "jlr51", "date": "April 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5014190}, {"rating": 4.0, "title": "Great time at the hotel.", "text": "The location of this hotel is phenomenal just across the street from Rick's cabaret on bourbon street and within walking distance of everything you need. If you are going for Mardi gras or a festival, this is where you want to stay. Balconies are beautiful. The rooftop bar was cool, but not open when we were there:(", "helpfulness": 9, "user": "SusantravelCA", "date": "February 9, 2006", "id": 4449890}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "This is defintely a 4 star property, with a five star location and amenities. In my opinion the nicest hotel on bourbon that is somewhat afforable.", "title": "It's o.k.", "helpfulness": 7, "user": "L8sho", "date": "January 28, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4393927}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My husband and I just recently stayed at the Royal Sonestal and were very impressed with everything. The lobby is incredibly beautiful. Our room was very nice and overlooked Bourbon Street, although we were there mid-week and were never disturbed by noise. The pool was sparkling and there is a pretty courtyard. We had a problem with our in-room safe (battery needed to be replaced), and someone arrived to fix it within ten minutes or less. All of the staff was very friendly, from the front desk, to doorman, to the man who changed the battery in the safe.", "title": "Great hotel!!", "helpfulness": 4, "user": "ceeceerose", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4361307}, {"rating": 5.0, "title": "Spring Break with kids in tow ....", "text": "Well, this is our 2nd visit to the Sonesta. This time we visited on Spring Break with 2 kids, aged 13 and 18. I was not sure what to expect with kids, but the kids enjoyed the hotel. When we arrived, we dined at Desire immediately. The food was excellent and the kids could view the street entertainers on Bourbon. This was Spring Break so my best advice is to get an inside room, as the noise on Bourbon Street was very loud. At night, we entered the hotel through the side entrance to keep the kids off crazy, crazy Bourbon Street. (We only did this because the first time we entered through the front entrance at night, there was a guy in the street taking off his pants!) Hahaha. Anyway, at night we visited Irving Mayfields and listened to jazz. Ahhhhhh... perfect! We are returning in May and we have reserved a patio room. We cannot wait to return!", "helpfulness": 2, "user": "Dawn T", "date": "March 14, 2013", "id": 154570460}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Great Hotel. Great staff. Great location. The Concierge was extremely helpful. We stayed with a view of Bourbon Street. You need to stay on that side vs. courtyard. Not too loud yet you get to hear what New Orleans is all about. I will stay there again", "title": "Great Place, Great Location", "user": "Danmcneill", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154558830}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "First, let me say that I got a great deal through Travelocity on this hotel and saved over 100.00 per night vs the hotel website price. The bathroom could use an update as some previous reviewers have noted, but it was large and clean and there was definitely ample hot water. I thought the mattress was excellent and the pillows/comforter were too. Cable was iffy and digitized a lot. Our room was very quiet considering we were on Bourbon St. We asked for and got a room facing the pool. It was on pool level and had a door into the court yard. It was nice having music in the lounge downstairs. The staff were all wonderful. If I happened on the same package I got this time, I'd stay again.", "title": "Good hotel for the money", "helpfulness": 1, "user": "ardeasnest", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154549555}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Directly on Bourbon Street very clean and outstanding employees...all very courteous and welcoming. Came back to my room and found a note under the door . Note stated that there was a plumbing problem and not to use the bathroom . I called the number on the paper and inquired as to the problem . The manager couldn't have been more apologetic and offered me a new room . He come up LITERALLY 3 minutes later with new key cards and escorted me to my room. Both rooms very clean. Beds and pillows were UBER COMFY. Will definitely stay here again.", "title": "Outstanding stay at Royal Sonesta", "user": "JMur4603", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 154549242}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Went here for business in February- four nights. The first night, they gave me a smoking room (\"nothing else available\") even though i asked for non-smoking. It faced a side street. (not bourbon!) Between the noise from the bar down below, and the smell of smoke- i got 2 hours of sleep. This was TERRIBLE because i had to be at work at 6am the next day. I considered driving to Mississippi to find another hotel.", "title": "Almost cried myself to sleep", "helpfulness": 2, "user": "Freckles92", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 154543168}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Beautiful hotel with classy old world charm overlooking Bourbon St. The staff exemplified true southern hospitality. Our room was immaculate with a balcony right over all the action. We truly recommend this hotel for anyone who is planning a trip to New Orleans. For us it was a dream come true. We most especially want to thank Andrea in reservations for her excellent customer service - she was a delight! She should be commended for her good work. Thanks very much to the management for treating us like VIPs and making our stay a fantasy. Every staff member contributed to make this vacation a dream. Thanks also to Ebanks, Ashley, Danielle, Jobain and all not mentioned for being so wonderful . We will most certainly return. xxxxoooxx", "title": "Well above our expectations", "helpfulness": 1, "user": "TedjsMillville", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155206874}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We had requested an additional roll away bed and it was delivered immediately. Within an hour they called and asked if we had received the bed. They have limited parking and they reserve it for guests of the hotel, even though there is a charge it felt secure. The hotel is elegant and has wonderful corners where plants bloom, rest is welcomed, peace is plentiful and relaxing is an instant instinct. I LOVE THIS PLACE!", "title": "Wonderful Hotel, Super Concerned for their guests", "user": "Donna H", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155077030}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The Royal Sonesta's location, facility, staff, and amenities make it the perfect place to enjoy the French Quarter. We were so close to all the action and fine restaurants, that our few days were jam-packed with many wonderful experiences. I would definitely stay here again.", "title": "Twins on Bourbon Street", "user": "Twins51", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155070839}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Great location. Drove up and were told we could self park, but when we drove down into the garage we were told we would have to valet park. Small room but very nice. Stayed on the club level and really enjoyed the food and drink in the club lounge. Liked some of the little touches like my name printed on the stationary. Jacuzzi tub did not work. Wake-up call feature just rang busy. The waitresses at the Jazz club were not friendly or timely. Too many other good hotels in New Orleans to stay here.", "title": "Not Good Enough", "helpfulness": 1, "user": "CanuckHorn", "date": "March 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155014787}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "After reviewing many different hotel options, we decided to make a reservation at the Royal Sonesta for its location and reputation.", "title": "Perfect spot for us", "helpfulness": 1, "user": "mscontradiction", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154789923}, {"rating": 4.0, "title": "Cushy beds we wanted to take home", "text": "I'd not been for 25 yrs & my friend from Colorado has always loved Mardi Gras, so where else to go for our road trip April 2004 but New Orleans, LA - the Center of Mardi Gras for the U.S. & where did we stay but the Royal Sonesta on Bourbon Street for Sun & Mon, after the Jazz Festival (4/25 to 4/26) & got great rates! What was the best part of the stay? Sleeping soundly on the cushy beds we wanted to take home! We checked out the in-room catalog but we couldn't afford all it took to make that perfect bed! I reserved our room using Expedia & when we checked in they bumped us up to a Deluxe room, plus had no problem with my request for two Double beds when the webpage had said it was a room with a Queen bed - maybe since it was after Jazz Fest & the rain still hadn't stopped. Our room overlooked the pool courtyard for peace & quiet each night after visiting Bourbon Street, which was right outside the hotel front door. There were fresh flowers outside the elevator doors & plants in bloom in the hotel's other garden courtyard, plus a coffee bar just downstairs (if you couldn't make it to Cafe du Monde in the morning.) The only bummer was paying for the parking garage at nearly 30 bucks a night after taxes, which was a big surprise! (at least it was in a safe place, I'd read bad reviews from other locations)", "helpfulness": 3, "user": "SharonInAVolvo", "date": "May 9, 2004", "id": 1891074}, {"rating": 5.0, "title": "Great place! Great deal during Mardi Gras", "text": "I stayed at the Sonesta during Mardi Gras this year and I loved it. The room was gorgeous, although for the price, I would have liked to have been given a dbl bed room instead of a single. The hotel was clean and the service was excellent. Will stay there again.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 7, 2004", "id": 1881265}, {"rating": 5.0, "title": "Wonderful stay", "text": "The room was immaculate. My friend and I got a room with two double beds and both agreed these beds were possibly the most comfortable we'd ever experienced. Nice touches like turn down service twice in the evening. The concierge patiently assisted us with choosing a restaurant for dinner. The hotel is so close to the action on Bourbon Street, that we could run up to our room for the bathroom - much quicker than the lines and definitely cleaner! We also enjoyed the piano bar in the hotel. On Sunday morning it was raining. The doorman escorted us across the street with an umbrella so we wouldn't get wet. All staff very nice and courteous. I highly recommend the Royal Sonesta. Check in a little slow because our room was not ready until 5 - this was busy Jazzfest weekend. We used the time to set up our dinner plans.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 28, 2004", "id": 1843848}, {"rating": 4.0, "title": "Great Hotel", "text": "My husband and I just returned from our second stay at the Royal Sonesta. This is a beautiful hotel and the beds are extremely comfortable. We had a room overlooking the courtyard which was very quiet. We found the staff to be friendly and helpful. Since this is the hotel we wanted to stay in, I did check rates regularly on Travelocity, Expedia, and the Sonesta Website. I finally received the best rate by calling the hotel directly. The location is perfect, if you would like to visit Bourbon Street in the evening. Also ACME Oyster House is 2 blocks away and has excellent food at a reasonable price. For a quick breakfast, there is a McDonalds located about 3 blocks away on Canal Street. We would definitely stay at the Royal Sonesta again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 23, 2004", "id": 1833849}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "My husband and I stayed at the Royal Sonesta New Orleans in early December while attending a convention. It was our first trip to New Orleans so we were not sure what to expect. Upon arrival (at 8pm or so) we were told our room was not ready. They had us sit for 15 minutes or so before providing us with a room. This seemed odd at this time of day, but it was a minor inconvenience and they were polite and accommodating in general. The lobby of the hotel is gorgeous (especially at Christmas time!), so at least it wasn't a bad wait!", "title": "Nice hotel", "helpfulness": 1, "user": "Stacelet", "date": "February 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 13812779}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We had a regular king room. My first impression was that it was small. It was nice looking and comfortable, but definitely NOT a lot of room to move around! We were thankful that our room did not face Bourbon Street because several of the people at our convention said the noise never stopped. We did not experience noise problems.", "title": "My favorite getaway!!!", "user": "bigdave351", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13509460, "likes": {"liked": "— Nothing! That's why I always come back!!!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I would personally not choose this hotel if you are bringing children. I know this is probably not a major family destination to start with, but the location of this hotel on Bourbon Street makes it impossible to walk even one block without passing \"adult\" entertainment. It is absolutely not hidden. We are not really into the party scene and found this a bit of a negative to this hotel. I prefer to travel in areas where I can walk out the door and get a coffee or go for a run by myself and with all the drunks at all hours of the day right outside the door (Many of them men that you can't walk past without getting eyed up and down blatantly), we just didn't feel this was \"safe\" in this location. This is a personal preference (if you love to party this is the place!) and in no way is the fault of anything inside the hotel -- just the location.", "title": "Loved the royal sonesta!!!", "user": "Neil_staffs_UK", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12210941, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "If we went back to New Orleans I would stay somewhere toward the middle of the French Quarter near Jackson Square. Even though it is walking distance from the Royal Sonesta it is in a quaint shopping area with a much wider variety of restaurants and entertainment.", "title": "Beautiful Hotel", "user": "Melissacita", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11999073, "likes": {"liked": "— Clean, large room", "disliked": "— Very loud on Royal Street"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is one of the best hotels I have ever stayed in!!! It starts when you check in with the guys in the garage! They get you in and find a place to park since it is a very tight garage. Then the bellman are first class! It dose not matter if it is morning or night these guys are wonderful. Not pushy and go out of their way to get you what you want!!! Then the front desk is good and you see alot of new faces lately! Alot of young people!!!", "title": "Springtime in NOLA", "helpfulness": 1, "user": "Ohio_Jeff", "date": "December 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11254234, "likes": {"liked": "— Location, hotel quality", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "A fabulous hotel on Bourbon Street with a great location. Our room was not spacious, but just perfect for two people for a long weekend. The rooms on the courtyard were quiet without noise from Bourbon Street (good for sleeping in after late nights). Very comforatable. Nice area around the pool with a bar for a late afternoon cocktail. I'd recommend anyone to stay there.", "title": "A Winner!", "user": "nyNYanonymous", "date": "March 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14613406, "likes": {"liked": "— the Location!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "My fiance and I just got back from New Orleans and stayed at the Royal Sonesta. I was in the same situation as many, trying to pick the best hotel in the best location, etc. You will not go wrong at all staying at this hotel. The other hotels I was considering was the Monteleone and the Maison Dupruy, but neither of them were in this fabulous location and the Monteleone looked old (plus I read reviews that the rooms are very small) and the Carousel bar was nothiing at all to write home about.", "title": "Stay here..", "helpfulness": 1, "user": "jennycake", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14600378, "likes": {"liked": "— Location and Comfort", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "I think the Royal Sonesta is the best hotel in NO--hands down. It's in a perfect location, right on Bourbon, and its pure luxury. The rooms are very updated and a good size, with flat screen tv's and a modern bath. We stayed in the pool patio room and the bourbon balcony to break things up. Honestly the pool patio room was great. The pool which is lovely (just opened0 and it was great fun to have a drink right at their bar. Yes there is much to do in New Orleans but I always appreciate not having to wander if you don't feel like it. There are two other bars in the hotel (one in the lobby and one right on bourbon) which are part of the hotel too. Also a few restaurants and room service. You simply cannot go wrong in this hotel, as its close to everything and nothing about it is old--nothing. Pay the extra to have the location and service. We were SO happy with this choice....", "title": "Beautiful Hotel, right in the heart of the action", "helpfulness": 1, "user": "NycCarmenSanDiego", "date": "March 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14551030, "likes": {"liked": "— Large room, garden, next to everything", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "as far as the bourbon balcony rooms-yes they are louder. No difference at all in the rooms (except the tv was smaller on bourbon), but it is louder. If noise is an issue stay in the pool patio room as they are so lovely. It's really quiet and nice to have the option of letting some fresh air in. Also, we did the Katrina tour and thought it was excellent. The devastation is unreal but the information is endless..also don't eat at Dirty Harry's-food was awful. Our best meal was at Margaritaville on Decatur....belive it or not!", "title": "Loved the Royal Sonesta", "user": "ljmckibben", "date": "March 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14527835}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "My husband and I stayed here a month before hurricane Katrina. When we arrived at the hotel, there was a nice lobby with a beautiful chandelier.", "title": "Fine stay at the Royal Sonesta", "helpfulness": 1, "user": "Sarahste", "date": "March 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14487710, "likes": {"liked": "— Location in French Quarter.", "disliked": "— Bourbon Street smut so immediately close."}}, {"rating": 3.0, "title": "Didn't love this time", "text": "Stayed at the Sonesta for New Year's Eve and Sugar Bowl, big mistake for us. Even though we had a suite with a semi-private courtyard, our friends could not enter the hotel with us that weekend. For the money we paid to stay there, we should've been able to let anyone we want in.", "user": "dawn1973", "date": "January 13, 2004", "id": 1550147}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This was not my first trip to New Orleans and of course one can ever miss seeing the Royal Sonesta when walking down Bourbon. Its an icon, an institution. So when the opportunity arose to stay there for a few days over spring break, I took it.", "title": "Mixed Feelings", "helpfulness": 2, "user": "vlfair", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 155642097}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The first obvious feature of the Royal Sonesta is the location. This could be a plus or a minus! You are definitely in the heart of the quarter and close to shops, bars and restaurants. But on the flip side, you are on Bourbon and it can be a bit crazy once you walk out the door. Use the Conti St. entrance to avoid some of the insanity.", "title": "Needs care and renovation", "helpfulness": 1, "user": "Minafrombrazil", "date": "March 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 155536305}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Secondly, I must say that the staff is phenomenal. Extremely polite, helpful, exactly what you expect (and a bit more) from a 4 star hotel. Our room was very, very clean and the beds were comfortable. Our room was in the back and very quiet, however my parents room was across the hall from some balcony rooms and it got pretty rowdy, so keep that in mind when requesting a room. We were in a \"standard\" room and I felt the decor was pretty average and the furniture could use some updating. One chair was nearly threadbare in spots. The elevators were extremely slow and unpredictable (I once went from 4 to 2 and back 3 times before I arrived on the ground level). Additionally, if you are driving to the hotel it can be difficult to get in and out simply due to the fact that drunk pedestrians do not yield to cars. (FYI the parking garage is on Conti St). There was a pretty good free wi-fi connection.", "title": "Very good option right in the heart of French Quarter", "helpfulness": 2, "user": "Gareth M", "date": "March 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155513498}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Also, some may find this picky, but there was no coffee pot in the room. Yes, I know hotel room coffee is not always the greatest but it can be the difference between me being human first thing in the morning and not. I did not enjoy getting up, getting dressed (trying not to look like I had slept on Bourbon St) and going downstairs to wait in line for 20 minutes for a $5 cup of coffee. Never a good way for a coffee drinker to start the day.", "title": "Perfect location", "helpfulness": 2, "user": "Mary S", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155446463}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I really wanted to love this hotel, really I did and I had great expectations but outside of the staff and the location, it doesn't present like a 4 star hotel. (If I had been paying the rack rate, I would have been extremely upset.)", "title": "Just okay", "helpfulness": 1, "user": "JustCurious44", "date": "March 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155378565}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I have been to New Orleans several times, but this was the first time taking my husband. I was able to find a great price for the Royal Sonesta over Easter and decided to gie it a try. We were not dissapointed.", "title": "Great Location, Great Hotel!", "helpfulness": 4, "user": "heathork", "date": "December 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4251134}, {"rating": 5.0, "title": "Wonderful Week at the Royal Sonesta", "text": "Our room was nice but very close to bourbon and very noisy. The next night, we opted for a poolside room. Very nice. Quiet and overlooking the courtyard. Although we didnt use the pool, it was a nice option.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3905185}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We had a great time and would recommend this if you can find a good deal. The location was great.", "title": "Beautiful hotel with rude service", "helpfulness": 5, "user": "kamaa222", "date": "August 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 3813073}, {"rating": 4.0, "title": "Royal Sonesta is wonderful; New Orleans is not", "text": "Only negative was a safe that wasn't working when we arrived, but we called the front desk and someone arrived quickly to fix it.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 21, 2005", "id": 3795294}, {"rating": 5.0, "title": "Excellent! Excellent! Excellent!", "text": "We recently went to New Orleans for a convention and were assigned to the Royal Sonesta at 300 Bourbon St. Upon arrival we went directly to the underground parking where we were met with wonderful people. All of the staff were dressed in wonderful uniforms, and they were very kind. From the moment they unpacked our car and parked it, until they repacked it for us a week later, they did everything possible to make us feel like we were at home. Our room was very nice, it had french doors leading out to the courtyard and pool. The room included mini-bar and a safe. We had two small children with us and the hotel supplied us (at no extra cost) with a refrigerator for their milk. The atmosphere was one of elegance and charm. I intend to return to New Orleans as soon as possible and will ONLY stay at the Royal Sonesta.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 20, 2005", "id": 3791665}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 48, "average": 149, "very good": 520, "terrible": 45, "excellent": 1008}, "aka": "Sonesta Hotel New Orleans", "slim_ranking": 0.0738255033557, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Royal Sonesta Hotel is an Authentic New Orleans Experience located in the heart of the French Quarter on world famous Bourbon Street, within steps of world-famous restaurants, antique shops, and premier tourist attractions. A landmark in New Orleans since 1969, its atmosphere reflects a strong European influence and Southern charm, with its elegant marbled lobby, tranquil fountains and sparkling chandeliers. The 500-room hotel features a secluded tropical courtyard, a beautifully landscaped outdoor pool, fitness center and five unique restaurants and lounges."}