{"user_rating": 4.0, "review_count": 102, "name": "Royal Goat Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Have just returned from spending Easter at The Royal Goat. Stopped in room 39 which was spacious, spotlessly clean, beautifully decorated and had amazing views to the front and side of the hotel as well as a large and very comfy bed. Two portable radiators had been left in the room which was much appreciated during a very cold Easter break. It was a nice touch that when we checked in someone had rushed up to the room to put the radiators on and also switch the bedside lamps on which made it so welcoming. We ate in the Grill Bar every night and the food was amazing, some unusual dishes as well as basic food, certainly a choice to keep everyone happy. Portions were large and food was served piping hot. The food was again excellent at breakfast, fresh and a good choice. There is a car park opposite the hotel, however, it can be difficult to find a parking space during the day as non-residents can park there as well. We found each member of staff to be friendly and extremely efficient. The location is ideal, about 7 miles from Porthmadog which is well worth a visit and of course Portmerien.", "title": "Fantastic Hotel in Fabulous Location", "user": "Cakesy", "date": "March 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14570738, "likes": {"liked": "— Spacious, clean bedroom, friendly staff", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We have just returned after our Easter weekend away, we booked into the Royal Goat Hotel as we thought it would be an excellent base to discover the lovely village of Beddgelert and to do some walking. We were shown the room (10) and at first glance it looked clean and tidy, and at the time we thought we were getting a really good deal. We unpacked and wanted to freshen up after our journey, the shower took a long time to warm up, at least 5 minutes, which was one of many disappointments. Once we had our shower we went out to make the most of the gorgeous day, when we returned we were exhausted and went straight to bed, the room was really cold, luckily there was a portable radiator in the room so we switched it on. We lay in bed, thats when I noticed the cobwebs on the ceiling in every corner this room had obviously not been cleaned to a standard I would expect for a 3 *** hotel. The following morning at 7.30 we were woken by somebody vacumming the staircase, this wasn't the wake up call we expected at all!!! We went to breakfast which was nice, although the fried eggs were hard and hadn't been cooked to order. When we checked out we told the Manager our concerns, he never made any comment in fact he was very ignorant, I wouldn't recomment this hotel to any of our friends and won't be going back.", "title": "Very disappointing", "helpfulness": 3, "user": "kennies", "date": "March 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 14492079, "likes": {"liked": "— The location", "disliked": "— The cleanliness and service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Stayed at the Royal Goat for a hiking holiday. Good standard of accommodation, minimal single supplement a bonus. Great food: hearty and delicious dinners, perfect after a day in the mountains. Comfortable lounge/bar for telling tall tales of the day's adventures. Top class service and warm welcome from genuinely friendly and attentive staff. First choice for a return visit to Beddgelert, which itself is a picturesque village in the perfect location for a visit to Snowdonia.", "title": "Great food, excellent service, friendly staff - highly recommended", "user": "Raven68", "date": "May 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7700978}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My wife and I stayed at the Royal Goat earlier this month as I had promised to show her the hotel following an earlier visit with my Hiking friends in July. Terrific hospitality, the two owners are completely focussed on delivering a good service to visitors. Excellent and interesting dinner selection including daily specials on the blackboard and a good choice of rooms to dine in. Very nice lounge bar and there are tables outside when the weather is warm to enjoy bar snacks. Breakfasts are hearty and well served. Bedrooms are acceptable and typical of this part of Wales, go for ones at the front to get the views.", "title": "Welsh haven in lovely Snowdonia", "helpfulness": 1, "user": "AndrewCov", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5825274, "likes": {"liked": "— Service and food", "disliked": "— Bedroom"}}, {"rating": 4.0, "title": "Very Good", "text": "All round a lovely base for a long week-end in the mountains of Snowdonia.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 22, 2006", "id": 5189297}, {"rating": 4.0, "title": "Haven for hikers.", "text": "The staff of this hotel were extremely welcoming.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4728767}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 6, "average": 26, "very good": 45, "terrible": 2, "excellent": 23}, "aka": "Royal Goat Hotel Beddgelert, Wales", "slim_ranking": 1.0}