{"user_rating": 5.0, "review_count": 120, "name": "Royal Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I stayed two nights at the Royal Apartments. The rate was 580 Kn a night for a large apartment with 2 queen beds, kitchenette and nice bathroom. The location was fabulous, a very very short walk from the gates to the Old Town, and next door to a bar, internet access point and bakery. My hosts were extremely friendly and warm. While the husband didn't speak much English, it was more than adequate to show me the features of the room and point out key locations to visit. His wife did my laundry, a large load, for just 10 euros! Overall, a fantastic place with very nice people for a great price. I would definitely stay again.", "title": "Perfect!", "helpfulness": 1, "user": "NewarkDETraveler", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69521472}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "We just returned from 2 wonderful nights in Korcula. Royal apartments was great, Marco was so helpful and the location could not have been better.", "title": "We just returned from 2 wonderful nights...", "user": "mkdlovestotravel", "date": "May 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 65917692}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Just returned from our 30th anniversary and the Royal Apts was an excellent choice. Our 1st floor suite (1 up from street level) overlooked the main square, queen & single bed, large closet, quiet shuttered windows, great kitchenette. Marko was there to meet us & showed us to our suite...limited English but a very nice man. As stated by others, Korcula is quite small & it was nice to be able to run back to the room whenever we wanted. We went to the market & had a nice evening dinner overlooking the main square watching the people.", "title": "Great location, everything you need!", "helpfulness": 1, "user": "Can_Hardly_Wait!", "date": "October 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45619810}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Would definitely stay here again & recommend it to others.", "title": "Lovely hosts and excellent location", "helpfulness": 1, "user": "SullaFelix", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43930938}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Annamaria and Marko met us off the ferry from Split and were very welcoming and kind. The apartment is less then 5 minutes walk from the ferry port and right outside the walls of the old town. We had apartment 3A on the third floor which was clean and tidy. Only comment would be that there were two double beds in the bedroom which was separated from the dining room/kitchen by a glazed set of double doors so the apartment is only suitable for one couple (or two very, very friendly couples...). There was no sitting room in the apartment and no lift in the building. That said it was perfect for a three night stay and good value for money and we would definitely stay there again.", "title": "Great location, good price", "user": "katyp12", "date": "September 19, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 42831058}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "These apartments are comfortable, clean and in a great location. The pick of the apartments are the front ones facing the harbour. Anna Maria and Marko are charming and helpful. We did not have a toaster in the apartment and asked Anna Maria if there was one we could use. Within a short time Anna Maria had returned with a new toaster for us. The apartments have each have a small but functional kitchen. As we were there in early April the town was very quiet. This meant no crowds but also meant that many cafes, restaurants and shops were closed and the town lacked a bit of atmosphere. Still it is a beautiful place and well worth a visit. The only (slight) negative about the apartments is that the staircase is noisy when walked on. Our group used 3 rooms and there were no other occupants at the time so not really an issue for us but could be a bit of disturbance at night if fully occupied. However there was no street noise and the apartment is not a backpacker style place so this is a very minor thing and does not detract from the overall appeal of staying here.", "title": "Lovely apartments in great location", "user": "Chook14", "date": "April 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 105743500}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed two nights at the Royal Apartments and were quite pleased with our accommodations. Our room faced the harbor with sweet little views, the windows closed well to keep out the morning noise, and it was clean as can be. For simple, well-priced accommodations with a can't-beat location, stay here!", "title": "Good find", "user": "wyleebeach", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84802996}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We arrived in Korcula about 8pm and Marko (one of the hosts) was in the harbor to greet us. He doesn't speak much English but that didn't bother us at all during our trip: whenever we needed help or advice, we'd get it. The walk to the apartments took about 3 minutes (if that). We were a bit worried because right next to the apartments there's a backpackers' hotel but once you closed the shutters and windows for the night (there's an effective AC in the room), we couldn't hear a thing.", "title": "Comfortable little gem in Korcula Town", "helpfulness": 1, "user": "TravellingDuck", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82810315}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The decor is dated but everything was spotlessly clean. There's a fridge and stove if you wish to make your own meals (right next to the front door there's a Kozum minimarket). No Internet connection which was a bit of a minus but the town itself is so beautiful that you won't be needing one, at least on a shorter stay.", "title": "Perfect location", "user": "PeepsDurham", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81795944}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Do go to Adio Mare for a meal. Our guide books listed it as an expensive restaurant but even with our limited student budget we could afford a tasty meal there. It was the best we had during our stay in Southern Croatia.", "title": "Excellent location and comfort", "user": "tradeform", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79459663}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Excellent location to explore the beautiful old peninsula of Korcula. Room had great views over the old town and also over the sea, very clean and good facilities (could have done with wifi!) very friendly and helpful owners.", "title": "Excellent location to explore the...", "user": "Ringtailmonkey", "date": "September 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 78298981}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Korcula’s Royal Apartments is a true find, a perfectly situated and nicely furnished accommodation that is well worth seeking out.", "title": "Your Search for a First-Rate Accommodation has Ended", "helpfulness": 2, "user": "claremay", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 75161300}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Royal Apartments is managed by a delightful and very helpful couple, Anna Maria (speaks fluent English) and Marko. Together they work hard to meet the holidaymaker’s every need. On the author’s recent visit, he absent-mindedly lost a set of keys while swimming in the nearby Adriatic. The managers of Royal Apartments couldn’t have been more understanding, allowing the author to rest easily and forget the entire affair. Kudos to Anna Maria and Marko for their forgiveness and support.", "title": "Great location in wonderful Korcula!", "user": "barrymanilow", "date": "August 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74054385}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "As noted, Royal Apartments is perfectly situated for explorations of lovely Korcula, directly across from the waterfront and a few short minutes’ walk to the ferry, fine restaurants, and sightseeing. The hotel is adjacent to a rather noisy hostel, but there is no need to fret as the accommodation has a fine A.C. unit (much needed in August) and the hostel, therefore, becomes a non-factor with the windows closed. Royal Apartments is also nicely situated next to a small grocery store and a bakery.", "title": "Great stay in Korcula", "user": "BETH V", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72753516}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Given the accommodation is a series of apartments, the author and his wife were treated to a large bedroom (two double beds), an ample and modern bath, and, perhaps best of all, a dining room/kitchenette, complete with sink, small stove, a terrific fridge, and many handy utensils. (this is where the adjacent grocery store plays a key role). A coffee maker would have been an added plus, but the traveler is able to make hot water for instant joe. Considering all these domestic features, Royal Apartments makes for some very pleasant lodging while in Korcula.", "title": "Excellent location - perfectly adequate room at a great price", "helpfulness": 1, "user": "nick_devlin", "date": "July 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70910854}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Four of us were looking for a two bedroom apartment but ended up \"settling\" for two one bedroom apartments in this gorgeous complex. The owner met us at the ferry and walked our cases to the apartment for us. It was only about a five minute walk. Perfectly situated near the ferry, restaurants and local attractions. Try and get one with views of the harbour like we did. The windows must be double glazed as once they are shut you can't hear a thing. You won't be disappointed. The owner lives on site and was just lovely. Would highly recommend these apartments.", "title": "We loved it", "helpfulness": 1, "user": "Kathy C", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115307663}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed our first night in Hotel Korcula...not the best choice.", "title": "Great place to stay", "helpfulness": 1, "user": "art060", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114365408}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We met Zvonko quite by accident and I am glad we did.", "title": "Perfect if not for the scent on the sheets and towels", "user": "detraveler_7", "date": "June 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 112874961}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is the best place to stay, clean, central, friendly...don't need to say anymore.", "title": "Great Place to Stay", "user": "kbushnell", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112096540}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The best value found in my entire trip to Croatia and the Islands.", "title": "Royal treatment at the Royal Apartments", "user": "Marlisse", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109328697}], "location": {"country": "Croatia", "region": "Dalmatia", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 16, "terrible": 0, "excellent": 104}, "aka": "Royal Apartments Hotel", "slim_ranking": 0.0555555555556, "description": "Situated one minute walking distance from the heart of the old town of KORCULA, Royal Apartments offers you luxerious accomodations and a feeling of serenity.Royal Apartments offers you a spectacular sea view and an old town view. The outside of the apartment building retains traditional architecture, while the interior has been redesigned with all moder facilities. We offer 5 -one bedroom apartments which accomodate 2,3 and up to 4 persons. Each apartment has fully equipped kitchen with a dining area, bathroom and shower, air conditioning, tv and free wi-fi. Located 50 metres from the beach, its prime location gies our guest the convenience of surroundings close by. ( banksm shops, bakery, supermarkets, local cafe's ferry/catamaran drop off/pick -connections to Split, Hvar and Dubrovnik.)In addition, Royal Apartments has its own Smart Car available for rent exclusively for our guests.If you wish to relax and feel at home, Royal Apartments will do just that!"}