{"user_rating": 4.0, "review_count": 281, "name": "Royce Hotel", "reviews": [{"rating": 4.0, "title": "Lovely short stay", "text": "We recently stayed at the Royce Hotel for one night for a quick weekend getaway.", "user": "Newhinson", "date": "December 8, 2011", "id": 121506852}, {"rating": 5.0, "title": "beautiful vintage hotel close to cbd", "text": "I was a little hesitant as the reviews hadn't all been great, however, I was pleasantly surprised.", "user": "rebecca f", "date": "November 30, 2011", "id": 121265929}, {"rating": 5.0, "title": "Excellent hotel -will return", "text": "We were greeted warmly at reception, and checked-in with minimum fuss.", "user": "Sija56", "date": "November 28, 2011", "id": 121170171}, {"rating": 2.0, "title": "(No) service without a smile, dated hotel", "text": "Our room was well-appointed with nice furnishings and decor, and was very clean. It was only small, but had everything we required. Bed was really comfortable.", "user": "cazzburgler", "date": "November 25, 2011", "id": 121025108}, {"rating": 3.0, "title": "Real potential falls short", "text": "We had a room on the 4th floor which faced over some dirty old buildings, which wasn't very attractive, however, being at the rear of the hotel meant that we had a great night's sleep, as room was very quiet and dark. I was a little concerned about late-night noise (as I'd read in previous reviews) as there was a wedding being held in the hotel on the Saturday night, however, we needn't have worried, as we did not hear any noise coming from it.", "user": "SGull12", "date": "November 20, 2011", "id": 120810487}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I liked pretty much everything about our weekend away at the Royce. The highlights were:- big comfy modern room, good bathroom, big quality buffet breakfast which was available until noon on Sunday - bonus! Easy access to trams on St. Kilda rd. and only about 10 mins to the main city district. Another great thing was our room was at the back of the building and didn't face the road so it was nice and peaceful. The staff were lovely but we didn't need them much as everything went smoothly. Big thumbs up and glad to have finally stayed here. If I had one negative to point out it would be that the common areas/lobby etc could do with a spring clean. Will be returning if the prices stay competitive.", "title": "Perfect for a taste of Melbourne", "user": "CiaraB", "date": "March 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125480867}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "I have stayed in this hotel with my husband many times for many reasons. The hotel is always neat & tidy with great sized rooms. The full selection breakfast the next morning after a big Melbourne night out is fantastic!! The location is perfect, only a couple of stops on the tram to the city or if you have a car it seems to be just a few minutes anywhere, plus the staff will happily call you a cab which is out the front in seconds!! We love this hotel for great value and location.", "title": "Little Melbourne Star...", "user": "Yallingupkk", "date": "February 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 125103412}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Only ever stayed in the Royal Suite for our anniversary... 4 post bed - gorgeous view and big room... yummy room service and attentive staff.", "title": "Romantic!", "helpfulness": 1, "user": "princessivai", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 124457266}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We spent 2 nights at the Royce, January 25 and 26, 2012.", "title": "Well worth it!", "helpfulness": 1, "user": "Lori G", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124451417}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "If you like a boutique hotel - this one is for you. The room was very stylish and immaculately clean. Although located a bit outside the CBD, we found this a plus. (We walked to the Laver Arena for the Australian Open.) The hotel bar has a nice happy hour crowd if a day-end or pre-dinner drink is on your schedule.", "title": "Disappointing", "user": "jodiedella", "date": "February 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 124325799}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Watching the trams rattle past on a warm summer night while sipping a complimentary G&T in the bar - what more could you want? Capable staff who dealt with some appalling customers calmly and professionally, a fresh room, a great summer deal - complimentary wine and breakfast and a brisk walking distance to the city for a shopping spree and Art Gallery visit.. A great overnight break.", "title": "Melbourne Summer", "user": "RosieEG", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123348102}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The reviews of this hotel aren't great but that's because it's listed as a 5 star hotel. You have to understand that 5 star just means ticking all the boxes. You're not going to get 5 star room service or a tuxedo wearing valet here. You can get a very appealing room at a very decent price.", "title": "A great hotel if you're wanting 5 star comforts without 5 star service, great bathrooms", "user": "Ourpoeticprince", "date": "January 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 122960777}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The rooms are spacious, the front desk courteous, the bathrooms fantastic.", "title": "Perfect location & hotel", "user": "FebruaryWeather?", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122902863}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stay in an executive room. They are the best (I have stayed in all, including the suites).", "title": "Disapointing", "user": "KK6192", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 122436275}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed here for work for 1 night in January. Perfect location and hotel was great. Wonderful service, great room with large comfy king size bed, flat screen tv mounted on wall, bar fridge, room service, nice bathroom with good shower, ipod dock next to bed, great buffet breakfast and the staff couldnt have been more helpful. Would stay again without a doubt as this was cheap for what you got.", "title": "Nice night away", "user": "Tantaylor", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 122384891}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Spent only one night but was quite pleased with accommodations. Free drink on arrival, friendly staff, comfy bed, clean, spacious, etc. Price was reasonable considering it is Melbourne. Convenient to catch tram for Flinders St. Station.", "title": "Great place to stay...", "user": "Alice_112743", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124232296}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Stayed for one night, and one night was enough! Most uncomfortable bed ever slept on! Could hear traffic and trams, not sound proof at all. Bathroom wasn't clean. Breakfast was cold and not exciting. Staff were friendly and attentive.", "title": "Shocking beds", "user": "Aussiej36", "date": "February 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 124098348}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My partner & I recently stayed 2nts. Wine & choccies on arrival - yum! Lovely rooms, comfy king size bed, great bathroom. Our room overlooked the Grammer School & was very quiet. Very quick & easy tram ride to Flinders St station. Overall a very nice, friendly boutique hotel, would recommend to anyone, and will stay there again when we next visit Melbourne.", "title": "Great hotel,great location", "user": "JoW67", "date": "February 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124095986}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Just stayed one night. I like the Royce as it is next to the botanical gardens and makes it easy to go for a morning walk. The hotel is clean and crisp with comfy bed.", "title": "Nice hotel for a quick business trip", "user": "SydneyTravelbug88", "date": "February 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 124042115}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed here for a week during the Australian Open earlier this month. Would love to return to this quirky, lovely hotel. If you like big chain, corporate, shiny twinkly hotels, where a flunky in a top hat and tails opens the doors, and a guy in a cute little uniform takes your cases to the room then this probably isn't the place for you. If you're a bit more independently minded, can carry your own cases, thank you, enjoy great breakfasts where you can fetch your own tea and coffee when you want it,( and not have to wait around for some overworked and underpaid waiting staff to serve you) love traditional style and the idea of staying in an ex-Rolls Royce showroom then you may be interested. The huge bedroom suite, fabulous bathroom, with shower and bath, super position (near trams, but we walked back and forth to the Rod Laver Arena) may seal the deal. Also enjoyed the Amberoom, good food, great prices and a memorable meat pie. We'll be back, if possible, in two years - please don't change!", "title": "Quirky, lovely hotel", "user": "anniegee50", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123783445}], "location": {}, "stars": 5, "variance": {"poor": 29, "average": 25, "very good": 93, "terrible": 25, "excellent": 109}, "aka": "Royce Hotel Melbourne", "slim_ranking": 0.219101123596, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}