{"user_rating": 4.5, "review_count": 82, "name": "Rudesheimer Hof", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Modern interior in the rooms however the streets are rather noisy with the early morning traffic heading to the ferry. Has parking and is walking distance to the town center and restaurant alleyways.", "title": "Modern interior noisy street", "user": "MayaSweden", "date": "September 12, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118022077}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed at the Rudesheimer Hof for 4 nights. Our spacious room was lovely, with a nice little balcony that was surrounded by pink geraniums. The beds were comfortable, together with the lovely plump pillows. The room was quite large by European standards, with space for 2 chairs and a table. The highlight for us was the really large and sunny en suite/bathroom. The hotel is well situated, one street back from the main street. Although Rudesheim has regular trains travelling through the town, we could hear nothing from our room. Our hosts, Sussi and Wilhelm, couldn't have been more helpful and knowledgeable with tour advice and local history. On our last morning a taxi had been arranged to get us to the station but when it didn't turn up and time was ticking, Wilhelm loaded us and our luggage into his car and made sure we didn't miss the train. Oh, and did I mention the breakfast. Heaps of choice, lovely friendly staff and delicious coffee. We loved the beautiful town of Rudesheim. It was the highlight of our 4 weeks of European travel. The hotel is an easy stroll to absolutely everything and is exceptional value. Don't miss it !", "title": "A real gem", "helpfulness": 3, "user": "Kiwi_Classics", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117205593}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We booked this stay based on recommendations we read on line. We were not disappointed. While we originally wanted to stay next to the river, other reviews stated that being next to the river is also next to all the trains that go by all night.", "title": "Weloved this hotel & staff", "helpfulness": 3, "user": "waynewal", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115953269}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is several blocks from the trains so noise is minimal at night even with the windows open. The hotel is charming, wonderful traditional decor and nice rooms. We have a room for 3, very clean and wonderful decor. Very spacious for Germany, especially for a resort area. Restaurant is traditionally decorated, quaint but new and very clean. Breakfast buffet was great; eggs, bacon crumbles, large selection of meats, breads, fruit, yogurt and various fruits for the yogurt. We highly recommend this hotel!", "title": "The best hotel while we were in Europe", "helpfulness": 2, "user": "Suzy_Florida08", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115801540}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We do not have young children and did not use any spa area so did not rate those.", "title": "Cozy, quaint, and great quality for the $", "user": "jrtgirlqc", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115628935}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "I stayed here with eight friends for four nights in late April 2009 and was delighted with the service and food. The owners are very involved in the daily operation of the hotel which has been in the family since the late 1700's. The hotel has an excellent chef and we loved the white asparagus soup, a seasonal offering on the menu. Great care is taken with the service, table linens and fresh flowers. The hoteliers assist in the training of enthusiastic young people and we especially enjoyed Florian and Dustin Hoffman (yes, that is truly his name).", "title": "Congenial staff, hospitality and graciousness grow on you", "user": "PSAtlanta", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 29435351}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The town is busy with many boats, trains and cars, but the hotel does a good job of maintaining a sense of peace amongst the busy local scene. From visiting other rooms, I found some of them renovated and updated and others a bit tired. You can request a recently renovated room. There are some with balconies but the busy streets throughout the town make sitting inside more attractive. There is also free parking available behind the hotel and an outdoor beer garden with fountain.", "title": "Great staff, great food!", "user": "madfish8", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21417626, "likes": {"liked": "— Personal service from the owners and a great team of staff.", "disliked": "— going back to my city centre hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "The owners offer invaluable assistance with special requests and touring information. The longer we stayed here, the more we enjoyed it. Hospitality is the greatest asset of the hotel and I would return.", "title": "Great spot, great value", "helpfulness": 2, "user": "Mike_JB", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21031397}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Stayed here every weekend for 4 weeks in September. The Heymach Family and their team run a brilliant small hotel just oozing with cozyness, which after staying in a large city centre hotel for my company was such a refreshing change. Nicely furnished rooms, very traditional but they look recently refurbished with en-suite shower/wc. Very unusual to get such personal attention; you can find the owners either in the kitchen or in the restaurant every day, never too much trouble for them to organize some trips for you and also to recommend some restaurants in the area to try---but you don't need to do that, they have a great restaurant on-site with some delicious food not normally found in this part of a meat-eaters paradise, like Thai spring rolls or swiss pasta filled with spinach and ricotta, plus a very good winelist with some well-known German winemakers at every reasonable prices. I sat in their covered outdoor terrace with a superb bottle of dry Riesling which went very well with my pasta and a superb, crisp fresh salad with a stunning dressing. Very well situated in the centre of town close to the park, sports facilities and the boat landing stage for trips down the rhine. Highly recommended and if you have a problem whilst you stay there just ask the owner Wilhelm Heymach to come out of the kitchen, sit down, open a bottle of wine, give him a glass and then all your problem's will be solved!", "title": "Great Friendly Helpful & Atmospheric", "user": "CheffyCowdy", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18923559, "likes": {"liked": "— Cleanliness", "disliked": "— No BBC news 24"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "I just stayed at the Rudesheimer Hof for the weekend. Herr and Frau Heymach run a cozy, clean inn that's also in a great location. I booked with halfboard, the breakfast buffet and the dinners were quite good. The service was excellent, and I was given very friendly treatment, and I don't speak German. Rudesheimer Hof is in a great location in the center of town, and very convenient to the Rhineland wineries. Parking is a little tight, but I was able to manage. Definitely would recommend.", "title": "Comfortable elegance", "helpfulness": 2, "user": "cornerman", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11874372, "likes": {"liked": "— The cleanliness and the food were terrific!", "disliked": "— Nothing. I liked everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Good to very good. 5 minute walk to the sites to visit. On a somewhat busy street but windows and A/C blocked out all noise. Good breakfast. Free parking across the street. Rooms were good but nothing special", "title": "Very Good", "user": "JCB01", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 73256623}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We returned to Rudesheim where we stayed in our fifth hotel in the town. I have to say that the Rudesheimer Hof is by far the best hotel in Rudesheim. It was clean, comfortable, friendly, the rooms were spacious, the bathroom was easyily the best we have experienced in Rudesheim and the towels were vastly superior to what you normally get in Germany. Rudesheim is a great place for a relaxing time, although with the superb display of the Rhine in Flames it was busy on the weekend. The only noise was the night they beat Argentina when car horns were sounding until midnight. The night before we left they lost to Spain and it was areally quiet night. TRY THIS HOTEL. It will be well worth it.", "title": "This hotel was absolutely faultless", "helpfulness": 3, "user": "tsirout", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70362942}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We flew into Frankfurt at 6 AM and headed for the hotel, about 45 minutes from airport. They took our luggage while we headed for the 9 AM boat to tour the castles on the Rhein. This turned out to be a great idea, being outside all day as we were tired from the flight (landing at midnight EST). My suggestion, you go to Boppard for lunch, back to St. Goar to visit the Reinfels Castle and take the train to Bingen Sud (2nd station) to get", "title": "NIce location, Friendly owners, good location", "helpfulness": 4, "user": "Rickpsu", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48508669}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "the ferry accros to Rudesheim. Should be back by 5.", "title": "Charm, no noise from trains, excellent room & customer service", "helpfulness": 7, "user": "SuzieeQQ", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39972264}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The owners were very nice, The restaurant is as good as any in town. There are airconditioned rooms, which you need to ask for when you check in. Stay away with rooms on the main street, can be very loud early in the morning. They switched our room with no hassle. Would stay there again. The trip up the gondola with th circle ticket was a lot of fun..", "title": "Great service, great food in family-run hotel", "helpfulness": 1, "user": "dipl0matic0", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 34943605}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed in nine hotels during our 3 week vacation, and rate this hotel #1 from an accommodation perspective due to their comfortable beds, and most helpful and courteous owner. This was my sixth trip to Europe and my party consisted of my wife, 70 Yr old sister and myself. We rented a car and enjoyed exploring Germany, France, Switzerland and Austria. We stayed at the Rudesheimer Hof the nights of 2 and 3 June 2011, and the owner/manager was very accommodating and helpful regarding where to go, what to see and what to do. We greatly enjoyed their breakfast buffet: Coffee and hot chocolate, scrambled eggs, and large selection of deli meats, cheeses, juices, bread, rolls and delicious preserves! In our opinion, we rate this hotel and the owner as being one of the best experiences of our vacation. Hotel is in a great - quiet location, limited free on-site parking, and across the street is a very convenient drug store (they had great prices on bottled water and snacks), and also across the street was a very friendly bank (Rheingauer Volksbank eG, 65366 Geisenheim Street) that gave us the absolute best exchange rate that we experienced during the entire trip (I used their ATM to get 500 Euro and they charged me only 5 Euro total fee (they charge a 2% fee up to a maximum fee of no more than 5 Euro)! I purposely viewed some of the other hotels highlighted on Trip Advisor (one with a higher rating and higher costs) but personally preferred the Rudesheimer Hof to all others that I personally saw. The hotel offered us room 306 for my party of three, which was on the top floor (reachable by elevator) and had two single beds in one room, 1 single bed in an adjacent small room, and cold air conditioning! We had a nice bathroom with private toilet/shower and satisfactory TV with a variety of channels. I had a great visit here and would not hesitate to choose this hotel for a future stay! Dining: We only had breakfast at this hotel which was great, however I have comments regarding a couple of other restaurants located on Rudesheim’s famous Drosselgasse Street: #1) On the first evening we had a relatively expensive meal (approx 20 Euro or $30 US each, excluding drinks) for simple Bratwurst that was severely overcooked, Sauerkraut and Fries (Ref attached photos). This restaurant was in a lovely outdoor “wine” restaurant setting with a Bavarian band. I will attribute the overcooked meals to the fact they were very busy, however for the price paid, and considering the restaurant’s reputation, they should not never have served those overcooked Bratwurst. Our choices were to either send them back (but it took forever to finally get them), walk out (but we would still be hungry) or eat the meal (which we regretfully did). #2) The second night, on the same Drosselgasse Street, we had a delightfully delicious and very inexpensive meal (under 7 Euro for bigger and better Bratwurst, Sauerkraut and Fries) in a little “step in” fast food type café that only had two inside tables (each would seat four guests on four stools) and a service counter with another three or four stools. From the main street this Café will be on your right side as you walk up Drosselgasse Street. There was a local family eating there so that should have been a clue that this was a going to be a great meal. #3) Highly recommend the Villa Weil Ice Cream shop on the main street in Rudesheim. Per my wife who is an ice cream connoisseur, they had the best ice cream of our entire trip! For a total of 8.40 Euros (excluding tip) we enjoyed two dishes of ice cream with toppings and one specialty Spaghetti ice cream plate. In closing regarding restaurants: Typically we have found on our journeys that the very best meals are generally found in the smaller establishments rather than the highly rated and overpriced “tourist type” restaurants.", "title": "Great Hotel, Owner/Manager and Breakfast", "user": "DoDWorldTraveler", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115367316}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "the hotel is quite good, quite basic rooms. we have taken a room with a balcony which was very small and no view. but the restaurant is great, the spargels were delicious", "title": "nothing to write home about but excelant restaurant", "user": "litanir", "date": "June 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 113955345}, {"rating": 5.0, "title": "Great start to a great holiday", "text": "We had a family room which was very clean and roomy enough for 4 adults. Dinner and breakfast as plentiful, fresh and tasty", "helpfulness": 1, "user": "cazzalago", "date": "June 5, 2011", "id": 111527989}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "In a town that caters mostly to tourists this hotel was a true gem and we feel very fortunate to have discovered it. The room and bathroom were very spacious and offered all of the amenities that one would expect. This alone would set it apart from most European hotels, but then you have the owners, Sissi and Wilhelm Heymach along with their family that make this hotel the best in class in any competition. They made sure that we did not want for anything. Their hospitality was only exceeded by the finest food we had in Germany. Wilhelm is the chef and I assure you that his expertise is rivaled by none. Be sure to have a veal dish, there is none better in all of Europe!", "title": "A jewel in Rudesheim", "helpfulness": 2, "user": "rvb10", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111316482}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I cannot say enough good about this fantastic hotel, the owners and the staff! We arrived very late (23:00) and the Hotel Rudesheimer Hof was closed. We thought we were going to have to sleep in the car when my wife noticed a man waving his arms from a window above the parking lot. I recognized him as Wilhelm, the owner. Although we had never met, he knew me by name and had left a key at the front desk for us. Mind you, we never gave credit card info for a deposit. His daughter let us in and showed us to the room they reserved for us on solely a \"handshake\"! Wilhelm saved us from a miserable night, but the great service did not stop there! Sissi, his lovely wife, held the massive breakfast bar open for us past the 10:00 am shut down so we could sleep in after a long day. Then, at dinner, my older son wanted to try \"Blood Sausage\". The wonderful waitress (who spoke pretty good English) discouraged it but brought my son into the kitchen and had the chef prepare a \"mini portion\" of Blood Sausage for my son to try. She didn't have to do that and most wait people would just have let him order it and not even let him try, let alone bring him into the kitchen! Everyone, and I mean everyone, was so kind and helpful there! As for the hotel, Beautiful! Quiet, rustic and traditional. Close to everything Rudesheim, Germany has to offer as well as castles along the Rhine River. If you are driving here, follow the directions on their web site. They are perfect. Just watch out for the one-way street. I made a mistake one time and got, justifiably, a couple of beeps! The included breakfasts are awesome, the dining room is breathtaking and the outdoor dining is comfortable and quaint! We did have dinner there (no, my son did not get the blood sausage but said it was OK) and the meals that each of us had were very delicious! I had a glass of traditional rose wine from the Rhine Valley and, although I am not a wine expert, it was fantastic! All this service and all the friendliness and all the cleanliness and all of the great food were at an extremely fair, if not cheap, price! Wilhelm and Sissi should teach hotel and restaurant owners across the world how to run one to perfection! Would I recommend this hotel? Let's just say, the Hotel Rudesheimer Hof is the best! Why go anywhere else?", "title": "AMAZING! The BEST service! Like visiting family!", "helpfulness": 1, "user": "EagleOfArgyle", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75203561}], "location": {"country": "Germany", "continent": "Europe", "city": "Ruedesheim am Rhein"}, "variance": {"poor": 1, "average": 10, "very good": 33, "terrible": 1, "excellent": 37}, "aka": "Rudesheimer Hof Hotel Ruedesheim Am Rhein", "slim_ranking": 0.0666666666667}