{"user_rating": 4.0, "review_count": 543, "name": "Rundlestone Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Stayed 3 days at the Rundlestone. Accomodation was very clean & staff were friendly.The dining room had average meals, nothing flash for the price, but very comparable to everything else in Banff.Good value accomodation, a pleasant 15 minute walk to the centre of town.Internet was slow & pricey.", "title": "Cosy", "user": "OutbackAussie", "date": "June 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 17008868, "likes": {"liked": "— The price & view", "disliked": "— slow & pricey internet"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We were looking for a nice place to stay in Banff at a moderate price, and the Rundlestone totally filled our expectations. Our rooms were nice, beds comfortable, the rooms cleaned every day and the front desk people were very nice. As an added bonus, the other people staying at the Rundestone were very friendly and would often strike up conversations with us which I always appreciate. I would definitely stay here again. One caveat is I was attending a conference at the Fairmont Banff Springs, and the Rundlestone is on the other side of Banff, a good 10-15 minute walk to the main restaurant area of town. If I had not rented a car I would have ended up taking taxis everywhere around town which would have ended up being pricey.", "title": "Good for the price", "user": "Rasputin45", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 16931445, "likes": {"liked": "— price, cleanliness", "disliked": "— distance away from main drag"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "My husband and I stayed here with our ten year old son in May.", "title": "Nice Comfortable Hotel", "user": "meettheworld", "date": "June 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 16861182, "likes": {"liked": "— Nice large room, comfy beds, nice pool", "disliked": "— Room was a little dull, service in restaurant a little slow. And no wine!"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We found the hotel welcoming and quite cosy, especially in the evening, we would sit in the lounge and play cards and have a drink.", "title": "Loved the room but bad service", "user": "Viv31", "date": "June 3, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 16644292, "likes": {"liked": "— Room standard when it was attended", "disliked": "— Bar closed at 10 pm"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "The room was nice and spacious, with a small seating area. The only downside would be that it was maybe a little dull.", "title": "Very good for what we wanted but a few start of 'new season' hitches", "helpfulness": 2, "user": "dedicatedtraveller", "date": "May 27, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 16438519, "likes": {"liked": "— It was all fine nothing really stood out as best", "disliked": "— No kettle in room and coffee maker took an age to process coffee"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Perhaps not the most impressive from outside, but a great hotel overall.", "title": "Overall a very good hotel", "helpfulness": 1, "user": "Montalivet2", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12612498, "likes": {"liked": "— Location in National parks", "disliked": "— Leaving."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "It is situated on Banff Avenue and is a nice easy walk down into the town.", "title": "Great place", "helpfulness": 2, "user": "hotCanada", "date": "November 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10989875, "likes": {"liked": "— DVD player in room, location", "disliked": "— food"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "We stayed a couple of nights using it as a base for Banff/Colubia and Jasper National Parks and in that respect could not have been better.", "title": "Expensive for what you get", "helpfulness": 2, "user": "SheffieldFreddy", "date": "October 28, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 10391679, "likes": {"liked": "— Value for Money"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Extremely clean and great room and staff very very helpful, even when I rang reception at 4am, (how can they be so helpful at that time?), re our early start.", "title": "Nice Place!", "helpfulness": 3, "user": "sheppaje", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10329305}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "Great fire in the lounge making a great lodge atmosphere, while drinking.", "title": "Good Standard Hotel", "user": "GrizzlyBear55", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 10253984}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I booked this hotel based on the rating of being #7 out of so many hotels in Banff and being within my price range. After staying there, I am surprised that it rated as high as 7 as I have stayed in other places in Banff that I liked much better with lower ratings. We paid a few dollars more for a \"premium\" room and to be honest I was tempted to ask to see a standard room to find out what the difference was (aside from the cost). I would definitely not stay here again. Nothing was wrong (aside from chipped furniture and gum on the bedpost) but I was disappointed based on the rating. I just think I could do a lot better for the price. Also note that you are not allowed to wear your ski boots in the lobby or bring your snowboards or skis into the hotel. When coming back from your day of skiing you have to press a button to open the garage door and walk down the driveway into the car park and leave your gear there. They do have lockers you can store it in for a $10 deposit. This definitely took a few guests by surprise as they returned from their skiing.", "title": "Nothing great.", "user": "Tripping_Woman", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 14001019, "likes": {"liked": "— pool", "disliked": "— gum on bedpost"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I LOVED this hotel. We booked this hotel before they re-did their website so we weren't expecting it to be as nice as it was! We were greeted at the front desk by a very friendly, helpful man and a warm atmosphere with a fireplace and comfy leather couches. We stayed in the \"Premier Honeymoon Suite\" for one night and it was perfect! The room was the largest in the hotel (we saw the floor plan of the building) and it was amazing. It was loft style, so the downstairs had a full bathroom, complete kitchen with full-sized fridge, stove, sink, counter, cupboards etc, a dining room with a big table, large jacuzzi, 4-sided gas and wood fireplace, family room with couch and chair, tv with dvd player and an amazing, huge, wrap-around balcony!! Then the upstairs had a king bed, tv and bathroom with toilet and sink. Simply amazing. Even the little things pleased me, like the toiletries they provided - the lotion smelled SO good and they even provided a little pot of lip balm. The jacuzzi had really luxurious robes for us to use too. It was close to a lot of decent restaurants and the downtown part of Banff. The underground parking lot was heated, which was nice! I would definitely reccommend this hotel to anyone, and try to get this Honeymoon Suite! It's definitely worth the extra money!", "title": "One of the nicest hotels I've ever stayed at!", "helpfulness": 2, "user": "Sugar_Piggie_18", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 13508856, "likes": {"liked": "— The design/style of the room and everything in it"}}, {"rating": 5.0, "title": "Winter '08", "text": "Booked this hotel well in advance and couldnt fault it, although the Jacuzzi was far too hot and they werent afraid to run the hotel heating high either! Breakfasts were good, and it was only 30 seconds from the Caribou Lodge = first pick up on ski bus! Comfortable, fairly quiet, but only 5 mins taxi ride to downtown Banff. Good value. Would stay there again.", "user": "recklessabandon", "date": "February 12, 2008", "id": 13504871}, {"rating": 3.0, "title": "Average, no frills accommodation", "text": "Myself and my hubby stayed at Rundlestone for 10 nights at the end of Jan/beginning of Feb. I booked the hotel mainly because of price, it seemed really reasonable and by far the cheapest compared to others in the vicinity. The hotel was fine, I'm sure we could have done far worse. The decor is a little dated but there are a few hotels like this in Banff. It was clean enough, and quiet, in fact it was so quiet it seemed as though we were the only guests! We didn't eat in the restaurant as there were so many others to eat in, and we wanted some atmosphere.", "user": "M0le", "date": "February 11, 2008", "id": 13466760}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "One thing I would say is steer clear of the jacuzzi. Whilst its lovely to soak aching limbs after being on the slopes all day, the jacuzzi absolutely mings and left a terrible smell on your skin. One day I forgot to swill my Hubbys shorts out and when we came back to the room, the whole room spelt absolutely disgusting. I wouldn't even like to guess when the last time the water in the jacuzzi got changed/cleaned. Putting that aside the Rundlestone is fine if all you require is middle of the road, no frills accommodation.", "title": "Our Kids Loved It", "user": "DKO", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 12732629, "likes": {"liked": "— pool"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Westayed for 1 night and had an excellent time. We were two couples with a small baby, and found the staff helpful, the pool lots of fun and fine for baby. The property was clean and the staff were attentive.", "title": "We got upgraded! Loved it so much wante dto stay another night", "helpfulness": 1, "user": "egirl_glasgow", "date": "October 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10051900, "likes": {"liked": "— friendly staff", "disliked": "— couldn't book a second night"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The first room we were given had a problem with the bath, so we called the front desk who immediately sent around the maintenance guy, whom said it was probably a plumbing fault. Within minuted the front desk phoned and offered us a new upgraded room. They were so helpful about the whole thing, and our new room was bigger with a balcony, so no complaints from us.", "title": "Awesome stay", "user": "CourtOntario", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10014952}, {"rating": 5.0, "title": "awesome staff", "text": "Only problem is that we loved it so much we wanted to stay another night, but they were fully booked.", "user": "sarawilliams", "date": "September 18, 2007", "id": 8749049}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "We went to Banff for our honeymoon from sept 15-20 and had an awesome stay at the Rundlestone. We stayed in the Jacuzzi Suite which i highly recommend to anybody. It was very roomy with the bedroom upstairs and a nice little kitchenette and living room downstairs, fireplace and balcony. The staff was overall friendly and helpful. The underground parking was a plus. Very clean!!!! and i am very picky about these things so that was fabulous. I would recommend staying at this hotel.", "title": "decent hotel", "user": "AD_WDC", "date": "September 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8688657}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I liked this hotel a lot; the rooms were spotless and very comfortable, and the staff were very accommodating with getting us extras such as a crib and kettle in the room, at no extra cost. The front desk staff also helped us to find find directions, provide information on local \"hot spots\" and were always cheerful when approached (which we did quite a bit). The price is OK, especially compared with other jacuzzi rooms in Banff. Very good experience!", "title": "Pretty Good", "helpfulness": 1, "user": "Crackerjack1954", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 8505488, "likes": {"liked": "— Cleanliness and price", "disliked": "— no free breakfast"}}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 27, "average": 76, "very good": 234, "terrible": 12, "excellent": 194}, "aka": "Rundlestone Hotel Banff", "slim_ranking": 0.242424242424, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Conveniently located on Banff Avenue only minutes from Downtown Banff, The Rundlestone Lodge offers a host of amenities including complimentary wireless, a fitness centre, whirlpool, swimming pool, conference facilities, and Bumpers the Beef House Restaurant."}