{"user_rating": 4.0, "review_count": 578, "name": "Rushton Hall Hotel and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "I stayed at Rushton Hall on the 29th November for 7 nights. I had a little bit of a sticky start to my stay in that I don't think they were geared up to someone staying for seven nights on a discounted spa break. I really just don't understand the previous review as my experience was completely different. After explaining that the reduced menu only contained three of each course and that I was there for 7 nights. The staff in the restaurant swung into action. I was told I could order from any menu I so desired including the lunch menu and even if I fancied something else the chef would cook it for me. The food was exeptional, This was reiterated by other diner's comments. The service I received was unsurpassable by ALL members of staff I came in contact with including Reception. On the last weekend of my stay there were 2 weddings, One on the Saturday and the other on the Sunday. You wouldn't have known as the service in the restaurant was exceptional. All of the staff were so friendly in all parts of the hall. The spa treatments I received were superb and very professionally undertaken - best I have ever had and I am a lady 'who does spas'. The manager should only be proud of her staff as they are a very caring, friendly, professional team. Well done Rushton. L MCQ", "title": "SUPERB STAY AT RUSHTON HALL", "helpfulness": 3, "user": "Norfolkuk", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89987087}, {"rating": 2.0, "stay_parameters": "Stayed October 2010", "text": "This venue is what my Grandma would describe as 'fur coat and no knickers'.", "title": "Most disappointing, amateurs in the hospitality industry", "helpfulness": 1, "user": "chaos417", "date": "December 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 89147060}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The building looks impressive at first sight, but the organisation and service levels leave much to be desired.", "title": "Lovely place, especially if you like history", "user": "SnakeLondon", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 88857625}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The reception staff are confrontational, inconsistent and severely lacking in training for the hospitality industry. Service generally, in the Main Hall and the Restaurant was continually lacking and inept and the food quality would get 4 marks out of 10, at best, yet highly priced.", "title": "Bitterly disappointing - Avoid it", "helpfulness": 1, "user": "lemonade2010", "date": "October 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 85078207}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "These comments are made as the result of many visits for Dinner and 2 'Food Tastings' for a Wedding, where the content and texture of the food bore no relation to what was served at the actual Wedding Breakfast for 120 people. The Wedding(pavilion) staff and especially Matt were very accommodating and effective, it is a pity that this appears to be alien to the other hotel staff, generally.", "title": "Lovely retreat for a relaxing spa break", "user": "UKtripper100", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82426569}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Rushton Hall is in an idyllic rural setting with beautiful grounds. The Great Hall is full of charm and has an imposing presence. We were told that all the rooms were unique and that no two were the same. We upgraded to a stateroom which had a huge bathroom. Service was helpful and staff attentive. The spa and gym facilities were well equipped. We certainly would go back for another stay.", "title": "Lovely retreat", "user": "Dunedain", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99077883}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "gorgeous estate has lovely 5 star restaurant and spa. nice rooms and fantastic 'great hall' for longing, afternoon tea, bar, etc. beautiful grounds. although the restaurant tried to overcharge us by 150pounds (like we wouldn't notice?) the service and food was good.", "title": "great groupon deal avail - do it", "helpfulness": 1, "user": "tripfi", "date": "March 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 98666043}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "WIFI is via cable and not particularly fast, although you are in the middle of the countryside.", "title": "Not a place for families. Despite claiming to be suitable.", "helpfulness": 1, "user": "Doctorandmummy", "date": "March 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 98650627}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "If you are a couple this may be nice. But if you are onto the next stage and have kids- don't bother.", "title": "Gorgeous building, awfully disappointing bedroom", "helpfulness": 1, "user": "Quibell", "date": "February 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 98241455}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The swimming pool allows kids for one hour only, and it is when the afternoon tea is served. The kids can't dine in the dining room and are served high tea instead. At ONE set time. Not that it actually happens at that time. Be prepared to entertain your kids for 30-40 min. And hope they appreciate the drive for healthy cuisine: steamed spinach, new potatoes with peel and grilled fish without any sauce...most parents would argue it is optimistic for a 3 year old at best of times let alone after they are climbing the walls for half an hour. After or complaints the chef granted our request for pasta, at which point we had to head back to the room with a ratty and exhausted toddler, as we could not wait another ?30 min in the great hall. When the pasta arrived we found it was probably the most expensive bowl of pasta in tom sauce (on top of £ 15 child meal) and had a room charge on top...", "title": "10/10/10 Wedding - Fantastic setting, staff, service and memories! Highly recommended.", "user": "MrDaveClarke", "date": "February 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95885905}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "On arrival - you get the wow factor, what a beautiful setting. The house is taken from a chocolate box. Throughout our stay the staff were very friendly and helpful. Two issues took away some of the veneer for me. The first issue (and a friendly word of advice to the venue) ; On checking in at reception, I was aware that the person waiting behind me to be served was a beautiful bride - for a venue that sells itself as a premium wedding venue I was concerned that the a brid feels the need to go anywhere near to reception to get a snag fixed on her wedding day - surely (as Rushton Hall only does one wedding a day) they should have a dedicated wedding contact available at all times to smooth away those issues. My second issue was the evening meal - we'd prebooked dinner for 8pm - the dinning room was lovely and the staff courteous, and service timely. The quality of the food was mediocre for a premium venue - The pre-booked dinner was £38 a head - but upon seeing the menu, every (decent) dish came at an additional premium - I paid a premium for a Halibut dish - which, when it came was overcooked. I am an unashamed foodie and to see \"seasonal local vegetables\" - turn out to be french beans and the like (in January? in Northamptonshire?). Two other tables nearby also requested additional sauce with their dinner - as it seemed to on ration. Our room was average for the money. The breakfast - 8/10. The Spa 10/10. I would stay there again and would recommend it to you - although I'd probably eat out.", "title": "Brides beware - excellent setting and friendly staff but average food & where was that wedding co-ordinator", "helpfulness": 1, "user": "kevinwing", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93617803}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I was very pleased with our stay at Rushton. We stayed there for one night mid-week on our way back from the North, on a special price groupon voucher. The building, the grounds and the stunning decor make it feel slightly magical. There only seemed to be around 10 rooms occupied and we got exceptional service from the concierge both on arrival and in the evening. Our room had the most stunning bathroom, with a large roll top bath.", "title": "Beautiful setting", "user": "Travelling_Gourand", "date": "January 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 92869955}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The meal was very nice, quite pricey but of a strong quality, although they forgot to bring the petit fours with the coffee. The service in the dining room was great but the bar staff in the great hall were terrible. They didn't speak English and twice brough us the wrong drinks.", "title": "absolute disaster", "helpfulness": 6, "user": "judedep", "date": "January 11, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 92584169}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "We enjoyed the use of the pool and spa and I think we would return, although probably only for one night if its on our way past.", "title": "Lovely building, lovely staff, shame about the food", "user": "Colinandnicky1", "date": "January 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 92568422}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "My partner and I stayed at Rushden Hall as a treat to celebrate our 10 year anniversary. What a disaster! We booked a table in the restaurant at 8pm and were kept waiting until 9.30 to be seated.The starters were wrong, my main course when it came at 10.40 was cold and the staff not at all helpful at all. They did eventually offer to remove the cost of my main course from the bill but when we came to check out this had not been done and we felt very embarrased having to sort this with reception. We had also been over charged for other things we did not order.I did write via e-mail to the manager of the hotel upon my return but have never recieved a reply.", "title": "The perfect Christmas spent in Rushton Hall", "user": "SassySu", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91040318}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Rushton Hall is the perfect location for a romantic getaway. Not difficult to get to from London Saint Pancras, really big room with an authentic feel to it, amazing atmosphere, we enjoyed a nice cocktail by the open fire place, having a look at all the impressive paintings, a perfect dinner at the restaurant and a couple of hours in the spa facilities. Will definitely visit again.", "title": "A great getaway", "user": "Tiodoems", "date": "February 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 95769919}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed here on a Groupon offer and were in the Francis Trenshaw bedroom. The bedroom was very clean and the bathroom was just beautiful with lovely toiletries. The bedroom itself was a little small and I found the furnishing a bit dull but that is personal choice. The room was VERY hot and we both woke up very early as we were too hot and needed to open a window - we could not find any way of turning down the heat in the bedroom.", "title": "Beautiful Old Country House - but felt a bit spooky!", "helpfulness": 2, "user": "Lesley K", "date": "January 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 94836879}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "SERVICE: Reception were very good. We had tea and cakes in the lounge in the afternoon but it all seemed a little too much trouble for one of the members of staff who you really got the impression didn't like her job! In the breakfast room we were kept waiting a long time before anyone asked us what we wanted. In the end my husband had to get up and ask someone. I did get the impression there were some new staff in the breakfast room as the girl who served us was very nervous and didn't seem to know what she was doing!", "title": "Old country house setting", "user": "anthony_L74", "date": "January 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94294468}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "FOOD: We originally booked a table in the restaurant but we cancelled this as we weren't keen on the menu and the only thing we would have chosen was an extra £7 and the menu was quite expensive anyway. We went down the road to the Thornhill Arms and had an excellent meal there - very reasonable and would recommend anyone else going here to have a meal there if they don't want to eat in the hotel. When we finally got our breakfast it was very good apart from the eggs being cold which was very strange as the rest of the meal was particularly hot!", "title": "beautiful hotel, shame about the food.", "helpfulness": 2, "user": "Elizabeth186353", "date": "January 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 94062351}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "LEISURE FACILITIES: The Spa was very pleasant. The sauna was very good but the steam room smelt a bit musty. The gym was very good - the equipment is all very new and is the best gym I have seen in an hotel.", "title": "Not good enough", "user": "fjal", "date": "January 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 93748684}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 43, "average": 42, "very good": 146, "terrible": 21, "excellent": 326}, "aka": "Rushton Hall Hotel Rushton", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Rushton Hall is a Grade I Listed 4 Star and 2 Rosette Hotel, surrounded by the cities of Kettering and Market Harborough. Guests will find this convenient location is just minutes from Wicksteed Park, Stoke Albany Golf Club, Rockingham Castle, Rockingham Speedway, Rutland Water, Telford Way Industrial Park and Kettering Business Park. Beauty and elegance abounds to enhance the guest’s experience. From beautiful gardens for an afternoon stroll to the sparkling pool for a quick dip to relaxing with spa services, this hotel offers a variety of luxuries to enhance any getaway. All rooms are individually designed in keeping with their country house décor. Bed sizes vary per room and all rooms are ensuite and feature tea and coffee making facilities, bathrobes and slippers and turn down service is available."}