{"user_rating": 4.0, "review_count": 296, "name": "Rydges Port Macquarie", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Average room at ok (but not great) price. Insufficient towels. But staff have no sense of customer service. Advised no spa tubs in the hotel are working for \"safety and maintenance reasons\". The specific writing on my key card states \"20% off all meals and drinks*\" and \"*Discount does to apply to breakfast, mini-bar, in-room dining or meetings\", however, when we went to Zebu Bar & Grill for dinner, we were told that there was no 20% discount and it only applied in Zebu Restaurant. When we went to Zebu Restaurant, we were told we could not order anything but the restaurant menu, and not the pizzas that are listed on the site for Zebu as those were only available in the Bar and Grill.", "title": "Surly Staff - never again", "user": "a_and_ptansey", "date": "April 12, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 157487636}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Turned us off Rydges completely. Felt it was dishonest. Plus staff at the Bar and front desk were rude. Restaurant staff were nice and apologised for the misleading information repeatedly. Told us it happens all the time - we thought it was sad.", "title": "Rydges by the Hastings River, Port Macquarie", "user": "CandcH", "date": "April 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157167043}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "There are other, similarly located and priced hotels where we hope that the standards are better.", "title": "...loved this place...", "user": "thepomsinoz", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157114273}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We won't be back here again.", "title": "Great location but very expensive", "user": "ReDDvL", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 156931476}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "March 2013 - We booked two, two bedroom apartments side by side. The rooms were very comfortable, clean, and very roomy. All cooking utensil provided as needed. The views from the sith floor were excellent to the water and breakwall. The location was as central as you can get to the CBD, the shops, pubs, restaurants, breakwall walkways. The coastal path passes by Rydges frontdoor so walk out from breakfast or walking in to breakfast from your morning stroll. The beach is a nearby stroll. The wharf is right there. The entertainment surrounds you. The shopping precinct is there however the groceries and shopping precinct is at Settlement City a few kilometres downriver. The service from the restaurant was good at 10pm at night. The breakfast menu was very good and full breakfast between $23 & 26 pp. Nearby pancakes and other cafes are available with a $12 full breakfast at the entrance to the Port Central shopping mall, well worth the added 50metre stroll. The pool is first floor overlooking the river and beneath the apartment verandahs. The gym (not used this trip) out was well fitted out, clean and well maintained equipment (not wornout like some locations previously visited.) We paid $594 an apartment booking a month prior to travel. If you shop around with Rydges I'm sure you could get a better deal with water views at different times.", "title": "Great view of the water!", "user": "Susan C", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156919963}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Situated on the water and close to so many attractions made this place an ideal choice for a short break. The hotel has a good restaurant and very spacious rooms. The bed is supremely comfortable. The bathroom was sparkling and had a decent shower and bath.", "title": "love the location", "user": "hamilstra", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156576199}, {"rating": 4.0, "title": "Clean, comfortable in a fantastic location", "text": "Whilst reception staff were perfunctory restaurant staff were friendly and obliging.", "user": "jandk_95", "date": "April 3, 2013", "id": 156468139}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We booked at the Rydges expecting a standard queen room, when we mentioned it was our 18th Wedding Anniversary we were upgraded to a king room. The room had a great view over the river and the ocean at Port Macquarie, the room was very clean and well appointed, everything worked and the room was serviced regularly during our stay. Our only issues was the bathroom, a hotel of the standard and quality should have more than just a shower over a small bath. A hotel of this standard should have a more modern air-conditioning unit that doesn't with a \"thump\" large enough to rattle the door! The other problem was the over zealous nature of the cleaners who, despite the \"Do Not Disturb\" sign on the door insisted on disturbing us not once but 3 times before 10am on the morning of our anniversary!!!!", "title": "Very Relaxing and great view", "user": "Necia W", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156211044}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Despite this we would stay again.", "title": "A Pleasant Stay", "user": "peregian2", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 156209428}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "A tranquil view awaited us of the river as well as Ocean views - really beautiful and totally relaxing. Situated in the centre of Port Macquarie and within walking distance of restaurants and attractions we enjoyed a relaxing 6 days in our King suite. Only downer is the parking at $10.00 per day for an undercover space. Kebus do the best coffee we have tasted in an age. Our 1.00pm checkout was an added bonus.", "title": "Excellent localation but shocking view.", "user": "Mariella23", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155761700}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Overall impressed with view, pool, breakfast and staff. Although pricey for a splurge it was definately worth it. Thanks for a top stay!! Would stay there again and recommend it to others. The pool and spa were awesome as was watching the sunset from our balcony.", "title": "What a view!!", "user": "sherrie75", "date": "April 28, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 159017571}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Had a four night stay in a large room, the bed was very comfortable as expected from Rydges beds. The facility at this hotel are good, had a lovely breakfast each morning, had one dinner here, a bit slow in getting our meal and a bit pricy. The location of this hotel is good, lookng at the beach. Certainly would recommend a stay here.", "title": "A good place to stay", "user": "Bern56", "date": "April 28, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 159001170}, {"rating": 2.0, "title": "Stay Ruined By so-called Priority Guest Rewards", "text": "This might have been a great stay for our family of four. Nice room. Nice location. Problem was that Rydges Port MacQuarie did not deliver on the PriorityGuest Rewards promise. There should have been 20% off dining. T&cs state 'not available at Zebu Bar. However is available in the grill'. It's very hard for the layperson to know what constitutes the 'grill'. There's a bar, there's a dining area in the bar. And there's a dining room next door. All have menus titled 'zebu bar and grill'. When I placed my order at the bar (off the Zebu Bar and Grill menu) and presented my membership card I was told the discount only applied to the 'dining room '. The in-room guide is therefore misleading. I was also not offered a complimentary drink. I queried the discount with the concierge and also asked how one should obtain the 'complimentary welcome drink'. He scribbled me a free drink voucher and suggested it would 'take the edge off' -well, I didn't redeem it obviously, as the 'edge' remained on! Back in the dining room (or bar or where ever we were) - the kids are starting to go ferrel after 45 minutes waiting for our meals. After I enquire after it, a lovely waitress offered complimentary drinks due to the wait - I did accept for the kids, but me and hubby were 'over it' by then. The meals arrived 5 minutes later. Pizza was average. Kids meals were quite good. Rydges Port MacQuarie need to decide if they're participating in the Rewards program or not. State clearly where the discount can be used and give every member a welcome drink voucher without them having to ask for it.", "helpfulness": 2, "user": "Nicola T", "date": "April 26, 2013", "id": 158834856}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Having had some experience in various hotels / motels in the past, i was looking forward to spending a weekend with my young son at Rydges Port Macquarie.", "title": "Amazing", "user": "Adam L", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158068191}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "It is very difficult to restrain myself from the amazing experience that we had at this wonderful place. Eventhough the weather was poor and the local area was still reeling from some recent floods, the staff made our stay memorable. Even yesterday, my young son was begging me to book another trip to go up there.", "title": "A very clean and comfortable hotel", "user": "Alex S", "date": "April 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157574326}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed at the Rydges as a stop over from Sydney-Gold Coast. We stayed in a 2 bedroom room which was on the upper level and the view was fantastic. I note from the other reviews about the noise but we stayed on a public holiday and everything was closed. There was some work being done in the park out the front and it was noisy so I can appreciate the noise from the pub next door would be loud. The room is large and everything you would need to stay for an extended period with a large group. Central location, underground parking it was a good stay. We did dine in the restaurant. Two of the signature dishes were not available on the night, one was the oysters, how can a restaurant in Port Macquarie not have oysters ? We ordered a bottle of wine that was forgotten, I had the 'thinly sliced fish' which was frozen in the middle. I really got the sense that the restaurant on the public holiday had just switched off. I would definitely stay again and hopefully they have the honey kilpatrick oysters at the restaurant.", "title": "Overnight Stop", "user": "MBarr", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 161337147}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I really think the management of this hotel have a duty of care to their guests. We stayed the weekend of 18/19 May. My husband was on business and I tagged along for a nice relaxing weekend. Boy - was that a mistake! Room was good (with spectacular view of the roof top)! Bed was comfortable. Decor was ok, although a bit outdated now. Shower over the bath is awful, especially for older guests. Check in was easy and staff at front desk appeared pleasant. All good until we went to bed. Then, around 10 pm the band fired up at the pub next door (?). Now, we don't object to a bit of background noise. After all,it was Saturday night. However, this was LOUD, invasive, throbbing and impossible to block out. My poor husband had to be up at 6 am to do a 12 hour day at the local hospital and this racket went on unit 17 minutes past midnight. Back to the duty of care..... The hotel should warn guests about this. They clearly know it is a regular event, as evidenced by the grin on the staff member's face when I complained. For heaven's sake, tell the guest that there is likely to be a god awful din until after midnight and give them the opportunity to make other arrangements! Failing this, offer the guest a room where it is less noisy and give the noisy rooms to those who are going to be out on the town anyway. Guests have the right to expect a peaceful night's sleep and when the hotel knows full well that is unlikely to eventuate they need to tell us! We spoke to two other couples who said they would not return for the same reason and that they would tell others about it too - as shall I. It's a shame that this spoils an otherwise not bad establishment.", "title": "Not a place for a relaxing weekend!", "user": "NeeceyT", "date": "May 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 161242598}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "400km north of Sydney and seemed like a perfect place to stop, revive and survive as the road signs kept saying. Got a beautiful room (big enough for a dance class) with views over the river to the glorious sunset. Perfect in every way until the pub next door started a drumming concert at about 8. It finished at 10 for a few blessed moments, only to be followed by a rap concert of some kind with the same insistent beat but at an even greater volume. Having paid extra for a balcony so we could have fresh air, the reception's suggestion that we close the door was not appreciated, and didn't even help much. When we checked out, no one asked how our stay had been. They either already knew, or didn't care. Either way, we won't be back in a hurry.", "title": "Great position as long as you don't want to sleep", "user": "batsami", "date": "May 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 159758155}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed here on the drive from Melbourne to Byron over the Easter break.", "title": "Super Comfy Bed", "user": "RICHOSingapore", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159090381}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This was a last minute and late night check in.", "title": "Location is the Key", "user": "Travelvar", "date": "April 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 159084657}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Port Macquarie"}, "stars": 4.5, "variance": {"poor": 21, "average": 56, "very good": 134, "terrible": 14, "excellent": 71}, "aka": "Rydges Port Macquarie Hotel Port Macquarie", "slim_ranking": 0.428571428571}