{"user_rating": 4.0, "review_count": 71, "name": "Ryokan Yamazaki", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "My brother and I stayed at Ryokan Yamazaki for 4 days at the height of cherry blossom season (late March in 2007) and loved every minute of it. We were in the annex, which is about a 2-min walk from the main building; it's also off the main road, and backs up to a mountain, with a small creek running between the building and the mountain that sounds lovely all night long. It's a gorgeous and peaceful setting. Most of my comments echo what other reviewers have said: it's beautiful; the rooms are simple, but clean and well done; the people who run it are absolutely wonderful, in that they are warm and considerate, and have a great sense of humor; and I can't believe how inexpensive the place is. (I suspect the low price is due to the out-of-the-way location, but I'd pay more for a location like this.)", "title": "Absolutely wonderful", "helpfulness": 3, "user": "heads26", "date": "May 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7597736, "likes": {"liked": "— Location, food, owners", "disliked": "— No complaints at all"}}, {"rating": 1.0, "title": "Depends on your room", "text": "A few important points have not been brought up in previous reviews, though. First, the food was terrific. Although the owner had said they could not accommodate us for vegetarian meals, once he understood that we wanted Japanese, not Western, food, they served up some incredible meals. Second, although other reviewers seem to suggest that the place is difficult to access, it's actually very easy to get to if you take 10-min ride on the JR train from Kyoto station toward Sagano and get off at Hanazono. The ryokan walking distance from three lovely temples in northwestern Kyoto, including Kinkaku-ji, the \"Golden Temple\". Finally, it's just north of Arashiyama, one of the prettiest parts of Kyoto, which features many wonderful temples, lush bamboo groves, and a terrific monkey sanctuary, the Iwatayama Monkey Park.", "helpfulness": 3, "user": "Fuei", "date": "April 16, 2007", "id": 7367433}, {"rating": 5.0, "title": "Great find!", "text": "I'd stay there again in a heartbeat, and would unhesitatingly recommend it to any of my friends. I have posted photos for those interested in staying at this terrific ryokan.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 5, 2006", "id": 4939205}, {"rating": 5.0, "title": "We'll miss them", "text": "This Ryokan has lovely gardens, a nice main building and some very nice looking rooms but unfortunately we got put in the last room they rent out which was very neglected, didn't feel very clean and wasn't a welcoming room to stay in. The owners are very nice and had we been given a better room I would have given a better review so make sure you don't get room 8 in the annex. Also be aware that the ryokan is a good 40 mins from central Kyoto, buses from there only go once per hour and there are no buses after 9 in the evening so you need to take a cab if you're heading back after that.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 16, 2005", "id": 4026765}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Incredibly friendly, and helpful staff, with adequate english speakers. The rooms were clean, spatious, and unique, with a beautiful garden at a good price. It felt like I was visiting a welcoming Japanese home more than an Inn. The optional Japanese breakfast was delicious with great ambience. Only possible drawback is it is a 1/2+ hour bus ride from Kyoto station depending on traffic, but if I ever go back, I wouldn't think twice about booking here again!", "title": "Fabulous!", "helpfulness": 27, "user": "dizzy21", "date": "June 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3558732}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and stayed here for two nights and loved it. The room was beautiful and rather large for the price and for being in Japan. We had a room on the second floor and I highly recommend you book the same. The view of the gardens was just stunning. There was a washer and dryer available too if you needed to do laundry. There were no restaurants nearby but the owner of the inn also ran a restaurant in front which was good. I really enjoyed the japanese breakfasts and they even gave us the english version of the japanese paper which was nice.", "title": "Traditional Ryokan Experience", "helpfulness": 2, "user": "wee_sassie_lassie", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 8719456}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "The only negative to this place is it is off the beaten path. We used the bus system which worked out fine but it does take time and patience. Even you have neither of these, I would so try a place in downtown Kyoto.", "title": "perfect japanese ryokan", "helpfulness": 3, "user": "psylocke", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 8378181}, {"rating": 2.0, "title": "too far away", "text": "We stayed here for 2 nights in July.", "user": "eve0317", "date": "July 19, 2007", "id": 8190620}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We arrived by taxi, and were greeted with hot towels and orange juice and smiles all around.", "title": "Our stay in main building was just mediocre", "helpfulness": 1, "user": "mangchi", "date": "July 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 8099422, "likes": {"liked": "— the price"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Our room was a nice size, tatami mats and private bathroom.", "title": "Beautiful Ryokan in Picturesque Garden Setting", "helpfulness": 3, "user": "executiveoasis", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7756113, "likes": {"liked": "— The gardens, the large bright and airy room, the food, the country setting", "disliked": "— I can't think of anything I didn't like"}}], "location": {"country": "Japan", "region": "Kinki", "continent": "Asia"}, "stars": 3, "variance": {"poor": 3, "average": 13, "very good": 22, "terrible": 4, "excellent": 29}, "aka": "Ryokan Yamazaki Hotel Kyoto", "slim_ranking": 0.198952879581}