{"user_rating": 3.5, "review_count": 331, "name": "Sabah Hotel", "reviews": [{"rating": 3.0, "title": "Underwhelmed. Dated rooms and I got food poisoning there.", "text": "We stayed here on our honeymoon for 1 week. The inside of the communal hotel areas are quite beautiful as are the grounds, but the actual rooms feel dated and look well used, not what you'd expect for a 4* hotel. Staff were very friendly and helpful, but service in the restuarants was slow. Good selection of food for buffet breakfast. I got food poisoning here, Im as certain as I can be that it was from the hotel food as I hadnt eaten/drunk anything outside the hotel that day or the day before. We spent a day and night away from the hotel on a trip and when we came back the leftover food from room service on the night before we went away was still in our room slowly going off. I was really disgusted by that, they'd made up the room but not taken the food. We stayed at a 3* hotel (Berringgis Beach Resort) in KK after this hotel and found that the 3* hotel easily surpassed this '4*' hotel.", "user": "chocolate23", "date": "July 12, 2010", "id": 70613939}, {"rating": 3.0, "title": "dated rooms, Ok location and pool", "text": "Nice suroundings, the hotel is lost in the jungle so you do feel in Borneo here. It is a real shame that the haven't updated their rooms... old furniture and feel. Have a look areound you might find something better...", "user": "LPM", "date": "May 31, 2010", "id": 65955422}, {"rating": 5.0, "title": "Great, being able to plunge in a pool after our jungle adventures", "text": "We'd originally planned to spend a sacond night in Hotel Sandakan after our island- and jungle adventures, but when we stopped at Sabah Hotel for lunch, we immediately decided to stay right there. And with no regrets. Food was nice, our (standard) room was great, I've never slept in a better bed with nicer sheets than in Sabah Hotel, during our trip. We've really enjoyed the pool.", "user": "trinidaddict", "date": "May 20, 2010", "id": 64821223}, {"rating": 3.0, "title": "OK but dated resort hotel", "text": "While there is nothing that I can really pinpoint as being wrong with this hotel, it just didn't feel quite \"right\"! Maybe it's because we don't usually do resort hotels.", "user": "CAQ", "date": "April 24, 2010", "id": 62301547}, {"rating": 4.0, "title": "A great place to stay in to recover from the jungle.", "text": "The usual ameneties are there for this class of hotel - internet access (not free), business centre, bar, 2 restaurants, room service, pool, gym, tour advice.", "user": "AlanandRobyn", "date": "April 16, 2010", "id": 61642890}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed here as part of an independant tour around Malaysia. Loved a plethora of large black and white photographs in the entranceway showing the hotel through the years. Service was very friendly and efficient. The only facilities we used were the bar in the early evening and it proved to be very comfortable and relaxing, and the poolwhich was loveley. Rooms were large and well maintained if a touch old fashioned, although one could call it charachter.", "title": "Very pleasant stay", "user": "Me_n_my_rucksack", "date": "February 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 56937809}, {"rating": 4.0, "title": "Cool~~", "text": "We found it was cheaper to get a taxi to town and back for breakfast than have it in the restauraunt, and we ate out for all of our stay so can't comment on the food. The taxis were always available and cheap. Also we found tour agents in town far more competitive for organising tripsout to the rivers / wildlife centres than the one in the foyer. However thats hardly the hotels fault. Overall a very pleasant stay. Best of all Stephen Fry was staying here filming \"Last chance to see\" and he was a thoroughly nice chap.", "user": "FloraC", "date": "February 12, 2010", "id": 55832099}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "It's a nice place to stay with full facilities at an average price...", "title": "would love to go again", "helpfulness": 1, "user": "yellowie8", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51377417}, {"rating": 4.0, "title": "Nice hotel, but could be better", "text": "We stayed here on two seperate occasions in August and had pleasant stays both times.", "user": "backtoback", "date": "September 5, 2010", "id": 78332478}, {"rating": 3.0, "title": "Great pool, poor food, rather dated decor, and very expensive for the area", "text": "The rooms were clean and spacious, large bathrooms and pleasant.", "user": "MissFussyBerkshire", "date": "August 19, 2010", "id": 75947661}, {"rating": 5.0, "title": "Sabah Hotel - a fantsatic retro hotel", "text": "The pool area was nice, and was good for adults and children with the small slides etc.", "user": "NZShaz", "date": "August 7, 2010", "id": 74127207}, {"rating": 4.0, "title": "Not bad but not great", "text": "We only found the restaurant buffet average and thought it to be rather expensive. The food was not always hot and nothing was replaced very quickly if it ran out. There was also very little choice for vegetarians.", "user": "KGB_4", "date": "July 17, 2010", "id": 71203261}, {"rating": 2.0, "title": "I would say \"It's just ok\"", "text": "Bland international bedrooms, very clean and with good facilities. Staff okay but not amazing. Lovely pool and the only one in Sandakan. Rip off prices", "user": "A TripAdvisor user", "date": "July 14, 2010", "id": 70895402}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Stayed here for one night on business. I was told that this is the best hotel in Sandakan.", "title": "Nice Hotel, Probably Best in Sandakan", "user": "kaywai", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48691810}, {"rating": 5.0, "title": "Relaxing in a rain forest atmposhere", "text": "Check-in was a breeze although I had to bring my luggage to the room myself. Not a big problem.", "helpfulness": 1, "user": "retired_dreamer", "date": "October 12, 2009", "id": 46680030}], "location": {}, "stars": 4, "variance": {"poor": 20, "average": 80, "very good": 162, "terrible": 9, "excellent": 60}, "aka": "Sabah Hotel Sandakan, Malaysia", "slim_ranking": 0.206896551724, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}