{"user_rating": 4.5, "review_count": 65, "name": "Sabi Sabi Selati Camp", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Our first stop in our four-day stay at Sabi Sabi was Selati Lodge. We loved this place – it had an old colonial African feel that really worked. Lots of dark timbers, open air lounges with comfy couches, the obligatory open bar and huge independent thatched rooms. We were given a suite (not sure why, but who was I to complain) which featured a huge four poster bed complete with mosquito netting, a lovely lounge, outdoor shower, huge bathroom and a private deck overlooking the plain.", "title": "Fabulous African Wildlife Experience", "helpfulness": 3, "user": "jmlparis", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18236318, "likes": {"liked": "— A real African experience"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The plain also featured a strategically-placed waterhole. The critters obviously loved it – we sat down to lunch on the large deck to be entertained by water buck, warthog, impala, buffalo and, when we seemingly weren’t looking, an elephant sidled up to the bog and had a ball spraying water everywhere.", "title": "Excellent camp with old Africa charm", "helpfulness": 2, "user": "AEFH", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13788234, "likes": {"liked": "— Service, Style, Adventure"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The food at Selati was really good – lunch was a buffet with lots of salads, quiche and other stuff. We filled up our plates (naturally), polished it all off then the waiter came round and asked what we wanted for our main course. Ooops. Didn’t realise lunch was three courses. Nothing much to do apart from expand the belt a notch or two and keep going!", "title": "Excellent Game viewing and great staff", "helpfulness": 2, "user": "nytraveler09", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8670896, "likes": {"liked": "— anything- the game viewing", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "All dinners are communal which gives you a wonderful opportunity to meet people from around the world. We loved it - ended up having very long lunches!!", "title": "Intimate setting with old safari feel", "helpfulness": 4, "user": "travellikecrazy", "date": "January 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 6548998, "likes": {"liked": "— the rooms were gorgeous and the bed comfortable..loved the gas laterns at night"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We have been to Africa before and had seen pretty much everything in terms of the Big 5 and other interesting animals, so the thrill for us at Sabi Sabi was getting really close to the animals. There did not seem to be huge herds of animals roaming the park and you often drove for 20 minutes or so without seeing anything (does sighting a drongo bird count? I thought it was funny.) But, when you do see something, you can get really close. Over the next few days we were able to say hello to heaps of rhino, lots of elephant (including lots of babies – sooooo cute), buffalo, etc.", "title": "Amzing Honeymoon experience", "helpfulness": 11, "user": "GavinManchester", "date": "September 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3889971}], "location": {"country": "South Africa", "continent": "Africa"}, "variance": {"poor": 2, "average": 2, "very good": 5, "terrible": 1, "excellent": 55}, "aka": "Selati Camp Hotel", "slim_ranking": 0.8, "description": "Selati CampRomance, intimacy, luxury and 5-Star service epitomise Selati Camp. A late 1800’s railway theme with authentic memorabilia evokes images of a time when life moved more slowly, more gently. Eight beautiful suites feature handmade beds draped with mosquito nets, soft linens and antiques. En-suite bathrooms (recently refurbished) have indoor and outdoor showers. Excellent cuisine is enjoyed in the small farmhouse kitchen or intimate outdoor boma and viewing decks overlook a riverbed."}