{"user_rating": 4.5, "review_count": 351, "name": "Sadot Hotel , Ben Gurion Airport - an Atlas Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Positives: Nice large, clean, new, rooms very comfortable. Very friendly staff. Good breakfast and a surprise late afternoon snack/coffee bar. For me the location was great because all of my business and visits were within 15 km from the hotel. Pricing seemed more competitive then similar hotels I stayed in Israel in past visits.", "title": "Good Value", "user": "Humphryg", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 57772996}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Negatives: Takes a time or two to figure out the parking/access. When leaving the parking structure you take a tour (sometimes a slow tour) around the large hospital complex to get to the highway. Occationally the pass from the hotel did not open the gate leaving the parking area.", "title": "A great deal Near Ben Gurion Airport", "user": "doclouise", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56774751}, {"rating": 5.0, "title": "Amazing", "text": "Special word on location: If you have a car and know Israel pretty well, this is the perfect location. If you are a first time tourist, note that this hotel is NOT in Tel Aviv but in a rural area (despite the huge hospital and very large army base nearby) so you will not be able to take in the sights simply by leaving the hotel and taking a walk.", "helpfulness": 1, "user": "silent_21", "date": "February 16, 2010", "id": 56111717}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "This brand new hotel is only 15 minutes from the airport on the third floor of a little mall.The rooms are lovely and clean with bed, couch and two flat screen t.v.s. The service was great. Yelena at the front desk kept calling my airline company for me until she got someone when there was some confusion about my flight in the recent snow storms in the US. A glitch in the heating was quickly and efficiently resolved. Breakfast was a perfectly adequate Israeli-style breakfast. The free shuttle service to the airport was right on time. The price at $125 make this a terrific deal.", "title": "Hard to find", "helpfulness": 1, "user": "surkes", "date": "February 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55485952}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The location was perfect not to far and free shuttle service back to airport. Very friendly staff. I was super impressed by the room and cleanliness of the hotel. Breakfest buffet was good . Would recomend this hotel to anyone who wishes just to unwind before a flight. The staff was very helpful on explaining things to do and how to get there. And very beautiful as well. ( I told you i would put it :)", "title": "very nice", "user": "folkestad", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 55093586}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Very suited when You arrive or leave Israel. Because it is situated above a mall You can do your first or last shopping. Staf is very friendly and helpful", "title": "Nice room, good food&interesting library", "user": "janusHilversum", "date": "January 5, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52643935}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Our family of four spent one night at Sadot Hotel as we began 3 nights of independent travel after a 10 day group tour. We said farewell to our group at Ben Gurion on Wednesday night, rented a car at the airport and drove to Sadot as a stopover before driving to Eilat the next morning. The hotel is a short drive from Ben Gurion Airport, but since it does not have an address, it is important to have specific driving instructions as our GPS didn't have the hotel listed. As it is next to Asaf Harofeh Hospital, I was able to enter the name of the hospital in the GPS and it got us there with no problem.", "title": "Clean, Modern and Spacious - Nicest hotel of our two weeks in Israel", "helpfulness": 2, "user": "DosDudesMom", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52575800}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Sadot is new, clean and designed in a contemporary style with cool black and white wall murals of agricultural views. The photos are actually an accurate representation of how it looks! The rooms are quite spacious and very quiet due to it's location. It is in the upper floors of a multi story building with free parking in the building's garage and a shopping center on the ground floor which we did not visit (I did notice there is an Aroma location there as well - great if you need to pickup sandwiches or snacks for the road). Our teenage boys were in a room down the hall and they appreciated the flat screen TV and free WiFi. There is also a computer with free WiFi available in the lobby.", "title": "Perfect if you like hospital dramas", "user": "lisdorOslo", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 3.0}, "id": 51521995}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Breakfast was delicious - my boys loved the pancakes and the vegetable egg scramble was delicious. After being with a group in larger, tourist hotels, it was nice to enjoy a quiet and relaxed breakfast.", "title": "Excellent property and location for business traveler.", "user": "manofnomeans", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 50567323}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The room key also activates the lights in the room via a holder on the wall. A nice 'green' touch, but remember to grab your key when you leave your room!", "title": "NOT in Tel Aviv", "helpfulness": 1, "user": "JimChristopher", "date": "November 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 4.0, "rooms": 3.0}, "id": 50194697}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This is the closest hotel to the airport in Tel Aviv and it is really quite a distance from the airport. It was an expensive cab ride. Outside of that, this was a lovely experience for us. The hotel is located within a mall and that was fun as we were settling down to get ready for our trip through Israel. The staff is very nice and polite. The breakfast buffet was great with lots of variety and choices. Our room was very clean and comfortable as well as stylish and well appointed.", "title": "Great way to relax and get beyond jet lag!", "user": "ladydrake", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 49862534}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "This is a brand new hotel which is fairly close to Ben Gurion. The staff is very helpful and the rooms have a unique design that appropriates space a little differently than a conventional room. The beds and linens are excellent. The bathroom was also great. The place feels quiet.", "title": "Very comfortable, but lacking for biz travelers", "user": "teainthesierras", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 49599083}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "But for the business traveler there may be some frustrations. I had a tough time connecting to the Internet and spent a couple of hours on the line with the hotel's provider trying to track the problem down. I travel a lot and can't remember when I haven't been able to connect to the web at all at a hotel oriented toward business people. But the provider at least worked on it and did get it fixed.", "title": "Perfect for overnight stay near airport", "user": "SylviaSheffield_U_K_", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 49307369}], "location": {"country": "Israel", "continent": "Middle East", "city": "Tel Aviv"}, "stars": 3.5, "variance": {"poor": 8, "average": 29, "very good": 126, "terrible": 2, "excellent": 186}, "aka": "Sadot Hotel Tel Aviv", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "the hotel is located 20 minutes drive from Tel Aviv, less than 10 minutes drive to the Ben Gurion airport. The hotel has 37 spacious rooms over-looking the fields and farms surrounding the hotel, which gave the inspiration for the room design.Each room includes a comfortable seating area, kitchenette, coffee/tea self-making facilities, cable LCD, large work desk, DVD, small refrigerator, safe and hair dryer. The hotel has also free wireless Internet connection in the rooms."}