{"user_rating": 3.0, "review_count": 75, "name": "Safari Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I stayed here at the start of my Namibia safari and on the last day of my tour.", "title": "Good hotel, friendly staff", "helpfulness": 16, "user": "acidming", "date": "October 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3999631}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Our room was fine. The young woman at reception was very helpful and taught me the words for the heavy quilt we wanted to remove (couette), the lightweight blanket we wanted to replace it (coverture), and a top sheet to put it on (drap).", "title": "A perfectly good place to stay, but nothing special", "user": "Chandolin", "date": "July 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 167349666}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "There were no restaurants nearby, so we ate in their empty dining room. The food wasn't memorable, but okay, and the maître d'/waiter scraped our plates at the table when he removed them.", "title": "Very rude hotel director and reception staff, except night receptionist - very amiable)", "helpfulness": 1, "user": "swindphi", "date": "July 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 165914549}, {"rating": 4.0, "title": "Lovely welcome", "text": "When we tried to check in at 12.00 noon we were told to come back after 14.00 hours which was fair enough as we were very early but when we returned at 14.30 hours we were reprimanded by the receptionist for being too early. She didn't even check whether the room was ready! When she realized the it was 14.30 and not 13.30 as she thought, she checked and the room was ready. If it had been 13.30, I don't believe that she would have checked whether the room was ready as she was determined that we should not be able to check in before the stipulated time. During subsequent discussions with the hotel director, it became very clear that she didn't like English people!", "user": "Elizabeth G", "date": "May 25, 2013", "id": 161791494}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed only one night instead of two which was allowed under the booking terms through Booking.com but the hotel tried to charge us for two nights - I had to ask Booking.com to intervene and this action resolved the situation.", "title": "If you are fed up with Provence style....", "user": "Tipgirl", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 148414519}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The hotel is in a scruffy commercial district and not at the foot of Mont Ventoux as the description states!", "title": "On business North of Marseille", "user": "GerhardCH", "date": "November 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 145994628}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "The Safari Hotel is great for a couple of nights stay at the beginning or end of your trip (especially if you have been camping!). The staff are very friendly and helpful and reception always well staffed. Free safety deposit box service, lockable wardrobe section in your room and plenty of security. I was travelling alone and it all felt very safe and friendly, unlike some of the guest houses which people on my tour felt were not so safe. There is a decent sized pool with plenty of sun loungers and a pool bar service for drinks and snacks. Couple of nice restaurants also which are fairly reasonably priced. I stayed in the business class room which was spacious and had all the comforts you would expect from this class of hotel and much appreciated air con! It's also easy to extend your check out time and arrange for airport transfers. I made good use of the free shuttle service which runs in and out of Windhoek centre every 30 mins and only takes about 5-10 mins to get there. Definitely don't let the fact this is not in the centre put you off, it's cheap and easy to arrange taxis to restaurants etc at night and even the places closer to the centre recommend taking taxis after about 8pm anyway. Recommend this one for a well priced hotel with good facilities and excellent service.", "title": "Excellent mid-range hotel with good facilities", "helpfulness": 1, "user": "FayeW", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14086697, "likes": {"liked": "— Good sized pool and very helpful reception staff.", "disliked": "— Rooms facing reception can be a little noisy at the weekend."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Do not book a budget room, because many of them are not renovated and extremely filthy and worn-out. We stayed first three nights in budget room number 73 that was \"average\", but next time when we returned back from safari we were given the room number 14, that was under all standards (also the African standards). So we changed up to business. These rooms are clean and the difference in price is very small. The hotel is located some kilometers away, but the free transportation is effective and runs until 9 PM. There is nothing to complain about breakfast or pool-area. The staff is friendly and plentiful, but the service is African standard (slow). And if you come from euro-area, the prices are very cheap.", "title": "Business Class - not Budget", "helpfulness": 2, "user": "HAV", "date": "January 21, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 12833642}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "After staying at over 20 different hotels in Africa, this was truly unacceptable. Not sure if they gave me this room by mistake or what. I paid about the same what I had paid for other very nice accomidations during 40 days in Namibia and So. Africa. This room had a closet door dangling off the ceiling, a torn apart safety lock on the door, stains on furniture , carpet, and walls, phone wires had been torn out of wall, thick layer of bugs in the bathroom light fixtures, broken tile and on and on. When the deskstaff was told they acted surprised I did not like the room!!!! The bed was clean, but I was glad to leave.", "title": "Stay away", "helpfulness": 2, "user": "mdnWashigtonDC", "date": "October 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 10428806, "likes": {"liked": "— Nothing", "disliked": "— Poor room quality"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed here in late December for a 1 night stopover between Cape Town and London.", "title": "Great option, very friendly staff", "helpfulness": 7, "user": "davereinhardt", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 6815321, "likes": {"liked": "— Service from staff was great.", "disliked": "— Air-con a bit loud."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The hotel suits the formula for this type. Rooms were spacious and clean. Air-conditioning worked, but was a bit louder than we would've liked. (Although not loud enough to stop us using it. Bathroom had separate bath and shower (although this may be dependant on which room you're allocated) which were both clean. Staff were very friendly, customer service was great. We were given a welcome basket on the ocassion of our anniversary, we were allowed to checkout after 17h00, etc. etc.", "title": "Excellent Mid-Market Choice ~ Especially Business Rooms", "helpfulness": 8, "user": "Millardski", "date": "October 30, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6032085, "likes": {"liked": "— Modern, high quality fitted bedroom (Business Room).", "disliked": "— Slightly noisy Air-Con in room."}}], "location": {"country": "Namibia", "region": "Khomas Region", "continent": "Africa", "city": "Windhoek"}, "stars": 3, "variance": {"poor": 7, "average": 37, "very good": 23, "terrible": 6, "excellent": 2}, "aka": "Safari Hotel Windhoek", "slim_ranking": 0.882352941176}