{"user_rating": 3.5, "review_count": 65, "name": "Sag Harbor Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "My Bachelorette Party was a nice low key, off season visit to Sag Harbor. We stayed at the Inn on the 1st floor facing the bay. Our room had beautiful French doors opening to a little patio and we were a stone's throw from the water. So peaceful & gorgeous!", "title": "Great little inn - awesome staff!", "user": "SaraPaul", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60187105}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Rooms were very spacious & clean. Two big beds, little sitting area, nice sparkling bathroom and a separate vanity - perfect for a bunch of gals who needed mirror space. Sure the TV was a bit old, but who wants to watch TV when you are facing a bay filled with beautiful birds & boats and have a bunch of seafood restaurants & wineries just minutes away!! We didnt even touch the TV!!", "title": "the SAG HARBOR INN, TRY IT, YOU'LL LOVE IT!", "user": "flwd82", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59133827}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The hotel staff were really the best. We e-mailed many times before our visit and we provided with great details about the area, dining options, etc. They EVEN sent me my shoes and a VISA credit card that I had accidentally left in my room home to me after we had left!!! No charge, no nothing. That was really above & beyond.", "title": "What a great stay!", "user": "anth0531", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49558540}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We are looking forward to returning!!!", "title": "Charmed and impressed", "user": "mlaumeister", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48694317}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The Sag Harbor Inn has been a life saver for me, my friends and most importantly accomadating annually my Music Festival of the Hamptons artists who have universally raved to me about the generous hospitality and service. This is especially important during the busy season of the Hamptons. Unique and comfortable, situated on the inner harbor of historic Sag Harbor and walking distance to a slew of fine restaurants, the Sag Harbor Cinema, and the Bay Street Theatre. The Sag Harbor Inn is the number one choice on the East End of Long Island. I am delighted to sing its praises, Eleanor Leonard and Frazer Dougherty", "title": "my stay at the sag harbor inn was quaint, scenic and comfortable", "user": "PaStitch", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48275460}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "A great place to stay if touring the Hamptons,Sag Harbor is my favourite Hampton town", "title": "Great location and the perfect place to relax and unwind", "user": "Chrissianne", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47918628}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "and Sag Harbor Inn still offers very comfortable accommodation to relax and unwind.", "title": "Cozy, Clean and a great view!", "user": "boymama", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47257377}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I highly recommend this location and Inn , the staff are extremely efficient and friendly .", "title": "Wonderful Experience", "user": "pinarev", "date": "October 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47035305}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I have stayed a number of times and I will continue to use Sag Harbor Inn on other future visits to the Hamptons.", "title": "Groosly Overpriced Ripoff", "user": "ckale2009", "date": "September 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 45350577}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We arrived in the late evening to a happy, polite hotel employee who answered our questions and lent us a corkscrew (for the yummy bottle of wine from a local winery). I thought it was a really large room, very clean and loved the view of the harbor! It was comfy, the tv worked and the balcony was so cute. We also enjoyed the simple, yet yummy (and free) continental breakfast. It was a pleasure. Thanks!", "title": "Outrage but at least the company paid", "user": "phoebe75", "date": "September 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 40621455}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My boyfriend and I decided to take a vacation recently, and after researching for a while, we decided staying in Sag Harbor would be both leisurely and economical. We were very impressed with the Sag Harbor Inn's website, although they didn't provide any pictures, it seemed like it was what we were looking for at the time. The website makes it seem like this \"beautiful, romantic getaway,\" but when we arrived, much to our disappointment, the inn did not meet our expectations. The front desk wasn't the least bit friendly, and the strange odor while walking up to our room was disgusting to say the least. When we walked into our room, it looked like a cheap, broken down motel. The ceiling was moldy, and what looked to be a once white color now resembled yellow stains. The television dates back 20 years, while the horrific furniture, paintings, and overall design of the place was old and out-dated. When we called to complain about the situation, the front desk did not help us in anyway, and simply said they were sorry they were all booked, meanwhile in the 4 days we spent there, we did not see many visitors at all. Oh, and the \"complimentary breakfast\" included mini bagels, mini muffins, and what looked like old fermented fruit. Not worth the money in anyway! Please do yourself a favor and do not waste your time or money.", "title": "The Sag Harbor Inn Was a Miserable Experience", "helpfulness": 1, "user": "MeagRy", "date": "August 17, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 75609496}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I stayed at Sag Harbor Inn when I proposed to my wife. The local area is absolutely beautiful. Our first floor harbor suite patio opened out onto a rustic lawn and overlooked the harbor. Most of the rooms seem to do the same. The inn itself is very comfortable and warm like a bed and breakfast.", "title": "More than a fond memory", "user": "MacJumper21", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72602764}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Recently, we chose to go back there to celebrate our anniversary and the staff was extremely accomodating and friendly. I apprecaite that and will think of the Sag Harbor Inn first when staying out in this area.", "title": "Believe the bad reviews!!! Totally not worth the money", "user": "chmiss71", "date": "June 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 68170076}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Very grumpy staff, our children were afraid of the woman at the front desk, the rooms are horribly tasteless, the breakfast a joke.", "title": "The only true hotel in Sag Harbor", "user": "JKIMNY", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 65526533}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I stayed for a weekend at the Sag Harbor Inn and had a fabulous time. It was a perfect mix of a true hotel, with a touch of local flare. It is located right on the harbor with great views. Its location is ideal - a few minutes’ drive off Main Street and it is easily accessible. I highly recommend it to anyone else who plans to seek a true hotel in Sag Harbor (in consideration that the other lodging options in the area are more \"bed and breakfast\" types).", "title": "Only stay if you want a sneak preview at seniors assisted living", "user": "newYorkNashy", "date": "April 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 62110922}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The Sag Harbor Inn is a pretty good hotel. My friends and I stayed for a weekend for a bachelorette party this summer and it definitely suited our needs, but it certainly didn't leave me with a warm and fuzzy feeling. We essentially stayed there because it was the best option in the area that didn't cost a complete fortune (aside from the Southampton Inn, which is actually much nicer in almost every way). It certainly wasn't cheap, though! The rooms were fine, although strangely antiseptic and un-artfully decorated - lots of dull colors, pine furniture, a little country bumpkin-ish for a location like the Hamptons. The hallways also resemble an unfortunate housing complex or college dorm and are very dimly lit, with fake flower arrangements other odd decorations here and there- which you would never know from the outside (which is actually very pretty). The breakfast was sufficient - sort of like a motel with little boxes of cereal and some fruit and coffee and stuff - although they had Lender's bagels or something like that, which is totally unacceptable in the NYC area!", "title": "Good, Yet Strange Hotel", "helpfulness": 1, "user": "LJWNYC2008", "date": "October 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 83201477}, {"rating": 4.0, "title": "Waterfront haven", "text": "The rooms were clean though - that I will say. All the mattresses AND the boxsprings were wrapped completely so that was good. And the bathrooms were spotless. They also had sinks outside and inside the bathrooms, which worked well since there were several of us staying in the room. We also had a great balcony that looked out into the harbor.", "user": "philbunt", "date": "October 5, 2010", "id": 82159347}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The staff was relatively helpful - although they completely mixed up our rooms at the start (we worked it out). They were also good about ordering taxis and things, although the hotel is within walking distance of the main street in Sag Harbor so they werent necessary most of the time.", "title": "Truly a wonderful time-- well worth the trip!!!", "helpfulness": 1, "user": "Suesea88", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81878405}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "All in all, for an area that has very few hotel options I'd say this is a decent one, but don't expect to be blown away. It's not luxurious in any way.", "title": "Enjoyable!", "user": "juno1972", "date": "September 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81250649}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The Sag Harbor Inn was a real pleasure. With its wonderful view of Sag Harbor bay it's a romantic getaway for romantics such as ourselves. On arrival they sent us a bottle of fine local wine to our room. The beds were comfortable. The rooms spacious - and of course taht view. Watching the boats coming and going in the harbor is a delight.", "title": "How could this be rated #1 in Sag Harbor??", "user": "Docpm9913", "date": "September 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 80078462}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 6, "average": 15, "very good": 19, "terrible": 6, "excellent": 19}, "aka": "Sag Harbor Hotel Sag Harbor", "slim_ranking": 0.4}