{"user_rating": 4.0, "review_count": 938, "name": "Sagamore", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I had high hopes from the pictures on hotel website. Then we arrived. We had 3 night vouchers from Ideeli that clearly stated that we will get a 'sagamore suite' or higher room. The guy at front desk informs us that all their rooms are booked and they will give me a 'studio' instead. Studio is a downgrade and he PRETENDED like that is what my voucher says I am eligible for. So we fought back and forth on that and I underlined again and again on the voucher that it says 'sagamore suite or an upgrade if available'. He went inside the office to talk to his manager (I guess) and says oh there's a sagamore suite now available but it has two double beds. I had booked a King bed and I had email confirmation for it. But we had nowhere else to go after this so we accepted. He agreed to move to another room on next night.", "title": "One word for staff - CHEATERS. Will spend my money elsewhere.", "user": "a_true_reviewer", "date": "November 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 88689873}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The whole process took about 45 mins and I was hoping for a smooth check-in after the long flight so I can relax. But that obviously did not happen.", "title": "Miki - Bartender Extraordinaire.......He made our get-a-way...delicious..", "user": "BeckyMcCartney", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88676891}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I had difficulty fitting into one of the double beds and one of us kept on falling off! it wasn't funny then. His legs were sticking out since he's quite tall. Then at about 3am I was awakened by our 'same-sex male partners' fighting really hard about a 3rd guy issue. The walls were paper thin and I could not go back to sleep. They fought for hours, slapping each other and one of them was saying 'give me da gun' and I was too scared to call the front desk or cops to complain after hearing that and considering that our walls are so thin.", "title": "Great Location, swanky hotel, beware if you prefer large chain hotels", "user": "NebraskaBugeater", "date": "November 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87927342}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "Next day we moved to another room. Our voucher included the 'sagamore plan' which includes breakfast and it normally costs $13 I believe. Breakfast was CRAP and limited. They had pathetic looking croissants and they kept on repeating it. All I had was Orange juice and some fruit. I asked if waffles/pancakes were included and the server told us that I can order it but it will cost extra. What the hell is the $13 about then??????", "title": "The sgamore is full of culture, wonderful service, and is in a great location!", "user": "Shannonfredel", "date": "November 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 87205299}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel has absolutely no self-parking so valet is your only option and they charge you freaking $37 a day. Are you kidding me?? So we tipped the valet guy a little more and asked if there are any other parking spots around. And he says there are but they all cost more than $30. So we parked in the hotel for first night. Next day we found out that there are many spots with hourly $1 rate and a max of $15 per day. So do your research!! Next day we parked in a garage on 15th street between Collins and Washington – just two blocks from the hotel.", "title": "Hip Hotel", "user": "Seaforth35", "date": "November 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87192448}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "The Sagamore bills itself as \"The Art Hotel.\" It's that and a whole lot more. It sits on Collins Ave. on the same block that holds the Delano, the National, and the Ritz Carlton. So it's in a very good neighborhood, and only a half block from Lincoln Road and about 4 from Ocean Drive. Locationwise, you can't do better.", "title": "Sagamore--great little place among giants", "user": "FloridaTravelmum", "date": "December 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89821561}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The decor is modern, white, design in the style created by the Delano. It has all the amenities--nice pool, great outdoor bar and seating by the pool, well-equipped gym, breakfast buffet and dining facilities, and even a nice quiet (a rare thing in south Beach) sitting area. The back of the hotel \"fronts\" onto the new stone boardwalk that parallels Collins Ave. with the ocean and the beach on the other side. You can walk or jog for miles and scope out all the other classy hotels in the area.", "title": "A very special anniversary", "user": "Abjjarman", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89465721}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The rooms are, I think, all suites with a sitting room with sink, microwave, larger than normal refrigerator, etc, and a couch arrangement that includes a hide-a-bed. Large bathroom with large-walk in shower, and a separate bedroom with spare but nice furnishings. Though the vibe overall is very adult, sophisticated, the room arrangement would be perfect for a family with small children.", "title": "Great Room and Pool", "user": "chuckieNyc", "date": "December 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89212108}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The service was unfailingly friendly. The women at the front desk worked out my late request to be credited with airline affinity miles (something I only learned about when reading their hotel guide in the room and so failed to ask for when I checked in) and the maintenance man who was making some minor repair to the main elevator, insisted on taking our bags for us to the alternate elevator down the hall, making pleasant conversation as we followed him.", "title": "An Artist's Dream", "user": "Noady86", "date": "December 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88964974}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The only slightly off-putting feature is the entry area. It's very \"empty\" To be fair, that's to carry out the art theme and it is a lot like a museum room with space to let you view installations from a distance. It just doesn't convey the kind of warmth that is otherwise a hallmark of the place.", "title": "Great location, noisy accommodations", "user": "Katerina_CA", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 88876458}, {"rating": 1.0, "stay_parameters": "Stayed November 2010", "text": "We have had such a bad experience, I'm not sure where to start. We were traveling as a family of 4 and booked 4 nights ate Sagamore several months in advance.", "title": "One bad experience after another", "user": "Travelerthehorse", "date": "November 2, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 85714436}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We reserved a 2-story ocean bungalow based on the floor plan online, but were shocked to learn when we arrived that the floor plan online is misleading. In fact, the bungalow neither had a sectional wrap around sofa nor a dining table for 6. We were moved (after 2 nights) to a garden bungalow which was the unit actually depicted online as the ocean bungalow. The additional space was exactly what we needed, and what we would have booked if the diagram online had been accurate.", "title": "super boutique resort", "user": "Klaassen", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85584080}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The fold out beds in both units were unfit for sleep. It felt criminal to even expect our children to sleep on the sagging heap.", "title": "Relaxing", "user": "TxBr549", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85183852}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "In our first room, the upstairs sliding glass door was broken (stuck open) and we had to report it 3 times before it was fixed. In the intervening 30 hours, we were subjected to the thumping bass beat from all-night parties at the Delano.", "title": "Perfect, Location,style and size of hotel and brilliant service. Will certainly be back.", "user": "Chadders1979", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84910527}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The clock was set incorrectly and no one could help us reset it.", "title": "Cool Chic in a great location with good size rroms and a lovely pool", "user": "PaulYorath", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84233625}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Just about to check out of the Sagamore after a 4 night stay and after 2.5 weeks in Florida, on arrival stayed next door at the National, which I know well, but on the way back home decided to have a change and move one down on the Collins strip. Have to say I was very impressed and cannot fathom some of the negative comments left by others on here. Special mentions to Lucracia on reception and the guy managing the pool area who was outstanding. The suites are well appointed, roomy and the bed is one of the best i've slept in....ever! Some minor criticism hence the 4 star rather than 5, hey you really got to work for a 5*!!!. Room was on fourth floor but faced hotel next door and we did have winning aircon noise which I think came from the other hotel, irritating on first night only after that didn't notice it. Beach service was a bit erratic and a couple of beds and parasol will cost you $30+, unless you have it included in the Sagamore Plan which annoyingly we were not offered and didn't find out abut until much later on when it was too late. All in all a good hotel in what can be a hit and miss affair in Miami, good location close enough to Ocean D but far away enough to be quiet if you want it to escape the madness.....next time i'm in Miami the Sagamore will be top of the list.", "title": "Upholding the Boutique reputation", "user": "I_SpyUk", "date": "November 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 86944409}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed at the Sagamore for three nights following a trip to Europe and a transatlantic cruise. My wife and I were very impressed with the staff and customer service at this eclectic hotel located directly on the ocean. After researching this hotel on Tripadvisor I was fairly confident we were going to a good hotel with some character but by the time we left we were amazed by the consistently excellent customer service and genuinely helpful staff. My wife teaches who teaches customer service for a very well regarded company is planning to incorporate our very positive experience in her presentations.", "title": "A truly great oasis with exceptional staff and customer service.", "user": "coppermike", "date": "November 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 86936893}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We rate it as one of best experiences we have every had at any hotel we have stayed at. We will be back, and will highly recommend it to our family and friends.", "title": "Thank You Lucracia", "user": "allisonstone", "date": "November 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86897948}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The suite we had was spacious and well organized, exactly as described on the hotel website. Even though it was advertised as a non ocean view room we still had a bit of a view which was a pleasant surprise. Our top floor room located on the fifth floor was a bit tired as the last renovation several years ago but it was clean and very comfortable. The nightly turn down service was a nice touch. The bed and bedding was of excellent quality so we had a great sleep. I expected to hear some street noise given our location near the street but it was not noticeable at all. Upon check in the room seemed a bit dark at night and called down to the front desk for some new light bulbs and within 5 minutes the service attendant had arrived and fixed the problem. The front desk followed through promptly to ensure our issues had been addressed.", "title": "Loved this Hotel", "user": "lk1264", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86568199}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We liked the pool area which was nicely laid out next to the boardwalk. The pool area staff were extremely helpful in setting up chairs and addressing any needs. The background music was just that, background music, so the pool was a nice oasis to relax in with very comfortable loungers. One day we used the hotel's beach area (100 yd walk to the ocean) located directly in front of the hotel on the \"Sagamore Plan\" which included a chair, towels and a good basic breakfast of eggs, cereals, fruits, and breads etc. We found the $14 fee p/person to be a good value but we much preferred the pool area for just lounging.", "title": "Ugh", "user": "rmovers315", "date": "November 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 86186446}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 4, "variance": {"poor": 59, "average": 103, "very good": 270, "terrible": 43, "excellent": 463}, "aka": "Sagamore Miami Beach", "slim_ranking": 0.107142857143, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Contemporary Suite Hotel, guest rooms with individual decors, private art collections; set on the ocean, near convention center."}