{"user_rating": 3.5, "review_count": 2758, "name": "Sahara Beach", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Returned yesterday and dont know where to start. The hotel is very large (can hold up to 3,000 guests), consists of all nationalities. The reception staff could learn a lesson in greeting people, very miserable, no smiles. Let me work through the good points because believe me it wont take long!; The animation team work extremely hard and long hours, yes ok the entertainment is some what cheesy and not to everyones taste. The beach is nice, sandy and plenty of sunloungers. Give the on site photographer a go, they take extremely nice photos, there is no obligation to buy and are reasonably priced. Now the bad points; Reception staff already mentioned, plus not very nice having hoards of kids roller blading through the reception unsupervised or challenged. The all inclusive is a farce, you have to have your photo taken and put on a card which you need to carry every where with you. If its lost, its 15 dinar for another. The card system simply does not work, it is one drink one card. You cannot order a round of drinks for your party, it got really tiresome. Plus the all inclusive runs out at midnight then you have to pay and its not cheap. You are given one huge chunky key to your room regardless of how many people share your room! The rooms are totally basic. The walls are so thin you can hear phones ringing 3 doors down, you can hear conversations in the next room-plus any other noises! The beds are hard, the bedding and curtains are stained. The air conditioning is not switched on until mid June which is no good before that, it got so hot like a sauna in our room, when we left the patio door open we were eaten alive by mosquitos. There is no tv. In the bathroom the hot water comes out the cold tap and vice versa and there is no useable shower, its the old fashioned rubber on the taps and handheld, it either comes through scalding or freezing - nothing inbetween making a shower impossible. The water in the bath is somewhere between yellow and brown in colour - not very inviting. Dont bother putting the do not disturb on your door because the cleaners do not respect it. Between 8 and 8.15am every morning the cleaners were right outside our door, hoovering, banging the hoover on our door, shouting to each other, dragging furniture across the floor in adjacent rooms. If thats not bad enough, the planes at the very near airport roar overhead and you could not sleep through anyway. Also at night it is a very noisy hotel with the late night drinkers and partyers. The worst of the lot is the food. On all inclusive you are supposed to be allocated a table for your sole use during your stay but that is rubbish. On a number of occasions we came in to missing cutlery, food all over the tablecloth and dirty glasses. On 2 occasions we had to clear and the clean the table before we could sit down. The service is very slow and more often than not the dirty plates were not collected between courses, again you have to produce your id card at every meal and for every drink even if you have just previously had one. The food is the worst I have ever tasted, every day same old stuff for lunch and then it comes out again at dinner time. There were loads of flies landing on it. The best part was the bread!!!!! The pizzeria is worth a visit. For a couple of days there was a dreadful smell of raw sewage that hit you as you went to go to the swimming pool. Another pain is the shop people constantly trying to sell you things, it got very tiresome every time you went for a meal. We could not see the evening entertainment because it was held in the Skanes bar which was not equipped to cater for the amount of people they had staying. No way was it busy when we went, one of the buildings were completely shut so I dread to think what it would be like at full occupancy. All we kept thinking was we were grateful we werent there for 2 weeks. There are far better hotels in Tunisia and I seriously would urge you to go somewhere else. This hotel is 3 * rating in the brochure and no way what so ever, it would be very lucky if it were a 2* but travel agents wont tell you this because if you knew the truth no one will go. If you are booked to go, see if you can change, if you still plan to go....dont say you werent warned.", "title": "Dont waste your money", "helpfulness": 3, "user": "tokar", "date": "June 11, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7832414, "likes": {"liked": "— Going home", "disliked": "— 99% of it but mainly the food"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "went with some trepidation, with my wife, and two young boys, (6 and 10),", "title": "Great holiday", "helpfulness": 1, "user": "Lorddowney", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7789830, "likes": {"liked": "— Clean, cool", "disliked": "— Nil"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "All staff were extremly helpful, accomodation was very good, if somewhat sparse. beach was lovely however be aware of the con artists trying to get you on the camel, They are not part of the hotel, and the price will go up, if your kid so much as looks like he will get upset at not riding,", "title": "Lovely place", "helpfulness": 4, "user": "Princess_Nikki_Lou", "date": "May 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 7722028, "likes": {"liked": "— The swimming pools were fab", "disliked": "— Hallways could do with a good re-vamp - but not a complete let down"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed for two weeks, and food was excellent, but became samey after first week, my youngest loved the chips.", "title": "This Hotel is Amazing!!!!", "helpfulness": 1, "user": "pellsnorkes", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7706859, "likes": {"liked": "— the rooms", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Waiter was lovely, very helpful although overworked.", "title": "What A Fantastic Holiday!!!", "helpfulness": 9, "user": "babymidgetgem", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7695818, "likes": {"liked": "— The whole thing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "this hotel is out of this world and it really does look like the pictures in brochures, its great for kids, has 3 massive swimming pools, kids clubs, a big entertainment area for on a night outside all the entertainment is really good.", "title": "excellent hotel", "helpfulness": 8, "user": "lpidcock", "date": "April 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 3.0}, "id": 7390656, "likes": {"liked": "— all of it", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "the food is good and puddings are great.", "title": "not as bad as previous reviews make out", "helpfulness": 7, "user": "welikethesun", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 7381313, "likes": {"liked": "— The Pool area and kids disco", "disliked": "— mossies"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "its right on the beach and theres a beach bar which serves drinks and chips/hot dogs/ pizzas etc and if your all inclusive this is free for you, theres also a bar shaped as a ship on the beach this is nice but not included in all inclusive.", "title": "Never Again !", "helpfulness": 6, "user": "Teeaay", "date": "April 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 7299228, "likes": {"liked": "— Pool Area", "disliked": "— Customer Service"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "theres a zoo next to the hotel grounds which also has a good kids play area in it, the zoo is part of the hotel and is 5 dinars in so about £3.00, theres tennis courts, mini golf that are free, the centre of skanes isnt too far away so you can get a taxi there always waiting outside the hotel or if you want to see the resort go on the noddy train it stops outside the hotel and is a few dinars.", "title": "loved it", "helpfulness": 7, "user": "dena", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7278153, "likes": {"liked": "— rooms cleaned everyday towels,linen,interconecting doors for kids", "disliked": "— no coffee or tea making in room and had to pay after 12."}}, {"rating": 2.0, "title": "Loved the Hotel... Hated the Food", "text": "take euros to tunisiaas the exchange is good and tunisian currency is restricted", "helpfulness": 1, "user": "jlstewart789", "date": "March 27, 2007", "id": 7230286}, {"rating": 4.0, "title": "a few pointers when staying at sahara beach hotel", "text": "we have just returned from staying at this hotel for 1 week half board. the hotel is very big and was only 1/3 full,not sure how service would be affected when full to capacity.", "helpfulness": 9, "user": "globesetters", "date": "March 19, 2007", "id": 7189327}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "the grounds are wonderful with 3 pools and plenty of sunbeds. it is situated almost on the beach.", "title": "Simply wonderful", "helpfulness": 12, "user": "ida7263", "date": "March 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 7011047, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "the hotel is very clean and rooms are cleaned daily, with fresh towels / sheets,only hand held shower & bath is very high to get in/out of.", "title": "We had a fab time- here are some practical points to help you", "helpfulness": 26, "user": "dearlicious48", "date": "February 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6840373, "likes": {"liked": "— our upgraded room", "disliked": "— smokey bars"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2004, traveled with family", "text": "weather was very changeable with only a few days sunshine, make sure you bring something warm to wear. (if going soon)", "title": "good hotel", "helpfulness": 5, "user": "jowarren", "date": "February 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6831795, "likes": {"liked": "— swimming pools", "disliked": "— smoking out side of the restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "-not much to do at hotel if weather is bad", "title": "Loved it so much we went twice!!", "helpfulness": 11, "user": "tracyj99", "date": "February 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6831237, "likes": {"liked": "— Friendly helpful waiters / location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My boyfriend and i booked a cheap week away over the easter holiday. To be honest i wasnt expecting a great deal, this was just as well, the hotel was well below average.", "title": "Butlins, only slightly warmer", "helpfulness": 2, "user": "beachbumMidlands", "date": "May 24, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 2.0, "service": 2.0, "rooms": 1.0}, "id": 7694451, "likes": {"liked": "— Pancakes", "disliked": "— everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The resort itself was gorgeous we couldnt fault it at all, the pools and beach were all very nice and clean.", "title": "oh my god this place is amazing", "helpfulness": 1, "user": "claireEngland", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7693456, "likes": {"liked": "— clean", "disliked": "— room a bit small"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Sadly the rest of the resort was a let down, the interior of the hotel was very old fashioned - it was like butlins in the 70's.", "title": "so good i go back in 2 days!", "helpfulness": 2, "user": "mumadu", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7544993, "likes": {"liked": "— the lovely staff", "disliked": "— going home"}}, {"rating": 3.0, "title": "HHmmm", "text": "The entertainment was standard, we were there for a week and only saw 2 'proffessional' shows', the other nights entertainment were 'guest acts', this involved the same guests getting up to sing everynight.", "user": "Simplesimon999", "date": "May 2, 2007", "id": 7539208}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The poor entertainment meant we retired to our room early nearly everynight. This was another disappointing area, the rooms were very shabby, the bed was made up of two single beds pushed together, the bathroom was filthy, there was very little storage or space to hang things and to top it all there was no tv!", "title": "fantastic holiday will definitely be going again next year!", "helpfulness": 8, "user": "ClaireAde", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7486105, "likes": {"liked": "— fantastic pool area and facilities", "disliked": "— the fact that i had to leave it and come home !"}}], "location": {"country": "Tunisia", "continent": "Africa", "city": "Monastir"}, "stars": 3, "variance": {"poor": 259, "average": 499, "very good": 1004, "terrible": 251, "excellent": 745}, "aka": "Sahara Beach Hotel Monastir", "slim_ranking": 0.104166666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 3.5}, "description": "Near to Monastir and approx 12 km from Sousse ( Skanes – Tunisia). Broad, fine sandy beach. 22.000 sq. m of gardens. A childreńs paradise. Short transfer. Plenty of action and entertainment."}