{"user_rating": 3.5, "review_count": 112, "name": "Saint Dominique Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "This is a nice small hotel. I normally rent a flat in the same neighborhood but my trip was a quick last minute one to visit dear friends so this hotel sufficed. The rooms are small but I had a good price and I do not expect much from such a well priced ( economical ) hotel other than a clean quiet non smoking room.", "title": "Adequate hotel in good location", "user": "Nick2hot", "date": "January 13, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 23516997, "likes": {"liked": "— the price and basic requirements being met", "disliked": "— bad towels and poor pillows"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I would suggest on short trips one should bring their own bath towels since I had only one relatively small towe to dry myself after a shower ( no bath tub in my room l. the pillows were very small but the room was adequate since 90% of the time I was out and only used the hotel to sleep at night. I never purchase the Petit dejeuner since there are numerous charming cafes in the neighborhood that for the same price of the petit dejeuner offer more ambiance.", "title": "Great Location, Decent Accommodation, Overall Good", "user": "twanglerock", "date": "December 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 22603958, "likes": {"liked": "— Location", "disliked": "— Its just an average place."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "One must be prepared to carry one's own luggage up tiny spiral staircases. at these small hotels the staff normally remains seated behind the desk.", "title": "Disappointing", "user": "cla75", "date": "November 30, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 22314675, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "If you go to Paris to do the typical sightseeing this is in a great location. Its a very short walk to the Eiffel Tower, Le Grand Palais, the Seine, all of that. Its also on a very nice street, next to a great boulangerie with plenty of nice shops and good restaurants nearby. There is also an English pub across the street which you can take as either good or bad.", "title": "Don't Bother", "user": "kscatt", "date": "November 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 21471730, "likes": {"liked": "— Location", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I paid 100 Euros a night to stay in this place and it is pretty clean, fairly comfortable and, in my experience, quiet (I see some reviews say they suffered from noise but I had no such experience). For the location I would consider it a good deal and I wouldn't hesitate to suggest it to my friends.", "title": "Great Location", "helpfulness": 1, "user": "mel90210", "date": "October 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 21388466, "likes": {"liked": "— The location", "disliked": "— The quality of the rooms"}}, {"rating": 4.0, "title": "Great Locatiob", "text": "Great Location, just a short walk to the tower.", "helpfulness": 5, "user": "ijm_scot", "date": "February 10, 2007", "id": 6775919}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Staff were friendly and polite.", "title": "The RUDEST people I've ever met!", "helpfulness": 2, "user": "Krissy79", "date": "November 3, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 6051874, "likes": {"liked": "— location", "disliked": "— the staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Room very small but clean,cosy and warm.", "title": "Fantastic location", "helpfulness": 2, "user": "ClaireS-London", "date": "November 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6036596, "likes": {"liked": "— location", "disliked": "— musty room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The location was ideal for seeing Paris on foot. Although the room was small, there was adequate room for luggage etc., and the courtyard was perfect for relaxing in, while the bathroom was larger than expected. The staff were quite friendly very helpful and spoke English well. Breakfast was good and more than adequate. All in all an excellent value.", "title": "Great experience and value", "user": "rienko", "date": "August 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18812620, "likes": {"liked": "— Warm welcome from staff and great location", "disliked": "— Take care about noise in the courtyard, there are rooms facing onto it."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had read Trip Advisor reviews of Hotel St. Dominique and decided it fit our travel plan. We stayed there for 8 days and genuinely enjoyed our visit. Yes, the hotel rated 2-star and the rooms are small. However, we had just completed a cruise ship journey to Norway (round-trip from England), so the room did not seem all that tiny. Our room was on the first floor with a window looking out at the courtyard. The room was clean and serviced every day with fresh towels. And yes, you can see the Eiffel tower from the street right outside the hotel entrance. We took a photo of the street and hotel front from the Eiffel Tower. Of course, as other reviews have noted, the hotel is located very accessible to just about everything you might plan to do during a visit to Paris. The Eiffel Tower was a short walk away, and we visited there often; particularly in the evening to observe the twinkling tower each hour. We arrived in Paris via the Eurostar Train from London. The taxi ride from Gare du Nord was about 12 Euros. The hotel is near metro and train stations. We booked a 3-day pass on the L'Open Tour Bus (unlimited on/off protocol at 50 Paris locations) which could be quickly boarded at the Eiffel Tower or near Les Invalides. This allowed us a wide range of options, including unrestricted boat rides (not available on the 1- or 2-day tickets) on the Seine (the Batobus shuttle boat). This allowed us to see just about every part of the heart of Paris at our own schedule. We were at the hotel during the Bastille Day National Holiday celebrations and were able to enjoy the events at the Eiffel Tower area. We loved the nearby restaurants and occasionally purchased snack items from nearby convenience stores (usually for ham and cheese sandwiches) and a delightful bottle of French Champagne. There is an abundance of nearby cafe's, most with very enjoyable and comfortable sidewalk tables that are full of tourists and local folks. The hotel booked a Yellow Van (only $36) for the two of us to fly out from De Gaulle Airport. We met several of the staff members during our 8-day stay and every one we met was very helpful and friendly, and spoke English. I would not hesitate to stay at this hotel again.", "title": "Enjoyed hotel st.dominique", "helpfulness": 1, "user": "GTCOOPER", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18274992, "likes": {"liked": "— LOCATION, CLEANLINESS", "disliked": "— NOTHING"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Stayed in this hotel in feb '08 for a four day getaway, with my boyfriend. We did plenty of research, and decided to give it a go!", "title": "Good base, great location!", "user": "DublinSwanson", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 16044187, "likes": {"liked": "— Location, Location, Location!", "disliked": "— Wallpaper!!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The best thing about the hotel is the loaction, ten minute stroll to the eiffel tower, five to the metro, a bus stop just up the street. Theres plenty of restaurants and cafes on the doorstep. We ate locally most of the time and were very pleased.", "title": "Wonderful little place with a great location.", "user": "gum57", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16037033, "likes": {"liked": "— It was quiet and had a fantastic location!", "disliked": "— Maybe the lack of a view? But that is nitpicking!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Check in was fine, quick and easy, the staff were polite and casual. We stayed in room 12, which has a fantastic view of the bustling street and at the end, the eiffel tower! Although the room faced out on the street facing the irish pub, it was qenrally quiet. Although our stay was midweek, so i cant vouch for the weekends! but the windows are thick so i dont think noise level would be a problem.", "title": "Nice, except Rm 33", "user": "goldfisharenice", "date": "April 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15041420, "likes": {"liked": "— Cozy lobby and close to Eiffel Tower", "disliked": "— Our room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Cannot beat the location. The rooms look just like the photos as I peaked in all when the doors were left open to air out after guests checked out. Would be nice to request one with a bigger bath. The toilet paper was low quality.", "title": "Quaint and Great Location", "helpfulness": 1, "user": "pickychick", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10030713, "likes": {"liked": "— Great location to walk to sights and resturants.", "disliked": "— The shower was moldy."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Otherwise...friendly helpfull staff. Room was charming/quaint. No real complaints. Loved eating nearby at Al Resturante (have the Truffel Ravioli in Gorgonzola sauce) and La Fountaine de Mars (have the Filet w/ Bearnaise) we loved these meals so much we went back twice! Columbus Cafe across the street had good pastries and coffee to go if you'd like. We took the Yellow Van to fly out from De Gualle. Only $36 for the 2 of us and a max of 6 people in the van. Great deal and speedy.", "title": "Reasonable value for money", "user": "alicattravel", "date": "September 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 10007432, "likes": {"liked": "— Location to attractions", "disliked": "— bathroom size"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007", "text": "Great location but rooms were extremely small, especially the bathroom. I know that's typical for Europe so I guess for the price this hotel is well priced for a good location. It was fine for a two night stay but for a longer stay I'd prefer something a bit bigger - so would look in a higher price range. Staff were friendly and helfup, premises were clean. Some rooms at the back have quite a few tight stairs so beware if you have heavy luggage.", "title": "Average but likeable", "helpfulness": 1, "user": "mook27", "date": "July 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8255747, "likes": {"liked": "— If you have your own laptop wireless internet available at the hotel with cost but there is a Columbus cafe across the street where you can wire for free with food of coffee. Small supermarket and train ticket office also near by."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed 5 days here and I’d say it is pretty average 2-3 star boutique hotel.", "title": "Unprofessional, Inept and sarcastic staff", "helpfulness": 2, "user": "YB18", "date": "July 10, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8090156, "likes": {"liked": "— location", "disliked": "— staff attitude"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "But then as most other boutique hotels it has it own charms and it’s worth the money– I’m sure you can find similar hotels at cheaper rate in the area tho.", "title": "Would definitely go back", "user": "mhigbeem", "date": "May 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7639670, "likes": {"liked": "— Location", "disliked": "— The crazy fabric wallcovering in our room!"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 11, "average": 30, "very good": 47, "terrible": 11, "excellent": 13}, "aka": "Hotel Saint Dominique", "slim_ranking": 0.506413831567, "description": "A 15-minute walk from the Eiffel Tower and 200 metres from Les Invalides, the Champs de Mars and Pont Alexandre III, Hotel Saint Dominique is a former 18th century convent with individually-decorated rooms opening onto a floral patio. Champs de Mars RER Station is a 5-minute walk away and leads directly to Château de Versailles.Each guest room at the Saint Dominique Hotel has a contemporary décor, air conditioning, a flat-screen TV with satellite channels, safety deposit box, free Wi-Fi access and a minibar with free beverages. The private bathrooms are complete with free toiletries, a bathrobe and slippers.Guests can enjoy a daily buffet breakfast on in the breakfast room or on the patio during sunny weather."}