{"user_rating": 5.0, "review_count": 131, "name": "Saint Hubertus Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This hotel in the forests above Cervinia offers the comfort and intimacy of a private hunting lodge, with its roaring stone fireplaces, leather and rustic timber handcrafted furniture and blend of granite glass and timber decor.", "title": "Luxurious indulgence in the Italian alps", "helpfulness": 2, "user": "Intrepidtoo", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124423838}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Rooms are apartment style, spacious, light and comfortably furnished, with hand hewn marble bathrooms, separate sleeping and living rooms and ingenious well equipped kitchenettes ideal for the occasional breakfast or light meal, with fridge, ceramic hobs, dishwasher, sink and a good supply of dining and cooking utensils. Rooms also come with sheepskin rugs, welcome nespresso machines, flat screen tvs, iPod docking stations, free wireless (although ours needed boosting which defeated the local technician but which would soon be fixed) and a good supply of Hermes toiletries, thick towels, bathrobes etc and rustic furniture as well as a fireplace with replenished wood supply.", "title": "Really excellent place with super friendly and helpful staff", "user": "dewgenenny", "date": "February 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124163194}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Public areas, reception, bar and comfortable lounge and dining areas are very inviting, in a modern contemporary style. The resort has a large indoor swimming pool and spa pools with splendid views to Mt Cervino/Matterhorn, sauna and massage areas, as well as a well equipped gym with glass floor over the pool. Timber flooring, with dark slate walls and comfortable white leather loungers, subtle lighting and ambient music make this an attractive retreat after a days skiing. The pool itself has enough toys to ease the aches and pains with waterfall, spa jets, coloured mood lighting and a river current system to provide a thorough work out even for Ian Thorpe.", "title": "An elegant and comfortable retreat", "helpfulness": 1, "user": "muhz", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117243056}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "But these are only the physical aspects which set the tone for the resort. It's the staff, the food and service which make this such a unique and special place. Right from the initial exchange of emails you are made to feel welcome. Booking arrangements are responded to enthusiastically, the driver waiting at the airport courteous and professional and the welcome on arrival very genuine. Staff are friendly, very helpful without being intrusive. Nothing is too much trouble and the car to take you down to the village, to pick you up or even go back for things you've forgotten is an amazing unexpected luxury. They will happily take you to restaurants in the village, collect you or simply take your skis back to the lodge if you want to stay and walk the 500m back later. Perhaps because there weren't too many guests the week we were there, the driver will fetch your skis from the well equiped ski room where each apartment has its own locker and boot dryer, and place them in the car for the trip to the chairlift.", "title": "Unique Setting & Cool New Find", "user": "PatrickCT14", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116954069}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The resort has a small bar area off the main lobby, tended by a very knowledgeable and friendly somelier and which provides a great spot to linger over an aperitif or sample the digestifs, many home brewed in the mountains, after a filling evening meal. No one seems to keep track of how many you try and often the bottle is left for you to help yourself, there's no signing of chits or citing room numbers, you're treated as a house guest and when it comes to check out the extras are always much lower than you anticipate. As well as the drinks, the resort has fully adopted the Italian custom of providing plates of assorted antipasti, particularly the local smoked or air dried hams and cheeses which are left on the bar for you to help yourself.", "title": "wonderful service, beautiful rooms, fabulous pool", "user": "BBVRome", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116229090}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I searched online in many ski towns in Italy and Switzerland before settling on this resort. I was specifically looking for a 2-bedroom suite with a fireplace and terrace-- not easy to find. When I made this reservation in July 2010, the resort sent me a drawing and a written description, including the lines \"...living room that is separated from the bedroom with a large hand crafted wooden sliding door....\" and \"...breathtaking view of the Matterhorn from a private terrace....\" The drawing also showed the sliding door and the terrace. So we were surprised upon our arrival to find that there was NO door between one of the bedrooms and the living room, and NO terrace. Nor did the staff apologize for this blatant misrepresentation-- their only comment was \"oh, those drawings are very old.\" (As of now the drawing has been removed from the hotel website, but during our stay it was still there.) Since we were traveling with our two children, having no door between bedroom and living room was inconvenient, to say the least.", "title": "Nice resort in many ways-- except our rooms were not as promised!", "helpfulness": 3, "user": "AngelaCapeCod", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 98420330}, {"rating": 5.0, "title": "Classy Stay, Warm Staff & Management \"Great find\"", "text": "In addition, the fireplace did not work well- the room filled with smoke unless a window was open (not very cozy!). We were also told that if the spa and fitness center weren't finished by our arrival (which they weren't) that we could use the facilities next door, at the Hotel Hermitage. Only after we arrived were we told that we could use those facilities only when the other hotel guests weren't using them-- in other words, only if we stopped skiing early in the day.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 10, 2010", "id": 63729702}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "The resort did have a number of positives. It is decorated with style; the breakfast (fruit, pastries, cold cuts, yogurts, beverages) was very good-- everything very good quality and very fresh; the staff is generally friendly and helpful, and provides shuttle service from the slopes and village. It was thus disappointing that when we left, one day earlier than originally planned (and mainly due to the rooms not being as promised), and told the management that we were happy to pay for the three nights we had stayed, but not the one night we were not using, the hotel owner saw fit to speak rudely to my husband, telling him \"you are crazy, everyone thinks you are crazy,\" and making vague threats (\"you had better be careful with me\").", "title": "Cervinia's best kept secret", "helpfulness": 1, "user": "Sharondub68", "date": "April 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 61704365}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We arrived at Saint Hubertus and felt like royalty. Our room for 5 had been upgraded to an amazing 4 room, 2 bedroom suite. Each fully granite bathroom had individually colored and hand carved sinks, sitting patio and wonderful views of Mt. Cervino (Matterhorn) Perks were the Hermes' soaps, robes, slippers, linens, fireplace, comfortable sofa bed, childrens table, nicely apppointed kitchenette and a door which closes between the two suites. Perfect for children 6-up as ours enjoyed their own space as much as we did. The endless view from the pools were their favorite.", "title": "Loved it during Summer. Made us want to come back in Winter", "user": "PandBB", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116223371}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Nothing has been overlooked during the 7 year building process of this absolutely stunning hotel. Immediately noticable is the attention to detail both the architect and artisans have put into their work. The newly scuplted arches could rival those of ancient Rome while the 21st century glass stairway angles to the floor above the entry. A dated 17th century chest, noticable in the lobby, was used by the current artisans as a pattern for new chests. Each newly carved chest is complete with an Italian or Latin sentence unique to the artisan who created it. Laying in bed gave us an opportunity to look upward. Our room had no less than 12 big timber supports in combination with an old, castle like fascade of stonework on one side and the otherside met with beautiful lines. As much as we appreciated the craftmanship and beauty of the hotel, we enjoyed meeting the \"staff\" even more. When we left it felt like saying goodbye to family memebers. Betsy, the concierge, made us feel at home. She answered many questions about running trails, hiking trails, massages and local sight seeing trips with kids. As a result, we left with a couple of the best memories of our entire 2 month trip. Thank you, Saint Hubetus!", "title": "Lovely place to relax and enjoy nature", "helpfulness": 1, "user": "Kami07", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115480109}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I stayed in a 'A classic apartment' the first weekend of July 2011. The description of this resort say ' luxury and exclusive chalet apartments in Cervinia' and this is exactly the sensation that you get when walk in,, this bio- resort is elegant but in a sober and natural way as it is built using stones and beautiful wood.", "title": "Amazing hotel with exceptional service", "helpfulness": 1, "user": "Brent94", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104112055}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I appreciated the wonderful bed, the fireplace, the classical music available in the ipod that you find in your room, the wonderful stone bathroom with Hermes products and the kitchen set.I don't usually fancy using the pottery in the apartments rented,,, but this time it was a really pleasure. Also a coffee machine ( nespresso) with complimentary coffee 'capsule' is available. We also ordered in room breakfast and it was good and fresh but I was curious to try their breakfast buffet (16 Euro pp). We had a little terrace with nice ( not wonderful) view. Our friends stayed in another apartment and they really had a wonderful view of the mountains and the Cervino (Matterhorn).", "title": "A new Hotel with exquisite service", "helpfulness": 1, "user": "Swededish", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 103937739}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We only had a little problem with the fireplace because there was a lot of wind outside and we lighted it by ourselves,, result: a lots of smoke in the room and fire alarm ringing ops,,, ;)) therefore I suggest to ask them before lighting the fire because they said that when there is wind they know how to do it avoiding the smoke,,, We used also the swimming pool in the wellness centre. It was nice with soft music and places where to relax. My friend had a visage treatment and she did appreciated it ( not very cheap but I think that you can expect that in a place like that).Hamman and saunas will be available in future. What else,,, parking was easy and free of charge, friendly welcome when we arrived. No problems for the check out they told us we could stay until the evening and therefore we left around 17.00. I do recommend this resort. We stayed there during the summer and it was really good and I believe that in the winter with the cold and snow outside you would appreciated even warm its cosy atmosphere. The photos in their website are 'real'. I will later add some ones taken with my Iphone ( not very good quality pics)", "title": "The best ski holiday accomodation we have ever had...", "helpfulness": 2, "user": "Vineyarder58", "date": "March 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101344713}], "location": {"country": "Italy", "region": "Valle d'Aosta", "continent": "Europe", "city": "Breuil-Cervinia"}, "variance": {"poor": 0, "average": 2, "very good": 0, "terrible": 0, "excellent": 129}, "slim_ranking": 0.027027027027, "description": "Saint Hubertus Resort is a magnificent 4 star luxury Bio Resort with 3 category's of apartments. The Classic, the Superior and the Deluxe. They go from 60 to 120 square meters. Each apartment is if you have your own chalet with breathtaking views of the Matterhorn and surrounding Alps. There is emmense detail in every corner of Saint Hubertusas it was designes by Savin Couelle and created by many artists and artisans. Every material is a natural product. We have complete hotel service with Anything from a free jeep service, heated garage, fresh luxury linens, hermes beauty products and much more for our clients. The understated chic atmosphere with the personalized attention in this beautiful structure situated in the heart of Cervinia Italy is unique."}