{"user_rating": 4.0, "review_count": 102, "name": "Sainte Valerie Hotel", "reviews": [{"rating": 1.0, "title": "Cancelled my reservation 1 month after I made it", "text": "I booked my room for two nights in July. They accepted the reservation in January and then in February, they emailed me and told me they had no room. Be careful when you book. If they can re-rent the room for a longer stay, they will. They did!", "helpfulness": 2, "user": "MaureenM34", "date": "March 4, 2011", "id": 98904122}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Arriving at the gate of the Sainte Valerie the hotel courtyard looked fine and we checked in to find our ground floor room stinking of damp and even the bedding feeling \"wet\" Of course we asked for another room but as it was Film Festival they were fully booked. We were paying €240 a night for the room only. I complained to about 5 different staff but their attitude was exactly the same \"dont care/ wont do anything\" The final straw was when I tried to open the mini bar and the fridge door fell off - I am well travelled and I really dont understand how this hotel got a 4 star rating its appalling. Luckily I only had to stay there 2 nites before moving on.", "title": "awful attitude and very damp room", "helpfulness": 2, "user": "NewcastleFilmmaker", "date": "May 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 64488329}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We had a good stay at Sainte Valerie. Very charming location, nice room and friendly staff. We have been assigned a spacious and nice room, the view was not particularly exciting, but we had a discount for that (Anyway we had a small balcony plus another window in the room and another in the bathroom). Rooms had no numbers but flower names instead, our's was \"Pensée\" and was located in an early 20th century villa detached from the main building (But this wasn't a problem at all because all the buildings were enclosed in the same garden). About the room a small defect was about some furniture (In the bathroom and the balcony) that were made of forged iron purposely unpainted and left rusty (For a \"vieille\" touch), for that reason we occasionally had small orange spots on hotel's bathrobes due to old accidental contacts with rust.", "title": "Nice hotel, perfect location", "user": "HiJackItaly", "date": "August 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38224885}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If I want to find a negative thing this was about breakfast because of two details: 1)Not so varied. 2) Small white insects coming from the overwhelming plants of the garden (But you know, pic-nic effect).", "title": "Great find in a great area!", "user": "cbinnyc", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34818785}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We recently spent four nights at the Hotel Sainte Valerie. Very charming hotel in a great location, friendly staff, well appointed and clean rooms. B&B type feel with the amenities of a larger hotel. We would love to return some day.", "title": "disappointed", "user": "belagneau", "date": "June 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 31549705}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This hotel is a small boutique property located a couple of streets back from the beach front and busiest streets. It has the feel of an old house with mature gardens. It has a small but very nice pool set amid trees and hedges.", "title": "A good alternative to the sea front", "user": "Toofastcat", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 136307708}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The main courtyard of the hotel has beautiful shade from several trees, making it an ideal location for breakfast or a drink, or snack lunch.", "title": "Away from the madding crowd", "user": "applebox", "date": "August 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136091944}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The rooms are nicely furnished, with air-conditioning, which is needed in the heat of summer. My Double with Balcony had a King bed, a lovely bath and shower, and all the facilities we needed. It wasn’t huge, but quite a respectable size.", "title": "Stylish boutique hotel", "helpfulness": 1, "user": "sophie s", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134507529}, {"rating": 4.0, "title": "Very good - great location", "text": "The staff were all very helpful and courteous and served every need very quickly. In general everything went well and was good value. The free Internet is a great plus", "helpfulness": 1, "user": "Michelle M", "date": "July 8, 2012", "id": 133783944}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "A few minus points: They have no restaurant for dinner, so you must always go out. The parking is a little expensive and the outer door is always locked later in the evening, so you have to get the Night Man out to let you in. Small niggles in an otherwise excellent stay.", "title": "Charming, friendly, and great location", "helpfulness": 1, "user": "EvieCostaMesa", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131780116}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Very close to all the great restaurants and shops, but conveniently tucked into a side street to keep traffic noise to a minimum. Beautiful property wrapped in gardens with a pool and fountain. Miriam is the fourth-generation owner of this family property and couldn't be nicer. When we ordered a bottle of wine to enjoy in the gated courtyard, she delivered with a big smile and \"it's on the house\"....too charming. Rooms are spacious, clean and updated. All in all...fantastiqúe!", "title": "Charming & Friendly...dare I say Perfect?", "helpfulness": 1, "user": "nus2", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129505191}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Sainte Valerie doesn't live up to the boutique standing it assumes to have. Rooms are poorly decorated with pretty worn out furniture and the property generally seems to be a bit poorly managed. They lost our prepaid reservations and attempted to charge us twice at a higher room rate, which we managed to avoid after some discussions and producing printed copies of prepaid booking confirmation we brought with us. The property is charming, lovely pool and outdoor dining area (never saw anyone actually eating there), but everything just seemed to be in need of some loving care. Sound isolation in the rooms is non existent, and the place is popular with Russian tourists who can be quite loud at odd hours of the night.", "title": "Could be great, but wasn't", "helpfulness": 2, "user": "lmitravel", "date": "March 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 126159369}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Juan Les Pins in general is not the nicest town to visit in this part of the country. We spent two weeks traveling the south by car spending a couple of nights in several places along our route, and this was the only place that we felt was not even worth stopping at. The town did not have any charm and was full of people baking on the beach and eating hamburgers at generic beach side cafes...If you like to stay on the coast, go to Eze or Villefranche sur Mer, both lovely character towns with a lot to see and do and a more authentic French atmosphere.", "title": "Perfect location & a charming French hotel", "user": "KABDublin", "date": "September 27, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118671671}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel exceeded our expectations. Ok, it's not the most plush, but it is charmingly quaint, romantic even, & its in a perfect location (1-2 minute walking distance from the centre of Juan les Pins yet in a spot that gets ver little passer-by traffic & is very quiet). In addition, the staff are very nice & accommodating, the pool is small but lovely & the bed was really comfortable - so cosy in fact it was very tempting to just keep lying in! I wouldn't hesitate in recommending Hotel Sainte Valerie & I expect we'll be back soon for a longer stay.", "title": "Charming in every way", "user": "TCARogers", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118649019}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The staff were incredibly charming, helpful and welcoming. It was our first visit, though I've heard that every room is decorated in an individual style. The style throughout was contemporary and quirky in places, giving a high-end boutique feel, which was at the same time the very height of comfort. Lovely swimming pool and shaded breakfast area as well.", "title": "Great stay", "user": "rskuster", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117678167}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel is gorgeous and incredibly sweet. We were a couple, and the hotel could not have been more perfect and lovely. It is a very romantic - although a lovely hotel for anyone, the specialty is definitely couples. Have a great trip!", "title": "Incredible hidden treasure", "user": "azandy", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117250855}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "One tip: There is valet parking that the staff does not offer up. And make sure to get restaurant recommendations elsewhere...they will just direct you to the beach. Our best meal was at a seafood restaurant along the park (one block from the hotel) on the side opposite the beach. Unfortunately I don't remember the name.", "title": "Chic little find in Juan les Pins", "user": "velvethaggis", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117224017}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "A warm welcome from the charming staff, a pretty room with a balcony in the sun, lots of thoughtful little goodies in a stylish bathroom and a wonderfully comfortable bed with big comfy pillows.", "title": "Gorgeous SOF/french experience", "helpfulness": 1, "user": "littlefishes", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 115074718}, {"rating": 1.0, "title": "Big problem with booking", "text": "We were only staying for one night this year and enjoyed breakfast on the shady terrace whist observing the staff cleaning the leaves on the plants around the building. That is the level of attention at the Sainte Valerie. Also, July in Juan, during the Jazz festival, the town was mobbed, yet the Hotel, up a side street, yet only a few minutes walk from the centre was quiet and rather discreet.", "helpfulness": 1, "user": "pumpkin1usa", "date": "June 6, 2011", "id": 111838020}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Stayed for a few days during the Cannes Lions Ad festival and very happy to be away from the madness, in this delightful little hotel. Entrance, breakfast and drinks through a pretty shady tree covered courtyard. We had a comfortable bedroom on the first floor in villa 2 which was roomy and cool with a large bathroom off. Bedroom decorated with french antiques and bathroom had separate shower as well as large slipper bath and double sinks. The dining room (which we didnt use) was a slightly odd design in comparison to the rest of the hotel, but not offensive. Service was relaxed but very charming and once asked, nothing was a problem. Breakfast was ever-so-slightly chaotic and not clear between continental and full but it was full of smiles and worked for us. Pretty pool.", "title": "Hands down the best place to stay in Juan-Les-Pins!", "helpfulness": 4, "user": "M&ADallas", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108124318}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 7, "very good": 31, "terrible": 3, "excellent": 53}, "aka": "Hotel Sainte Valerie", "slim_ranking": 0.0384615384615}