{"user_rating": 4.5, "review_count": 315, "name": "Saint Paul Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel looks a lot nicer than it really is. The customer service is horrible. Booked a room with 2 double beds and all they would offer is a king and air matress.Final soulution is wait while they make up a room with 2 twin beds aka roll aways and they had the gaul to want me to pay extra.", "title": "Don't Bother", "user": "Tom P", "date": "April 26, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "location": 5.0, "service": 1.0}, "id": 128659015}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rude I would recomend anywhere but here!", "title": "Will be back...", "user": "pansey521", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128402162}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I ended up having to find another place to stay.", "title": "Only place to stay in downtown St Paul", "user": "Soonergolf", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128304830}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "If you want to feel pampered this is the place. Great rooms, staff is ever so friendly. Food in dining room is awesome. Within walking distance to Science Muesum, Xcell center, Micky's Diner.", "title": "Fabulous hotel, fabulous location, fabulous staff.", "user": "dakbail", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127828309}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Im a weary business traveler and tired of the bland chain hotels where you never know if you'll have a volleyball team or marching band on your floor. This hotel caters to people who like refinement but without an attitude, and you won't find school groups in residence. The staff is amazingly helpful and friendly. Rooms are a bit small, like in any older hotel, but I do not really need much room when I'm traveling. Only negatives were these - It was difficult to regulate the room temp through the thermostat so I ended up having to open the window to cool it down. The other negative was a remote for the tv that worked sporadically. Otherwise, the bed was very comfortable and the room quite clean. Having aveda products and a soft robe is a nice touch too.", "title": "Amazing Stay", "user": "63moose", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127566828}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I stayed at the St. Paul for our 25th wedding anniversary (we are from Wisconsin) and had a wonderful stay on the first weekend of October. We walked all over from the hotel, took a carriage ride, and had a great stay. Friendly service and a beautiful suite. We loved our weekend there!", "title": "Beautiful, historic hotel in a great location!", "user": "Joan H", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131747964}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We have been going to the St Paul hotel for years. We dine there frequently. We have also slept there a few times .We like the hotel it is older and has a wonderful ambience. Normally the food is very good and the waitresses are excellent. We did have one however who seemed to be somewhat prejudiced or inclined to want to stereotype people She was very unpleasant. I do feel they should be careful who they hire.For years we have had wonderful food and very good waitresses.However I think they hired someone new who is bigoted . So that did rather ruin our experience.", "title": "Excellent cuisine and older hotel with ambience", "user": "CACTUSWREN4", "date": "June 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131544711}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Having grown up at the Broadmoor in Colorado Springs and having spent a lot of time at the Brown Palace Hotel in Denver I can say that this hotel is a throwback to the elegant hotels of the late 19th - early 20th centuries. Everything is so top notch from the valet, Ryan, to the check in (thanks Meagan) and the coffee barristo, Larry, that we didn't want to check out. Reservations are confirmed (or made after taking their suggestions for the numerous delicious restaurants in the area), and other suggestions are offered if you'd like to take advantage of the fun things to do the area such as paddle boat rides, museums, parks and of course, just exploring. If you're going to Saint Paul and want a true 5 star experience at a wonderfully elegant hotel, this is your best bet by far. We will be back!", "title": "5 star all the way; fabulous downtown location", "helpfulness": 1, "user": "MHL8488", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131293968}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The superb service we received from every hotel employee encountered was incredible...and the services were all delivered with smiles and genuine friendliness. The staff was outstanding!!!", "title": "incredible service", "user": "Steve S", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130883375}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The rooms were lovely, very clean, and comfortable; the food at the restaurants was delicious, yet it was the excellent and winning service that impressed us the most. The hotel was filled to capacity during our stay, and yet, no request was too difficult and we were all made to feel like truly welcomed guests. We were with small children and the staff acted with such kindness towards them, too, and consistently displayed a true willingness to make our stay has delightful as could be.", "title": "We've never slept better!", "helpfulness": 1, "user": "apples0ranges", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130708365}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "There are other really good properties in the Minneapolis-St. Paul area, but if you are committed to staying in St. Paul, this is the top hotel. It's set upon the square in downtown St. Paul, just a short walk to the Excel Center and Convention Center.", "title": "Top Hotel in St. Paul", "user": "gjborca", "date": "April 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127404599}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The doormen are always great. The amenities are nice. The St. Paul Grille - the bar/restaurant is really good and a nice place to grab a drink.", "title": "Worth it.", "user": "railCarol", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127357129}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I visit St. Paul several times a year and always stay at the St. Paul.", "title": "Parking is a Problem", "helpfulness": 1, "user": "Sid K", "date": "April 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 127061003}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was my first visit to this hotel. It lived up to my expectations, except that of the 5 times I needed their shuttle, it was available only 2 times. That was my only disappointment.", "title": "A wonderful wedding splurge", "helpfulness": 3, "user": "sco22512", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126999678}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The food and service was excellent, and the room was clean and well stocked. The staff was very friendly and accomodating (except for 1 person) This hotel was worth staying at.", "title": "This is a grand place to stay.", "user": "RandD S", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126996496}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Mu husband and I stayed here for a friend's wedding. It was wonderful. We enjoyed the hotel bar nightly. They have great selection of beers! Room service was prompt and delicious.", "title": "Wonderful Stay", "user": "LizzChicago", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131980622}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I stayed at this lovely old hotel with great service for three nights. An impressive lobby lead to clean and tasteful rooms with Aveda toiletries. Everyone went out of their way to help us. We both especially enjoyed the free town car service, which I utilized many times to get around town and certainly saved us the expense of renting a car. Gave four stars instead of five because the bathroom could have used a fan - after a long hot shower the ceiling dripped with water and my allergies indicated there might be some residual mold or mildew. Everything else was perfect.", "title": "Lovely hotel", "user": "Melissa C", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131829889}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I've stayed at this beautiful hotel with family or alone many times over the past 5 years. It is beautifully appointed and every employee is wonderful, never arrogant or stand-offish, ready to give help if you ask. The rooms are always very clean, the very comfortable beds made with lovely linens. What wed me to the St. Paul Hotel was on our first visit when my 17 year old daughter was to meet me at O'Hare and fly out to look at a school in MN and I missed my flight. I was quite upset and phoned the hotel to tell them she would be arriving alone and I later and that she had not been to that city or travelled much on her own. They were extremely kind and calming on the phone and I arrived at the hotel at 1am to my daughter sleeping comfortably (in the beautiful room). She related to me how the hotel staff greeted her expectantly and cared for her from the moment she arrived, through dinner until she was settled. They had my allegiance and this kind of care has been their trademark", "title": "Most wonderful hotel...", "user": "BekkiSS", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131758902}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I went to a concert at the Xcel center and chose to stay at The Saint Paul hotel due to its location and great reviews. We were greeted with a smile as we pulled into the valet area and were promptly checked in. The room was very well maintained and the bed was extremely comfortable. The bathroom was small ( very common in older hotels) but had everything we wanted. We ate at the St.Paul grill and found it to satisfactory but nothing extravagant. We will stay here again on our next trip to the Twin cities.", "title": "Great hotel and great location", "user": "CK202120", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131753226}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Looked elegant but room was stale and stank of old cigarette smoke. Service good and food excellent but couldn't get past the disappointment of the odor of the room. The only thing that will get me back is the Sunday brunch!", "title": "stale room", "user": "LYNNETTE R", "date": "June 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 131748573}], "location": {"country": "United States", "city": "Saint Paul"}, "variance": {"poor": 15, "average": 27, "very good": 82, "terrible": 6, "excellent": 185}, "slim_ranking": 0.111111111111, "description": "Consistently ranked among the country's top hotels, with a ranking of 106th Best Hotel in the entire United States by Cond'e Nast Travel Magazine 2011 Readers' Choice Awards, The Saint Paul Hotel continues to provide luxurious accommodations and legendary service to visitors of the Twin Cities. The Saint Paul Hotel is known for its old-world charm and European inspired elegance, and accommodates the most discerning business and leisure travelers every day. Our great location, premier services, style and sophistication make The Saint Paul Hotel one of the Midwest's finest lodging experiences."}