{"user_rating": 3.5, "review_count": 200, "name": "Salad Buri Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Okey resort. We went there direct from the pier and we took the deal they offered. Nice and clean room, not so big room, but okey. We had a room with a balcony and a jacuzzi. The staff tried the best to make us feel comfy. Very strange that they have not fixed the road up to the resort. But the beach and the pool was fantastic. We liked our four nights here. They missed to fixed early breakfast when we had a early takeoff from the resort. The WiFi didnt not work 100%.", "title": "okey resort", "user": "Suffringirland", "date": "February 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97550308}, {"rating": 4.0, "title": "What a TREAT !!! Fantastic", "text": "They were fully booked on New Years so we only stayed the last night of our holiday before returning to Bangkok. We had the Deluxe Suite with private (2 pers.) Jacuzzi on the balcony. A beautifull room, great beds, great seaview, quiet, huge bathroom, balcony is great and the Jacuzzi is better.", "user": "Connor69ams", "date": "January 9, 2011", "id": 92316990}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We were on a hill but if you want the golfcars bring you up/down to the bungalow.", "title": "stay away from salad buri resort !", "helpfulness": 2, "user": "bbk17", "date": "December 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 89629213}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "If you can, go stay there (even only for one night) and enjoy the good life.", "title": "Enjoyed a delightful stay in this hotel", "helpfulness": 1, "user": "Aisyahrzk", "date": "December 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 89214558}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "STAY AWAY WHEN EVER YOU CAN, STAY AWAY FROM THIS HOTEL!!", "title": "Amazing Resort", "helpfulness": 2, "user": "kr1styn", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 89201707}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We only stayed one night at this resort but really wished we had for longer. We really liked our room and just hanging out in the pool all day. The bed in our room was very comfortable, however at first it felt a bit clammy without the air con on. As well there was a strange smell coming from a oil burner in the bathroom that we didn't care for.", "title": "Loved the Pool!", "user": "LMcC123", "date": "May 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 107454070}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The beach was nice and we were able to do a bit of snorkeling the first day, however it's a very shallow bay, so you need to go quite far out to swim comfortably and it can be a bit hazardous at low tide, if your not looking where your stepping because of the urchins. The food we tried on this beach was just OK, but we didn't really get a chance to go to many places before we left.", "title": "Wonderful Resort", "user": "X_Amgirl", "date": "April 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 105532661}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Cons: stairs up to units can be a bit hazardous at night in areas that are unlit, it is fairly uneven in some areas and easy to catch your foot on the stone steps. They provide flashlights and I suggest you take them out with you if you won't be back until dark. Windows could be sealed a little better, I set some clothing out on the wide sill near the TV and in the morning I found a swarm of small insects around them. (Not very pleasant)", "title": "Nice but ...", "user": "SamandAmelie", "date": "April 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 105396284}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Two adults and three teenagers. We stayed in two separate lagoon houses. The setting was very pretty with a private Japanese garden with frogs and water lilies. Each house had a private pool and sun deck facing the ocean and the common pool. Rooms were pretty, although the mini bar could be better stocked up. Our cleaning girl obviously didn´t think we needed any chocolate or snacks, so she just left that part out. Hmm. The common pool is big and good for play and lap swimming (20 m). There are two more pools beside it, 15 respectively 10 meters. No fitness! Not even a treadmill:( The breakfast was basic but fresh and the staff was polite and helpful. A few nights the hotel arranged barbecue on the beach. The beach is about 700 meters long. Unfortunately for us the tide was unusually low when we where there so it was not possible to swim in front of the hotel, and the talked about reef 100 meters out was above water. We walked to the other end of the beach to swim, but it was still just knee high all the way until there where coral and sea urchins. On the positive side, if you had shoes on you could walk all the way out to the snorkeling, but better rent a canoe. This beach is secluded, meaning there is hardly anything around except other resorts, and no shopping close by except for sunscreen and beach games and some basics. Big mountains behind this beach seems to hold moist so it was not fully sunny until around 2 -3 pm. We did our own excursion to some water falls. It was fun. On the whole it was a nice stay.", "title": "Postcard perfect", "user": "nurse_liz83", "date": "April 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 105343151}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Nice resort, nice lagoon villa room, but we encountered quite a few problems: 2 hours to get the room ready, private pool dirty (worms inside) even if they tried to clean it after we complained. Also, not enough hot water for the jacuzzi. Still, the room was quite luxurious and very well furnished. The beach is not the nicest one on the island but the BBQ on the beach and sunset make up for it.", "title": "Amazing beach, very quiet and calm,", "user": "amirIl", "date": "March 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 100360630}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 22, "average": 40, "very good": 65, "terrible": 24, "excellent": 49}, "aka": "Salad Buri Hotel Koh Phangan", "slim_ranking": 0.549450549451, "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Salad Buri Resort & Spa is set on the unspoiled and secluded beach of Haad Salad, once known as the ancient pirates hide out of the north west of Koh Phangan, Suratthani, Thailand. Where Southern mixes Northern, Salad Buri Resort & Spa is offering both surrounding mountain cliff and panoramic sea view vista.Our Accommodations are decorated in rich beautiful teakwood accents, spacious living quarters and excellent sea view verandas. All rooms featuring king size beds with limited twin beds, balcony or terrace."}