{"user_rating": 4.0, "review_count": 3252, "name": "Salisbury Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Big room (1702) with two beds, two walk-in closets, microwave & fridge. We were reminded how big the room was when we visited our son in a hotel he was staying in on 45th Street. Location is great - close to Central Park and subway stations at either end of the street. Didn't take breakfast - there are many alternatives within a couple of minutes walk. Staff were friendly and helpful, but special mention must be made for John - a true gentleman.", "title": "Good place to stay", "helpfulness": 1, "user": "Localshopper", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155980567}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I you're looking for an ultra modern boutique hotel with a flash lobby and a bar to hang out in you'll be disappointed. If you're happy to stay in an older building, with bigger than average (and very clean) rooms, you'll be fine.", "title": "Great location", "helpfulness": 1, "user": "mini001122", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155952881}, {"rating": 5.0, "title": "Pretty good place", "text": "Just returned from a 5 night stay here and would recommend it. Great location, lovely suite, really comfy beds. Slightly retro bathroom, but the bath filled up quick and the shower was easy to use. Friendly and helpful staff. Well worth it.", "user": "ojaum", "date": "March 28, 2013", "id": 155910801}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "The hotel is pretty good. It is rather clean. The staff is very kind, they're quite helpful. The breakfast is not included, however it costs only 6 dollars, and the area holds a wide numbers of markets where you can buy veggies, fruits, juice and etc. The location is the best, too close to the most important landmarks as well as three subway stations near by.", "title": "Great base for your stay", "user": "cbibs", "date": "March 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 155848633}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Great location . Room 1716 big room . Very clean . Beds made and clean towels everyday . No bar or restaurant . But deli next door but one and across the rd.", "title": "Excellent value for money and fab location in the big apple", "helpfulness": 1, "user": "bigbadjohn_9", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155844791}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "Title says it all, great hotel in a fantastic location a 2 min walk from Central Park & 5th Avenue. Bed & Breakfast well worth it, plenty to choose from every morning. Rooms are huge! Especially for New York as they are usally tiny. I have stayed in a 5 star in New York and actually preffered the salisbury to that hotel. The recepetion staff were polite, friendly and very helpful, and I will definately return to the salisbury. Any questions just message me & I will respond asap. Hope this helps!", "title": "Loved it - Great Location for exploring NYC", "helpfulness": 1, "user": "nicola86", "date": "September 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41607705}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The Salisbury is in a great location, the hotel is within walking distance to time square and central park. The hotel rooms are a very large and a bit dated but they are very very clean. We had five adults stay in one room and there was plenty of room. This hotel is a $60.00 cab ride from LGA with the tip and tolls included. We booked the limo in front of the hotel to go back to LGA for $100.00 tolls included and the tip is optional. When we go back to New York we will be staying at the Salisbury.", "title": "Location,Location,Location", "helpfulness": 1, "user": "BIGDT", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40305367}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Nice, clean & close to everything. Some of the staff could have been friendlier. Room was huge. Lifts were very slow & creaky. Would stay here again. Try Green Cafe a few door's down for breakfast.", "title": "Close to everything.", "helpfulness": 1, "user": "nikkidavid", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 40246132}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "+", "title": "Its ok!", "helpfulness": 1, "user": "EugenStockholm", "date": "September 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 40148883}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Location", "title": "the salisbury hotel made our stay", "helpfulness": 2, "user": "ceer", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39494362}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We travelled to NYC in June with our 20mth old daughter. The location of the Salisbury was excellent (midtown 20mins by foot, Central Park 5mins by foot)- we walked almost everywhere and barely had to set foot on the subway (although the nearest subway was only at the end of the block). The price we paid was excellent, far less that we had expected to pay in NYC and the quality and cleanliness of the hotel were great. Our hotel \"room\" was more like an apartment, with a huge bedroom (2 big beds plus chairs and dresser and enough room for a cot for our daughter), walk in robes, bathroom (small, but with shower/bath, toilet, sink, and all clean), then a dining area and small kitchen corner (with bar fridge, sink, coffee maker) and also living room area with sofas and flatscreen TV. Bedroom and living/dining areas both had airconditioning. The room was cleaned daily- we had no complaints. Breakfast was a buffet at an additional cost. The food was varied and tasty (although not all healthy, ie a donut, pastry and muffin section). We found the staff at reception and in the breakfast room helpful, polite and attentive. We could hear some traffic noise from our room, but nothing that disturbed us. I am not sure where in NYC you can't hear the traffic noise! There were no child/family activities available, however we came to NYC to see the city and not hang out playing in the hotel. Overall we were very happy and would stay without question at the Salisbury again should we visit NYC in the future.", "title": "Great location, bargain price, very satisfied", "user": "DJKleine", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75289158}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Salisbury for five nights as we toured around New York city. Our room on the sixth floor was huge with a great firm bed, sparkling white linens and a good air conditioner in the window. The location was terrific - a block from Central Park and down the street from Carnegie Hall. The staff was helpful with restaurant choices, getting us taxis and tickets for the hop on hop off bus. The hotel is older but in good condition and offered a cold continental breakfast for $6. We recommend Angelo's pizza cafe two doors down - we ate there two nights and all the food was very tasty and reasonably priced. Also recommend the health food cafe a block and a half down 87th St. for tasty, inexpensive lunches and dinners. The only thing I missed at the Salisbury was having a coffee maker in the room but it did have a safe.", "title": "terrific value", "user": "VictoriaTravellover", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75082917}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We've booked through expedia and got a nice deal. The reviews here say it all. We've stayed for 11 days, and I asked for a room with a kitchenette (microwave, sink and fridge). It was wonderful to be able to have breakfast and a light dinner at times in the room (great save). (king bed rooms don't have kitchenettes - we didn't try the buffet) It reminded me of my experience at Ballys in Vegas: old, outdated, clean, excellent beds and HUGE rooms! We had a flat screen TV and good sunlight from the window. Air conditioning worked very well. We were walking distance from Jazz at Lincoln Center, Carnegie Deli, Times Square and Central Park; Whole Foods and another supermarket, that I won't remember the name. Plus, whatever we could imagine, like, \"I need scotch tape\", there, in the corner, \"I need band aid\" drugstore across the street. Subways on each corner (yellow and orange lines) YOU CAN\"T BEAT THE LOCATION! We walked a lot, everyday, everywhere, all day and felt extremely safe, even when coming back from a dinner or concert late at night. We didn't do the broadway shows (not our thing) but I can imagine coming and going walking to the theaters. I am recommending it and definitely staying here again! Oh, did I mention? HUGE ROOMS!!!", "title": "GREAT VALUE!", "user": "Kafkiko", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73506056}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our 8th wedding anniversary was made even more wonderful with a complimentary upgrade to a 1BR suite at the Salisbury Hotel. The location just 1 block from Central Park, 1 block to 7th Avenue was convenient to everything and only a $6 cab ride to Times Square. The only negative would be that parking is not onsite... but a nice discount is provided at a garage 1 block away on 56th St. The bellman, Kevin, was kind and took our bags to the room while we went and parked the car. Huge, comfortable king bed with crisp linens, great waterpressure even on the 12th floor, flatscreen tv's and a very comfortable large couch. We wish we could have stayed longer!", "title": "Wonderful location! Fantastic 1BR suites! Will stay again!", "user": "VTDANCR", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73418425}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "D&J from VT", "title": "Everything you require", "user": "JoziGnL", "date": "August 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73260683}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed for the weekend of the St Patricks Day parade. Really big room, very clean and so very central. Having a fridge in the room was great. Staff very helpful. Would definetly recommend this hotel to anyone visiting NYC and we will be returning for sure!", "title": "Excellent location, highly recommend this hotel", "helpfulness": 1, "user": "MayoBridie", "date": "March 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "location": 5.0, "service": 4.0}, "id": 155636400}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed at the Salisbury hotel for 11 nights and would certainly recommend travelers stay here. The staff were very friendly and always on hand to help. The rooms were comfortable and clean. Having a microwave and fridge helped cut food costs - grocery store right across the road. Within walking distance of Central Park, Times Squares and shopping precincts.", "title": "Comfortable and great location", "helpfulness": 2, "user": "sartravel1", "date": "March 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155568131}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "They were very friendly and really good sized rooms. The staff couldn't do enough for us. I suppose the only thing that I was disappointed with was that there isn't a bar but that didn't spoil my stay.", "title": "Good hotel in a good position", "helpfulness": 1, "user": "RussKirk", "date": "March 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155445753}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "I had read great reviews before booking, so was expecting a good hotel and I was not disappointed! I cannot fault the hotel; excellent location; big, clean rooms; brilliant service; clean facilities...", "title": "Book it! Fantastic hotel.", "helpfulness": 5, "user": "vanessajbrown", "date": "March 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155096620}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We thoroughly enjoyed our NYC trip, and would definitely book the Salisbury for next time.", "title": "Great stay with the family", "helpfulness": 2, "user": "dtrcg", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154925735}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed a second time at the Salisbury for 4 nights and we just love it! You can't beat the location and quality that you get for the price. All the staff were very friendly with us and helpful and we plan on staying there everytime we go back to New York City:)", "title": "Love the Salisbury", "user": "rphsweet", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78323643}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Always a bit nervous about budget hotels in Manhatten, but the Gothic fronted Salisbury was one of the best of its sort. A faded but hardworking and beautifully located place to stay just opposite Carnegie Hall and a block from the Park. The three of us has a junior suite, two enormous rooms on the 17th floor, comfortable modern kingsize bed and a double sofa bed. Crisp fresh bedding. Flatscreen TVs both rooms, bathroom built to last some time ago but clean, and classic looks. Modern fridge, microwave and coffeemaker in kitchenette. Loads of walk in closets (they hadn't been decorated recently). Rooms were at the back away from street, so quiet (except one of the aircon units was a bit clattery). Breakfast room on 3rd floor served mountains of bagels, toast, doughnuts, boiled eggs, fruit, juice. Just polystyrene cups and plates. Suspect hotel will soon be renovated. The toilets off reception (very friendly staff) are a wonder of new marble and latest hand dryers. Someone has a vision!", "title": "Great budget hotel by Central Park", "user": "LizhLondon", "date": "September 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 78189247}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "stayed at the salisbury with daughter and granddaughter for two weeks room fantastic had fridge and microwave. beds were very firm but good.all staff were very helpfull and would sort any problems within minutes buffet breakfast was good with plenty of choice.location was perfect within easy reach of most places we wanted to go to.flight home wasnt till evening but they looked after our luggage till we went to airport even fetching bags from our room all in all a superb stay.", "title": "best value hotel i have stayed in", "helpfulness": 1, "user": "margfran", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77548888}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We got at the hotel at 10.30PM after flying for 10 hours to get there. We booked for 4 nights. When we arrived and wanted to check in, the lady at the reception said they had a little problem and asked if we wanted to wait in the lobby (which is very close to the reception). We heard her and a male staff member calling other hotels and asking if they had a room. After 5 minutes she said 'we are looking for a room, sorry for the inconvenience, it will take a few minutes more'. After about 10 minutes they found the Flatotel on 52th Street for us. We would stay here one night and check in again the next they. They assured us we would really have a room the next day and we left by taxi to the Flatotel. The lady at the front desk said we should save the cab tickets so they could return the fare. Next day we went from the Flatotel back to Salisbury, again with a yellow cab and we saved the tickets. They returned the money and we could leave our bags in the storage room at the concierge. We went to see the city and returned at about 8PM. We asked the reception for the key, we got a room at the 7th floor. We asked the concierge for our bags and he would bring them to our room.", "title": "Great location, friendly staff and great room!", "user": "Claudie82", "date": "August 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77212853}, {"rating": 4.0, "title": "Location, location", "text": "We went up with the elevator and saw we got a really big, nice room. It was a room with seperate bedroom with TV, little kitchen (well only microwave, coffeemaker, sink, refrigerator with freeze compartiment) and off course the living room with an TV about 42\" big. We wondered if the hotel gave us this room cause they couldn't give us a room the first night. The concierge came with our bags about 5-10 minutes after we asked him to. Oh, and the lady of the reception explaned to us (after we asked) that they had a problem with piping on one floor. So we think, because we arrived so late the first day, they had just gave away all of the rooms and had some guests send over to an other hotel (like us).", "user": "IsabelTM", "date": "August 27, 2010", "id": 77151475}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel is in a great location and walking distance to Central Park, Times Square, Rockerfella centre, Broadway, 5th Avenue and access to subways.", "title": "Great location", "helpfulness": 3, "user": "michelle d", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154746186}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The staff at the hotel were polite and helpful during our four day stay.", "title": "Reliable, Clean, Friendly NYC Hotel", "helpfulness": 5, "user": "MKPBloomington_IN", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154719778}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Rooms were clean and very spacious with a fridge and coffee maker. Decor of the hotel is dated although it has lots of character.", "title": "Great location", "helpfulness": 2, "user": "michelle d", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154687554}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "There is a deli three doors along from the hotel that sells just about every thing you need and does great sandwiches and panini's to grab and go.", "title": "Great location and value.", "user": "familytravel38", "date": "March 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154671545}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Like many reviewers have suggested to ask for a room at the back of the hotel of 57th street and an upper floor. We were on the 8th floor and weren't bothered by street noise at all", "title": "Staff is at your service", "helpfulness": 1, "user": "Lisa J", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154645743}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This hotel is in a great location, with Midtown sights and Central Park within walking distance, and basically that's the best the hotel has to offer, despite the somewhat exaggerated rave reviews from others.", "title": "Rundown but adequate", "helpfulness": 1, "user": "fraire", "date": "October 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 45676527}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We had a 'double double' overlooking 57th. It was noisy ( no double glazing) but there was construction work on the other side, which the lady at the front desk was honest enough to tell me about when I initially asked for a change of room. We didn't move anyway ( too much hassle), and my elder daughter was thrilled to see some of her favourite tennis stars each morning setting off to Flushing Meadows from the Parker Meridien across the street.", "title": "Nice and great location", "helpfulness": 2, "user": "KAHHH", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45365595}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The room we had was big, as other guests have already said, and there was a handy kitchenette in the entrance . While the beds were very comfortable and the room clean, the overall impression was that the whole place needed an overhaul or at least a lick of paint. The bathroom fittings looked like they'd been installed by you own brother-in-law in 1982 !", "title": "Great Hotel.", "helpfulness": 2, "user": "TufftyTickler", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45336900}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The in-house breakfast was OK - plenty to eat if not a huge choice - and at 4$ it means you can eat quickly +cheaply and get out to do the sights.", "title": "More than we expected.", "user": "froxface", "date": "September 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45055529}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "All in all, our stay was fine, and the staff were certainly helpful (the bell hop arranged transportation to Kennedy Airport for us with a very good car/driver on our final afternoon) but we have already got better deals on (much) better hotels in (lower) Manhattan and would probably go back to them instead.", "title": "Great comfortable hotel for businessman", "helpfulness": 1, "user": "Phil43", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44960541}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The hotel is fine, basic, but clean and near the best stuff to see inc. Central Park, Broadway, etc.- it is functional (friendly staff), no extras, $6 continental breakfast (very basic, but more or less fresh). But the parking they have an arrangement with is a rip off. It's called Quick Park , is off-property 1.5 blocks away (8th & 56). 2010 prices: $28 per day, $38 for SUV or pick-up (pricey, but this is NYC), $8 for 1st half hour or less posted. We stayed for 3 days. I was charged a full 4th day, even though I arrived to pick up my vehicle less than 1/2 hour after time we arrived (so 3 days plus 1/2 hour on 4th). Charged complete 4th day! Rip-off! attendant said he can't charge less than full rate, blamed it on computers. Be careful, just like loads of places, people in NYC, they have tricky ways to steal your money. Best value: Broadway's Promises, Promises with Sean Hayes, the C-train, Central Park in the rain, Gray-line (for 1st timers) to get bearings, people-watching, NYTimes, Angelos Italian restaurant next door to the hotel", "title": "functional hotel - beware of their parking garage though", "user": "somerville7", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 76937482}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "To the newby: There are many ways businesses and people take you for extra $$ (after a while of this it all adds up). Look carefully at receipts and question extra fees/charges on restaurant bills etc. Many attractions offer suggested prices. You don't need to pay that amount, suggest an amount, any amount, even nothing, and that's what you pay.", "title": "Great Value & Super Location for exploring New York", "user": "The_Sids_9", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76621588}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "There are a lot of neat things around the hotel, which is its biggest selling point, it's very basic though, which is fine if that's all you want from it.", "title": "roomy hotel in great location", "user": "Gill310", "date": "August 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76556933}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We will stay at another hotel next time, only because we will want to upgrade a bit.", "title": "Awesome Hotel for Large Family", "helpfulness": 1, "user": "fourdarlings1997", "date": "August 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 76504509}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Booked double double room and upgraded to suite so a great start to the holiday. A good functional hotel which we used as a base to explore NY. All we needed was a clean bedroom and bathroom to use after a hard days sightseeing and it was provided. This hotel is a perfect base to explore NY.", "title": "We will recommend this hotel to our friends!", "user": "yarmouthgal", "date": "August 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75737646}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were very pleasantly surprised by this hotel. Our visiting friends from England stayed for 4 nights and we stayed for 2. Both of us were upgraded to spacious suites. It is obviously an older property and the furnishings were somewhat outmoded, with the exception of a first-class bed and large, flat-screen LG TV's (1 in each room of the suite). Each suite had a kitchenette with fridge, microwave, and sink. There are window air conditioning units, which worked fine, but when we found one unit to be a bit noisy, it was immediately replaced with a brand new, quiet model. The staff was extremely friendly and helpful and there is a professional keyed concierge. The location is very convenient and, having booked the rooms well in advance, we obtained a very attractive rate ($179/nt.). The lobby is small and not particularly impressive but we would be hard-pressed to find any material fault with this hotel. It is truly a diamond in the rough!", "title": "Diamond in the Rough", "user": "DCRE", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79537421}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Salisbury has a great location and nice big one bedroom suites at a decent price, But the bathrooms are in dire need of an upgrade. They have ground-in dirt and don't feel clean. The door on ours was peeling badly. Also, one fo my pet peeves, lightbulbs were all 40 watt, even the three way bulbs. We only used the staff when we checked in (I'm from NYC and know my way around), but they weren't particualrly friendly. And, don't be fooled by the \"continental\" breakfast \"voucher\" as they call it. It's $6. We didn't use it since NYC diners are the way to go for breakfast. Wifi is $12 a day.", "title": "Yes, the rooms are big....", "helpfulness": 1, "user": "WendyWal", "date": "September 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 79494255}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I'd say the Salisbury makes you feel like you would have been better off staying at a reliable chain. We will not stay there again.", "title": "Great location & value in NYC", "user": "Terence W", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 79380504}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed for 4 nights in a 2 roomed apartment that was huge by NY standards, the room was very clean,comfortable & spacious with a huge bathroom. We were on th 16th floor but there was still plenty of noise from the street below, but hey that's New York for you. The staff were helpful but not obtrusive and the location of the hotel was great, being on West 57th just between 5th & 6th Avenues & about a 15 min walk to Times Square. There was a good Italian resaurant about 2 doors away & plenty of other eating/drinking establishments nearby. We only had breakfast once but it was good value & plenty of choice & nearby restaurants provided room service if required. Overall, very good value for NY & no complaints.", "title": "Don't miss this jewel.", "helpfulness": 1, "user": "dpwages", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78669030}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "My 4th stay at Salisbury.....it may not be as well known or as luxurious as some, but the location is great....employees strive to be helpful. NO sign of bedbugs. Location is unrivaled. Anthony's Oven Baked Pizza, one door down, has better spaghetti than Little Italy.", "title": "A pleasant surprise!", "user": "FastTrackDxB", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78409444}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Perfect place in the middle of manhattan, close to the park, time square and everything inside walking distance.", "title": "Close and cheep.", "user": "P-Staffan", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 43434013}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The rooms in this place are falling apart and all the room doors look like they have been crowbared open at some stage in there lifetime. It looks like a really bad motel from the inside and basically the place needs a major paint-job! The security guy, who is pretty new, was fantastic, very helpful and friendly! That's one of only two positives about this place, the other being the location and that is what you pay for here, with its extortionary prices for a room in this place - we only stayed here because of tripadvisor reviews (which were very misleading). Dont stay here unless u like being ripped off or you are just looking for a good location!", "title": "What a dump!!", "helpfulness": 1, "user": "Silvermouse82", "date": "September 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 42757674}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This hotel was in a great location, subway entrance on the same block and a couple of blocks from Central Park. Huge rooms, easily fit 4 adults and 2 children in our suite with room to spare. Outdated decor, but very clean and satisfactory (and I'm picky!)", "title": "Fabulous hotel!", "helpfulness": 2, "user": "EClem", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42487263}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The staff was extremely helpful, and even got us a cheaper ride to the airport on our way home without us asking! Directly across the street from Starbucks, many gourmet and/or cheap restaurants on the block, also a 24-hour grocery store one block over, what could be better than that in case there's something you need last minute? Overall, we were very impressed and happy with the hotel. Would definitely stay again!", "title": "It's all about location", "helpfulness": 2, "user": "harblinger", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 42226510}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "**$4 Continental breakfast every day (didn't try) $4 for first 15 minutes of internet usage in lobby", "title": "Everything you want - except exciting design", "helpfulness": 1, "user": "My-View-on-things", "date": "September 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 41632491}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Perfect hotel. We arrived at the hotel 5 hours early coming from a cruise. Al, the Doorman, was very helpful checking in our bags and getiing us checked in early so all we had to do was get our key at 2:00. The room was a very large two room suite with two flat screen HD TV's and two queen beds. The room was extermely clean and very well appointed. The location is great, across the street from Carnegie Hall, 2 blocks from Central Park, and within a 15 minute walk to Times Square. I would recommend this hotel to anyone.", "title": "Great Hotel", "helpfulness": 1, "user": "TexastTraveler_9", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44293047}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The location is brilliant if travelling with small children and you want to be near the park, 5th Avenue, Times Square and the subway. Rooms are very outdated but cleanliness could not be faulted. There is so much room for the family to spread out when exhausted from seeing the sights. The only downside was the rude front desk staff when we checked in. Despite booking a king suite, we were rather rudely told that it was only a request that could not be met as none were available and that we would have two doubles. This was despite the person checking in immediately before us changed from a king suite to a suite with two doubles! New York was full of incredibly friendly locals and this was certainly the exception. On the other hand, the doorman on our last day was brilliant, organising everything including a limousine ride to the airport - a huge hit with the kids.", "title": "Huge rooms and fantastic location", "user": "mopette", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 44289844}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Lovely hotel, room was clean and big by New York standards. Did not get disturbed at night by street noise, which to be honest, I expected with it being New York. Very nice hotel with access to Central Park literally round the corner, a beautiful location.", "title": "Would stay there again", "user": "pea1985", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 44209257}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We scored big time with this hotel. We had looked at the Sheraton and a few others but luckily opted for this. 2 subway stations within about 100 yds to all main sites, Times square about a 10 minute walk away, great continental breakfast (Bagels, doughnuts, cereal, toast, coffee etc for $4!!) Yes, the rooms are a bit dated but we had one of the smaller ones and it had...2 double beds, aircon, ensuite, kitchenette with microwave, fridge and sink as well as 2 huge walk in wardrobes. you are far enough from the main drag to be not too noisy but close enough to walk easily to eg rockefeller plaza, 5th avenue 1 block away, central park 2 blocks, also main bus stance for greyline bus tours about 10 mins away in times sq. Eating out, we were there for a long weekend and found the Cafe Europa on the corner of 57th/7th (100 yds from hotel) great for breakfast, lunch or just a coffee. go past the europa and you have a world beating deli to stock up your fridge for any snacks you may need. across from the europa is the Brooklyn Diner, great for evening meals, or just one block down 7th ave, try the 'BenAsh' cafe, traditional Jewish/New York menu and vibe, not expensive...well, not as expensive as a lot of places around. PS, Little tip, Empire State is totally overrated, Much better/less busy is the 'Top of the Rock at the Rockefeller plaza. Also, dont pay a fortune to go to liberty island, we jumped on the Staten Island Ferry (Free!) and went right past liberty island and the statue (Its on the starboard side on the way out and the port side on the way in. Once we got to staten island, we went round to the departure door for the trip back. Total time, under an hr. Tip 2, as the Staten ferry leaves Manhatten, stay at the back of the boat for some great shots of the downtown skyline. Everyone else will be jamming at the front to get the photos on the way back. Best holiday of my life, great hotel. PS try and get to the Museum of Natural History next to Central Park..", "title": "Great Hotel, Fantastic Location, will definately be back", "helpfulness": 3, "user": "aberdeenangusthebull", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43973392}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I would have no hesitation staying here again. We wanted to see new york and this was the perfect place to start from. Right on central park.", "title": "Exactly what we needed.", "user": "Randy_marsh", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43651458}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We have stayed at the Salisbury on 2 occasions, the first in 2011 and more recently January 2013. The hotel is in a fantastic position, walking distance to Times Square, Central Park and most major attractions in Manhattan, Subway station on the corner, great inexpensive eating places close at hand. Small deli/supermarkets next door and across the road so you can grab something to eat from there if you don't want to spend too much on food, Starbucks across the road as well for that all important morning cup of coffee. The hotel is old but has heaps of character, rooms clean and comfortable and HUGE by NY standards, our first stay we were a family of and had plenty of space for all of us and the luggage in a suite. Only suggestion is to ask for a room at the back of the hotel as the street noise can be a bit loud...It is NYC after all. This is our NY home away from home...we'll be back.", "title": "Position, position,position", "user": "Bronwyn57", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154575126}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I've been going to Salisbury since the mid-1980s, and it hasn't changed a lot. That's good in my view. No longer are the breakfasts free, but for $9 you get a great variety from a continental breakfast, including fresh fruit, coffee, black tea, fruit juices, bagels, pastries, boiled eggs, cereals, and waffles. We would eat here for the convenience and stuff ourselves before going out on the town!", "title": "Good location, good deal", "user": "SlamDuncan", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154555025}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The rooms are large and beds are comfy. Most of all, I like the location. In addition to being near Central Park, Salisbury is across from Carnegie Hall and the Russian Tea Room. Another little secret, it's across from The Burger Joint at Le Parker Meridien, where perhaps the best burger in NYC is sold. Cash only, and hidden behind the lobby, but ask for it and the doormen will tell you where it is.", "title": "Amazing", "user": "Nicolelduggan", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154542987}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Everyone we met was friendly, even the people at The Russian Tea Room. We stumbled across it after eating our great burger. Because it was still early in the afternoon, they let us in without a reservation. And we sat in Dustin Hoffman's seat from his role in Tootsie.", "title": "Great price, great location", "helpfulness": 1, "user": "cannottravellite", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154518227}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Also, Rockefeller Center is within walking distance, as well as Broadway and Fifth Avenue. Enjoy NYC. The bus stops are around the corner from the Salisbury, and the subway station is just a few steps away on 7th.", "title": "Great location at a competive price", "helpfulness": 2, "user": "GlenG1", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154353870}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 89, "average": 290, "very good": 1636, "terrible": 43, "excellent": 1194}, "aka": "Salisbury Hotel New York", "slim_ranking": 0.336343115124, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}