{"user_rating": 5.0, "review_count": 282, "name": "Saltair Inn Waterfront B&B", "reviews": [{"rating": 3.0, "title": "Uh, oh. Looks like I'm outnumbered", "text": "I have to separate my impressions of this inn from my impressions of the innkeepers. Matt and Kristi are everything you'd want in a B&B owner -- welcoming, informative, and friendly, without being intrusive. Their inn, however, leaves a bit to be desired. Maybe my less-than-stellar impression is due to the fact that our room fronted on West St., not facing the bay. It was warm enough that we wanted to keep the windows open and the (admittedly light) traffic on West was an annoyance. The room (the Cottage room) was average in size and appointments. The bed, on the other hand, was great -- very comfortable. Breakfast was pretty standard B&B fare, except for the blueberry pancakes, which clearly were made from a mix. Bottom line: slightly above average B&B, quite a bit above average price -- $240.", "helpfulness": 5, "user": "jbullock47", "date": "October 2, 2011", "id": 118863531}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My girlfriend and I stayed at the Saltair Inn this past weekend in the Master Suite. I was completely blown away by the quality and cleanliness of the suite. All of the rooms were immaculately clean and smelled fresh. The view from the bay window was incredible, looking out into the calm ocean.", "title": "Fantastic Bed and Breakfast", "user": "myxalot", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118630300}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Kristi's cooking was delicious, especially her peach cakes. I also appreciated that there were home-cooked brownies 24/7 and a never-ending supply of snacks and beverages.", "title": "Simply The Best Place To Stay in Bar Harbor", "user": "johnmac999", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118535624}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Finally, the owners themselves, Kristi and Matt, were incredibly kind and helpful. They patiently walked us through the highlights of acadia and gave us helpful information on what sites to see.", "title": "Great B&B", "user": "sgmmdt", "date": "September 18, 2011", "detail_rating": {"location": 5.0}, "id": 118262730}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I would definitely go back to this place again.", "title": "Excellent!", "user": "75travelgirl", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118169852}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I went away for the first time since our daughter was born and were looking forward to a combination of relaxation and activity. Matt and Kristi ensured that we had the perfect stay! The location of the Inn is perfect-a short walk to all of the shops and restaurants and a short (uphill) bike ride into Acadia. The breakfasts were not only delicious but a great way to start each day by getting to know the other guests and gain valuable insight into Bar Harbor from Matt and Kristi. They have great advice on everything from restaurants to hiking trails. I recommend the Saltair for anyone looking to relax and unwind in the most beautiful waterfront setting imaginable!", "title": "Wonderful getaway!", "helpfulness": 1, "user": "lorijill", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115339470}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My girlfriend and I were at the Inn for four days in the beginning of July. My son was also there in a separate room (the Chartroom, which had its own bathroom and a gas fireplace). Matt and Christy run a wonderful Inn and were very helpful with directions and things to do. We stayed in the master suite on the first floor. The room was very large and was divided into three sections- a bathroom with a whirlpool tub and separate shower, a large bedroom with a gas fireplace, and a sunroom with fireplace with a gorgeous view of Frenchman's Bay and Bar Island. Breakfast was from 8 to 9 am and was always very hearty and good. There is off street parking. The Inn was within about two to three blocks of downtown, an easy walk. In all it was a great time and I would certainly go there again if we return to Bar Harbor.", "title": "Delightful Inn", "user": "rick416", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115301359}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "As a sidelight, Galyn's and Michelle's restaurants were both very good and worth a visit. However, don't bother with La Bella Vita restaurant. The food was mediocre and the service was worse. As an example, when asked about several selections on the wine list, our waiter's knowledge of the list was that \"most people prefer red wine with their pasta!\" I would not return.", "title": "lovely, great location, quiet inn, delicious breakfasts", "helpfulness": 1, "user": "travel99boston", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115049699}, {"rating": 5.0, "title": "A pretty and friendly B&B with yummy breakfast and a great location", "text": "We stayed here based on the TA rating, and were not disappointed. There are a few benefits that we will add to the already detailed list of positives by other posters. First, it is really quiet WITHIN the inn. You never hear voices from other rooms or TV's...the layout is such that no two bedrooms abut each other...there are bathrooms and hallways in between, so I really liked how private each room felt. Second, the photos on the website don't do justice to the awesome location of this inn. You can walk down to the beach from the back yard, and be in the water (which was cold) or walk across the sandbar at low tide (which is fun.) We never drove into town...we were in town, but just on the edge, and loved that we easily got off the highway, drove into the inn's parking lot (plenty of parking here), and it was a 5-15 minute walk to whatever restaurant/shop we were going to...which was a lot faster than sitting in the traffic that begins one block from the inn. And even though we had a room which faced the front, and I am a very light sleeper, the street noise is really non existent by the time you go to bed...there is nobody out in this town after 10 p.m. Finally, Matt and Kristi do a perfect job of providing helpful advice and friendly hospitality in a very down to earth way. They have children but we NEVER heard them and our room was over their living quarters (we think.) ...the most well behaved kids! Hiking Acadia was wonderful, the innkeepers knew every trail and gave us great advice on which ones to do, and where to park, based on our preferences, and let us take their trail guidebooks with us for the day (which really came in handy). For evening fun, we recommend Improv acadia in town. The troupe is pretty professional and the club is only a couple of blocks from the inn. Overall, a wonderful weekend in every way.", "helpfulness": 1, "user": "tiredmom298", "date": "July 4, 2011", "id": 115024712}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I'm not a morning person, but I made it to breakfast each day (almost) for the delicious meal and the good conversation with the hosts and other guests. I also was NOT a \"B&B\" type person (I like hotels), but after compromising with my husband to go there for just a few nights, I didn't want to leave!", "title": "The nicest Inn I've ever stayed in.", "helpfulness": 2, "user": "tippy2010", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 114966984}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Just back from a fabulous visit to the Saltair Inn in Bar Harbor. The Inn is very nicely situated just 3 blocks from the center of town and directly on the water. We loved the deck views of the water and the adirondack chairs just at water's edge. An added bonus was the interesting tidal sand bar which allowed you to walk over to Barr Island twice a day.", "title": "The best Inn visit of our long lives!", "user": "mprofita", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117031154}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "The Inn was immaculately clean and very nicely appointed. Our room was very attractive and comfortable though we spent most of our time out in the common areas and outdoor deck. Our hosts, Matt and Kristi, are wonderful, warm hearted people who made us feel right at home. We particularly enjoyed chatting with them and getting their helpful tips on making the most of our island stay. Their absolutely charming and adorable daughter Katie who helped to serve our breakfast was so delightful to interact with! We were served an excellent, different, full breakfast every day of our stay which was both delicious and nicely presented.", "title": "Spectacular view!", "user": "Jill4408", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 116671190}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "As a middle aged couple we've stayed in many, many B&Bs over the years but this was clearly the best experience with the most gracious hosts!!", "title": "Wish our stay was longer!", "helpfulness": 2, "user": "stadejm", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115687215}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Loved it here! Matt and Christie were great and very helpful! Next time I will splurge and get the master suite!", "title": "Wow - we cant wait to get back.", "helpfulness": 1, "user": "anthonygasbarro", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115371826}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Our stay at the Saltair Inn was amazing. We arrived late at night and found a personalized note from Matt and Kristi waiting for us, as well as fresh cookies and hot drinks. Our room was the cottage room, which I believe is their smallest? At any rate, it was plenty large for us! We loved the chromotherapy jet tub and the room was impeccably clean. The bed was very comfy. The following morning we were treated to a full gourmet breakfast - delicious!!! Matt chatted with us and shared his local knowledge and was full of ideas of what we could see in our short time there. We decided to check out Acadia national park and he gave us a park pass which was very thoughtful, as it saved us some money.", "title": "The only place we'd stay in Bar Harbor again", "helpfulness": 1, "user": "davenyc115", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115366778}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My husband and I took our first vacation to Bar Harbor in August and spent 3 nights at the Saltair Inn. Matt and Kristi are fabulous hosts -- friendly, welcoming, full of helpful tips and suggestions for touring/hiking Acadia, and experiencing the best Bar Harbor has to offer. Sunsets down at the water in the adirondak chairs were one of the highlights of our amazing trip. You're centrally located so you can walk to everything in BH but also get to experience the historic district of West Street. Bar Island is directly in front of the inn so you can walk over at low tide or sit back and watch as others make the trip.", "title": "We loved this Inn! Great views, warm hospitality!", "helpfulness": 1, "user": "unclawyer", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117539980}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed in the Acadia Suite. The decor is a bit dated so if that bothers you, be prepared for that, but the room is huge (three separate rooms actually) and provides for lots of natural light and a view of the water from the front sitting room. The shower is shockingly small for a room this size. Unless you are a contortionist, you can forget shaving in there as it provides just enough room to step in and out. The bathtub facing the bathroom fireplace would be a nice treat during the colder months. We would probably try a different suite next time.", "title": "Incredible view and incredible hosts", "user": "HalzBoston_Ma", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117240775}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The amenities are fabulous for an inn this size. Breakfasts are delicious. Great to have a community fridge, snacks and drinks available 24/7 for guests, coffee, an endless supply of books, guidebooks and touring info, CDs. The CD player in the Acadia suite is very old so if music is your thing, may want to pack some Ipod speakers.", "title": "Can't ask for anything better", "user": "LKN-NC", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117201418}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We definitely plan to stay again on our next trip to BH! We felt like we'd made great new friends and can't wait to get back there. We have stayed in fancier inns, even on this trip, but this one was our hands-down favorite.", "title": "Home Away from home", "user": "maggiesmom23", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117163115}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "As a couple, we stayed 5 days in the Harbor View room.. The weather wasn't always cooperative, but that's Maine. If you were up early enough, from either the bed or the sitting room, you got an incredible display of the best of mother had to offer. All hues of red. You were then treated to a second viewing as the sun set. This room had a sitting room, so another couple and us had cheese and wine in the sitting room while the rain was pouring. The rooms were clean and well appointed. The hosts were incredibly nice and helpful. Every one of the the hiking suggestions was spot on. .You really felt at home. Make sure you don't miss Thurston's Lobster Pound in Bernard. We went twice. I will be back. So much more to do on Mt. Desert Island.", "title": "Great choice", "user": "jake17", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117031802}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 3, "very good": 9, "terrible": 0, "excellent": 269}, "aka": "Saltair Inn Waterfront Hotel Bar Harbor", "slim_ranking": 0.0588235294118, "description": "Three blocks from the center of town, the Saltair Inn offers luxurious waterfront suites appointed with king-size beds, elegant private baths, multiple gas fireplaces, TV, and private sitting rooms overlooking the Bay."}