{"user_rating": 4.5, "review_count": 208, "name": "Samoan Outrigger Hotel", "reviews": [{"rating": 5.0, "title": "Perfect place to stay with family - clean, friendly and good value.", "text": "I stayed at the Outrigger with my husband and two children for two weeks in January. We were given the family room which was plenty large enough for the four of us, decorated an a pretty blue and with an ensuit bathroom. We opted for no AC and found that fan was sufficient - an extra one could be requested perhaps. I particularly appreciated the staff who were always friendly and able to assist with extra requests. The pool was a real asset with the children - particularly during the day when it was too hot to sightsee. The kitchen was clean and well appointed. There are a couple of reasonable local resturants nearby and a short taxi trip to Apia centre (4 tala). Also, the close proximity to hospital, and National University of Samoa was handy.", "user": "little021", "date": "January 26, 2010", "id": 54380478}, {"rating": 3.0, "stay_parameters": "Stayed January 2010", "text": "Based on the online reviews, we booked a weekend stay at the Outrigger Samoa and we were very disappointed based on our expectations from the reviews--we had ensuites with A/C. They messed up our reservations and we were forced to pay for 2 separate rooms thus defeating the purpose of staying in one double room for two people with 2 twin beds to save money. The towels always smelled like sweat as if they had not been washed properly in detergent. The water pump apparently did not work one day and I was caught in the shower with soap and forced to rinse with near scalding water (usually they have no hot water). Most disappointing was the quality of the pool--it was murky and clearly it had not been cleaned on a regular maintenance schedule and did not have proper chlorination. This was important to us because we always stay at hotels that have pools when on vacation. If you don't care much about the little things, than this hotel will do. But for all the pump up in the reviews, its very misleading and as frequent weekend travelers to Apia, we would not stay here again. For just the same cost, we could have stayed at nicer local hotels with better quality rooms and equipped with A/C.", "title": "Below expectations in quality and cleanliness, thus overpriced", "user": "PagoSKY", "date": "January 24, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 54285277}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "If you don't care about the heat and don't need an A/C, then its an ok place to stay--so long as you can request for clean sheets and towels.", "title": "Loved Stay at Outrigger", "user": "-Wandering-Teine-", "date": "January 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53917797}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "The Samoan Outrigger was the third place we stayed at in Samoa. It was well worth the money that was paid. There is a security guard at night and there is a receptionist at the desk 24 hours a day. Stayed in the downstairs a/c rooms. They were very clean,comfortable and cosy but as other reviews have mentioned, there is not always hot water (apparently they run on solar heating?) and also as other reviews have mentioned b/fast is very light.", "title": "The Samoan Outrigger is ABSOLUTELY WONDERFUL.", "user": "KarmenAuckland", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53244035}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "But I do agree with the majority of the reviews so far, that the Outrigger provides exceptional service and is your home away from home. I will miss the ladies that work there. They were very delightful to talk to, as well as miss the other travellers that were staying there that our party got to know.", "title": "Very tidy place, friendly atmosphere and a great variety of rooms", "user": "Sunebune", "date": "December 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51650420}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I spent 5 weeks at the Samoan Outrigger while doing my medical elective in Samoa (March/April 2010). I shared a room with a colleague and was very impressed with the cleanliness and service including the friendly staff who went out of their way to make our stay as enjoyable as possible. The rooms are serviced daily and the communal kitchen was more than adequate for self catering. It is the perfect location for med students doing their electives as it is only a 5min walk to TTM hospital and right around the corner from a supermarket and a great italian restaurant! It was such a treat coming home from a hot day on the wards to the inviting crystal clear pool surrounded by the beautiful tropical gardens The owners, Claus and Laena are a wonderful couple who really make you feel welcome and right at home. We met many other medical students staying at various other hotels/motels and I certainly feel we made the right choice. If you are staying in Apia for several weeks it is worth paying a bit extra for the location, cleanliness, pool and awesome staff! Will definitely be back in the future!", "title": "The perfect base for a long stay in beautiful Samoa!", "user": "ursulavdh", "date": "June 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 67325225}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The outrigger was an excellent choice for our stay in Apia. The staff were SO friendly, always helpful with questions, asking about your day, etc. we made some friends with the guests there too.", "title": "Cheap and cheerful", "user": "Kiri13", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 66815461}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "The pool and garden were great for relaxing/sunbathing. It has its own kitchen with everything you need to self-cater too. The hotel itself is very clean and tidy. Breakfast was buffet style fruits and toast with coffee/tea.", "title": "Clean, friendly, safe and comfortable home away from home for Medical students", "user": "l_dcAuckland", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64660421}, {"rating": 4.0, "stay_parameters": "Stayed April 2010", "text": "They also have a security guard out the front at night who takes a note of the number plate of the taxi’s you take into town etc, so if you lose anything (or go missing) there is a record of it. Nothing happened during our trip but it provided peace of mind.", "title": "Greay Smile! Great Stay", "user": "Kiwiwest", "date": "May 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 63270481}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "We stayed in the ensuite room (non-air-conditioned), which was really comfy and clean. HOWEVER really noisy as the windows opened right onto a main road. So very noisy at night – I’d recommend packing some earplugs (handy for anywhere in Samoa though actually).", "title": "A perfect hideaway and home away from home for medical students in beautiful Samoa!", "helpfulness": 1, "user": "jennylouise85", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60541225}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "We stayed at the Samoan Outrigger Hotel for 4 nights. After reading the previous reviews, I must admit that the reality was a lot different from my expectations.", "title": "Didn't live up to expectations", "helpfulness": 2, "user": "Angelco", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 71175862}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "We stayed in an ensuite room with airconditioning. The room was very basic... the toilet continued to overfill and ran all day and night, the airconditioning (don't know how people can cope without it!) was ancient and noisy, heavy footsteps from the floor above and the barking dogs on the street definitely impacted on my sleep and general enjoyment of the property.", "title": "Wow!! Fantastic, fantastic place", "user": "Thomastheyankengine", "date": "July 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 69664366}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The Samoan Outrigger does have a couple of redeeming features. The pool was a great way to cool down and the included breakfast, although very light, was nice with tropical fruit, toast with butter and jam, coffee or tea. We also met some nice fellow tourists on the deck overlooking the pool in the evening.", "title": "Friendly atmosphere", "helpfulness": 1, "user": "OttawaCanFamily", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68700661}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I think that budget travellers and large groups would find the Samoan Outrigger a good option, with a communal kitchen and bbq. However, if you like a few comforts and a really relaxing Samoan holiday... maybe look elsewhere.", "title": "Home away from home", "helpfulness": 1, "user": "rn670", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68612822}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I chose the Outrigger based on reviews here and a recommendation by friends and was extremely happy with my experience. I booked a room for 2 nights upon my arrival but decided to come back for another 2 nights at the end of my visit to Samoa. This is a very well-run hotel. I stayed in rooms 3 and 4 and paid $140 Tala ($55 USD) per night and found the rooms extremely clean and well-prepared. These rooms share a joint bathroom and shower facility. The sheets are fresh daily and even ironed! The pool is well-maintained and offers a welcome relief from the tropical heat. I LOVED the breakfasts--local fresh fruit. The staff is very professional and can help advise tours, sightseeing. They even have a rental car--I should've used them. I met some interesting guests while there. This place combines all of the positives of a classy hotel with prices comparable to a youth hostel. It's easy to catch a taxi out front 24/7 and its an easy walk to downtown. The hotel doesn't have air conditioning in these upstairs rooms but I felt that the fan was adequate. My only complaint is that people in Apia burn their trash and when there is no wind the smell can be obnoxious--but this is not the hotel's problem. I look forward to my next trip to visit Klaus and Suzy!!", "title": "Home away from home", "user": "rn670", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67634394}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "As a group medical students, we chose the hotel for its location right next to the main hospital in Apia and we would definately recommend it to other medical students travelling to Samoa for their electives, and other travellers too. We were extremely well looked after by Claus and his team and the service was always friendly and helpful. The hotel and rooms were impecibly clean, the fruit buffet breakfast was delicious and plentiful and the pool was extremely inviting in the samoan humidity after a morning in hospital! We stayed in a 3-bed room with fan which was perfect for what we needed and not too hot, although air-con rooms are available. Although our room price was slightly higher than the other main competitor round the corner, we all agreed that our room was extremely good value for money and it was worth paying a bit more for the beautifully clean room/sheets/towels, pool and friendly service. We have extremely happy memories of our time at the Outrigger in Samoa whcih we will treasure forever and we hope to re-visit sometime soon!", "title": "A fantastic friendly hotel at very affordable prices and a great place to stay for medical students!", "user": "sarsdazzle", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 59926298}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We enjoyed our stay at the Outrigger Hotel. We loved the setting of the old colonial building. The staff were very helpful and quick to smile. The tropical fruit served for breakfast was fresh and full of flavour. There was always fresh bread to toast washed down with plenty of good hot coffee or tea. It was nice to come \"home\" after a day out and relax in the pool for a while before going out to one of the nearby restaurant. It was close enough to the town centre to walk and an inexpensive taxi ride home. We would recommend the Samoan Outrigger Hotel to all our friends.", "title": "clean, comfortable, very helpful staff, great breakfast, close to town", "user": "MrsComet", "date": "March 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58944915}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "There are many things which can make or break a holiday, but one .of the most important is where you stay. The people we meet can make a big difference also, the Samoan Outrigger in Apia scores highly on both counts.", "title": "leading by example", "user": "paddy91Auckland", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58418518}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "For both myself and my partner the Outrigger seemed to have the perfect balance of a warm, approachable and efficient group of people, as well as very comfortable and attractive accomodation.", "title": "Perfect Place for Medical Students", "user": "CiliaAuckland", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57656645}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "The breakfast which was always looked forward to,.was served out the back of the house on a large covered deck area surrounded by the amazing gardens.", "title": "A Really Great Spot", "helpfulness": 1, "user": "SJW_Traveller", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56624362}], "location": {"country": "Samoa", "continent": "South Pacific", "city": "Apia"}, "stars": 2.5, "variance": {"poor": 5, "average": 17, "very good": 55, "terrible": 4, "excellent": 127}, "aka": "Outrigger Hotel Apia", "slim_ranking": 0.137931034483, "description": "The Samoan Outrigger Hotel is located in Motootua only 15 min. walk from downtown Apia and only 5 minutes walk from the national hospital. The Samoan Outrigger Hotel offers budget accommodation \"with a touch of style\" Clean and affordable rooms with ensuite and without ensuite. We also have traditional Samoan garden fales overlooking the swimming pool. The Samoan Outrigger Hotel is surrounded by a lush tropical garden. All rooms with ensuite and AC renovated in February 2012. Come and enjoy a cold Vailima on our new pool deck.WI-FI available."}