{"user_rating": 4.0, "review_count": 133, "name": "Samsara Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Samsara is a brand new 5 storey hotel set in a peaceful garden behind the Vaishali Hotel off Thamel Marg in the popular tourist area of Kathmandu. Rooms are quiet, spacious, with very comfortable beds, plenty of pillows, reverse cycle a/c and spotless well appointed bathrooms with ample hot water. They have cable tv, fridges and broadband internet. There are great views of the mountains from the upper floors and roof terrace, and a sunny terrace for breakfast. The lobby has a small bar and restaurant with starched tablecloths and very helpful staff.", "title": "Samsara, a new gem in Thamel", "helpfulness": 19, "user": "Intrepidtoo", "date": "November 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6184708, "likes": {"liked": "— Convenient but quiet location, clean well appointed rooms and helpful staff", "disliked": "— The stairs up to the 5th floor"}}], "location": {"country": "Nepal", "region": "Central Region", "continent": "Asia"}, "stars": 3, "variance": {"poor": 6, "average": 30, "very good": 53, "terrible": 5, "excellent": 39}, "aka": "Samsara Hotel", "slim_ranking": 0.385826771654, "description": "Offers unique total of 25 luxurious rooms that are equipped with almost all the facilities that are expected from a high end 3 star grand hotel.Kathmandu is one of the great historical capitals of the world, and blends traditional and modern lifestyles and culture to create a fascinating city. It is an area of great temples, both Hindu and Buddhist, and many World Heritage sites. Enjoy the bustling markets of Asan, the up market shops of Durbar Marg or the tourist area of Thamel. You can sample a huge variety of food in Kathmandu 's restaurants, and there are many bars where you can refresh yourself and meet new people. We recommend that you take some time to visit local attractions such as Swayambunath (Monkey Temple), Pashupatinath (burning ghats) Boudhanath (largest Buddhist stupa in Nepal), the ancient cities of Bhaktapur and Patan, and Durbar Square. These sites are of great importance to locals and are usually bustling with people worshipping and sightseeing. Please respect their religious beliefs when you visit. Samsara Resort has been designed as a peaceful haven in Thamel, the main tourist district, which has a wealth of dining and shopping options. We have a delightful garden where you can relax, enjoy a drink or meet with friends away from the liveliness just outside. Our rooms have been carefully planned to give you the space and comfort you need with all modern facilities such as:Wireless Internet connections in every roomMinibar24 hour laundry service24 hour hot water24 hour room serviceAir conditioningBaby sitter24 hour doctor on callWe also have a rooftop restaurant, the highest in Kathmandu , which offers commanding views of the Langtang Himal to the north. Our indoor bar offers somewhere to relax when the weather is inclement. We can arrange tours of the city, treks to the mountains, jungle safaris and rafting experiences. Please contact reception for details. We look forward to welcoming you to Samsara and sharing our Nepal with you"}