{"user_rating": 4.0, "review_count": 264, "name": "San Diego Marriott Del Mar", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Stayed 1 night (Mar 25, 2006) and wished we had more nights. The Romance Package which includes breakfast for two and a welcome bottle of champagne was a nice touch. The SD Marriott Del Mar met my simple demands for a nice hotel: modern, clean and friendly staff. Would love to stay again.", "title": "Terrific Stay and Value", "helpfulness": 5, "user": "bluefan", "date": "March 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4736208}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Stayed at the Marriott for one night (after a day in San Diego)...Hotel still looks new. The beds are extremely comfortable and the rooms are tasteful with bright colors...Have the hotel schedule a reservation at Jake's restuarant - great views where the ocean is illuminated at night. Hotel is close to Torrey Pines golf course and right off the highway - highly impressive for a Marriott.", "title": "Excellent Marriott!", "helpfulness": 6, "user": "LovetotravelSt.Louis", "date": "February 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4565377}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "My girlfriend and I decided to spend our New Year's Eve in San Diego with friends from LA. We let our friends choose the hotel and they said the Del Mar was a nice place. The Marriott turned out to be an excellent hotel. Its proximity to downtown however is somewhat far. Figure 20-25 minutes drive to downtown SD. The room for the most part was excellent. The beds were extra comfortable, and my girlfriend loved the pillows and the down comforter. The bathroom was very spacious and the entire room was spotless. The rest of the hotel we didn't get to see much of as we spent most of our time partying in downtown, but from what I did see walking in and out, it seemed very classy. I would definitely stay here again, with my only caveat being location.", "title": "Super Rooms", "helpfulness": 9, "user": "dr1ft3r", "date": "January 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4332965}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "This hotel was very nice.. Right off the I-5, about 20 minutes from DT. Rooms where clean and quiet. No complaints.. Loved the pillows, in fact, I found a website and bought 2 pillows!! The bar is very nice spent some time watching the Sushi chef prepare the sushi. This hotel is more in an Executive Park not many restaurants or night life near the hotel.", "title": "Love the pillows", "helpfulness": 10, "user": "PVHEREWECOME", "date": "November 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4125927}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Stayed 2 nights, payed $53 per night via priceline. Out of the 3 hotels we stayed at while visiting California, this was the nicest (Marriott Manhattan Beach was nice too, but this one was nicer). Stayed here a few nights since we were going to Legoland and the Wild Animal Park. Staff was friendly, hotel decor and rooms were very nice. There was a strip mall a few minutes away on Del Mar Heights and El Camino Real. The hotel charges $12/night for parking, but there's free parking at the back of the hotel (with no restrictions). Just keep driving on El Camino Real, pass the marriott and turn right on the next street.", "title": "Great Hotel", "helpfulness": 11, "user": "quanvon", "date": "November 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4089003}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Stayed there for a wedding last summer. Was not expecting much. Place was clean, modern, with plenty of conviences. The pool and terrace were very nice. The best surprise was the quality of room service - impeccable! Also, the restaurant on site was much better than the other outside places which were top of the Zagat list. Would stay there again without question.", "title": "What a pleasant unexpected surprise!", "helpfulness": 7, "user": "ClayP", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5030843}, {"rating": 2.0, "title": "Don't bother", "text": "My husband had a business trip to Del Mar, and this hotel was only a half mile from the location he needed to be at. As it was just before our 33d anniversary, I decided to go to spend some time with him after his business was concluded. The hotel at first is very nice. It is, after all, mainly for business travelers. Our reservation was wrong upon check-in. They only had us there for 1 night instead of 3. We had a room on the 11th floor, concierge level, ($244 a night) which included a full breakfast daily, and appetizers and dessert at night. Our room was located by the elevator(shared wall), and across from the concierge lounge. Knowing how noisy that can be we tried to get our room changed, to no avail. The room was small, the bed average, and the view from the room was either the highway or the building next door. We tried a few appetizers that evening before looking for someplace to eat. Pretty average. The breakfast the next morning was just eggs, toast, mangled bagels, and sausage, fresh fruit. Not awful, just very average and not worth the exta money we spent that the business didn't cover. The appetizers and dessert in the evening were the same. No big deal. We've stayed at the Four Seasons Maui on the concierge level, and I can tell you there is a world of difference. I didn't expect the Four Seasons, but I did expect something better from the hotel and the reviews it got.To make it worse the air conditioning stopped working the day we had to check out. We reported it to the concierge, and they came back to our room to make sure we knew how to work it. Insulting, and no one ever showed up to fix it. Very hard to get ready to leave with the heat, and there are no windows that open. I'd look for someplace else before staying here.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5024957}, {"rating": 5.0, "title": "Great value and near just about everything", "text": "I was really happy with this hotel and my stay there. At first, I thought it unremarkable, from the outside to the pool. But after the first night, and with all the travelling we did, I ended up really appreciating how close it was to everything, how helpful and friendly the staff was, and how comfortable the beds were.", "helpfulness": 12, "user": "danelicious8", "date": "April 22, 2006", "id": 4996215}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The hotel is in a safe and pretty business and residential area. I felt very safe here. This building district was clean, nicely landscaped, and well lit. The residential neighborhoods were above average to high end. Beautiful flowers and landscaping abounded. We saw vegetation we wished we could grow in our backyard. I saw arbors, pergolas, climbing vines, it was a gardener's dream, and really added to the feel of the place. Casually elegant, lushly landscaped, a true coastal town.", "title": "Terrific", "helpfulness": 4, "user": "USBrits", "date": "April 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4994337}, {"rating": 4.0, "title": "Awesome stay.", "text": "We were very close to a Plaza that had lots of stores and lots of casual dining options. We drove towards the Del Mar beach (maybe 5 mins at most) and took 13th street to Bullys for our first night. We had read from a guidebook that it was family friendly. It was . . . in a way. It was definitely a bar, and despite anti-smoke laws, it smelled of smoke and there were plenty of drinkers there. I wasn't comfortable here. It cost us $80 and without a doubt, the sirloin steak I had was delicious, but the atmosphere wasn't family friendly, the server was distant, and the sides were average to below average. My husband and I had opted for the steak and shrimp plate, and were each given 3 shrimp. The salad was a classic iceberg and the rice pilaf wasn't very good. There was a child menu the guidebook had promised, but for $5.95 the choices were chicken nuggets, hamburgers, and mac and cheese. We expected to pay high but we also expected to have good to excellent food. My daughter, who adores mac and cheese, couldn't eat more than one bite here. She's not a picky eater either.", "helpfulness": 8, "user": "kimperc", "date": "April 3, 2006", "id": 4830913}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "My family stayed at Marriott Del Mar October 13 - 28, 2005. We got a great rate of $139, which included parking and breakfast. Breakfast for four and parking would have cost us an additional $60 per day - so this was a great rate.", "title": "Nice Place", "helpfulness": 13, "user": "lvshack", "date": "October 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4042778}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The rooms were clean, and large enough. The bathroom was very large. The location of this hotel was great - right off the 5, which runs north/south in California. We were traveling to LegoLand and San Diego Wild Park Zoo, so this was the perfect location. It is also very close to Torry Pines Reserve beach, and the Del Mar beach - both were wonderful.", "title": "Great Hotel at a Decent Price", "helpfulness": 5, "user": "photog72", "date": "October 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4017716}, {"rating": 3.0, "title": "the marriott dorm", "text": "The breakfast buffet was wonderful - it included made to order omlets, french toast, cereal, sausage, fresh fruit and juice. I highly recommend their breakfast.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3992423}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "Room service menu was limited, but what items they did have were very good. We ate dinner via room service twice. As all room service, it was pricey, but worth it for us after a long day out.", "title": "Nifty little Marriott...", "helpfulness": 4, "user": "JackSD", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3732100}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 10, "average": 27, "very good": 99, "terrible": 4, "excellent": 124}, "aka": "San Diego Marriott Del Mar Hotel", "slim_ranking": 0.10332103321, "description": "The San Diego Marriott Del Mar Hotel is an ideal choice, whether you're traveling for business, pleasure, or planning a meeting. Our location in Del Mar is a seaside hideaway 20 minutes north of downtown San Diego and just south of Solana Beach. Along with our versatile meeting and banquet space, fine catering and luxury amenities we are an outstanding San Diego hotel choice. Our Del Mar, California hotel is convenient to beaches for surfing or sunbathing and also close to shopping at the Del Mar Downtown Historic Village. Events at the Del Mar Fairgrounds, golf at Torrey Pines and horse racing at the Del Mar Racetrack also excite our guests. The San Diego Marriott Del Mar provides guests with an array of diverse and exciting entertainment! Our unique on-site restaurant, Arterra, offers a trendy dining destination with award-winning cuisine and is open for breakfast, lunch and dinner. Take an evening to unwind with some cocktails from our full bar or outdoor lounge and enjoy some of your favorites at our fresh sushi bar."}