{"user_rating": 3.0, "review_count": 240, "name": "San Jose Airport Garden Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I found the staff beyond useless. They offered nothing informationally at check-in. I called the front desk to ask about airport check-in and printing boarding passes. Rudely, I was told it is across from the the front desk. In going there, the computer was super slow and was doing all kinds of updates. I eventually just gave up. I had to ask about the airport shuttle and the breakfast that was supposed to be included.", "title": "Staff is the biggest drawback.", "user": "msfigment", "date": "May 16, 2013", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 160873809}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "I would rather pay more and stay elsewhere. I did not book this hotel. A friend I was traveling with did. I would not book here again and if it is a chain, would be apprehensive of staying at any others.", "title": "Close to transit", "user": "rubaig89", "date": "May 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 160846098}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Stayed here for one night during our roadtrip. Easy access to freeway and there's a light rail stop (Metro Airport) steps from the hotel. Pet friendly hotel but the $50 fee seems quite steep to me. Rooms look old but clean and the surroundings have some nice landscaping. Swimming pool, restaurants on site. Free wi-fi works well. Definitely a no frills hotel but location and the price makes up for it.", "title": "Place is a dump, staff not nice or helpful.", "helpfulness": 1, "user": "RJtravel777", "date": "May 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 160812758}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed there 1 night last week for the Rolling Stones concert, the place is a dump. Kept my stuff in my suitcase rather than drawers. Three electrical outlets in the room (with two plugs each) didn't work including one between the beds that had the electrical cover hanging off.", "title": "Good choice", "user": "lpfist", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160610584}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Carpets dirty, no soap given in bathroom, not enough toilet paper, not enough towels, toilets loud, beds uncomfortable. Had requested a small fridge and it wasn't in the room when we got there. Housekeeping lady, didn't speak English and hard to communicate.", "title": "A remodel that makes a place worse.", "user": "powellken", "date": "May 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 160387841}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed there for 5 nights in June on a business trip. It was OKay for what I paid ($85/night+tax), considering hotels in the San Jose region tend to be quite expensive. I am a frequent traveler.", "title": "Mixed experience", "user": "CanadianTraveller100", "date": "June 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 164498063}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The good:", "title": "Acceptable but no bells and whistles.", "user": "michellemacri", "date": "June 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 163814969}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "- Easy access to the Light Rail. The stops for the Light Rail are just outside the hotel compound. I took it everyday to go to the Convention Center. Trains came relatively frequently because there are two lines going from the airport to downtown.", "title": "Don't waste your money.", "helpfulness": 1, "user": "Crosscountrygolfer", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 163739440}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "-Very charming garden. Definitely get a room facing the garden. (Half of the rooms face the garden). You can't get this kind of serene view in most hotels, even high-end ones.", "title": "Only in an Emergency!", "user": "LBJPortland", "date": "June 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 163663702}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "- The room I stayed in was apparently recently renovated, with granite counter top, and fairly clean tiles on the walls and floor. The closet door is also a full floor-to-ceiling mirror.", "title": "Dated, but clean and comfortable", "helpfulness": 1, "user": "LISA R", "date": "June 10, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 163615965}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Not a lot to say, this hotel needs updating badly. The price was the same as most hotels in the area over priced! Had a good breakfast and the hotel staff were great.", "title": "The Old Haytt San Jose", "user": "gregg t", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 160302990}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "If some one would update the hotel it would be a great place, gardens need so much work", "title": "Quiet night sleep before early morning flight", "user": "Marilyn B", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159258234}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "however the basics are there to remodel.", "title": "Great experience!!", "user": "ks7777", "date": "April 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 157920331}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Would not stay there until they renovate.", "title": "It's a dump", "helpfulness": 2, "user": "markmDanville_Ca_", "date": "April 15, 2013", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "location": 4.0, "value": 2.0, "rooms": 1.0}, "id": 157752847}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This hotel offers a park and fly package. The rooms are clean, beds are wonderful and it was quiet. They have a shuttle service and we were picked up when we returned and delivered to our car. Breakfast was made to order and good. The staff are friendly. The hotel has a swimming pool and lovely gardens.", "title": "An Angel in there...", "user": "VenH_13", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157514416}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We checked in late and had an early flight the next morning so admittedly, I didn't see the grounds in the daylight. We were directed to building six where we went up a filthy dirty set of stairs to our third floor room. The lighting was dim and probably for good reason. The curtains were in shreds, and the carpet was dirty. The fellow at reception offered a wake-up call for the next morning, but we never got it. The beds were comfy and the bathroom roomy. No complimentary breakfast, but an on-time shuttle to the airport made up for that. We made the reservations on Hotline, so the price was decent but I'd think twice about staying for any length of time.", "title": "Sad Room", "user": "Laura R", "date": "June 6, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 163208719}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This hotel was rated 3 stars, but I felt it only deserved 2. The mattresses were very old, we could feel the springs. The fan in bathroom did not work. The TV was old and had about 20 channels only. Their wifi signal was weak and kept cutting out (this hotel is located in Silicon Valley, really?). A dead bug was found on one of the beds when we entered. I found an old dried out coffee packet left in the single serve coffee pot. Housekeeping only provided one washcloth - this was so odd, because they provided two of everything else: towels, hand towels, but only one washcloth each day - and we were there three nights.", "title": "Needs Attention", "user": "Cya_Im_Outta_Here", "date": "June 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 162885778}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The jacuzzi was enjoyable, but the jets were weak. Upgrades made to the jacuzzi and pool weren't thought out too well - it looks like they just added a layer of pavers over existing concrete - and the pavers get extremely hot in sunlight - and the trim around pool and jacuzzi just added depth, so the step into and out of the pools are too deep, felt like I almost needed help getting out, it was that much higher than a normal step. They did have a handicap access chair to each (this may be required, I am not familiar with ADA specs).", "title": "Horrible Staff", "helpfulness": 1, "user": "D L", "date": "June 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 162795798}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Finally - the door to our building was always open - even though it was fit with a card key reader - there was no security, which is important for most people these days, but particularly those with families and small children.", "title": "Garden setting, decent amenities", "helpfulness": 1, "user": "Bballrun", "date": "May 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161982498}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Got in late on Friday evening. Called from the airport and was instructed where to wait for the driver. I wait somethng like 40 minutes and shuttle finally arrives. The driver is agitated and say in broken English that \"you not there.\" I don't know what he's talking about. I said I had been waiting a long time at the spot where I was instructed, he shouts back \"you not there\" and the louder \"YOU LIE...DON't LIE TO ME.\" I'm keeping quiet at this time and should have left and looked for a room somewhere else. We arrive at the hotel and I check in. The room is old and some of the furniture irregular as expected, but the trash can is full, there is a used plastic cup and soap in the bar room. The bed is made though (I was hoping it was made with new sheets). There was a big stain on the faded carpet. So, having read previous reviews, I didn't expect because if is relatively inexpensive, but I was expecting a clean room and not to be insulted by the staff. Upon check out the next door, I asked for the manager. The clerk said he was not there and when I described the behavior of the driver from the previous evening, she agreed it was outrageous and I left my number for the manager to call. He never called, consistent with other staff. THIS PLACE IS NOT WORTH THE AGGREVATION !", "title": "Old but Good", "user": "xfil911", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161547967}], "location": {"country": "United States", "city": "San Jose"}, "stars": 3, "variance": {"poor": 71, "average": 46, "very good": 58, "terrible": 44, "excellent": 21}, "aka": "Holiday Inn San Jose", "slim_ranking": 0.555555555556}