{"user_rating": 2.0, "review_count": 353, "name": "San Juan Beach Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "This hotel was the worst hotel I have ever stayed at in my life -- including cheap hostels. I booked it through Priceline as a 3-star hotel, but it is not even a 1-star. Please look at my pictures to corroborate my story.", "title": "Could NOT be worse.", "helpfulness": 11, "user": "CheapSoda", "date": "June 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7988493, "likes": {"liked": "— Absolutely nothing.", "disliked": "— This was a disgusting mess, and a health hazard!"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "When we arrived, the hotel seemed nice from the outside. When we checked in, we were told we were on the 4th floor, but the elevator was not working. We had to schlep all of our suitcases up the stairs with no offer of help.", "title": "could be worse..", "helpfulness": 2, "user": "born_t0_travel", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 7279075, "likes": {"liked": "— proximity to the beach", "disliked": "— expensive meals"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We got to the room and were immediately disappointed, but not totally disgusted. All of the fixtures were completed rusted over, including the towel-holder in the bathroom (shower) where our towels (all 2 of them!) were hanging. All of the lamp shades were BURNT. My bedspread had rips and tears all over it. My travel companion pulled back her bedspread to find BLOOD STAINS on it (refer to pics).", "title": "Forget it!", "helpfulness": 1, "user": "mgates95", "date": "March 28, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7239798, "likes": {"liked": "— reasonably sized pool next to ocean", "disliked": "— not clean, overpriced"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We left the hotel for the day and came back that evening to the most disgusting room ever.", "title": "How bad can bad be? Beyond belief...", "helpfulness": 2, "user": "rmblnguy", "date": "March 27, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 7230459, "likes": {"liked": "— checking out; a safe at the front desk", "disliked": "— The deplorable conditions"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I walked in and noticed that the mirror was wet. I mentioned it to my friend, wondering if the maid had forgotten to wipe it down after spraying it. My friend realized that it seemed to be covered in a dew. She went to pick up a travel guide from the bed, and it was damp. Then I picked up a sweater I had left in the room -- it was also damp. The furniture in the room was wet (refer to pics), the bed was wet, the mirror was wet, all the clothing we had hung up was wet, and the walls were wet (refer to pics).", "title": "Never Again !!!!!", "user": "Gonza-huert", "date": "March 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 7202251, "likes": {"liked": "— staff", "disliked": "— not clean"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "I stayed at this hotel for one night before meeting a friend at the Carribe Hilton for the remainder of my vacation. Since I was only staying for one night I went for this relatively inexpensive choice. San Juan Beach Hotel cost a total of $185 for the one night, a savings of $70 over the Carribe Hilton. Of course, the difference between the two properties is light years. The Hilton is a resort, while the San Juan Beach is a former Ramada property that needs a serious update. The lobby and and hallways are a bit dingy, but the room was fairly clean, large, and quiet. I did not see any of the dirty lampshades or bedding that other reviewers have reported on. There was no visible mold, although the air was stale until the air conditioning was turned on. The beach area is only for sunning as the surf is too violent, and the pool is indeed not for children. The Condado area, where the hotel is located, is safe for walking around with good choices of local and chain eateries. Try the Ajili Mojili, right across the street, for lunch. It has excellent Puerto Rican food at reasonable cost and the portions are ample. The good points about the San Juan Beach Hotel are the location and the friendly and efficient desk staff.", "title": "Not as bad as I feared", "helpfulness": 1, "user": "Makeupyourmind", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7193671}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This was such a disappointment. I stayed here for 4 nights and 5 days. The hotel smelled like Mold and Mildew. The titles were falling out of the bathroom ceiling. There was rust on the lamps. The curtains had not been cleaned for a long time because they had mold on them. The only good thing about this hotel was the view of the ocean. Family members stayed not too far from us in the Best Western and this hotel was beautiful. They did'nt even pay as much as us and they had a continental breakfast, we had to go out every morning to get coffee. This place was not clean and in order to get towels you would have to wait at least 30 minutes and then they would not bring you what you asked for. I would not advise anyone to stay here....", "title": "Horrible-I hated this Hotel", "helpfulness": 2, "user": "ToniaBuffalo", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 7189407, "likes": {"liked": "— The Ocean View", "disliked": "— The Hotel"}}, {"rating": 2.0, "title": "not my favorite wakeup call!!!", "text": "So I travel to San Juan frequently and absolutely LOVE the San Juan Beach Hotel. Not your 5-star establishment and the owners could stand to put some money into remodeling the joint, but its on the beach and the folks that work there have always been so wonderful...until the other day.", "user": "MichigantoSanJuan", "date": "March 19, 2007", "id": 7189384}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I woke up a little bit after 6AM to the sound of sirens and horns and whistles and some angry folks outside picketing the hotel! Then I read in the news today that the San Juan Beach hotel fired like 20 workers and replaced them with no notice or anything! I will be checking out immediatetly, the noisemakers outside said they would be picketing every morning!", "title": "Desaster", "helpfulness": 1, "user": "sebaini", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 6920265, "likes": {"liked": "— the view", "disliked": "— all the rest"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007", "text": "Old, Dirty, Smell, no room service, no bar.", "title": "Good value in an expensive city.", "helpfulness": 1, "user": "xyzava", "date": "February 28, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6892862, "likes": {"liked": "— Price, cleanliness, proximity to Old San Juan and Airport."}}, {"rating": 2.0, "title": "Some caveats", "text": "Room was large and had a nice view. Airconditioning worked. It took a service call to be able to turn the water on in the bathtub/shower. To their credit I did not have to wait long. I also had the same problem turning the water off. The biggest problem I have was paying cash upon checkout after presenting a credit card on checkin. They put a $138.00 temp authorization on my card when my bill was only $111 (special hospital rate). I stayed the night of 6/8 and here it is 6/16 and the temp authorization has not been lifted. I called the hotel and was told by a desk clerk that their bank keeps the authorization in effect for 17 days. This to me is unacceptable. I called my bank card and the authorization manager and I have tried to contact the hotel's accounting department for two days now. Yesterday there was no answer at all and today I was only able to get a voicemail system to answer. I think this is another case of unresponsive management as mentioned in another posted review.", "user": "A TripAdvisor user", "date": "June 16, 2005", "id": 3559969}, {"rating": 2.0, "title": "Nice, With Some Drawbacks", "text": "I loved the ocean view and sound from my room. It did feel a bit damp, however, as I have read in other reviews. The location was wonderful – nice restaurants and bars nearby, and a nice walk to better beaches. The staff was very friendly and helpful but three things were wrong: 1) the website promised a coffee machine and CD player in the room, but they were not there and not provided after I mentioned it, 2) the doors of all rooms are incapable of closing quietly, therefore, there was a lot of slamming noises at all hours and 3) there was an all night party nearby which woke me up throughout the night until 4:00 a.m. I finally had to call the person at the front desk, who handled it promptly and successfully.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3458540}, {"rating": 1.0, "stay_parameters": "Stayed June 2007", "text": "We had a stopover in San Juan overnight before returning home. The hotel was listed as close to the airport, it is 10 minutes away. The room was bug infested, the a/c did not work, and the sheets on the bed were old and did not fit. We changed rooms and still were not satisfied. Plus there's lots of construction around the hotel.Cannot think of anything postive about the hotel except the price.", "title": "Very Disappointing", "helpfulness": 2, "user": "sunsurfandsand", "date": "September 13, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8707671, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I will try to keep an open mind when writing this review, as it is easy to pick out only the bad points when telling about things. I arrived at the San Juan Beach hotel 8/31/07 and was given a lagoon view smoking room. (I had requested a ocean view non-smoking) I contacted the front desk and was immediately swapped into the proper room. The walls and floor was damp, but being fair it seems almost impossible that they wouldn't be because of the fact that they are between the bay and the ocean. The floors were dirty...no excuse for that...there hasn't been a vaccuum in room 703 in quite some time (maybe months) so the sand just sticks to your clean feet. The bathroom wasn't swept the entire time we were there...I know this because I actually circuled (in pencil) the large dirt pieces on the floor to see if the maid would notice (She did not). The windows were filthy! There was no excuse for how dirty the windows were because having an ocean view it would be nice to see the ocean! My husband attempted to raise the window and the glass and frame literally came out of the track and fell into his hands. (Luckily he got it back in track and left it be.) The elevators are slow, but they get the job done. We had free continental breakfast everyday, expect for the day that someone took the key home with them and there was no breakfast. (I didn't ask what key, I was afraid I didn't want to know.) If you aren't expecting anything grand then you'll be fine...but I do prefer clean accomodations. I honestly feel that with a better housekeeping staff this hotel would be okay. Sure the hotel could use a bit of time from the local handy man...but the main problem is the dirt. I guess I'd rather stay in a clean motel 6 than to stay in a dirty 4 star hotel.", "title": "Not so grand", "helpfulness": 2, "user": "fireball92771", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 8653955, "likes": {"liked": "— The location was great!", "disliked": "— It was filthy!"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This was a horrible experience. I am a travel agent, and I", "title": "Would Not Wish This Upon A Enemy", "helpfulness": 3, "user": "svinson", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8461109, "likes": {"liked": "— nothing", "disliked": "— there is nothing to like"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "would not reccomend this hotel to an enemy. When I arrived", "title": "Should have listened to all of the Reviews", "helpfulness": 4, "user": "RobSport", "date": "July 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 8211488, "likes": {"liked": "— View from Room", "disliked": "— Hotel was not clean"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "and recieved my room, I was so disgusted. I called room service", "title": "Better Options in San Juan", "helpfulness": 4, "user": "SDM08", "date": "July 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8131243, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Husband and I stayed at San Juan Beach hotel. We just like to enjoy our surroundings, and we read all the reviews and still decided to stay. What a BIGGG mistake. The location was pretty good and the staff was extremely friendly. The place reeked with a mildew smell. It was awful just walking into our room, and waking up to the smell of mildew. Luckily we didn't spend much time in our room at all. We visited the Condodo casino and resort. We should have stayed there for about $60 a night more it would have been well worth the difference in price. We had also stayed at the comfort inn post cruise. Which was nice and comfortable, with coffee in the room. We will not stay at this hotel again, and I suggest that you don't subject yourself to the disappointment.", "title": "You' ve been warned", "helpfulness": 3, "user": "Dendan", "date": "February 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 6751107, "likes": {"liked": "— The staff was friendly", "disliked": "— The odor"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "My husband and I had the attitude that it is just someplace to sleep but, we couldn't really enjoying sleeping because of the smell. So you have been warned, just as we were, but do not make the same mistake we did.", "title": "Complete disaster", "helpfulness": 3, "user": "KazBilbao", "date": "January 26, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6699637, "likes": {"liked": "— Vistas al mar"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "It was old, shaby, dirty, with stange odours, without a coffee shop, restaurant or bar. Staff friendly but unable. They asked for my visa card just to check-in and afeterwars, when I returned from my holiday I realized they´d charged money without my sign. (I had payed with voucher). I sent several emails asking for refund, they answered twice promising they would return the money back but finally I had to complain to my bank, who did the job for me and I had my money returned 6 months later. it was not a big amount but I was so angry...!. The room was oldish and the bathroom uncleaned. Don´t go to this hotel", "title": "rundown", "helpfulness": 2, "user": "kacyOntario", "date": "January 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 6590159}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed one night before catching an early flight. Only nice thing to say was that the few staff we ran into were friendly and helpful. Hotel is run down, room was very spacious but worn out, gave the impression of it not being really clean. The fact it was close to restaurants was a bonus. Would not stay here again.", "title": "Disappointment in San Juan Beach hotel", "helpfulness": 3, "user": "bjrhomes", "date": "December 1, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 6315143, "likes": {"liked": "— location", "disliked": "— poor rooms and no restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I stayed at this hotel on November 17, 2006 - one night before a cruise. I was very disappointed in the accomodations. The lobby has no operating restaurant. Therefore, you have to go out to get coffee in the morning. The one computer that guests can use is located in the lobby hallway to the elevators. It was not working during my stay. The rooms leave alot to be desired - especially the bathrooms. Ours had ants crawling around the sink. Not an infestation but enough to notice. We were also on an upper floor.The bathroom needed maintenance. Caulking around the sink tub etc. The bathroom sink did not drain fast. When I looked down there was massive amounts of hair. The beach this property is located on is not a beach you go in and enjoy the water. So if you are booking a hotel on a beach for the purpose of hanging out on the beach. This is probably not for you. Also the ladies bathroom on the first floor was unusable due to a urine smell. I would not stay there or recommend this hotel especially for the rate and the taxes. They should do Better.", "title": "Good Location, need refurbishment", "helpfulness": 2, "user": "Paisajista", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5905568, "likes": {"liked": "— location", "disliked": "— Lobby"}}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 2.5, "variance": {"poor": 59, "average": 67, "very good": 42, "terrible": 172, "excellent": 13}, "slim_ranking": 0.978723404255, "description": "Ten-story Beachfront Hotel located in The Condado Area and all rooms have a view of the majestic Atlantic Ocean or the romantic Condado Lagoon. The hotel has an intimate setting with friendly staff ready to serve our guests. Here, each guest is an additional member of the family. We are located only minutes from the island’s \"Golden Mile\" in Hato Rey; the Caribbean’s largest shopping mall, Plaza Las Americas; and the Historic District of Old San Juan. In our area, you can walk to the finest restaurants, casinos, and high end boutiques."}