{"user_rating": 4.5, "review_count": 663, "name": "San Cassiano Residenza d'Epoca Ca' Favretto", "reviews": [{"rating": 4.0, "title": "a great beginning to our trip", "text": "My friend and I began a two week vacation to Italy with a 4 night stay in Venice, in this hotel. We were careful to print out the map to this hotel, based on others' reviews. It came in very handy, but it did not show that all of the bridges (3) you must cross to arrive at this hotel from S. Stae water taxi stop involve large flights of stairs. We had a fair amount of luggage, and this proved to be difficult. I would highly recommend taking a private water taxi, which will drop you off right in front of the hotel, and is well worth the extra spend. However, don't let this deter you from a stay. The hotel was absolutely charming. The gentleman at the front desk was extremely gracious and accomodating in all respects. Our room was a bit small, but it was beautiful, with matching tapestry bedspreads and curtains and a venetian chandelier. The bathroom was small, but very modern. The air conditioning was a state-of the-art individually controlled ceiling unit. Breakfast was very nice, served in an elegant room. The hotel was very convenient to the Rialto bridge and all other locations. We walked all of Venice from here, and loved it! I will definitely return for another visit!", "helpfulness": 4, "user": "Chicagojill", "date": "October 5, 2005", "id": 3995161}, {"rating": 4.0, "title": "Delightful Hotel", "text": "We spent 4 nights at this lovely hotel. The staff was friendly and helpful and English speaking. We arrived from the airport via private water taxi which dropped us right at the hotel door. While it's expensive (80 Euro), it's fast (25 min) and no hassles dragging heavy luggage through narrow streets or trying to locate the hotel. The dock has small tables and is just off the bar and lobby area. It is very relaxing to sit there and watch the canal traffic. There is also a very nice quiet courtyard with tables off the lobby. Breakfast was included and is served in a very elegantly decorated room with a view of the canal. An assortment of rolls and croissants, cereal, fruit, juices, coffee or tea as well as eggs and various meats and cheese were offered from 7:30-10:00. Our room was small and faced the narrow side street. However, it was comfortable and clean and nicely decorated. The canal view rooms are larger and more expensive. However who spends much time in the room? Our only complaint was a faulty shower knob that made turning on the shower difficult. We had an easy time finding our way to the Rialto bridge (5 min) and to San Marco (15 min). If we return to Venice we would definitely stay here again.", "helpfulness": 7, "user": "Ridgevalley", "date": "September 26, 2005", "id": 3940438}, {"rating": 5.0, "title": "Our 25th anniversary", "text": "The hotel is superb-magic-romantic-Heaven.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3932181}, {"rating": 2.0, "title": "It was Okay...", "text": "We have just spent our 25th anniversary in the most fantastic hotel-in the most fantastic city. We will be booking again this year because it delivered all its promises. Staff were excellent, friendly and welcoming. This hotel really should be a 5 star hotel! Can't wait to go there again.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 4, 2005", "id": 3841380}, {"rating": 1.0, "title": "We were Bumped Off to", "text": "I really don't see why others have given this hotel such a high rating. The service was okay, we had a std double and the room was small, the floors were dirty. In general it was not too bad but at 150 euro in the low-season I think we'll look elsewhere next time.", "helpfulness": 6, "user": "Sally W", "date": "August 24, 2005", "id": 3805168}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Stayed at this lovely hotel for 2 nights at the end of July 2005. Chose the hotel as a result of the positive reviews on this site and were not dissapointed. Stayed in one of the Grand Canal view rooms which are definately worth the money - amazing views. Hotel staff were very friendly and went out of their way to assist with any requests and queries. The outside bar area is small but perfect. We thoroughly enjoyed sitting there with a glass of wine enjoying the view and watching the gondolas go past. The hotel is excellently situated only a few minutes from the Rialto bridge and no more than 15 mins from St Marks square at a leisurely stroll. We would definately stay here again and would whole heartedly recommend it.", "title": "Highly recommended", "helpfulness": 16, "user": "katymilli", "date": "August 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3737224}, {"rating": 5.0, "title": "Excellent Place from Which to View the Regatta Storica!!!", "text": "Really wonderful hotel with spacious rooms and terrific ambiance. In the midst of a very hot, crowded week in Venice, we were able to sit outside on the little boat dock here and drink Prosecco while the historic parade of gondolas and boats passed by in full regalia. No better way to enjoy Venice! Atif, the owner, is friendly, warm and very accomodating as are the other staff members. This hotel seems to attract a really nice crowd of guests which also adds to the overall experience. My husband considers it his home in Venice and has stayed here many times.", "helpfulness": 8, "user": "stratasphere", "date": "August 3, 2005", "id": 3732998}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We too thoroughly enjoyed a recent short stay at the San Cassiano. Download the street map from the hotel website to find the entrance though.", "title": "Perfect location", "helpfulness": 25, "user": "IanAP", "date": "June 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3549356}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 44, "very good": 248, "terrible": 16, "excellent": 331}, "aka": "San Cassiano Residenza d`Epoca Ca` Favretto Hotel", "slim_ranking": 0.230971128609, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}