{"user_rating": 4.5, "review_count": 44, "name": "San Anselmo Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I stayed at San Anselmo Inn because I wanted to stay in Marin county and not on main drag but didn't want to spend a fortune. San Anselmo Inn was about the same price as the closest chain hotel but much better location and included breakfast. The rooms were no great shakes. But decent, relatively clean. The place could certainly use some rehab but all in all, I thought it was a good value. Plenty of restaurants and cafes in walking distance. Try Mi Pueblita a few blocks away for great Mexican food and stop and say hello to Ada at The Paper Pile behind the Inn.", "title": "Nice place, great location", "user": "lbmore", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 13992573}, {"rating": 5.0, "title": "Clean and cozy room", "text": "Thank you so much for having such a perfect room for me when I was there May 11-14! Not only was it clean and cozy, but I loved the fact that it had so many lighting choices and that I could open the window. The breakfast options were just right, especially those delicious raisin biscuits. I chatted with several girls in Housekeeping and they were friendly and polite. I could hear no outside noises in the room which was great. Outside I could walk to many fun and historical places.", "helpfulness": 1, "user": "artichoke3", "date": "June 3, 2007", "id": 7752602}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I plan to return for another stay, especially since my son and wife live there, along with their 3 1/2 month old son!", "title": "Loved and will miss the San Anselmo Inn", "helpfulness": 1, "user": "p1tps12", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7347613, "likes": {"liked": "— Location and charm"}}, {"rating": 1.0, "title": "what a dump", "text": "Judy", "helpfulness": 1, "user": "travelslotsPaloAlto", "date": "December 30, 2006", "id": 6521295}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed at the San Anselmo inn twice. Once in 2004 and again in 2005. It was recommended by our son and daughter in law who have since moved from San Anselmo. The Inn is charming, the owners and managers bent over backwards to please us. The breakfast is the best! Alas, our children have moved from California, so we probably will not be back. But it was one of the best parts of our vacation. No old furniture and no bad odors. You must stay there if you are visiting the San Anselmo/Ross area.", "title": "What wonderful and decent people", "helpfulness": 8, "user": "cognito58", "date": "September 17, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0}, "id": 5810136}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 1, "average": 3, "very good": 9, "terrible": 1, "excellent": 30}, "slim_ranking": 1.0, "description": "Located in a historic, turn of the century building, in the quaint and charming town of San Anselmo, our Inn offers the very best in hospitality and personalized service. We provide the comfort and modern amenities that insure your stay in the San Francisco Bay Area will be memorable and satisfying and a generous breakfast buffet is included with your room. While our staff is at your service to plan side trips, tours to the wine country, or other exciting adventures, business travelers will also find the casual, quiet atmosphere and central location ideal for productive work days, and our proximity to great dining within walking distance, the perfect place to relax. Homemade chocolate chip cookies served fresh every afternoon!Free parking is located at the adjacent US Bank parking lot."}