{"user_rating": 4.0, "review_count": 542, "name": "Sanctuary Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "I just stayed at Marina Dunes recently with my girlfriend and from the moment we got there it was great. First of all for the people who complain about their service, let me say something. I have a feeling you guys werent being friendly with them, because they left me on hold on the phone for a real long time, and the service people cancelled the $15 restoration fees for each night. Anyways i got there and check in only took 2 minutes. Bellhop took us to our OceanView Jr.Suite and the view was pretty awesome.I could walk from my room to the beach in 2 minutes. It was great.Deck/Balcony was clean and so was the 2 chairs outside. The little area with the fridge and sink was real nice and convenient as well. Fridge worked well and kept my drinks cold. I remember previous comments saying their refridgerator [--[ but i thought it worked nice. And obviously you have to pay for the goodies in the basket and fridge. You expect them to pay for your dinner and aquarium tickets as well? The sitting area/2 couches was very nice and comfortable as well. Had a nice view of the ocean from the couch. Fireplace and both TV's work great as well. Alot of Channels. 70+ channels. The bathroom is great as well. Theres a his/hers sink, and a shower and a separate bathtub. The best part about the whole room is the extremely comfortable king bed. Their real big pillow is real comfortable.Guaranteed to put you asleep within a minute. This place is totally worth the stay. Especially for couples/romantics.", "title": "Dont Listen To The Bad Reviews.. Place Is Awesome !", "helpfulness": 7, "user": "kohrientrips", "date": "April 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4972590}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The Marina Dunes Resort is my favorite spot on the Monterey Bay. I have stayed here several times before and I just love it, I always return a couple times a year.", "title": "Beautiful Spot, Friendly Staff...Just plain wonderful", "helpfulness": 2, "user": "More-Mila", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4957459}, {"rating": 2.0, "title": "Get some real service", "text": "The rooms are beautifully but simply decorated with tans and greens. The perfect colors to just sit and relax. The ocean is so beautiful from this spot. It's a great place to watch the sunset!", "helpfulness": 1, "user": "TravelingPain", "date": "April 9, 2006", "id": 4952996}, {"rating": 5.0, "title": "Wonderful Sanctuary!", "text": "The staff have always been courteous, friendly and professional with me. As with life nothing is perfect. We have had a few minor problems, but nothing that wasn't dealt with immediately and professionally.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 19, 2006", "id": 4694490}, {"rating": 3.0, "title": "Great Potential, But Hit-Or-Miss Execution", "text": "The golf carts are fun and keep the property looking the way that it does. It makes things even more peaceful and quiet.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 12, 2006", "id": 4602529}, {"rating": 2.0, "title": "Poorman's Version of a Resort", "text": "If you like children screaming and running about, well than amigo you've come to the right place. The walls are paper thin, housekeeping woke us up at 9am by cleaning next door (front desk mustered a half --- apology), they charge you 10$ to bring a crappy breakfast to your room, and we didn't get to enjoy in the fun of a golf cart, just because we didn't said the front desk.", "helpfulness": 5, "user": "bennyloyno", "date": "December 4, 2005", "id": 4161191}, {"rating": 4.0, "title": "View was just what I needed", "text": "Monterey/Carmel have no shortage of quality boutique inns, please, go elsewhere. The website is completely misleading, it doesn't look like that (although the beach is nice). The bathrooms are plain akward, but the rooms are decent. Overall, not worth the price in an area filled with great hotels.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 4, 2005", "id": 4086372}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Note: we stayed at a sisterinn of this hotel in S. San Francisco and it was much better, that's why we stayed here no questions asked. Well, should have done our homework.", "title": "Great Location!", "helpfulness": 2, "user": "Sam B", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4005027}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "My girlfriend and I were supposed to leave for our California trip on Wednesday evening. All of our flights were cancelled due to thunderstorms. We did not leave till Thursday morning from an airport 50 miles away. Flew into SF Int'l, rented my convertible and headed to the Marina Dunes. The ride down route 1 from San Francisco was amazing. By the time we got to the Marina Dunes Resort it was mid afternoon PST, mid evening EST and we had been up for 15 hours after sleeping for 4. The lobby was small, but uncrowded, and the staff was very helpful. We followed our bellman in our golf cart, named Calamari, to our Oceanfront Deluxe Room. Upon entering the room was small, but clean and we enjoyed the fireplace. The view is what made it special, it was cloudy but as soon as you opened the sliders you could smell the ocean air and hear the crashing waves. We dropped our bags, hit the bathroom and headed to the beach. Neither of us had ever seen the Pacific and it was a thrill just to put our feet in a different ocean. After this we spent an enjoyable afternoon by the pool and hot tub. We went to dinner at AJ Spurs, the food was good and the drinks were strong, just what we needed. Then drove our way back to our room, showered, put on our comfortable robes, cracked a bottle of wine and sat on our deck in the dark listening to the ocean. We only stayed one night before moving on, but it was a perfect way to start our vacation. We got a good deal staying on a Thursday, only $160... Make sure you take the drive and go to Monterray, I reccomend Breakfast at the Culinary institute and 17 mile drive...", "title": "Despite the mixed reviews - I highly recommend", "helpfulness": 6, "user": "flilady", "date": "September 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3909567}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "My Girlfriend and I stayed at the Ambrose for 1 night on our road trip around the USA in Sept 2005. We are in our twenties, so young you may say but our expectations are high Situated right on the beach and when I mean on the beach I mean exactly that. Our room backed onto the beach. Stunning views. Gorgeous room. Spaceious and Very clean and your very own fireplace giving the room a cosy feel at night. Lovely. Pool area was nice too. A huge HEATED pool and nice big hot tub. Perhaps a little pricey but a lovely hotel.", "title": "TOURIST TRAP", "helpfulness": 7, "user": "FLATLINE13", "date": "August 24, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3805186}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "This place truly makes you feel like you’re on vacation! My boyfriend and I were there on a romantic getaway in a room facing the ocean. I booked a room right after reading the high rated reviews on this website and all the positive things people have said are true! Everything from a friendly staff, personal golf cart to quickly get around the resort, to dining in your room with a view of the ocean at sunset. The onsite restaurant, AJ Spurs, provided a lot of food and it wasn’t bad at all! We are vegetarian and were happy to see more than 1 vegetarian option on the menu. This trip was in July, so we weren’t uncomfortable as far as room temperature goes. There is a fireplace in the room which makes it even more romantic, but we didn’t have to use it for heat.", "title": "Wonderful experience!", "user": "SpikyHairedGirl", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8108850, "likes": {"liked": "— The location, ocean view and friendly staff", "disliked": "— None"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I only wish that this were a couples/adults only resort. The majority of guests that we saw were families with younger children, some who do not respect the fact that this resort is also a sensitive wildlife preserve. Sometimes the romantic atmosphere can be interrupted by screaming children and careless parents, all of which have nothing to do with the resort itself. On most days, the only sounds we heard were birds chirping and the light rumble of the ocean. I would highly recommend this resort and plan to come back!", "title": "best place ever!", "user": "jenndls", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7769514, "likes": {"liked": "— location and the room", "disliked": "— none"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is the 2nd time I have stayed at this resort and I'm even more impress than the last. They have renovated the bathroom and put in new tiles and changed the sinks to his and hers. I love this place. We went with another couple that has never been to Carmel before and they thought the experience at this resort was also great. My favorite is that you get your own golf cart to drive around the resort. There is a little balcony where you can just relax and listen to the ocean waves. My fiancee and i had the best relaxing weekend.", "title": "A 3* in Resort's clothing", "helpfulness": 2, "user": "Mikeandcris", "date": "May 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 7655153, "likes": {"liked": "— NIce bed, pillows, and fireplace in room", "disliked": "— No bathtub or counter space in bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "My wife and I stayed here two nights mid-week. We purchased through Priceline ($100.00 per night.) When we arrived, the fact I had used Priceline was brought to my attention by a somewhat chilly receptionist. Thinking that the occupancy rate must be aroun 50%, I asked if an ocean view room was available. I was offered one for $30.00 per night, but declined. (Another guest who checked in minutes after me and who paid the standard rate was also offered to upgrade to an ocean view for $30.00.)", "title": "Steps from the beach, in room fireplace, and complimentary CD", "helpfulness": 1, "user": "Foodwise", "date": "May 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7635159, "likes": {"liked": "— Fireplace, beach access, ocean view, private, serene.", "disliked": "— food select for room-service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Our room was a lower level unit near the centrally located pool. It was clean, but not \"resort\" quality. Also, for a place that caters to romantic couples, there was no tub. Instead there was a walk-in shower, two pedestal sinks and little to no space to put your bathroom stuff. The gas fireplace is a nice touch and the only source of heat. While the tempuratures are normally moderate (55-65 ish), anyone prone to being cold would be uncomfortable.", "title": "Great four day stay", "helpfulness": 2, "user": "Ish_Kabibble", "date": "May 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7591390, "likes": {"liked": "— remoteness, miles of quiet empty beaches"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "This is the 2nd time we've stayed here and it's been great both times. Our room was right on the dunes above the beach. We had a wonderful ocean view. One morning, walked down to the beach and saw 1) surfers, 2) dolphins, and 3) sea otters. It was amaziing. When you stay here I think you are really paying for the view and the easy beach access - a short walk.", "title": "A Wonderful Place to Stay", "helpfulness": 2, "user": "Cambria2002", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8602041}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The rooms are very nice. We've had both a regular room and the junior suite (this time). Junior suite is great because you have a couch and sitting area. Great bathroom (they provide actual tub mats, which I always like). Beds are comfortable. Rooms have a real feel of being in a beach cottage. I have no complaints. You have the option of ordering a \"continental\" type breakfast each morning ($10 per person) which we enjoyed.", "title": "Dune view includes the ocean", "user": "ghustonus", "date": "August 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8488832, "likes": {"liked": "— Location and view", "disliked": "— Laguna Seca Pricing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The pool and jacuzzi are also very nice. Also, no cars in the hotel cottage area. You park at the front of the property and are assigned a golf cart to drive to your room, the pool and to the restaurant. My husband loved that.", "title": "Good value", "user": "rkagarwal", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8212614}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Very romantic, quiet (except for pool where you might find children from the timeshare section of the property). Hotel rooms are not set up for children and I would say it is not a child friendly place - which is fine with me. Most of Monterey is and it is nice to find a more relaxed, quiet, atmosphere.", "title": "Resort was okay", "user": "queenyaya", "date": "July 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8211778, "likes": {"liked": "— Room was big and we were near pool and beach", "disliked": "— Staff not overly friendly and restaurant was spendy"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Stayed with wife and daughter during recent MotoGP weekend. Hotel was pricey but compared to other locations in the area for this event, I thought their prices were reasonable. Was told in the off season the room could be had for under $100 and would be well worth the stay at that price. We booked a junior suite with dune view. Suite 602 I think. From our room we could see the Pacific so I don't know that an ocean view could have been any better, we though maybe the upstairs rooms were the ocean view but can't validate that, though they would see more. Room was clean, and the pictures on their website are representative of at least the room I stayed in. Of course, the golf cart thing makes the stay here a little different and it is fun. It's only about 10 minutes to the tourist stuff in Monterrey if you get tired of the dunes. Turn down service was nice and people in the lobby were friendly and helpful. They have free wireless internet but only in the lobby. Bed was quite comfortable and couch was big enough for my daughter, but just barely. The temperature controlled fireplace was a nice touch particularly at night. We would definitely stay here again (especially at off season prices).", "title": "Relaxing stay at Marina Dunes", "user": "2onvacaton", "date": "July 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8211101, "likes": {"liked": "— being on the Monterey Bay"}}, {"rating": 4.0, "title": "Nice place away from the crowds", "text": "We just stayed here for one night and had a good time. We originally had a room booked with an ocean view but cancelled it when we got in another way for less money. Our friends have a timeshare and was able", "helpfulness": 1, "user": "Bubnme", "date": "March 18, 2007", "id": 7184331}, {"rating": 5.0, "stay_parameters": "Stayed March 2004, traveled as a couple", "text": "to get us a two bedroom two bath with a kitchen and a livingroom", "title": "Best place I have ever stayed!", "helpfulness": 2, "user": "Sailoranne79", "date": "March 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7165356, "likes": {"liked": "— The quality of the rooms - first rate.", "disliked": "— Distance from Canary Row..."}}, {"rating": 5.0, "title": "Excellent stay!", "text": "for about 1/3 of the originally cost of the ocean view room. If you have friends who are willing to let you utilize their timeshare like ours did, it is the way to go (Thanks again Mark and Kim). The rooms are very clean and minus the ocean view... you can still listen to the ocean with the windows open. AJ Spurs is on the property and is always a good place to dine. If you hit the dining before 6 PM you can get in on the \"early bird\" special and save some cash for the same menu items. Overall, we really loved the place and would definately stay here again with or without the timeshare option. It is only about 10 minutes from Monterey and the Marina State Beach is walking distance from the Marina Dunes resort.", "helpfulness": 1, "user": "bigsicilianpunk5", "date": "March 1, 2007", "id": 6893542}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This is one of the nicest places I have ever stayed in on the beach. We had a fireplace in our room, a little porch overlooking the beach, the linens and bed were out of this world....I could go on and on. The staff were just unreal and you get a little golf cart to drive around in because they don't allow cars on the grounds which is really neat. Plus, the pool and Jacuzzi were really clean and nice.", "title": "Amazing Location Uncaring Staff", "helpfulness": 3, "user": "arubaseabreeze", "date": "February 25, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6840059, "likes": {"liked": "— The View", "disliked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "It is worth every penny!", "title": "Lovely Location - staff are rude though.", "helpfulness": 4, "user": "Lucy_OBrien", "date": "January 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 2.0}, "id": 6598384, "likes": {"liked": "— The location - fab sun set", "disliked": "— The rude check in staff"}}, {"rating": 2.0, "title": "Unhelpful Staff, Noisy Guests", "text": "Our room shared a hallway with other guests who held a loud party. No one was on duty at the desk to remedy the situation. The beautiful natural setting and peaceful sound of the waves was spoiled by the music from the next unit. It defeated the purpose of getting away from the noisy city.", "helpfulness": 1, "user": "epicticus", "date": "May 8, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 7565791}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We got no satisfaction from anyone over this, the next day the front desk said to call the maintenance man if it happened again. It did. We asked the guests to please tone it down. They didn't. We called. The poor maintenance guy had to get out of bed, into a golf cart. It took him 45 minutes to arrive. This place can be far from peaceful at times and has indifferent service.", "title": "Neat ocean front location", "helpfulness": 3, "user": "lovetotravel2929", "date": "May 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7488190, "likes": {"liked": "— Wonderful location on the beach!", "disliked": "— Walls were paper thin!"}}, {"rating": 5.0, "title": "Excellent getaway spot.", "text": "This was a nice stay. The rooms were very clean, and we had a beautiful ocean view. Check in was quick and easy, and it was fun to have a golf cart to drive around the property.", "helpfulness": 2, "user": "JohnLIrvine", "date": "April 29, 2007", "id": 7481454}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "I would say this is probably a 3.5 star resort instead of a 4. It has so much potential with its location that if they only paid a little bit more attention to detail, it could be a nice 4 or 5 star resort.", "title": "LOVED IT!", "helpfulness": 1, "user": "lkdb", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7429881, "likes": {"liked": "— Everything", "disliked": "— a little windy when we were there"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The fireplace was nice, but was a little weird that it controlled the heat- it kept clicking on and off all day/night. There was a sign in our room that said a few resident critters that lived in the dunes could possibly make it into our room- I was not excited about that, but we did not have any problems with them.", "title": "Told to go away at check in", "helpfulness": 2, "user": "SonofBing", "date": "April 19, 2007", "detail_rating": {"front_desk": 1.0, "location": 3.0, "value": 1.0}, "id": 7394425}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "Marina Dunes is like the little brother who thinks he's just as good as the older brother, but he really isn't. It wants to be a fancy resort, but it doesn't make it.", "title": "Good things, but bad things, too", "helpfulness": 3, "user": "George W", "date": "February 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4471819}, {"rating": 1.0, "title": "Weekender ... Beware!!!", "text": "The room was nice to the eye. My wife really liked the way it was designed. But the t.v. was on the other side of the room and it was small. I couldn't read anything that came on the screen. And the bathroom might have had two sinks, but there was no counter space. And when I woke up on our last morning I had ants all over me. That was disgusting and gross.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 19, 2006", "id": 4471589}, {"rating": 4.0, "title": "More than I expected!", "text": "They also don't have you park at your room. They give you a golf cart to drive around. This might sound quaint and fun, but it's just a pain and an inconvenience, and if the weather is bad, it's even more inconvenient. And when we checked in they didn't have a cart ready, but they said they would drop one off soon when they were charged. Well, 24 hours later we still didn't have one. When I walked all the way to the front desk to ask about it they said that we needed to come get one if we wanted one. That was a horrible answer and not the way to deal with someone.", "helpfulness": 4, "user": "Angela G", "date": "January 15, 2006", "id": 4354369}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Also, when we checked out and I complained about the ants all I got was \"sorry about that, now what did you take out of the mini bar?\" There was no effort to compensate me for something that I thought was rather disgusting. Even a free bag of pretzels and a soda would have made me happy, but they didn't even bother to try. I thought that was really weak. I also think the $15/day dunes restoration fee they charge is some sort of scam. I want to know what it is they are restoring and why I have to pay for it.", "title": "Words cannot describe how magical my stay was...", "helpfulness": 3, "user": "TCool0820", "date": "January 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4326214}, {"rating": 2.0, "title": "Nearly a great spot", "text": "The restaurant on site was great. They feed you until you're about to puke. A definite plus for the property to have that restaurant. And the close proximity to the beach is nice, although screen doors would be great on the patio. The bed was very comfortable and we liked the fireplace. It gave it a romantic flair.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4318807}, {"rating": 5.0, "title": "very enjoyable", "text": "We (wife, I and our 9 yr old) stayed in an ocean view suite and absolutely loved it. After reading some of the reviews I was a little leary, but would definately go back. Our daughter loved the idea of having our own golf cart and we cruised it around the property. Beautiful views of the ocean, a short walk but fun..The weather was overcast, but made it fun with the fireplace in the room..Staff was excellent and attentive...We enjoyed AJ's restaraunt, huge meals, but great food.. A hint for a cheaper room, Before you book the room log onto monterey they will normally have cheaper rooms at the Marina Dunes than Marina Dunes will have listed on their own website...after you find the cheaper price on monterey.com, call Marina dunes because they will match that price plus beat it bt 5% I believe..anyway enjoy your stay...we did!!!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3799164}, {"rating": 2.0, "title": "Less Than Perfect", "text": "The Marina Dunes is a nice idea--a hotel nestled in dunes by the ocean--but there are many annoyances that make one's stay less than perfect. The resort is a sprawl of townhouses that must be reached by golfcart from the parking lot at the foot of the hill. The construction is flimsy and sound insulation is poor. It reminded me of the cheap apartment that I lived in as a kid when I heard all the noises of my neigbhors (flushing toilets, footsteps, climbing stairs) above and besides me. Ask for a room on the second floor to minimize some of the disturbance. The bathrooms are nice, but the refrigerator keeps the food at about 60 degrees and the gas fireplaces don't do an adequate job when the weather gets very cold. Guests steal each other's golfcarts (God knows why) and our golf cart disappeared three times when we returned late at night to the parking lot. The resort was shrouded in fog 90% of our five day stay in August. If you can put up with some imperfections in your idea of paradise, The Marina Dunes is the place for you.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 7, 2005", "id": 3743393}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "I got back from my Marina Dunes vacation today. I had read the reviews here before booking. I’ll just give you my real world experience.", "title": "No regrets but not again", "helpfulness": 40, "user": "TuckerQ", "date": "August 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "service": 3.0}, "id": 3741079}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "ARRIVAL", "title": "Can't wait to return!", "helpfulness": 6, "user": "FrugalDreamer", "date": "July 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3723930}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "When we drove up, I was definitely surprised by how large the property is (as in quantity of buildings). Did you know there is a Trendwest time-share complex sharing the same property? I didn’t. It was not the quaint resort I had pictured based on their web site. This was just a surprise, not a huge disappointment.", "title": "Nice but needs some work", "helpfulness": 7, "user": "tsdiller", "date": "July 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3723928}], "location": {"country": "United States", "city": "Marina"}, "stars": 3.5, "variance": {"poor": 47, "average": 46, "very good": 143, "terrible": 24, "excellent": 282}, "aka": "Sanctuary Beach Hotel Marina", "slim_ranking": 0.125, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}