{"user_rating": 4.0, "review_count": 194, "name": "Sanctuary Rarotonga-on the beach", "reviews": [{"rating": 4.0, "title": "Thoroughly enjoyed our stay at the Sanctuary", "text": "We spent a week at the Sanctuary and thoroughly enjoyed ourselves. We had a downstairs room the opened right onto the beach and much of our holiday was spent on the loungers outside our room. The rooms are hotel style with a polenesian influence. Agree with other comments that they are not 5 star accommodation but they were ideal for a laid back beach holiday.", "user": "Kiwitony", "date": "December 11, 2011", "id": 121644698}, {"rating": 3.0, "title": "Not Five Star", "text": "The restaurant is as good as anywhere we found (except perhaps for our favouite Vaima) on the island, and that includes the overrated (in our opinion) Tamarind House.", "user": "Rich L", "date": "December 10, 2011", "id": 121602188}, {"rating": 4.0, "title": "Perfect relaxation resort", "text": "Service was friendly and efficient - much better than we have encountered on other pacific island.", "user": "gilesgolf", "date": "December 8, 2011", "id": 121533701}, {"rating": 3.0, "title": "Stay somewhere else", "text": "All in all we were very satisfied with the Sanctuary and would go back anyday.", "user": "Feisty003", "date": "December 5, 2011", "id": 121435519}, {"rating": 5.0, "title": "We found our island paradise", "text": "Hotel lists as being five star and the newest adults only resort in Rarotonga. Our experience was not as we expected. Our arrival time was 01.30am 21/11/11 but the The Sanctuary did not book us in until 2.30pm so there was a heated discussion about that which ended up with us being put into a garden view room which the porter expalined was a store room. Room would at best be classified as 2 star. Later in the day we asked to speak to the manager and was told to wait and she would see us in 15 minutes. After half an hour we left without seeing anyone. We received our prebooked room at about 2.00pm in the Sanctuary. Room was large enough but in the same decor as the storeroom we slept in the previous night. The beachfront room was more of a beach view room and if the large bush outside our room had leaves on it then that is all we would have seen. There was a dirty towel in the wardrobe when we arrived and was still there when we left. Room cleaniless was average not five star. Restaurants were average and the food was average. The grounds outside the rooms were overgrown with weeds and with soem cigarette butts and old rusty bottle tops around. Staff were friendly except the reception staff on our arrival who could not understand that an arrival time at 01.30am was just that and not the 2.00pm they said it meant.", "user": "BexJesse", "date": "December 5, 2011", "id": 121432348}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were unsure what to expect having read some not so positive reviews but by the end of our holiday we couldn't fault the hotel or the staff. The staff were extremely helpful and were more than happy to do everything, we didn't have to lift a finger. We ate all of the restaurants at both the Sanctuary and the Rarotongan at least once and we never had a bad meal. Our room was fantastic with views over looking the water and only a few metres walk to the lagoon. We can't wait to go back!", "title": "Couldn't be better!", "helpfulness": 6, "user": "Jacinta_Will", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123090592}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "Stayed at sanctuary last few days of December and into January 2012.", "title": "Nice, not great", "helpfulness": 3, "user": "Nindethana", "date": "January 4, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 122501276}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This resort is nicely situated with lagoon swimming and white coral beaches. Sanctuary is located next door to sister resort the rarotongan and offers child free accommodation. Kids and families stay at the rarotongan.", "title": "We will be back!", "helpfulness": 6, "user": "Elise_and_Greg", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122371054}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The resort has a limited understanding of customer service with little assistance from porters, waiting staff are slow and reception staff are not really top notch. In fairness they seem stretched and poorly organised so it's probably a management issue rather than individual employees.", "title": "Our most amazing holiday ever!", "helpfulness": 1, "user": "Surfer G", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121999692}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Some rooms suffered leaks when it rained. There's lots of Mosquitos at night time.", "title": "Peace & Quiet, but still able to interact with our group", "helpfulness": 1, "user": "sjwhiteford", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121754564}, {"rating": 3.0, "title": "Great holiday", "text": "We stayed at the Santuary for 5 nights because we had a wedding at the Rarotongan Resort. If I would choose accomodation again- I would have chosen another place. The rooms are small, nice but not really 5 star. We stayed in room 732 which was upstairs, so our balcony looked at half bush and half ocean. It was a quiet place (no kids) but it was in fact really boring. We often went to the Rarotongan Resort for breakfast, the bar and restaurant because there was more happening there. The staff are great but don't expect 5 star service and things do eventually get done.... One recommendation would be for the staff to be more responsive and be nice to get some eye contact.", "user": "mrosec", "date": "November 26, 2011", "id": 121040102}, {"rating": 4.0, "title": "Very relaxing.", "text": "I would recommend however (as other family members stayed at) is Lagoon Resort (rooms 1 to 4 and 21 or 22) and the Rarotongan Resort beach front rooms.", "user": "Kiwignome", "date": "November 24, 2011", "id": 121005380}, {"rating": 5.0, "title": "Lovely resort to spend a honeymoon", "text": "I stayed here for two nights as my niece was getting married next door at The Rarotongan Resort. I was a bit confused on arrival as I thought I was staying at the Rarotongan as well. The driver pointed out that I was staying at the Sanctuary. After checking in I was pleasantly suprised by how good my room was after reading reviews of the Rarotongan. My room had an amazing view and was so quiet. I only had one small hiccup I was given vouchers for the basic breakfast when I had paid my travel agent for the full cooked breakfast which was very good. A quick phone call to reception fixed this as I asked politley not like another guest who ranted and raved at the staff. I never saw any children on our side but did spend a bit of time catching up with my family as they had travelled from NZ. I would recomend the Sanctury as I dont know what the price differance is but worth paying extra for the newer rooms and view.", "user": "Charlottec81", "date": "November 20, 2011", "id": 120827018}, {"rating": 3.0, "title": "room excellent, staff attitude disappointing", "text": "Fantastic resort. Fabulous staff, great food, delicious cocktails, perfect location.", "user": "BARBARA M", "date": "November 19, 2011", "id": 120801863}, {"rating": 3.0, "title": "Don't expect a 5 star resort here", "text": "We checked out yesterday after an amazing honeymoon. We stayed in room 706 which looked straight out over the lagoon. I think we were extra lucky that we got this room as it was in the best block. Our room was serviced daily while we were out and about - always clean and relatively bug-free. The rooms are a bit compact, but no smaller than your typical studio room in a hotel. I wouldn't have expected anything more on the islands.", "user": "Visiblyred", "date": "November 14, 2011", "id": 120597605}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed at the Sanctuary one night when we were in Raro as a treat for my birthday. The room was good and it has a nice, but small, pool area. The beach is lovely. I had booked myself in for some spa treatments, a massage and pedicure, and they were okay... I've had better and faster (the pedicure took over an hour!). We had dinner at the restaurant and it was alright. We had better meals in other restaurants and cafes on the island. It was all rather expensive, too. Maybe booking a package through a travel agent would get you a better deal.", "title": "Would've liked to stay longer, but pricey", "user": "Angelco", "date": "March 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126210453}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a great break in May 2011 at the Rarotongan. We opted to stay in the adult wing. Upstairs is definitely the better group of rooms as downstairs anyone walking along the beach can see directly into the downstairs rooms. The food at the restaurant on site was better than we had expected. The weather was much worse than we expected but such is the mix at Rarotonga. The staff were fairly uninterested in service not to say they were rude but just very very laid back. We did have a wonderful massage across the road from the resort (it’s still part of the resort).", "title": "Relax and unwind", "helpfulness": 1, "user": "themacgirls", "date": "March 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126060697}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Overall the food was fantastic at the various spots we ate at. Top of the list is the Tamarind Tree restaurant. Lovely setting with great food- seafood platter could have easily fed us both. For the most romantic setting I suggest Little Polynesia hotel not far from the Rarotongan. Picture perfect setting, attentive staff and fantastic food.", "title": "Sanctuary", "helpfulness": 1, "user": "Matt B", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 125770968}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Overall I would go back but would hope we’d get better weather next time.", "title": "Average taking everything into account", "helpfulness": 7, "user": "london4travel", "date": "February 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124133677}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The helpfulness and friendliness of the staff cannot be faulted.", "title": "Good but Could be a bit better!", "helpfulness": 4, "user": "KristySp", "date": "January 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123939508}], "location": {}, "stars": 4, "variance": {"poor": 12, "average": 47, "very good": 72, "terrible": 7, "excellent": 56}, "aka": "Sanctuary Rarotonga-On The Beach Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A true taste of the exotic Cook Islands in the heart of the South Pacific, Sanctuary Rarotonga is an adults-only resort located on the pristine white sand shores of Aroa Lagoon. All suites are absolute beachfront. Tropical buffet breakfast, many resort activities, and daily activities program are included in the nightly rate. The perfect location for a romantic honeymoon or a relaxed beach holiday. Three effortless Weddings in Paradise packages. A true South Pacific paradise."}