{"user_rating": 4.0, "review_count": 645, "name": "Sanderson London Hotel", "reviews": [{"rating": 5.0, "title": "superb hotel and service", "text": "Second time at the hotel on a business trip. Excellent service from check in to check out. Room service is a bit overpriced and foreign exchange rates are not competitive although there is a FX exchange within a five minute walk. Agua spa is woth a visit, buy book ahead for any treatment. Long Bar is a must, noisy and jammed from 6 pm on Friday evenings, but the Purple room is rather quiet. Not for eveyone since this is a non traditional hotel but if you are into design, fashion, media, and music, you will not de disappointed.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 5, 2005", "id": 3636191}, {"rating": 3.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "Let's start with the obvious - the Long Bar is a great, trendy, very expensive restaurant that's a draw for people in London, and a fun part of staying at this hotel. But I was otherwise very disappointed in this place, as I seem to be lately with all the Shrager properties. The service was inconsistent - ranging from calm and professional to aloof and judgemental. The room were incredibly small, and while chic, it felt cold and impersonal. But what surprised me was that it was quite noisy; I could clearly hear people in the hallway all night long. When I went to check out, there was a huge screw up with extra charges and it took far longer than necessary to get settled, making me nearly miss my flight to the airport. (I was there an extra 40 minutes!) I wouldn't stay here again.", "title": "Overrated", "helpfulness": 5, "user": "eurokitten", "date": "July 1, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3624471}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I booked this Hotel as a surprise Christmas present for my sister (we also went to see Cirque Du Solieil at the RAH). If you like contemporary and to be in with the \"it\" crowd then this is for you. I thought we were checking into an office block when we first arrived as the outside is nothing special although the doormen are very handsome! Check in was amazingly quick and straightforward. The lobby is quite strange - not quite sure what the theme is and whether sitting on a seat resembling a large pair of lips is comfortable - but!. As everyone says the lifts are amazing. Take the steps at the first floor to see the amazing stained glass window as you drift down to reception. Although it was February we took a look at the outside space which I can imagine is lovely in the summer. The 'long bar' is just that and at night was filled to capacity with \"beautiful\" people who I think come to be seen. We went in to the Purple Bar which is for residents only. It is quite tiny considering how many rooms there are in the hotel. You can only get in here if you show your hotel card which is taken off you!! - and for some reason there are tiny chairs in here only 1 foot off the ground!!!. Masses of Vodka cocktails ranging from about £12 and the \"baristas\" were making loads of complicated cocktails!!", "title": "Sisters Fav Hotel!", "helpfulness": 2, "user": "aimee-Jay", "date": "February 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13409006, "likes": {"liked": "— Quirkiness", "disliked": "— The price!!!!!!!!!!!!"}}, {"rating": 4.0, "title": "Awesome!", "text": "The room - fantastically huge as I had booked a twin room, the beds were almost double and extremely comfortable. The air conditioning did keep us awake so we turned it off. Bathroom is OK and the \"pink\" curtain you can draw electronically gives enough privacy. Toilet is separated by glass (frosted) and the shower once I had turned it on and drowned myself was lovely. Be wary of the expensive goods in the bathroom - easily recogonised as to 'pay for' as they are all wrapped up. Used the hairdrier which was fab- not one of these tiny things you get in most hotel rooms but a proper drier. The inclusion of bathrobes and umbrellas (in case it rains outside!!) a nice touch. I agree with the comments of one of the other writers in that the TV/'expensive' mini bar housed in what resembled a formica cabinet from B & Q was ugly and outdated - not atall in keeping with the lushness of the rest of the surroundings - not quite sure I get the non-entity picture on the ceiling either!!!", "user": "paradisetrip", "date": "January 23, 2008", "id": 12930877}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I would say that the Hotel is ideally situated if you want to shop - we walked to Oxford Cicus without any problem. Taxis to Harrods (packed on a Sunday!!) from the hotel cost about £13 and to RAH another £13.", "title": "Worst two night's sleep of our lives", "helpfulness": 5, "user": "HotelSchmotel", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 12154492, "likes": {"liked": "— The food", "disliked": "— The room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Breakfast is lovely - loads of choice although I consider it expensive if not booked as part of your package.", "title": "Out Of This World!!!", "helpfulness": 5, "user": "robz16", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 12055307, "likes": {"liked": "— Uniqueness!!", "disliked": "— Price of the room and cost of everything!!!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "My sister loves this Hotel (and its sister St Martins Lane near to Covent Garden) - me, not quite sure if I would stay again, £358 for one night is as others say rather overpriced!", "title": "A great place to party but not necessarily for business", "helpfulness": 2, "user": "highlandbride", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 11869753, "likes": {"liked": "— well located, fairly quiet street", "disliked": "— Impractical but stylish - the designers have likely never stayed in their own rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "I have stayed here once before for business. Last time I found it a little too funky, appropriate for people younger than me. But my usual hotels in London were booked up, so ended up staying here again. This time, I was more comfortable. The glass wall around the bathrom did not bother me. Actually, I liked the firmness of the bed. The services such as the laundry valet, front desk, etc was good. The concierge, however, seemed a little less knowledgeable than usual for this class hotel. There is a popular bar in the lobby and the restaurant is extremely expensive. But I liked the hotel. Decent value for money.", "title": "Nice Hotel", "helpfulness": 2, "user": "relaxed_dude", "date": "December 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11206148}, {"rating": 5.0, "title": "Great place to take a girl", "text": "This was one of the best places that I have ever taken a girl - it was awesome - they have white draped curtains and a bed that is huge! And - it is right in the middle of London, with great access to Oxford Street and the Theatre DIstrict. I stringly recommend this place.", "user": "sielay", "date": "November 6, 2007", "id": 10640511}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This hotel is awesome, please please stay if you get the chance, you wont be dissapointed!!!", "title": "Awesome Hotel, cant wait to go back!!", "helpfulness": 1, "user": "jetsetter2008", "date": "October 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10352137, "likes": {"liked": "— Everything", "disliked": "— Nothing at all"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Good hotel with lots of amusing design quirks. Decent restaurant with nice courtyard .", "title": "Multiple visits, like it", "helpfulness": 1, "user": "blackster", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 10252027, "likes": {"liked": "— Its style", "disliked": "— not much"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I have stayed there on a number of occasions and enjoyed it.", "title": "Great Lifts - Great Spa", "user": "kimferguson32", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10109272, "likes": {"liked": "— Funky furnishings"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Just come back from 1 night stay in Loft balcony suite and highly recommend this modern, chic hotel right in the middle of where you need to be in London. Fabulous room, great service from reception to bar staff and bellboy. Will return!!! Thank you.", "title": "Fantastic stay", "helpfulness": 1, "user": "slatfisher", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30584309}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Very disapointing . Rooms where good looking but dirty.There were even specks of blood on the ladies lobby toliets.We cound,t check in to 15.00 and had to leave by 12.00 alot of money for not even 24hrs.Had two rooms which where booked last year but cound,t even get them on the same floor .For real service ,style and what a hotel of this calirber should be stay at The langhams", "title": "tatty all style no substance", "user": "stoneg72", "date": "May 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 30538710}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I liked staying here - There is a modern design triumph everywhere you look. The service was friendly and competent. The location is very central. I stayed in room 129 and there was wifi from a neighboring building, so i avoided paying the annoying 15 pound charge for internet - yay! One thing i didn't like was that the gym was positively arctic from the blasting air conditioner!", "title": "i feel cool now", "user": "nbehring", "date": "May 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29932145}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My younger co-worker (24 yrs) was definitely more enchanted than me, and i suspect this place is a hit with twenty somethings.", "title": "Didn't quite meet expectations", "user": "crazeedave", "date": "May 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 29641742}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed here for one night, on recommendation from friends. The location was excellent for shopping, easy access to underground car park, etc. I don't know quite what we were expecting, but the room just felt a bit too stark. Would probably be ok for some people (white walls, picture on ceiling), but we just didn't feel comfortable. Having the bathroom behind a curtain and the toilet in a glass box was just too much for us! - ok for some I'm sure, but was just lost on us! We didn't try the food, but the bar was definately fun. We've stayed at The Soho Hotel a few times, and next time we're in London we will return, we just felt so much more comforftable there, and love all the little extra touches.", "title": "Tired, tatty and overpriced", "user": "LondonThelma", "date": "May 7, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 29512519}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "This was my second stay at the Sanderson. I had previously forgiven its hipster quirkiness since I love staying at cool \"design hotels\". But this time...I found so many little annoyances, that it pretty much added up to one BIG feeling of frustration. I'm all for 'intentional imperfection\", but the vanities and the artwork are askew enough to look like a mistake. I'm also a petite 5'2\" woman...and yet, I keep running into table corners, the glass partitions that are slightly too wide, and the bathroom doors that are slightly too narrow. I felt like Alice in Wonderland on a very mild acid trip. What's the point?", "title": "The Price of Awkward Design", "helpfulness": 1, "user": "keryninbali", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 48712529}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "If you are traveling for business, get ready to throw your computer out the window. The connection is so slow and craps out so often, that you're liable to lose all your work. (Which is why I've had to write this review 3 times!) I made several calls to the front desk, and just got the run-around and never got any help. I'm sorry, but in 2009, I have to dock any 5-star hotel for charging $15/day for wireless.", "title": "Exceeded My Expectations", "helpfulness": 1, "user": "flawlesslondon", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48232109}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The spa and the gym is lovely, however. For me, a spa freak, it is its saving grace. I was disappointed though that I have been denied my Eve Lom facial several times because they are always overbooked. So plan well in advance.", "title": "Signed up..Just for this", "user": "mercurial1985", "date": "October 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48063872}, {"rating": 5.0, "title": ".", "text": "Also, bring your own music and movies. I submitted a list of about 10 from their library, and got 3 of my least preferred back.", "user": "OcariG", "date": "October 17, 2009", "id": 47093562}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Again, this is not a horrible hotel and it does have a trendy vibe. But by 5-star standards, it's a bit frustrating, especially when one compares to the impeccable service and attention in 5-stars in Asia. It reminds me a lot of the Soho Grand or Paramount in NY...where the hype keeps it alive.", "title": "Potentially great but let down by service", "user": "Jon1407", "date": "October 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46909152}, {"rating": 5.0, "title": "Too cool for school!!!!", "text": "No two ways about it, this is a seriously cool hotel. OK, so it's not exactly cheap but if you are looking for something special this is it.", "helpfulness": 1, "user": "JeremyCPortsmouth", "date": "September 30, 2007", "id": 10023187}, {"rating": 2.0, "title": "Good but not perfect!", "text": "The entrance lobby is fantastic with loads of weird chairs and sofas to relax on. There are two bars leading off from the lobby. The first (The Purple Bar) opens in the evening only and is small and very intimate. They serve a huge range of martinis.", "helpfulness": 4, "user": "jules1974", "date": "September 25, 2007", "id": 10002655}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "The second (The Long Bar) is open all day and worth checking out. Not cheap (2 cocktails cost me 30 pounds!).", "title": "hype & trendy", "helpfulness": 3, "user": "nightcrowler", "date": "September 11, 2007", "detail_rating": {"value": 3.0}, "id": 8693627, "likes": {"liked": "— rooms and location", "disliked": "— housekeeeping"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The room was minimalist but beautifully presented. Only drawback was that here was no bath in the en suite.", "title": "Modern Chic and Sexy", "helpfulness": 3, "user": "gazborangers", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8686495, "likes": {"liked": "— The massive sleigh bed", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Definately an experience worth repeating! Take my advice on this one and book yourself in.", "title": "Is Sanderson too cool by far? Surely not!", "helpfulness": 1, "user": "deeebee", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8550513, "likes": {"liked": "— Roof terrace, bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Much hype about the Sanderson, a 50's building transformed by Philippe Starck. It definitely a cool hotel. As always in London it's hideously expensive - wether it's value for money is gonna depend on you. We had a deluxe King Room. Large bed but very hard and very uncomfortable. Great Linen as you would expect. Pretty rubbish tv channels but who is there to watch the telly anyhow. Oh yes, and lovely huge bath tub.", "title": "I liked it, not a lot but I did like it", "helpfulness": 2, "user": "JMuk", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15455478, "likes": {"liked": "— cool bars and scrummy mojitos", "disliked": "— no chocolate cake - what sort of hotel has no chocolate cake?!?"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "Cool bars, extremely yummy breakfast in bed, fantastic mojitos, but at that price it's no more than you would expect. My one disappointment, not being able to get a cup of tea and a slice of chocolate cake in my room at 2am. It's what I needed after a night out but apparently there was no cake in the kitchen! Big let down.", "title": "Best for fun", "helpfulness": 1, "user": "LHenderson", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 15097085}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "I liked it, not sure I'd go again though. There's nicer places in London for this price.", "title": "A wonderful stay", "helpfulness": 1, "user": "pixie6", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14766074, "likes": {"liked": "— The room", "disliked": "— The maid trying to get into clean at 8 in the morning!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The Sanderson is the best for a night time with a girlfriend or romantic weekend with boyfriend. But in general the best things about the sanderson you can experience even if you do not stay there...the bar, the terrace, the food (not amazing but interesting) and the spa. It is definitely worth using but not sleeping in it!!", "title": "Not Impressed", "helpfulness": 2, "user": "Sweetbear", "date": "March 6, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 14084009, "likes": {"liked": "— The location.", "disliked": "— The staff."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Have just got back from a brief and wonderful stay. This is such a fantastic hotel - it looks amazing, particularly the rooms with all the white floaty curtains, and the staff were very friendly and helpful. Also had some spa treatments - and again a wonderful relaxing atmosphere and very attentive and capable staff. I would definitely recommend it - can't wait to go back.", "title": "A Spaceship", "helpfulness": 2, "user": "LindaLouNewJersey", "date": "March 5, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 14082608, "likes": {"liked": "— Location", "disliked": "— Dark hallways"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My initial apprehension as we approached the time of our stay at the Sanderson was heightened when we arrived at the entrance of the hotel directly from Heathrow after a 12 hour flight, and there was nothing to signify it was a hotel entrance, no porters nor doormen to welcome us or, at least, to help us with our luggage. It was 6.30pm. Finally, after struggling with our luggage and practically kicking the front door open, we were met with...", "title": "Mixed Feelings", "helpfulness": 1, "user": "OccasionalMasochist", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 39148061}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "nothing....", "title": "Dont even think of dining at the Suka or having a business dinner!!", "user": "Shwina", "date": "August 25, 2009", "detail_rating": {"cleanliness": 1.0, "location": 1.0, "rooms": 1.0}, "id": 38735696}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "but funky designer furniture pieces... and a smart-looking bar to our right and the front desk on our left.", "title": "Outdated, tired and noisy", "user": "TimeframeLondon", "date": "July 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 36075605}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Determined not to be put off, this being the first holiday my husband and I have had together for a while, we approached the front desk. Perhaps my experience with Asian 5 star hotels has coloured my opinion but I've always felt that notwithstanding the decor of the hotel, how funky, cool or avant garde it may be, the friendliness/sincerity of the reception/front desk staff should be a priority. But this was not to be. We had an adequate reception. Enough said.", "title": "overpriced", "helpfulness": 1, "user": "conkers99", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 35526229}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Things started to look up when the young bellhop led us to the strangely incongruous lift darkened with scenes of space, the Final Frontier..., and apologised that he had not been there to help us with the luggage as he was assisting another batch of guests. His sincerity and warmth was a contrast to our initial reception.", "title": "Chic, funky, and central - you will love it here", "helpfulness": 1, "user": "hotelreviewer2008", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33401668}, {"rating": 4.0, "title": "Celeb spotting", "text": "Decided to take a young lady friend to see the delights of the Purple bar.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 1, 2006", "id": 4565931}, {"rating": 4.0, "title": "Hype - but better than OK", "text": "Was not disappointed at all in the place from the moment I met the concierge.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3676418}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "From the incredibly stylish entrance, bar and cathedral with pool table to the chic and innovative choices and detail paid to the guest suites, the Sanderson in London by far is one of the most comfortable, convenient and hip properties I have encountered in my travels.", "title": "The Sanderson in London is Incredible.", "user": "BusinessTravelerSF", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46790066}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The staff is friendly and dedicated to service - as I was stepping out of my black cab I was greeted by name, until my room was ready they took my luggage and sent me off to the spa on the 2nd floor.", "title": "A certain idea of Perfection", "user": "Jean Charles C", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46743047}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "Room service within 20 minutes generally, and an in-suite bar selection you would expect from Morgans Group (Generous quantities of \"Top Shelf\" Liquors and Beers, Wines and aperitifs). My one tiny complaint is the Exclusive Hotel Guests Only Bar - \"Purple Bar\", doesn't carry Jack Daniels, it's simply not fancy enough!", "title": "Amazing Experience - One of the Best Properties I've Ever Stayed", "user": "Jabrs1643", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46255012}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "While staying In London for 26 nights, it didn't take long for the Sanderson to become my home away from home. All I can say now is that I'm homesick for Sanderson!", "title": "2nd Wedding Anniversary Stay", "user": "spencekersey", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45560944}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "Bottom Line - It's a great destination that won't disappoint - Business & Pleasure combined.", "title": "So, So, So Cool!", "user": "Crash89", "date": "September 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 42199239}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Sanderson is definately my favorite hotel. This was my second stay and it was even better. The standard rooms are a little smaller than the superior but they are just as much fun. Everything is very clean and modern. I love the curtains and the glass between the bathroom and room. All of the staff are friendly if you are staying at the hotel and it is easy to get something if you need it. The Long Bar is always fun and makes some of the best drinks in London, as does the Purple Bar. The lobby is a scene and always fun to walk through. The agua spa is amazing, really one of a kind, and has great massages. The restaurant is nice in the summer because you can sit in the outside terrace which is beautiful. The food is good but for the money I'd recommend Asia de Cuba at the St Martins Lane. The location is also perfect as it is right near Oxford Street and Soho, everything is walking distance, good for restaurants and nightlife. It's very expensive but I'll come back whenever I have the chance.", "title": "Favorite hotel in the world", "helpfulness": 1, "user": "fan987", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5501133, "likes": {"liked": "— Room, Bars, Location", "disliked": "— Nothing"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 39, "average": 76, "very good": 177, "terrible": 22, "excellent": 331}, "aka": "London Sanderson Hotel", "slim_ranking": 0.171162790698, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A lavish \"Urban Spa\" in the heart of London’s West End, Sanderson offers a retreat from the bustle of the city into a world of fantasy and wellbeing. The landmarked 50s building has been transformed into a surreal Cocteau-like dream world, epitomizing a “new luxury” that is smart, pared down, and tempered with a healthy dose of wit and irony. Sanderson’s indoor/outdoor lobby is a layered and sophisticated environment that is totally original."}