{"user_rating": 4.5, "review_count": 970, "name": "Sandy Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "This hotel was amazing to stay at! We stayed on the 18th floor and had a gorgeous view of the ocean. Our \"room\" was more like a good sized apartment with a full kitchen, washer/dryer, dining room area, and decent sized living room along with a very nice bathroom and large bedroom with a king sized bed. The best part was it was under $75 each night we stayed there!", "title": "Love this hotel!", "helpfulness": 2, "user": "Aveadora", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21929886, "likes": {"liked": "— The comfortable bed, gorgeous view, and great price!", "disliked": "— Parking was a pain, we didn't know where to park at first."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Being able to walk down to the beach and watch the sun rise was an amazing experience, the hotel is literally ON the beach. The clerks at the front desk were very nice and helpful, anything we needed they helped us with.", "title": "Great Family Vacation", "helpfulness": 4, "user": "familygirll", "date": "November 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21489521, "likes": {"liked": "— view, location, pools, amenties", "disliked": "— staff was not as friendly as expected"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "This was probably the best stop on our honeymoon trip and we loved it so much there that we can't wait to go back again and bring some of our friends with us!", "title": "Nice Room - Good Experince", "user": "gandpa", "date": "October 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20666065, "likes": {"liked": "— Nice Room, Views", "disliked": "— Kiddie Pool Cold, Hot Water In Room. Bikers"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "After weeks of internet research, I chose Sandy Beach Resort in Myrtle Beach as a vacation spot for my family of four. I chose Sandy Beach because the property offered absolutly everything I was hoping for without breaking our budget. We were not disappointed. We had a great time! When booking at the Sany Beach Resort, make sure that you request a suite in the Palmetto building. After reading the reviews, I called the hotel myself to ensure that my reservation was for a room in the newly rennovated building. When we arrived, there was a staff member there to greet us before we even got out of the car. The hotel lobby was clean with a very trendy yet welcoming allure. The staff was not as friendly as I would have liked but they were helpful. The room looks just as it is pictured on the company website. It was clean and spacious enough for our family of four. Just like most of the families we met, we cooked each day that we were there. The kitchen had everyhting we needed (full size fridge and stove, dishwasher, microwave, coffeemaker, plates, cookware, and utensils). If you want to grill outdoors, there is a grill by the pool. The hotel staff will even provide you with charcoal. The rooms also come with a washer and dryer. This added convience made our stay even better as we were able to keep our swimwear clean, dry, and ready to wear. The best feature is the view! Every room in the Palmetto has a beachfront view with a private balcony. The first night my husband pulled down the wall bed in the living area. We opened the door to the balcony and enjoyed the sound of the waves from bed. We made the most of the view by moving the dining room table closer to the sliding door to enjoy the view as we sat down for a meal. In addittion to the pull down bed, the deluxe suite offers two queen size beds in the bedroom as well. The beds are ultra comfortable. I took an hour nap and awoke feeling like I had slept all night. There is a bar located next door to the hotel. I was able to order drinks to bring back to the room for myself and my husband. They offer a discount to Sandy Beach visitors. We spent hours outdoors enjoying the pools and the beach. My kids loved the kiddie pool and the lazy pool. In addittion to the kiddie pool and the lazy pool, there is an indoor pool, three or four outdoor pools and three jacuzzis (one indoors). There is a gate leading right onto the beach from the pool area. When you get tired of the water, there is a family amusement park directly across the street (great for small children) and a family water park next door. Having to park the car across the street was the only inconvience. However, we never had to leave. There is a store across the street and a Walgreens well within walking distance. There is a coffee pot in the room and the hotel offers free coffee in the morning. There is also a Starbucks and Dunkin Doughnuts within walking distance. We had a great time. We have already decided to go back next summer and we will without a doubt or thought be returning back to the Sandy Beach Resort. At the Sandy Beach Resort, you will get the location and amenties you need and desire for a reasonable price. Enjoy!", "title": "Love Sandy Beach, My New Home!!!!", "helpfulness": 3, "user": "Lizzey", "date": "September 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20451232, "likes": {"liked": "— great location", "disliked": "— parking"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "My Wife And I, Plus Our Son, Daughter-In-Law, And 2 Grand Children Had A Very Nice 3 Bedroom, 2 Bath Oceanfront Condo Unit. Room Was Clean. We Stayed 7 Days. Maid Service Was Ok. Great Views Of Beach, Pier, And Coast Line. Pools Were Clean And Warm, Except For Kiddie Pool. We Had To Beg Management To Turn The Heat On. They Cut It On For One Day, Then Promptly Cut It Back Off The Next Day! What Was Up With The Hot Water In Our Room? It Took At Least 5 Minutes For Hot Water To Start Running Out Of The Taps. Waisted A Lot Of Water And TIME. Also It Was Biker Week, Our Bad. While We Didn't Have A Problem With The Bikers Themselves, We Did Have A Problem With The Parking And Noise. The Bikers Were Allowed To Park In The Loading And Unloading Area Of The Hotel. It Got To Be Hard To Move Around And They Even Let Bikers Park In Front Of The Elevators. We Stayed On The 4th Floor. We Heard Every Time A Biker Was Coming Or Going All Hours Of The Night. The Sound Echoed Through Out The Hotel Area. Even The Pool Areas Were Noisey. Why Couldn't The Bikers Been Made To Park Across The Street With Everybody Else? Did They Pay More For Their Rooms Than Other Guest?", "title": "Great Place for Kids", "helpfulness": 1, "user": "952", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20449517}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I was disappointed with our room, the furniture was outdated, the microwave door was broken, and the handles on the entertainment center was falling apart! I was expecting more because of the reviews I read on line.", "title": "Average..I've Stayed In Better!", "user": "kassius11739", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20407968, "likes": {"liked": "— oceanfront", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My wife and I stayed at the sandy beach resort in Myrtle in september of 2008, and I was totally blown away by this place. 1st of all the value for your money is unbelieveable , I've stayed in some $250 a night places before and this place for half of that gives you more ammenities, like flat screen tvs, great king size beds, jacuzzi tubs, over1,100 square feet of living space and beautiful marble counter tops, with stainless appliances, fridge, dish washer, microwave, stove and oven, and beautiful mood lighting, and tiled floors. The pools were great spaceous never too crowded might be a result of when we went but none the less. The jacuzzis outside were also great we did see some people getting a little to freaky in the jacuzzi one time but hey I digress,, This is a wonderful hotel with a great staff , great front desk, and wonderful house keeping staff, my only gripes, were that the shower could use a little more water pressure but we were on the 12th floor so that might have been a result of that I'm not sure. I love this place and you can be sure I'll be back in 2009 The sandy Beach is luxury you can afford !!", "title": "Sandy Beach is the place to be !!!!", "helpfulness": 2, "user": "tiffyv83", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20398129, "likes": {"liked": "— The rooms just totally beautiful !!!", "disliked": "— room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at the Sandy Beach Resort 09/11 thru 09/14. I must say that it was a great experience. This was our first trip to Myrtle Beach and I was a bit concerned about the place, not knowing anything about it. It turned out to be the best choice I probably could have made in selecting a hotel. It is located conveniently to everything and it was pretty easy to find. I am a stickler for cleanliness and this place was by far cleaner than any other 4 to 5 star hotel that I've visited. I was fortunate enough to be on the Palmetto side which is the newer side of the hotel. Not sure if that matters to most but I chose that side strictly from other reviews. It was not a let down!", "title": "A Great Stay", "helpfulness": 1, "user": "feel_this1", "date": "September 18, 2008", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 3.0, "rooms": 5.0}, "id": 20171654, "likes": {"liked": "— The room itself", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "I would have rated this hotel 5 stars but I didn't particularly get warm and fuzzy feelings from the front desk person at check-in. I, like another reviewer, got the most wonderful welcome from the security guards that were outside as you pulled into the roundabout at the hotel. Perhaps, the guy at the check in desk had had a long day when we checked in and a longer night when we checked out as his attitude was non-changing. Also, I was aware of the parking issues from other reviewers and my take is that it is a little annoying to have to park across the street but like others stated - you can always find a spot, it felt safe to leave my vehicle and it's FREE! Enjoy...", "title": "My Favorite Hotel Stay Ever!!!", "helpfulness": 1, "user": "Tsax", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20065862, "likes": {"liked": "— The room. All the cool toys, gizmos, and stuff that came with the rooms", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Ah, where to begin....I am an amateaur photographer who like to spend time taking photos at various places, so I was ready for a new adventure", "title": "Absolutely LOVED this resort", "user": "zoiesmom", "date": "September 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19971074, "likes": {"liked": "— The outside pool area", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "First of all I have to say this resort is absolutely beautiful! It was easy to find and check in was a snap! We pulled up and the security guy (don't remember his name) pulled out his list and found our name. (He was soooooo friendly!!) He directed us to park for about 15 minutes to check in and take our bags to our room. Check in was easy, we were there right at about 4PM. The room was ready to go! We took the elevator (which was fast and clean one day there was water on the floor, immediately we saw someone come to clean it up!) up to our 1 bedroom, oceanfront (on the top floor) room in the Palmetto building. It was BEAUTIFUL! Decorated lovely. I never would have guessed it was a hotel. The decor was tasteful and not tacky as most beach hotels.", "title": "Beautiful Resort!", "helpfulness": 1, "user": "travelingncchick", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19918468, "likes": {"liked": "— Nice quality hotel.", "disliked": "— No wireless in the rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The full size fridge was nice as all of the appliances. They were high quality appliances actually, which was a pleasant surprise.", "title": "Great for Families!", "helpfulness": 1, "user": "aaa_rose", "date": "September 8, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 19900995, "likes": {"liked": "— The unit was so clean!", "disliked": "— Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The balcony was a nice size and had a light you can turn on and off yourself, but it wasn't too bright to distract the beauty of the ocean.", "title": "Wish we were still at SB!!", "helpfulness": 1, "user": "gatormama20", "date": "August 25, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 19360481}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel itself was clean and nice. The pools were not too crowded (except for a rude couple making out in the Jacuzzi, which I didn't appreciate...however that isn't the hotel's fault). The hotel doesn't have room service, but there are several restaurants that deliver for free and the same restaurant/bars are right downstairs around the corner. I checked out GiGi's, twice. The first time the bartender was fantastic, loved her! The jukebox was great too. The next time I went back the drinks were disgusting and the other bartender was horrible, so guess it was a toss up with that.", "title": "Still a great place after all these years.....", "helpfulness": 1, "user": "NE1nRoanoke", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19321003, "likes": {"liked": "— location", "disliked": "— It's all converted to a non smoking facility now - but at the beach - you dont spend much time inside so it really doesnt matter!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Back to the room--the beds...WOW! Unreal! Firm, yet not too hard. The lovely white comforters were fantastic, it was like sleeping on a cloud, no joke. And what also added to the room was the different color walls. The bedroom was a beautiful green color (white ceiling) with beautiful art. Oh and the bathrooms were nice also. Well stocked and loved the huge tub!", "title": "Practically Perfect in every way!", "user": "NCvaycaylover", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19300799, "likes": {"liked": "— My favorite Resort I that I have stayed in at Myrtle Beach!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This place is amazing. I decided to check it out after looking at the hotels website and reading several great reviews from trip advisor and I have to say it definitely lived up to all of the hype that I had heard. I booked the Angle Palmetto Suite for Monday, August 4th to Friday, August 8th, however we (my fiance, my four year old son and myself) had so much fun that we stayed another day.", "title": "Loved Everything About it!", "user": "NurseV", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19125492, "likes": {"liked": "— You get what you pay for and more", "disliked": "— Kiddie pool remained freezing cold the entire time."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel had been completely booked when we called the front desk that Thursday night but they told us to check back early Friday morning to see if there were any cancellations. So Friday morning, my fiance went to the front desk and spoke with Ken, who I had heard was the best from a few reviews on this site. Not only were we able to stay for another night but we got a beautiful Ocean Front room on the 17th floor and Ken also gave us a 20% discount on the room. In addition, since we already had a full day planned, he let us take our time checking out of our Ocean View room and he locked our luggage up in a private employee's room so that we wouldn't have to worry about anything while we went about our planned day. Thanks, Ken. You really are the best!", "title": "Great Time", "user": "sparsparkle", "date": "August 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19014840, "likes": {"liked": "— Nice and clean"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Couldn't have picked a better hotel. Even the security guards were extremely nice. Great location, great staff, kid-friendly. I can't say enough about this place. Would definitely stay there again.", "title": "Wonderful Family Resort", "helpfulness": 1, "user": "kwm2000", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18989590, "likes": {"liked": "— Overall accomodations", "disliked": "— Nothing negative"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "CONS(because every place has at least one, right?):", "title": "absolutely awesome", "user": "kirfam", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18827269, "likes": {"liked": "— the great location and that is new", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "1) Kiddie Pool - The kiddie pool stayed a little too cold. My son didn't seem to mind but I preferred that he went to one of the many other pools and there were plenty of others to choose from.", "title": "Great place to stay!", "user": "jillybean2008", "date": "August 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18777536, "likes": {"liked": "— Location"}}], "location": {"country": "United States"}, "variance": {"poor": 50, "average": 75, "very good": 216, "terrible": 36, "excellent": 593}, "aka": "Sandy Beach Hotel Myrtle Beach", "slim_ranking": 0.0945945945946, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A New Modern Oceanfront Resort with one, two, and three bedroom units. Sandy Beach Resort now boasts a Children's Interactive Pool Area, Fitness Room, Meeting Room, and a comfortable Oceanfront Lobby. Come Stay at one of Myrtle Beach's newest and nicest Oceanfront Resorts!"}