{"user_rating": 4.5, "review_count": 2885, "name": "Sandals Negril Beach Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Excellent hotel situated in a bay at the end of negril beach ,perfect. The staff are very friendly and helpful they made us and our holiday very special. The facilities, food ,entertainment and the cleanliness, all first class. We loved and could not fault the watersports department and staff.", "title": "One of our best sandals experience, Superb!!", "helpfulness": 2, "user": "geordie057", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50857072}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Incredible staff! We loved the culture, the people and the environment. There wasn't a moment that we weren't enjoying ourselves. The staff made sure that we always had something to do and interacted with us in a way that made us feel very comfortable. We have already made up our minds that we will be returning next year!! Thank you Sandals Negril for making our honeymoon one of the greatest experiences in our lives!", "title": "Absolutely Amazing!", "helpfulness": 1, "user": "nrios22", "date": "December 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 50740985}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Nicole & William Rios", "title": "Loved it!", "user": "BeetRed", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 50714375}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Recently stayed at the Sandals Negril and loved it. Service was second to none and food was amazing. Especially appreciated Chris & Donovan at the piano bar, Ruel and Jolene at the \"Soon Come Back Desk\".", "title": "Toronto Couple - Sandals Negril - Didn't live up to advance reviews", "helpfulness": 3, "user": "TorontoTugboat", "date": "December 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 50629531}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Our a/c was noisy, but if that was our biggest problem staying at this resort, then we don't have ANY problems, mon.", "title": "fantastic staff every one went out of their way to make it perfect", "user": "faolcons", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 50575140}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My husband and I stayed at Sandals Negril, Nov.20-28, 20", "title": "The best birthday ever...", "helpfulness": 4, "user": "weegibby", "date": "December 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51016467}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "09, anticipating relaxing on the beach (and celebrating my birthday) and we were not disappointed! Our 10th stay at a Sandals Resort just got better and better from our arrival in Montego Bay on!", "title": "ENGAGED!", "helpfulness": 2, "user": "VERMONTCOUPLE", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50975460}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Upon arriving in Montego Bay, we cleared customs quickly and went to the Sandals Lounge. We were told the shuttle to Negril would be leaving in a half hour, when 5 minutes later it was announced the shuttle would be leaving in another 5 minutes! The hour and a half drive was picturesque and went by quickly,( with the exception of a construction area just outside of Montego Bay) and we had purchased a couple of beers prior to leaving from the Margaritaville bar outside the airport for the trip.", "title": "Loved Sandals Negril", "helpfulness": 5, "user": "strathspey", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50975217}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Upon arriving at Sandals we were taken to the Concierge Office to await our butler. We were given a brief tour of the resort as we were taken to our room #6204 in the river suite building. We were given an upgrade (from a loft suite to the river suite) to our great suprise, as this was the first time in all of our visits to Sandals this had happened!!! Our butlers Dwayne and Denato (or Double D, as you may know them) were excellent and went way beyond our expectations. These gentlemen are two of the most friendly, kind and helpful men you could hope to meet. They were instrumental in helping my husband plan a special birthday celebration for me, and were never intrusive, yet always seemed to be there to make our vacation as stress free as possible. And boy did they succeed! We have had the butler service previously at the Whitehouse and Sandals Regency St. Lucia, and these 2 young men are the best hands down!", "title": "You Will Be Sorry", "helpfulness": 2, "user": "SumBeach33", "date": "December 9, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 50946888}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Our room was great! Very clean due to the excellent services of housekeeping. Everything was new and in good shape. I realize Sandals Negril is one of the older properties and there were renovations being done in several buildings while we were there, we knew this before we booked and were prepared. However, the staff and the atmosphere of the resort was what we were there for and it was not a disappointment. Most days we just lounged on the beach and walked up to Beaches Sandy Bay (we renewed our vows there 9 years ago, it was a treat to revisit). We even had a sunset photo shoot with Elmo there to show our grandkids!", "title": "Breath taking", "helpfulness": 2, "user": "happyND", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50919557}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I have not been back to Sandals Negril for about 5 years and were anxious to see the changes. The new crystal lagoon swimup suites are a great addition, located in a quieter setting on the widest portion of the beach with butler service. We were so relaxed that we did not leave the property for the entire week.", "title": "Beautiful Beach, Resort and Phenomenal Staff", "user": "garyandsue515", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51671532}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The very best attribute to Sandals Negril is the staff. They are truly friendly and always greet you with a smile. Butlers Tavia, Sean and Basil simply the best....they really can read your mind and anticipate your every need without being \"in your face\". The beach vendors were also very polite and did not bother us at all when on the beach (which was every day, morning until sunset). The reggae singers walking the beach performing Christmas songs for us was a great touch. Also, the property was immaculate. We will definitely be back. Also, Timair from Montego Bay to Negril is the way to go...15 minutes each way.", "title": "Non-stop activities", "helpfulness": 1, "user": "kplef", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 51671046}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Overall, we enjoyed the trip. We had the pleasure last year of going to the Sandals Nassau, Bahamas, so we were comparing the two. We're very relaxed people, so partying all night isn't really our style. Nassau was more laid back and relaxing while Negril was one big party. If that's what you're looking for, this is your place. We LOVED the snorkeling each day and the beautiful beach. We didn't like how close our building was to the noisy road behind us and we had to ask them to move us mid week so I could sleep (which they did and were very apologetic...very nice concierge staff). The food wasn't as good as expected, but definitely wasn't bad. Great drinks though and the staff was very friendly overall. If I went back to a Sandals though, I would definitely go to the Grand Bahamian over Negril.", "title": "Sandals Negril is just amazing!", "user": "jhinkels", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51619581}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My hunny bunny and I stayed at the Sandals Negril property for 6 wonderful nights as recommended by our travel advisor Nicole at DJM Travel & Cruise. We were greeted with cold, aromatherapy cloths to cool us down from the airport and a glass of cold Champagne. The property was clean, the service impeccable, the spa was awesome, and we observed multiple weddings taking place on the beach. Simply stunning! I would absolutely recommend this property to everyone, and use our agent. Her knowledge of the properties and Jamaica was outstanding!", "title": "The best week of my life", "helpfulness": 1, "user": "toddsimmail", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51582060}, {"rating": 3.0, "title": "Not what I was expecting from the \"luxurious\" Sandals...", "text": "The staff treated us like royalty. The food was out of this world. My husbands ate one steak dinner than ordered another. The grounds were beautiful and the beach was clean and not crowded. Don't forget to visit the spa, it was the best message I've ever had. I can't say enough good things about this place. I can't wait to go back!!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 19, 2009", "id": 51505065}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "What a wonderful beach!!!!! This is our second time at this resort. Last year we went to Sandals in St Lucia which is wonderful- but our favorite is Negril. We love to scuba dive. Its wonderful to get on the boat right at the resort, you don't have to take a shuttle to the boat. Emron was the dive master that took us on some fantastic dives(ships, airplanes, caves). Machy was wonderful to go out on the glass/snorkle boat and he had a fantastic crew. The grill crew love to pamper us (Julian) and have the best tacos n fries (Donavan and the other cook) What a fun crew. Charles was the new manager who took good care of us. Pool volley ball wasfun to play, but this year the playmates were short handed we got some of the activities going We had a wonderful time.. We will be going back", "title": "Its a wonderful place for the oregonians", "user": "Oreg0nian", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51491870}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We went to Negril, Jamaica for our Wedding/honeymoon/vacation. It was such a wonderful trip, I don't know if I can think of words good enough to describe what a fantastic time we had. From the time we were met at the airport by the Negril representative, we were treated like royalty. The bus drive was very scenic, of course, and the driver was full of information and trivia about the island. When we arrived at the resort, we were immediately taken to an office and given the most wonderful tasting drinks, rum punch. We now LOVE rum punch! We had reserved a butler suite and our butler came to take us to our room. On the way, he told us we had a surprise waiting. Our room had been upgraded to a swim up suite. I wasn't sure what the room would be like, and when I saw it, I fell in love. The suite was magnificent. A wonderful bathroom with a jacuzzi tub and walk-in shower. A huge four poster bed. 2 flat screen lcd tv's. A patio with table and chairs and a river pool that came right up onto our balcony where there were two lounge chairs sitting in the water. The river flowed into a large, beautiful swimming pool. And look up from the pool and there is the beach! A magnificent view!", "title": "A majestic vacation, very close to perfection.", "helpfulness": 1, "user": "stabyc", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51484037}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had two butlers that took care of us while we were there, Denato and Dewayne. They were the BEST! They took excellent care of us. Whatever we wanted, they took care of. A lot of times before we even asked. Sometimes we got things that we didn't even know we wanted until they brought them. If you go to Negril, request these two as your butlers. You will not be sorry!", "title": "Absolutely Wonderful!", "user": "AvidtravellerArizona", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51410125}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "A very honorable mention goes to Julian for always making sure we had what we wanted at the grill. He kept us entertained and happy and we consider him our friend.", "title": "Sandals Negril- It Is What It Is", "helpfulness": 2, "user": "J_M_S_Toronto", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51405098}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The food was great, the beach party was fantastic, the snorkeling was so fantastic we did it twice. We even went cliff diving! Breathtaking, literally! We went on a tour of the town, went shopping and tried some local jerk chicken.", "title": "Another Wonderful Stay", "helpfulness": 2, "user": "TeriRedmond_WA", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51299803}], "location": {"country": "Caribbean"}, "stars": 5, "variance": {"poor": 120, "average": 254, "very good": 627, "terrible": 92, "excellent": 1792}, "aka": "Sandals Negril Beach Resort And Spa", "slim_ranking": 0.182795698925, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "•Located on Negril's pristine 7-mile white sand beach•Phenomenal bedroom oceanfront suites set upon a relaxing crystal lagoon•Ultra luxurious one-bedroom millionaire honeymoon suites with private plunge pool•Seven exquisite dining options•Voted Sandals “World's Leading All-Inclusive Company” 16 years in a row•Voted “Caribbean's Leading Hotel Brand” 18 years in a row•Voted Sandals Negril Beach Resort & Spa “Jamaica's Leading Hotel” (2nd consecutive year)•Five Star Diamond Resort, American Academy of Hospitality Science"}