{"user_rating": 4.5, "review_count": 1098, "name": "Sandpearl Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I was here with my husband for a business meeting and could not have been more pleased with the accommodations and service. We were welcomed with glasses of champagne - a very nice touch. Our room overlooked the pool and the beach. I did notice that rooms facing the opposite direction did not have nearly as good a view, so it's worth inquiring about room location when booking. The room was extremely spacious and comfortable. The wide, white sand beach is right there. It's great for walking, sitting, sunning. We didn't try the water for swimming, but it looked good. There's a great little restaurant next door, Clear Sky Cafe, that I would highly recommend. The only down side is the cost - very expensive. And then they add a resort fee and a parking fee. Seems to me where they're already charging so much, they ought to include the resort fee in the price. But that's JMHO.", "title": "Beautiful resort on spectacular beach", "user": "Shir Hayam", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98253058}, {"rating": 2.0, "title": "4 Star Property- Horrible Staff- Scammers", "text": "We have stayed at the Sandpearl twice now, and will never go back. The first time we went, I reserved a \"gulf front\" room through American Express Travel Service and received a confirmation from the hotel confirming a \"gulf view\" room. I contacted the hotel and they insisted that our reservation came through a discount website, and that all reservations that are made through \"Orbitz\" are limited to a gulf view. Not true. Not even close. I contacted Amex concierge who was able to secure a new reservation with a \"gulf front\" room, and a letter from the hotel manager conifrming the same. We also requested early check-in and this was confirmed.", "helpfulness": 1, "user": "Travelteam14", "date": "February 26, 2011", "id": 98094451}, {"rating": 5.0, "title": "Exceeded Expectations", "text": "We arrived at the hotel at 1 pm, greeted by the ditzy woman with the champagne, handed over to a sweaty, obnoxious 20-something man who told us a little too forcefully that no early check-in would be available, and could not check-in until well past 4 pm. When we did get to our room, it was not \"gulf front,\" at all but rather it faced the opposite wing of the hotel. Also, there were separate beds, not the king we had been guaranteed through Amex travel and in the letter from the hotel manager. I called the desk, got the same obnoxious 20-something who expressed complete surprise that we did not understand that a \"gulf-front\" includes the rooms that face the opposite bank of hotel rooms, and offered us the same $50 a night upgrade for a \"real\" gulf-front room that it appears this hotel offers every guest who refuses to accept the standard bait and switch this hotel provides on a routine basis. Also, the staff member actually told us with a straight face that we were given separate beds because \"the hotel\" was under the impression that we were brother and sister. Yes, apparently they thought this would be an acceptable explanation to a guest.", "user": "eliza46111", "date": "February 24, 2011", "id": 97898376}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The replacement room was lovely enough that we did stay a second time in a Sandpaearl suite later in the summer. However, the house staff is so slippery, rude and unhelpful that we decided never to return. We took a 3rd trip to Tampa in the fall and stayed at a different property. We will never return to the Sandpearl under this management.", "title": "Lacking Customer Service???...I Think Not!!!", "helpfulness": 1, "user": "xchf01", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97582552}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The valets were exceptional. The house staff - from the front desk to the restaurant to the tightly wound man behind the coffee counter- are a complete joke.", "title": "perfect resort in every way possible", "user": "midwestgetaway", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97310049}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We stayed for 5 days at the Sandpearl in Feb 08 in a one bedroomed suite. The hotel is located directly on the beach, which is superb , being made up of the whitest, finest, powdery sand we've come across. It was also very clean and well maintained.", "title": "Great Hotel, fantastic location", "helpfulness": 5, "user": "jlwah", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13675676, "likes": {"liked": "— Spacious with quality fittings and furnishings", "disliked": "— Nothing really"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The suite was fantastic, comprising of a well equipped, granite topped kitchen area fitted with an oven, microwave, dishwasher and large fridge/freezer, dining table and king sized sofa bed in the living area, which also benefited from a 40\" HD LCD tv. The bedroom had a king sized bed and another flat screen tv and the bathroom had two granite topped vanitry units, a sizeable corner whirlpool batch and generous walk in shower.", "title": "Incredible Resort with Outstanding Service", "helpfulness": 5, "user": "shoutlouder", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13658725, "likes": {"liked": "— The beauty of the resort and the amazing staff", "disliked": "— Leaving"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The pool is nicely laid out with plenty of sunloungers that benefited from generous cushions and there are two Jacuzzi pools to use as well. Towels are provided free and can be used by the pool or on the beach.", "title": "Not what we asked for", "helpfulness": 1, "user": "bombshellgodess", "date": "February 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 13632579, "likes": {"liked": "— The service of the staff was great!!!", "disliked": "— That they did not accommodate us for what was requested"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed at the Sandpearl the first week of March and had a great time. We rented from an owner (the top two floors are privately owned) from VRBO. Our unit was on the eight floor and had two balconies with views of both the gulf and the intercoastal. The suite was one bedroom with a full kitchen and was gorgeous! The resort itself in my opinion is comparable to top resorts (and I've stayed at places like Four Seasons) as far as how they make you feel pampered. One thing I noticed is that everything was so clean (the pool, the bathrooms by the pool, the overall hotel facilities). The pool was very enjoyable, not too crowded and it was easy to get a chair of your choosing without having to get up at the crack of dawn like some resorts. The location of the hotel was perfect as the view from the pool of the beach and gulf was spectacular. The sand on the beach is best described as like talcum powder as it is so very white and fine. Since this was our \"babymoon\" I enjoyed a pre-natal massage at the Spa which was great. We also dined at Caretta on the Gulf for dinner one night and had a beautiful outdoor sunset view for my husband's birthday. The food and service were also good for us. We were in town also to see Phillies spring training and had the pleasure of meeting/seeing Jimmy Rollins, Ryan Madson and David Herdon at the pool which was a nice surprise. I highly recommend this resort to anyone looking for a luxury hotel experience right in the heart of Clearwater Beach.", "title": "Exceeded Expectations!", "helpfulness": 1, "user": "BornToTravel", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99466237}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The Sandpearl Resort is Awesome! Beautiful Hotel, beautiful beach, wonderful food and amenities. The staff were friendly and helpful. The rooms were extremely clean with comfortable beds, a beautiful bathroom and plenty of clean towels! The beach was so white, you'd need sunglasses to look at it. We did not eat at the main dining room, but we ate at the Tate Grill on the beach several times. The food and the service were great. We esp. liked the grouper sandwich and the homemade potato chips. We enjoyed going to the Starbucks in the lobby for an early cup of coffee and then heading out to breakfast. The hotel is right next door to the Clear Sky Beachside Cafe, where we ate a few meals. Fabulous food and service there as well.", "title": "Awesome!", "user": "Annie543", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99372805}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The beach staff provides free beach towels and for about $43.00 we rented two large beach umbrellas which they set up for us. The outdoor pool is just lovely esp. at night when our sons decided to go for a swim. The pool was especially good for young families with small children, as it had different depts where the kids could walk right into the pool. The whole resort was so clean and lovely. We stayed in a Jr.Gulf Front Suite which faced the pool and the gulf. The balcony outside was esp. nice at night. The room was tight for 5 of us, but we managed to make it work, as it was what we could afford. However, the only downside to our time at the Sandpearl was the lack of privacy in the room. The wall between the bathroom and the bedroom was really a set of shuttered doors which, if opened, allowed you a view of outside looking over the beds in the room. It did not allow, even closed for privacy when using the bathroom facilities. It would have been better, in our opinion, if a solid wall was there. Maybe not as pretty, but definately more practical. We hope to visit the Sandpearl again as we had such a relaxing time there.", "title": "Great hotel - great location - great views", "user": "kwtech", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99177532}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Stayed here for a company meeting. Great location right on the beach and on Clearwaters main drag.", "title": "Perfect Hotel", "user": "k0202", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98948669}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Great restaurants and night life within walking distance.", "title": "Excellent hotel", "helpfulness": 1, "user": "rams19881993", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98728368}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Since I wrote an e-mail to the Sandpearl GM Stuart Arp which was returned due to his full mailbox, I'll instead post my comments to him here in public to serve as a general review:", "title": "Beautiful resort, wonderful beach, poor management", "helpfulness": 5, "user": "sixtoe", "date": "March 21, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 14421217, "likes": {"liked": "— Great location.", "disliked": "— Awful, confusing service."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Even though we were traveling with a three-year old and made this clear when we booked four months in advance, we were given a single king bed, which made sleeping arrangements challenging (and we were told no double queen rooms were available when we checked in).", "title": "Sandpearl is like a masterpiece of art!", "helpfulness": 3, "user": "planopam", "date": "March 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14340128, "likes": {"liked": "— The newness of the building along with its great decor, great ocean views and beach location. The room size and comfort along with the many amenities. The inspiring cuisine also was important.", "disliked": "— The balconies aren't totally private."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We had no air conditioning our first night, and opening and closing the balcony door didn't help (the thermostat was on a sensor that turned the AC off automatically if the door was left open). The offer to send an engineer up at 1 a.m. wasn't a viable option for us, so our choices were to sleep in an 83-degree room, or keep the balcony door open all night, which we did. The loud fountain and tractors grooming the beach kept us awake most of the night. Nobody followed up the next day to find out if the problem was resolved (it eventually fixed itself).", "title": "'Luxury' and Refinement Are Strangers to Sandpearl", "helpfulness": 4, "user": "Switched_On_Traveler", "date": "March 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 14262045, "likes": {"liked": "— Seeing it in my rearview mirror while driving away.", "disliked": "— Felt hassled and out of touch."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "When we checked in, we had no soap in the bathroom. We called to request some, but nobody ever came. We called again our second day, and still nobody. We eventually went to CVS down the street and bought our own. A silly problem that could have been easily resolved.", "title": "Fantastic pool, expensive hotel", "helpfulness": 2, "user": "NG_2007", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14242257, "likes": {"liked": "— Location on the beach, pool", "disliked": "— Hotel food prices"}}, {"rating": 5.0, "title": "wonderful!", "text": "Lunch our first day at Tate Island Grill was a fiasco. We sat at our table for 15 minutes with no service, although several waiters said hello. I finally picked two menus myself from the waiter station at the bar, then ordered our own drinks from the bar. My request for two mojitos from the bartender was met with a sigh and rolled eyes (if you don't like grinding mint 200 times a day, don't offer mojitos). But I was still able to get the drinks and make our food selections before anyone came to our table. We also had to endure an argument between the bartenders and wait staff complaining about missing drink tickets.", "helpfulness": 2, "user": "Julie C", "date": "March 10, 2008", "id": 14198416}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Nice hotel and rooms. Definately the best in Clearwater. Our only complaint is the pool and beach chair situation. We were there over spring break and the hotel was totally unprepared. People got up at 5:00am to get a pool chair then only stored towels on and never used. The pool staff needs to fix this problem. Staff at pool and beach were clueless. Beach chairs were all gone by 10am much better than 5am. But, there is no reason a hotel of this size can't order more plastic beach chairs. People were fighting over chairs, that ruinsvacations. My suggestion is to use beach vendors who rented umbrellas for $10 no hassels and closer to ocean. We rented a beach cabana for $30 each day from hotel and were harassed the first day 6 times asking our name room number because they only have 15 for entire hotel and gave them out to people who had not reserved them . We had reserved ours but each day they lost our reservation. We tipped beach helpers and they were still unhelpful and we heard them bad mouthing and making fun of many of their guests, very unprofessional. The pool is nice if you ever get a chair with great drink servers. Both hotel restaurants were good food and very friendly service. Rooms nice but never vaccumed all week and poorly cleaned. If they dont keep up this hotel will get run down fast. Overall best in clearwater but still have service kinks to work out.", "title": "Nice hotel Stressful pool scene", "helpfulness": 2, "user": "aloha505", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14695398, "likes": {"liked": "— beach and new hotel", "disliked": "— not enough beach chairs or service"}}, {"rating": 4.0, "title": "Elegance on the Beach", "text": "Yes! This is an outstanding hotel- small, intimate, personable. The staff is welcoming and the service is commendable; however 2 concierges gave us incorrect directions to 2 different destinations. The lounge chair situation by the pool is taken very seriously: If no one is on the lounge chair for 45 minutes your things will be moved and your chairs will be given to weary travelers waiting to relax by the pool. For the cost of this resort I would have prefered a pool with grottos, waterfalls, a slide for all the children (full of children).", "helpfulness": 1, "user": "Mamabuns", "date": "March 30, 2008", "id": 14671026}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Just as the other reviews have gloated, this hotel is top notch. Everything was perfect, from service to amenities to the condition and cleanlines. There's nothing like staying in a new hotel (opened Aug 07). Even though they have a strict 11am check out policy, they extended it till 1pm after we spoke to the manager. Clearwater is very casual, so this hotel is out of its element, but that's what made it so enjoyable.", "title": "Really Amazing Hote", "helpfulness": 2, "user": "Rufus100", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 14612703, "likes": {"liked": "— service"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Beautiful new hotel directly on the beach. Rooms are fantastic. We had a 1 bdrm suite with kitchen. Housekeeping was great. Beautiful wide stretch of white sand beach. Getting a pool chair is next to impossible. Here a week and still haven't had one. I've been out before sunrise and all the chairs were taken. Situation on the beach is a little better, but there is a lot of hostility between the hotel staff and beach vendors that rent umbrellas and beach chairs. Hotel staff have frequently yelled at guests for handling their own chair. Pool/beach experience was unpleasant and anxiety provoking. If you want a relaxing stay go somewhere else.", "title": "Unpleasant Stay", "helpfulness": 5, "user": "sshick1", "date": "March 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 14608085}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We just returned from a wonderful week at the Sand Pearl Resort. We booked two one bedroom suites, one for each of the families. The rooms are the nicest I have stayed in. We have traveled alot and these rooms are large and luxurious. The kitchens have full size all stainless Kitchen Aid appliances.. It was great for our kids, they are 14 and 10. The staff will bend over backwards to accomidate any request. We rented a poolside cabana for the day, it was awsome. The staff found out that I had seen too much sun the day before, they offered to get me anything to help with the pain. They ended up getting me some white vinegar from the kitchen, it was very helpful. The cabanas are as nice as the rooms with large flat screen TVs and sofas.", "title": "The Best in Clearwater", "helpfulness": 3, "user": "ShowmeRx", "date": "March 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14445420, "likes": {"liked": "— The suite was beautiful", "disliked": "— The size of the pool"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The Sandpeal Resort's first impression was faboulous. The doorman and ambassador welcomed us and knew exactly what to say, inviting us in the vip room and offering champaine. They claimed we could get information and services 24-7 and they would love to help us. Ha! Once we got to our room, that went right out the door. We wanted to go to the grill next to the resort, I had just purchased two drinks, went back for two more and they were closed before 7:00 p.m. Also, we had questions about dining services in the area and the ambassador said she would check into it. Well, there was no follow-up for us. I could go on and on with several other examples of the lack of help or genuine concern, but I think you get the point.", "title": "not for me", "user": "Lillee_11", "date": "February 17, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 97041404}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "From the moment we checked in to the time we checked out, we were treated like royalty. The staff could not do enough to make our stay enjoyable. They even apologized for the bad weather (which was still way better than the 5 below at home). The only thing that was not top-notch was the fitness center; although there was a fair amount of aerobic equipment, there were almost no free weights and the room was extremely cramped. We will certainly be back next year.", "title": "The Sandpearl Resort is an awesome vacation getaway!", "user": "DocCheesehead", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 96930532}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I am still at the Sandpearl writing this review. I love this place and don't want to leave. The room is amazing, the beds are perfect and the view is outstanding. The beach is clean, the pools and saunas are clean and the staff is very friendly. Mind you, it is not an inexpensive resort, but worth the extra dollar for sure. Of course weather is everything when you are at a resort and we have had some very beautiful days. There are many things to do at Clearwater Beach and the surrounding areas, much to see and explore, lots of great places to eat. (We love Frenchies and the ClearSky) I would definitely recommend this resort!", "title": "Top shelf resort.", "user": "2heartlover", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 96800657}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "When we arrived we were greeted and treated very well...however once they had our credit card information we were on our own and treated unkindly when we needed something. There was never an attendant at the activity center for the entire 4-day stay. We asked the concierge to schedule a trip that they have in their daily activities and when we arrived at that destination... there had been no reservations made. Needless to say, the place was booked and we could not get in. There floor by the coffee pot had mildew on it from constant water spills and they had to come in and clean the floor so it would not smell so bad. The stains were still there and the smell! I expected so much more from this hotel. Great location....But Poor Hotel! Save money and find another hotel in the area.", "title": "Not a Wonderful Place to Stay", "helpfulness": 4, "user": "lilleesgrandma", "date": "February 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 96385299}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We're back to Clearwater Beach a year on and back to the Sandpearl hotel. The hotel was as good as it was the last stay. It's the best hotel on the strip, with the best hotel/martini bar. This is mainly down to the terrific staff who are very reliable and friendly and go out of their way, including the great bar team and the folks who clean the rooms - unsung heroes.", "title": "A year on, still the best", "user": "ChiswickTurnhamGreen", "date": "February 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 96272538}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We went there for our honeymoon and it was amazing!!!! It was perfect for a romantic weekend...the beaches are beautiful, staff friendly, food amazing, rooms perfect. I also recommend going to Calidesi Island.... Great place to relax and go shelling.", "title": "Amazing!!!!", "user": "badidea223", "date": "February 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95618553}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Absolutely loved the Sandpearl!! You can read all the positives from other reviews here (about the resort and the beach) -- they are all correct. In addition to all those, a special \"thank you\" to the Sandpearl staff which went above and beyond to make our trip memorable. Prior to our arrival, I indicated that our trip was needed for some very specific reasons and the Sandpearl not only put us in one of the best rooms, but also sent chocolate covered strawberries to our room. This was very appreciated and made us realize just how special a place this is. In fact, during the entire trip, the Sandpearl staff could not have been any nicer.", "title": "Why stay anywhere else on Clearwater Beach?", "user": "goohiostate", "date": "February 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95609977}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Cannot ask for a better location either -- steps away from 3 of the Frenchy's restaurants, including the Rockaway Grill right next door (the Grouper and She-Crab soup are great). The Clear Sky Cafe, also steps away, is also very good. It was also nice having shops nearby -- we walked on Mandalay every day (loved the old-time candy store). When we decided to try a local pizza place for delivery when the weather wasn't the best, we tried Bro's per the Sandpearl's recommendation -- loved it!! I would also highly recommend a limo ride to/from the airport from Ambassador Limousine -- really not that much more expensive than a taxi/shuttle ride and worth it.", "title": "wow!!!", "user": "poppyCheshire", "date": "February 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95585592}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Although we didn't have the best weather (rained a little and was a tad bit colder and windy than normal), we will certainly be back -- hopefully soon!!", "title": "Top Notch-Unbelievable on all Accounts!", "user": "JNS-1967", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95338580}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I would like to say that our visit to the Sandpearl Resort was the highlight of our trip to Florida.", "title": "O M G", "user": "luv2golfDenver", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94873548}], "location": {"country": "United States", "city": "Clearwater"}, "stars": 4, "variance": {"poor": 40, "average": 78, "very good": 232, "terrible": 19, "excellent": 729}, "aka": "Sandpearl Hotel Clearwater", "slim_ranking": 0.0625, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "With a stunning location along a 700-foot expanse on the sugary white sands of pristine Gulf of Mexico beach front, Sandpearl Resort's casually elegant surroundings provide guests with a vacation experience unmatched on the beach. Just 18 miles from Tampa International Airport, our guests will experience the old Florida tradition of hospitality at our brand new world-class property. Our friendly staff will help make your stay memorable through plush amenities and impeccable service."}