{"user_rating": 4.5, "review_count": 551, "name": "Sands Resort Hotel & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We had a great room with a fantastic sea view, the resort is well located for day trips and some lovely beaches are close by.", "title": "A lovely family centered place to stay, very friendly and welcoming.", "user": "number24bus", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27746576}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The staff in the hotel are very friendly and welcoming, children are well catered for with lots of activities for wet and dry days. Our son loved the pool and the outside play areas.", "title": "Not only met expectations, exceeded them!", "user": "manutdCornwall", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26912464}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Meal times are well organised with lots of choice for fussy eaters and babies.", "title": "9 times in 9 years says it all.", "user": "Philcoh", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25122904}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Relaxing and Young Children don't always belong in the same sentence especially when its your grandchildren but that is just what we found at Sands Resort. Having had quite a traumatic first bit of the year, we wanted somewhere to escape on the spur of the moment and found Sands the perfect place. The staff were extremely friendly and helpful and catered for our every whim. The food was excellent both breakfast and dinner with a very comprehensive menu choice. We stayed overnight in a fantastic room with a spectacular view of the Atlantic and left promising a return visit. Value for money was amazing, check out the offers on their website.", "title": "Excellent", "user": "Chillihaha", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22029937, "likes": {"liked": "— Really well thought our family accommodation", "disliked": "— Our two year old could reach the light switch from her cot !"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We have been staying at Sands since our daughter was 4 years old. It is the perfect family break for us. We tend to go in a half term or at easter, we have not been in the summer. Our kids are now 13 and 7. We like the way the hotel caters for all ages of children. When the kids were very small we used the kids clubs which were excellent and they loved the kids activities during the day and in the evening. Now they are older we make lots of use of the football pitch, the tennis court and the long walks. The par 3 golf course is absolutely perfect for young players. Also cannot forget the new rope slide which the kids loved. The swimming pool has also been refurbed and is very good, our kids love to go swimming every day. A special mention for Ruth and Anna who look after the kids, both are excellent and have a great way with children.", "title": "The whole family love it - it really really works!", "user": "DevonScilla", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21525835, "likes": {"liked": "— Flexibility of arrangements suit the family.", "disliked": "— Having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "I dont often express my views, but I wanted to let people know that we found the Sands resort (Cornwall) a great place to spend a summer holiday with a 2 year old. Ok, so the weather was lousy (it is England after all!!) and my son got ill, so we had to abort the holiday early.....but, despite all of that, the hotel was great! The staff were really friendly and couldn't do enough to help - and the facilities were wonderful for little ones...and the baby listenting service was robust and trustworthy, so we managed to have 4 civilised evening meals.", "title": "What a great place to stay with a youngster!", "user": "Londonmum5", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19572325}, {"rating": 5.0, "title": "17th year of visiting Sands Resort", "text": "I would recommend the hotel to anyone with young children. We certainly hope to return next year!", "user": "SEWLondon", "date": "August 14, 2008", "id": 18946842}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I have been staying at Sands Resort for many years with my family. My eldest children (who are now 19 & 22) adored going there from the age of two onwards. My younger children (aged 5 & 9) will not hear of going any where else.", "title": "excellent standards, great value break for family with children.", "helpfulness": 2, "user": "dixiecanyon", "date": "August 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 18619771, "likes": {"liked": "— excellent standard and facilities", "disliked": "— nothing - it was all great"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Sands is totally child friendly. There are plenty of activities for them to do on and around the site and the beaches are a stone's throw away. Children are welcomed at adult meal times and no one gets upset if they spill something or throw a tantrum. However, if you wish to relax as a couple there are adult eating areas and a bar. I have a demanding job and going to Sands offers complete relaxation.", "title": "Very child friendly but disappointing food....", "helpfulness": 2, "user": "h0lidayaddicts", "date": "August 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 18600913, "likes": {"liked": "— room", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I recommend Sands as an ideal base for a family holiday in Cornwall.", "title": "Awesome!!!!!!!!!!!!!!!!!!!!!!!!!!", "user": "pheith", "date": "July 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17576687, "likes": {"liked": "— The space and decor"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Whilst looking online over a year ago for a venue to hold our wedding reception I came accross the Sands website, had a quick look, liked it then spoke to Leeanne Armstrong who was to be our sole contact for the whole planning process. At this point we had not visited the Sands, but decided to book as we were so impressed with the service and communication.", "title": "A perfect wedding at The Sands Resort", "user": "MrsGillespie", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21505180, "likes": {"liked": "— Its modern decor, and spacious feel"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "A few months later we were able to finally view the hotel as neither of us live in Cornwall. As soon as we walked into reception we couldn't believe our luck with what an amazing venue we had chosen. Firstly we were greeted by Leeanne who was delighted to finally meet us, then we were shown around the rooms that we would be using for the wedding. It was such a coincidence that the hotel appeared to be decorated with the theme and colour scheme I had chosen for our wedding. We were so excited and knew we had found the perfect venue. It was modern, spacious and relaxing and knew my guests would love it.", "title": "Great place- excellent kids facilities", "user": "jjmarchant", "date": "October 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21344458, "likes": {"liked": "— Child friendly"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "As the months of planning went by Leeanne was never out of touch, she was such a help with useful emails prompting me to what to do and when.", "title": "Mixed bag for us", "user": "mikelabrey", "date": "October 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 21218148, "likes": {"liked": "— Location, Food and the", "disliked": "— Claims of being a"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Finally the big day came. We went along to the Sands on the Friday before to decorate and again was met by a enthusiastic Leeanne. We had such fun decorating the rooms, with many staff running around collecting extra bits to add to the decorations. The room for the meal was just right, it was fresh, clean and modern. Our function room was also perfect for us, giving us plenty of room for our DJ, guests to sit and of course dancing! All the staff on duty that evening were superb and we were served with a smile by everyone. It really did make us feel special. Leeanne was there to welcome us as we arrived, and stayed to make sure the meal went by without a hitch, she introduced my husband and I to our guests, and then the speeches. She worked so hard to make sure it all went smoothly, and it certainly did. I even had my shoes whisked away from me and cleaned as we had been onto the beach for photos.", "title": "Sands Resort - Loved it!!", "user": "MJEE", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 20571660, "likes": {"liked": "— Overall friendliness from the staff and superb facillities for us frazzled parents with young ones!!", "disliked": "— Nothing - it was all good!!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "As for the food, it was outstanding. I lost count of how many comments I'd had from guests saying how good it was. It can not be easy to serve 50 people all at the same time and running late, but it was done expertly. I hear the bar staff were very patient with a few of my guests that refused to go to bed and continued to drink into the small hours (including my Dad by all accounts!)", "title": "Good for kids", "user": "RichTetbury", "date": "September 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 20376444}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Generally Sands is alright. We have a baby daughter (18 months) and we travelled with friends who have twins a similar age. We had contempary rooms which are large and well decorated and most importantly have two rooms so babies can sleep in their own room (shame you have to walk through that room to get in and out of the room - hence the standing in the corridor game waiting to see if they have settled themselves back to sleep cos you've woken them up trying to get out of the room for dinner)! A minor issue though.", "title": "It's OK. Not brilliant.", "helpfulness": 1, "user": "JMuk", "date": "April 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 29082285}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The hotel generally is clean and welcoming but a little tired and jaded in places. It is in the most superb position, just a short walk from watergate bay and porth beaches. Both of which have great, very family friendly restaurants (even when you turn up with 3 under 2's). It's not the most attractive building, the yellow and orange does dominate the skyline but it's not a major problem.", "title": "Simply not worth the money", "user": "CarriC", "date": "April 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 28901133}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Hotel staff in our experience were totally fab. Always helpful and attentive. Equally the housekeeping staff, never phased by toys and general baby stuff everywhere.", "title": "Not as good as expected", "helpfulness": 2, "user": "needhols", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 28896864}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The Spa - brilliant - had the best facial I think I've ever had.", "title": "Our favourite hotel in the world!", "user": "familyflan", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28128212}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "But Sands can definitely improve in a number of ways.", "title": "great hotel, great staff, great location!", "user": "Pete53", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27938772}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 13, "average": 30, "very good": 94, "terrible": 3, "excellent": 411}, "aka": "Sands Resort Hotel And Spa", "slim_ranking": 0.04, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Sands Resort Hotel & Spa overlooks the Atlantic ocean to the west and countryside to the east. The hotel offers a range of free sports facilities and children's clubs as well as a beauty spa, two pools and a gym. Most suites have separate sleeping areas for children and are in a contemporary design. A free baby listening service is also available.In 2012 Sands was voted Best Family Hotel in Europe and the UK by the TripAdvisor Travellers' Choice Awards."}