{"user_rating": 4.5, "review_count": 1122, "name": "Sandals Carlyle Inn", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "TIPS = To Insure Proper Service", "title": "No Tips = No Service", "helpfulness": 2, "user": "kbalfe", "date": "April 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 15159130, "likes": {"liked": "— The beach", "disliked": "— The service and food"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The reason tips are such an important part of the service industry is simple: they help to guarantee good service. At Sandals, tips are included, which sounds great at first, until you realize that without tips a lot of the workers could care less about serving you. What do they care if you wait 15 minutes at a bar for a drink, or if your food order is wrong, or if they are out of glasses or spoons? They don't. And that's the biggest (although far from only) problem with Sandals.", "title": "BEST TIME EVER", "helpfulness": 5, "user": "caroleannRI", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 15161931, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I don't want to blame the poor service we experienced only on the tipping policy, maybe the workers wouldn’t care even if they got tips...but the people on here who are posting how great the service is are either a) lying, b) supermodels, or, most likely, c) have never experienced what good service actually entails.", "title": "Best Kept Secret in Jamaica!", "helpfulness": 6, "user": "jonctrand", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14864956, "likes": {"liked": "— The people! They were wonderful!", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Best Vacation Ever", "text": "From shuttle bus drivers who stop for gas with a full busload of passengers (never take the 4:15 pm shuttle, trust me) to bartenders who could care less that you wanted a \"light\" beer, to concierges who can't be bothered by actually phoning in your dinner reservation, to housekeepers who think 'why sweep the bathroom floor when it'll just get dirty again' -- Sandals is a breeding ground for poor service.", "helpfulness": 10, "user": "ROGERINONTARIO", "date": "April 6, 2008", "id": 14833827}, {"rating": 5.0, "title": "As we say in Nova Scotia, \"It was some good!\"", "text": "Like I said, there are other things that make this a 2 star choice (the rooms are loud and hot, the bathrooms are dirty, the food is borderline horrendous, and the activities a joke) but the service -- or lack thereof -- trumps everything else. How bad was the housekeeping? We actually found weed in our desk drawer. Yes, our desk drawer…not exactly a world-class hiding spot. I can't imagine what was in our room that we couldn't see.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 2, 2008", "id": 14752494}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Sandals Inn was very comfortable. A smaller venue allows you to get to know the staff and other guests. You can have the quaint atmospher while still being able to enjoy the amenities at the other Sandals in Montego Bay. Just a short free bus ride away. The pool was very clean and the poolside well taken care of. Security was professionally handled by staff members discreetly placed and dressed at the only entrance. The beach is a public beach and provides an interesting and sometimes entertaining view. Make sure to snack on the jerk chicken at Nibbles grill, get a massage and play jenga at the bar. Would definately go back.", "title": "Friendly and charming", "helpfulness": 5, "user": "smom7", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14220633, "likes": {"liked": "— Small Venue", "disliked": "— Food wasn't always the best"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We really enjoyed our stay at the Sandals Inn. They staff was extremely nice and friendly. We were greeted when we arrived with cold towels for our hands and sparkling champagne. They took care of the entire check-in while we waited in the \"greeting room\" then took us up to our room. The rooms were very clean and roomy. Everything worked properly and the air conditioner was nice and cool. Room service was prompt, the bar drinks and staff were great, and the restaurants and snack bar was also very good. We heard that the up-scale restaurant there was very good, although we could not get a reservation for the night we wanted, so we were not able to try it. The shuttle picks up every hour to take you to the other resorts which was very convenient and the those resorts are great too! Overall, the Sandals Inn is a great place and you especially cannot beat the price!! It is an added plus that you are able to visit the other resorts for free as well. I highly recommend it to anyone.", "title": "Great Hotel For The Price!", "helpfulness": 6, "user": "Aggie03", "date": "March 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 14193272, "likes": {"liked": "— The Service", "disliked": "— The public beach is across the street from the resort and is very small with a lot of locals"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "A weekend getaway at the Sandals Inn at Montego Bay, Jamaica, was well worth the time and effort. Although this is the smallest Sandals, the excellent service, cleanliness and relaxed atmosphere more the made up for it's size. There were less guests so if you do not like large crowds, this is the place to stay.", "title": "Weekend getaway at Sandals Inn", "helpfulness": 6, "user": "RKBernie", "date": "March 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14183774, "likes": {"liked": "— The excellent service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The guests we did meet, were friendly and seemed to be having a good time!!!", "title": "You can feel like family", "helpfulness": 7, "user": "bulldogNewYork", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14135980, "likes": {"liked": "— the staff", "disliked": "— the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The small beach across the road is probably not one you'll want to utilize, however, the beaches at the two other Sandals in Montego Bay, were very nice and just a short ride from the Sandals Inn.", "title": "We Love Sandals Inn!!!", "helpfulness": 7, "user": "marylzbth", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14104485, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We just got back from Jamaica where we stayed for a week at Sandals Inn, Montego Bay.", "title": "What a vacation! Thanks Trip Advisor!", "helpfulness": 11, "user": "emilykwan321", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14687578, "likes": {"liked": "— the people - staff and service", "disliked": "— the food (was average)"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This was our first time going to Jamaica, so we chose Montego Bay. We did a lot of research before choosing this property - mostly through Trip Advisor - so THANK YOU Trip Advisor for helping us plan the perfect vacation - everything totally met with our expectations.", "title": "Honeymooning at the Sandals Inn", "helpfulness": 5, "user": "Businessguy08", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 14528886, "likes": {"liked": "— The friendly staff.", "disliked": "— The food."}}, {"rating": 4.0, "title": "Family atmosphere", "text": "Sandals Inn is a lovely little place - it's intimate yet casual. Based on the reviews and photos - we knew exactly what to expect. The reviews commending the level of service are definitely accurate. The staff at Sandals Inn are professional, helpful and above all - extremely friendly and warm. There is no other place that we've been to that we were hugged and thanked all the way onto our departing shuttle!", "helpfulness": 4, "user": "Sophia37", "date": "March 24, 2008", "id": 14491757}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I cannot understand how people are surprised or disappointed if they've done their research. The Sandals Inn property-wise is about a 3 star. What makes it special is the level of service and because it's small, it's easier to get to know the other guests staying there during the time you're there. The free shuttles departing to the two other properties are awesome and they are only 5-10 minutes away.", "title": "Food is horrible!!!", "user": "lbcnu", "date": "March 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 14486403}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We spent time at both the Mo' Bay and Royal and it was great to do so, but then come back and relax at the Inn. Mo'Bay is definitely the \"party\" property with something going on all the time. The shows there were very entertaining. Royal is a bit more classy, and we spent a couple days there at the beach - pulled our chairs right into the ocean and also spent a nice quiet afternoon at a small lagoon there.", "title": "Sandals Inn The Best Ever!!!", "helpfulness": 6, "user": "ShipwaysWestSussex", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14467131, "likes": {"liked": "— Friendly Service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We had another wonderful relaxing vacation at Sandals Inn Montego Bay. From the begining planning stages calling direct to Sandals booking our stay with a very pleasant informative and capable Grant making our reservations. We arrived at the airport and were directed to Sandals reception room, we were on our way to the resort in less than a half hour. We were welcomed \"home\" on arrival and given cold towels and served champaign, such wonderful friendly people. We were given a great 3rd floor room with the balcony opening up overlooking the beautiful pool and restaurant and the Sea in the background.From the first time we went to the front tour desk to make reservations for dinner Tasia was wonderful. Everything we asked for she delivered.A couple of times I didn't think she could get us in but she really came through every time! We really love Cheryl Brown [mgr] She is very very hands on, she runs a wonderful Inn. Everyone from guests to employees really seem to like and respect her. She has been updating and painting and making sure the property stays clean and beautiful. We did visit the other properties while there and even ran into Mr. Gordon Stewart at Royal [ another day in paradise] but always glad to return to the Inn. I must say everyone at the Inn from the housekeepers, bartenders servers, office, bellman, management are very friendly and helpful. This was our 6th visit to Sandals our 2nd to the Inn and as usual the Sandals Select guest dinner was really nice with cocktails in the garden and dinner around the pool, Cheryl gave a very heartfelt greeting/speech to welcome us all back \"home\". I hope she is there for years to come. She does a great job, however I think she is sometimes too dedicated and spends all her time working. We will be back again as soon as we can.", "title": "Sandals Inn the little gem", "user": "MichiganDreamer", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14462776, "likes": {"liked": "— the balcony view", "disliked": "— public beach across the street"}}, {"rating": 5.0, "title": "First Sandals Inn Experience", "text": "We just arrived from our first Sandals experience at the Sandals Inn. This will be a long review, so please be patient. This was also my first visit to Jamaica and I had an idea of what to expect because I had read several TripAdvisor reviews. We had a wonderful experience! The Sandals Inn looks exactly like the pictures. The service, variety of food, accommodations and amenities were great. General Manager, Cheryl Brown, her assistant, Lisa and staff are to be commended for a job well done. They were very attentive to our needs. During our first breakfast, my friend expressed a desire to try curry goat. At dinner, the server presented curry goat, especially prepared just for him! I was impressed. We took full advantage of the amenities at the neighboring resorts, but were glad to return to our home away from home at the end of each day. The staff at the other resorts we not nearly as personable as the Inn’s staff. We experienced a “couples” massage, rafted down the “Martha Brae” river, took a day trip to Sandals Negril, and even experienced the “au natural” beach where seeing is believing! The tour guide for the Negril tour is Dalton. He is very knowledgeable on historical facts. I highly recommend the Negril tour to first time visitors. It’s very informative and you get to see a beautiful sunset and dive off a cliff for those who are daring. Please ask for Dalton who is located at the Inn. Your wish is his command. The Inn is located right across the street from a public beach. We didn’t experience the beach, but used the beach at the other resorts, as well as our pool. An interesting thing to note is that while you’re on the premises, the Inn looks and feels like a resort with lots and lots of lush gardens, scenery and greenery, but as soon as you go outside of the resort, you immediately experience the “locals” and all they have to offer. They are very persistent and will stop at nothing to get you to look at their merchandise. The Inn is a 10 minute walk from the “hip strip” where all the action is including gambling. If you are looking to party all night, the Inn is not the place for you. It’s clientele is a mature, more sophisticated crowd. Partying can be done on the “hip strip” and then come home for a good night sleep. One thing to remember and that is to please book all your tours and dinner reservations as soon as you arrive at the resort. Reservations book fast. Okay, that's it. I will definitely stay at Sandals Inn, whenever I return to Montego Bay. They have a customer for life!", "helpfulness": 9, "user": "movingonillinois", "date": "March 17, 2008", "id": 14344074}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We returned to Sandals Montego Bay after spending our honeymoon there 10 years ago in Jan 1998. We were going to try a different Sandals resort in Jamaica but after talking with a Sandals representative we decided to return to Montego Bay.", "title": "Wonderful return experience", "helpfulness": 6, "user": "MEDIC118", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14297165, "likes": {"liked": "— Cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Our return trip was even better than we hoped for. We had a beach front suite with butler service and couldn't have been more pleased. The butler service was amazing - making all our reservations, having a spot reserved on the beach everyday, baths waiting on our return from the excursions, etc.", "title": "BEST VACATION EVER", "helpfulness": 6, "user": "cnanartowich", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14257517, "likes": {"liked": "— Do not disturb....", "disliked": "— No view...."}}, {"rating": 5.0, "title": "Love Sandals Resort", "text": "Everyone was always pleasant with beautiful smiles.", "helpfulness": 7, "user": "Charl10233", "date": "March 12, 2008", "id": 14249418}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 55, "average": 71, "very good": 250, "terrible": 34, "excellent": 712}, "aka": "Sandals Carlyle Hotel", "slim_ranking": 0.161290322581, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "•A romantic, intimate atmosphere with personalized service.•The real Jamaican experience; Jamaican smiles and attentive service to make you feel at home instantly.•Small in size yet big on charm and large in value.•Close proximity to Montego Bay 'Hip Strip', where you will find duty free shopping, restaurants, bars and clubs.•24 hour room service for all room levels.•Butler service available for our newly renovated, top category room, the Carlyle Club Ocean View Penthouse.•Complimentary shuttle bus to Sandals Royal Caribbean and Sandals Montego Bay “Stay at one play at three”, where you can enjoy eighteen dining experiences.•Voted Sandals “World's Leading All-Inclusive Company” 16 years in a row.•Voted “Caribbean's Leading Hotel Brand” 18 years in a row."}