{"user_rating": 3.0, "review_count": 170, "name": "Sandy Beach Hotel", "reviews": [{"rating": 4.0, "title": "nice and quaint - close to the beach", "text": "I stayed at El Canario By The Sea from March 28 to April 1 with a group of friends. When I originally booked the dates I was a little aprehensive as I was going on the good word of other people on this site, but after talking directly to the management at the hotel I was convinced. When we arrived our check in was handled politely and quickly so we could settle in and start enjoying San Juan. The breakfast was satisfactory and simple, but the staff kept things neat and tidy and always politely answered any questions. The rooms were clean and bug free (not an easy task I imagine in a tropical country). If I could make one suggestion to the hotel it would be to update the rooms as they have the lobby. The hotel's site says that it is across the street from the beach, but it is practically ON THE BEACH!!! The sound of the wind and the waves was loud but lulled us to sleep every night (which wasn't hard after days of discovering San Juan and Old San Juan). If you get a chance check out the pizza/deli just up the street from Walgreens on Dr Ashford Ave across from a clothing store and beside a Mexican place - it is the BEST we have ever had!", "helpfulness": 3, "user": "quincey1", "date": "April 8, 2007", "id": 7292099}, {"rating": 3.0, "title": "San Juan for the weekend", "text": "Paula - Canada", "helpfulness": 9, "user": "SJQ", "date": "March 3, 2007", "id": 6907992}, {"rating": 2.0, "title": "Motel 6 with older hotel charm", "text": "Needed to find a not so pricey room for the weekend of Feb 24th to attend my sons college (medical school) HOORAY!! graduation held in Bayamon which is 10 miles fron San Juan. Let me add that cab fare to graduation was $30.00 1 way. YIKES!!", "helpfulness": 4, "user": "readytogoSoOregon", "date": "March 2, 2007", "id": 6899314}, {"rating": 3.0, "title": "Nothing Special", "text": "I had read several reviews and was somewhat skeptical. This hotel was fine. No, it's not the hilton nor marriott but a holiday inn type room.The staff was very friendly and helpful to me. Housekeeping", "helpfulness": 1, "user": "SimonC,Toronto", "date": "February 15, 2007", "id": 6798291}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "was great. Even saw the housekeepers cleaning every wall of the elevator.", "title": "Beware of noise", "helpfulness": 5, "user": "brunetto42", "date": "January 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6616465}, {"rating": 3.0, "title": "Trade location for quality", "text": "Our family of four stayed at the El Canario in San Juan for three days and had a wonderful time. The hotel is centrally located and within walking distance of many shops, restaurants, and attractions. We were literally a few steps from a gorgeous beach with very few tourists. The neighborhood was safe and clean. There was a decent continental breakfast with fruit and some excellent pastry.", "user": "Britishinmyheart", "date": "June 9, 2007", "id": 7817832}, {"rating": 3.0, "title": "Clean, Safe and Quiet", "text": "That being said, the rooms were below par. The walls were paper thin and my children were exposed to very profane noises coming from the honeymooners in the next room. The view from the lobby is of the ocean but the view from our room was an alley and a seedy apartment building.", "helpfulness": 1, "user": "CirqueGirl", "date": "May 17, 2007", "id": 7635153}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I would recommend this hotel to younger couples or singles due to the downtown location and the questionable occupants.", "title": "Don't Expect Four Stars", "helpfulness": 1, "user": "srafnel", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7487600, "likes": {"liked": "— Location", "disliked": "— Room Size"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "El Canario by the Sea is just that, a few steps from the beach. The front desk clerk allowed me to check in right around 11:00 when I arrived. I definitely appreciated that since I was tired from traveling and had just arrived on an early morning flight. As soon as housekeeping had the room cleaned up I was allowed to check-in. The elevator was being repaired and I voiced concerns about lugging a 43 pound bag upstairs. He gave me a room on the first floor, eliminated that problem, but I was concerned with lobby noise or patio noise. This hotel was quiet during the day and at night. I slept wonderfully sound and I felt safe. Very basic amenities, but enjoyed the location and the staff was very friendly.", "title": "It smelled horrably", "helpfulness": 2, "user": "akurmang", "date": "April 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7347790, "likes": {"liked": "— location", "disliked": "— smell"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I stayed at El Canario with my mother for the weekend of March 29-April 2. The hotel was exactly what I expected.", "title": "Don't stay here!", "helpfulness": 2, "user": "jjcj1", "date": "April 10, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 7307199, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We spent the night here before heading out on Carnival Destiny. Late arrival was fine and establishment was clean. For the money, it was ok but very spartan. Be aware that there was no hair dryer even in the office to borrow. It was one of the least expensive hotels we found.", "title": "Good for Overnight before a Cruise", "user": "StickSister", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 17198071, "likes": {"liked": "— Price", "disliked": "— AC not acceptable"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We were quite warm in our dorm-like, 2 single-beds room, which made it hard to sleep. Located in the pricey Condado region which seemed fairly safe but be advised that you will see pan handlers.", "title": "What A Dump", "user": "lisama18", "date": "March 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 14682325}, {"rating": 3.0, "title": "Not bad for the short stop...", "text": "Close to a WalGreens which was convenient. The complimentary continental breakfast was not anything special. The hotel is only steps away from the beach. Just depends on your needs and the price range you desire.", "user": "CRZDVA", "date": "March 11, 2008", "id": 14223063}, {"rating": 4.0, "title": "Fun In The Sun", "text": "Booked an over-night stay at the Coral Princess which was a palace in comparion upon return from our cruise. My review of that inn will be posted later.", "user": "05Fatboy", "date": "March 6, 2008", "id": 14101046}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I kept reading great reviews. So I thought I would take a chance for one night. Big mistake. When I got there I was hugely disappointed. The place was dumpy. The elevator could barely fit a small child. The rooms were nasty. I didn't even attempt to go in the breakfast room, although other people that stayed there said it was gross. It isn't even that close to the cruise ship ports. Stay in Old San Juan much nicer and much closer.", "title": "Wonderful little hotel....", "helpfulness": 1, "user": "twysted", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14080208, "likes": {"liked": "— Clean rooms and freindly staff", "disliked": "— having to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My partner and I stayed at El Canario by the Sea for the first time in 2004. We came back this year with my sister and brother-in-law and shared room 300 on the third floor. It is a very clean and basic hotel that cannot be beat. The location is excellent: Steps to the beach and Ashford Avenue (a Walgreens is less than a block away); the staff members are warm and friendly; and the price is great. We loved waking in the morning and having both Puerto Rican and American coffee, a variety of rolls and pastries, juice, bananas, cereals, and bread and jams, all served downstairs in a lovely courtyard. The beds are comfortable and each room has a window air-conditioner. Above all, everything is clean, clean, clean.", "title": "Great little hotel", "user": "Mark M", "date": "February 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13736509, "likes": {"liked": "— Coziness: It's a great little hotel in an excellent location.", "disliked": "— Nothing."}}, {"rating": 3.0, "title": "Just Right For The Money", "text": "My husband and I went there for a weekend to celebrate our 1st year annivesary...yes its not the Hilton, however we just wanted a bed to sleep in and a place to come to when we were just to tired of viewing the island. If you plan on staying in your room, then Yes go for the Hilton or the Marriott, however if you want to save money for those delicious piña coladas and gas, then this hotel is just fine. The rooms are a little small, who cares,bed was fine they have breakfast in the morning which I thougth was nice and the beach is literly only steps away which was also nice...by the way location, location, location it is right in the middle of el condado...it's worth every penny...", "user": "mari74", "date": "January 24, 2008", "id": 12958224}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed here for one night before moving to the Marriott. The stay was fine considering that we were sightseeing in Old San Juan for the day and then going to the beach. Dont rent this hotel if you plan on relaxing in it because there's no view of the beach/ocean, very little light comes in and its behind a huge, tall building. Its only good for the bed and the locale. Right on Ashford Ave in Condado and $15 ride to Old San Juan and the airport. My advice? Spend $100 more and stay at the Marriot right next door, thats worth it.", "title": "Its really El Canario by the Sea Behind a Big Building", "user": "qkadwani", "date": "September 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 8666923, "likes": {"liked": "— Good locale", "disliked": "— Bad view, small room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Stayed there three days with a friend and everything was fine until the last day. Our toilet did not flush and we contacted the person at the front desk who told us to go get the plunger across the hallway. We walked across the hallway and didn't find a plunger. We told the person at the front desk this and said that we would be out for the next few hours and that they could come into the room to fix the toilet. When we came back, we asked if our toilet had been fixed and the guy at the front desk said that it was still not fixed but that he had called the manager.", "title": "Don't Expect Anything Special", "helpfulness": 3, "user": "TejasTraveller", "date": "August 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 8452932, "likes": {"liked": "— Location to the beach", "disliked": "— The toilet not working"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "They then came to our room later that night to give us the plunger. Then left us to fix it ourselves. No manager came. No repair person came. Just the same person at the front desk.", "title": "Great for the price", "helpfulness": 1, "user": "dincola", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7976108, "likes": {"liked": "— location", "disliked": "— room size"}}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 2, "variance": {"poor": 28, "average": 48, "very good": 57, "terrible": 24, "excellent": 13}, "aka": "El Canario By The Sea", "slim_ranking": 0.829787234043}