{"user_rating": 4.0, "review_count": 4621, "name": "Sandals Royal Bahamian Spa Resort & Offshore Island", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "“Sandals Royal Bahamian May 14-19, 2009”", "title": "“Sandals Royal Bahamian May 14-19, 2009”", "user": "smbraggs", "date": "December 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121995526}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Reviewed July 9, 2009", "title": "It was ok.....", "helpfulness": 2, "user": "caribvibe", "date": "December 22, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121986814}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed at the Sandals Royal Bahamian Resort on Cable Beach in Nassau May 14-19, 2009. The overall stay was very nice. I will begin with the negatives. There was a miscommunication as far as which room we were in. We paid to upgrade as did our friends who were in the Manor Building. We were placed in the Windsor Bldg and told we were being upgraded from our upgrade. When my husband went the room thre was luggage and a wedding dress on the bed. Obviously not our room. We were then sent to another room...got a phone call again wrong room. We were taken back down the to original room and a bell boy was picking up the luggage and dress this was suppossed to be our room. Got another call...appologizing for the mix up and telling us that this was an upgrade, with concierge service and the rooms were newer and more spacious. The room we had was Balmoral Honeymoon Grande Luxe Suite - HG. Secondly the food wasnt quite as expected. We have read and heard that Sandals food is superb and they have world renowned chefs. If you are eating at the buffets the food is typical all inclusive resort food, if you make reservations at the specialty restaurants or the other two order from the menu restaurants you will be pleased. There was an incident when we at at Baccarat and I ordered spinich/cheese stuffed tortilini with prawns and some sauce and the waiter said \"oh i forgot to tell you we are out of tortillini and we are substituting pene pasta.\" Not quite the same. Anyway, then one night at a bar we wanted vodka/cranberry juice and they were \"out of vodka\", another time ordered run and coke \"we are out of coke\", Again at a bar ordered frozen margarhitta...our blender is broken. (not another blender around...storage for extra appliances.?? go figure) It was little things like that daily, however we are pretty laid back so we just sort of laughed like you have got to be kidding. The beach was alright. I am a beach lover and the beach was at an incline and was not wide at all. One side of the beach was actually not usable most of the time we were there. THey brought in a barge with sand and and excavator to get the sand from the barge to the beach, bacically building it up. Not sure if this is something that happens frequently or its from a hurricane. The room was very nice, large, bed comfortable, toilet seperate from sink/closet area. Tub with shower was nice and big, water was plenty hot and we never ran out of hot water. Pools were very clean, beautiful, grounds were well kept, follage was beautiful. Sandals Cay, the island Sandals owns, is about a 5 minute boat ride from the mainland. You can make reservations for dinner at the restaurant or you can go out there for the day/a few hours etc. The restaurant is open for lunch as well. The food at dinner was great and the food at lunch was great. The lsland has lots of hammocks/lounges spread out so there is privacy. you can choose to lay in the shade or in the sun. The night life is typical all-inclusive. Sort of Cheesey but the staff is great. The piano bar/crystal bar were fun and the pub was great. They had karoke, bingo and other nightly themes. You can take a bus that stops right outside the hotel and will take you downtown where you can shop visit the strawmarket, and watch the cruise ships dock. The bus is either .50 per person or $1 per person. Its about a 10 minute ride when traffic is to a minimum. My husband went diving which he said was fabulous. They take you to two different locations total time lasting about 3-4 hours. The weather was good, not 100% sunny but it was still warm enough to lay in the pool or out on the beach and get a tan. We had a little rain usually early AM or at night. It did rain during the day but it was only short increments. We did learn that the gas and groceries are very expensive there. I believe that our taxi driver told us that Milk was $6 per gallon and gas at one point was $8 a gallon. Overall the stay was nice, the staff was nice and for the most part accommodating and we had a great time.", "title": "All you can eat & drink & all the fun you can handle", "user": "jntenor", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121980914}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This was our second stay at this resort and i have to say it was much better the first time (last year). Nobody bothered to tell us they were under going major renovations. I emailed Sandals a week before we arrived to enquire about the reno's, nobody bothered to reply. I am still waiting for my survey regarding our stay so i can voice my concerns with Sandals but it has yet to arrive - thinking it never will.", "title": "Great resort", "helpfulness": 8, "user": "Darcy B", "date": "December 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121928147}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The service was not up to the same standard as last year. Restaurant service was very slow, especially at Cricketeers, it seems the guests are almost invisable to the bartenders as they are busy trying to keep the servers of the other restuarants happy.", "title": "Honeymoon- Determined to make the best of it", "helpfulness": 4, "user": "E E", "date": "December 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121924003}, {"rating": 3.0, "stay_parameters": "Stayed August 2007", "text": "Service was excellent but the food was not up to 5 Star standards.", "title": "Bahamian Retreat", "user": "kl4755", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8514571, "likes": {"liked": "— Beach & Pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "OMG!!! My husband and I and another couple just got back from Sandals in the Bahamas. EVERYTHING and I do mean everything was excellent. From the check in to the minute we left was great. I got on Tripadvisor a million times before we left for our trip. I can't understand how anyone could complain about this place.", "title": "Paradise!!!!!", "helpfulness": 5, "user": "CLW82397", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8509563, "likes": {"liked": "— Everything!!", "disliked": "— The airport!!"}}, {"rating": 1.0, "title": "Not worth the money....................", "text": "The Staff was UNBELIEVEABLE!!! Everyone is so nice and concerned about your happiness. They will do almost anything you ask. Example: Angella Brown one of the management staff was so helpful. One night we only wanted some crab cakes form the French restaurant. She had them sent to our room for dinner plus a plate of wonderful desserts.", "helpfulness": 2, "user": "Texas75160", "date": "August 24, 2007", "id": 8498632}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Room:", "title": "Expectations Too High", "helpfulness": 6, "user": "LoverofTravel_7", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8488771, "likes": {"liked": "— The Food!", "disliked": "— Mold in the property."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Our room did not have an ocean view but it was very spacious and very clean. We also got upgraded to a concierge level room. Our bar and fridge were always refilled everyday. The turn down service was also a plus everynight. There is kind of a funky smell to the water but, I got over it.", "title": "Not a five star hotel!!!", "helpfulness": 2, "user": "TexasTravelinggirl_7", "date": "August 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 8467291, "likes": {"liked": "— Sandals Cay beach", "disliked": "— the rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My wife and I stayed a week at the Sandals Bahamas. We're pretty experienced travellers, have been to the Caribbean often, and have stayed at Sandals resorts (other countries) 3 times previously. A lot of what is written below may sound like nit-picking, but you pay a premium to stay at Sandals, and the experience at Sandals Royal Bahamian didn't match what we have encountered at the other resorts.", "title": "Seemed like we paid more for the name than the resort.", "helpfulness": 4, "user": "ProudMaritimer", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 28108088}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This resort seemed much busier than the others...the crowd was much younger than we expected (we're both in our 30's, but we go South to relax and take a break from our careers, not to party all day and night). It almost seems like the resort is crammed into a small piece of land. While the beach is nice, it is small...long walks are not possible for lack of space. Our room was to be an oceanview. Well, if you leaned over the balcony and looked to your left, you could see it...not exactly what we had in mind. You pretty much had to be outside by 7 am if you wanted to get a chair, both around the pool and on the beach. They actually reserve them for guests in the more expensive rooms, even though about half of them never use the chairs.", "title": "Fun and Relaxing Trip", "helpfulness": 2, "user": "Carejean", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28100627}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The service was a bit spotty at times...more than once we had to go and ask for towels for the bathroom. While the a-la-carte restaurants were good, the experience at the Italian and Japanese restaurants was pretty disappointing...almost like they wanted to move you in and out in as little time as possible. Again, keep in mind we are comparing this to the other Sandals we have been to, and paying a premium to be at. You expect the best.", "title": "Perfect Honeymoon", "helpfulness": 1, "user": "mirlynn324", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28047088}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "On the plus side, the Bahamian people are among the friendliest you will encounter. Everyone working at the resort had a smile and a hello for you each day. The private island helped us forget about the resort beach...it is a terrific place to spend the day, much more relaxed than around the resort, where you never seem to be able to escape the noise. If you are going and want to just spend the day on the beach relaxing, the private island is the place to do it.", "title": "Incredible Stay", "helpfulness": 3, "user": "TravelTheories23", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 28040131}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Overall, I would say our experience was OK...again, it was better than many resorts you could go to. But for the price you pay to go to Sandals, this one seemed like you were paying more for the name than anything. We had a much more fulfilling experience in both Antigua and St. Lucia.", "title": "awesome place!", "helpfulness": 2, "user": "waterandsand", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27941472}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Overall this is an average hotel. I have come to this conclusion based on the amount you pay to come here and the quality and services they offer.", "title": "Not sure how it achieves second place", "helpfulness": 9, "user": "Craig412", "date": "December 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122156524}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "When you first land at the airport, they have you waiting in their private minibus at the airport for other people, when the minibus is full??. You arrive at the hotel and MAJOR construction is happening on half of the hotel, in full sight of the entrance. You are then walked across to the other side of the hotel and as you do you notice the main pools are cloudy and green looking - not crystal clear and blue. The reception staff are excellent and welcome you openly. There is alcohol in your room if you upgrade which is a nice touch. The gardens are well kept and tidy. The pool decks are dirty and in need of repair. I would say 40% of the staff are well trained and understand the meaning of customer service and the other 60% leave a lot to be desired. Water sports is a joke and run by idiots, I understand that the motorized equipment is looked after by a third party and not Sandals however with the company operating within the Sandals resort you would expect them to be monitored by a Sandals supervisor, I find three staff members whizzing around jet ski's not 30 yrds off shore foolish and certainly dangerous, especially when one of them was swimming in the water. Additionally when a guest asks for a mask and snorkel to use on your private island, you would expect one to be provided. Unlike the response I received which was rude and disrespectful. The member of Sandals staff 'Iris' who works on the water sports desk is in need of retraining or even a change of career - Customer Focus is not a strong point of this ignorant member of Sandals Staff!!!!! The restaurants are okay and the best two are Kimono's and the Crystal Room. The Kimono's staff are excellent. Not sure what night life is all about, when ever I looked into the stage area, it was led by staff fooling about on the stage to music with no idea of what they were supposed to be doing, overall very poor.", "title": "Postcard Perfect", "helpfulness": 1, "user": "ArmyWifeKidd", "date": "December 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122152934}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "To summarize, the hotel is average - dirty in places (more than less). The majority of staff are unprofessional and untrained. Management are not sure what is happening around them and to swim in the pools is at your own risk. Even the private island pool was closed for a percentage of the day on both of the days that I visited due to chemical balancing and cleaning.", "title": "Wonderful Week", "helpfulness": 2, "user": "DetailsNC", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122143216}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Whoever is responsible for this hotel within Sandal's needs to get their finger out of their backside and look at how he or she can make this Hotel live up to the standard of what people expect when they book a Sandal's Resort Hotel. I will not be visiting this hotel again and will certainly check all the reviews before looking into Sandal's again.", "title": "Relaxing , beautiful, semi - luxurious vacation", "helpfulness": 4, "user": "Buglo", "date": "December 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 122113413}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Sandal's you need to look at other hotels that are good at what they do, you have lost your way with this one and it shows. Very disappointing!!!!!", "title": "Nice resort", "helpfulness": 4, "user": "Dovina L", "date": "December 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122025497}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "What you might expect from a 4 star. They seem to specialize in weddings but this is not intrusive. The island - Sandals Cay- is a very pleasant and more quiet retreat if you don't like the busier poolside atmosphere.We enjoyed the Hobie-cats even though the Sunfish boats advertised in their brochure do not exist. The history of the \"Balmoral Club\" is still apparent around the Manor/Piano Bar -if you are interested.The staff seem generally and genuinely pleasant.", "title": "Good four star -but a wrinkle", "helpfulness": 1, "user": "t79", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 27938523}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The wrinkle- our last night -dinner at Cafe Goombay on the cay. Waitress pours my wife white \"wine\" from a half full bottle and then freezes. She says the wine doesn't look right.My wife sips and confirms it's water.Waitress brings back another glass of wine which tastes full strength.", "title": "Loved Sandals", "helpfulness": 8, "user": "Mrs-MrA", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27726483}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Now why would the staff half fill an empty wine bottle with water.? This waterdowned our experience and impression a bit. It was our last night - we didn't pursue it.", "title": "Overall good resort, but worth the money?!", "helpfulness": 3, "user": "babigirlgee", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27679775}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We have just returned from a lovely week at Sandals Royal Bahamian (March 28- April 4), flying WestJet direct from Calgary (wonderful). We were very hopeful that the recent negative reviews were wrong- they were! Keep in mind that Bahamas is a very expensive destination , which I believe is much the reason many people expect more for the price you pay. We loved out entire stay there, however, we found a few minor things that could be improved upon to live up to the Sandals standards.", "title": "It may not look like luxury but they will treat you like a King/Queen", "helpfulness": 5, "user": "JondyZee", "date": "April 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 27641941}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We have traveled to several all inclusive, “Adults Only” throughout the Caribbean, and we found this resort to be comparable. One previous reviewer mentioned the Excellence Punta Cana, a resort we have also been to. The only difference between the two resorts in our opinion was the drink/food service around the beach & pool which was better at Excellence. However, Dominican Republic is a very poor country and you do get more “bang for your buck”. We encountered many of the same concerns throughout many of our other trips as we did at Sandals (towels, dinner reservations, mini bars, preferential service at bars, non-heated pools in the winter).", "title": "Everything we expected and more", "helpfulness": 1, "user": "cjtravelerMaryland", "date": "April 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 27519160}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We just got back from SRB after a great vacation just prior to Christmas.", "title": "Excellent Resort with Top Notch Service", "helpfulness": 1, "user": "J-Roc123", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122385323}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Here is my take on the resort.", "title": "Average resort!", "helpfulness": 3, "user": "sofiaJ66", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 122377736}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Rooms - we had the Royal Honeymoon Ocean View Suite with Concierge service. We had no problem with our room. The room was clean and large enough, bed was big and comfy, and the bathroom nice with newer fixtures. The room had a small sitting area and well stocked mini-bar. The only downside was the view from our balcony. Although we did see the ocean, we also saw the run-down crappy apartment complex beside SRB. While some nights we had our patio door open to hear the ocean, other nights we had to close it due to locals whooping it up next door. I guess there is not much SRB can do about this - you cant always pick your neighbors!", "title": "Very good, not great", "helpfulness": 6, "user": "NKBurlington", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122362341}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Food/Drink - We both thought the food and drinks were great. Breakfast room service was very nice. We ate at almost all the restaurants - lots of choice considering half the resort was closed due to Manor Building renos. The Crystal Room, Baccarat, Kimono's, Italian, Pizzeria...all very good. Service was top-notch. We thought the offshore island cafe was also good. If you don’t like the food here, you probably don’t like it at any other all-inclusive resort in the Caribbean. For drinks....maybe not the best we have ever had, but we liked the Beringer house wines and the English Pub had a wider selection of beers (Heineken on tap!). The only thing I could nitpick was that morning coffee at the Spices restaurant needs to be HOT (not warm). Maybe that's a Canadian thing, but they fixed it when I asked them to.", "title": "Wedding-moon", "helpfulness": 5, "user": "EUCANADIANS", "date": "December 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122290175}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Service - What can I say...from top to bottom, it was fabulous. Everyone truly concerned to know you were enjoying your vacation. A genuine hello from everyone - food service, chambermaids, front desk, gardeners, you name it. This truly made our vacation really enjoyable -probably the best part of this resort. Even better - NO TIPPING - same great service for everyone - who knew? People who had the butler service looked as though they got their money's worth. We did not feel like second class citizens contrary to what others have posted.", "title": "Great fun, private island great, food ok, Mosquitos on island at night ...", "helpfulness": 4, "user": "irishdancernj", "date": "December 30, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122283751}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This was our 4th Sandals visit, and our 2nd to this particular property. We loved this resort the first time we visited so were a little apprehensive that it wouldn't live up to our high expectations, however there was absolutely no need to worry !", "title": "14 indulgent nights...", "helpfulness": 2, "user": "WooWoo28", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164313389}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "From the moment we arrived at the airport we were subject to the full Sandals experience. Within minutes we were whisked by limo to the resorts reception to be greeted by the first of our trio of butlers. Check-in was transparent and we were soon being escorted (with the first cocktail of the holiday in hand) around the resort to our 5th floor ocean view suite in the Balmoral Tower. The room was bright and spacious with one of the best views in the resort.", "title": "Meh, ok but not worth the $", "helpfulness": 2, "user": "CQA", "date": "June 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 164297133}, {"rating": 1.0, "stay_parameters": "Stayed June 2013", "text": "Our butlers were super; good fun but very professional at the same time. As guests go, I think we were quite undemanding of their time however they made sure we had our fair share of their attention. It's probably the things they do behind the scenes that make the difference; restaurant bookings, little in-room treats, even a carrier bag and towels for a trip. That said, dinner served in our room was an awesome experience !", "title": "Extremely disappointing", "helpfulness": 8, "user": "Janellek0613", "date": "June 17, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 164268469}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "On the subject of food, we ate in most of the restaurants (some several times) during our 14 night stay and enjoyed each and every meal. The only little criticism / tip is don't arrive at the crystal room at 6.30pm even if you have a reservation - it's chaos ! We arrived at 6.30 as per our booking and didn't eat anything for 45 minutes, we eventually bailed out an hour and a half later only having 2 courses. In balance, we ate there a few night later at 8pm and had a wonderful dinner (including a flower filled table courtesy of our butler). Gordon's on the pier is stunning; eating delicious food while watching the sun set is a dream! The Baccarat room was a delight - you forget you are in an all-inclusive resort and think you are in a high-end restaurant. Our guilty secret of this holiday was indulging in freshly made pizza from the outdoor pizza oven each afternoon - yum!", "title": "We had an amazing vacation!!!!", "helpfulness": 1, "user": "Jan M", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164193208}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Sandals jewel in the crown is their staff, from our super-duper butlers (Vincent, Seronte and Marcus - guys, thank you so much!), Sherwin (who runs the piano bar and a master of his craft) to the young lady who served us our daily pizza (so sorry we didn't catch your name but you recognised we had the same high stools every day !) , Carlton at Gordon's, and the many who said a cheery good morning / evening energy time we passed", "title": "Ruby wedding Aniverary", "helpfulness": 1, "user": "standev", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164185101}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My hub and I decided to visit SRB for our 10th wedding anniversary. I read all the reviews, including the negative ones, and I was extremely nervous about going on this vacation. Boy, was I wrong!!! We had a fantastic time!!!", "title": "Fantastic Time....Don't worry about the negative reviews!!", "helpfulness": 3, "user": "alley24", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27124612}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "1. We stayed in the Manor Building, 5th floor. Beautiful view of the ocean and a multi-million dollar estate next door. The building is old, but who cares!! The character of the building shows through.", "title": "Didn't want to leave.", "helpfulness": 3, "user": "KansasCityCA", "date": "March 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27119754}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "2. Housekeeping: Our room was cleaned everyday between 3 and 4!! We didn't have to call down for towels, ever; they were delivered every night.", "title": "Quaility of food &service only", "helpfulness": 3, "user": "TorontoDeuce2", "date": "March 30, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 27097937}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "3. Concierge: Sandra was fantastic!!! We couldn't get through to make our dinner reservations, line was busy. We went down to the concierge desk, and Sandra made our dinner reservations for our entire stay. Can't beat that for service.", "title": "Not all it's cracked up to be....so go in with eyes open if you choose to go.", "helpfulness": 4, "user": "JND_ready2go", "date": "March 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 27070137}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "4. Service: Everybody was fantastic!! There was 1 incident at the concierge desk (not with Sandra), but it was late at night....so, I can't blame her for being a little annoyed. I would have been too. Everybody greeted us everywhere we went!!", "title": "Relaxing/Entertaining Couples Destination", "helpfulness": 1, "user": "Mellya", "date": "March 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 27060131}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We read all the reviews before we left and were a little apprehensive based on the significant investment that we made on this vacation.", "title": "Week in Paradise", "helpfulness": 9, "user": "Matthew T", "date": "December 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122277721}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "All of our doubts were well put to rest the second we arrived. We waited no longer than 5 minutes before we were on the way from the airport, and were greeted by a friendly bellhop to take our bags to our room and 2 warm towels to relax with.", "title": "Anniversary10", "helpfulness": 4, "user": "Amy H", "date": "December 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122277657}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Checking in took 10 minutes, and we were given a complimentary room upgrade as well.", "title": "Best Wedding and Time Ever!!!!!!!!", "helpfulness": 2, "user": "FloridaLisalisa", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122253156}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The resort was extraordinarily clean and beautiful.", "title": "You definitly dont get what you paid for!!", "helpfulness": 7, "user": "Skita07", "date": "December 29, 2011", "detail_rating": {"value": 1.0, "sleep": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 122251884}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The food was amazing.", "title": "Beautiful anniversary vacation, our first trip to Bahamas early Dec. 2011", "helpfulness": 8, "user": "wolflover", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122187668}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I stayed at this resort for our honeymoon from 8/21-8/28. The airport and transfers were fine, but once we got to our room, we were extremely disappointed. We were placed in the Manor Building, room 205, which was supposed to be an ocean view luxury concierge room.", "title": "Stay only in the Windsor Building", "helpfulness": 2, "user": "Quinnipiac03", "date": "September 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8609854, "likes": {"liked": "— Pool was nice - you can sit on floaties all day; dinner at Gordon's and private dinner on beach", "disliked": "— Rude staff, false advertising of star resort, room quality"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "It was far from an ocean view and so far from luxurious. Dirty, very old, moldy- random Holiday Inn's and Howard Johnson's we have stayed in were much nicer than this! The room was a huge let down and certainly not the 4-5 star quality that Sandals advertises. After asking about 7-10 different women at the front desk and one manager to change rooms, we were still unsuccessful and the concierge/guest staff were very rude each time. We finally lucked out when we randomly met the Director of Guest Services, an amazing woman named Angella Brown, who saw the disappointment on our faces and immedately moved us to the Windsor Building, room 1524 - amazing ocean view, junior suite with a 4-poster bed, big tub, large living area and was very clean and new.", "title": "Second honeymoon at the Sandals", "helpfulness": 1, "user": "roddee", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8592054, "likes": {"liked": "— hands on service", "disliked": "— N/A"}}, {"rating": 4.0, "title": "Loved every day", "text": "Our advice to you is to make sure you are in the Windsor - the jr suite level rooms in that building are worth every penny and are what a typical honeymooner would expect based on the way Sandals advertises their rooms to be. If you get stuck with Manor, expect old, moldy and 2-star quality. But, be persistant (ask to talk to managers, directors) and if all else fails, ask to speak to Angella - her office is in the Windsor building.", "helpfulness": 1, "user": "melis_7", "date": "August 29, 2007", "id": 8539086}, {"rating": 5.0, "title": "awesome", "text": "The food is not 5 star, but it's not as bad as most people say on this site. Avoid Kimonos and Arizona's for dinner, but the Crystal Room is a must, along with Gordon's On the Pier ($140 per couple and worth every penny - the view and fantastic 5-star menu are wonderful).", "helpfulness": 1, "user": "mscsdd", "date": "August 29, 2007", "id": 8535992}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Our night at Gordon's and our private dinner on the beach (you can choose your own menu - anything from filet mignon to lobster) were our two best nights there and we would recommend doing both - very romantic and the best food on the resort.", "title": "our amazing honeymoon at sandals", "helpfulness": 3, "user": "sarah_roo03", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8516413, "likes": {"liked": "— all inclusive, amazing atmosphere and facilities", "disliked": "— nothing, it was all incredible"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I returned from this beautiful property on June 16 after enjoying 6 wonderful days of indulgence! This was our 3rd time to this Sandals and each time it gets better than the last. We have been to almost every Sandals and Beaches Resorts in the Bahamas and the Caribbean and find that the food quality and service has been greatly improved over the years.", "title": "Very Pleasantly Surprised", "helpfulness": 3, "user": "garyandsue515", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164597464}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The complimentary wines were very good as was the Chairman's Selections. Alcohol was premium and available everywhere. We enjoyed dining at Bacarrat and our server,Andrik, was knowledgable and professional. The food was EXCELLENT!! Lamb chops, escargots, crab nippers (stone crab claws). We recently read a review from a couple who were there the same time period as we were and surprised that they felt the food was awful, made them sick and the only thing they ate was pizza and went across the street to Subway??? I suppose if you are into Subway sandwiches, pizza and burgers you might be disappointed at Sandals because the choices were filet, lamp chops, great Italian, crab nippers, excellent salads and on and on.", "title": "DISAPPOINTING", "helpfulness": 3, "user": "terri333", "date": "June 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164534072}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Gordons on the pier was great atmosphere.", "title": "Hmmm...... Not sure I liked it.", "helpfulness": 6, "user": "Luvsfood2", "date": "June 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 164426489}, {"rating": 5.0, "title": "Sandals is a \"top of the line\" resort where the employees make you feel like you are at your home away from home", "text": "Our butlers, Antonio, Everett and Dillon were friendly and professional and eager to do everything to make our stay perfect. I really do recommend getting butler level, if possible as it makes a vacation super special.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 18, 2013", "id": 164398313}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The resort itself is beautiful, great landscaping and CLEAN. The private island, as others have said, is the best! While the beach at the hotel is very nice, the beaches on the private island make you feel you are on your own private island (which happens to have a swimming pool, cute little restaurant and plenty of shade palapas) We took the boat at 10AM every morning and the last one back at 4:30PM. Drink service on the beach was also a nice touch as well.", "title": "Great anniversary trip", "helpfulness": 2, "user": "Beth H", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164326004}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Just stayed at the Sandals Bahamas for our honeymoon and it was wonderful. We had a great time - it was our first all inclusive. We had few complaints, but all in all it was great. The food was good and many restaurants to choose from, the staff there was so nice and friendly and very helpful and I would say the best part of Sandals. Our room was nice, clean and quiet which we liked. The pools and beaches were nice and clean but the beach was a bit small.", "title": "Loved It!", "helpfulness": 2, "user": "bmcadam", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8619234, "likes": {"liked": "— It was quiet", "disliked": "— The shuttle home sucked"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Now what did we not like - well the buffets were okay - I guess being", "title": "Superb Resort", "helpfulness": 2, "user": "WARKSMEMBER", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8618486, "likes": {"liked": "— Very clean, large room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "a frequent Vegas traveller when I hear buffet I expect something more", "title": "What can we say....A little heaven on earth", "helpfulness": 1, "user": "rklarer99", "date": "September 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8615989}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "plentiful then we got at Sandals. The food was good but the drink service at the restaurants is slow, so ask for 2 drinks when you order, but the drink service at the bars is great and fast,so no need", "title": "Nice but Not That Nice", "user": "Gee2078", "date": "September 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 8612752, "likes": {"liked": "— Pool Areas", "disliked": "— Lack of entertainment"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "to double up there!!", "title": "What a great honeymoon!!", "helpfulness": 6, "user": "Traveler9974", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8610062, "likes": {"liked": "— The pool!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Even though this was a business trip for me as a travel specialist, I can honestly say that I was able to experience so much of this property that I felt like an honored guest. If you are thinking of a destination wedding, Sandals does a fabulous job literally from soup to nuts. Tailored to your requests and easy to work with. Plus the property is beautiful with so many different areas for the ceremony. The Offshore Island was AWESOME! So private and romantic.", "title": "June 2013 Visit", "user": "AngelaC810", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163796854}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The experience was absolutely nothing but the best. Snorkeling is a MUST as well as trying out the adult beverages. The staff was some of the friendliest I have ever met. Although, it was an offshore excursion for a cruise, I would not hesitate to go just to this resort for a vacation.", "title": "Awesome", "helpfulness": 3, "user": "Maggiedes", "date": "June 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 163790637}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I just came back from the Royal Bahamian where we spent a week in the beachfront walkout room of Balmoral Tower, with butler service. Our butlers were fantastic! We really appreciated the attention and service we received from Dillon, Antonio and Everette! And a special nod to the butler on the off shore island who was so courteous while we were there. We found the resort to be very clean and the food was plentiful, and tasty. We loved relaxing on the island, so private! Often we were the only people on it at certain times, which was great. The only reason I didn't give it 5 stars was I unfortunately was bitten over 20 times by Mosquitos and suspect it may have been because the week before we arrived Nassau experienced torrential rains and we saw many standing puddles as we were driving from the airport. This isn't a fault of the resort of course, but it made it hard to have a truly 5 star experience at that particular week after the storms. Our butlers did go out of their way to get me some \"Off\" spray, which was great. We would definitely return here to the resort as we were made to feel so welcome by the staff, everyone was extremely friendly, the food was good, and the private island was amazing! Our butlers even arranged massages for us on a private pier overlooking the water, heaven!! Highly recommended for couples looking for a Romantic, relaxing getaway.", "title": "June 2013 vacation", "helpfulness": 2, "user": "DMwyckoff", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163709392}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This being our 7th visit to Sandals resorts...Antigua,,Jamaca...St Lucia,,e.t.c..we pretty much knew what we would be getting.", "title": "Amazig Sandals Bahamas", "helpfulness": 1, "user": "NottinghamGlyn", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163686662}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "However in our opinion this is far and away the most amazing place we have ever stayed.", "title": "A Royal Thank You to Sandals Royal Bahamian", "user": "swerrlein", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163672878}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed at this resort to be in friends wedding. Everything was perfect. The entire staff was friendly, resort beautiful. The wedding was unbelievably awsome and went off without any problem. We can't wait to go back again", "title": "One of the best vacations ever", "helpfulness": 1, "user": "haremoe", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27441046}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This was our six trip to a sandal's resort and everything was wonderful. The staff in Nassau were great, friendly, helpful warm and courteous. There were no negative responses to any requests made for services, questions or general information. You were made to feel that you were appreciated and that you were the most important person on site.", "title": "Sandal's resort experience", "helpfulness": 1, "user": "aspencanada", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27344331}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "You will read reviews about the overall cleanliness of the rooms, ours was fine. Everything was very clean and the room had a great view and comfortable bed. We had to call to house keeping after our room had not been cleaned by 4PM, but it was eventually. The staff were full of great smiles and they were very helpful with all questions. Not that you will, but we received several free trips in the $400,000 Rolls Royce, white glove service and all. All because we were friendly with the right people. The staff will tell you they cannot accept gratuity. They Can! They are working for a living too. You just have to be discrete about how you tip them; always better service. The food.... Well it was not 4 star standard. We would prefer \"Fish Fry\" every night. Try the Swiss Pastry Shop just out the front gates to the left about a block; whole or by the slice/piece. If you are looking for a romantic get away with someone special this is the place. Pools and pool bars were awesome, as was the beach and private island. Only problem with the water areas was that people would put down items to reserve lounge chairs at all times in the early morning, kind of annoying. Overall one of the best vacations I have had.", "title": "Great Resort, OK Food", "helpfulness": 1, "user": "Dan F", "date": "April 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27315801}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Sandals Royal Bahamian comes close to meeting their advertised claim of \"luxury included,\" but doesn't quite get there.", "title": "Beer quality on a champagne budget", "helpfulness": 5, "user": "philFromOttawa", "date": "April 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 27284476}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The experience begins at Nassau airport, where Sandals has a desk. A bus was waiting to transfer us to the resort. The ride took about 15 minutes. Once at the resort, things got a little disorganized. Warm towels and champagne were offered, but the 20 or so guests who had arrived with us on the bus milled around for about ten minutes before someone arrived to check us in. It was not a big problem, but not a good way to begin the vacation, either. Our room wasn't ready (even though the check in time was 3:00 PM, and this was a little after 3:00), so we were led to a restaurant to have \"lunch\" (we opted for the liquid variety). Our room was ready at about 3:30.", "title": "It was PARADISE!!!!!!!", "helpfulness": 3, "user": "Island15", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27178839}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This was our second Sandals resort, and we really enjoyed it. We stayed in the recently renovated Balmoral Tower, and it was very nice. The rooms were clean and the staff did a good job of keeping our refrigerator stocked each day. We also had towel animals every night which was fun and had a nice view of the ocean from our balcony. We really enjoyed the private island, it was relaxing and calm. It was like its own little world. They have a boat to take you back and forth which comes and goes about every hour, so it was really easy to get there and back. The water was so clear, we were able to swim out just a little and see all kinds of fish. The resort had 8 different restaurants all of which were very good. The Baccarat was really good for breakfast and we really enjoyed Kimono's for dinner (hibachi style). The pizza place is superb for lunch or a snack. Most of the days, we stayed on the pretty beach. One day, we took the bus into the downtown area. We felt very safe the whole time and enjoyed shopping in the downtown area. The staff was friendly and the stay was perfect!", "title": "Beautiful and Relaxing", "helpfulness": 2, "user": "S618VTX", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164103188}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This resort was also really easy to get to, it was only about a 10 to 15 minute ride from the airport. The airport was nice and we were able to get a direct flight there and back, so this is a much easier Caribbean Island to get to than many of the others.", "title": "Very clean, we'll groomed", "helpfulness": 2, "user": "al_adams", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164019295}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "P.S. I would recommend the Hummingbird as your drink of choice, it was very tasty!", "title": "Quick Trip to the Bahamas", "helpfulness": 3, "user": "Laura A", "date": "June 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163959623}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a beautiful resort. It was our third year. Very friendly staff. Food was excellent. It was a fantastic vacation. You could leave the resort wit no fear. Take a bus ride. Go to the flee market.", "title": "Wonderful Honeymoon", "helpfulness": 1, "user": "Katie G", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163888273}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "My husband and I just returned from Sandals Royal Bahamian after a 4 night stay. Our room was in the old tower with concierge service. The water was crystal clear and the private island was relaxing and beautiful! We went to Sandals Whitehouse in November so I figured I would compare the two since many people get stuck between two resorts :)", "title": "Best resort for couples", "user": "Joleen B", "date": "June 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163799500}, {"rating": 3.0, "title": "Pros and Cons to Sandals Bahamas", "text": "We had our honeymoon at Sandals and stayed at the resort from Aug.27 - Sept.3rd. We had a good time all in all but I can see how you'd run out of things to do in that particular resort. What we did like about the hotel was the private island they take you out to on a boat where you can go snorkeling . The restaurant out there is average and serves burgers & fries. The drinks are watered down too so you can have 20 drinks in a day and not even feel it.", "helpfulness": 3, "user": "jester95008", "date": "September 6, 2007", "id": 8666209}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The thing about the island though is if you don't put on bug spray and you have a night dinner there like we did , you'll be overwelmed by sand flees. They are biting like mad in the night!", "title": "Amazing!!!", "helpfulness": 2, "user": "recchick", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8666064, "likes": {"liked": "— the service", "disliked": "— nothing!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "As far as the main island of Sandals Bahamas , the two pools are nice though rather crowded and the guests sometimes feel they are more special then others because they have a wedding booked there (there was a wedding taking place when we were there on the night of Sept.1st and the bridesmaids slept a few rooms down from us and kept slamming the doors all night)", "title": "Sandals was nice and relaxing", "helpfulness": 7, "user": "Autumn1313", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8665280, "likes": {"liked": "— The price I paid", "disliked": "— Sand Fleas"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "They also had a survivor night , and a Luau , a Havana night and some other event but its to get others all involved and into meeting other people. We went with the intentions of relaxing and just being together by ourselves but because sandals basically forces others on you we had no choice..", "title": "This is not a 5 start hotel", "helpfulness": 2, "user": "drmoto", "date": "September 4, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8654156, "likes": {"liked": "— The beach and the pool", "disliked": "— Service, The room and the food"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "They have a restaurant called Kiminos that is no good . You have to sit with 9 other strangers and eat , and the cook is a loud mouth that throws food in your mouth. Very lame.", "title": "Sandals Royal Bahamian - Fantastic!", "helpfulness": 5, "user": "phauphy", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8619651, "likes": {"liked": "— The Staff", "disliked": "— Mold"}}], "location": {"country": "Caribbean"}, "stars": 5, "variance": {"poor": 334, "average": 482, "very good": 1172, "terrible": 258, "excellent": 2375}, "aka": "Sandals Royal Bahamian Spa Resort & Offshore Island Hotel Nassau", "slim_ranking": 0.0666666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "•New, extra comfortable, ultra luxurious Day Beds added poolside on Sandals Cay •Sandals Cay now has Zen Spa and Fire Pits.-----•Butler Service, 24-Hour Room Service, and Rolls Royce or Mercedes Transfers for select suite categories. •Over 10,000 sq. ft. of the Island’s most impressive Freshwater Pools•Sandals Cay – Nassau’s only resort with Private Offshore Island & Restaurant.•Ten Dining Options featuring an array of cuisine from French to Bahamian. •Minutes away from excellent duty free shopping in Downtown Nassau on Bay Street and world class gambling on Paradise Island.•Weekly Late night decadent Chocolate Buffet offering specialty coffee •Voted Sandals Resorts “World’s Leading All-Inclusive Company” 16 years in a row. •Voted Sandals Resorts “Caribbean’s Leading Hotel Brand” 18 years in a row. •Voted Sandals Royal Bahamian “Bahamas’ Leading Spa Resort”."}