{"user_rating": 2.0, "review_count": 17, "name": "Sandstone Inn", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We were misconnected by Alaska Airlines in Seattle on a Friday night, and tried repeatedly to find a hotel with a room for the night. My daughter finally got a room through the Yahoo Travel at the Econolodge SeaTac. (this used to be called The Sandstone, and they still answer the phone with that name). We knew it would be a lower-end room, but we were desperate after traveling for over 22 hours from Ireland. We checked in at 9pm that evening, and checked out at 5am the next morning because the room was so AWFUL! It was supposed to be non-smoking, but the room reeked of cigarette smoke. Not a good thing with my asthma! We tried to air out the room with the ac/fan, but the unit would not work, and upon trying to see if it just wasn't plugged in, we found the outlet almost falling out of the wall. The floor seemed to have been without vacuuming for weeks, let alone cleaning. It was gritty to walk on. The counter around the sink had hairs all over it, but the worst was the bathroom. The wall around the toilet had \"spatterings\" of urine, possible vomit and/or feces. It was absolutely disgusting. Since we had not other options, we chose to stay in the room, but left a light on all night to hopefully discourage any creepy-crawly guests from visitng us in the night. The sheets were clean, thank goodness, and we tried to sleep, but it was fitful at best. We finally decided to take the first van back to the airport, which left at 5a. Upon checkout we tried to get a receipt for our stay, but were told by the clerk that he couldn't print one for us. He explained that this was a prepaid stay (by our credit card over the phone the night before), so he couldn't release any info to us in case we weren't the ones who paid for the room(??!!) Overall, the most disgusting, awful fleabag hotel we have ever stayed in. Avoid it!", "title": "AVOID the Econolodge SeaTac", "helpfulness": 2, "user": "retiredandtravelin'", "date": "July 30, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8262621, "likes": {"liked": "— Nothing!", "disliked": "— It was FILTHY!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We stayed here because we needed a place near the airport that was reasonably priced and happened upon this place first. We just drove in and got a room. It was small but reasonably clean. Breakfast was cereal and toast and that's it. There was a microwave, but the fridge was under the bathroom counter which was okay--just kind of funky. (The bathroom was LARGE.) The clock/radio did not work. I asked for a wake-up call and the clerk punched a bunch of numbers into a machine, but the call never came--we woke up anyway, but be careful. (Don't know if phone worked or if a mistake was made--my money's on the phone not working/not ringing.) It's close to the airport and the staff was nice. It's rough around the edges, a little old. But it was fine for a night for us.", "title": "Okay for a night", "helpfulness": 3, "user": "MaggieP6789", "date": "March 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 100453393}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "We stayed at the Econo Lodge South at SeaTac - 19225 International Blvd, (Old Pacific Hwy S), SeaTac, WA 98188 on July the 9th 2010.", "title": "Slum Lords Dream, be afraid be very afraid...........", "helpfulness": 11, "user": "OutandAbout15", "date": "July 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 72099472}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It is a slum lords dream, most of the people staying there looked like rejects from a Section 8 Housing program. One of the rooms was being used by Hookers who were working International Avenue.", "title": "acceptable", "helpfulness": 2, "user": "dante012", "date": "March 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 59461598}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Its a worn-out X-something or other, Motel 6 - Days Inn - Flop n Stop, in one of the worst parts of town.", "title": "Surprise and Relief", "helpfulness": 3, "user": "Travelcrow", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55915375}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The room we were assigned had a 50 gallon hot water heater out in the room, I repeat in the room.", "title": "Awful stay!", "helpfulness": 2, "user": "s0metimetraveller", "date": "May 24, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 16358602, "likes": {"liked": "— Package deal with extended parking and an overnight stay", "disliked": "— Everything else!"}}], "location": {"country": "United States", "city": "SeaTac"}, "variance": {"poor": 0, "average": 5, "very good": 0, "terrible": 11, "excellent": 1}, "aka": "Econo Lodge Seatac Airport South Hotel Seatac", "slim_ranking": 1.0}