{"user_rating": 4.5, "review_count": 3465, "name": "Sandals Grande St. Lucian Spa & Beach Resort", "reviews": [{"rating": 5.0, "title": "Sandals is Grand", "text": "There's a reason they call it paradise! This was it for my husband and me. We loved the Sandals Grande.", "user": "hoppersh", "date": "November 6, 2007", "id": 10644992}, {"rating": 2.0, "title": "Back Seat Honeymooners!", "text": "We liked their beach best--it was clean, picturesque and never crowded. The main pool was really great and the swim-up bar was fun, but tended to get too crowded by mid-day, so we preferred the beach. The watersports were excellent with a wide variety of things to do and the watersports staff was very friendly and helpful.", "user": "OttawaChiqua", "date": "October 31, 2007", "id": 10482857}, {"rating": 5.0, "title": "So Don't I", "text": "The restaurants and the service in them were all great except for the London Pub--we ate there twice and the service was slow and unfriendly both times. Bayside Restaurant was our favorite and Tuscanini's had a romantic atmosphere. Our package did not include room service, which was a bit of a diappointment.", "user": "Hafendorfer", "date": "October 31, 2007", "id": 10478183}, {"rating": 5.0, "title": "The Best Honeymoon at the Grande!!!!!!!", "text": "The front desk was very helpful to us in finding our luggage that the airline had lost. They kept checking on it for us and calling us with updates and delivered it to our room as soon as it arrived.", "user": "honeymooners92207", "date": "October 29, 2007", "id": 10417778}, {"rating": 4.0, "title": "Everything we expected!!! Paradise!!!", "text": "As a whole, the entire staff is friendly. They try to make you feel welcome and excited, which must be a task considering how many people they see continuously coming through. By the end of the week, most of them recognized us and even a few knew our names.", "user": "Dooley4556", "date": "October 21, 2007", "id": 10205101}, {"rating": 5.0, "title": "The Best!!!", "text": "We stayed at the Grande the first week of our honeymoon. and all I have to say is WOW! Im sure you have heard this all before but this resort has it all! Great food, Location, Amazing, Cozy beds, Great pools, & a lovely setting.", "user": "Spabliss", "date": "November 13, 2007", "id": 10807258}, {"rating": 4.0, "title": "My favorite Sandals so far", "text": "We mostly stayed at the resort for the week. We did hike to Pigeon Park which I highly recommend! The View at the top is Spectacular!! We did the land and sea tour which really wore my patience thin, but looking back on it, it was hysterical!!! we took a catamaran to the Pitons Listening to a song called \"booty\" the whole time. Went by bus to the botanical gardens, and the Volcano, at this point we are all Starving! So we think the bus driver is going to a restaurant and we pull up to a day care and the bus driver opens the door and plops a little girl right next to me and keeps driving! When we finally get to the restaurant it is this local little hole in the wall with a pool in the middle of the restaurant with No water in it and a very Dirty buffet. It was a great way to see the island, but a weird excursion.", "user": "1109", "date": "November 13, 2007", "id": 10794137}, {"rating": 5.0, "title": "recommend rondoval butler suites", "text": "Now that that is all said and done, Im going to give the positives and negatives of sandals. The negatives are minor, The positives outbeat them:", "user": "oceantravelerPa_", "date": "November 13, 2007", "id": 10791369}, {"rating": 5.0, "title": "Stayed a week and wanna go back NOW", "text": "Positives: Great food, Clean resort, amazing pools, Free access to the Spa sauna, steam room and plunge pool 24/7, No reservations to the restaurants, AMAZINGLY comfortable beds, helpful staff, Good drinks, I could go on and on......", "user": "chattygirl7491", "date": "November 11, 2007", "id": 10755569}, {"rating": 4.0, "title": "Prime Minister Room With Butler :)", "text": "Negatives: I know everyone is on there honeymoon at sandals, but they did not acknowledge it at all! It would have been nice if there was some recognition. The halls had a bad odor to them and they were in very bad shape compared to the rest of the resort, The staff at the Bakery/Cafe are RUDE, The Barefoot by the beach was awful and one day, it was the only option for lunch,. The Hostess at the Italian Restaurant one night was very rude to me and became argumentative! The beach is rocky at first.", "user": "DONKA2", "date": "November 7, 2007", "id": 10672612}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "In January 2005, we stayed at Sandals in Whitehouse Jamaica. We were so impressed by that vacation, we decided that we would try a Sandals again this year. The Grande St. Lucian was pale incomparison to Whitehouse Jamaica. Although our room, a one bedroom suite, was nice, it was on the 2nd floor overlooking the pool. We couldn't see anything because our view was obstructed by trees. It was also loud by the pool area day and night. We didn't care for that. Our suite came with butler service. We never heard for any of our 3 butlers until toward the end or our trip. Of course, it was because \"tip time\" was coming. Only once during our entire stay were we asked if we wanted anything from the bar while at the beach or the pool. The swimming area at the beach was covered with sea weed. The service outside was non existant. Overall, the food was average to borderline poor. The service overall was poor. On the plus side, the spa service was very good. My husband and I had massages and the staff was very pleasant and friendly. We also liked the work out facility. The pool area was very nice as well.", "title": "Not worth the money...", "helpfulness": 5, "user": "jb2324", "date": "January 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 4373795}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "First off, my wife and I (both about 40) have done quite a bit of travel over the past several years. Three cruises and then we went to all-inclusives. Three trips to Jamaica and then this trip to St. Lucia. So, you understand that we are not first time travelers. This was not our first trip, nor our trip of a life time. For example, a honeymoon or the trip we saved for 20 years.", "title": "Great time", "helpfulness": 14, "user": "Mike981", "date": "January 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4373192}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "I will give you a not so quick run down on our take of the resort and then a couple of tips on how to enjoy your vacations better.", "title": "You will love it!", "helpfulness": 10, "user": "onlinestuff3", "date": "January 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4370553}, {"rating": 3.0, "title": "Hit or Miss", "text": "This is a very nice resort. We stayed in the Prime Minister suite and it was great. The butler service was good. Not great, but we don't ask for much, so I can't blame him. I had contacted the hotel manager ahead of time to see if he could get the two other couples a view of Rodney Bay and he was able to accommodate my request. On our second day at the resort, the manager even called our room to make sure I was happy with the room and see if we needed anything. That said, there is a chance that if you book the lowest category you might not have the same experience. That would be the same at any place you stay at. We spend a lot of time in our room the first part of the day and we also like to entertain friends in our room. So we love a nice room. You might not and could save some $.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 22, 2006", "id": 4369159}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "Food, you know if your trip is heavily based on great food don't do all-inclusive (AI). Heck, don't do a cruise! I don’t understand why people who have these kinds of expectations don’t go to a hotel with ala carte service. Think about it, it is a cost issue. That is why you will hear some people complain that most AI's don't have top of the line premium booze. They have good to very good booze and good to very good food. I can't imagine how much more they would charge if they were able to serve up food that no one complained about and everyone’s favorite booze. That said, we felt the food was some of the best on any of our travels. My wife loved the beach restaurant. I liked Kimono’s best at the other Sandals resort, Regency. The drinks were more consistent than some other resorts we have been to.", "title": "It was Fine", "helpfulness": 15, "user": "adale25", "date": "January 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4358301}, {"rating": 2.0, "title": "Not worth the money", "text": "My husband and i visited the Grande for three nights over new year,we had paid a lot of money so therefore we expected a certain standard.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4394766}, {"rating": 4.0, "title": "Great Time!", "text": "We were dissapointed as this hotel is not 5 star plus as we were told but more of a 3/4 star standard.", "helpfulness": 7, "user": "littlekimmer", "date": "January 26, 2006", "id": 4389862}, {"rating": 5.0, "title": "The Grande was Grande!", "text": "The food was average bordering on poor.", "helpfulness": 46, "user": "laffmyselfsilly", "date": "January 25, 2006", "id": 4387029}, {"rating": 4.0, "title": "Great bay", "text": "The room was lovely and clean as where the gardens.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 25, 2006", "id": 4386665}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Service was ok.", "title": "Paradise! Would love to go back!", "helpfulness": 34, "user": "Doglad", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4386426}, {"rating": 5.0, "title": "Best Sandals yet!! Would highly recommend !!", "text": "This was our 6th Sandals and was the best in our opinion. We have been to Beaches Negril, Sandals Negril, Sandals Dunns River (second favorite), Sandals Bahamas, Sandals Antigua..", "helpfulness": 50, "user": "justplaingoofy", "date": "February 11, 2006", "id": 4453045}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Sorry for such a lengthly review, but am hoping it may help someone. From the Beginning:", "title": "Enjoyed every minute of it!", "helpfulness": 18, "user": "MarylandGal", "date": "February 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4452666}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "AIR- Please be very careful with your carry on luggage. We were traveling with our friends and their carry on suitcase was stolen! We were on an American flight from Boston to Miami. When we got off the plane his suitcase which was stored in the overhead was located closer to the front of the plane due to lack of space in the back.. GONE!! If it was a mistake one would've been left behind.. They never got it back so please don't let it out of your sights! Unfortunately, it was the bag with the stuff they didn't want to pack in the checked bag incase it was lost..", "title": "Our Best Sandals Trip Yet!!", "helpfulness": 9, "user": "NurseandMedic", "date": "February 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4452533}, {"rating": 5.0, "title": "St. Lucian Grande is the best!!!!!", "text": "We arrived at UVF at the same time as a Virgin Atlantic plane 747, holding about 350-400 passengers. Along with a US Air plane 757 carrying about 180, plus our American Airlines 757... Needless to say immigration and customs were chaotic! Took us over an hour to clear immigration.. I have heard that is not the \"norm\", but occasionally does happen. I know everyone needs to make a living, but you may want to hold off using the porters at the airport.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 8, 2006", "id": 4446040}, {"rating": 5.0, "title": "Love it there!", "text": "After you clear customs they are waiting to take your bags through a set of double door(which you don't know what is behind)to walk about 30-50 ft. We had read about it on this site and declined..Happy we did..", "helpfulness": 11, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4442627}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "My husband and I have visited 4 different Sandals resorts this being our 5th. From all the reviews we had read we thought the bus ride would be awful. It was fine. We had Patrick as our driver. He stopped for us 3 times for breaks, and answered all of our questions along the way. When getting to the resort, the resort was very organized and we were in our room within an hour of checkin. Everything was taken care of for us. Konrad Wagner who is the general manager, did an excellent job upgrading us. And the couple that we travel with got upgraded and was right across the hall from us both at no extra cost. The rooms were great. Clean and very modern. Viola was our room attendant and she did an excellent job. Made sure our every wim was taken care of. We had excellent food at Barefoot by the Sea, and the service was great also. The beach was great and clean. We did have several couples visit from the other two Sandals and said they were disappointed as it rained most days. We had great, hot, and sunny weather.", "title": "great time", "helpfulness": 11, "user": "margaretinindiana", "date": "February 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4418302}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "We were alittle disappointed when we were told that the returning guest party was only going to be a cocktail party, but decided when it was over to go to the Halcyon for dinner. Don't do it. They also have their return guest party on the same day, and they had a sit down dinner. We couldn't get a table at the Pier, or Mario's as both do not take reservations and their Bayside restaurant was where their sitdown dinner was held. Had to turn around and come back. However looked around the Halcyon a bit, It is extremely small. But hey, it is all in what you want. On our second day there, Sunday, a cruise ship came in and those people from the ship could purchase a day pass to our resort. It was so crowded that there were no available chairs at the pool or the beach. The bars were crowded also. I realize Sandals must get a kick back for those, however it hampers their own guests satisfaction.", "title": "Not really that great", "helpfulness": 9, "user": "CourtneyF", "date": "February 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 4413119}, {"rating": 2.0, "title": "Sweet, sweet Sandals.....Can free booze drown my sorrows?", "text": "We went to market for some \"deals\" in the middle of the week. The locals really don't deal. They take off a couple of dollars on a $15. or $20 item, but that is it. If you want it, you have to pay for it. Not at all like Jamacia. They take the fun out of bargaining for those of us that like to do so.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "February 1, 2006", "id": 4405479}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "We waited to see alittle bit of the island on our return trip to the airport. We rented a car from Avis with a driver who picked us up and took us where we wanted to go. It was ok. Not great for the money.", "title": "5-star resort???", "helpfulness": 13, "user": "hkfromerin", "date": "January 31, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4399875}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "All in all it was one of the very best vacations that we had. I think if you treat the help with respect and courtesy you will get it back 100 fold.", "title": "Had a great time....", "helpfulness": 22, "user": "Flyinbyu", "date": "January 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4395126}, {"rating": 5.0, "stay_parameters": "Stayed November 2004, traveled as a couple", "text": "We didn't want a big wedding. We wanted to go away - alone. We didn't want to be around any kids. We wanted to do all inclusive, and wanted to do caribbean.", "title": "Most fantastic weddingmoon ever", "helpfulness": 15, "user": "StacieRhea", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10116731, "likes": {"liked": "— No kids - all inclusive - beautiful scenery - EVERYTHING!", "disliked": "— We had two straight days of"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Welcome to the Sandals St. Lucian Grande Resort!!!", "title": "Amazing Honeymoon - Worth Every Penny!", "helpfulness": 20, "user": "nreblin", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10044011, "likes": {"liked": "— Almost Everything!", "disliked": "— No In-Room Internet Access"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I had been to the Sandals Negril once, and really enjoyed myself, so Sandals was the way to go for us.", "title": "Loved Sandals Grande", "helpfulness": 7, "user": "DM1980", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10034628, "likes": {"liked": "— couples only"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After reading some of the negative reviews, I was a bit scared! But then I realized after coming back that there are just some people with such high expectations, that they can never be satisfied.", "title": "A Romantic Getaway at the Grande", "helpfulness": 6, "user": "shtrep1", "date": "October 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10032933, "likes": {"liked": "— the food was great", "disliked": "— only able to eat at certain times"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were blown away by EVERYTHING. The food, the drinks, the resort itself, our wedding...everything was Perfect.", "title": "I know where Heaven is!!!", "helpfulness": 8, "user": "bebepickle", "date": "September 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10020941, "likes": {"liked": "— hoe they brought the outside in", "disliked": "— bats flew around"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Beautiful resort & grounds. Excellent service. Fun atmosphere.", "title": "Happy Honeymoon", "helpfulness": 14, "user": "kimberlyweiser", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10004730, "likes": {"liked": "— The fact that it really was", "disliked": "— Small Bathtub"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The staff (from maids to our concierge) was all very nice and willing to quickly** take care of our wants and needs. The resort and grounds were immaculate. We are early risers and every morning when we went to breakfast (around 7 am) the grounds were flooded with people pruning bushes and polishing mirrors.", "title": "Incredible Honeymoon", "helpfulness": 13, "user": "RTB76", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10001903, "likes": {"liked": "— Everything was so great it's hard to choose just one thing!", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Out of the eateries on the resort, Barefoot on the Beach was hands down the best. We tried all the restaurants at the resort, as well as one at another resort, but ate most of our meals there.", "title": "Best Honeymoon Spot", "helpfulness": 3, "user": "KAS1977", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8823089, "likes": {"liked": "— Friendly staff", "disliked": "— need more towels for the pool areas"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The live music on the patio every night was amazing. It was so nice taking walks on the beach, under the stars, with live steel drum music floating on the air. A perfect honeymoon setting.", "title": "Wow, Wow and Wow...Can't wait to return!!", "helpfulness": 7, "user": "Fra5e", "date": "September 19, 2007", "detail_rating": {"business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8755564, "likes": {"liked": "— The friendly smiley 'No Problem' Staff", "disliked": "— That we had to leave and come home."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We loved all the included activities, from snorkeling to boat rental. If you take a tour while you are there, take the Soufriere day cruise. It is a blast and well worth the money.", "title": "Wonderful Trip To Sandal's Grande", "helpfulness": 5, "user": "Packfanme1", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8753023, "likes": {"liked": "— Great rooms, beautiful view"}}], "location": {}, "stars": 5, "variance": {"poor": 162, "average": 298, "very good": 898, "terrible": 122, "excellent": 1985}, "aka": "Sandals Grande St. Lucian Spa And Beach Resort", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "•301 room, 17 acre resort combines historic British & French flavor•Pigeon Island, home to our annual St. Lucia Jazz Festival, combines historic British & French flavor that unfolds at Sandals•Offers exotic island & international culinary temptations at seven dining options •Ocean & beach view accommodations •Caribbean Sea•A lagoon swim-up pool where guests can swim right up to their patio"}