{"user_rating": 4.0, "review_count": 96, "name": "Sani Tourist House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "would go back in a heartbeat, very easy to find. go down the side of lush, its the little square on the left, easy, we went strait to it no problem. our romm was lovley with nice comfy beds. mr sani couldnt do enough for us, he is a gentelman. the breakfast was served just down the road, and was lovley. we will be going back to florence in october and will stay here again.", "title": "loved every thing about the sani", "user": "evalinka", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 110832130}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Can't understand negative reviews. We stayed one night (2 couples) May 2 and although had a hard time finding the place the owner was very helpful when we called him. Unit located right above Dante's residence square and we could look out of window as walking tours passed the site. Beautiful giant private door to historical building and both our units were very clean and well cared for, with amazing views. Voucher provided for an amazing breakfast. If you want to be right in the middle of Florence, close to Piazza della Repubblica, this is the place. Wished we could have stayed longer.", "title": "The best location and value in Florence", "helpfulness": 2, "user": "LizWaterloo", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108450946}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "I stayed at Sani Tourist House out of season, and managed to get an incredibly competitive rate. My room was characterful and attractive; the owner was helpful and welcoming, and the location was excellent, right in the middle of this compact city. Walking times: main station 20 minutes, Duomo 5 minutes, Palazzo Vecchio & Bargello just around the corner.", "title": "Bit quirky, fantastic value", "helpfulness": 5, "user": "romance_for_one", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 108450706}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The area is quiet and car-free. As the rooms lack air conditioning you will probably sleep with an open window, so it's possible you might hear street noise. Some rooms have a bathroom in the corridor rather than being fully ensuite, but this is clearly advertised. The other minor drawback is that the lift up to the property is tiny and it's on the third floor.", "title": "Fantastic, Friendly and great value", "helpfulness": 4, "user": "terentious", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104442209}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Three tips:", "title": "Very good for the price", "user": "anu_p5", "date": "February 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95899712}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "Wonderful small B and B centrally located near major sites in Florence. Stayed in a single private with shower. The owner Mr. Sani was polite, accommodating and very detailed in running his establishment. The rooms were nicely decorated and the attention to cleanliness was superb. The B and B is located in an ideal location to see the sights in Florence. The only con was a bit of street noise - but it was not a big distraction and in a weird way, added to the novelty of the experience. The included breakfast was off-site at a small restaurant and was not more than a roll, butter, jam and a cappuccino. Be aware that the street location is NOT listed on official tourist maps. Be sure to print out exact directions from the website.", "title": "Great B and B Centrally Located Near Duomo", "helpfulness": 2, "user": "santarosapaul", "date": "January 24, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23866347}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "My husband and I and our 16 year old daughter stayed in this B&B for two nights in March 07 and I would definitely stay there again and recommend it to others. The B&B consists of a single floor in a multi-floor building which you access by taking the very small elevator (room for two or only one with luggage) or the very wide staircase. I used the staircase as much or more than the elevator. It is tucked away in a side area only a half block from a major shopping street so it was quiet but very convenient. The building was part of an old - I can't think of the word- an old important family residence. A palace sort of place. Built in the 1400's. The front door when you enter the building has some of the old hardward on it, with heavy metal cross bar to latch it, etc. The window in our room had wooden shutters rather than curtains and overlooked a narrow alley (no cars, only pedestrians) and also provided a nice view of the old church's bell tower on the other side of this alley. It rang its bells in the morning. You can certainly see the history in the building, and I mean", "title": "Excellent Choice. Convenient, Clean, Historic, and Affordable", "helpfulness": 1, "user": "JodiBlonde", "date": "January 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12574607, "likes": {"liked": "— location, historical feel, price", "disliked": "— no internet available"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "that in a good way. Dante's house was right in this same little area within 50 feet or so. The owner had pushed aside a large wardrobe to fit my daughter's twin bed into the room and we still had room to move", "title": "Fantastic Location!", "helpfulness": 1, "user": "VanBC07", "date": "November 26, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 11078288}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "around. For breakfast we were given vouchers to take to a little coffee shop close by. The coffee shop treated us like royalty. One thing that you do need to know is that the owner, Remo, wants to be paid in cash but you don't have to pay until the night before you leave. I get the feeling he doesn't stay at the B&B all day but comes back for the evening. You will make arrangements with him to meet on the night before you leave so that you can pay him. He was a nice guy and told us a bit of the history of Florence. Not pushy, but answered all our questions very fully. Oh, another thing you need to know. We had a hard time finding the B&B because I expected there to be a sign out front. There is no sign. Go to the area where you expect", "title": "breath-taking view!! nice tiles!! nice windows!!", "user": "summertime42", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8605538, "likes": {"liked": "— We loved the view over the old monuments and the 'romantic' furnishing", "disliked": "— The place is a bit noisy on week ends"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "it to be and then look at the name plate beside the door. It lists all", "title": "beautiful place, shame about the owner", "helpfulness": 4, "user": "purpledaze2", "date": "July 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8103357, "likes": {"liked": "— Location, cleanliness,", "disliked": "— Owner"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "You will be hard pressed to find a better location in Florence. The hotel is quaint, clean, and right near all the action and sights. VERY comfortable beds and bedding. The owner is helpful with anything you might need while in Florence. You will find a simple room with all you need for a nice stay.", "title": "Great Location", "helpfulness": 1, "user": "nerudova", "date": "January 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 94767879}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great value for money.", "title": "Loved this hotel!", "user": "HazyD", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79056130}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I loved this quirky little hotel right smack in the middle of happenin' Florence. It's a budget place -- don't go if you need a modern (or spacious) elevator or, you know, chocolates on your pillow -- but also an outstanding value. The owner was so nice and helpful -- he gives you a little tour and rundown of the facilities and then you're basically on your own, which we liked. There was a fridge and a safe and a comfy bed, and everything was quite clean. And best of all, the windows opened out onto a view of the oldest building in Florence! It's walking distance to pretty much everything. You get breakfast vouchers for a great place around the corner -- pastries and coffee (great cappucino!). We went every night to have an aperitivo at Caffe Mingo around the corner, and made friends (say hi to Don Pietro!) Only downside is that we had to leave.", "title": "VERY CLEAN VERY CONFORTABLE WELL EQUIPPED!!!", "user": "sharden2009", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74313348}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We find it a bit hard to share some negative opinions expressed on this forum; We have noticed how kind Remo is and how thorough. Everything has been very confortable and well equipped: fridge, electronic safety box, tv, hair dryer, free wi fi connection, excellent for the cost! Very good quality. Being central it can be noisy with late tourists but one pair ear-plugs...and problem vanquished! We loved the ambient in general and our room was perfect, very sunnied, with two panoramic windows and nice florentine floor tiles!", "title": "Great location but Sani-ty checked out a long time ago!", "helpfulness": 1, "user": "WeeScotChez", "date": "May 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 65156864}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "We would definetly recommend STH to friends and will come again. Thank you very much.", "title": "Each B&B with its own idiosyncracies", "helpfulness": 2, "user": "MissDurian", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29123371}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "This is one of the best place I've ever stayed at.", "title": "great place to stay", "user": "charlotteFrance", "date": "July 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8055210}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The location is just perfect, the room I was given was quiet, large, with fridge, tea and coffee facilities, nice bathroom. I liked the breakfast at the nearby pasticceria every morning, where they have wonderful focaccie and bread.", "title": "Great place to stay in Firenzi", "user": "SheilaBGoode", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7808192, "likes": {"liked": "— Location and graciousness of host.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I'll go again asap.", "title": "very clean!! very central!! very good value for money!!", "user": "melilondon", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6020240, "likes": {"liked": "— the room had a view over the old munuments; the tiles in the bathroom are so pretty!", "disliked": "— on week ends a bit of noise come up from the medieval street..."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "We spent a great week at the Sani Tourist House. The location was perfect for all the museums and churches as well as great restaurants and gelati.", "title": "Hot weather mood?", "helpfulness": 1, "user": "Bitercat", "date": "July 23, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5499856, "likes": {"liked": "— central location", "disliked": "— bathroom (toilet) across the hall, even though it was ony used by me."}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 6, "average": 13, "very good": 32, "terrible": 5, "excellent": 40}, "slim_ranking": 0.582120582121}