{"user_rating": 4.5, "review_count": 57, "name": "Santafe Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Stayed here for one night while transiting through Bogota. As I was arriving somewhat late, I called to reserve car pick up at the airport and to find out if room service was available 24 hours. I was advised that it was not, but that the hotel would make arrangements for me. I hesitated a little, but left it at that as if worse came to worse, I could jump in a cab and get some food.", "title": "Great little gem", "helpfulness": 1, "user": "islington3164", "date": "August 24, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 8500064, "likes": {"liked": "— Impeccable service", "disliked": "— No a/c but really not an issue in Bogota"}}, {"rating": 5.0, "title": "Great hotel, friendly staff, Loved it!", "text": "When I arrived in Bogota at 10 p.m. and got into the hotel car, the driver pulled out the room service menu and took my order while driving to the hotel. After a quick check-in, I found my food ready for me in the room. What a great, great surprise and truly great service!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 29, 2005", "id": 3813591}, {"rating": 5.0, "title": "Excellent stay", "text": "The hotel is very small, 30+ rooms, and as I arrived late and left early, I really couldn't get a good appreciation of the neighborhood although it appeared to be in a nice, residential area. While the hotel is on a main street, it wasn't too nightlife-oriented, just a few people that appeared to be out for a stroll. I had reserved a deluxe room which consisted of a small living room with a fully-stocked mini-bar and a small regular bar with several full liquor bottles under lock and key. Both the bedroom and bathroom were ample and the bed extremely comfortable. The room was spotless, as in all Melias, and the service, as mentioned before, impeccable.", "helpfulness": 2, "user": "FerBarcelona", "date": "December 14, 2004", "id": 2882353}], "location": {"country": "Colombia", "continent": "South America"}, "stars": 3.5, "variance": {"poor": 1, "average": 7, "very good": 15, "terrible": 2, "excellent": 32}, "aka": "Melia Santafe Hotel", "slim_ranking": 0.30243902439, "description": "Spacious suites. Privileged 360-degrree views, and subtle Spanish flair are the trademarks of this hilltop hotel that recently underwent top-to-bottom renovation. Ideally suited for business travelers with Wi-Fi and concierge service, Santafe`s 53 guestrooms are also stylish, warm and luxurious enough , to enchant guest. Don’t miss the delicious paella at La Alcazaba Restaurant."}