{"user_rating": 4.5, "review_count": 946, "name": "Santa Maria Novella Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hotel Santa Maria Novella is right in the Santa Maria Novella Square (we were upgraded to a room with a view so we could see the church). For those who know Florence you know what it means in terms of location: ten minutes from everything but without being in the middle of it (that in Florence can be a bit too much). The square congregates some musicians at night, but the windows are well isolated.", "title": "A perfect mix of location, tradition and comfort", "user": "ARUANO", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80046839}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The hotel was completely renovated recently but keeping the old fashion looks you can see in the hotel photos (believe them). The bathroom, in white marble, is stocked with Antica Farmacia Santa Maria Novella toiletries (nothing to add for those of you who know this brand, for those who not, wait to smell and love them).", "title": "Charming, Comfortable and Convenient.", "user": "jtmidge", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 79563893}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The bed was very comfortable. If your schedule was not the same of your neighbours, you can listen to them using the shower, but no noise apart from that.", "title": "Lovely Boutique Hotel! We give it 5 stars!", "user": "lledbetter", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79432606}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The breakfast room was very nice, and so was the breakfast itself.", "title": "believe in the beauty of Florence", "user": "QueenLadybugs", "date": "September 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 78253568}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "You don´t expend a lot of time in the hotel while in Florence, but they have a very British lecture room, a small gym and a PC with free internet connection (wi-fi is not free in the rooms)", "title": "Very Good choice, recommended", "user": "SCAN60", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77761291}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Nice hotel near the train station and easy access to all the tourist sights. Best breakfast in Italy. Agreed with other reviews about the front desk staff. Room was small but adequate. Wish I knew about the roof top terrace but was never told by staff. Would stay again.", "title": "great location, easy access from train station", "user": "plasins", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77418281}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We have just stayed for 4 days at the hotel and can confirm that i agree with other reviews on this hotel ie The location is great being close to all interested sites and railway station", "title": "great hotel", "user": "CheshireHolidaymaker", "date": "August 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77241147}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "All staff at hotel are user friendly,cheeful and professional,the hotel is spotless,breakfast is awesome and they go out of there way to ensure you have a great holiday.The Gym and IT facilities are first class and the roof terrace is a bonus which all should use the views are amazing,we certainly recommend this hotel,we will be back", "title": "Disappointing hotel", "helpfulness": 1, "user": "cityorcountry", "date": "August 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76732488}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We just returned from four nights at this hotel and we found it to be a bit of a disappointment. We had a superior room with a view of the Piazza Santa Maria Novella. The room and the view were lovely. However, our key card did not work in the light switch (room 305). We had to keep asking the front desk to activate our lights from their main computer. We even had a worker come to the room to try to repair it, but we were told \"its broken and we can't move you\". These people must not talk to one another because every time we had to call the front desk (inexplicably the lights would go out at least once daily) we had to argue our case. They kept telling us to put the key in the electricity slot as if we were the problem. Also, outside the room there is an indicator light that tells them whether or not the room is occupied. Well, of course our indicator light was never on and on the first day a worker walked right in the room while we were dressing to go out for the evening. He apologized profusely but we were not pleased. Also, the front of the hotel was undergoing major construction. The main entrance was not accessible and the side entrance was a bit difficult to find as they did not have it clearly marked. I noticed they did put out larger signs after we checked in. The hotel itself is quite beautiful and the breakfast was great. But we expected better from a property listed as one of the best in Florence. It isn't the worse hotel I've ever stayed in but how many times do you get to go to Florence? You can do better.", "title": "Excellent Hotel, Highly Recommend", "user": "TexasTrav30", "date": "August 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75776865}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "We stayed at the SMN for four nights in August. First things first, good air conditioning and great bathroom. The rooms are fairly large by American standards and are well equipped. We had a shower-only room with no view, but we didn't spend any time in the hotel. I think, however, the next time we go, we will get one with a view of the square. The proximity to the train station can be disconcerting, but the square doesn't get a lot of the station traffic funneled through it so it's actually very quiet. It was one of our favorite squares in Florence because it was not so crowded even at night.", "title": "A hidden gem", "user": "soccerrlz", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75366186}, {"rating": 5.0, "title": "Fabulous Location, Breakfast, and Staff!", "text": "We truly enjoyed our time staying here! It is very close to the train, which is convenient, as well as close to all the big sights you want to see while in Florence! The staff was very friendly and welcoming. Breakfast was delicious, the best we had in all of our Italian hotels. Actually had eggs which was a nice change from 10 days of cold continental breakfasts! The rooms were unique and cozy, with a decent-sized marble bathroom, as well as nice bath products. A little rooftop with tables is available, but it was so hot while we were there we ended up never taking advantage of it. Within walking distance of great restaurants, such as Il Latini, and some of the best gelato in Italy!", "helpfulness": 1, "user": "psulovers", "date": "July 28, 2011", "id": 115938079}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We stayed at this hotel when we were in Florence for a conference. It was a great hotel with very professional staff. The breakfast included fresh fruit, meat, cheese, croissants and other sweet treats, cereal as well as eggs. The choice was certainly good. On the Saturday morning we decided that we wanted to go visit a museum the next day and the staff arranged for tickets even with such a short notice. There is a gym in the basement, but unfortunately we forgot about this feature and since it isn't announced, only remember it was there on our last day. The location is great, a few minutes walk from everything including the train station.", "title": "Great hotel", "helpfulness": 1, "user": "JulieDT", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115934872}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "beautiful hotel in a great location. Would advise a room with a view of the piazza.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "Melv16", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115883488}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "great breakfast and the rooms were perfect.", "title": "Worth It!", "helpfulness": 2, "user": "SueBillB", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115867381}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Highly reccomend.", "title": "THE BEST HOTEL IN FLORENCE", "helpfulness": 1, "user": "HatTrick4", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115860165}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Very central in a quiet piazza.", "title": "Fantastic hotel, great location, great rooms, great staff", "user": "KateInverness", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47729207}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Hotel very clean, rooms excellent - is worth paying the extra for room with a view, service great, superb breakfast, what more can I say!", "title": "Location is Everything", "helpfulness": 1, "user": "daetime", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47051983}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "360 degree view from roof terrace, very central for all the sights, would go back anytime.", "title": "Very nice hotel, great location", "user": "gida1", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46786147}, {"rating": 5.0, "title": "Perfect Hotel", "text": "We selected this hotel after reading reviews on Trip Advisor. Lovely, quiet hotel in a great location, we walked everywhere, to tourist locations, restaurants, museums and the train. Our room was small but beautiful looking out on the side street. It was very clean and comfortable with a desk, mini-bar, hair dryer, and make-up mirror. So well insulated were the windows that when closed we did not hear the construction going on in the building right next door. I had read about issues with the air conditioning but when we asked for a cooler room it was adjusted immediately. Breakfast was very good and plentiful in the charming breakfast room. Friendly and professional staff throughout, front desk recommended Osteria del Porcellino restaurant, so good we went twice.", "user": "PascaleW28", "date": "October 9, 2009", "id": 46403028}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We would also recommend:", "title": "a wonderful hotel experience,personal service in a huge tourist market.", "user": "Annette9", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45520830}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Clean, well-maintained hotel with European charm. Great location near everything, but away from tourist mobs. Friendly and helpful staff. Good buffet breakfast. We stayed five nights and would gladly return.", "title": "Elegant hotel at a good price", "user": "4band1d", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45223800}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This is great hotel, ideally located on Piazza Santa Maria Novella and about 10 minutes walk from the Duomo and the other main city attractions. Staff were really friendly, hospitable and very helpful in all our requests. The room we stayed in was spacious very clean and very nicely decorated, with a view on Duomo. The price of the room was nowhere near the expensive side, baring in mind the quality of this hotel. There is really nothing that I would like to see improved. If I ever travel to Florence again, this will be the first hotel to choose!", "title": "Simply a great hotel!", "user": "Iosif-Heraklion", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39993223}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Stayed at this hotel for 2 nights as in Florence for a wedding.", "title": "Nice hotel, shame about the front desk service", "user": "xmapjoen", "date": "September 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 39988483}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "What we liked", "title": "First class room, nice location - and we even got a balcony. Result!", "user": "johnmcga", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39907813}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Good location - just off centre from all the main sights so peaceful but everything within walking distance. Train station 5 minutes away. The train to and from Pisa is best forgotten - a dirty, hot and slow train.", "title": "Excellent.. the best", "user": "DollyNyc", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38893641}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Located right on against the church of Santa Maria Novella, the 3-minute walk from the railway station, about 15-20 minutes before the Uffizi gallery and 20 minutes the Ponte Vecchio - the most popular bridge over the Arno river, all shops also within walking distance!", "title": "Very Nice Hotel with Beautiful Furniture", "user": "Irunchick", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 73404306}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "In the rooms are beautifully elegant bathroom, spacious garderob, a safe and mini-bar, when entering the room is a work area (desk with comfortable chairs) where you can work at the computer and papers (but we will not be required).", "title": "Rooms and location were great", "user": "nikkibgood", "date": "August 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73392821}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "In room 2 balconies ! One balcony with wicker furniture (table with chairs) with stunning views of the very church of Santa Maria Novella, on the other balcony you can watch Florentine roofs)", "title": "A very nice hotel", "user": "AlexanderPGreece", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73292691}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We enjoyed out stay at Santa Maria Novella Hotel! Although the final stages of construction on the piazza created some difficulties, when this is complete, access to the hotel will not present any difficulties! The rooms were spacious and clean, the bathrooms were lovely and the breakfast was nice. Great location - close walking distance to many sites and restaurants. Only downside to Florence (and most of Italy) is the number of smokers! Even in the open air trattorias you can no escape second hand smoke.", "title": "Fabulous", "user": "butterflycats", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72756829}, {"rating": 5.0, "title": "Above and Beyond", "text": "It is not cheap, but it is worth it for Florence. Not a very big room, but the location is perfect and we enjoyed our stay. Breakfast could be better also, for a hotel like this, but it was ok. Overall, I would recommend this hotel.", "user": "LoriE2", "date": "July 28, 2010", "id": 72700712}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Beautifully restored hotel with all amenities, marble bath, etc...Just look for the church when you exit the train station.. it's right behind it in the piazza... 5 minutes away... so convenient. Friendlly, helpful staff from the front desk, the porter, to the waitress who remembered to bring an extra large carafe of steamed milk in addtion to the \"American Coffee\" every morning.... delightful experience.", "title": "Wonderful experience, definitely stay here again if I return to Florence", "helpfulness": 1, "user": "skywalkerjedimaster", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74973477}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Our reservation was made on Expedia and when we arrived we were told that we were being upgraded to a superior room. beautiful with a canopy over the bed, large marble tile bathroom and deep soaking tub, windows to the piazza, church bells and sunshine in the morning, wonderful service in the breakfast area which had a very good selection of food, the desk staff was helpful and pleasant and our request made at 10:45 pm for four tickets to the Ufizzi was followed up and we had ticket reservations by 10:00 AM the following morning. WE traveled with friends who had a standard room (shower, no tub with a view of the street behind the hotel. I would book a room there again next time we travel to Florence, my favorite Italian city. The stated price for the room was 520 euros but we paid only 160 American dollars, based on the rate from Expedia. having proximity to the rail station made it easy for us to take the shuttle bus from the airport for 5 euro each, rather than a 20 euro taxi ride that our friends paid. The car rental agaency was only four blocks away which made it easy for us to pick up the car when we left Florence to drive to Siena and our destination for a family wedding at the Catello de Gargonza--which is a whole other rave. I wish I were getting married again--I'd book the Castello in a minute.", "title": "Spectacular room, view and visit", "helpfulness": 1, "user": "helensgirl", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74966891}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Booked 2 adjoining rooms as we had 2 children and 2 adults. The rooms are beautiful - classically decorated but with all the amenities you need - watch out as some only have a shower. The hotel is only 5 minutes walk from the station on a nice square. Breakfast is also pretty good. The only criticism of the hotel is the staff at the front desk - in 2 days we saw nobody smile and each of the requests (very simple requests e.g. breaking a 50) we made was met with a scowl or a \"we cannot do it\". This is a shame considering the hotel has so many things going for it and that generally people in Tuscany are very warm.", "title": "Beautiful rooms, good location, shame about the service", "helpfulness": 1, "user": "PeterNandFamily", "date": "August 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74265227}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We spent two nights here while in Florence. It was a great hotel. Very nice room, excellent bed and pillows. The breakfast was fantastic - lots of variety and everything was tasty.", "title": "Very nice", "helpfulness": 1, "user": "BR63", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73936151}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Wonderful location, spotlessly clean, very helpful staff. Our room #532 looked out on the piazza. It had a small sitting area and bathroom and upstairs was a spacious bedroom. This room was an incredible bargain that included a great breakfast. It's 5 minutes to the train station and 10 minutes to the Duomo. What a great place!", "title": "Wonderful hotel", "user": "blud", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73781286}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Room was spacious with windows that opened to a great view of the square outside. The included breakfast was also very good. Good location for sightseeing, restaurants and an easy walk to the train station.", "title": "Great hotel, central location, good value", "user": "GAK06", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49643525}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Don't look any further for a hotel in Florence. This one is absolutely gorgeous. Staff is fantastic and the accomodations are stellar. Nothing we didn't love about it.", "title": "Awesome", "user": "ChicagoContessa", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48563432}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Absolutely loved this gem of a hotel right on the Piazza Santa Maria Novella. It's an easy walk from the train station, as we zipped right up from Rome on the Eurostar. A discreet brass plaque marks the hotel, with its elegant lobby and sitting rooms, wonderful staff and beautifully decorated rooms (spacious bathrooms, too). There is no doorman, but a bellman brought our bags up to the room and could not have been more helpful. The hotel is a conglomeration of a couple of buildings so some of the hallways are long, with short steps to different levels but that added to the charm. There is a computer on the lower level in a sort of grotto for guest email checking. The breakfast room is beautiful and the buffet is lovely. It is an expanded continental-type breakfast and the other guests were multi-national, which made it fun. Our room was lovely, with red and white toile decor, cararra marble bath which was large by Italian standards. We walked absolutely everywhere and can't wait to return to Florence. The hotel is not inexpensive (nothing is with the current Euro value) but I would definitely stay here again.", "title": "What a gem!", "user": "writegirl18", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48007432}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I booked this hotel based on TripAdvisor reviews and it was everything as promised...The location is great if you arrive/leave via train, as the station is only a short walk from the hotel...Room 323 was huge, elevated bedroom (double bed) with a private balcony, which dropped down to a foyer/double closet area and large bathroom...Staff was very courteous and accommodating...Bus stop is just across the street from the plaza, but if you walk everywhere as we did, its easy to get to all the sights of Florence...Also, many of the tour buses depart from the train station, so you can have breakfast at the hotel in the morning and still be on time for the tour bus because it is so close...The breakfast was great, coffee, tea, juices...scrambled eggs, bacon, cereals, fresh fruit, pastries and assortment of breads...Great place to stay!", "title": "Great Location, Staff & Room!", "helpfulness": 1, "user": "dupk333", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47897030}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We stayed at the hotel for four nights (17-21 Oct 09) and we had an almost excellent experience. The room was large and greatly decorated, everything looked and felt of high quality and the staff were very helpful and tried to accommodate every request. The hotel's location is excellent, especially if you come to Florence by train or coach as it is less than 10' walk from the station. You can literally walk all over Florence and see the main sights on foot.", "title": "A great hotel with an excellent location to explore Florence from!", "user": "Plmrs", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47761369}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We very recently returned from a 10 day visit to Tuscany and chose this hotel for our 3 nights stay in Florence. We treated ourselves to a deluxe room with view and were so glad we did. Really worth it!", "title": "Great hotel, great location!", "helpfulness": 2, "user": "lambead", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115766692}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our room was large with high ceilings and the marble bathroom was a bit of a 'wow!' - huge bath and fantastic shower as well. The view from our 4th floor room across the Piazza to the church was perfect. When we came in after the evening out, the bed had been turned down and complimentary slippers laid at each side of the bed along with a linen cloth/mat, although the floors were clean enough that you didn't need it!", "title": "Awesome hotel and even better staff", "helpfulness": 1, "user": "dillonh", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115702456}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "A very good hotel. Quite large, but always quiet, with quaint 'trail' to the room, involving two lifts - presumably it has been gradually expanded into neighbouring properties at various levels. We had booked 'superior with view' but on arrival were given an upgrade to 'suite' - large bedroom and bathroom with an extra small(ish) room with desk and chair. The wet weather curtailed strolling and bar-sitting outside, so the lovely room was a haven to return to and relax (no English/American TV, thankfully.) Big, comfortable bed. In December, the room heating was a bit too high, but over three days I never worked out how to turn it down. Good view of the piazza - which is quiet and not at all like the station piazza, even though very close, and with basic amenities (shops/bars) nearby and a short walk to the Duomo (just visible from the suite's 'little' room). Good buffet breakfast (included).", "title": "All round excellent", "user": "salmoneater", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52657641}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed at the Hotel Santa Maria Novella as part of our recent honeymoon and absolutely loved it. The hotel's location is brilliant and yet the hotel is very quiet (we were a little concerned when booking this hotel as it is close to the train station which can sometimes be undesirable but found the surrounding area to be fine, and the proximity to the train station ended up being a major advantage for us). The staff were wonderful and our room was absolutely gorgeous (not to mention huge) and impeccably clean. There is nothing bad we can say about this hotel and we will definitely stay here when next in Florence.", "title": "Wonderful hotel in fantastic location", "user": "Kayt83", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50704551}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "What a memorable 44th anniversary! We were welcomed with the exuberence of old friends re-uniting by Manola when we reached the Santa Maria Hotel by a quaint ironwork elevator, The breakfast each morning was handsome and plentiful, and the men who helped Manola serve were concientious and helpful.", "title": "\"Almost Home\"", "user": "salmoneater", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50486711}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The lovely room was spacious, clean, and quiet, and the adjpoining bath with the glass shower was like an upscale hotel in Texas!", "title": "Wonderful Hotel _ The Best", "user": "luv2travel300463", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50083936}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Manola greeted us with a sincere smile each morning,helped us with our reservations to the Ufizzi, and patiently answered questions shes' probably heard too many times to count!", "title": "Definitely the best part of our trip", "user": "morsavasci", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50004767}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My family of five recently stayed at Santa Maria Novella. I would just be repeating what everyone else writes about this hotel, if I gave it rave reviews for the rooms, location and breakfast. We arrived at the Santa Maria Novella from Venice minus two lost suitcases - thank you British Airways. The staff was very helpful in helping us communicate with the Florence Airport, which was no easy task even for someone who speaks fluent Italian, but Lorenzo never gave up and never showed an ounce of irritation with us, as our frustration was high due to the luggage being missing for three days. Thank you Lorenzo for all of your help and patience. We loved the Santa Maria Novella.", "title": "Really love this hotel.", "helpfulness": 1, "user": "LASTrafzer", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115699220}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is a wonderful hotel sitting directly on the Piazza di Santa Maria Novella, a close walk to Florence's main train station, and only blocks from the Duomo, the market, and other great sites. Our group of 6 arrived in the midst of a heat wave, grumpy and worse for wear, but the front desk greeted us like we were their most important guests. Our bags were shuttled upstairs for us in record time, the rooms were lovely and air conditioned, and the staff were gracious and hospitable.", "title": "Great location, rooms, value and overall stay", "helpfulness": 1, "user": "thesaavymommy", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115587747}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Each morning a very nice breakfast was available. My husband has celiac's disease and this hotel went out of its way to help out: gluten free breakfast breads were there each morning, they recommended restaurants that had gluten free options, and when we unexpectedly stayed an extra night in Florence but had to be moved to a neighboring hotel (which the staff at Santa Maria Novella arranged beautifully, including the transfer of our luggage), the clerk in the new hotel was told there was a \"celiaco\" in our party and ordered appropriate gluten-free foods for him!", "title": "We enjoyed our stay will return again.", "helpfulness": 1, "user": "roxwash", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115377342}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We base our decisions to a large degree on reviews from Trip Advisor. Because this was a hotel in the city we had modest expectations. We were blown away by the size, views and quality of the room (601) , service, and breakfast.", "title": "Fabulous Value", "user": "AnotheeHappyTraveler", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10042980, "likes": {"liked": "— servic, room, breakfast", "disliked": "— lackluster bar"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We wouldn't consider another hotel after our experience.", "title": "Great small hotel near the station", "user": "travelersf&e", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8752913, "likes": {"liked": "— Location, service and decor", "disliked": "— View: The church on the piazza is currently under restoration"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "P.S. There's a great Rick Steve's recommended tratoria around the corner.", "title": "a tuscan jewel", "user": "senejay", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8660998, "likes": {"liked": "— cleanliness", "disliked": "— split level room."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "If you are traveling to/from the main Florence rail station this Hotel is a terrific choice. A short walk (via the station underground passage and then across Piazza SMN) no cab is necessary. The hotel is small and offers warm and helpful service. The rooms are on the small side but beautifully decorated and quiet.", "title": "Excellent Overall With Caveat", "helpfulness": 2, "user": "WorldShuffler", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8524266}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Nice buffet breakfast. All of the main sights are a short stroll away/ We would definitely stay here again!", "title": "Excente location and quality", "user": "EPellet", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8489296}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel is very well located, right in the square with the same name. Our room was very nicely decorated and very confortable. We were lucky enough to get one of the few rooms with a balcony facing the square and the church (plus with a bathtub). That made an enormous difference at the end of the day because we could seat outside, drinking a glass of wine before going to sleep. The terrace is another nicety; there is no bar or service there but one can take a bottle of wine up there and enjoy the view under the shadow or under the sun. The breakfast is good enough for the price but it does not change, so one can become tired of eating the same cake every morning. That being said, there are enough things on the table to allow some variations during a week or so.", "title": "Very confortable at an excellent location", "helpfulness": 2, "user": "LuizTrip", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116900214}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The only caveats we saw:", "title": "A room with a view", "user": "Marcusvb", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 116808501}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "- One of the employees was not really nice with us. He was not welcoming when we arrived and was completely unhelpful when we complained about the Internet access. The girls were really helpful though...", "title": "Delightful well situated hotel", "helpfulness": 1, "user": "broomsmelbourne", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116636456}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "- The Wi-Fi was not working when we arrived. We had to complain a couple of times before they could fix it. Once it was fixed, it worked very slowly but enough to let us check some restaurants out and do our check-in for the flight back home", "title": "Comfortable hotel in a great location", "user": "SouthJerseyTravelbug", "date": "August 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 116343449}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "- The room service is very limited, which is not really a problem unless you are so completely exhausted that you cannot move out of your bed. There are plenty of restaurants nearby though.", "title": "Most helpful for honeymoon", "helpfulness": 2, "user": "mizzelle", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 116255898}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Florence was our first stop and having stayed at other 5 and 4 star hotels in Venice and Rome, this hotel was the best of the lot. Great location to train station - although there was a fair bit of construction work in the square so the hotel exterior surrounding is not great - but once you step inside, it's wonderful. Also the construction noise stop about 5pm. VERY spacious bed/ bath rooms. Has", "title": "The best 4-star hotel!!", "helpfulness": 1, "user": "Singapore100", "date": "August 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8425054, "likes": {"liked": "— Very spacious rooms; good location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "tea/coffee making facilities. Good buffet breakfast selections. Will definitely stay here again.", "title": "Incredible", "helpfulness": 3, "user": "Ponman", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8244069, "likes": {"liked": "— The ambiance", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Great Find", "text": "Arrived in Florence on June 12, 2007 and stayed til June 15, 2007. Geat place to stay in Florence. Very centrally located, rooms had great ambiance, and the staff couldn't have been any nicer. The breakfast was superb and all of the facilities in the hotel were first class. My family and I are already planning on staying at the Santa Maria Novella Hotel upon our return to Florence. Incredible experience.", "helpfulness": 4, "user": "rosefam", "date": "July 22, 2007", "id": 8214955}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I just spent seven days in Florence staying at the SMN Hotel. We really enjoyed the central location and short walk to the train station. The hotel itself was wonderful with good size rooms and friendly staff. Breakfast was quite nice, served in beautifully decorated dining rooms. Unfortunately, the building beside the hotel and the plaza across the street were under construction so the view wasn't much to see. The rooms were quiet in spite of the noise from the all the constructionhowever. We would definitely recommend this hotel to anyone visting Florence.", "title": "Great little hotel - super location", "helpfulness": 4, "user": "asucker", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8204710}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "A really nice little hotel.", "title": "Great Value and Location", "helpfulness": 1, "user": "quatl002", "date": "July 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8121178, "likes": {"liked": "— Location", "disliked": "— Nearby renovation of piazza"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at the HSMN for 7 nights in the middle of our two-week Italian honeymoon and it was truly lovely. They upgraded us to the honeymoon suite which has a private terrace overlooking the piazza and is bigger than apartments I've lived in. The staff was helpful for getting reservations and printing out our online tickets. The breakfast is really good and their staff is very attentive. They are in a great location from the train station and you will soon learn that nothing is far in Florence, but it is close to some of the main attractions. If you can get over the fact that it is a little like a Harry Potter scene trying to find your room then you will enjoy your stay. There is free wi-fi that worked fairly well. Highly recommended. Best place we stayed in Italy.", "title": "Perfect place for a honeymoon", "user": "dr_perk", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116170307}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is surprisingly close to the train station. Do not be fooled like we were into taking a taxi.", "title": "Very nice hotel", "user": "knvna", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116133707}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This was our favorite hotel on our 3 city trip to Italy.", "title": "Location 10, decor 10, service 5.", "helpfulness": 1, "user": "JulieMSurrey", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 116020350}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is only a 5 minute walk from the main train terminal in Florence. It is centrally located within a 10 minute walking distance to most of the main tourist attractions in Florence. The rooms were surprisingly large, well appointed with great, larger bathrooms(by European standards). The hotel receptionists/concierge was very helpful and friendly. Spoke English very well.", "title": "Very nice hotel, but...", "helpfulness": 1, "user": "packlightwearblack", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115282293}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had two adjoining rooms without connecting door. See attached pictures for room views. Triple room was large with great view overlooking S. Maria Novella. Double room was smaller and had no real view facing brick wall of adjoining building. The rooms were quiet and well serviced. Free and high speed wireless internet. Overall, had a great stay here and would definitely stay again.", "title": "Perfect Hotel", "user": "Katmandu21", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115260319}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Wow! That was our reaction when we checked in. We think our travel agent must have negotiated an upgrade due to our celebrating our 20th anniversary. We were escorted to a beautiful room directly above the hotel lobby, with two windows overlooking Piazza Santa Maria Novella, and a very spacious marble bathroom with bathtub. And within minutes of arriving we were presented with a complimentary bottle of Italian sparkling wine. Now thats the way to arrive in Florence!!", "title": "Luxury in a Perfect Location!", "helpfulness": 9, "user": "JonNat", "date": "June 17, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 7866897, "likes": {"liked": "— Elegant room and great breakfast in perfect location", "disliked": "— Having to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "We just can't say enough good things about this hotel. The staff were very professional and friendly, the location very central, the breakfast room elegant, and the breakfast just amazing by Italian standards. Every morning we sat at a different table with white linens and nice silverware. A very polite server immediately took our espresso order, then we sampled the extensive array of eggs, bacon (pancetta?), delicious pastries, fresh fruits, prosciutto, ham, brie, sparkling water, juices, etc. Since the restaurants in Florence are not inexpensive, this is great and cost-effective way to start your day.", "title": "Really enjoyable", "helpfulness": 3, "user": "GlobeTrotter35", "date": "June 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7831266}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "A few negatives, none of which are the fault of the hotel, involve construction or renovation projects nearby. The facade of the Santa Maria Novella Church was still covered with scaffolding due to renovations, the building next door was under construction, and the adjacent building that houses the Fiddler's Elbow was involved in some construction. Nevertheless, we were never disturbed by noise from any of this. Granted, the view of the church was not so great, but hey...at least we had a view!", "title": "Highly recommended", "helpfulness": 2, "user": "RestlessinIndy", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7830428}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "If you arrive by train you don't even need a taxi - it's just a two block walk. And it's literally a five minute walk to the Mercato Centrale, with lot's of street vendors sellings silk ties, leather goods, etc. Five minutes will also get you to the Duomo.", "title": "Fabulous Florence Stopover", "helpfulness": 2, "user": "basyu2", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7705536, "likes": {"liked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We've read negative comments from some travelers, but frankly cannot agree with any. We had a great stay and would look forward to staying here again on another trip.", "title": "Absolutely Beautiful", "helpfulness": 1, "user": "Freeway12", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7696172, "likes": {"liked": "— Cleanliness of room, huge bathroom, friendly staff", "disliked": "— Construction going on however it didn't bother us. It will be perfect when complete"}}, {"rating": 3.0, "title": "Not impressed", "text": "I visited Santa Maria Novella Hotel with my husband last week (May 2007) for 6 nights. We have travelled around the world and stayed in a lot of 4 and 5 star hotels. With this one we were not impressed. The whole hotel must have been recently renovated. The interior decoration was ok. There was a construction site just next to the hotel and throughout the day the noise was terrible!!!! We woke up early in the morning just from the noise!!! Also, the windows of our room looked right at the construction building so we couldn't open them because of the noise and dust... We believe, that they should not charge the same price as usual their rooms as long as the construction is on, because it is very annoying.... The breakfast was not anything special neither. Nevertheless, there were nice things about this hotel as well. First of all, the hotel staff was very nice, and very helpful. Our room was cleance 2 times a day, which is not used in all expensive hotels. The hotel is situated in a very strategic point in Santa Maria Novella piazza, very close to the central train station, all public transport and the whole historic centre of the town.", "helpfulness": 3, "user": "VickyGreece", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7670511, "likes": {"liked": "— strategic place in the centre", "disliked": "— the noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Upon arrival I wasn't sure what to expect from the Santa Maria Novella Hotel, but I left an enthusiastic fan. It's in a great location for taking day train trips from Florence's train station just down a long block. It's also a short walk into the heart of town and the Duomo.", "title": "Very Happy", "helpfulness": 4, "user": "particleboardpigeon", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7567201, "likes": {"liked": "— Nicely furnished and clean room, great location.", "disliked": "— Um...no complimentary champagne when we walked in the door. Nothing really."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The staff was friendly, very helpful, and spoke good English. The room was beautiful and had a great view of the Santa Maria church (if only it weren't partially covered for renovations). The bed was quite comfortable even though it was actually two tight fitting mattresses (quite common in Italy). The room and bathroom were immaculate. A nice breakfast is provided which includes a good selection of fruits, pastries, cereals, yogurt and juices. Their eggs and bacon are ugly but quite delicious.", "title": "Incredibly Lovely Hotel", "helpfulness": 2, "user": "ACKSeahorse", "date": "May 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7550919, "likes": {"liked": "— The decor", "disliked": "— Walking up two flights of stairs"}}, {"rating": 3.0, "title": "Spoilt by renovations", "text": "Earlier, I stayed at a much pricier hotel in Florence and wish I had booked here instead. It's also right around the corner from a few of our favorite restaurants: Garga and Buca Lappi. Some reviews discussed the construction next door. We stayed on a weekend so we did not experience any of that. We will gladly return.", "helpfulness": 1, "user": "ray57", "date": "April 21, 2007", "id": 7405917}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Just recently returned after staying here five nights. What a great hotel with a great location. The rooms were large and very tastefully decorated. We had a junior suite on the top floor in the newer part of the hotel facing the Piazza. The only drawback was the elevator did not go to the sixth floor and we had to walk two flights to get to our room. If you have trouble walking do not stay on this floor until the elevator installation is complete. I did not mind the walk. The hotel itself is absolutely gorgeous. There is a small bar where we enjoyed drinks each evening. A special thanks to Monika who made our stay even more pleasant. The staff at the front desk were all great and very helpful. The hotel is close to the train station and near where all the tours leave from. This made it very convenient for us and the tours we signed up for to Siena and wine country. It would have been nice if the facade of Santa Maria Novella was visible. It was covered in scaffolding. The Piazza was a great place to people watch from our windows. The construction noise was not an issue when our windows were closed - they appeared to be pretty soundproof. The hotel provides a great breakfast with many choices so we hardly ever had to buy lunch. I would have a gelato in lieu of lunch. If we return to Florence I would definitely stay here again.", "title": "Awesome - Amazing...", "helpfulness": 2, "user": "MMOuellette", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7332666, "likes": {"liked": "— Location... great hotel ..great breakfast.."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed in the honeymoon suite (room 621) for a few nights at the end of July 2011. Everything about the Santa Maria Novella was perfect - the helpful staff, the beautifully decorated rooms and hallways, the great location and our fantastic balcony overlooking the square and the Santa Maria Novella itself.", "title": "Beautiful hotel", "helpfulness": 1, "user": "Tarff", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116933517}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The suite was large, with a seperate bedroom and lounge, as well as a beautiful marble bathroom with rainfall shower, and a walk in closet with minibar and safe. The balcony was directly above 2 pubs/restaurants but, being 6 floors up, we werent bothered by any noise at night.", "title": "Good", "user": "AlexanderRu", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 116903422}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 34, "very good": 238, "terrible": 12, "excellent": 655}, "aka": "Santa Maria Novella Florence", "slim_ranking": 0.05, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "All the rooms are furnished with air conditioning/heating, direct dial telephone, free Wi-Fi internet connection or lan cable connection, hair-dryer, minibar, bath or shower, electric safe, flat screen tv, courtesy set of \"Officina Santa Maria Novella,\" vanity mirror, sleepers, tea pot with herb tea. Superior room with view has a splendid view over the Basilica of Santa Maria Novella, flat screen TV, mini-bar and a splendid marble bathroom"}