{"user_rating": 4.5, "review_count": 68, "name": "Sarum Heights", "reviews": [{"rating": 5.0, "title": "Great B&B", "text": "I stayed here for three nights as a short break at the end of a business trip. I had a lovely time here, the house has a lovely warm family atmosphere which was a welcome change after a business hotel in Brussels.", "user": "JaneH1", "date": "November 8, 2008", "id": 21641097}, {"rating": 4.0, "title": "A good place to stay", "text": "The house itself is well located and spotless, its well serviced by buses, not far from the rail and there is plenty to do and see in the area. Old Sarum just across the road is not to be missed. The breakfast is great too!", "user": "elmcityjohn", "date": "October 27, 2007", "id": 10371194}, {"rating": 5.0, "title": "Underrated Gem", "text": "I'm based in NZ but were I ever back in the Salisbury area I would definitely stay here again.", "user": "muz58", "date": "October 21, 2007", "id": 10204221}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "A friendly welcome set things up nicely for an excellent stay. The room (avon room) was lovely and the shower was the best shower ever - thermostat to stop the whole too hot too cold knob turning trials and very powerful. Breakfast was very good - cereal, toast, and full English with eggs freshly laid by the owners' hens. If I was pushed to find a fault I'd struggle and the only thing I could possibly think of would be fluffier towels - that's how hard I have to try to find fault. Located just outside Salisbury centre it was just what we wanted.", "title": "A+ almost faultless", "user": "millso42", "date": "March 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57471725}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed here for 1 night on our way from Stratford to Salisbury. The rooms were really clean and comfortable. The breakfast was great but our chat with Sue over the course of it was even better. From the moment we arrived she and her husband made us feel welcome and at ease - we would recommend Sarum Heights to anybody without hesitation.", "title": "Great B&B - Even better owners", "user": "JGVan", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46972525}, {"rating": 5.0, "title": "Fabulous, friendly &", "text": "A warm welcome at the door, a hearty breakfast & a great chat with Sue. A very comfortable bed in a cosy room that is so not a boring hotel! Wonderful! I'll stay again when I'm in Salisbury.", "user": "jeniwren11", "date": "October 4, 2009", "id": 45845441}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We spotted Sarum Heights as we drove into Salisbury after visiting Stonehenge. It was a great find. Parking was easy, although there were a few steps up to the front door. We were soon settled in a really well decorated double room which had splendid views of Old Sarum castle and the Avon Valley. After a busy afternoon exploring the medieval city it was great to come back and relax with a cup of tea and take in the view. On Sue’s recommendation we walked by the river back into the city for our evening meal and easily picked up a taxi back afterwards. So we both managed to enjoy a couple of glasses of wine. If you want something closer there is a harvester pub just up the road.", "title": "Wonderful views and great room", "user": "Lyninsurrey", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 43700002}, {"rating": 5.0, "title": "Salisbury area and B & B", "text": "The bed was so comfortable it was a struggle getting up in the morning. In the smart en suite there was a quality shower and face cloths, shampoo & shower gel were provided. In the big family kitchen Sue had prepared a fantastic breakfast of freshly baked bread, percolated coffee, homemade preserves and chatted to us as she cooked our breakfast. We also had the most delicious raspberries straight from the garden.", "user": "LaureaRapidCity_SD", "date": "April 29, 2009", "id": 29051021}], "location": {}, "stars": 3, "variance": {"poor": 0, "average": 2, "very good": 20, "terrible": 1, "excellent": 45}, "aka": "Sarum Heights Hotel Salisbury", "slim_ranking": 0.326530612245, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Sarum Heights is a lovely family-run B&B in an elevated position with majestic views over the Avon valley and Old Sarum. We offer a delicious full english breakfast with homemade bread and preserves and eggs from our own hens. Free wi-fi and on-site parking."}