{"user_rating": 4.0, "review_count": 576, "name": "Saunton Sands Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed here for a week with our toddler in June having heard it was a good choice for families. We were attracted by the childcare and leisure facilities. The website looks great and the hotel appears very modern and chic. However on arrival we were a bit surprised to find how dated much of the interior and decor is. It could really do with a makeover. We had an interconnecting family sea view room which had an amazing view of the beach and was perfectly functional, however could do with a refit. The place gives off an impression of having had a past heyday which it is still trying to live off. Take for example the gallery of famous guests on display in one of the main corridors - even if some of them are still returning guests, the photos are all about 20 years old!", "title": "Looks better on the website than in reality", "helpfulness": 10, "user": "Trav-london", "date": "August 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 136083008}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The food and service in the restaurant were both very good with the exception of the buffet breakfast. The dinner menu especially has many imaginative and tasty dishes with daily changes so it does not get too repetitive. Breakfast however is pretty basic and does not offer quality or much choice. Walking into the breakfast room is like walking into a Little Chef in the same room where you had a wonderful dinner the night before.", "title": "Fabulous short break", "helpfulness": 1, "user": "LES N", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135991917}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The childcare facilities and children's tea are good when they are available. The nursery is only open if there are over a certain number of children staying in the hotel, which is not apparent on the website and came as a bit of a surprise. We were lucky most of the time but it is beyond your control unless you are there in school holidays. Similarly with the children's tea - on the first day we arrived there were juices and yoghurts and a kids menu offered. However after the weekend when fewer children were in the hotel they did not seem to care as much and you had to go looking for someone to ask what food was on offer for the kids and ask for them to bring you drinks and yoghurt etc... A pretty inconsistent experience!", "title": "Could be a great hotel but doesn't quite deliver", "helpfulness": 4, "user": "michelle w", "date": "July 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 135711205}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Generally the staff were friendly with one or two notable exceptions. The hotel is in a fantastic location with great views and for the most part good food and facilities for families. If it had a decent makeover and some improvements were made in the areas highlighted above it could regain the greatness it obviously once had.", "title": "You don't need to go abroad!", "helpfulness": 1, "user": "FreoJan", "date": "July 28, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 135624487}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "From the moment that we arrived until we left on our two night short break we were well treated and felt comfortable and relaxed.", "title": "Great terrace and wonderful views", "helpfulness": 1, "user": "Bunkerbuster", "date": "July 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 135408120}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed here for two nights whilst touring the west country and really enjoyed our visit . . despite the atrocious weather. The hotel is set in a superb location overlooking Saunton Sands beach and Braunton Burrows. We were fortunate to have a room with a beach view. We dined in the bistro bar the first night and found the food and service to be excellent. The breakfast was also superb and was buffet style. On our second night we dined in the main restaurant and also found that to be excellent.", "title": "Excellent hotel", "helpfulness": 2, "user": "Rojo447", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134543994}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Throughout our stay we found all staff to be courteous and helpful. Our only disappointment was due to the terrible weather we didn't get to dine outside the hotel our use the oputside pool. We did however manage to use the indoor pool and sauna which were both lovely. We had also hoped to have some of the beauty treatments but found that they were fully booked.", "title": "Perfect Family Hotel", "helpfulness": 2, "user": "MMM1963", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134503229}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We would highly recommend this hotel.", "title": "Another re visit", "helpfulness": 1, "user": "RoyL65", "date": "July 15, 2012", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0}, "id": 134402711}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "What can I say about this Hotel it is truly amazing. We stayed in one of their apartments which I have to say has the most stunning view looking over the sandy beach and sea. This apartment had three bedrooms 2 bathrooms a very large living and dining Area and a luxury kitchen. Just open the sliding french doors onto a patio. We visit the hotel for Breakfast and evening drinks and the staff are very polite welcoming and really make you feel at home. Would truly recommend this hotel loads of activities for Children, indoor and outdoor pools VERY VERY child friendly", "title": "Stunning Location", "helpfulness": 1, "user": "Stephlg123", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 134080610}, {"rating": 5.0, "title": "Lovely Stay", "text": "Used when working. Although the outside looks like a white blot on the landscape, the interior is splendid.", "helpfulness": 1, "user": "Heather S", "date": "July 8, 2012", "id": 133730984}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed 16/17th july 2012 ~Weather dreadful. Our sea facing twin room very good. spotless and very comfortable. The walk to beach hard work for the less fit! The hotel staff excellent very friendly and all immaculate I agree with a previous reviewer the exterior of the Hotel is misleading ...althought it is art deco ...its not really attractive.. Restaurant good..I do think if the menu would be rather limiting if we had been there all week.....but there was an option to eat in another area. The Heath and beauty area was good friendly staff and good massage. The indoor pool was due to weather was busy, we had not realised it was 'Family Week'..but it was not too much of a problem. In Braunton the nearest 'centre' a small restaurant called Raggamuffins Bistro was ecxcellent best crab sandwich I have had for ages and not vastly overpriced . see seperate review. If the sun had been shining and the sea blue...I could have stayed for weeks!", "title": "beautiful views good hotel", "helpfulness": 2, "user": "janner1", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135283048}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We stayed here in March 2012 for one night. Our friends got married and had reception here. We was a bit jubious about the price as it was expensive but worth every penny the staff were helpful and the hotel was spotless I would recommend this hotel to everyone and anyone", "title": "Excellent", "helpfulness": 2, "user": "xbeckiex", "date": "July 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135223781}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Having stayed at the \"Saunton\" over a period of 30 years it is disappointing to witness the noticeable deterioration in standards which are possibly due to management by third generation of the Brend family. The restaraunt menu is perhaps a little to ambitious for the kitchen, furniture in parts is shabby and the delightful local N Devon girls appear to have been largely replaced with East Europeans with liile or no local knowledge. A great shame as the hotel has a terrific location with excellent leisure facilities but really does now need to sharpen up its overall offering.", "title": "Slowly Deteriorating", "helpfulness": 4, "user": "PRM6912", "date": "July 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134922699}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We visited this Hotel to celebrate our 25th Wedding Anniversay and had an amazing time! Our room was beautiful...we opted for a superior room with a seaview and WOW what a view! Although we went in March the weather was fantastic and we were able to sit on the terrace in the sunshine. The food was out of this world, as was the service. We were made to feel like royalty and were thrilled with everything about the hotel. We would definitely return when we've got another special occaision to celebrate....if you want a holiday in England and you want to spoil yourself I would totally recommend this hotel!! (We actually visited here in March 2007 but this date wasn't available to select)", "title": "Anniversary Treat", "helpfulness": 1, "user": "DebsNottingham", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134914323}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife and I have been staying at Saunton Sands for several week-ends a year for 12 years or more. I am sorry to say that although the hotel is the most beautiful position the standards in the restaraunt have slowly deteriorated over recent years. Breakfast has been buffet style for a long time now whereas it used to be served to order. Evening meals are also not what they used to be. Presentation is good but quality has gone down.", "title": "Not what it used to be.", "helpfulness": 3, "user": "bobandpat68", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134810018}, {"rating": 3.0, "title": "The View Does", "text": "The extraordinary view presented by the hotel must be one of the best views from any hotel in the UK if not the world. Whilst people are attracted to the Edwardian feel of the hotel something doesn't work for the modern business traveller. Good to see the wi if is now free but the bandwidth doesn't really support IPads from the room or public areas too well. My last stay this week had me in a room where a fan was bellowing and amazingly my TV couldn't get BBC1.", "helpfulness": 2, "user": "Canny C", "date": "July 7, 2012", "id": 133663469}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We visited this hotel for many years some time ago and returned to it recently. It still has a wonferful location but it has gone from lovely family run hotel to a chain hotel that takes every opportunity to make money from its guests(e.g charging for internet use). The deluxe rooms are clearly graded so you may find your deluxe room is really quite small. The so called 5 couse dinner is five course if you count a pre-meal snack and coffee with one chocolate as courses. The swimming pool is lovely though the changing rooms for it are dirty. Someone needs to take charge of this place- a proper restaurant manger would be a start! What a shame.", "title": "Could be a very good hotel", "helpfulness": 4, "user": "travellers52", "date": "June 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 132718429}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I stayed at this hotel prior to playing Saunton Sands Golf Course(a truly great course). From the beginning the experience was very pleasant, the reception staff were very efficient and check in was done very quickly. I had one of the cheaper rooms overlooking the back of the hotel but it was very clean and had all I required, including the longest bath I've been in for a while. I went to the bar for a drink before dinner which was served at a table in the bar with a bowl of nuts. I had an excellent dinner (steak) which was all beautifully cooked and served by very attentive waiting staff, I could find nothing to complain about. I arose early and went for a swim in the excellent indoor pool, then a leisurely breakfast which is on a self service system which I much prefer. Throughout my stay the staff could not have been more helpful and I cannot speak highly enough of them. The hotel is a bit dated but that is not always a bad thing, it certainly isn't scruffy in any way. My only criticism would be a lack of air-conditioning in my room which caused me to wake up during the night and throw off the duvet. It wasn't particularly warm weather and I couldn't open my window because of a fan outside, so it would be really unpleasant in a heatwave.", "title": "A very pleasant experience", "helpfulness": 2, "user": "divotdave", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132536731}, {"rating": 5.0, "title": "Wish I could have stayed longer", "text": "Recently stayed for a few days at Saunton Sands on our return from Cornwall. Although the weather was not great this did not mar our stay. This hotel caters for all age groups and the new Beauty Suite is a must for that extra treat. Could not fault the food or service - well done.", "helpfulness": 2, "user": "JJDSouthEast", "date": "June 19, 2012", "id": 132294902}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Looking forwar to our next visit very much.", "title": "Disappointing and dated", "helpfulness": 1, "user": "1961nicola", "date": "June 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132253547}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 53, "average": 82, "very good": 142, "terrible": 31, "excellent": 268}, "aka": "Saunton Sands", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "There is something truly special about the Saunton Sands Hotel. Set above Saunton's stunning three mile beach overlooking the natural wonder of the Braunton Burrows World Heritage Site, the Hotel's magnificent location gives us one of the most dramatic coastal views in the South West.There is far more to staying at Saunton Sands Hotel than what's outside. Inside you'll find first class accommodation and facilities, fantastic food and a quality of service you'd be hard pressed to find anywhere else.Whether your stay if for a winter break with a difference, summer holiday for all your family or a business trip we'll do everything we can to make your stay as memorable as the view. We look forward to welcoming you."}