{"user_rating": 5.0, "review_count": 305, "name": "Savaii Lagoon Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "This resort is low key but total quality in terms of the people, their service, the simplicity of the place, the unspoiled location, yet proximity to good food outlets including their own. There was great swimming and snorkelling, clean sand and seawater and clean running drinking water for the guests and the locals which is a nice touch.There is very good cellphone coverage but no internet which made the holiday all the more meaningful. Water 29c, air 30degrees is hard to beat. For this type of facility I rated it highly. I found it a totally relaxing spot and definately on the return list. Samoa is a delight for many reasons. This lovely place in this very pretty bay is certainly one of them.", "title": "Dream Recovery Spot!", "helpfulness": 3, "user": "jennyshipley", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 68270146}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "!", "title": "AMAZING PLACE, MOST HELPFUL STAFF", "helpfulness": 4, "user": "saraandray", "date": "June 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 68047324}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "I did not stay at this resort, however visited it this June as I am getting married next door at Le Lagoto next year and wanted to check out places for my guests to stay.", "title": "After our fourth visit it just gets better and better.", "helpfulness": 5, "user": "bcolman", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67526129}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My parents and I planned to pop in for a few mintues and take a look at a room, Well the lovely German couple for manage the resort showed us around the whole place, The rooms dont look like much from the outside as they are concrete (but that way they dont leak and they hold well). But inside they are lovely, very modern, with a full kitchen and a nice bathroom. we were really impressed.", "title": "A wonderful resort, great staff, idyllic setting in paradise", "helpfulness": 4, "user": "debdestiny", "date": "June 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67415838}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We then stayed for a coffee in there lil resturant that the couple own and run, This is real coffee and it was amazing.", "title": "Our second holiday at Savaii Lagoon Resort", "helpfulness": 5, "user": "Estelle L", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66656772}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband and I went to Savai'i Lagoon on the recommendation of his team leader. It was beautiful - our beachfront bungalow was spacious, clean, and had everything you'd need for a getaway in the sun; great shower, microwave, cooking utensils etc all supplied. Be sure to partake of manager Chris's gourmet dinners! Am planning to take my seven year old for the fantastic snorkelling. It was my first time snorkelling and it was a great experience. Be sure also to catch the informative talk on coconuts if you can, and taste the delicious coconut cream.", "title": "Fantastic Honeymoon Location!!! Great and safe for kids too.", "helpfulness": 5, "user": "Interpretergirl", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61850438}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "One tip, get some supplies near the wharf when you get off the ferry as we found it hard to get fresh veggies and eggs near the resort. Then you are all set for a wonderful holiday!!! ENJOY!!!", "title": "I Will Be Back", "helpfulness": 6, "user": "HottravellerAuckland", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61845865}, {"rating": 2.0, "title": "i was sadly disappointed", "text": "My partner and I stayed at Savaii Lagoon a short time ago and we had an awesome time. It was low season but the weather was great. The accommodation was very clean and comfortable with hot showers (but who wants hot showers in Samoa). The bed was so comfortable, surprising for Samoa perhaps. We did not want to sleep on a mattress on the floor. When we entered our bungalow, we were welcomed by the sight of the towels laid out beautifully on the bed with fresh flowers.", "helpfulness": 2, "user": "patuiki", "date": "April 4, 2010", "id": 60341727}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We chose this resort because a friend who stayed there recommended it to us and because we could do most of our cooking, but there is a restaurant there and also a pizza place next door if you do not want to cook. We had a pizza once, very nice, enough for two people and not expensive. The breakfasts which were inclusive was more than we could eat, toasts and jam, cereal and fruits and tea or coffee. We also bought bread from the shop across the road for our lunches. You should try the local bread - Yum!.", "title": "True beachfront accomodation", "helpfulness": 2, "user": "Manaaki", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59694869}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The beach was amazing, the snorkeling was great and we just chilled out and relaxed which is what we needed to do. We met the owner who was doing some renovations and even though he was very busy, he always stopped and talked to us and the other guests to ensure that our day was going well. He had an amazing sense of humour. All the staff at the resort were very helpful and friendly. The maids spoke English quite well and they seemed to enjoy talking to us. They wanted to know about our jobs, where we lived, why did we come to Samoa ..... Nothing was too much trouble and that helped to make our holiday.", "title": "It really is that wonderful - right on the beach!", "helpfulness": 2, "user": "FrancieJ", "date": "March 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58172123}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Savaii Lagoon Resort for 2 nights after 4 nights in Apia. It was a fantastic change from the often chaotic, dusty and loud town. The resort has neat, clean bungalows containing most of the things you need to be self contained. The water is okay to drink straight from the tap and there is hot water in the shower.", "title": "Very relaxing place to unwind", "helpfulness": 2, "user": "Angelco", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71173826}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The beach is lovely and the snorkling was good, although you have to avoid low tide. The hosts, Chris and Patricia, are very helpful and friendly, as well as the other local people working at the resort. The complimentary continental breakfast was good, with cooked options available. Chris is an excellent chef and our dinner of fresh ruby snapper was delicious, too.", "title": "Perfectly relaxing", "helpfulness": 2, "user": "Charyn", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71049716}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The only downer was the rooster, who started crowing at 3.30am! Take earplugs!", "title": "Excellent location and resort , situated on a beautiful lagoon.", "helpfulness": 4, "user": "Zeb50", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70687948}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Our first trip to Samoa and we couldn't have found a better place to stay. The Savaii Lagoon Resort is small and elegant in its surroundings. The added value was the small restaurant run by the managers with the most spectacular fresh fish and vegetables. I had taken food after dire warnings but ate there almost every night. The massage was excellent, too. This was what we needed, a relaxing holiday.", "title": "Savaii Lagoon - Stunning location", "helpfulness": 4, "user": "Sedgemoore", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70663417}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Excellent bungalows which have everything you need, located on white sandy beach, which is great for swimming (at all but low tide) Water at resort is safe to drink.", "title": "The've got it right", "helpfulness": 4, "user": "joelmac", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70549333}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Large cyclone-proof beachfront bungalows with a beach view through the windows. Beds are very comfortable. In the daytime we found the ceiling fan wasn't able to cool off the interior well enough to spend any time inside.", "title": "Great food, expensive accomodation compared to similar properties on Savaii", "helpfulness": 3, "user": "sinder", "date": "June 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 65986396}, {"rating": 5.0, "title": "We felt totally \"at home\" here", "text": "Sekia Pizza next door is superb, and the restaurant on site here has nice breakfasts (included) and fresh fish dinners (not included, $45 tala additional per person). The dinners were really good. Across the street you can buy reasonably priced chicken and chips, fresh bread and buns, and other snacks.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 31, 2010", "id": 65955394}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Posted rates are expensive for Savaii - we found much better value offered at other comparable relaxed beach resort properties like Va-I-Moana and Stevenson's Beach Villas - during the time we were there similar large beachfront units cost an average of 30% less per night and also included dinner, with Stevenson's also having air conditioning.", "title": "10 days of bliss!", "helpfulness": 8, "user": "timmydownawell", "date": "May 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64251843}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Savaii Lagoon, along with many other properties offered a last minute booking special to fill available units during low season. Apparently this is common, so in future we would not book in advance, since there was lots of availability all over Savaii in March with many discounted offers for all types of accomodation. I feel it would be better to wait and compare available properties and prices upon arriving if travelling during low season, this would avoid being obligated to any certain location by paying in advance for a number of nights.", "title": "fantastic get away from it all", "helpfulness": 5, "user": "tvonkite", "date": "May 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 63897333}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The previous reviewer has said it all, really! We love snorkelling, and this location is magnificent and totally safe. You can snorkel for hours in a huge bay, and if that's not enough the adjacent Dive Savaii operation will take you out to more remote spots.", "title": "You Can Do Better Than Savaii Lagoon, They give Paradise a Bad Name", "helpfulness": 2, "user": "michaelblacksa", "date": "May 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 62916857}], "location": {"country": "Samoa", "continent": "South Pacific"}, "stars": 3, "variance": {"poor": 3, "average": 9, "very good": 36, "terrible": 2, "excellent": 255}, "aka": "Savaii Lagoon Hotel Savai`i", "slim_ranking": 0.0625, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A boutique resort situated on a beautiful sandy beach surrounded by a lagoon with sparkling clear warm waters, safe for snorkeling and swimming. Bungalows are self contained with some cooking facilities, catering for families, singles or couples. All have outdoor showers enclosed within the bungalow to enable you to have a shower under the stars. Restaurant is on the beach also for those pina coladas or cold beers while you watch the magical sunsets for which this area is renowned."}