{"user_rating": 4.5, "review_count": 866, "name": "SavHotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The Savhotel was absolutely fantastic and all the praise for this hotel is well deserved. I'm surprised the hotel is not rated higher on TripAdvisor (but I'm sure it will be soon)! We paid a mere 60 euro for a night with breakfast included which was an absolute steal!", "title": "What a great suprise at the Sav!", "helpfulness": 1, "user": "imabari", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12582421}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel is very modern, chic and hip and has a funky vibe to it. The room is spacious, with very contemporary decor and finishings and it is very pleasant to be in the room. The bathroom is also a good size and very stylish. The room had free wi-fi (we were on the 1st floor) and a few English news channels on the TV and there was a small gym on the top floor.", "title": "***Loved SavHotel***", "user": "liljro", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 12529187, "likes": {"liked": "— Modern Furniture", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The breakfast buffet was fantastic with loads of fresh fruits, delicious croissants and pastries as well as cereals, meats and hot dishes. The cappucinos made to order are also worth a mention. If you miss the breakfast there was a free \"coffee bar\" from 10am until about 4pm (though we didn't use it).", "title": "Wonderful Hotel and Experience", "helpfulness": 2, "user": "Aaron A", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 10233414, "likes": {"liked": "— The high quality accomodations in new rooms with a great staff.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "As mentioned previously, the hotel is not in the city centre but a mere 5 min drive away (there is also loads of free parking for cars). We'd definitely stay here again and wished we'd stayed longer.", "title": "Great rooms and low price", "user": "Snozzledog", "date": "October 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 10127177, "likes": {"liked": "— Value and Decour", "disliked": "— Price of Bar"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We traveled all over Italy for our honeymoon and stayed at different hotels & by far SavHotel is the best with it's contemporary furniture and fantastic big rooms. The shower was huge compared to others in Italy. The staff was pleasant & friendly and loved that there was free internet to plan & book our tours. The only complaint we have is it's a bit far from Central Bologna but we walked and took the bus. We definately would recommend this hotel to our friends. If you want to get away from the crowds and noise Bologna is your city. You can take a stroll on the narrow cobble streets with their famous delicious gelato and enjoy what Bologna has to offer with it's beautiful history and churches.", "title": "Clean cut and very modern", "user": "sr42", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 8723194, "likes": {"liked": "— the rooms and facilities", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We chose the Savhotel due to the proximity of the Bologna Fiere (convention center). The Unaway Hotel is a bit closer if you do not wish to walk the 4 blocks from the Sav to the Fiere. The Savhotel has a very clean crisp look about it. I would say it's a boutique hotel. The room is adequate in size & the bed very comfortable. Internet is free & that is a plus. They have computers in the lobby, but they will supply you with a wire to connect in your room (at no cost too). The breakfast was adequate with hot & cold offerings. The restaurant opens at 7 PM & we ate there 2 nights because we were too tired from working all day. We were unaware (our error for not checking) that the restauarnt is closed on Sunday evening. The bar serves a limited menu on Sundays.The only downside is the distance from downtown. If you are going to a convention I would highly recommend the Savhotel, but if you are going for sightseeing you will need to take a taxi anywhere you want to go.", "title": "Ultra Modern Hotel", "helpfulness": 1, "user": "gayler104", "date": "May 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30003012}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel is wonderful. After travelling around Northern Italy on a budget, our last stop was Bologna. We had spent a week in very small rooms with average facilities (bar Milano) however all this was to change when we arrived at the Sav Hotel. We paid 100 Euro for 2 nights for a double. The hotel is very modern, clean and spacious. The breakfast was easily the best we had in Italy however we didn't eat in the restaurant in the evening. The only let down is the location. It is very easy to get the bus (about a 10 minute journey) and also very cheap nevertheless you still have to bear this is mind when you want to enter the main city of Bologna. We were there for a leisure holiday but i believe that it is close to the industrial area of Bologna. It is also very close to the Airport.", "title": "Chic and modern, superb value!!", "helpfulness": 1, "user": "YasminAbouda", "date": "May 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 29919175}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I stayed at the Sav hotel and I absolutely loved it! The staff was really friendly and helpful; the room was nice and comfy and the modern feel and look makes it really special.", "title": "Perfect place!", "helpfulness": 1, "user": "mmeunier", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26114531}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Definitively recommend it; can't wait to go back!", "title": "A great hotel!", "user": "Lacugia", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22092478, "likes": {"liked": "— Style"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I was at Savhotel for two nights last week and I really enjoyed my stay. The bed is very confortable and the room is dark and quiet. The bathroom is really stylish with an incredibly spacious shower and I could use the internet in the room for free, that was great. The furniture looks new and modern and is all very clean.", "title": "Incredible staff", "user": "Hiskid", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 18867751, "likes": {"liked": "— The incredible helpfulness of the front desk staff!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Last week I stayed at this hotel during my business trip to Bologna and was quite impressed: the hotel could be compared to some of the best hotels I have been in for business reasons: not only great for business trips (closest to the International Fair) but also appropriate for a tourists’ weekend in Bologna (situated in a quiet area, 5 min away from the city centre). Innovative interior design, extremely good reception and house-keeping service. The biggest surprise was the first rate breakfast buffet!", "title": "A great hotel", "user": "MaxFromMilano", "date": "July 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17603652, "likes": {"liked": "— The service and rooms", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "Finally I would like to thank the direction of the hotel for promptly resolving on a weekend a problem with my reservation. Definitely I recommend it and will go back there!", "title": "Contemporary style, reasonable price.", "user": "diamond-elite", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 16258318, "likes": {"liked": "— Decor. free secure parking.", "disliked": "— The gym's treadmill was broken"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The Savhotel isn’t located in the prettiest part of Bologna but once inside we were impressed by its clean, contemporary decor. It’s a hotel that seems to be frequented by Italian business travellers more than tourists. We arrived late in the evening to check in only to discover that I had made our booking for the wrong date, booking August 28th instead of May 28th. Luckily for us they had a room and we were charged €80 instead of the original €62 that I’d booked on HBS. I was happy because they could have asked for twice that and we would have had to pay it. The staff were friendly and always helpful.", "title": "wow", "user": "jalonzo", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15995081, "likes": {"liked": "— everything !!", "disliked": "— none"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel isn't too far out of town to walk (15 mins we were told). There's a bus stop a few minutes away if you don't fancy walking. The service is regular and runs 'til around 12.30am.", "title": "To each his/her own....I guess", "helpfulness": 2, "user": "BagnoCaldo", "date": "March 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 14458725, "likes": {"liked": "— bathrooms were adequate", "disliked": "— wear, location, unscrupulous/unaccomodating management"}}, {"rating": 4.0, "title": "Short but sweet", "text": "Something worth mentioning about the room is the bathroom door. It’s a frosted glass swing door with no lock and a gap around the edges. Not great for those who like privacy on the toilet!", "helpfulness": 1, "user": "Globe99trotter", "date": "January 31, 2008", "id": 13148601}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Ultra modern Italian styled hotel rooms designed by what looks like university design graduates. Very clean and comfortable but had to get used to the modern technology of turning on lights ,tv,plumbing ,etc. The best part was the low price 60 euros per room per day and the included fantastic breakfast buffett. Great deal !", "title": "Great deal & modern italian designed rooms", "user": "jifty", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8185068, "likes": {"liked": "— ultra modern rooms and breakfast", "disliked": "— located in a part of bologna not advisable to walk around at night"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Unbeatable value for money based on the advance weekend rate. Room was well designed, modern and clean. Basically it is an excellent modern business hotel which offers great rates off peak. It is maybe 30mins walking to dead centre of town which suited tourists like us. The only negative, which most wont care about, was the roof garden, which is quite big but had no seats or tables and just one dead plant!", "title": "Value for money", "user": "navac", "date": "June 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 8024899}, {"rating": 4.0, "title": "Great Hotel but too far from City Centre", "text": "Stayed here for a few nights. Hotel is fab, cannot say a bad word re the hotel, however it is based slightly too far from centre of Bologna meaning you need to get a taxi each time which can add up.......... Great as a base for a little while but would be handier to book somewhere right in the middle of the city", "user": "oasisDublin", "date": "June 27, 2007", "id": 8014889}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "our stay coincided with the book fair, and as we'd not visited this hotel before we were sceptical. However it was new, clean and the breakfast was great. A little extra was the coffee bar open during the day where you could get different types of coffee (from a machine) and cooled soft drinks for free. The staff were not especially friendly, but were quick to provide me with a ice pack when I hurt my knee. The hotel is walking distance from down town Bologna with plenty of good shops on the way.", "title": "book fair", "user": "BelgiumMaggie", "date": "May 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7541541, "likes": {"liked": "— the coffee bar", "disliked": "— location in th middle of blocks of flats"}}, {"rating": 5.0, "title": "Amazing Hotel!", "text": "This is a fantastic hotel, close by the fair district. It has very good rate with a very good service. Free Garage, free internet connection, free fitness room and also a smoking corner! The hotel is brand new on a modern style. I really suggest to try.", "helpfulness": 2, "user": "David28772", "date": "January 9, 2007", "id": 6567797}], "location": {"country": "Italy", "region": "Emilia-Romagna", "continent": "Europe"}, "stars": 4, "variance": {"poor": 5, "average": 39, "very good": 285, "terrible": 1, "excellent": 536}, "aka": "Sav Hotel Bologna", "slim_ranking": 0.0280373831776, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Savhotel is a 4-star hotel in Bologna with a modern style and the latest in fittings and equipment offering impeccable service. Located in a strategic position just a few meters from the Bologna Fair District and the Congress Centre, only 5 minutes away from Bologna’s historic centre making it the perfect choice for both business travelers as well as for international tourists and families. Savhotel offers high levels of comfort including: Wi-Fi in the lobby, cable in all rooms, 24-h ultra-modern Fitness Point, LCD TV and cable in all rooms, covered private garage."}