{"user_rating": 4.5, "review_count": 326, "name": "Sawrey House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We recently stayed here for two nights as part of a wedding. Our room (#1) was on the ground floor – very convenient but somewhat noisy as it was next to the front door – and was large, well equipped, attractive, and included a large & nicely decorated en suite bathroom. The grounds are beautiful, the area is wonderful, and the service/food/ceremonies over the weekend were well executed. The lamb shanks were heavenly! We would stay here again!", "title": "Well run and attractive small hotel", "user": "JohninDC", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179193588}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I stayed here for two nights in September. The hotel and grounds are simply beautiful, and the staff friendly and helpful. Breakfasts were lovely - a great selection to choose from. It is well located for access to Grizedale (Sculpture Forest, walking and cycling trails) and if you're looking for somewhere quiet to stay away from Windermere's busy tourist drag then I cannot recommend this place more highly.", "title": "Highly Recommended", "user": "Jen6161", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178492622}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I have just spent the weekend at Sawrey House Hotel where my son and his fiancé held there wedding reception. We had the most fantastic time from start to finish. The hotel is spotless, the food is of high quality and staff and management are really helpful.", "title": "Ideal wedding venue", "helpfulness": 1, "user": "d_mcgiffen128", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178345688}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The reason I feel I should write this review is because we would love other couples who are looking for a reasonably priced wedding venue that can provide this level of service /accommodation and have the most astonishing views should at least be aware the hotel exists.", "title": "Location, location, location.", "user": "terry6395", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177525693}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "The Sawrey Hotel helped us to celebrate a weekend that my famly and friends will never forget. Thank you to David and Crew at the Sawrey Hotel.", "title": "Highly Recommended", "user": "Jen6161", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177261452}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I have stayed in this hotel many times over the years but this was my first visit under the current owner. The hotel is in a perfect location, near to everything you could wish for, a vivid ambiance of the Lakeland of memory - Swallows and Amazons and Hill Top, a welcome calm from the tourist excesses of much of the area and stunning views of the lake. Add to this the fact that it is now better run than on past visits and you have the location for a perfect break. The staff are outstandingly responsive and friendly, the décor is now much smarter than in the past. The food is well above expectations and shows attention to detail, interesting innovation and responsiveness to individual requests. Even the wine list is quite thoughtfully selected for such a small hotel. Overall we had a great time and will certainly return.", "title": "A Perfect Break", "user": "John_Wright2013", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171834669}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Just returned home from a wonderful break away at Sawrey House. Lovely friendly staff, homely settings and great food. When visiting the Lakes there are always lost of options to choose from which can be 'pot luck'. I fully recommend you visit this hotel, however rather pricey but worth every penny.", "title": "Superb weekend", "user": "Chriselle N", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171757992}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I bought this as a kgb deal and we stayed there 2 nights in April. Absolutely lovely place and clean well presented rooms. Breakfast portions were filling with unlimited tea/coffee/juice. Breakfast was laid out beautifully fit for a king to include a continental breakfast. The evening meal turned out to be a 5 course and it was amazing. I would definitely go back and recommend it to others.", "title": "Brilliant place with excellent customer service", "helpfulness": 2, "user": "Gillster11", "date": "August 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170539004}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had a lovely time at Sawrey House in July 2013. Staff were friendly and helpful. The view is magnificent, and the environment is very peaceful. The place is very beautiful, comfortable and clean. And the beds were very comfy. Thanks again!", "title": "What a delight!", "user": "Bernadette W", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170316751}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We have had a very nice experience visiting Sawrey House Hotel.", "title": "Super location - super staff - super chef", "helpfulness": 1, "user": "CarstenCramer", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 170010321}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "I stayed for 2 nights in early August. This is a lovely country house hotel. It manages to be modern whilst feeling cosy. Although it was the height of summer, I can imagine winter breaks are great here too. I had a single room and I usually find that single rooms are the size of a walnut and are shoved away in the attic or in a broom cupboard. Not so here. It was a decent size and nicely decorated. The bed was very comfy & luxurious too. I particularly liked the little jar of homemade shortbread on my tea table.", "title": "Relaxing & cosy", "user": "Striker54", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 176334435}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Breakfast was fantastic. The menu was extensive & everything I tried was of a very high standard. I would certainly stay here again. If I had to find one negative point it was that my room was above the gravel driveway / car park so cars moving over the gravel woke me up, but it wasn't a big deal.", "title": "Absolute perfection . . almost!", "user": "DeniseBranfoot", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175924950}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "I strongly recommend a walk out of the village up towards Claife Heights past Moss Eccles Tarn & Wise Een Tarn. I'm not sure I've seen better views anywhere in England.", "title": "A wonderful place to relax and unwind", "user": "Elizabeth S", "date": "September 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175640054}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This hotel was absolutely surperb. From the moment we arrived to the moment we left, the hotel, grounds, staff, bar, restaurant, food, quality of drinks (good selection of branded sprits), to the room, beds, room facilities and bathroom being top quality!", "title": "Wonderful Surprise", "user": "nattalie c", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174955846}, {"rating": 5.0, "title": "lovely setting", "text": "We were attending a private wedding and everything was lovely, nothing was too much trouble.", "user": "sukie_13", "date": "August 27, 2013", "id": 174363953}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed in Sawrey House Hotel in late-August and having booked last minute were delighted with what we found when we arrived very late on the Friday night (partly as a result of the sat nav taking us to the other side of Lake Windermere!!!). Nic and his team were helpful and courteous from start to finish. The hotel and grounds are beautiful, the breakfasts were delicious and Nic went out of his way to make us feel at home, including drawing us a map of the Old Man of Coniston walk which we followed to the letter! It was our first time to the Lake District and we can't wait to return. We will certainly stay in the same hotel again.", "title": "Excellent", "user": "southowl", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174355916}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Our stay at the Sawrey House Hotel was excellent. This beautiful building with its breathtaking views, was ideally situated for exploring both Windermere and Coniston. The staff were very courteous and helpful. The food (especially the breakfasts) was of a high standard. We would highly recommend this hotel and certainly stay again.", "title": "Sawrey House Hotel", "user": "Couple12013", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174302719}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "When sourcing Cumbrian hotels I was hoping to find a special place for my wife and I to celebrate our wedding anniversary. On arriving at Sawrey House's superb location with it's beautiful grounds and fantastic views of Grizedale and Esthwaite Water, we felt the right choice had been made. We were not dissapointed. We were greeted with a very warm welcome by Alan and then Nick (General Manager). After an easy check-in were shown (with luggage carried for us) to our tastefully appointed room with lake view. We could have easily missed breakfast as our bed was so comfortable! House made complimetary shortbread was a nice touch!", "title": "A splendid anniver'sawrey' stay", "user": "bellehelene_11", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174211506}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The food was a delight from evening dinner to the breakfast with great choices (with home made bread items) which was served efficiently by an attentive and friendly waiting staff.", "title": "Wonderful Wedding Venue :-)", "helpfulness": 1, "user": "Alix A", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173137921}, {"rating": 4.0, "title": "Excellent break in Sawrey", "text": "Our stay was made better with the manager Nick's personality and his attention to detail is an asset to the 'House' with the support by a great team. Overall we had a lovely stay and left very contented hoping to return soon.", "user": "lgd23", "date": "August 13, 2013", "id": 172065694}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 5, "average": 10, "very good": 51, "terrible": 1, "excellent": 259}, "aka": "Sawrey Hotel Country", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Sawrey House is an 11 bedroom country house hotel located in the heart of the English Lake District. Set in 3 acres of mature garden and with stunning views of Esthwaite Water and Grizedale Forest, Sawrey House Hotel is the perfect base to explore this beautiful part of Cumbria and is the ideal getaway for nature lovers, romantics and those who enjoy the finer things in life."}