{"user_rating": 4.0, "review_count": 90, "name": "Scandic Nykoping City", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Good option where to stay when all hotels in Stockholm and closest surroundings are fully booked due to a big event. Hotel itself is very nice, clean and quiet. Staff attitude is very positive.", "title": "Quiet accommodation in quiet town", "user": "Lexx_Naxxx", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21840881, "likes": {"liked": "— Overall atmosphere", "disliked": "— Far from Stockholm"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Spent a weekend at this hotel and can definately recommend it. The downstairs lobby and lounge was very welcoming with a roaring fire to help the atmosphere. Breakfast was incredible with everything you could possibly ask for and more.", "title": "great hotel", "helpfulness": 3, "user": "nohow", "date": "October 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20806373, "likes": {"liked": "— comfort & food"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Our bedroom was a little small but had everything we needed. The hotel is situated in a great place and Nykoping itself is worth exploring. We caught the train to Stockholm takes about an hour and again we were impressed with the standard and efficiency of the public transport. as had caught the local bus to the hotel from Skavsta airport. The people we met were lovely and very helpful. Would definately go again and stay at this hotel, one word of warning if you are staying over on a Sunday night the hotel restaurant and most of the others in Nykoping do not open we ended up with a take away pizza a good one at that, but not quite what we had planned.", "title": "Excellent all round", "helpfulness": 1, "user": "gilmorehill", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17847505, "likes": {"liked": "— Conenient location and lovely decor", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "An excellent, modern hotel with lovely decor, helpful staff and a very convenient location just off the main shopping street. The food too was very good indeed with buffets available for breakfast, lunch and dinner. Nykoping itself is a very pleasant little town with a bustling harbour area with good restaurants. Would definitely stay there again .", "title": "great for a one night stopover from Skavsta", "user": "LindsayPinz", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 14886511, "likes": {"liked": "— Cosy and convenient for Skavsta airport", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I've stayed here twice now- one in June, when it was 30 degrees C and once in March, when we had 4 inches of snow. On both occasions, we had flown in quite late on a Ryan Air flight to Skavsta and didn't fancy travelling on to Stockholm straight away.", "title": "Friendly Hotel", "helpfulness": 1, "user": "Dolly78", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13643509, "likes": {"liked": "— Cleanliness and friendly staff.", "disliked": "— Bedrooms a little dated, but being refurbished so will improve."}}, {"rating": 5.0, "title": "So friendly!", "text": "Nykoping is about 3 miles from the small main airport that Ryanair fly into. Once at the airport it's so easy to get a bus direct to either Nykoping which is ten minutes away or Stockholm 2 hours. I found the Park Inn hotel excellent value. Don't be put off by the outside, the inside is welcoming and the staff friendly. Good breakfast plenty of choice, hot and cold. All day coffee and tea lunchtime buffet or meals and a small cafe attached with cakes and hot beverages. The rooms are clean and warm, with coffee and tea making facilities. Sauna free to guests after 5pm. The bus station is 5 minutes away and the train station 10 minutes, but you cant hear the trains as they are so quiet. We went to stockholm for the day, and it was brilliant! it's not expensive to travel around. Even cigarettes are cheaper than uk. Nykoping has its own unique shopping centre, and a pub called the twist with an English theme. The food there was fantastic and very reasonable. We also found loads of walks around the river which runs into a harbour near the baltic sea. This time of the year it was frozen but what a sight! Don't be put off because it's a small town, it has a lot to offer. He even has its own nightclub. The Park Inn hotel was one of the best I've stayed in.", "helpfulness": 11, "user": "jetsetter59", "date": "March 23, 2006", "id": 4728048}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We atayed at the Park Inn Hotel in Nykoping for two nights in January 2008. I thought I should take a few minutes of my time to give a short review. The hotel was one of the best that we have stayed in for a while. I have nothing but praise for the staff, that went out of their way to be polite, courteous and very helpful. The rooms were nice and the hotel was very clean. Breakfasts were truly wonderful with a tremendous selection on offer. A truly pleasant, happy and memorable stay and we would have no hesitation whatsoever in returning here again in the future.", "title": "Very well looked after", "helpfulness": 2, "user": "thetravellingmanUk", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 13310762, "likes": {"liked": "— Friendliness of the staff and the breakfasts"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "Having enjoyed a 24 hour taste of Sweden in this same hotel over a year ago I decided that it would also provide a suitable base to introduce my daughter to the country.", "title": "Second overnight stay", "helpfulness": 1, "user": "Ciccola", "date": "January 28, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "value": 4.0, "rooms": 3.0}, "id": 13072485, "likes": {"liked": "— Wooden floors and Scandinavian furniture and of course the breakfast buffet.", "disliked": "— Bathroom clean but fairly basic with disappointing lack of tioletries"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Our room was perfectly comfortable, breakfast something to look forward to and the sauna appreciated but if you're a trace prudish note there is no lock on the door. It's also necessary to inform reception in advance when you'd like to use it.", "title": "Very Quiet Swedish town-beware of building work.", "helpfulness": 3, "user": "jms52", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 12769266, "likes": {"liked": "— Clean and convenient. Very helpful staff and good coice at breakfast.", "disliked": "— Building renovations on the first floor"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "In winter the town seemed a little dismal and I did wonder whether we shouldn't have travelled that bit further into Stockholm for more life.", "title": "Average but Convenient", "helpfulness": 3, "user": "Livilian", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12632746, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Quite OK", "text": "There was a bus service to and from the airport but waiting in the cold and dark was unappealing and so we took a taxi from outside the terminal building and again on our return. Wide variation in fares we discovered. Taxi booked from the hotel back to the airport considerably cheaper. The company we'd recommend is: taxi nykoping oxelosund", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 9, 2006", "id": 4953425}], "location": {"country": "Sweden", "region": "Swedish Lakeland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 12, "very good": 34, "terrible": 3, "excellent": 37}, "aka": "Scandic Nykoping Nyköping", "slim_ranking": 0.285714285714}