{"user_rating": 4.5, "review_count": 262, "name": "Schoenhouse Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Believe what everyone else here has said.", "title": "home away from home", "helpfulness": 3, "user": "BibsSydney", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16982244, "likes": {"liked": "— Clean and friendly and a great neighbourhood", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Amazing place. We felt like we lived there rather than staying in a hotel. We stayed for 4 nights, and we got married on the third day. On our wedding day the staff lent us some glasses and a wine cooler for the day. The next morning when checking out, the staff gave us a bottle of champagne to share with our breakfast!", "title": "Schoenhouse like home", "helpfulness": 1, "user": "chezington", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16866668}, {"rating": 5.0, "title": "Great place to stay", "text": "We will stay here again, sooner rather than later.", "helpfulness": 1, "user": "JLM42", "date": "May 19, 2008", "id": 16199879}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Recently stayed at Schoenhouse Apartments and it was truly special. The apts are huge (we had a Deluxe in the newer, elevator building), super clean, incredibly modern in furnishings, and amenities (free wifi, flat screens) and so on. Best tho was the staff. Had the privilege of meeting Immanuel, one of the owners, who was gracious, friendly, and very interested in our opinion of his property. After meeting him, it's understandable that all staff, from the front desk to the morning cook in the deli to housekeeping etc, everyone went out of their way to make us feel welcome. I think it is an incredible value and should we ever return to Berlin, we'd only stay there. The neighborhood is great, always felt safe, the Ubahn is a 2 min walk, a grocery store and organic grocery are across the street, as is a pharmacy and nightclub too. 5 min walk to Alexanderplatz, wonderful shopping, open air markets and killer restaurants abound. Schoenhouse Apartments are really a hidden gem.", "title": "Loved it!", "helpfulness": 1, "user": "citizenMhotels", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14252938, "likes": {"liked": "— the size of the apartments", "disliked": "— no shampoos in room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Schoenhouse Apartments were perfect for us. The location is in a great neighborhood and convenient -- you can see a U-Bahn station and grocery store from the front door of reception. Our unit was large, even as a \"junior\" apartment, with enough room to unpack, spread out, and be in \"separate\" rooms when necessary. Wifi is free. There were kitchen facilities that included a frig, microwave, toaster, kettle, coffee maker, and hot plate units. There is a small Italian restaurant in the lobby area, but we never got around to trying it out (smelled good, though). While the apartments are part of converted older buildings, they are quite quiet. Our unit looked out on an interior courtyard. No elevator, though, so practice your stair stepping with luggage! Dishwashing liquid is supplied and liquid hand soap is in the bathroom, but there are no other toiletries. There was not daily maid service or room service, but we don't need that.", "title": "Brilliant apartments", "user": "k9luka", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14060765, "likes": {"liked": "— Very very clean. Lovely bathroom. Comfortable bed. Very well equipped. Close to central Berlin with good nearby restaurants and shops. Close to transport.", "disliked": "— Lots of stairs!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "We were lucky to stay there for the first time in Berlin and we loved this place at once. Excellent location (2 minutes from Rosa Luxemburg metro station), where you can feel a real, true Berlin, very friendly Schoenhouse people (can't name it just \"staff\"), which helped us a lot with all needed documents for our trip (thanks all!), beautiful rooms where you can find everything for living months and a nice old house where ghosts seem to appear from time to time. We are sure to stay at Schoenhouse next time.", "title": "To be back", "helpfulness": 1, "user": "ASPH", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18412669}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The apartments are clean and spacious and the staff were really helpful and spoke perfect English. They gave us a free map of the city and the U & S bahn lines with the location of the apartments and the closest station circled for us. We were also given the passwords needed to use the free wireless Lan facility as soon as we arrived.", "title": "Spacious, friendly & great location", "helpfulness": 1, "user": "Laces08", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18199092, "likes": {"liked": "— Comfortable, friendly & modern", "disliked": "— No air conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The location is great, literally a two minute walk from the Rosa Luxemburg Platz U-bahn station, and only takes around 15-20 mins to walk to Alexanderplatz. Lots of restaurants, bars and supermarkets nearby, and there is a deli actually sited at the apartments which serve a variety of hot and cold meals and snacks as well as drinks, you can ring the deli from your apartment and they will bring your order up to you. You are provided with a file in your apartment which contains pretty much all the information you need to know, in both English and German, such as a menu and phone number for the deli, info about settling the bill and the cleaning services as well as some other tips, such as where you can hire cars and where the nearest petrol stations are located.", "title": "spaciuos, modern, well located!", "helpfulness": 2, "user": "MusiBuenosAires", "date": "July 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17508492, "likes": {"liked": "— the spacious room", "disliked": "— cleaness"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The is a small patio area with picnic tables and a water fountain, which many apartments overlook. The apartment had all the facilities needed to self-cater , a fully equiped kitchen including a fridge with a freezer inside. There is also satelite TV and a Hi Fi system, and DVD players are available from reception.The only thing missing from the apartment was air conditioning, but it's not a noisy area so usually it's fine to just open the window or balcony door. I would highly recommend these apartments for pretty much anyone (there is a lift, and so is suitable for disabled guests).", "title": "Fantastic Place to Stay!", "helpfulness": 2, "user": "gailcarty", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 17372581}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The room is very spacious and moder, internet wi-fi was perfect. Mitte neighbourhood at 1 block.", "title": "Made our break extra special", "helpfulness": 2, "user": "zoe1m", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17262526, "likes": {"liked": "— The customer service", "disliked": "— small towels in the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Chose the Schoenhaus after a lot of deliberation, between this and the Ackselhaus and Adina apartments (have stayed in the Adina in Copenhagen which we loved). I am sure we made the right choice. This is a really workable and cosy place. We had a one bed apartment in the new building - on the top floor. The bedroom was huge, the living room/kitchen fine size (though a bit smaller than the lower floors as the balcony cut into the room space not added on). Bathroom small and not luxy (no bath but it seems its hard to find a bath in aparthotels in Berlin) but perfectly ok. Lots of hall space for buggy, good TV and DVD set up before we arrived (just ask when you book). In all it felt like home from home quickly.", "title": "just fab", "user": "twoplusonetravel", "date": "December 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22614134, "likes": {"liked": "— deli, locotion, place", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The location is great if you have kids - Kollwitzplatz is only 5/10 mins walk away and has a playground (more English speaking kids than Germans it seemed!) and many child friendly pavement cafes around the square. The main sites of the Eastern side of town (the museums) are walkable in less than half an hour - longer to the Brandenburg Gate and Tiergarten.", "title": "Spacious and quiet in a great location", "user": "hagggis", "date": "November 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21874722, "likes": {"liked": "— location and size of rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "What was perhaps most useful for a family stay was the deli/cafe. You can pop down in the morning and get a breakfast to take up, and they do very nice pasta until 8pm or so, again you can take it to your flat to eat in. Made it really easy not to have to plan every meal and know that there was always a last minute option. supermarkets are v close.", "title": "OK", "helpfulness": 1, "user": "BonnieMax", "date": "November 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 21468478, "likes": {"liked": "— Safe money and cook", "disliked": "— Room not beening cleaned"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "would reccomend daytrips to potsdam and wansee via train. and dont miss the interlocking courtyards", "title": "Amazing!", "user": "OrenmontrealQC", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20998377, "likes": {"liked": "— The location & the poeple"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "The three of us stayed in the deluxe room for three nights. Perfect location for art galleries and nice bars nearby (Erdbeer for the win). White Trash Fast Food is so near that you will manage to find your hotel room no matter how smashed you are.", "title": "Fantastic apartment", "helpfulness": 1, "user": "fairfieldrisers", "date": "August 3, 2008", "detail_rating": {"front_desk": 4.0, "location": 4.0, "value": 5.0}, "id": 18575017}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I was more than impressed with our stay at Sch apts. The location is fantastic, on the border between Mitte and Prenzlauer Berg. For those who only know Mitte, I would whole heartedly recommend heading into prenz-berg. Kastinallee, Kollowitzplatz etc.", "title": "Great apts, great location, great price", "helpfulness": 3, "user": "dublinminx", "date": "February 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13526813, "likes": {"liked": "— size, cleanliness, location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The apartments themselves are clean, very spacious, have every ameniety. The staff are very helpful, speak perfect english, and the cafe downstairs has great food.", "title": "Liked it!", "helpfulness": 2, "user": "BIFtommy", "date": "February 1, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 4.0}, "id": 13164791}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "There is a great choice of bars/restaurants/nightlife close by. Unfortunately Im not a huge fan of german food, so our choices were more international.", "title": "Pleasantly Surprised!", "helpfulness": 3, "user": "down_to_earth_2", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11295056, "likes": {"liked": "— Friendly staff and great location", "disliked": "— TV was in the bedroom part rather than the living area"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Some of what we liked: Scotch & sofa is a great local chilled bar, a little up into prenz-berg. We made this our local. A short cab ride into prenz-berg, 'The bird' is a U.S style steak restaurant, with some of the best we've tasted.", "title": "Will Stay Again & Again & Again", "helpfulness": 5, "user": "lorimyers", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10079112, "likes": {"liked": "— All the comforts of home.", "disliked": "— Nothing, it was perfect."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "White trash fast food, directly across the road. This has decent westernised food, with live music every night. Staff are a little unfriendly, but we found it worth the perserverence", "title": "Fantastic", "helpfulness": 5, "user": "Sharanne F", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10062065, "likes": {"liked": "— Location, facilities", "disliked": "— No lift"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 7, "average": 12, "very good": 87, "terrible": 3, "excellent": 153}, "aka": "Schoenhouse Apartments Hotel", "slim_ranking": 0.0726643598616, "description": "Feel like having a cup of coffee whenever you like? Want to work in privacy?Fancy having dinner without dressing up? Would you prefer havingyour own home away from home rather than justanother anonymous hotel room?The SCHOENHOUSE APARTMENTS offer lots of space and all expectedamenities in an attractive atmosphere."}