{"user_rating": 2.5, "review_count": 59, "name": "Scotty's Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Stayed here as a child every summer, some recent reviews scared me. However, I was very happy with our stay. I have to say not much has changed since the early 70's of my youth, but that isn't neccessarily a bad thing. Our room was clean and well tended.(#43) No odors, mildew, bugs or any of that (as previously complained about). Snack bar has good munchies (make sure the girls are cooking) at reasonable prices. Short walk to town. Pool reasonably clean, except for sand on the bottom. Stayed with 1/2 dozen friends & had a blast ! Fireworks awesome. I have seen the lake cleaner, but still beautiful. Filled up to capacity over the weekend, not exactly a desirable crowd though.", "title": "Pretty Good !!", "user": "Looo", "date": "August 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37001540}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Scotty's offered a great location downtown where my family an I could walk to the shops and pick a different restaurant every day. They had both beach and pool, as well as a pretty well equipped snack bar.", "title": "A fabulous family basecamp", "helpfulness": 2, "user": "droberts01748", "date": "August 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 19045438, "likes": {"liked": "— Good size rooms.", "disliked": "— Very dated. Needs to be updated soon."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2005, traveled with family", "text": "The property is definitely showing its' age and will take you back to the 70's. We had the 3 room efficiency and enjoyed all the space, double bathrooms, charcoal grill and TV with DVD player.", "title": "What a Dump", "user": "autostop", "date": "August 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 18604726, "likes": {"liked": "— Location", "disliked": "— Room smelled like mildew"}}, {"rating": 1.0, "title": "Horrible Place--Don't Stay There", "text": "Being just on the edge of downtown we didn't get caught in the vicious traffic people just two properties over had to deal with.", "user": "teebNy", "date": "June 30, 2008", "id": 17383152}, {"rating": 4.0, "title": "right place for the right price", "text": "A big plus was that we could watch the fireworks (seems like a weekly event) right from the hotel beach.", "helpfulness": 1, "user": "spyslick1", "date": "September 2, 2007", "id": 8608747}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Terrible place. Dirty, rodents, bugs, rundown. Lakeside beach was filthy.", "title": "Stay Away from this Dump!", "helpfulness": 3, "user": "tkilly", "date": "September 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 77871767}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Steer clear!", "title": "RUN!!!", "helpfulness": 4, "user": "dachshundmom04", "date": "August 31, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 77738385}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "This place looked soooo cute in the literature they sent me. Unbelieveable lakeside location, pool, arcade, playground, snack bar.....sounds like heaven, right? Well, it turned out to be HELL!!!! Rooms were small and old, old ,old. Dreary and dim lighting inside and out, like they didnt want you to look too hard at your surroundings. Questionable clientele with beer bottles eveywhere. its such a shame that the beach was a giant ashtray, cigarette butts everywhere! Same for the pool area. WHY??? Staff shouldn't allow it or rake the beach at night. Most games in arcade were broken. Snack bar resonable, though. It seems like the staff has given up, no pride is taken in this place, which is a shame given the superb lakefront location. Couldn't leave this place fast enough.", "title": "Scotty's is what an Adirondack tourist destination is all about", "helpfulness": 1, "user": "PJBNewYork", "date": "June 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 68593362}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I stayed at Scotty's about 25 years ago. I remembered that it had a great lake front location and was in walking distance of downtown Lake George. Those were two of the things my family was looking for on this trip. The other was a pool, so Scotty's was our choice. We were not disappointed. Our two-year old had a blast playing on the beach and there was enough room that he was able to run around without us having to be right behind him all of the time. They had a snack bar right by the beach that made it convenient to get a quick breakfast or lunch. The rooms are very much Adirondack motel-ish and were very clean and comfortable. For about $100 a night, you won't find a place that offers as much value as Scotty's. We would definitely stay there again.", "title": "Quaint Charm", "helpfulness": 1, "user": "hags27", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 64622300}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "If today's high-tech, plastic world of smart phones and overpriced resorts appeals to you, then maybe you should stay somewhere else. But if you are into an affordable, clean family vacation, and being on the lake and near the downtown area is what you want, then this is the place for you. Personally, my family and I will continue to patronize Scotty's, year in and year out, because, quite frankly, they keep the rates reasonable, the rooms clean, and the Lake George vacation what it should be - a memorable time in the country.", "title": "Best Property in Lake George", "helpfulness": 3, "user": "kitterkat66", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39505254}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I was happy with the stay at Scotty's. The place is old and could use a bit of a facelift. The pool was clean and so were the rooms but the rooms needed to be a little more modern. There was no vanity in the bathroom, no luggage rack and the shower stalls too tight. If you have young children or teens it's perfect. They have the lake, dock, play area, pool and arcade for entertainment. They have a snack bar but it's overpriced. But you must expect that for convenience. They had 3 very old picnic site type BBQ grills that need to be replaced. But if you bring your own, it accepted as long as you BBQ off your porch. I spoke to other guests who were happy and have been going back for over 5 yrs now. I wont complain for the price.", "title": "Great for families", "helpfulness": 1, "user": "LisaTaz48", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115967788}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Time hasn't been good to Scotty's Motel. You can see where this was once a glorious upstate NY destination in it's heyday. The beach/dock access and views of the lake are magnificent. With that said, the current overall look and feel of the place is rundown, like everyone has stopped doing any improvements or investing any money into the property. We stayed here in June 2011 for the NYS Firefighters Parade/Convention and I was surprised at how many rooms were available during a weekend where it's usually very hard to find lodging. It was a ghost town at Scotty's while every other place in LG was hopping.", "title": "Not Bad but Not Great", "helpfulness": 2, "user": "funhole", "date": "July 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 4.0, "service": 2.0}, "id": 115870048}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Scotty's has a few things going for it: Excellent location (walk to town) and lake front access/views, ample parking in front of your room and cheap rates. The rooms were clean but very dated and haven't been updated since the 70s. Our door was warped and required a good kick to open it which I'm sure woke up everyone in our area when we got in for the night. There's a monster 1970s air conditioner in the room which worked fine but was very loud.", "title": "Decent family environment. Clean but not fancy.", "helpfulness": 1, "user": "Mauricethibodeau", "date": "July 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115748918}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "There is a pool onsite and beach access with lounge chairs. The beach was nasty and covered in this black seaweed piled several feet high which was a shame because it could be a nice beach if someone raked it once in awhile. There's an arcade and shady bar on premises also. Overall, this is a typical upstate motel in the Adirondacks that is outdated and living off it's former 1950s reputation. I'm sure it was nice back in the day but it's just average now. The place served it's purpose that weekend as a place to crash but that's it. I wouldn't want to stay more than a night and was ready to head home when the second night rolled around. It's too bad. It could be a real nice getaway if someone took care of the place. The positive reviews are probably based on past memories and good times and not current conditions. We'll be staying somewhere else next year.", "title": "Great Family Motel!!", "helpfulness": 1, "user": "lynn4071", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113565771}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Had a family reunion with 38 people staying at Scotty's for a Friday and Saturday night. Property could use some renovations but was clean secure and adequate. Very family friendly especailly for kids. Enjoyed our stay and would do it again.", "title": "home away from home!!!", "helpfulness": 4, "user": "lilacmoon", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113070987}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Just got back from Scotty's after 3 nites. This place is great for families with children ages approx 16 and under. Yes this place is dated and could use a facelift, but then you would be paying a whole lot more. Positives: It's close to the center of town (10 min walk) Every room has a lake view from their porch. It has a large lake front with beautiful views(Much better then all the other motels I looked at) The kids loved the pool which has a 3ft section and an 8ft section( Bring your rafts and beach balls, nobody bothers you about it, which is nice). It has the cheapest rates around. The rooms were clean. It has a boat launch which one of the guests told me was cheap. An arcade adjacent to the bar( so you can keep the kids occupied while enjoying a cold beverage while watching a sporting event) I found the staff very friendly. The rates are fairly cheap compared to other motels on the lake. They have a playground which the kids loved. The bar has a pool table and an electronic dart board. The bartender was nice and friendly. They sell discounted tickets to Great Adventure and Water Slide World. Small refrigerator in every room. World. Negatives: The rooms are older with wood paneling and blue carpeting. There is a slight musty smell in some of the rooms but not too bad. Their beach could use a raking in some parts .(my son loved making sand castles). No coffee pots in the room. The bar is only open Thursday, Friday and Saturday 4pm to approx 11pm. The bar didn't have many people so i can understand the hours. The beer and drink prices were pretty good. $3 dollars for a bottle of Budweiser. The clam infestation the previous post talked about pertains to all of lake George and not just Scotty's. The lake is safe to swim. We observed many people in the lake. The Bottom Line: If your looking to have a great time with your family without having to spend a lot of money and if your looking for a nice pool and being close to town; this place is for you. If your a picky person seeking a modern room with modern amenities and money is no object; You should try somewhere else.", "title": "Great for Families", "helpfulness": 1, "user": "JimboF", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 138593276}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This motel is the worst place that I ever stayed in. No wonder why they don't show what the rooms look like on their website because they are horrific. I should have known better to stay at a place where they don't show what the rooms look like. When we arrived at the motel the people were not friendly at all. When we arrived at our room we were mortified.It was tiny and it smelled like mildew. I wish we could have went somewhere else. But I told my kids and myself that it's just for the night that I we wont be in here long. Well when we got back to the motel, after a long day of fun activities, all we wanted to do was to sleep. But when we lifted the sheets there was a spider in one of the beds. I was so grossed out but there was no one else in town that had vacancies. we were kind of stuck here. Good thing we brought blankets from home. We wrapped in the blankets afraid of what else might be under there. After a horrible nights sleep we woke up to take showers. The bath room is small for 6 people. The nozzle to the zink sprayed all over the place so we had to keep it on a little stream. The shower was the same. There was no shower head just a pipe hanging out of the wall. and the water coming out, came out in spurts. and then soaked the floor because the nasty showers liner was to short. After the struggle of trying to shower 4 kids and 2 adults we were ready to leave. We checked over the room and made sure the kids had all their stuff. When looking on the floor we noticed that under and near the beds were crumbs and other nasty things left behind by previous people who rented there. Apparently they don't vacuum, dust or clean that place for cobwebs. My son found a worm in his room. Yes a worm. By that time I just wanted to get out of that place. I told the lady at the desk and all she said was I will let housekeeping know. Really. Never would I recommend this place and if you are smart rent somewhere else.", "title": "Dirtiest motel ever!!!! Over priced!!", "helpfulness": 1, "user": "Totkins", "date": "August 27, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 138570367}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This hotel is disgusting! Unfortunately, my in-laws loved this place and I had the misfortune of staying here for weekend visits over three summers. It is located in the village, but you must walk up a very steep hill in the parking lot that we refer to as \"the hill of death.\" It's not so bad on your own, but pushing a stroller and toting a toddler make it unbearable. The hotel rooms are musty and dirty. They often have ant problems. They don't give you enough towels or TP. The showers are terrible. One year in the extreme heat, the a/c even conked out. The pool is shabby. The playground is about the only redeeming thing about this dump of a hotel! The worst part is that the hotel is expensive! if for some reason you must stay here, choose the rooms closer to the lake towards the back of the hotel. They must have gone through a mini-renovation and are poor, not terrible! Also, the staff is not friendly. There was a bartender at the bar/concession stand who was confrontational for no reason. Lake George is not about luxury. Many of the hotels are dumpy and are just now going through renovations. This place needs to be renovated, as it is by far the worst of the worst. Thank God we discovered another hotel to stay at when visiting Lake George!", "title": "Ick!!", "helpfulness": 2, "user": "JuniperJenny4", "date": "August 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 136990818}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This was the worst Hotel stay I've ever experienced. The room Reeked from foul odor. It was filthy. The bathroom door wouldnt even close in room 44. The neighbors T.V. blairs right through the cheap paper thin walls. Part of the beach was closed due to infected water due to Asian clam infestation. (No Kidding). We stayed 3 nights the last weekend of July and the place was about 20% full, yet everyone was crammed all the way at the end directly next to each other. whenever we called the front desk for attraction information , it was though we were bothering them. On our last day one of the owners nearly got into a physical altercation with a guest and his wife for using the boat ramp without properly registering with the front desk. At checkout , not even a thank you! or how was your stay! or was everything o.k.?", "title": "Never Again. Stay Away!", "helpfulness": 1, "user": "William m", "date": "July 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 135843215}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "They should've paid us to stay here.", "title": "Ugh! Never again!", "helpfulness": 2, "user": "Shaye W", "date": "July 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 134328067}], "location": {"country": "United States"}, "variance": {"poor": 5, "average": 3, "very good": 15, "terrible": 27, "excellent": 9}, "aka": "Scotty`s Hotel Lake George", "slim_ranking": 0.841463414634}