{"user_rating": 4.5, "review_count": 236, "name": "Scottsdale Marriott at McDowell Mountains", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Arrived early around noon and they were able to get us into our rooms. The suites are spacious and very clean. Desk help was very friendly and informative. Check out was easy. They were decorating for Christmas which was very nice. All staff were friendly and eager to help with any questions. Ground were immaculate.", "title": "Pleasant Stay", "user": "Virginia D", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147372033}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The one thing you have to give Marriott credit for is that you usually are not surprised by a really bad hotel. Despite Bill Marriott stepping down as CEO, standards that Marriott are well known for will continue.", "title": "Another Nice Consistent Marriott Hotel", "user": "1Gman1", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147241192}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I was at this hotel for a two day business trip and was out of the hotel most of the day into the evening hours. I agree with other reviewers that the bed was probably one of the most comfortable I have slept on in a hotel. The suites are nice sized, the rooms have the usual Marriott amenities, and I like the fact that you can either use the comp parking lot or valet park. Staff all made a point to smile and greet you wherever you were in the hotel.", "title": "Very peaceful", "user": "E B", "date": "November 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146442661}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This is the hotel to come to if you need to get away from the hustle and bustle. The hotel feels like you're on the edge of town. It's quiet and serene and very enjoyable. I would recommend coming here with family or a business trip. Wake up early. Phoenix is the place to watch the sun come up and especially for the calming effect it has before you begin your day.", "title": "Marriott McDowell in Scottsdale - Very Nice!", "user": "brodgekc", "date": "November 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145901889}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This hotel is very nice and clean and reasonably priced. The hotel is very pretty with views of the TPC golf course. Marriott Gold Members will receive comped internet and buffet breakfast which was very good and in a beautiful setting.", "title": "Marriott Scottsdale McDowell Mountain", "helpfulness": 1, "user": "infrequenttaveler", "date": "November 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145856499}, {"rating": 4.0, "title": "Scottsdale trip", "text": "Very nice hotel. Only downside was the Wifi. Too weak of a signal. Rooms are nice and the beds are very comfortable. Beautiful area. Nice breakfast buffet, with an omelette bar. Try to stay on the north side as there is a private airport on the south side and small planes are always coming in. It's not too noisy, but could get bothersome.", "user": "AmMaxwell", "date": "October 25, 2012", "id": 143689855}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This is a very nice hotel. The rooms are huge with a sitting and office area where you can relax and get some work done outside the bedroom. The area around the hotel mainly a golf coure) is beautiful. Out the front door on the horizon is a beautiful mountain range. Theres also plenty of restaurants and activitites near by. I actually ordered roomservice both nights and it was very good. I was here for a work conference and the facilities were very good.", "title": "great rooms beautiful area", "helpfulness": 1, "user": "mjlynch", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143203211}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "This was the first time I have ever stayed at a full Marriott. I was given the corner room with a usable balcony that overlooked a courtyard. I found the room to be nice, and the bathroom was extra large with separate tub and shower. The shower was very nice, extra large with an excellent shower head. The bathroom floor was a little dirty when I arrived, some lint and a couple hair/dust balls, which I found surprising. I wish I had taken a picture of the shower, since there are none, but the posted photos are pretty representative of the hotel.", "title": "Pretty and I would come back. Wifi could use some work.", "helpfulness": 1, "user": "nickleec", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 141873872}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "A lot of people have raved about the bed, and I would agree with that assessment. The bed was very nice, and I really liked the suite layout.", "title": "I go out of my way to stay here", "helpfulness": 1, "user": "LKYI3", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141408913}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "The morning breakfast was competitively the best part of the experience. It was a full fruit bar (blackberries, blueberries, strawberries, pineapple, oranges, banana, etc), a full continental setup, and to-order egg and waffle stations. However, the price was normally $20 per person and I would have gone somewhere else if it was not complimentary.", "title": "Nice hotel, but under construction", "helpfulness": 4, "user": "JPK111", "date": "August 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 138165341}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "My wife and I have traveled to Scottsdale many times but this was our first visit to this Marriott property. We traveled with friends and family to attend the Barrett-Jackson Auto Auction and we delighted to find this Marriott property was close and convenient during our stay in town. The staff were friendly, helpful and seemed to know many of the guests staying here. The property neighbors a golf course and a golf resort and is just a few minutes from all the auto auctions, art festivals and of course-shopping. Very little noise filtered in to our room during the night and it was only when a private plane was on approach or takeoff that we knew there was an airport nearby. Our room was spacious, the bathroom was clean and although the decor was somewhat dated, the hotel was well-maintained. The property is higher-priced than what we might normally choose but its location simplified our visit and made our travels short and easy to navigate. We will consider staying here again when our travels bring us to this part of Scottsdale.", "title": "First Time was a Good Time!", "helpfulness": 1, "user": "GOmaha", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150289467}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The staff were nice and the outdoor area and pool looked quite nice, but the room itself was very tired and disappointing, especially for a Marriott which is supposed to be 4 stars. I would rate the room as 2 stars. The worst part was that there was some kind of air conditioning or ventilator running on the bathroom constantly, even with the lights off, and the noise made it impossible to sleep until I turned off the A/C and closed the bathroom door. The staff had no idea what to do when I called reception so I had to figure it out myself, but they were quite nice and would have told me what to do if they knew, but it was late and the maintenance guy probably wasn't there. Reception was nice enough to not charge us for internet, which was about 12.99 a day I think, for the trouble we had, and staff service is the only reason I'm rating the hotel 2.5 stars instead of 2 (since I can't actually rate 2.5, I've rounded it to 3).", "title": "Nice staff, but tired room and constant bathroom extractor running", "helpfulness": 2, "user": "Firestarryl", "date": "January 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 149992087}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "If you do stay, make sure they don't give you a handicap accessible room. We somehow ended up with one without requesting it, maybe reception thought they were being nice, but the there was no door to the bedroom, and the only place to hang your suits was a rail in the bathroom.", "title": "Great location (particularly close to Scottsdale Airport) and nice price for a business trip", "helpfulness": 1, "user": "MikeN_Omaha", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149903155}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I stayed here on two different occassions this past December. The rooms were very large (with a separate living area) and quiet and reasonably priced. The staff was also very friendly. Note, the hallways are very long and meandering. A good way to get your steps in for the day!", "title": "very much a mixed bag", "user": "tcarps", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149646290}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "I stayed 2 nights here this weekend. The good news: the grounds are beautiful, the location and rooms are quiet despite being near the Scottsdale airport, the rooms were large and clean, and the staff were very friendly. On the other hand, the mattress was very soft, lumpy, and uncomfortable on both beds, the linens were thin and scratchy, the towels were threadbare and coarse, and the shower head was below eye level (I am 5-10), forcing me to stoop to wet my head. The breakfast tasted much worse than it looked and even my teenaged son wouldnt eat the rubbery sausages and dry crumbly bacon. Overall, not a terrible place to stay but the details were disappointing, especially in contrast to the setting.", "title": "Comfortable and Peaceful", "user": "SMDTraveler", "date": "December 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147411985}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at this beautiful hotel in mid October and was pleasantly surprised. My room was comfy,quiet and beautiful. Although it was a bit too cool to swim, the pool area was very nice and I enjoyed a lovely evening watching the sunset on the patio. I would definitely come back and hopefully get to stay longer next time.", "title": "Quiet Luxury", "user": "Shotlady27", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 144887442}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed at this hotel for three nights while attending a family wedding that was held on the premises. Our room was spacious, attractive, and extremely comfortable, with many minor felicities that enhanced our stay. The staff was uniformly pleasant, and every request was accommodated. We had no complaints whatsoever.", "title": "A very comfortable place to stay", "helpfulness": 1, "user": "Limmson", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144765856}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed at this hotel in late October of 2012. We usually stay at the Four seasons or the Marriott Dessert Ridge. While it cannot compare to either of those resorts, the Marriott at McDowell Mountains is a pleasant clean comfortable Hotel. The only negative was the long walk to and from our room to the Parking lot. Seems to be geared toward Business meetings as there were several going on during the 3 days we were there. These groups pretty much took over the bar and patio areas.", "title": "nice, clean, relaxing hotel", "user": "Chuck B", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 144575109}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Nice hotel and great cookies at the counter. Staff was really pleasant and smiling everytime I was around. Must have good management as it seemed all staff members were happy. Clean room and clean bathroom- most important for business travel.", "title": "Quick Business Trip", "user": "Dannysreviews", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144072126}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This is relatively new looking resort relatively far from Old city or downtown Scottsdale. It is next to gold course and a very average swimming pool. It is close to Scottsdale Square which had some cool restaurants and shops. and few other malls.", "title": "OK resort in Scottsdale", "user": "Exoticsense", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 143956305}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 7, "average": 26, "very good": 85, "terrible": 1, "excellent": 117}, "aka": "Scottsdale Marriott At Mcdowell Mountains Hotel", "slim_ranking": 0.341772151899, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Attractive desert resort on palm-studded grounds, with scenic views of mountains and the Sonoran Desert."}