{"user_rating": 3.5, "review_count": 273, "name": "Scottsdale Thunderbird Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "So grateful a friend steered me to the Thurmderbird. Every staff member I encountered was friendly and accommodating. Good sized room with great layout didn't hurt either. Can't wait to see the new workout facilities next time I'm in town. Wouldn't stay anywhere else. Location was just perfect too. Right in the middle of everything!", "title": "Perfect location and excellent staff", "user": "Tayloredfit", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160259407}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Booked thru Priceline's 'Express Deals' so got a good price without having to bid. The $65 price included free breakfast, free parking and free wireless. The room had a large bedroom with TV plus a living room with TV and a kitchenette with microwave and frig. The location was great - close to shopping, restaurants and entertainment. The staff were very friendly and helpful. My only complaint was I could hear very clearly when a toilet was flushed in adjoining rooms. All in all, tho, it was a great deal for the money.", "title": "Great for Price", "user": "PrescottKaryl", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159753872}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "stayed here during high season (March). Location was in N. Scottsdale and close to restaurants and shopping. Price was reasonable considering it was March. Hotel was older and the bathroom was small, but service was good and the free breakfast was more than adequate. I spoke with the manager and he seemed to be a person who really cared for his guests. Would definitely stay here again.", "title": "good location - decent value", "user": "jrmPeoria", "date": "April 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158779983}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I stayed one night. On a Sunday. I had a one bedroom suite.", "title": "a great place at sometime in its past.....", "user": "menelson2001", "date": "April 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 158536681}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "the place was relatively clean. they could have done a better job vacuuming. The important areas- bathroom and bedding were immaculate.", "title": "Pros are better than the cons are bad....", "user": "TrishN67", "date": "April 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 158374079}, {"rating": 2.0, "title": "Great place, but housekeeping is evil", "text": "Comfy beds. Quiet property. Clean and friendly. The only problem is housekeeping DOES NOT HONOR THE \"DO NOT DISTURB\" SIGNS ON THE DOOR!!! This has happened to me the last few times I've stayed there and needed to sleep in. Despite notifying the front desk AND putting the sign on the door, housekeeping bangs on the door and less than 2 seconds later tries to get into the room, not even giving the people inside the room to even TRY and answer the door.", "helpfulness": 1, "user": "Flix35", "date": "April 20, 2013", "id": 158323862}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "If it was not for the disrespectful housekeeping personnel, I would've given this a 5 star rating, but I have a serious problem when people barge into my room.", "title": "Cozy and Clean", "user": "Kay N", "date": "April 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157401957}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "We spent last week at the Thunderbird Suites. Our room was very clean. The complimentary hot breakfast was nice. The pool area is maintained very good. It's within walking distance to Scottsdale Quarters and the Kierland shopping areas. There are plenty of restaurants to choose from these two areas! The staff was friendly and housekeeping was very accommodating.", "title": "Poor Poor Poor", "user": "GarthH193", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 157370116}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I had to respond after the \"manager\" ripped one reviewer stating that they have never had their room rates for over $200 and that it was because they used a \"third party\" to book. Well that's crap, we also paid over $200 a night......well it was like $189 plus tax.....so ya...over $200 a night for four people in a room, paid DIRECTLY to the hotel.", "title": "Thunderbird suites", "user": "Robert B", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156534940}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "And yes that reviewer was correct, for two bills, the room and hotel WAS NOT worth while. The hotel was old and apparently was renovated.....NOT!!!!! The breakfast was disgusting and the pool was the size of a bathtub.......anyways, I will NOT return.", "title": "Well worth it", "user": "Doyle1121", "date": "March 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156024711}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I have never had such exceptional service from a hotel. When we arrived shortly after midnight we were checked in, I went to get the family and bags from the car and he had gotten the elevator for us and then when we stepped off the elevator there he was to open the door and point us in the direction of our room. The service was like this for our entire stay. The lobby, restaurant, courtyard etc were new and fresh. The only downside to this hotel was the room was a bit weathered/dated but from what I understand they are in the process of renovating. It was clean and the beds were super comfortable. I have never been able to sleep well in a hotel, but had no problems here. There was a hot breakfast, which was good and switched up every morning. They also had an assortment of fresh fruit and yogurt, pastries, oatmeal, cereal, toast and bagels. I was very happy with my stay at this four story hotel. But until the renovations are done if you are more concerned with the asthetics of the room over service, comfort, and cleanliness, probably not the place for you.", "title": "Best service I have ever received", "user": "Shawna3925", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154867445}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We stayed at the Scottsdale Thunderbird Suites on a recent golf trip/guys weekend. We had two \"suites\" side by side on the second floor of the three storey complex. The hotel is in an industrial area next to the airport in north Scottsdale although there are some shopping and restaurant choices within a 5 minute drive.", "title": "Disappointed, especially in the value for your money.", "helpfulness": 3, "user": "Shelly_Maynes", "date": "March 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154404133}, {"rating": 2.0, "title": "Left after one night", "text": "We paid over $200 a night for each of the suites per night and as such I did have somewhat higher expectations than what the 3 star accommodation offered. Although it is evident that the hotel underwent renovations at some point, it still had an old somewhat run down feel to it. The room consisted of two double beds in a separate back room and a pullout sofa in the front room with a kitchenette type area (small fridge, counter and sink). The sofa bed, which we had to make use of was pretty much unusable due to the age and it being so uncomfortable. This was evident in both rooms. To top it off, at 1 am in the morning after getting back to the hotel, there were no linens for the sofa bed and we had to go down to the front desk and get them, then make the bed up. The double beds were rather comfy however.", "helpfulness": 2, "user": "myanke2000", "date": "March 9, 2013", "id": 154088578}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The breakfast was adequate and had some warm choices, fruit and cereals along with toast and pastries. Overall service in the hotel was adequate as well, nothing notable but nothing concerning.", "title": "Not Good", "helpfulness": 2, "user": "Kimberly B", "date": "March 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 153446648}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I was disappointed with the quality of the hotel and expected a lot more for the price paid, although I understand it is in the Scottsdale area where prices/costs tend to be a little higher, it was by far the worst accommodation of my 4-5 visits to the area, especially for the value for the money. Had we paid half the price I would possibly be able to recommend a stay but unfortunately I am unable to do so.", "title": "Perfect location", "user": "BabsX8", "date": "February 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153223173}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "After reviewing the back to back negative reviews I was compelled to write an unbiased review. We travel on business throughout the country and have basic expectations no matter the location. We assess the property based upon amenities offered and promised, location, service and overall comfort and price.", "title": "Difficulty assessing current reviews", "user": "creativeconsulting", "date": "June 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 162791534}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The only critique we can agree with is the small bathroom.", "title": "Dirty, scary, stay away!", "helpfulness": 3, "user": "Betty T", "date": "May 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 161929356}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "The room offered a suite with pullout couch separate from main room which is a plus.", "title": "Worst.... Worst... Worst... No more words to describe", "helpfulness": 4, "user": "Ashley M", "date": "May 21, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 161400248}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The hotel is in proximity to Keirland Commons.", "title": "Not a safe place to stay in", "helpfulness": 5, "user": "MeherIllinois", "date": "May 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 161200984}, {"rating": 1.0, "title": "Burglary in the hotel", "text": "There are very few properties in Scottsdale Arizona that offer the same amenities for the price anyone can acquire via online app. The pool area accommodates and is commensurate with the number of rooms.", "helpfulness": 8, "user": "Sha S", "date": "May 13, 2013", "id": 160574516}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 27, "average": 40, "very good": 89, "terrible": 25, "excellent": 92}, "aka": "Scottsdale Thunderbird Hotel Scottsdale", "slim_ranking": 0.73417721519, "description": "Newly renovated lobby, restaurant, and meeting space (October 2011). Scottsdale Thunderbird Suites features 120 deluxe 2-room suites - each suite has been refitted with an upscale Kimball furniture work desk and Herman Miller ergonomic chair. All suites offer a separate bedroom with a King or 2 Double premium Simmons pillow top mattresses, and living room areas for increased privacy. Each comfortable suite offers plenty of room to work or relax, with complimentary wireless broadband access, voice mail, data ports, two televisions, microwave, refrigerator, and coffee maker. All rooms overlook the beautiful courtyard and heated pool/spa. All guests receive a complimentary hot breakfast daily. Shuttle service is available on request within a 5 mile radius during business hours."}