{"user_rating": 4.0, "review_count": 55, "name": "Sea Gull Condominiums", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Nice location as it is only about 10 mins. to Port Aransas and great beach location, but the condo is showing it's age. Needs painting, wood replacements, etc. Great views of the gulf and nice size 2 bedroom condo. I don't think PA is anything to admire as the town is small, shows it's age, not good restaurants and the beach water is grey. I would head over to the Gulf Coast of Florida if I were you. It was nice to have a descent size pool to go to.", "title": "Nice location, showing age", "user": "coltsstl", "date": "May 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 64220396}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We lucked upon Sea Gull Condos in Port Aransas several years ago after trying several other condos in the area. We have never stayed anywhere since but Sea Gull. Why? Not only are the units awesome with gorgeous views, but the staff is way above others where we have stayed. The sales and management office are especially great. While we do not own a condo, we are treated first class since our return visits (along with the first). It only gets better.", "title": "Best Condo on the Texas Coast", "helpfulness": 2, "user": "Tiffanys_Travels", "date": "January 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53500082}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We have stayed lengths of 3 days, a week, and even a month over the years. Our family members have also rented units. We are all treated as \"valued\" customers.", "title": "Great view!", "user": "ditexas", "date": "November 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49018202}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "While it is mainly my husband and I on trips, we favor the 3 bedroom units as we love how the master overlooks the ocean which the 2 bedrooms don't. It is worth the extra money to us, especially if we are staying a week or more. While we cannot be guaranteed a specific unit, we can always trust that Sea Gull will try to find us the best accommodations available for our needs. And, over the years, we have also discovered our own favorite units.", "title": "Sea Gull is the place to be!!!", "user": "dfb1958", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 29499301}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Sea Gull is way above other hotels or condos.", "title": "Back again for our second anniversary...", "helpfulness": 1, "user": "mrsdrury", "date": "February 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 24641710}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I have to add my comment in response to some negative reviews I noticed. My family has rented at the Seagull since the late 80's - probably 20 or more stays in all. We've NEVER had a bad experience. Over the years seen the staff cooly handle situations ranging from power failures to a freak tornado which came right through the property (broken glass; family moved to an unaffected unit; no problem!) This place is perfect except for the lack of a proper fish-cleaning station... (but you can take your catch and sneak over to the SandPiper next door - they have a beautiful gazebo-style screened fish-cleaning set-up!) But here's what's great about the Seagull: in all the units, you are right on the beach in a well-appointed living space with a balcony set up for a truly great view. If this is what is important to you, consider booking the ultimate experience in the three-bedroom units high up in the building - the ones with numbers ending in \"5\". Those floor plans are V shaped with balconies looking north toward Port Aransas AND South toward Packery Channel. The glass walls of the living rooms in those units open on to both views so you can take in the whole beach front of the entire island. You and your family will feel like kings of the world! Sorry some guests have had these strange experiences - nothing remotely bad has ever happened to us. Can't wait to spend January 2009 in unit 1205!", "title": "Another great get-away at the Seagull", "user": "fisherminstrel", "date": "December 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22389904, "likes": {"liked": "— Close beach proximity, spectacular views, clean well maintained grounds, beach, great fishing", "disliked": "— No fish-cleaning station"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Our family vacation was a total sucess at Sea Gull!!! We were booked for another property on Mustang Island, and upon our arrival we were told that they had over booked and we no longer had a room. I was nearly in tears as we had traveled almost 7 hours to get our vacation started. We drove a little further up the road and found Sea Gull. Even just driving up to the entrance lifted my spirits - the landscaping is gorgeous! The ladies at the front desk were wonderful and so friendly to me and my family. They worked a little magic and were able to fit us in. Our room was beautiful and the view was breath taking! Coming back down through the lobby to get to the beach we saw the sign up for KIDS ACTIVITIES!!! My three kids were thrilled - and when they are happy, I am happy! They had so many activities to choose from each day and Ampy, the activities director, was so friendly. My kids were so proud of their painted t-shirts and all of their crafts to take home as souveniers of our best family vacation! We love Port A and we will make our return trips to Sea Gull. This is the place to go in Port Aransas if you have kids! And great for the grown ups too! A special thanks to all of the staff at Sea Gull for being so friendly and helpful to us - we will definately be back.", "title": "FAMILY FUN!!!", "user": "SeaGal03", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19346627, "likes": {"liked": "— The view and the kids activities", "disliked": "— no complaints"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We rented condo #201 at Seagull.", "title": "Not Real Impressed!!!", "user": "broshane", "date": "July 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 18072822, "likes": {"liked": "— View and Beach", "disliked": "— Dirty, rundown and OLD!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Room- Our room was very nice and well taken care of. We reserved it on VRBO from the Janovyak's. Really Great Room.", "title": "Fantastic stay at Sea Gull Condo's", "helpfulness": 1, "user": "okfarmfamily", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18029477, "likes": {"liked": "— Location, so close to the beach!", "disliked": "— Nothing....loved it all"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Staff- The staff was totally useless. They seemed put-off at any little question. You couldn't get the front desk girls attention. There were 2 female employees standing right by the entrance smoking, as we were trying to leave. The smell was gross and they were totally oblivious to the fact, that they were employees and represented the Condo.", "title": "I loved it", "user": "Sunshyne537782", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13973012, "likes": {"liked": "— access to the beach!", "disliked": "— Its 10 minutes from town. Which didnt really bother me."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed at Sea Gull over a long weekend (Thursday-Monday), and had a wonderful time. At a charity silent auction last fall, I bid for and won a stay in a two-bedroom unit at these condos. We then reserved a second unit so that we could take our entire family, including grandchildren. This condominium facility is very well-run and the units are nicely set up with everything you need. The furnishings in both units were very nice and our kitchen, in particular, was great. We used our unit as headquarters and had plenty of room for our group to play games and have meals together in the evening. (And the AC's worked! We have had troubles in the past in various places in Port A with the AC's just not able to keep up with the heat and humidity.)", "title": "Fun Family Time at the Seagull Condos", "helpfulness": 2, "user": "HornsFan73", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113849265}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I like Seagull because its distance from town means there is much less vehicle traffic on the beach road (a concern when you have small children running back-and-forth). Every unit has a balcony with a gulf view; so, unlike some other properties, you do not have to pay extra to see the water! Also, the building itself is set very close the beach, so you have only a short walk on the boardwalk before getting to the beach. Makes it much easier to schlep your coolers, bags, etc. from your unit to the beach. And, best of all, they have cabana boys! Very nice young men will set up comfortable lounge chairs and sun shelters for you each morning and then you can keep yours all day. There is no additional charge except to tip the guys who help you. (I was especially happy about this, as we had driven off and left my beach chairs sitting in our garage at home.)", "title": "Perfect for New Years-Love Sea Gull", "helpfulness": 2, "user": "Topher1110", "date": "January 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91832415}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "I definitely would stay here again and would recommend it to others.", "title": "Felt like home, sad to leave.", "user": "MatthewATx", "date": "October 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 82715102}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My wife and I had plans fall through between Christmas and New Years because of flights. We decided to drive to Port Aransas so our 3 year old and 20 month old could play in the sand a little. the weather was to be in the mid 70s. We picked Sea Gull and did not regret it. We stayed in 406 and it was awesome. The condo itself was like a home away from home. Our own apartment. Living area and kitchen were spacious with updated appliances. Bedroom was comfortable. The view was incredible out the windows. Boardwalk and beach right below us. The staff was helpful with restaurants and ideas. Overall a really pleasant and relaxing stay. Will come here again next time.", "title": "Disappointing Stay at Sea Gull Made Right", "helpfulness": 3, "user": "okfarmfamily", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77986194}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My wife and I, our three children, and my Mom stayed in room 201 for a full week and it has been a wonderful experience all the way around. Friendly staff, closer to the beach than any other resort on the island, and a beautiful room. The kids and a room with two sets of bunks that the absolutely loved. The master suite has a magnificent view of the Gulf right from the bed. Aside from the up close views, it was very convenient to have such a short walk to the beach with all our stuff. The front bedrooms had a great view of the flats and this ubit is right above the pool.", "title": "Its really perfect place for vacation", "user": "Tutong", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74083893}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed in unit 905 which is a 3 bedroom condo in the center section of the building. This also can be rented as a 2 bedroom unit which is what we did. The \"L\" in the unit number means it can be rented one size smaller. (3 to 2 or 2 to 1 bedrooms.) The unit was furnished beautifully & the kitchen had all the appliances as most home kitchens. My only complaint would be there was no hair dryer. I'm sure I could have gotten one from the staff but since it was raining I could blame my bad hair on that. The location of the Sea Gull is further from town than most condos. I can see where this would be great in the more heavily visited times of the year. Having the pool in the front of the building (street side) means you are even closer to the beach. Out the lobby door & across the bridge over the dunes and you are there. Both the day & evening staff members were friendly and patiently answered all our questions on where to eat & how to get somewhere. We are already planning our next visit to PA and plan to stay at the Sea Gull again.", "title": "905L", "helpfulness": 6, "user": "kftw", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121811711}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We rented a 4 BR 4.5 bath condo for our family of 8. The room was outdated but the size and location made up for the room. We had approx 25 total guests in Port A for our wedding and all of us stayed on property. Every one had great things to say abt their condo and the property itself. The beach was amazing at the property, the water was perfect for kids and adults who didnt like to swim. Some sat in the water right at the beach with babies (it was only 2 -4 in deep) . It was clean and well kept.", "title": "Fabulous Wedding Weekend at an awesome property", "helpfulness": 2, "user": "spawithlisab", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118950956}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The only problem we had was that we were supposed to have had a beach gathering permit for the wedding, which was not told to us by the property. We also were told by the enforcement officer that we were in Corpus Christi and not Port A , out on the beach. I researched Port A for permit info, OOPS!", "title": "You can't get any closer to the beach in Port A!", "helpfulness": 7, "user": "Foreverett", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117406790}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Anyway, it was great, awesome views, beautiful pools, clean maintained grounds and very nice staff. The maids- were over the top pleasant, one even came up to see my wedding dress. Very sweet people!", "title": "Great place to stay on the beach", "helpfulness": 1, "user": "Alex99998", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116726643}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Recommended to all ages and interests.", "title": "Great view, clean condo, however check in delayed", "helpfulness": 2, "user": "esteves1", "date": "July 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115370332}], "location": {"country": "United States"}, "variance": {"poor": 6, "average": 4, "very good": 19, "terrible": 5, "excellent": 21}, "aka": "Sea Gull Condominiums Hotel Port Aransas", "slim_ranking": 0.526315789474, "description": "Mustang Island's Premier High Rise Condominium is located directly on the beach of the barrier island dividing Corpus Christi Bay from the Gulf of Mexico. The Sea Gull condos offer unobstructed cruise ship views of the water and of 27 miles of unspoiled beach. Port Aransas, only 8 miles up-beach, offers excellent dining, entertainment and shopping experiences. Entering the Sea Gull's lobby you will be greeted by attentive staff and a panoramic view of the Gulf and sand dunes. Venturing down the short boardwalk you will be overwhelmed by the beauty of the beach that extends on each side of the Sea Gull. It is then that you know... you have landed in paradise..."}