{"user_rating": 4.0, "review_count": 48, "name": "Seafarer Resort and Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Seafarer is a beautiful small resort motel with cottages and great view of Florida Bay. I've given it 5 stars based on my expectations and what they delivered. It is a cool 1950's era motel with some duplexes/cabins/villas closer to the water. The grounds are nicely landscaped with Flamboyant/Poinciana trees, Gumbo Limbo trees, Coconut palms, and more. During my stay for the nights of June 28 and 29 the Royal Poincianas were is full bloom. The atmosphere is very tropical and relaxed.", "title": "Two nights, wish there had been more time there", "helpfulness": 2, "user": "donOrlando", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167079126}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "The small beach area is great.....if you have a knowledge of geography and reasonable expectations. It has the warm shallow water, sandy area, palm trees and some awesome views of open water with mangrove islands in the distance. If you know where you are in Florida, you know you will not expect the beaches of Puerto Rico or New Smyrna. Instead, you will get the small casual beach area framed by coconuts and the calm waters of Florida bay. They also have kayaks, which would be perfect for exploring the bay and distant mangroves. All in all, the beach is very nice in a relaxed way.", "title": "What a great place to stay!!! Still smiling!", "helpfulness": 1, "user": "Madtown123", "date": "June 25, 2013", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 165256780}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed in Room/cabin/villa #4 which is a duplex. It had a long view down to the water, a tiki hut right outside, and is a good choice if you want a water view but don't want to be right down by the water. Probably a bit more private than the waterfront area. The villa is large with a beautiful wood ceiling. The duplex is cinder block and is clearly from the old days...which is a good thing. The living room has a couch, table, flat screen tv, and kitchen area. The windows are vintage 50's jalousies. There is an AC unit in the room as well as in the bedroom. The bedroom had 2 beds and an alcove/closet. The bed I used was very comfortable/firm. The bathroom was small, as typical for the era. It had a walled off shower area with small 50's tiles. There was no electric outlet in the bathroom. I used a cheap extension cord and the bedroom outlet. there is also an alcove/ open closet in the hall.", "title": "Friendly staff, cozy accomodations", "helpfulness": 1, "user": "Carl S", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 165194228}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The villa/cabin/room was very comfortable and was better than I expected.....nice view...good bedding and towels, and larger than needed. The wifi signal was great. I think in the next year/season they do need to repaint the interior and replace the couch as these are getting to the end of their life cycles, but were not at the point where they should be an issue.", "title": "rude and horrible place", "user": "lucia h", "date": "June 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 165075875}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I had some doubts on this place, since not too many useful reviews and guest photos. I am very glad I chose this as my base for the upper keys on the way down to Key West. I felt very relaxed here, welcomed by the owner, given a quick tour etc. I did not get any vibe, like a prior reviewer did, that anyone would be unwelcome. I certainly would never have stayed at a place that does not welcome all equally.", "title": "Last Minute Salvation!!!!", "user": "jdguillen25", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162908614}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Booked a room here at the last minute and was very lucky. The rooms are actually like small apts/ bungalows. I choose a double room but only came with a single bed, thankfully we were offered an upgrade to a queen room. Furniture is old & we did not have a headboard but everything is soooo clean that its not so bad. The shower was clean but stained around drain so I was hesitant to use it without wearing flip flops. Service by staff was top notch! Views from their small beach area were amazing... We even saw a manatee up close!", "title": "Amazing views!", "user": "edazLongIsland_NY", "date": "August 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 171185544}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "The location was great and the little beach right outside our room was awesome. Plenty of tiki tables, hamocks and sun chairs that were clean. There is a nice dock you can fish off of and they offer free kyaks! The rooms reminded me of a cement hippie compound and wifi was unreachable. We think the bed was a broken futon the was unbearable. We went to bed late and after several hours of extreme discomfert was left in the middle of the night to stay elsewhere.", "title": "Mixed feelings", "helpfulness": 2, "user": "JosiePohl", "date": "August 3, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 170622181}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We originally booked the Redfish room based on other reviews but we received a call from the resort asking if we would like to upgrade and we accepted. We arrived late (9:30pm) and the office was closed but that wasn't a problem as they had already taken care of us.", "title": "We fared well at the Seafarer", "helpfulness": 1, "user": "Chiminee", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169443751}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "We drove back to our room which was clearly marked. The landscape lighting is very well done and everything was accentuated beautifully. Our room had a very large deck and the outside light was on inviting us to come in. There are strings of lights draped everywhere outside which further added to the feel of the place.", "title": "Quirky, Amazing Location, Great Bargain", "user": "Leotheleo", "date": "July 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 169007254}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We opened the door to the room and was not expecting what unfolded. The room was way more than we expected to get. The air conditioner was already on which is always an immediate plus for us. The roomed looked like it had been recently remodeled with dark hardwood floors, comfortable beds, tasteful furniture and a flat screen TV. The bathroom and shower were in separate rooms which was a plus and the shower was so nice with the waterfall shower head coming out of the ceiling. The two beds were comfortable and clean and there was plenty of space to pile your stuff, change your clothes, dance a waltz or whatever you need extra space for. Same goes for the outside deck, saying that it is huge would be an understatement.", "title": "Charming, friendly, relaxing and just what we love!", "user": "Judylala", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168176428}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "As henry tells you the rooms are not the best its the location, being right on the private beach. What more do u want. Great sunsets watched from the hammock. Free kayaks, bbqs and sun loungers. The water is great for snorkelling as it was calm when we went 17th to 20th May 2013. You have to go to Mrs Macs Kitchen for breakfast.", "title": "The beach sells the room!!!!!!!", "helpfulness": 2, "user": "Alison C", "date": "June 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162663323}, {"rating": 1.0, "stay_parameters": "Stayed May 2013", "text": "We paid than shown to room wow shut the bathroom door it hot my knees while on toliet and I am only 5'2 125 pounds.we left after 30 minutes ask for our money back she said no.we took the loss of 200 bucks it wad that bad.but gonna call channel 8. Pictures are all lies", "title": "Horrible gross", "helpfulness": 2, "user": "Paulina564", "date": "May 30, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 162456958}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We fell in love all over again. With the Keys, that is, and with the Seafarer. Fell in love with the quaint, old-timey cottages. Fell in love with the dog-friendly policy. Fell in love with the sunsets and the convenient location, kitchen and screened porch. It's an all around fantastic place to stay in Key Largo.", "title": "Best bet for beach bums on a budget, like me!", "user": "Talmage T", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162321998}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I can speak only to my own experience this past Memorial Day weekend: the room was clean and the beds were comfy. I think there were pillow tops on the mattresses to ensure we slept well. Yeah, it's an older property, so don't expect turn down service or renovated interiors. You wouldn't have scored a room at a hotel that had all that for this price, now would you have?", "title": "Private beach and affordable", "helpfulness": 1, "user": "Carolinuss", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 159161221}, {"rating": 4.0, "title": "fantastic location room dissaointing", "text": "We stayed here 2 nights ago for a brief one night stay . The staff were real good , very helpful. The location was amazing, right on a small private beach . Kayak for use which we took around the bay everying was great except the room . We stayed in room 11 while the toilet shower area was quite good , the bed area was shabby and very small for the cost. The air conditioning very loud and old , although it is working well. Just felt the hut was in need of some tlc . Would we stay again, yes if we could select a better room/hut. The other thing was the fridge and micro was in the bathroom with the toilet.!", "helpfulness": 2, "user": "UkSand", "date": "August 22, 2013", "id": 173486338}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This place is a lil peice of paradise!!! the rooms were clean and the staff was wonderful!! We will be back!! We really loved that the kayas were included in our stay no extra cost!! The sunset from the resort is so beautiful!!! At night its very quiet and relaxing!! I would recommend this resort to my family and friends!! :)", "title": "WONDERFUL!!!", "user": "shawntaecolbert", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173162408}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The Seafarer completely blew my British wife away. She judges everything by the cover but ended up not wanting to leave after 2 nights. There is obviously a great deal of work put in by all the people connected to the Seafarer to make this a special place. Our room, the Redfish, was so much more than we normally get at a chain hotel. It was roomy, clean and comfortable. Down by the beach everything was smart looking. The hammocks, lounge chairs, picnic tables, railings, all looked new. It was really nice to sit out on the dock in the evening or early morning and watch life wake up or go to sleep. Thank you, George and Scott for a nice stay. We'll be back........", "title": "What a wonderful surprise!!!", "helpfulness": 2, "user": "RalphMarx", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172232594}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed in the beach house at the Seafarer Resort and we were literally 20 feet from the water! What a view we had not only of the water but beautiful sunsets. We kayaked, used the paddle board, fished, snorkeled, and just relaxed while there. The staff was very friendly and accommodating. The beach house was very comfortable and had everything we needed. I was really able to relax and reconnect with my family there. The staff was very helpful giving us information on the best restaurants, places to dive, snorkel, etc. We really enjoyed our stay at the Seafarer and will do it again in the future.", "title": "Great vacation Spot", "helpfulness": 1, "user": "Jesse G", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171973631}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I can not believe how we lucked out on this place. I took about two months to search for the right place to stay and really wanted to avoid hotel chains. We arrived there Aug 1 and stayed two nights and wished we could have stayed another week. First of all, I can not understand any negative reviews on this place. The owner and staff were absolutely amazing, nicest people you will come across. We stayed in cottage 5, which had two bedrooms, one for us and one for our 17 and 15 year old, a full kitchen, so we didn't have to eat out and a deck with a table and chairs and steps away from the beach and no neighbors to share walls with. The room was very clean, beds were comfortable and good AC. During the first hour, we took the complimentary kayaks out. The beach area and water were perfect. The beach area had hammocks, tables with umbrellas and a small fishing pier/dock. The next day the boys took out the paddle boards and a 15 foot manatee swam right under their boards and come up to say hi but remember, although tempting, it's against the law to touch them. There was also a family, mom, dad, baby manatee. The property is almost completely shaded, which was very nice as we visited the hottest month of the year. At night, we took a flashlight to the water and got to see so many neat creatures in the water. Thank you so much Seafarer for the great times and the wonderful service. You have everything needed to for a perfect vacation in The Keys. We drove down to Key West one day but should have used that time to hang out longer at Seafarer. Do not pass this place up.", "title": "Absolutely perfect!", "helpfulness": 2, "user": "TDuda", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171785374}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 8, "very good": 20, "terrible": 3, "excellent": 16}, "aka": "Seafarer Hotel", "slim_ranking": 0.588235294118, "description": "Waterfront cottages located in the heart of Key Largo. Enjoy spectacular sunsets, relax in a hammock, bbq, kayak, scuba, snorkel, all in the charming setting of the Old Florida Keys. Family owned and operated."}