{"user_rating": 4.5, "review_count": 74, "name": "Seaside Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This is an older property that is very quaint and right by the ocean but will soon be blocked by development. You might want to check before booking. The beach area is really nice with people playing and walking dogs in the mornings. The rooms were adequate - nothing special. The upstairs rooms are the best - you can see the ocean. Breakfast was nice - heavy on bread and cereal. One thing that bothered me a bit was that the local newspapers were there, but there was a charge for them at the front desk. Seemed rather nickel and dime somehow. They did give us good directions to our next stop and told us of some good places to eat. The town of Kennebunkport is a great stop but budget at least a half day to drive around the area. Beautiful homes and churches. Maine rocks......", "title": "girlfriend getaway....", "user": "rachel53", "date": "December 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121522171}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I spent 3 nights at the hotel with my boyfriend. I took him there for his birthday in mid October. The rooms were clean, the cleaning staff was great - friendly and helpful, and the views were amazing.", "title": "Would love to stay again.", "helpfulness": 1, "user": "Tammy C", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121038280}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The breakfast in the morning was nice. True, it's not a full B&B breakfast, but there's plenty of yummy options: bagels and toast, cereal, hard boiled eggs, fruit, french toast or muffins, coffee, tea, juice... The hotel is very quiet. It's sad that there was construction going on, but the views are still so great that the construction can be ignored - and we were the closest to the construction compared to all the rooms. But even something like a loud obstruction cannot ruin the stay. If you stand outside on your balcony (from a 2nd floor room of course) you have a direct view of the ocean and can hear the waves crashing. We walked on the beach every day since it was practically in the back yard.", "title": "Wonderful ocean side inn", "helpfulness": 1, "user": "IT_SilverLady", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119954709}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "It was such a wonderful trip. There are many great cuisine options nearby. We like to explore and try new places, but with any luck, we'll be back at the Seaside Inn soon.", "title": "The Seaside Inn is all about location....", "helpfulness": 1, "user": "lowjumpingfrog", "date": "September 12, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 118033894}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "A girlfriend, her sister, and I wanted to spend a couple of days in the Kennebunkport area after my friend's daughter's wedding in Jackson, NH. We lucked out and got a wonderful room on the second floor facing the ocean. The room was larger than a traditional hotel room with a roomy deck. The inn keeper was gracious and helpful in finding activities and good restaurants for our entertainment. The extended continental breakfast is served in a cozy dinning room and was quite good. We were there in mid-October 2011 and I would love to spend a week there in the summer as the beach is right out your front door. Beautiful scenery in every direction.", "title": "Consistently Great", "helpfulness": 1, "user": "SurfColorado78", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 118006831}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Seaside Inn is a true gem! Location is spectacular with the most amazing ocean view. Staff at the Inn is first class and rooms were clean, roomy and very comfy. Continental breakfast was super – muffins were great. We definitely plan to return to the Seaside Inn. Rates were very competitive and, 10 – 15 minute walk for the Kennebunkport town area. It was nice to return to the serenity of the Inn and its grounds after a day in port. If you are a surfer, you will love the beach. And yes, the beach was awesome! Not one negative comment regarding our experience, not often one can say that!", "title": "What a gem!", "helpfulness": 1, "user": "Mary S", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 139931012}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was our second year going to the Seaside Inn in Kennebunk and I suspect that we will be going there for years to come.", "title": "What a great spot!", "user": "daddyo-2", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139144282}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "This is an \"old school\" inn right off of Gooch's Beach in Kennebunk, Maine. The rooms are large, the entire facility and grounds are meticulously kept, the staff is super friendly (kids left a light on in the van overnight and drained the battery - the staff could not have been more helpful getting us jumped) and the breakfast is awesome (home made pastries, oatmeal, cereal, hard boiled eggs, fresh fruit). The Inn and the rooms have a 1950's/old school feel - but it works. You can't see the ocean due to the dunes/lawn (maybe from the second floor - but families with kids stay on the first floor- so I really would not know) - but it is a stones throw away. The town of Kennebunk/Kennebunkport is about 1 mile away - so an easy walk - or you can drive and try your luck with the parking.", "title": "LOVE, LOVE, LOVE!", "user": "adecaire", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136857705}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Its funny - I travel all over the world and stay in some of the nicest places - but the Seaside Inn is shaping up to be one of my favorites - it all comes togther - Maine-beach-old school Inn- classic/1950's feel - super friendly staff - neat as a pin - home made breakfast. Just love it.", "title": "A Perfect Vacation!", "helpfulness": 1, "user": "montrealtravellors", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 136135182}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We love the Seaside! We have gone three years in a row and have already submitted our names for next summer. The Seaside is clean; the staff is wonderful (and recognize us from year to year!); the breakfast is YUM!; and the location cannot be beat! I love that my 5 and 3 year old sons are growing up with Seaside memories!", "title": "Great location, comfortable rooms", "user": "sunny330", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134297110}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I have been to the seaside for my weekend getaways. I just keep coming back. It feels like home. It is a run by a family all who are vey pleasant and willing to help with anything you need. The rooms are spacious vey clean and have sliding glass doors to a terrace if you on the first floor or a porch if your on the second floor. The ocean view rooms are the ones on the second floor .All the rooms are fine with me you as you can fall asleep to the sound of the ocean. They serve a nice breakfast buffet with fresh fruit homemade muffins cereal oatmeal hard boiled eggs", "title": "I love this place", "user": "sunny34439", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132627055}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "There is free wifi. There is no room service and no coffee maker however they provide a refrigerator in each room and coffee at the front desk that starts at seven.Seaside is one of my favorite places to be!", "title": "Wonderful Place for Weekend Getaway", "user": "sarchma307", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127016439}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband & I have visited this inn 3 years in a row for a weekend getaway in March. The location cannot be beat. Views of the ocean are superb. The inn itself is quaint, quiet and comfortable. Breakfast is very enjoyable -- Love the coffee and muffins! The price is very reasonable off season & the staff is friendly & accommodating. It is, of course, windy and cold on the beach in March, but bring your heavy coat and gloves a go for a walk anyway. Sunset is breathtaking. We have been very pleased with our stays here. Highly recommend!", "title": "Simply the Best", "user": "Karen B", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124964656}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My husband found this place years ago when he was traveling on business. We have been going up every year since. The rooms are amazing--very clean with beautiful views, all on a quiet,quaint road in a small neighborhood right on the beach. Even if you can't get a room facing the ocean, there is a large deck at the end of the building where you can relax, read,have a cocktail and see the ocean.The staff is very friendly and caring and will go out of their way to help you find a restaurant or destination of your choice. The breakfasts are always delicious--I love the homemade oatmeal and stuffed French toast. Today is Feb.21st and we are going up tomorrow to relax for a few days. I can't wait. This is my absolute favorite place to stay. Karen & Jack Bucchi from Connecticut", "title": "Outstanding Stay with Fantastic Ocean Views", "user": "Jay S", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123262621}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My family and I have been coming to the Seaside Inn for over 10 years with at least two visits each year. Our recent stay in December for the Kennebunks Christmas Prelude was, as always, outstanding. The rooms are always extremely clean and the staff is very warm and welcoming. The included breakfasts are always excellent, especially the stuffed French Toast on Thursdays prepared masterfully by Mona! There are some existing houses being rebuilt near the Inn but no new development is allowed that would block the perfect ocean views that the guests at the Inn currently enjoy. I verfied this myself by talking to locals including the Kennebunk town manager. I wanted to include this point regarding the views because I noticed another reviewer was concerned that development was going to eventually block the ocean views. I can tell you that will NEVER be the case. It is protected \"frontal dunes\" land and the Maine Department of Environmental Protection will NEVER let it be developed (per town manager).", "title": "Beautiful even in winter!", "helpfulness": 2, "user": "Rhonda R", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122601222}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "When we arrived at Seaside Inn I began to notice the walls were filled with historical pictures. My research on the internet revealed that the owners were part of a family of innkeepers going back to the 1600's - on this lovely part of Kennebunkport.", "title": "A Part of Our History", "user": "ivortickle", "date": "October 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143929007}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hospitality was outstanding as were the views outside our windows. But you just can't find this kind of history. Look up the history of the family and you will see what I mean.", "title": "Location, location, location", "user": "7wonderstraveler", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142243564}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This place has the best real estate in all of Kennebunk and Kennebunkport. It was so nice to wake up and see the ocean and take a stroll along the sandy beach. I can't imagine why someone would pay $700-1,000 a night to stay at a place w/o a view since the body is sleeping anyway. The White Barn Inn is about 1/2 mile from the Seaside w/o a view and charges the hefty prices. I would have to stay up all night long to get value out of it. This place has been in the family for generations and it is usually booked with guest who have been coming here for forty plus years. We were lucky to be a walk in and get one of the last rooms. The only reason this happened is because it was on a Thursday night. The room was clean and kept up so nicely. The whole place was taken care by someone of a particular nature. The breakfast was included and was outstanding. Also, the Seaside has a hot tub on the deck. Thank you for the lovely stay!", "title": "Going home but feels like we're leaving home!", "user": "DeborahD54", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142224884}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Leaving tomorrow and I want to say to the previous reviewer, are you such an incredibly unsophisticated traveler that you don't know ALL hotels fly the flags of the countries of their guests. The Seaside has many Canadian guests this weekend so that's why they are flying the flag. Now I understand the rest of your review! We stayed in both ocean front and terrace side this time (added onto our stay) and as usual, they were the cleanest rooms I have ever stayed in anywhere. The rooms are definitely not \"worn\" and they are extremely comfortable.The people, from the desk to the kitchen to the maids, are as lovely and accommodating as you could wish.", "title": "No American Flag?", "helpfulness": 1, "user": "Paul C", "date": "October 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142081446}, {"rating": 3.0, "title": "Great location even in the rain", "text": "The Inn was OK. Rooms were clean but worn and dated. My biggest complaint was in front of the Inn the Canadian flag was proudly flying but our American Flag was sadly missing. As far as I know Maine is still part of the United States. I'm not sure if they are unpatriotic and are making some kind of statement or something. If only on pole was available the Stars and Stripes should have been the one flying. I know this has little to do with the accomodations but the overall experience was somehow tainted. The breakfast was good.", "helpfulness": 1, "user": "Kaz1955", "date": "September 28, 2012", "id": 141539546}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 4, "very good": 17, "terrible": 4, "excellent": 48}, "aka": "Seaside Hotel", "slim_ranking": 0.375, "description": "Oceanfront Inn directly on quiet section of Kennebunk Beach. The only Kennebunk Inn directly on the Beach! Walk to Kennebunkport’s Famous Dock Square shops, boutiques and restaurants. Sea kayaking, lobster boat tours, whale watching, fabulous sunrises and sunsets from your room! Surfing, wake boarding and kayaking right out your door. Ocean view Hot Tub. Bicycles. The Seaside Inn is open year round and includes breakfast daily in the 1850 Boat House. Great values with our special Off-Season Packages in our Oceanfront Inn. View live beach cam on our web site. 9th Generation Family Innkeepers since 1667. Kennebunkport’s premier beachfront address. A memorable location and experience directly on the beach. Maine Environmental Leader award."}