{"user_rating": 4.0, "review_count": 272, "name": "Seattle Airport Marriott", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Flight from Hawaii arrived late, and I had an early flight to Atlanta the next day so I wanted a hotel near SeaTac. More than just a place to sleep, this Marriott was an unexpected pleasure!", "title": "Perfect Hotel for Late Arrival/Early Departure", "helpfulness": 1, "user": "ladytez", "date": "February 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152474377}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Hotel shuttle runs every 10-15 minutes from the airport. Huge van with luggage room at the back so no one has to haul bags up and down stairs. Friendly, safe driver. Quick check in. Cosy lobby with fireplace and lots of seating. The restaurant serves real food (not just bar snacks) until very late, which was greatly appreciated. Pricey, but delicious.", "title": "Consistently Excellent", "helpfulness": 1, "user": "Semibum", "date": "February 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152107996}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Gorgeous atrium pool area off lobby with attractive interior landscaping and intimate seating. Wish I'd had the energy for a swim! The room was perfectly comfortable with a nice sized bathroom. If you are on the concierge level, you'll enjoy a hearty complimentary hot breakfast. They opened right on time at 6 am (week day) - important if you have an early flight. Paperwork was slipped under the door nice and early, so there was no delay with check out.", "title": "Awesome Atrium Pool", "helpfulness": 1, "user": "DubPirate", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152063886}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "If you want to print your boarding passes at the hotel, save time by printing them the night before. There was a wait at the machine in the morning.", "title": "I'd Sooner Stay at the Marriott Waterfront", "helpfulness": 2, "user": "CostalCruiser", "date": "February 12, 2013", "detail_rating": {"location": 3.0}, "id": 151996340}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "No hotel chain does consistent high quality better than Marriott. What more can you say than that everything was exactly as you would expect it from a Marriott – excellent! If you need a hotel at SEATAC on a weekend light, they offer some great values.", "title": "Great hotel, small rooms", "user": "EagleDad", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151842252}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This is a very good hotel, very close to the Seattle airport. The neighborhood is not the best, but the proximity to the airport is perfect. The outside of the hotel is showing is showing its age a bit, but the inside in renovated and nice. One drawback - there is no wired internet connection in the guest rooms. The wireless works fairly well, though. I would stay there again. Nice inside pool.", "title": "a good hotel, very close to airport", "user": "BizTraveler873", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151152392}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Unexpectedly delighted by this hotel. Lots of charm and warmth. I began to relax as I entered the lobby, with zen-like candles and fireplace glow. Very clean, friendly staff and close to transportation. I was using one reward night for a three-night stay and I was upgraded to a top floor with vaulted ceiling. Nice, large room and exceptionally clean; no bed bugs came home with me! Great size tub and bathroom. Comfortable beds. I thought my room was quiet, despite other reviews stating airplane noise. Yes, I did hear them, but not as bad as I expected. Shuttles run to airport regularly, and you can catch the light-rail to many places around Seattle. My rental car at Alamo at Sea-Tac was a good value.", "title": "Unexpected Gem", "user": "queenmalley", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151120500}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Don't overlook the Aqua Terra restaurant in the hotel: remodeled with new, wonderful menu. The smaller restaurant on property, \"5 10 20\" has great flat bread pizza and sea-salt fries.", "title": "My Favorite Full Service Marriott", "helpfulness": 2, "user": "2tired2choose", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150582052}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I loved the pretty waterfall and ponds off the pool area. I will stay again and recommend. Caution: not the best area for a single female to walk off property.", "title": "Great hotel for a convention", "helpfulness": 1, "user": "Wulfie3b", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 150370728}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Immediately impressed with the design and décor. The staff didn't miss a thing. I absolutely loved the pool and spa area. The atrium is just beautiful. Rooms on the top floor have vaulted ceilings and lovely views. I don't know how I overlooked staying here before. I would definitely recommend staying here over any of the nearby hotels.", "title": "Be very careful at this hotel", "helpfulness": 3, "user": "Carol D", "date": "January 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149990924}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I've been a visitor of this Marriot twice in High School attending weekend conferences within the hotel back in 1998-99. I remember the hotel being very beautiful, clean, and respectful; even to a ballroom full of eager youths! Therefore into my adulthood I now return to this hotel with my family whenever we fly in and out of Seattle. The main attraction of the hotel is the inside pool and garden. It’s a beautiful space much like an atrium that all the hotel rooms windows look inside to view. The indoor pool is surrounded by plants, flowers, plenty of lounge chairs, and skylights in the roof which give a great ambiance combined with the pool lights in the evening and night– a great place to chill and relax before or after a flight! At one time I even thought about having my wedding here poolside. The location is convenient for guests to go to and from the airport especially with the Hotel’s Shuttle Service, but also walking distance to the strip malls / outlet stores nearby. Or just a short, cheap, cab ride to the Sea-tac Mall. The noise from the airport is not loud from here, but during the day if there are large groups of people poolside the noise can echo, but the windows are pretty good at blocking most the noise. We usually make our reservations online. Once there, Check-in was fast, and I will say the hotel is more expensive than others, but this hotel also boasts other amenities like the coffee shop, gym, and the great pool side sanctuary. The beds here are also more comfortable than many other hotels I have slept in around the US! I did not get to visit the bar due to having young children, or the restaurant because we ate at the Rainforest Café at the nearby Mall.", "title": "Sea-Tac Marriott", "helpfulness": 1, "user": "Corrine R", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149848930}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Just another Marriott. You know what to expect: friendly staff, efficient check-in, clean room, and good (if not slightly overpriced ) associated restaurant. One thing I found very odd was the each of the lamps in the main area of the room had two very very bright CFL bulbs. Bright bulbs aren't always a problem, but coupled with the fact that the lampshade ended about 1/2 inch below the bulbs makes the bright bulbs very problematic. After inadvertantly glancing at the bulbs while laying on the bed, I ended up just turning the lights off all together and spent the rest of my evening in the light from the TV.", "title": "Bright lights, dim lights", "user": "Dodgegal", "date": "January 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 149384375}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "As bright as the main area was, it was surprising to find the bathroom vanity lights were very dim. Perhaps my eyes were still reeling from the bright living area, but I felt as though the bathroom area was lit with night lights.", "title": "Nothing to go back for.", "helpfulness": 1, "user": "rc1933", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 149187498}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "This hotel seems to be designed for the business traveler who as a company expense account.", "title": "Comfortable & Convenient", "user": "Endurant", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148167237}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "My room was fine but WiFi was an extra $12.95 per day and on site parking was $19.00 per day.", "title": "Nice", "helpfulness": 1, "user": "JuneauCoho", "date": "December 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147923877}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I was here for two days on business and can't say that I really enjoyed it all that much. I had a room on the first floor and maybe it's just that floor, but the room was tiny! I had to set up the ironing board and found myself doing the furniture dance to move around the room to get the job done. The bed, chair, ottoman, desk, dresser and nightstands were far too oversized for that tiny little room. I'm just over 5' tall and I could stand on my toes and touch the ceiling in the bathroom and entry into the room. Just a bizarre room overall. Beverages in the bar were GROSSLY overpriced, but I guess one should just come to expect that a hotel next to the airport is obscenely expensive. If it were paid for by work, I wouldn't choose to come here.", "title": "Tiny Hobbit sized room with huge furniture", "user": "IrishTravelingGirl", "date": "December 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 147081928}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "This is how I like to stay when I visit a city. Friendly, professional staff ready and willing to greet you at the door and help you with whatever you need. Very clean, comfortable, well appointed rooms. Room service was fantastic. Restaurant food was delicious.", "title": "Classy Hotel", "user": "Jill H", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146852539}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I have stayed at this property many times and I am very impressed with all the staff. Kind welcoming, efficient. They make you feel like a valued customer. The shuttle driver radioed ahead and had keys ready.", "title": "Great staff!", "helpfulness": 1, "user": "paddyboyfoley", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146792757}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I was surprised and delighted to get a personal hand written thank you note and fruit platter from the AGM Drew H.", "title": "Excellent Airport Hotel", "user": "Donnarita1964", "date": "December 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146769055}, {"rating": 4.0, "title": "Convenient to the airport: free shuttle", "text": "Outstanding attention to detail and great service.", "helpfulness": 2, "user": "RinNYC", "date": "December 2, 2012", "id": 146652103}], "location": {"country": "United States", "city": "SeaTac"}, "stars": 3.5, "variance": {"poor": 10, "average": 53, "very good": 119, "terrible": 12, "excellent": 78}, "aka": "Marriott Seattle Sea-Tac Airport Hotel Seattle", "slim_ranking": 0.264705882353, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}