{"user_rating": 4.5, "review_count": 277, "name": "SeaVenture Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Pros:", "title": "Relaxing time at ocean front hotel in Pismo Beach!", "user": "kitty811", "date": "September 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5763436, "likes": {"liked": "— Location", "disliked": "— No suites"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "- Ocean front location", "title": "Overrated! Overpriced!", "helpfulness": 5, "user": "tripplanr", "date": "July 31, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 2.0}, "id": 5534216, "likes": {"liked": "— location", "disliked": "— room size, view, service"}}, {"rating": 5.0, "title": "Great room", "text": "- Nice complimentary continental breakfast (get the warm, toasted bagels) delivered at the time we specified", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 22, 2006", "id": 5373273}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "- Bathrobes", "title": "FAVORITE HOTEL IN PISMO", "helpfulness": 5, "user": "luv2dohair98", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5343082}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "- Private hot tub on balcony", "title": "The Most Incredible!!!!!", "helpfulness": 4, "user": "conedd", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5037953}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Nothing actually wrong with this hotel although it is more motel than hotel. Location is fantastic, right on Pismo Beach and the hotel thoughtfully provide beach chairs as well as towels. Restaurant was great too although service was a bit slow (but it was busy). The rooms however were a bit dark and small and the balcony with jacuzzi was a waste of their time and money. The balcony size/shape meant that you coudl see nothing but four walls from the jacuzzi! Breakfast was just a basket of muffins and juice bought to your room which I couldn't understand why when they had a full blown kitchen upstairs for the restaurant.", "title": "Okay", "helpfulness": 2, "user": "sjwoolnough", "date": "August 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3792066}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The Sea Venture was not as great as I had expected, many people built it up to be more than I thought. I was glad that we were only staying there 1 night on our way up the coast. Our room did not face the ocean, we were in the back of the hotel and had to crane our necks around the partition to actually see a small sliver of the ocean. We left around 7:00 the next morning and were rather disappointed that we had to leave before we got our \"breakfast basket\" that everyone said was so great. I would have to say that the products were the best part of the hotel, the jasmine lotion and the hand-made soap were really nice and you can buy more soap in the lobby. I probably would not stay there again but all in all, it was a clean room with a friendly staff.", "title": "A little disappointed", "helpfulness": 6, "user": "Red1064", "date": "July 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3660654}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I was on business travel. A bit pricey but nice. I think you should request an oceanview room, or else they will put you in the back. However, I had a spa/jacuzzi on my patio. Overall, good service, great location. No major complaints. The restaurant was darling, good jazz, good crowd. Saw whales from the restaurant for over an hour. The beach front walk is great!", "title": "Great Location and Atmosphere", "helpfulness": 1, "user": "ninaangelique", "date": "May 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3488775}, {"rating": 5.0, "title": "best hotel I have ever stayed in", "text": "The wife and I finally got a way for a little mini vacation and chose seaventure. The staff was awesome the room was gorgeous. We got a couples massage and when we got back the staff delivered complimentary champagne with two souvenier glasses. The restaurant on the top floor is one of the best i have ever eaten at. 5 stars all the way", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3437136}, {"rating": 1.0, "title": "Worlds Worst Customer Service Ever!!!!", "text": "Seaventure looked as though a beautiful place to stay for a couple of nights, until we first checked in, the lady who was helping us got my credit card all screwed up charging 2 deposit fees and the charge of the stay, we stayed one night and we were out of there! We won't be returning, but we ended up staying at the Apple Farm Inn and that was the best hotel experience ever!! Hot Apple Cider All Day!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 30, 2005", "id": 3427600}, {"rating": 5.0, "title": "SUPER PLACE TO STAY", "text": "Room w/o a view or hot tub (we wouldn't have used it anyway) on third floor, never heard the restaurant and enjoyed the convenience to the restaurant that evening. Food for our meal was WONDERFUL! From drinks to desert. Service teriffic and view in restaurant is really nice. (Maybe previous mention of bad food was colored by irritation). Room was a pleasure though very small. Like a little jewel box. But we weren't having races in there, but sleeping, enjoying the luxury, and so forth. Fireplace was wonderful (how do they do that? I'd like one like that at home...behind heavy glass and controlled from bed). Bed yummy and comfy. Fluffy robes and WONDERFUL breakfast delivered right on time. Everyone courteous. Would definitely go back.", "helpfulness": 2, "user": "judithnotjudy", "date": "October 24, 2004", "id": 2782281}, {"rating": 2.0, "title": "Not consistent ...", "text": "We stayed here 2 nights in Sept....the first night we were in a very nice room,but without a view. Clean, nice staff, happy happy. Next day we 'upgraded' (for $90 more) to oceanfront. When we discovered at 10pm that the hot tub was not working, the staff was not helpful, and we were not offered another room. The next day the manager offered us 20% off our $239 room and a $50 credit (scrawled on a business card!) for 'next time'....which I did not think was enough, considering we chose that hotel Because of its hottubs.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 8, 2004", "id": 2653509}, {"rating": 4.0, "title": "Very nice, glad we chose the SeaVenture", "text": "Check your hot tub before you unpack.", "helpfulness": 1, "user": "LovesPR", "date": "September 5, 2004", "id": 2514080}, {"rating": 5.0, "title": "Best Hotel in Pismo Beach", "text": "First, let me say that I am a local to the Pismo Beach area, and have been for over 25 years. Therefore, trust me when I tell you that the Sea Venture is the best hotel in the Pismo Beach area.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 10, 2005", "id": 3347552}, {"rating": 5.0, "title": "Who Could Ask For Anything More?", "text": "My wife and I stayed at the Sea Venture on our wedding night - before flying out to our honeymoon. We had an ocean view/spa room with a fireplace and private balcony. The room was great, the people are great, and the restaurant is amazing.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291759}, {"rating": 4.0, "title": "Enjoyed our Sea Adventure", "text": "I'll be honest, compared to 5-star resorts and hotels in areas like Hawaii and Los Cabos, hotels in Pismo Beach just don't make the grade. Only the Sea Venture can hang with the big boys.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3251850}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Spent four nights in the SeaVenture. Originally planned to spend three nights, but while my best friend and I were sitting on our second floor private hot tub balcony, watching the gorgeous sun set into the blue ocean, we both turned to each other and said let's stay one more night.", "title": "A Good Bet", "helpfulness": 4, "user": "unclebud_93463", "date": "January 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3023266}, {"rating": 5.0, "title": "Cozy Hotel with Lots of Romance and Ambience!", "text": "Pismo has that effect on you, and the SeaVenture made the stay the best ever. From the spacious room with two private balconies and enclosed fireplace (not to mention the large bathroom with shower, not tub, a real plus), to the convenient underground parking and easy access to all things SeaVenture, our stay was better than expected.", "helpfulness": 2, "user": "JCD", "date": "January 18, 2005", "id": 3015783}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "As a long time fans of the Sea Venture, my husband and I decided to celebrate our anniversary there again this year. Over the last 10-12 years we have celebrated birthdays, anniversaries, and just took romantic getaways there. The experience was always wonderful. This year it was a nightmare. It started with the blood on the pillow, that I had to ask be changed twice, before it was done. The pillows seemed a bit rumpled upon check in, but I dismissed it as perhaps the pillow cases being left in the dryer to long. I did not notice the dirty pillow UNTIL the next morning! We slept in a dirty bed. I was so grossed out. But Housekeeping assured me that it was just an over sight and that the bed had been changed before we checked in. Now, I rather doubt it. If that was not gross enough, the next thing will gross you out as well. Our beautiful ocean view room had a nice new looking jacuzzi on the enclosed deck. The first night we went in for about 5-8 minutes, since we were feeling romantic and my husband does not really care for jacuzzis, we got out. The next day we were just to busy to use it again. The day we were going to check out, we decided to go in for a fun morning dip. When I removed the lid, I noticed a swirl of some brownish looking stuff on top of the water. At first glance, I thought it might be sand, (how sand would have gotten in I don't know, but it was a thought) so I took a wash cloth from the bathroom and skimmed the top....it was not sand, but some disgusting \"stuff\". It took 2 skims to get most of it. I took it down to the front desk, showed it to them and informed them of my extreme disgust. The Housekeeping Manager, said that it was probably just our body oil. Hello, we were not in the jacuzzi all night. The few minutes we were in, could not product that much \"oil\". They asked me what they could do to make it better...NOTHING would, the trip was ruined. I was so upset that I went back upstairs and packed to leave. I looked at the jacuzzi again, and it had another large swirl of \"stuff\" on top. I skimmed it off and left it in the side of the jacuzzi for them to see. As we walked passed the front desk, no one said a word. When my husband went in to check out, he was given a discount of $100.00 and a $50.00 gift certificate. Yeah, like we are ever going back there.", "title": "Just not up to the prior standards...dirty", "helpfulness": 16, "user": "drgnflyz", "date": "January 25, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 4388491}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I don't know what is going on there, but the housekeeping is just not up to the prior standard. It makes me really sad to see that such a great place has gone down hill. The Front Desk staff was really nice and tried to make things better, but it was useless at that point. Management had better pay attention. I highly recommend that if you plan to say there, you check out the bed to make sure it is clean and check out the Jacuzzi out in the day light, before you get in.", "title": "Great Place to Stay", "helpfulness": 6, "user": "melovie", "date": "December 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4230867}, {"rating": 5.0, "title": "Amazing!", "text": "Our stay at the Sea Venture was superb! The room was clean. The bed was not the norm you would find in a hotel, it was so comfortable with no aching back issues the next morning. The breakfast basket was really good and satisfying. Finishing touches were the fireplace and the private balcony softub spa jacuzzi. What a relaxing way to end the evening in your own private jacuzzi looking up at the beautiful stars in the sky. We will definitely come back to the Sea Venture. The hotel staff was great, friendly, and helpful. Our stay was a positive one...don't have anything negative to say.", "helpfulness": 3, "user": "slofergus", "date": "November 20, 2005", "id": 4127781}, {"rating": 2.0, "title": "Seaventure was outstanding in the past, but last two trips disappointing", "text": "The SeaVenture is a dream come true! The beds are simply incredible. Location cannot be beat. By far the best hotel I have seen in Pismo. Worth every penny!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 14, 2005", "id": 4111950}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Have visited the SeaVenture 6 or 7 times. It can be a very romantic and relaxing experience, and the location on the beach can't be beat. We've always enjoyed the on-site restaurant (although a bit pricy), the balcony hot tubs and the in-room breakfast. However, we've found customer service to be slipping lately: inablility to honor requests for specific rooms or even general location within the hotel, some of the staff have been less than friendly, and there has been a definite decrease in the level of cleanliness and overall facility maintanence. Finally, and this isn't the SeaVenture's fault, but the balcony privacy of most of the spa rooms was ruined by the construction of 3-story condos next door. Really a shame. Will probably give the SeaVenture one more chance next year, but they're really going to have to step it up. We realize a 50-room hotel is not the same as an intimate bed and breakfast, but for the most part, that's the market they're catering to....and there are lots of other choices out there.", "title": "Loved the SeaVenture!!", "helpfulness": 3, "user": "LKotsonas", "date": "October 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4053595}, {"rating": 5.0, "title": "Loved the Sea Venture", "text": "We have just returned from a few days at the Sea Venture Resort in Pismo Beach, California. My husband and I went for our anniversary and they had champagne and roses set up in our room. We have never experienced such incredible service before. All of the staff were very friendly and accomodating to our needs.", "helpfulness": 5, "user": "Nicki21", "date": "April 11, 2006", "id": 4966015}, {"rating": 4.0, "title": "4 out of 5 stars", "text": "The restaurant was magnificent, with a beautiful view of the beach and ocaen. The food was wonderfully presented and tasted delicious. The spa services were so relaxing. I think my favorite part of the hotel was the bed. It was a feather down bed and I felt like I was sleeping on air. Needless to say I got a good nights rest.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4957423}, {"rating": 5.0, "title": "Every moment here was relaxing", "text": "My husband and I would highly recommend this hotel/resort to anyone who is visiting Pismo Beach, California.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4715882}, {"rating": 5.0, "title": "Loved the Ocean Front View", "text": "Quick summary......made the two night stay for our anniverary. Short and sweet check-in w/ friendly staff. Small but cozy rooms which were well kept, nicely painted and clean. Nice fireplace in room, hot tub was great (first night sat in the tub while it rained w/some glasses of wine - was awesome). No real issues. Took the complimentary bikes out the next morning for a spin (we opted for the tandem bike, it was interesting getting used to it, but was a blast after we became seasoned professionals and everyone was pointing at us as we cruzed down the streets). Had a great time. If I was to be over critical, I would say it was just a hair overpriced (by about $50.00) but otherwise very nice, very convenient and close to shops, quite, peaceful and relaxing. FYI, the room service drained and refilled our hot tub both days during our stay.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4628003}, {"rating": 4.0, "title": "Nice but noisy", "text": "It all started when I walked in the door, the staff was very nice. My check-in was simple, I was off to my room in a matter of minutes. I also recieved a coupon for $10.00 off toward a message a small dinner menu for there resterunt and a list of free assesibility like using there bikes on the beach, beach towels ect. The lighting and the cleanliness alone makes it soooo cozy. My room let me tell you, my husband and I stayed here for our anniversary, there was rose pedals and a bottle of Merlot. The bed was king size with a million feather down pillows. A fireplace that was on and burning, not to mention a jacuzzi out on the balcony. The view was breath taking, not to mention but this was only a partial view I ca't even imagine what a full view looks like.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 12, 2006", "id": 4602315}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My new husband and I treated ourselves to the \"honeymoon\" package the day after our wedding at another hotel down the road. The Sea Venture was the best place and the best part of our 3 week honeymoon.", "title": "~*Romantic Honeymooners Paradise*~", "helpfulness": 2, "user": "Aussie/Cali_Girl", "date": "October 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4029943}, {"rating": 5.0, "title": "An excellent stay at the Seaventure", "text": "Upon opening the room door I was nearly brought to tears by the decor, the fire place, scattered rose petals, and chocolate covered strawberries. After the rushed weeks leading to the wedding... we need some time to just relax. I booked myself in at the spa for an hour massage... which they do as late as 9pm. The massage therapist was great... giving me the tips on all the local restuarants and places to see.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 26, 2005", "id": 3940067}, {"rating": 5.0, "title": "Wish we'd stayed longer", "text": "We had a great view of the beach... but you \"do\" pay for that. Its usually $70 more than their average room rate. But each night we recieved a complimentary bottle of champagne. The spa was just right for two. The beds are the comfiest I have ever slept on. The breakfast basket could use a little improving. Not alot of variety. They provide postcards and free postage. An honor bar which is rare to find these days. Plush terry robes in the closets. Our room also had 2 balconies and a small childs room with two twin beds that was tucked away behind what looked like a slatted closet door. To cute!!", "helpfulness": 6, "user": "Purpleguardog", "date": "August 29, 2005", "id": 3813749}], "location": {"country": "United States", "city": "Pismo Beach"}, "stars": 3, "variance": {"poor": 14, "average": 17, "very good": 79, "terrible": 10, "excellent": 157}, "aka": "Seaventure Hotel Pismo Beach", "slim_ranking": 0.214285714286}