{"user_rating": 4.5, "review_count": 4057, "name": "Secrets Silversands Riviera Cancun", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband(late 20's) and I stayed here over xmas time and this is a wonderful resort to stay at.", "title": "Amazing Resort! You will not regret booking this place", "helpfulness": 5, "user": "pring_00", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122372175}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "PROS: The service was amazing, Food had a lot of variety and a la carte restaurants were very good, It is very close to the airport (20minutes), It is a little set back from main highway, you turn at gas station and go down dirt road for awhile, but once you reach silversands you will not care, the entire resort is very clean and kept up really great, The rooms were very big and modern, the beds were very comfy we always had a good sleep, the resort is more modern than mexican, more than one pool to choose from, we had a ocean view preferred club room I am not sure if they were any different than the regular ones. The layout of the resort was really good, not to spread out, easy to find your way around", "title": "Honeymoon enjoyment", "helpfulness": 3, "user": "David D", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122327332}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "CONS: Main pool is the only one heated, need MORE lounge chairs, there was about 10 pool floaties for entire resort and people tended to grab them and hold onto them like they owned them (bring your own if you enjoy floating), Jacuzzi tub is not heated, The water in our room coming into tub was brown, I know it is mexico but we have been to other resorts and have not had this issue, Preferred club members should have area just for them on beach and at pools, other resort I have been to have had this. The beach is not the best out there but they are building docks to help with covering up the sand bags. It is not as narrow as some people make it seem, if they would walk along the beach as we did they will see how the resorts farther down have it worse than secrets. We enjoyed being able to walk along beach as some resorts you are not able to.", "title": "Brief but wonderful stay", "helpfulness": 4, "user": "nyandrewg", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122325232}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "We had a fabulous vacation and would come back anytime!", "title": "Another x-mass at silversands", "helpfulness": 2, "user": "stephenjayklein", "date": "December 31, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122321426}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My Wife and I really enjoyed our Honeymoon there. (Dec. 23 - 30) Pros: Food was great, Staff was extremely nice and helpful, facilities were beautiful. Cons: Construction on the beach every day, at the main pool chairs were saved starting at 7a.m. We took the \"Sales pitch\" at Secrets Maroma and the beach at Maroma was Gorgeous! Unfortunately the beach at Silver Sands was not as nice. But the pools at silver sands were great, as long as you don't mind sitting at one of the smaller pools! We enjoyed our Spa experience especially since it was free from the sales pitch tour we took. We were lucky enough to experience a dinner for two on the beach thanks to a wedding gift and had a really nice romantic time. I like the fact that there was a dress code for dinner although it would have been nice to know about this before we packed. Luckily, Jeans, polo shirt and shoes were acceptable. Overall we had a really good time and enjoyed our trip. (Did not take advantage of the shows offered so i cannot speak to them.... i mean it was our Honeymoon!)", "title": "No complaints - would go again", "helpfulness": 4, "user": "ry26", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122319936}, {"rating": 3.0, "stay_parameters": "Stayed December 2009", "text": "This Hotel was GREAT, for couples only! We Traveled with 3 couples and 2 single guys. It took about 15 min to get to the hotel from the airport (Taxis are not cheap! be prepared to pay $40-$60+) The hotel rooms are beautiful! get an ocean view so worth it! very clean and modern. every room has a porch, couch, walk in shower, jet tub(bring bubble bath) and minibar that is stocked with sodas, water and coronitas! Bars/bartenders are great! Restaurants were ok, the best food at the hotel would have to be the room service! The staff in the front including bell boy ect are a little stuck up except Ana. everyone else was great. Night life is defiantly for the older crowd 45+ the best they had was a rock band. There were absolutely no single people in the hotel except from our party.", "title": "Couples Resort Only!", "helpfulness": 8, "user": "mrose87", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 52050290}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Pools have a curfew of 8 o'clock .", "title": "What a deal, pretty upscale for an all inclusive", "helpfulness": 7, "user": "zbigthing", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51890661}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Bring mosquito repellent!!! as soon as the temp drops they are out full force!", "title": "Twice at SMB now SSS hope this helps others decide", "helpfulness": 19, "user": "jgrohio", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51634122}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "If you mess up one time (jump in the pool after 8) they watch you your whole vacay! like hawks!!!", "title": "Just what others had said - some good, some not so", "helpfulness": 7, "user": "DDGone", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51560818}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "For night life go to Cancun it will take about 30min to get there, if you can hop on a party bus it will save you money.", "title": "WOW! Fab hotel!", "helpfulness": 14, "user": "jenndelisle", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51535867}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had a terrific stay over 5 days around the 09/10 New Year's holiday. The room was gorgeous and extremely comfortable. Despite having a 4th floor \"pool view\" in the building furthest from the beach we could still hear the ocean as we slept. The food was delicious, particularly at the Asian, Mexican, and Italian venues, and portions were perfectly sized to enjoy multiple items without overeating.", "title": "Fantastic way to relax over the New Year's Holiday", "helpfulness": 7, "user": "klingusOhio", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52608277}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We spent our entire visit relaxing at the hotel. The staff was incredibly attentive - keeping all the facilities in top shape throughout the day as well as ensuring we were never short of the \"drink of the day\". The spa was a particular treat. We enjoyed massages and the hydrotherapy circuit then spent several hours relaxing in the spa's private cabanas. The spa is an Oasis within an already idyllic environment - relaxing, beautiful, and peaceful.", "title": "A wonderful, relaxing vacation", "helpfulness": 14, "user": "fluorophore", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52501918}, {"rating": 4.0, "stay_parameters": "Stayed December 2009", "text": "Our only critique was the beach. It is relatively small and doesn't provide much space for walking or running. Given the strengths of the rest of the hotel this was a minor item. Overall we had a fantastic stay and would definitely consider staying at this hotel again.", "title": "Nice resort...some things lacking.", "helpfulness": 4, "user": "usrerd", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 52335205}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was our first trip to Mexico, and after extensive research we decided on the Secrets Silversands as our destination in part due to the deal offered through Apple Vacations. Our stay was Dec. 27, 2009 to Jan 1, 2010.", "title": "Best Resort!", "helpfulness": 9, "user": "vdoggal", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52249653}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Arrival:", "title": "We totally fell in love with this resort", "helpfulness": 14, "user": "burnbabytan", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52053583}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Activities - the activities team does a great job of keeping your day full if that is what you are looking for. It is also great for just laying back and relaxing. Evening entertainment is good and there was always a band of some sort playing after the show. Take advantage of the 'sharing secrets' time each afternoon to learn more about the inner workings of the place - one afternoon it is a session on massage; like a free trip to the spa!", "title": "No Disappointment", "helpfulness": 4, "user": "simpme", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122680153}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Beach - there are lots of lounges, palapalas, activities (water sports and beach games) and great bar service. There are places in the water where it is difficult to walk without surf shoes.", "title": "Dec 2011- Jan 2012", "helpfulness": 11, "user": "Nano A", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122672873}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Food - Lots to choose from with dressy a la carte to casual a la carte at night. I enjoyed the fish and the red meat seemed to always be good. Room service was included an we used it twice - service was very quick, maybe as quick as in any of the restaurants we tried at lunch. Himitsu for sushi at the counter was great. Never a line up for this while we were there.", "title": "Great Resort !", "helpfulness": 2, "user": "Fran318", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122653169}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Rooms - Very similar to the other Secrets resort we have been to. Cleaning service was a bit hit and miss but nothing worse than missing out on a towel on some days.", "title": "A Great Ending and A Fantastic Beginning", "helpfulness": 2, "user": "Kelly H", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122624889}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Front desk/reception - check in was a bit confusing and seemed to take a long time. After a 4 to 5 hour plane ride and then the airport transfer, you want to just get to your room.", "title": "Secret Silversands - A Dream Come True", "helpfulness": 3, "user": "Cash4", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122585164}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I just got back from a really great week at the Secrets Silversands and after reading a few of the other reviews, I feel like I need to write something. We took advantage of as much of what the resort had to offer as possible and were not disappointed.", "title": "A great, relaxing vacation", "helpfulness": 11, "user": "anelsonheesch", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 51468705}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The resort grounds are really impeccable. Lush lawns, lovely pool decks, lots of choice for shade or sun. The architecture is very modern, which I loved, but might not be for everyone. The room was spacious and when we checked in the woman at the front desk offered to move our room to a better ocean view when we chose not to upgrade to Preferred Club. We did have the little ants in our room on one day, but they came out when we left an empty coke bottle out. When we called the concierge about them they sent housekeeping up immediately to sprayed for the ants and clean them away. The ants don't bite or anything and they are very very tiny. The just come with the fact that the hotel is located in the mangroves.", "title": "Go somewhere else... dirty and bad service...", "helpfulness": 3, "user": "sunseekerCt", "date": "December 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 51466596}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The beach is exactly as people describe. It's fairly small - although you can walk for a long time along the fronts of the other resorts. They put up signs saying you're not supposed to go there, but the beaches are federal property - they don't belong to the resorts so go ahead and walk for miles! The waters are murkier than at Cancun and Playa del Carmen and the bottom is rockier. If you NEED to swim in the ocean to make your vacation complete either stay somewhere else or book a snorkling trip and go further off shore. Lots of seaweed washes up on shore, but the Silversands did a better job than its neighbours of keeping it under control.", "title": "Looks Aren't Everything!", "helpfulness": 5, "user": "FineMind", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 51202152}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The eight pools meant that there was always one with the right mood. If the main pool got too loud when there were aqua aerobics or other activities going on, you could head over the pool by the spa that was so quiet you almost didn't want to speak. (Other pools landed in the middle - don't worry.) When we were there the place wasn't packed so you could always get a mat to float around on which was nice.", "title": "Stay Away!", "helpfulness": 5, "user": "Callie2009", "date": "December 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 51056293}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The variety of bars also offered options for atmosphere and the bar tenders were always nice and friendly. We had great conversations with many of them.", "title": "Best Honeymoon!", "helpfulness": 6, "user": "shanatai", "date": "December 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51023075}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "have just come back from a weeks stay at the secrets silversands and having read all the previous reviews, wanted to give another opinion on this hotel.", "title": "from a hoteliers point of view ....", "helpfulness": 10, "user": "StevensonLondon", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 53202921}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Like anyone, and as I have worked in the hotel industry for over 20 years choosing a hotel for holidays I am particularly choosy and will spend hours looking at trip advisor reviews, before I make a choice", "title": "Nice hotel, pity about the beach", "helpfulness": 2, "user": "vendale", "date": "January 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 53008926}, {"rating": 5.0, "title": "Wonderful!", "text": "I have to say that reading some of the other reviews on this hotel, wondered whether we were actually staying at the same hotel.", "helpfulness": 6, "user": "margie55", "date": "January 9, 2010", "id": 53005898}, {"rating": 2.0, "title": "Cancelled Complimentary Golf", "text": "This was our first all inclusive experience, so wasnt sure what to expect - so see below from a hotelier perspective:", "helpfulness": 2, "user": "STNYNewYork", "date": "January 7, 2010", "id": 52882098}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The hotel: is gorgeous, modern, incredibly clean, trendy and a great selection of restaurants, bars and a lively crowd of people that if you want to mix with you can - but if you dont - you dont have too,", "title": "I rate this resort an 8 out of 10!", "helpfulness": 5, "user": "stillalarm", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 52689448}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I just loved Secrets Silversands. This was our 5th time in Cancun over the last few years and we've always stayed somewhere new, hoping to find a place that suited us perfectly, and I think we've found it! One thing I loved about this place is their variety of activities offered throughout the day. We've done enough excursions outside of resorts that we haven't been able to find any more that grab our interest. But of course, we didn't want to sit around and be bored. With SSS, we didn't have to worry! We had enough to keep us occupied and their nightly entertainment was wonderful. It's odd, reading comments about the smell before we went had us worried, but once we arrived, none of the things anyone complained about were an issue at all. I would definitely recommend Secrets Silversands! Their customer service shows they are constantly striving for improvement and trying to make you happy anyway they can.", "title": "Loved it!", "helpfulness": 4, "user": "Sarah B", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122461747}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I'll start off by saying that we stayed at Secrets Maroma Beach last year and had a faboulous time. It was my first all inclusive experience and everything was better than I could have imagined. My boyfriend and I decided we needed to get away after Christmas because this was our only chance to get away this winter. We would have liked to returned to Maroma, but found a great deal on Jetblue going to Silversands. We stayed the 26- 30th of December.", "title": "Not for Beach lovers", "helpfulness": 4, "user": "beachlover231", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 122460638}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Now we know why Silversands was offered for this deal and Maroma was not. The beach at Silversands is poor at best. We knew what to expect so we did not have our hopes up too high and brought water shoes with us. The beach is almost all rocks, we expected that, what we did not expect is how murky the water would be. Even with water shoes its very difficult to get in the water. We made it about 25 yards off the beach but it was very difficult, and I would not recommend anyone who is not comfortable in the ocean to do this. We are used to strong waves and it was still difficult walking on the rocks. Overall, if you love to be on the beach and swim in the ocean, go to Maroma it's worth the extra money!!!", "title": "Wonderful Holiday at SSS", "helpfulness": 2, "user": "YYCVacation", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 122424663}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The staff at the resort is wonderful, they will do anything to make you comfortable. Unfortunately I got very sick on our third (out of five) day there. We think it was a salad I ate, as my boyfriend did not get sick at all. It was awful, I have never been in so much pain or so miserable in my life. I understand this can happen anywhere, but beware of food that is not cooked as it may not be properly cleaned.", "title": "Worth Every Penny!", "helpfulness": 11, "user": "honestreviewguy", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122399621}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The food here is good, but not great. We had much better quality food when we stayed at Maroma, and there were a lot more options at lunch time.", "title": "Don't worry about the beach. The rest of the resort makes up for it.", "helpfulness": 3, "user": "PalmTreeLovers", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122379243}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I would have given 5 stars but for two issues: the \"discount coupons\" for upgrading wine, etc...weren't explained properly and the ocean front wasn't the greatest. Other than that everything was amazing. I went with 6 friends and we such a good time. Our rooms were really nice, the drinks were good and served in large cups, the food at all the restaurants (esp. the Mediterranean one and Seaside Grill) was really excellent, the staff were super friendly and polite, the pools were amazing. The look and feel of the place was awesome too, very pretty. A great place for couples or friends looking for a beautiful relaxing vacation.", "title": "Loved it and would go again", "helpfulness": 3, "user": "Kristen A", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122577549}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Our group of seven headed down to SSS on Christmas Day and stayed through New Years Day.", "title": "Best vacation yet.", "helpfulness": 14, "user": "Helena F", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122535864}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Our vacation was absolutely perfect. Upon arrival, we were offered a glass of sparkling wine, and a cool towel while we checked in. The staff was friendly and helpful, giving us a little bit of a tour while showing us to our rooms.", "title": "Exceptional service outweighs the negatives. Please read. I'll be honest.", "helpfulness": 4, "user": "ReneeWantsToEscape", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122492363}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "In fact, the staff as a whole was amazing. The bartenders and servers, the waiters, housekeeping, every single person we met actually was so nice and more helpful then we could have ever asked for. They really work to make your stay the best it could possibly be, and always greet you with a smile and an \"Hola!\"", "title": "Secrets Silversands--a holiday gift!", "helpfulness": 10, "user": "HRHSMS", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122477699}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I will try to hit every aspect of the resort in my review, but if you have any questions that I don't touch on, feel free to ask!", "title": "Wonderful Christmas!!", "helpfulness": 8, "user": "Erin V", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122470391}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 128, "average": 311, "very good": 876, "terrible": 75, "excellent": 2667}, "aka": "Secrets Silversands Riviera Cancun Hotel Puerto Morelos", "slim_ranking": 0.130434782609, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Secrets Silversands Riviera Cancun is a chic, ultra modern all-suite adult-only unlimited-luxury resort featuring 433 suites, over 43,000 sq ft of pool areas and expansive manicured gardens, exceptional dining options, several bars ranging from elegant to swim-up. World class spa, a fitness center and two Jacuzzis ensure that guests are pampered and indulged. We are nestled on the coast of the Yucatan Peninsula, 15 miles south of Cancun and only twenty minutes from the Cancun International Airport."}