{"user_rating": 4.5, "review_count": 655, "name": "Secrets Vallarta Bay", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Just got back from Secrets over the weekend. After reading all the reviews I wanted to focus on the great things people seem to miss which is the awesome staff and service. I was traveling by myself and was very conscious of other people and how I was treated especially by the staff. First of all it was on par and above my experience from other AMR resorts. From arrival to departure the service was personable, professional and nothing was ever a problem especially in the preferred tower. Let me give you some examples – I did receive the $400 in vouchers without the timeshare tour, people did call me by name, room service always was prompt and when I asked for an upgrade to a master suite it was not a problem, easy and not expensive. Raul the Concierge was flawless in his attention to detail and assistance with anything. I had left a very expensive ring in my room when I upgraded at the Maid returned it to me directly. This is way above the call of duty in a hotel. Bravo Secrets. The service at the spa is fantastic and another Raul gave some of the best massages I have ever had.", "title": "Excellent Staff and Hotel travelling Single.", "helpfulness": 9, "user": "sastudio", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139421570}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Now I do tip and I do tip well which a lot of people do not do at these resorts. You need to tip for a few reasons – people really appreciate it and it shows, people depend on tips at these resorts. The resort was not busy, maybe a hundred people so the place felt quite intermit and convivial which was fun. The pool bar was always a hoot and the service beyond attentive with cold drinks, warm food and shade being organized when then the sun moved. The Bellman where excellent in getting me cabs, luggage and anything else one desired from the outside world i.e. flowers for my suite. There were a few mishaps – the air-conditioning worked, no construction, there were no children at all on the adult side but I had two cold meals. This didn’t make sense since the hotel was not busy. The quality of the food was outstanding but when arrived cold was disappointing.", "title": "A very nice four star resort", "helpfulness": 7, "user": "filo6989", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139282090}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "All in all Secrets went beyond my expectations due to great staff like the two Raul’s and many others whom made my vacation a breeze even when I was by myself. It is clear the resort is getting its groove on and the experience is getting better and better. For a single traveler this place was perfect as it looked after me while at home then made sure I was AOK when I broached the gates! On the last evening I lost a few credit cards while out in PV – the resort had no problem advancing me cash off my Amex. They are totally amazing and will be back!", "title": "Beautiful area", "helpfulness": 3, "user": "mbthornburg", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138818852}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My wife and I just returned from Secrets Vallarta Bay where we stayed for seven nights. When we arrived, we were met by a gentleman with champagne and a cool, damp towel. I asked for a beer instead and it was granted with \"my pleasure\", which was the theme for the whole week. As most reviews has stated, this resort is new and it shows. Beautiful lobby, grounds, restaurants, pools and rooms.", "title": "Not as good as we thought", "helpfulness": 1, "user": "Amor3", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138571056}, {"rating": 5.0, "title": "Wonderful, relaxing vacation", "text": "Rooms-The rooms were clean, with plush beds, huge mirrors, dual sinks, a jacuzzi, a bigger than normal tv, high quality furniture, a spacious shower, and a huge balcony (although I still can't believe there wasn't a jacuzzi on our balcony as well-as most smaller balconied rooms did). There is a stocked mini fridge which is replenished daily with coke, diet coke, two kinds of juice, mineral water and 5 coronas (the coronas are the small, 7 or 8oz bottles though).", "helpfulness": 5, "user": "Michelle L", "date": "August 27, 2012", "id": 138479105}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This is a beautiful resort! Our trip didn't start out good with delays and a scary landing, of course Secrets-AM Resorts has nothing to do with that. We arrived extremely late, so all the restaurants where closed and since we hadn't had a meal for hours and hours, we tried room service, but so did the entire bus load of guests who were dumped off at The Now and the Secrets. Needless to say we were sleeping by the time they finally got it to our room and it was cold on top of it. I understand the circumstance though. We did order it another night and it came much quicker and it was warm, not hot. Service, however was good. Morning breakfast at the Secrets the next morning was ala carte and extremely slow. They really seemed clueless, I actually felt bad for them. The food there was only okay and again, not hot. Even the coffee wasn't hot. We checked out the pool and beach area the next day, loved the pool and you certainly can't beat the view of the Sierra Madre. BEAUTIFUL! I wish the vendors weren't on the beach, but they leave you alone if you wish. The bartender, whom I can't remember his name was swamped at the swim up bar, he was doing all he could do to stay above water himself. I wanted to jump back and help him! ;) He was friendly enough, made good drinks and he was the waiter the next few days at the pool. He knew my husband and was very prompt at getting his drinks for him. Plenty of shade if you wish and they had the big floats you could lounge on in the pool as well, that was really nice. Lunch was good right there by the pool at the Oceana, but we think we may have got sick from one of the lunches there. It's hard to say what you ate or where, but we knew we arrived early Sunday Morning and by Tuesday, things weren't right. We're still trying to get back to normal yet. I did bring it to the attention of the hotel as they can't figure anything out if they don't know anything about it. We didn't want anything from the hotel, but just to let them know, so they can figure it out and stop it. We were not the only ones sick by any means. That's why I give this resort a lower overall rating. We enjoyed most of the employees and the view from both lobbies is just gorgeous. I loved the little coffee shop. I'd like to see a little more entertainment in the lobbies. Maybe something a little livelier after dinner on some nights?? We went to one of their shows and left before it was done. It seemed very amateur like, we weren't impressed at all. But, most of us don't go to the resorts for the shows. I along with many of the other guests didn't like the fact that Secrets guests generally pay more that 'adult' only resort, but NOW guests can come over to the Secrets side. And sharing all the restaurants??? I don't know, if you are going to an adult only resort, the restaurants are very limited on the adult only side and you don't necessarily want to be around all the kids on the Now side of the resort. Would I go back? Hmmmmm, beautiful resort, friendly service, but I may try another resort out. OH, and dinner was very good in the ala carte restaurants we did eat at as well as the service.", "title": "Nice resort, and will get better", "helpfulness": 3, "user": "nesann", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137381866}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Currently here on our honeymoon and we are extremely happy with the room and the resort! Issues are few and I see them ironing out in a few months, so if you are considering coming, I would encourage you to book your trip as well. The good: The place is absolutely gorgeous. It's new and the quality of the workmanship that was used to construct the facility is top-notch. All very high end and beautiful. The staff are very pleasant and look to pleasing their guests everyday. There are no bracelets here. They somehow recognize you as a guest of the hotel. We are staying in the preferred club and we have seen the difference in the 'NOW' side with kids, and the 'Secrets' side, without. The pools are seperate so we have yet to see one child on the 'Secrets' side of our resort. Dinner is abit different, so unless you goto the 'Bordeaux' restaurant (exclusive to Secrets guests) you will most likely be dining with some kids.", "title": "It's so new they seem to be still building it..", "helpfulness": 5, "user": "Shmee43", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137340892}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The food is abit of a hit or a miss. I would recommend sticking to the breakfast buffet in the mornings. We have yet to try room service, so I cannot comment on that aspect. Otherwise? Dinners at Himitsu, Bordeaux, and Capers have all been very very good. The filet is featured at all the restaurants in one style or another and is very high quality. People that complain about the beef being unseasoned or tasteless is completely unfounded. Those who complain about portions being small? You are given options of appetizer, soup, main course and dessert. You want more? Then order it. They will bring you all you can stuff yourself with.", "title": "Excellent place!!", "helpfulness": 4, "user": "etorrestorija", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137114929}, {"rating": 3.0, "title": "Too New to Tell, But so far..meh", "text": "My main issue that has yet to be resolved with the room and regards the title of my review. What appears to be coming from DIRECTLY ABOVE OUR ROOM is construction. Im not talking about a random 'BANG' or 'CRASH' I'm talking about a full blown, tile-floor RIPOUT! Jackhammers, sledgehammers, carpentry hammers. Name a hammer folks, it's been used upthere. Granted, it only occurs from about 9am-5pm. But, if I am paying for abit of peace and tranquility from the everyday hustle and bustle, why cannot this be afforded to me? The kicker is that I have called no less than 5times regarding the noise and disturbances, but, even with the promise of Raoul, one of the hotel managers, the noise continues everyday. I understand the place is newer. But if it's not finished beng built yet, then DON'T OPEN IT UNTIL IT'S FINISHED! Ok.. Deep breath here.. Currently sitting on my ground floor veranda/porch and overlooking our swim-out pool and the garden pool area AND the beach! Beautiful morning!!!", "helpfulness": 2, "user": "Charles C", "date": "August 8, 2012", "id": 136681257}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Great place, brand new. Preferred Club Junior suites are superb, all include internal and external Jacuzzi with a very nice ocean view. Service is outstanding and for being an all inclusive hotel having different choices for meals is appreciated. Recommendation to go for a nice French dinner at Bordeaux restaurant.", "title": "Overall a great Experience!", "helpfulness": 8, "user": "Karsten121", "date": "August 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 136412565}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "i've never had such an amazing time at a resort like i did at secrets. The hotel is shared with now amber which is the family side. The secrets side is for adults, i never saw one kid in our area. when we arrived the lovely staff greeted us with champagne and cold towels. They were prompt n immediatley took our bags to our rooms. The hotel is still fairly new, not even being open for a year yet. It was so nice and clean inside the lobby. We were immediately offered drinks as we waited to get checked in. When i say the staff were all amazing they really were! and obviously if you tip them i dont think you could even get any better service! the rooms were devine, great decor and the seem to be all ocean view. The pool is not that big but they have 3 to choose from. Theres always activities going on at the resort, the entertainment team were so friendly and really tried to get everyone involved in what ever activity or show was going on. For food they have really great choices of restuarants and the buffets for breakfast. Though i wouldnt recommend the buffets. with 24 hour room service and a full stocked free mini bar. you cant ever go hungry or parched. Rooms were cleaned everyday. they changed the sheets but not the blankets. They have a disco downstairs, the dj was really good and took kindly to requests. They also have shisha for those that indulged. The only downside to this resort is that the adults side was mostly couples. And i went with my single ready to mingle girlfriends. Downtown is less then a 10 min cab ride, which usually cost us about 60 pesos about 7 dollars canadian. i recommend going to the board walk and the markets. Nonetheless i had the best time at this resort the staff really are amazing. especially hugo and pablo! any questions you needed answered they were there. If you needed to find a place in the hotel, they would walk you there. I will definently come back with a significant other.", "title": "AMAZING TIME!!", "helpfulness": 4, "user": "jazzy j", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137959713}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Me and 2 girlfriends of mine booked Secrets Puerto Vallarta to celebrate one of their birthdays and also as nice girls only trip. We arrived to Puerto Vallarta as scheduled and once we made it through mexican customs we arrived at the security screening with our carry-ons and went through with no issues, past the sea of people trying to sell time shares and excursions only to realize that we were supposed to have picked up our bags on the belt that was directly behind us when we were standing in the security line, THANKFULLY spanish is my native language, so after asking around to a few of the security and baggage claim people I was able to find someone to help me, but at a price of course he said we could either wait a few hours and get the bags delivered to us after going through security or if I tipped him he could get them right away, we rolled our eyes and tipped him $20 and magically our bags appeared. This incident kind of put a damper on our mood that is until we arrived at Secrets! As soon as we arrived at the gates we were impressed by this gorgeous stone waterfall, once we made it up the hill and stepped out of the van, we were immediately greeted by a few of the bellmen and served a wonderful cold glass of champagne and a cool towel for each of us. we were immediately impressed by the incredible view from the look out point in between the two main towers of Now Amber and Secrets. We then had a seat in the beautiful lobby and relaxed untill they were ready to check us in. As it turns out my 2 friends were staying in the Secrets part and I was in Now amber but I quickly took the upgrade of an extra $300 which is originally $500 but it was my friends birthday and they worked with me to get a better price. I am sure glad I did! As an adults only hotel I did not see any children on the Secrets side which is a huge advantage being a group of young single women we did not want to be bothered by other peoples screaming children. Once I arrive at my room I am absolutely stunned at how beautifully decorated it is and how comfortable I feel there, I had a garden view room but I could still see the ocean from my balcony which was absolutely amazing. The room had all of the modern comforts of home: flat screen tv, fully stocked mini bar, huge shower with the rain shower head, a large jet tub and gorgeous raised sinks, a in room safe, in room wifi, oh and I even had a phone in the small room where the toilet was located lol! We decided to get some food from carnival that night (buffet) since we were to hungry to wait and went back to our rooms to get ready for an evening out. We got ready and headed out to the Malecon which is a beautiful boarkwalk fully of shops restaurants and night clubs, after asking around a bit we were told \"Mandela\" was the place to be so we got in with no cover and hung out there for the rest of the evening, Now I will say I have been to cancun before around the same time of year and the club scene was a whole lot better then puerto vallarta, the nightlife here leaves alot to be desired and we didnt really here much of the music we were hoping to (reggaeton,bachata,salsa) it was more techno and house music that was played and there were not alot of single in puerto vallarta period!!! It seema to be more of a place for couples and families I would NOT suggest going there if you are looking for a party scene. So after trying a few different bars on a few differently nights we completely gave up on the nightlife and switch gears and decided to just relax and enjoy the resort. we enjoyed the pools at the resort especially one with the swim out bar which was our favorite, we even did the swim aerobics whicn was a great work out! and rode on horseback on the beach. We also had a chance to try himitsu and it was by far one of the best japanese restaurants ive ever been to it had gorgeous decor and the sushi was fabulous. we also decided to take a snorkelling tour through our aircanada advisor which was pretty inexpensive $65. The tour started at 9am and once we arrived at the marina we decided to invest in some mosquito spray because it was extremely buggy in the marina. Once we boarded the boat we were greeted by some wonderful crew members. Ive done snorkelling before in hawaii but my friends hadnt before so i kind of knew what to expect except this was much different then my previous experiences in that we were just off the coast of mariyettas island and they stopped the boat near the otherside where it is quite rocky and the current was quite strong so it was a bit scary. but we hopped in anyways, the water is quite cloudy and a bit difficult to see unlike hawaii and within about 10 minutes i felt a sting and didnt know what it was which kind of freaked me out so we headed back to the boat and once we boarded the boat we realised other people had been stung too and they brought out some sort of cortizone cream for us. Then they tell us it was probably a jellyfish and I was thinking wow thanks you couldnt tell us BEFORE we got into the water?? lol but I was ok after a few minutes and in all honesty i probably wouldnt have gotten in the water if i knew there were jellyfish. After that we kayaked around a bit and then boarded the boat, the best part of the tour was when they took us to the other side of mariyettas where there is a beach, it is one of the most beautiful ive ever seen in my life the weather was perfect and the sand was gorgeous. We spent a good hour and a half there and then boarded the boat again where we were greeted with an amazing buffet lunch (try the fresh tuna salad) and the crew entertained us with a great show :) Special thanks to carlos and carlos, juan luis, and the rest of the crew we had a great time! The rest of our trip was spent lounging and relaxing by the pool and enjoying the incredible food and drink oh and if you can definately do the theme nights were amazing the buffets were delicious and the entertainment was great!!! I want to thank everyone at Secrets for making our stay there absolutely incredible they work really hard to make you happy! Thank you HUGO, and PABLO the bellmen that always greeted us and were extremely helpful and friendly throughout our stay. I am extremely happy 5 star experience!!!!! THANK YOU and I will recommend it to anyone.", "title": "3 Amigas 1 amazing experience...", "helpfulness": 5, "user": "misslatinbarbie", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137676175}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Secrets/Now Amber resort was truly awesome. Greeted by very friendly staff the moment we arrived and catered to with sincere attention until the moment we left. The Hotel is brand new and very impressive with marble and infinite pools everywhere. Even the lobby and pool washrooms were topped with luxurious detail, including hand-wrapped face-clothes instead of paper towels.", "title": "Great Place for a Honeymoon", "helpfulness": 8, "user": "shrimpy-p", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137648750}, {"rating": 2.0, "title": "Not adults only...5 star resort, 2 star experience", "text": "The food was so good and abundant. Want a snack by the pool in the middle of the day? How about a new york strip steak and chips with guacamole with a side of BBQ ribs. If that doesn't suite your fancy you can also order off a room service card and have someone bring you a covered plate of delicious chicken nachos. If we stayed two-weeks I would need to sell all my pants and just wear a shower curtain or a moo-moo.", "helpfulness": 14, "user": "brucedlester", "date": "August 18, 2012", "id": 137574386}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The staff was very nice as expected, but I noticed a sincerity to their service that made our time with them especially enjoyable. As an example, I one day wanted to do \"a shot\" and asked the bartender what he recommended. His recommendation was \"a rainbow show\" which was like 8 shots and a magic show put together. Amazing. I was tipping about 200 pesos ($8) / day and got incredible service.", "title": "1st time in Puerto Vallarta", "helpfulness": 1, "user": "gumboeatr", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137484169}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We just returned from Secrets Vallarta Bay yesterday and couldn't wait to tell people how fantastic it was. We went to a Sandals in Jamaica 3 years ago and it was our first experience with all-inclusive. We thought it was great, but then we went to Secrets!", "title": "Most amazing all-inclusive!", "helpfulness": 10, "user": "Jared G", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136224063}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Positives: First of all, the property was stunning. The hotel was new and so well decorated - it was like staying in a very expensive hotel. The room was a \"Junior Suite\" and we had a king size bed with balcony looking at the beach, safe, HBO, mini-bar, double shower, jacuzzi tub, and once again, outstandingly gorgeous (and new, which = clean) decor. The hotel was empty - there was only ever 3 or 4 other couples in the restaurants at the same time as us. The restaurants were head and shoulders above what there was at Sandals. The food at Secrets was small, European portions of gourmet food. The service was great, so we tipped 50 pesos after most times eating at the restaurants. Even breakfast was served (not buffet, like Sandals) and was delicious. The Market Cafe was actually my favorite, but we also tried Bordeaux, Oceana, and Himatsu as well. Each one was almost empty so service was fast and attentive. My favorite was that they also had room service. If you wanted something not served in the restaurants, or you wanted to just stay in your room, or you wanted food at an odd hour, the room service took 30 minutes and they offered a lot of American foods (hamburger, chicken fingers) that weren't gourmet enough for the restaurants. The front desk was also great because they changed money for us, but the rate wasn't bank rate. They gave 12 pesos per dollar, while the bank rate at the time was 13.7 pesos to a dollar.", "title": "August 2012 trip and response to other reviews", "helpfulness": 14, "user": "limlim48", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136146925}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The location was great - we were a 50 peso cab ride from anywhere in downtown Vallarta. I know Neuvo Vallarta is the new development of hotels, but it was 30 minutes outside of Puerto Vallarta and didn't seem to have anything \"uncommercial\" to do out there.", "title": "Can't say enough good things!", "helpfulness": 5, "user": "Shmames", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135901542}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Tours: We went on 3 tours - 1 with Aquadventures to swim with the dolphins. It was great but they didn't let us take our own camera and ripped us off with the pictures. We went on the Outdoor Adventure with Vallarta Adventures and it was fantastic, professional, and well worth the price. They were a little better with the pictures - about 1/2 the price of the dolphin place. The last one was Rancho Capomo to ride horses. It was definitely a more family run operation. I wouldn't ride their zip lines and the horses were kinda beat up looking, but it was a good time and they didn't try to upsell us constantly with pictures and extras.", "title": "Great property - sales pitch put a damper on things.", "helpfulness": 6, "user": "Gina G", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 135495271}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Negatives: The didn't deliver room service to anywhere but your room. It would have been nice to have it delivered pool side. The drinks were a little watered down in my opinion, but they were free, so you could keep 'em coming! There were some storms at night that were incredibly loud and powerful and woke me up, but the rain made the next morning nice and cool. The grounds were smaller than Sandals, but the upside of that was no shuttle was required to get you from point A to point B.", "title": "First all inclusive experience", "helpfulness": 2, "user": "Cindy S", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135358402}], "location": {"country": "Mexico", "city": "Puerto Vallarta"}, "stars": 4.5, "variance": {"poor": 17, "average": 45, "very good": 153, "terrible": 9, "excellent": 431}, "slim_ranking": 0.0603448275862}