{"user_rating": 4.0, "review_count": 543, "name": "Secrets Aura Cozumel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife and I just returned from our visit to Secrets Aura. This was our fist trip to Cozumel, and second trip to a Secrets resort (prior was Excellence in the DR in 2005). I like many of you was a bit nervous about the trip after reading recent reviews....DON'T WORRY. We were in the back section of the resort, room 4015. The room was very nice and clean, no complaints at all. It was great being able to walk right out of the room into a pool, and a short trip down the water slide to the bar. The room did not appear to have been renovated recently, but it was still in good shape. Cleaning staff did an excellent job daily, and we got our Sundial if we had them do turndown service.", "title": "Great Stay....very nice resort", "helpfulness": 8, "user": "Scott S", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155967145}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Food was very good throughout the resort. Our favorite was Bordeaux. I honestly don't remember eating anything bad. Portions are small, but if you order something from each course of the menu you will have a great meal and be full. We ate at the buffet at Sabor for breakfast a few times, the food was very good, especially the pastries. Service was slow and the Mexican restaurant at Sabor, and for one meal at Windows on the Secrets side. Otherwise service was quick and always with a smile.", "title": "Our Fifth Secrets Resort - March 9 to March 16", "helpfulness": 9, "user": "HarryRCT", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155889050}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The best asset the resort has is it's staff. They go out of their way to always great you with a smile and friendly comment. From Check-in to Check-out we never had the slightest complaint about staff.", "title": "Third visit....can't wait for fourth!", "helpfulness": 5, "user": "rinkrat", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155854098}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The only think lacking at the resort is evening entertainment. When we stayed in the Dominican the resort had nightly stage shows, nothing fancy, but they were fun and gave everyone somewhere to go mingle and meet people. It seemed most people gathered at Skybar or the lobby each night for drinks.", "title": "Amazingly fun & relaxing", "helpfulness": 10, "user": "EEFus", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155737776}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If you visit Aura with a mentality that you are going to relax and have fun you will. If you are looking to find things wrong and nitpick you certainly can. We did not go with that attitude and had a great time. I'm sure I am forgetting things, and will update as they come to mind. But seriously, go with an open mind and you will love it.", "title": "First Resort trip....", "helpfulness": 8, "user": "Stefanie G", "date": "March 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155629656}, {"rating": 5.0, "title": "Amazing Trip!", "text": "Stayed here from 3/15 through 3/22 in a solarium suite with private pool. The room/staff/food/service exceeded our expectations every day! We were a bit nervous based on some previous reviews, the management has clearly worked hard to improve all aspects as we had no problems from start to finish! Do not hesitate to stay here! A special thank you to Victor and Roger from Windows, great service! I can not say enough good things about all the staff, they work so hard to make your trip memorable! The breakfast buffet is fantastic, loved the fresh kiwi & strawberries, and dinner at both Bordeaux and Windows was Spectacular!! Thank you Secrets staff! We would definitely return again!", "helpfulness": 6, "user": "Happy0Travels", "date": "March 31, 2013", "id": 156195166}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We went to this Secrets hotel understanding that it recently changed over to Secrets and assumed they would likely have some growing pains. We just arrived yesterday 03/30/2013", "title": "Terrible Service!!!", "helpfulness": 2, "user": "Ana W", "date": "March 31, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156184936}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "NEGATIVES: I never imagined we could receive such terrible service in the restaurants. We have went to 2 other similar AI in Cozumel and Playa Del Carmen and very much enjoyed both. This was terrible. On several occasions it took 15-45 minutes to get a Diet Coke or a simple beer. One example, we went to the Windows restaurant the second evening and there was people sitting at only half of the tables so it was not really busy. At about 30 min and no drinks I had to get up and walk to the Oceana bar to get our drinks. We received our Diet Coke and Pineapple Juice that I originally ordered at about 45 min and asking twice. I asked the waiter why it is taking so long and he said that it was his last night working there or that the guy responsible for getting the drinks last night, I couldn't understand which. We received our Salad at about 1 hr 15 min, then we received our cold main course at 1hr 30min. They brought out the Sous chef and asked what was wrong with the food at about 1hr 40min. We calmly explained our displeasure with waiting this long to receive cold food. It appeared to fall on deaf ears and looked like the chef and waiter was use to hearing complaints. They offered to cook us something else but after waiting that long we left at 1hr 45min hungry. The Oceana was similar service, we would see waiters standing and talking instead of serving the customers, I have never seen or experienced this at either of the two previous AI's that we went to. Went to Porto Fino at neighboring Sabor the last night we were there and it took 1hr 50min to get to our desert and then they told us they didn't have the dessert we ordered after we waited another 20 min for dessert. The entertainment crew seem to be tired from working too long of hours, they would start early in the morning and then go to late at night only to have to do the same day after day. The entertainment seem to be orientated to small groups.", "title": "A wonderful week in Cozumel", "helpfulness": 5, "user": "Shack2053", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156176365}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "POSITIVES: We booked the Ocean View Swim Up Suite. The room was beautiful clean, and the maid service was great. The Spa was wonderful, Carmen and Mariana did deep tissue massage on us and it was absolutely wonderful.", "title": "Great trip with little disappointments", "helpfulness": 4, "user": "Joycole", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156171184}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My partner and I just returned from a wondeful 7 night vacation at Secrets Aura. We flew direct from Boston to Cancun, then connected on Maya Air (a short 15 min commuter flight) to Cozumel. If you get the option, I would recommend to fly into Cozumel. The airport is small but most US airlines connect into there now, and it avoids the hustle and bustle of Cancun airport. To connect to Maya Air you need to shuttle to the old terminal. This is all pretty easy, but it all adds up to time away from the beach. The trip from Cozumel airport to the hotel is easy, as there are no cabs and shuttle buses are all organized out the front of arrivals. The resort is beautiful...there is no other word for it. An adults only beach-front resort with several pools and restaurants. The food and drinks were the best I have ever had in the Carribean. A real plus is the Rooftop Sky Bar, with two hot tubs to watch the sun go down in warmth with a drink! Next door is a sister resort that can be accessed for more food and social activtiies, but the nice thing is that the guests at that resort cannot visit Secrets Aura. You do feel you are in an exclusive enclave of comfort. The room we had was a penthose loft with a rooftop terrace and lap pool. We loved the privacy of the rooftop for sunbathing and reading. The resort overall is very quiest and never seemed crowded, and the staff were extremely helpful and pleasant. We especially appreciated Deena and Carlos at VIP services who gave us lots of info on the island and activities, Marina at the Windows Restaurant, and Fernando at Concierge Express who looked after us so well. Snorkelling, playing tennis, working out in the well-equipped gym, touring the island by Jeep and walking the beach were favorite pastimes. We would definitely return and highly recommend this resort to all.", "title": "Great Time!", "helpfulness": 6, "user": "Jon S", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155998572}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We are picky. We went with a group of 14 this past week. All I can say, is if you go with an open mind and realize this is Mexico, you will be fine. The place is working very hard to please its guests. I have stayed at most of the hotels on the island and have been to Cozumel 20+ times. I was worried upon reading the reviews ahead of time, don't be. If you are looking for perfection, then forget Cozumel, and I am a perfectionist, so you have to work with where you are at. End of day, the staff will do whatever they can to make you happy. Also, food/drink is great, and you can drink and eat all you want, order as much food/drink you want. The beach is the best on the island. Cozumel is not the mainland (Cancun/Akumal/Playa), so they don't have white sand smooth beaches anywhere on the west coast where the hotels are. So this beach is a bonus, and yes you need water shoes. If you walk up the beach either direction, you will see how fortunate you are at this resort.", "title": "Best in Cozumel", "helpfulness": 13, "user": "Jeff F", "date": "March 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155615590}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We travelled from March 9 - 16 and it's taken me a while to write my review because I wasn't sure how to do it. It was going to be really wordy but then I figured I'll just write as short a review as I can and if anyone has any questions I'd be happy to answer them just send me a message. We did lots of research before booking and were really excited about Aura until we found out about the changes and read recent reviews before our trip. We ended up having a great vacation at a fantastic resort that needs some small fixes.", "title": "Great Place!!!", "helpfulness": 5, "user": "newflyer00", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155557114}, {"rating": 5.0, "title": "Great resort", "text": "Check in: was a bit confusing and it wasn't busy when we arrived. I guess I'm used to standing in line at a counter and checking in but here you sit in chairs and I wasn't sure who was next and I don't think the staff knew either. This was the worst part of our vacation (check in and waiting for our room). We got mixed messages about our room being ready, first it was then it wasn't so we waited a few hours.", "helpfulness": 6, "user": "27thave", "date": "March 24, 2013", "id": 155517431}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Room: we had requested ocean view and were given what I call \"palm tree\" view. Open the curtain and there are the palm trees (literally in your face). I could see the ocean if I crouched really low and went to the right on our balcony. Anyway the rest of the room was great! Clean and large!! We were given an opportunity to change rooms and ended up in the perferred club in a spectacular room! It was amazing (1420). Great service from cleaning to turndown service!", "title": "Not yet up to Secrets standards but confident they will make it", "helpfulness": 1, "user": "TravelBiz213", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155494320}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Food: breakfast and lunch were good. We ate at the buffet next door a few times for breakfast beacuse there was just more of a variety and of course it was faster. When we ate breakfast on our resort we ate at Oceana (good chilaquilles) not sure how to spell it. My husband and I love authentic Mexican food and unfortunately this was hard to come by on the resort (strange but true). Dinner was difficult for me because they offered lots of seafood and I'm not a big fan of fish. They had chicken options but I eat chicken all the time at home and wanted something different. Sometimes I would order 2 appetizers and dessert. I made due. My husband enjoyed most of the food but said some of it tasted as though it had been frozen. We did not enjoy Bourdeax at all! We didn't eat at Windows although I heard good things. We never waited long for food. Menu seemed to be the same every day (options would've been great). My husband loved the beach dinner. It was his favourite meal. My favourite was off the resort in town when we went shopping (really good Mexican food).", "title": "Birthday Vacation", "helpfulness": 6, "user": "Debi D", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155470557}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I am not sure about any negative reviews regarding the Aura Grand, but I had a PERFECT time. The service was top notch and all staff was VERY helpful and VERY kind. I think the people who have a hard time at places like this are what most call the \"ugly American\" travelers who want everything to be like an Applebee's or TGIFridays. Slow service at a seaside restaurant is a blessing. One course after another spaced out over an evening is fine dining.", "title": "If you can find better...book it", "helpfulness": 12, "user": "jimdrw", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156645114}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The poolside service was INCREDIBLE. Gilberto was literally running drinks and food to us all day. It's amazing what a few kind words and dollar bill tips will get you...hmmm.", "title": "Peaceful Seaside", "helpfulness": 8, "user": "kmorrow27", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156627159}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The entire staff simply does not stop cleaning, combing the beach, arranging beach parties, or bringing you whatever you want. Seriously, if you can find better you need to book it.", "title": "Fabulous", "helpfulness": 14, "user": "canadamaus", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156362461}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My husband and I traveled to Secrets Aura Cozumel March 28-April 3 2013. The hotel was still under some construction, but nothing that got in the way of our wonderful vacation. We flew into Cozumel, which was much nicer than flying into Cancun. We were hassled a little to buy some trip excursions, but not hard pressed. We booked a shuttle through Olympus Tours. It wasn't a personal ride, but the hotels are all fairly close together, so it wasn't much of an issue. We drove down the main road through the tourist part of downtown. It looked cute and quaint, however we didn't spend anytime there. When we arrived at the hotel we were greeted with champagne and a friendly staff. The check in was quick and efficient and we were shown to our room. We stayed in building 42 (near the back pool with the swim up bar (not really a swim up as the bartender wasn't on the swim side) on the third floor. It was nice, but didn't seem to have been updated yet so it didn't look like the pictures online. Bed was comfortable, there was a docking station clock and dvd player. The air conditioning was alright, it kept the room cool enough. There were a few little ants running up and down the wall between the unit and the floor, but it wasn't many and we didn't see any other bugs in our room. After we steeled in, we wandered over to the Sabor/Sunscape side during the first afternoon and were stopped by a vacation club representative (which we didn't realize at first), He sat us down, showed us a map, offered us some incredible deals (24 hour jeep rental and snorkel tour for two for just $30). We had to sit through a timeshare type presentation the next morning in order to get the deal. The presentation wasn't too bad, 2.5 hours as opposed to the 1.5 they stated, which we weren't happy about, and they definitely pushed us hard to buy. We declined and received $125 in vouchers for the excursions. We were glad we had done it as the jeep rental, which is usually $80 for a day took cash only, so without the vouchers we wouldn't of had enough cash. Snorkeling was a lot of fun. We went on the 9:45 boat and were taken to three different spots. We only had about 10 other people on our boat which was nice since you all have to stick together. The jeep rental was also a lot of fun. We wished we had brought more cash as the east side of the island is cash only. We drove around most of the island in the jeep. We went to the tequila factory, which was interesting (and they took credit cards). Our favorite spots were the restaurants and bars on the east side. We only went to Coconuts, but loved it. Fun vibe, delicious food (mixed fajitas and guacamole), and tasty drinks. The prices were listed in pesos (although they accept dollars) and they aren't necessarily cheap, so make sure you have enough cash. The view there was AMAZING. I could have sat there all day. We felt safe driving around and exploring the island, something we wouldn't have done on Cancun. At the hotel, we enjoyed laying by the pool, jumping off the pier into the ocean (which had big rocks, not small so it was fine to walk into without water shoes), floating, eating chicken fajitas, ceviche, and guac (all delicious) off the Barefoot Grill menu, and of course lots of drinks! The workers were all very nice and did their best to please everyone, although they did seem a little under staffed. The pool areas weren't always cleaned up, so we'd find some drink glasses still left over in the morning. Also, there were room service plates and cups out in the open hallway over night.They could've used more than one bartender at the front bar (he was making drinks for the entire front pool, restaurant, and beach). He did a wonderful job keeping up with the demand, but it would've been nice to have someone there to help him. Dinner restaurants were delicious, although we would've liked some more variety. Portions weren't as small as I was expecting (based on other reviews I'd read). My husband and I typically shared a couple appetizers, both got a salad, and then one entree each. It was plenty of food. Sunsets were amazing from the sky bar or just laying on the lounge chairs at the beach. The hotel was very quiet and peaceful, all couples and not at all a late night party crowd. People at the pool were social and had a good time, but by sunset everyone was dressed for dinner and the scene calmed down. So to sum up, Cozumel is a beautiful and safe island. Bring enough cash to tip and explore the island. Definitely plan on visiting at least one of the beach restaurants on the east side. Bring aloe if you tend to get burned (which I do and I wish I'd had). Be prepared to relax and enjoy an unforgettable vacation at the Secrets Aura.", "title": "Fab!", "helpfulness": 8, "user": "HeraOToronto", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156331256}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "What a fabulous vacation at Secret in Cozumel.", "title": "Excellente!!!!", "helpfulness": 7, "user": "SAH25", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156326970}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 63, "average": 93, "very good": 182, "terrible": 23, "excellent": 182}, "aka": "Aura Cozumel Grand Hotel Cozumel", "slim_ranking": 0.438596491228, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Unlimited luxury now in Cozumel. Not only the perfect place for the celebration of love, if you desire pampering and seclusion in the Mexican Caribbean, look no further than Secrets Aura Cozumel. More than just a place to unwind, this All Inclusive - adults only getaway offers a stylishly contemporary environment for guests accustomed to the best. Each suite indulges with an inviting blend of light and comfort, as well as a private balcony featuring beautiful views to the grounds or the Ocean. Secrets Aura Cozumel has a unique category of rooms with access to the pool from the terrace and slides to the Swim up bar. For those looking for a most intimate getaway, a unique concept of Loft Suites with solarium and a private lap pool with magnificent ocean views is also available only at Secrets Aura Cozumel."}