{"user_rating": 5.0, "review_count": 247, "name": "Sedona Cathedral Hideaway", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Let me just start out by saying that I have never written a review on anyplace I have stayed in the past until now. My husband and I would not even consider staying anywhere else in Sedona but the Cathedral Hideaway. We were spoiled for life by Kathy and Larry at this luxurious B&B.", "title": "Perfect Wedding Memories", "helpfulness": 1, "user": "TexasTravelersJK", "date": "November 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21588532, "likes": {"liked": "— Location and the owners", "disliked": "— That's it's so far from Houston"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "From the moment we drove up to their home among the stunning red rocks, we knew we had found the perfect place. Our stay was extra special because we had decided to be married in a private ceremony on the property with Cathedral Rock in the background. It could not have been more memorable.", "title": "Ultimate in tranquility", "helpfulness": 1, "user": "LETL", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20929095, "likes": {"liked": "— Larry and Kathy", "disliked": "— Room was too warm"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "It's one thing to be the perfect host and hostess of a B&B, which Larry and Kathy undoubtedly are, quite another to participate and make sure everything was in place for a wedding. Especially with a stressed-out bride-to-be---but they were up to the challenge. They provided so much to make our day special---the flowers, music, photography, a view, but most importantly they gave us their support and kindness. As the commercial goes \"priceless\".", "title": "A Wonderful Stay", "user": "GP_NY", "date": "October 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20887216, "likes": {"liked": "— Location, Cleanliness, Owners", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Perfect wedding aside, they take the word \"pampered\" to a whole other level. Their attention to detail is incredible. They have thought of everything to make your stay relaxing and memorable. Also--take any recommendation they give you for sight-seeing or dining. You won't be disappointed.", "title": "Memorable, personalized experience.", "user": "BMF_Illinois", "date": "October 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20800968, "likes": {"liked": "— Personal attention by hosts.", "disliked": "— Very limited cellular phone service at this time."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "You cannot write a review on a B&B and not talk about the food. I have never had a better breakfast at a B&B or any place I have stayed. The French toast is amazing and that's only the start. We were lucky enough to spend 4 days there and still were not able to try everything on the menu.", "title": "The Authentic Energetic Healing Place", "user": "SouthwestGrace", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20623459, "likes": {"liked": "— Its location at the foot of Cathedral Rock", "disliked": "— Not applicable. We loved every thing and every minute --- unheard of these days."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I researched places to stay in Sedona online and came across this gem and thought \"wow, that looks perfect\" and it was!", "title": "If you want an outstanding value and your faith restored in people-stay here.", "user": "mariahovatter", "date": "December 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22840801, "likes": {"liked": "— the house/building itself with all its features, its location and the caretakers", "disliked": "— not a thing. i couldnt have been happier."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I really wanted the \"Sedona\" experience- one of pampering, access to nature, and adventure-within my budget.", "title": "B&B Magical Mystery Tour", "helpfulness": 1, "user": "Bepporag", "date": "December 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22695179, "likes": {"liked": "— location, amenities, hosts"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Larry and Kathy, who are the owners of this one of a kind place, do everything within their power to create a perfect experience for you before, during and even after your stay.", "title": "Best personal B&B experience ever!", "user": "hamburgguy", "date": "December 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22526482, "likes": {"liked": "— The excellent hospitality and beautiful accommodations", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My husband and I celebrated our 5 year anniversary and without a doubt, this place is spectacular- from the cooked to order gourmet breakfasts, to accurate recommendations on restaurants and tours, to private bookings of spa treatments, EVERY detail is coordinated with the utmost of care, concern and just genuine good heartedness. They take care of you just like loving family and make you feel comfortable even though you have never been there before.", "title": "Our perfect place to elope!", "helpfulness": 1, "user": "brandonandalexia", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22150719, "likes": {"liked": "— Feeling so comfortable in their house, from the room to the hosts.", "disliked": "— absolutely nothing! ...Wish we could of stayed longer."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "If you want your faith restored in the general good and kind nature of people, as well as feeling like you received an outstanding value for your money, stay at this place!", "title": "Relaxing stay, peaceful location", "user": "ScottAndGina", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21846337, "likes": {"liked": "— Fantastic made to order breakfasts served outside on patio with beautiful view", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed in the Evergreen room for one week. The home is beautiful and the views from the deck are stunning. Delicious breakfasts, gracious hosts and the best shower ever. Sedona is a wonderful little town. If you want to shop, hike or eat well (or all three) you will be very happy in the beautiful setting of Sedona.", "title": "Delicious breakfasts, gracious hosts & the best shower ever.", "user": "MaineIzzy", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27184662}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Sedona Cathedral Hideaway was absolutley amazing! Kathy and Larry are wonderful hosts, make you feel at home yet you have privacy. The room was large and immaculate with gorgeous view of Sedona Mountains. The sleep number bed was the most comfortable thing that I have ever slept on. You have everything you need in your room: Microwave, Fridge, Slippers, Robes, Warm Towels, TV with satellite and DVD, amazing organic chemical free body wash, toner etc. and treats and snacks in your room. For breakfast you have choice from yummy menu, the Larry's Breakfast Pizza and Kathys Smoothie was fabulous. I would recommend this to people who want a relaxing weekend in uttmost luxury.", "title": "Amazing luxury Hidden In Sedona!", "user": "libbjn", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26817657}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Where to begin?? The Cathedral Hideaway surpassed both mine and my wife's expectations from start to finish. The house(which is incredible) has a million dollar view and our room(more like a suite) had the same view from several spots. We also had a private balcony to enjoy the view at sunset and then to watch the stars from later that evening. The room was like a luxury suite from every aspect. Kathy and Larry who own and run this B&B were more than hosts, they quickly became our friends. You can tell they truly love what they do and are there for you. There hospitality, generosity, and culinary skills are second to none. We had one of the best breakfasts we have ever had. We had to take pictures of it before we could begin to eat it as it was like art work. We enjoyed the breakfast on the patio and watched the hummingbirds and finches feed while soaking up the views. Although this was a bed and breakfast you received more than just breakfast. They had everything you needed from water and soda(stocked all over the house) to cheese and crackers. They even have the most amazing home made ice cream to treat yourself to anytime of the day. My wife and I had a tough time leaving and we have not quit talking about how wonderful our trip was and when can we go back there again soon. They truly thought of everything. My wife and I travel domestically and internationally and they have raised the bar. Now we will be forever comparing our stays everywhere else to this our stay at Sedona Cathedral hideaway.", "title": "Our only regret is not staying longer", "user": "zeusaz1", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26518131}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed there for our honeymoon and had a great time. Larry and Kathy were very gracious. The B and B was a great location from a multitude of hiking trails. It was pricey, but worth it. It was nice that it was off the main drag and you could enjoy the serenity of the area.", "title": "Would stay there again", "user": "Nicole B", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26170433}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Kathy & Larry are awesome hosts. Both were very friendly and made the weekend great. I highly recommend Sedona bed & breakfast and specially Sedona Cathedral Hideaway.", "title": "Very Nice room and wonderful views", "user": "mendeecoxnet", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25992383}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We just got back from our 2 night stay at Sedona Cathedral Hideaway. When Kathy greeted us at the door I had no idea I had booked a \"true\" bed and breakfast. We have stayed before in bed and breakfasts but they were more like hotels with a hot gourmet breakfast and the owners living in a different building. When I realized we were staying in a strangers home I instantly felt uneasy but Kathy and Larry and their warmth lifted my uneasiness and I felt so welcome in their beautiful home.", "title": "The best hidden gem we have been to", "helpfulness": 1, "user": "Minybear", "date": "March 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25804578}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Kathy and Larry go above and beyond for you to make your trip special. They would point out places for you to see and mark it on a map. Tell you everything about Sedona. Next time we go to Sedona we will stay at Sedona Cathedral Hideaway and we will not make any prior arrangements to do any Jeep tours but have them point out where we should go and take it from there. Kathy did take us to Oak Creek/Red Rock Crossing which was about 10 minutes from them. This was the highlight of our trip.", "title": "pure luxury with gorgeous views and super nice couple owners", "helpfulness": 1, "user": "Pittsburgh_PATeach13", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25139244}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed in their Safari room which was huge. This room had a sleep number bed, a huge living room area, a flat screen TV, and a massive bathroom which had a shower for 2 and a soaking tub for 2.", "title": "Best B&B ever", "user": "Couple4theLord", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24975529}, {"rating": 5.0, "title": "Above and Beyond", "text": "My dream romantic vacation was to stay in a beautiful home, with a million dollar view of Cathedral Rock, with many trees surrounding the house and seeing lots of nature from the house. Un-known to me when I booked this I found this place at Sedona Cathedral Hideaway. Kathy and Larry made our romantic getaway truly special. They even extended the romance at breakfast time with little bears that sang a cut little song for your breakfast.", "user": "A TripAdvisor user", "date": "February 17, 2009", "id": 24698878}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "To sum up our trip Sedona Cathedral Hideaway is definitely a hidden gem. If you are looking for high class, serenity, concierge service and some pampering your looking in the right place.", "title": "The Best Experience", "helpfulness": 2, "user": "SCarolinian", "date": "January 11, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23468845, "likes": {"liked": "— The views, the splendid house design, the amenities, the breakfasts, and the hosts", "disliked": "— Nothing"}}], "location": {"country": "United States", "city": "Sedona"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 246}, "slim_ranking": 0.09375, "description": "A new, private sanctuary with spa services. Personal attention like no one else offers with two large luxury suites. Everything designed for your needs and taste. A one-of-a-kind B&B where indulgence meets peace and tranquility on two breathtaking wooded acres; on a hill overlooking the famous Cathedral Rock & Pyramid Peak. Let the star studded sky, wildlife and friendly hummingbirds win your heart. Labyrinth & medicine wheel on site. Read traveler reviews for more details."}