{"user_rating": 4.0, "review_count": 503, "name": "Seelbach Hilton", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Our family had a wonderful reunion weekend at the Seelbach and survived a big concert weekend in Louisville with no problem at all. We found the staff to be extremely helpful and were especially impressed with the 19th century bar and lovely lobby. As is often the case in old hotels like this, our 10 rooms varied in size and decor, making this all the more charming. Big thank you to the bar staff for their excellent service and attention!", "title": "Beautiful historic property", "user": "paula1947", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144504757}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "If I was a Hilton honors member and need to find a hotel in Louisville, I would recommend staying at the Seelbach Hilton Louisville. From working in Louisville over the last two years I have discovered that there are many great attributes about staying at the Seelbach Hilton Louisville. The best attribute about the Seelbach Hilton Louisville is the location. The Seelbach Hilton Louisville is located downtown next to Fourth Street live and many good restaurants and bars. I have stayed at the Seelbach Hilton Louisville a few times but never dinned at the hotel itself. The hotel does have a restaurant but there are better restaurants within walking distance. When staying at the Seelbach Hilton Louisville you has easy access to a great Starbucks coffee franchise and world class bourbon bar. I find the bourbon bar at the Seelbach Hilton Louisville to be boring but they have an amazing selection of bourbons that will not find anywhere else.", "title": "Great business hotel located downtown Louisville", "user": "mdditt2000", "date": "October 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144033461}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The hotel has a long history has been frequented by many notable Americans for instance F. Scott Fitzgerald, who took inspiration from the Seelbach for a hotel in the Great Gatsby. Many gangsters such as Lucky Luciano, Dutch Schultz, and Al Capon who was a frequent guest of the Seelbach stayed at the hotel, often for secret poker games. Stories say Al Capone sneaked out of the hotel through a series of secret stairways and tunnels when Louisville. Basically the Seelbach Hilton Louisville has a ton of character.", "title": "So Not About the Customer", "helpfulness": 1, "user": "JayG1027", "date": "October 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 143559922}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The check-in process is very easy. The staff behind the counter always seem to very friendly and accommodating. Hilton honors status at the Seelbach Hilton Louisville plays a huge role to getting a better room or upgrade. Since I only have blue Hilton status I normally receive a room on the second floor. However the room was very quiet and bed was extremely comfortable. My colleague with Diamond Hilton status always receives an upgrade or better room on a higher floor. He also receives access to the Hilton lounge where they provide snacks, breakfast and drinks. The in-room coffee, soap, shampoos are excellent. What I like best about the Seelbach Hilton Louisville is the easy access to parking at the back for the hotel. Parking is fairly cheap and operated by the city of Louisville.", "title": "Luxury in a great location!", "user": "Naberius", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143392836}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "When it comes to conferences, thunder weekend and the Kentucky Derby it can be very difficult or costly to get a room at the Seelbach Hilton Louisville. During busy times the hotel cares more about the business than their corporate guest who stay at the hotel during the year. I recommend you you’re your hotel stay in advanced. However the Seelbach Hilton Louisville is a great hotel and option when staying at in Louisville.", "title": "Great getaway...", "user": "Luck-o-the-Brirish", "date": "October 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143222580}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I barely recall staying at this hotel about 40 years ago, when I was not quite a teenager.", "title": "Grand old hotel, beautiful but a bit cranky", "user": "cincydoc2011", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142926153}, {"rating": 5.0, "title": "Nice Stay!", "text": "I recall that it was a bit stale and beginning to show it's age then.", "helpfulness": 1, "user": "Amie H", "date": "October 15, 2012", "id": 142892017}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The high ornate ceilings and plenty of woodwork are still there, but now", "title": "Nice Location", "user": "Lynda H", "date": "October 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 142872970}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "it truly is a beautiful old hotel, lovingly restored.", "title": "Old school hotel which needs more old school staff", "user": "TravelingChumley", "date": "October 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142748965}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "It was a bit difficult at first to get my bearings and find out how to get to the main entrance on 4th Street and drop off and valet parking.", "title": "Wonderful Experience", "user": "Erin S", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142326739}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My husband and I booked the \"Romance Package\" through direct e-mail with the Seelbach. With this package we were immediately upgraded to a beautiful 1 bedroom suite on the 6th floor. The room was very large and exceptionally clean, with a separate living room and large bedroom with king bed. As other reviewers have noted, the bathrooms are small, but very nice, and this is a very old hotel that has worked hard to successfully maintain its rich, historical feel. Our room rate included breakfast each morning (either through room service or at their cafe in the lobby), and we opted for breakfast each morning in our room. Particularly good is the Capriole Farm goat cheese egg scramble, and the cheese grits. We also ordered room service for dinner several nights. Room service food was delivered hot and delicious. At check-in, we requested the concierge floor, but no suites were available. However, we were given complimentary access to the concierge floor, which was very nice. With the romance package we also enjoyed a complimentary bottle of champagne, which was in the room when we arrived, chilled and very tasty after a long drive! We also requested a fridge for the room, which was delivered within minutes. The box at the lower part of the door to your room is to leave your shoes in if you want them shined. Took me a minute to figure it out until I looked inside! We enjoyed drinks and appetizers in the Old Seelbach bar located in the lobby several nights, and were free to explore on our own the entire hotel, including the Rathskeller room, which is incredibly beautiful. There is no pool or spa on site. Overall a first rate experience in this historic, national treasure! While in Louisville, don't miss a tour of the Conrad-Caldwell Mansion in Old Louisville.", "title": "A Step Back in Time", "user": "ilona06", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145684671}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "As a Hilton Diamond member I have been staying at the Hilton Seelbach on and off on business for many years and I can honestly say that my experience(s) have been consistent.", "title": "High Standard for Hilton property", "helpfulness": 1, "user": "Wildcat1897", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 145355084}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The Seelbach is a historical hotel so it has a funky layout with many different types of rooms.", "title": "Historic lobby, helpful staff, run down rooms", "user": "GeneDoc57", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 145354934}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Ive stayed in rooms smaller than a standard bedroom all the way up to the Gatsby and Seelbach Suites which are larger than most bachelor apartments.", "title": "Elegant historic hotel", "user": "WorldTravelers1218", "date": "November 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144694969}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The General Manager John runs a tight ship and his staff at the front desk and the restaurants are eager to show why they are the best gig in downtown Louisville.", "title": "Springsteen weekend in Louisville", "user": "Chet T", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144667925}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "What we liked: The location, 4th street live is just a half block away. The ambience, it is beautiful old hotel with wonderful common spaces. The staff, they were lovely.", "title": "Good location, but a bit of a disappointment.", "user": "hometowntraveler", "date": "October 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142027156}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "What we didn't like: The bathroom was so small that I could not sit on the toilet. The toilet roll holder extended to the space over the toilet. We asked to change rooms and were given a room on the HIlton Honors floor that had a normal sized bathroom. I resent paying for wi-fi in this day and age. Come on folks.. that is silly. It is free at HIlton Garden Inns, for goodness sake.", "title": "Great Historic Hotel", "user": "BoysInNY", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141915000}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "There was no refrigerator in the room; they said they would send one, but never did. They apparently ran out.", "title": "Not a very good nights sleep... request room away from elevator.", "user": "lskanes", "date": "October 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 141747944}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Seelbach Hilton is a very nice hotel in downtown Louisville. The location is great for nightlife. It is across the street from Fourth Street Live, which is a nice pedestrian area with bars and restaurants.", "title": "Loved it", "user": "arobertsonbgr", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141174810}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "The hotel staff is wonderful! Every time we walked through the door, the doormen would hold the door for us and say hello. The front desk staff was very nice and orderly, making check in a breeze.", "title": "Rude front desk but nice waitress", "user": "melaniealison", "date": "September 20, 2012", "detail_rating": {"cleanliness": 3.0, "location": 4.0}, "id": 140813335}], "location": {"country": "United States", "city": "Louisville"}, "stars": 4, "variance": {"poor": 39, "average": 82, "very good": 176, "terrible": 22, "excellent": 184}, "aka": "Seelbach Hilton Hotel Louisville", "slim_ranking": 0.322916666667, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Historic Downtown Hotel with Old World Charm and modern amenities - Home of The Oakroom, Kentucky's only 5 Diamond restaurant."}