{"user_rating": 4.0, "review_count": 88, "name": "Sel Hotel Myvatn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "First I should say visiting a remote portion of iceland in the dead of winter may not be for everyone. I went in Feb. 2007 with my husband and his parents and we had the time of our life. The people at the hotel are INCREDIBLY helpful with anything you can think of. The package I booked included breakfast and dinner. Breakfast consisted of a buffet and dinner was a preset 3 course menu. All the meals were wonderful and in fact the trout was the best I have ever tasted. If you have dietary restrictions, I am sure they could accomodate. As with all things in iceland .. things are expensive. Their are a number of excursions you can book through the hotel. In fact you do yourself a diservice if you do not get out and explore. We took Nordic horses accross the frozen lake, took a super jeep out to a remote section of the island to see waterfalls, took a tour around the lake to see the bubbling sulphur pots, bore holes and lava fields. Another thing not to miss is the Mytvatn nature baths, a geothermal pool outside in the mountain side. We stayed at the hotel for about 3 days which is enough to take everything in. We were lucky to catch the northern lights by taking a quick walk away from the hotel lights. The hotel is def. not a five star by US standards, but the rooms are big enough, the beds are comfortable. The only downside was the mini size sink in the bathroom and the small stand up shower. The bathroom floors however are heated and there are heated towel racks which are a bonus.", "title": "Love Sel Hotel Myvatn", "helpfulness": 10, "user": "vicky95", "date": "February 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6821448, "likes": {"liked": "— The surroundings and food", "disliked": "— Expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Nice hotel over looking the Pseudo craters. We didn't eat dinner at the hotel we ate in Reykjahlíð but breakfast is good and we had a few drinks at the bar, which is important as this place like so many others is very isolated. Staff were friendly, if sometimes a little slow (the word speedy doesn't exist in Iceland).", "title": "Not bad at all", "helpfulness": 1, "user": "woodymark2", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 31209779}, {"rating": 2.0, "title": "Nothing special except location", "text": "All in all a great little hotel.", "helpfulness": 1, "user": "THECLEVERADVISOR", "date": "January 1, 2009", "id": 23155783}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Nothing special except location. Not much choice around.....So you may well book it. Kind of empty but clean.", "title": "Best place for the pseudocraters of Myvatn", "helpfulness": 1, "user": "Mianel", "date": "October 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20940995, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just opposite the famous pseudo craters of Myvatn. Spacious room with a nice view over the lake and the craters. We stayed here two nights in early July, 2008 for vacation. Friendly staff. As there is nothing else in the neighborhood best thing is to take the dinner buffet in the hotel, which was enjoyable. The location of the hotel is excellent to survey the Myvatn area.", "title": "Absolutely excellent", "helpfulness": 2, "user": "HandAL", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13938038, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "Not a bad hotel but a bit overpriced", "text": "What a hidden treasure this Hotel is. It is run very professionally yet extremely friendly at the same time.", "helpfulness": 2, "user": "KateSkate", "date": "November 28, 2007", "id": 11123193}], "location": {"country": "Iceland", "region": "Northeast Region", "continent": "Europe", "city": "Myvatn"}, "stars": 3, "variance": {"poor": 8, "average": 22, "very good": 31, "terrible": 1, "excellent": 26}, "slim_ranking": 0.6}