{"user_rating": 4.0, "review_count": 413, "name": "Senator Parque Central Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Admittedly we got a great deal which possibly coloured our view but even allowing for that we enjoyed a large room, well equipped (OK, not overboard on toiletries but great to find a free soft drink mimi bar).Without exception, every member of staf we encountered was courteous, friendly and very helpful. At only 15 minutes walk to the centre (much closer than many other 4 star hotels we considered) it was accessible and we would not hesitate to return and will highly recommend to anyone we know who is planning to visit Valencia", "title": "Possibly the best value we have had", "helpfulness": 5, "user": "cityl0ver", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113878803}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My boyfriend and I stayed here for four nights to celebrate his birthday and were really pleased with our choice. On arrival the staff were helpful and made conversation, most of them spoke English too. We did notice a shortage of staff as the guy behind reception one night was also the bar man. This wasn't an issue though as they were always very efficient. The rooms are very spacious and well kept - hygiene and cleanliness are a must for us and they certainly met our standards. Location-wise it's a 15 minute walk into the main town centre where there are restaurants galore and the Plaza de Toros (bullring). Also within walking distance to the hotel is Valencia Cathedral (further 15mins from centre) and the Arts and Sciences Centre is approx 30min walk. There are also nearby restaurants including a Chinese buffet where we went for dinner on the night of his birthday (probably the best buffet we've ever had for reasonable price too). Prior to dinner we had a knock on our hotel door and was pleasantly surprised when the bar man (also the receptionist) rolled in a bottle of champagne chilled on ice. This made for a very pleasant and romantic end to the evening.", "title": "A lovely hotel in a decent location", "helpfulness": 2, "user": "Avidglobetrotters", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113658044}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I'd say the only down side was that they didn't offer currency exchange and didn't change the bedding each day. Other than that we thoroughly enjoyed our stay and would certainly recommend this hotel.", "title": "good price, nice room... but", "user": "qstnmk", "date": "May 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 110603009}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We choose this hotel mainly for the good price.", "title": "Comfortable Value Hotel in Great Location", "user": "SouthCarolinaMax", "date": "May 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110349046}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Room: I had a king double which was really good. Very big, nice bathroom, good bed. Free internet access but absolutely no English language TV and I overlooked an internal atrium which gave me a sense of being trapped indoors!", "title": "Comfortable but no character and too far from town", "helpfulness": 1, "user": "AllanBLondon", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 118272726}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Hotel: no character at all. The bar was always empty and had no atmosphere. Smell of choline in lobby..", "title": "Senator Parque Central Hotel", "helpfulness": 3, "user": "JohnBPantego_NC_USA", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 118012932}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Location: They say its 15 mins to the centre, which it might be, but its more like 30 mins to the old town (walking). To be fair, it is on the edge of Russafa, and there are plenty of things around, and its not far from town, but for me just that bit too far. I ended up getting taxis a lot. Also, the room is located on a huge junction, which is not very nice.", "title": "Decent base and approachable staff-we love Valencia", "helpfulness": 6, "user": "Mizz G", "date": "September 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117859679}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Service: OK, but Sylvia was very helpful.", "title": "Best value for money ever", "helpfulness": 9, "user": "MarcosCRO", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116672047}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Great hotel. Bedroom was large by European standards, great bathroom. Wonderful AC. Kept room cool and comfortable in hot Valencia. Guest services tried, but they only had one person that spoke broken English on staff. They need to upgrade their staff to multilingual. The city is trying to encourage more travel from the East, and they are going to have problems if the staff only speaks Spanish. Most travelers from the East, who can afford to travel that far speak English as a second language.", "title": "Fantastic", "helpfulness": 1, "user": "Cuchuflet", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115821004}], "location": {"country": "Spain", "region": "Valencian Country", "continent": "Europe"}, "stars": 4, "variance": {"poor": 11, "average": 62, "very good": 181, "terrible": 18, "excellent": 141}, "aka": "Hesperia Parque Central Valencia", "slim_ranking": 0.207920792079}