{"user_rating": 4.0, "review_count": 748, "name": "Senator Gran Via 21 Hotel", "reviews": [{"rating": 5.0, "title": "Fabulous Hotel", "text": "We stayed at the Senator Gran Via on the 16th and 17th March 2006. The hotel is one of the best 4 star hotels I have stayed at and has some lovely 5 star touches such as the free mini bar and the free dental and shaving kits in the bathroom.", "helpfulness": 4, "user": "claresimpson", "date": "March 20, 2006", "id": 4695053}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "They also offer free fruit and some drinks beside the reception desk.", "title": "A great place to stay!", "helpfulness": 6, "user": "IainSpain", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4628417}, {"rating": 5.0, "title": "Fab hotel", "text": "Room 206 is a decent size with a large wrap-around balcony overlooking the Gran Via.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4628369}, {"rating": 5.0, "title": "Excellent", "text": "There is a good police presence in the area and if you are a couple you will be ignored by the working girls. If you do find the street where the girls are (Calle Montera) not to your taste then walk up the Gran Via to Calle Carmen/Calle Preciados (2 minutes walk) and turn down one of them to get to Plaza del Sol.", "helpfulness": 7, "user": "mac2kGibraltar", "date": "March 14, 2006", "id": 4615911}, {"rating": 5.0, "title": "Great Hotel", "text": "I have just returned from a 3 night stay in the Senator Gran Via. I thought the hotel was excellent and thoroughly deserving of a TripAdvisor 5 star customer satisfaction rating. The staff were extremely helpful at all times. Any request made to them was handled professionally and politely. We stayed in a very nice room on a high floor. The room was not huge, but it had everything a traveller could ask for (including a free mini bar). The area around the Gran Via is very good for shopping and sight seeing, with most of the major attractions within a 15 minute walk. I would recommend paying for the bus tours but would advise all travellers to stay away from eating out in some of the more popular tourist areas. The Plaza Mayor is very nice, but the food in the cafes/restaurants leaves a lot to be desired.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 24, 2006", "id": 4514023}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The hotel service is quick to respond, the rooms are clean, and the location is very central to everything. The hotel will request payment at check in rather than at check out, which is a bit unusual but ok. I would stay here again.", "title": "Neutral / average", "helpfulness": 1, "user": "Travelman48", "date": "August 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5573689}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "People whose items are stolen. Shame on you. If you had done any research on Spain, any, you would know theft is a big problem. Where do you leave your carry-on luggage when at an airport? Always keep on eye on your personal items!", "title": "Another theft from the hotel reception area!", "helpfulness": 5, "user": "Lea61", "date": "August 2, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 4.0}, "id": 5540377, "likes": {"liked": "— Location", "disliked": "— Lack of concern and assistance when theft occurred within minutes of arrival at hotel"}}, {"rating": 5.0, "title": "Central and comfortable hotel", "text": "Like a previous reviewer we had the distressing experience of having a bag stolen from the reception area as we were about to check in. If the reception staff invite you to leave your bags while you have a welcome drink......don't do it! Not sure if what is going on is an inside job or not but two similar incidents in the same week is a bit suspicious. Like the other reviewer we found that staff were not really concerned about the theft, did not pass on information to other staff and we have still to hear from the manager! We did finally get a bottle of champagne and bowl of fruit with an apology but this was only after we spent several hours at the Police Station giving a report (not a nice experience) and several hours and hundreds of dollars replacing medications, toiletries etc. Nothing was irreplaceable and we tried not to let it spoil our holiday but if these thefts are happening within the hotel i can only warn all potential visitors to be vigilant with their belongings. And don't expect much help from the staff!", "helpfulness": 5, "user": "deeva72", "date": "July 30, 2006", "id": 5527236}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We booked this hotel after many reading the rave reviews on tripadvisor and once again, the reviews were all very accurate and we enjoyed our stay at this hotel. It is in a very central location in Madrid - right by the metro, shops and restaurants along the Gran Via, and 10 min. walk to Puerto Del Sol. It was great to be in the center of the hustle and bustle.", "title": "Fantastic choice", "helpfulness": 4, "user": "ElenaFG", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5491247, "likes": {"liked": "— location, value, cleanliness, minibar"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "However, it is right by the red light district where there prostitutes along the street if you turn left when you leave the hotel on the side street. However, this did not bother us as I had known about this after reading the reviews and we did not feel unsafe when walking down the street. If anything, we found it entertaining as it looked like a highschool prom with scantily dressed girls.", "title": "Great Hotel!", "helpfulness": 4, "user": "KnD.Moore", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5478902}, {"rating": 4.0, "title": "Great hotel", "text": "We just returned from a 1 wk. stay at this hotel. This is a great hotel & I'd stay here again. The staff is friendly, helpful, & most speak english. No problem with the reservation or room rate. The elevators are prompt & quick. The location is on Gran Via with easy access to taxis & metro stop in front of hotel. Rooms are clean & very well appointed. There isn't much they don't provide in the rooms; TV, internet, radio/CD, free (yes, free) mini bar w/sodas, water, & beer, plenty of toiletries, magnifying mirror in bath, hair dryer, electric beds, balconies w/ view of Gran Via, cold AC, ceiling fan, too much to list. The breakfast is first rate with plenty to choose from as well as short order for eggs, bacon, etc. There is a small grocery around the corner for snacks. TV is limited for english, only news & sports, but they do have pay per view for movies (13 euro). The only negative things I can say, are that the beds are a bit firm for me & pillows flat. The street to the side of the hotel, Montero, is a hooker street, but they aren't aggressive. If you opt for the shuttle to the airport, it is only 6 euro/person, but allow for at least an hour, because they pick up at another hotel too. Taxis in Madrid are small & don't accommodate more than 2-3 people & 2 suitcases. We had 4 people & 4 bags & had to take 2 taxis from the airport. We didn't wait in hardly any lines for any of the sites. Don't miss Monasterio Descalza Reales(only by guided tour, in Spanish), Prado museum, Parque Retiro, Thyssen-B. museum, Reina-Sofia (great Picasso exhibition, but the rest is modern), & Royal Palace & park. We took side trips to Toledo, Segovia, & El Escorial. I'd skip Toledo; the castle is closed & it is really hot & frustrating to get around. Take the bus to Segovia instead of the train; train is 2 hrs., bus is 1 hr. This is a great hotel with all the necessities. We found people in Mardrid to be friendly and helpful.", "helpfulness": 6, "user": "Gotham1", "date": "July 2, 2006", "id": 5416761}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The Senator Gran Via has a very good, central location -- you can walk to the Prado museum area, royal palace, plaza del sol, plaza Major, etc. The interior atrium has a nice waterfall. The room was a little on the small side but it had a balcony, sound-proof windows that completely blocked any street noise, and a second door between the entry to the hall and the room so hallway noise was eliminated. We had people in the room next to us but never heard them. Also appreciated the free mini-bar. The breakfast buffet was abundant but a little pricey (14 euros/each. There are less expensive cafes nearby. There was open prostitution on one street near the hotel but, as others have noted, it did not present any security problem.", "title": "Convenient and very quiet", "helpfulness": 3, "user": "Pseitas", "date": "June 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5374253}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Just came back from spending eight nights here.", "title": "Deservedly Number One", "helpfulness": 2, "user": "car2sh", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5362203}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Don't even consider elsewhere. Centrally-located and with all amenities (and some you didn't even think of: reclining chair and bed with elevating mattress). Choice of pillows. Superb mattress. Soundproof - both from the street (with double-glazed windows) and from the hall (with double doors). Omelettes freshly prepared to your order at breakfast with ample choices of absolutely everything else. Wish I could find this sort of hotel everywhere. What avalue!", "title": "Awesome!", "helpfulness": 3, "user": "Kiwi_Chick_Traveller", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5360836}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I also put up three other friends here - all of whom loved it. Tried to get two other couples in but they were already full.", "title": "Excellent Value", "helpfulness": 2, "user": "bagjag27", "date": "June 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 5336597}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "It's hard to write a review for this hotel without sounding like all the other positive reviews, but they're true. We booked at the Senator based on the reviews and were not disappointed at all. We stayed at the Senator Gran Via twice on our trip to Spain and found the rooms spacious and comfortable. In particular they have a number of nice extras such as a stereo, the free minibar (not to be undervalued in a summer in Madrid), reclining armchair, etc. Given how busy the Gran Via is the soundproofing in the rooms was impressive. The staff were pleasant and helpful. The breakfast buffet was both good and substantial. The hotel's location in the heart of Madrid near all the sights and with a subway station right outside is fantastic. The hotel can arrange an inexpensive shuttle to the airport for you as well. As others have mentioned there are some \"working girls (and boys)\" in the area, but they never seem to hassle anyone and certainly make for some interesting people watching. In addition there were usually a couple of police officers hanging around the intersection in front of the hotel. Above all we found the Senator Gran Via to be a fantastic value. Nice rooms, breakfast included, free minibar, great location all at a very reasonable price.", "title": "Great value", "helpfulness": 3, "user": "arcoonetoe", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5766359, "likes": {"liked": "— Value for money and the free minibar", "disliked": "— Elevators were a bit slow"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled with family", "text": "This was a fabulous choice. Reasonable rate, wonderful location close to Plaza Mayor/Sol. Especially nice rooms, large with free minibars. A great touch when you come in from sightseeing-cold soda, water, beer. The beds were adjustable. Very quiet. The only problem was getting to the hotel. We tried to take bus from airport. I don't even know where we ended up but took a cab and after unloading and entering found it had taken us to sister hotel by mistake-Hotel Senator Espana at 70 Gran Via.In fact, there was a problem with booking, some of our party was booked at this hotel while we were booked down the street. Also, they warned us about luggage being stolen from reception so had to keep our eye on that while we figured out where to go. They were not helpful with the mixup. We dragged our luggage for blocks to the correct place but it proved worth it. Breakfast buffet was included-something I look for when choosing hotels-it was very good and was enough to hold us for the day. we ate dinner there that night and it was satisfactory but on the high side for what you got.", "title": "A Super Choice", "helpfulness": 2, "user": "nsm1", "date": "August 31, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5731252, "likes": {"liked": "— location", "disliked": "— worried about luggage being stolen from reception"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "A tip to anyone planning a train trip-book your tickets ahead.!! We spent hours getting our tickets for 2 trips to Granada and to Toledo.", "title": "What a Gay weekend", "helpfulness": 11, "user": "Hugh(_!_)Janus", "date": "August 17, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5618283}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "I booked six suites for 6 couples over the last weekend in June. Which coincidentaly, is Gay Pride weekend.", "title": "Comfortable and convenient", "user": "Overlooker", "date": "August 16, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 5618444}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We just spent 4 nights at this hotel having read about the reviews on this website. We certainly weren't disappointed with the location - very central and within easy walking distance to all the shops / restaurants. The staff in the hotel were all very friendly and helpful and their English was excellent. We arrived before check-in but this was not a problem and we got taken to our room straight away (after having a complimentary cold drink whilst checking in - a nice touch after a long journey!). I agree that the room is small but it has a free mini-bar which is re-stocked each day (only alcohol is beer but plenty of soft drinks), CD player, TV and lovely bathroom. Our room was cleaned and tidied each day and we had no problems there.", "title": "Great location, great service!", "helpfulness": 3, "user": "iloveholidaylots", "date": "April 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4953901}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "At the airport we decided to save money on the cost of a taxi and negotiate the metro for only 1 euro each. The journey is quite long and does involve steps which isn't good with lots of luggage. On the way home, we took a taxi and it was only 19 euros - well worth the money. No mention of a free transfer bus from the hotel so not sure about that.", "title": "Ideal", "helpfulness": 3, "user": "Londoner28", "date": "April 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4941765}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "The prostitutes are out in force along the street just next to the hotel but we were travelling alone (2 girls) and didn't feel unsafe once. They keep themselves to themselves and the police presence is high.", "title": "Don't arrive late or you will not get your room", "helpfulness": 4, "user": "kbeeker", "date": "April 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4933878}, {"rating": 5.0, "title": "They thought of everything!", "text": "If I was to revisit Madrid I would definitely return to this hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 3, 2006", "id": 4832114}, {"rating": 3.0, "title": "Ditto.. pretty good but not amazing", "text": "For a 3* hotel it would be difficult to beat the Senator Gran Via - the rooms are not large, but they are well appointed, nicely decorated and immaculately clean. The free minibar was most welcome, and the shower almost painfully powerful. It's 5 minutes from the Puerta del Sol, and all the major sights are within easy walking distance. Highly recommended.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 3, 2006", "id": 4830471}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The Director of the hotel, who is fluent in English, was especially helpful. The whole operation was well-run. They are part of the playasentaor chain. I'm going to make a point of looking for their properties when I stay elsewhere.", "title": "Great Hotel", "helpfulness": 4, "user": "tmccaleb", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5332673}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "we stayed at the gran via for three nights from 12 to 15 february. Room was very small, but larger ones were available so next time we would ask for one of these. The location was fantastic, a short stroll to puerta del sol and the plaza mayor. We found the staff really helpful and everyone spoke great english. We didn't eat in the hotel, but had more than one leisurely drink in the bar looking out onto the busy street. They serve lovely snacks here and free tapas and crisps. although the area was very busy at night, when we shut the window we barely heard the traffic. They run a courtesy bus to the airport for 6euro each, make sure you book the previous day. Much better than the 40 euro we ended up paying from the airport to our hotel! We fully intend going back to the denator gran via.", "title": "perfect location", "helpfulness": 19, "user": "emeraldgirl_13", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4498342}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Stayed here for 3 nights in early February. Metro brought us direct from the airport to the hotels front door for €1 which was great. Very central location, literally a stroll to everything you might want to see. Breakfast was included and this was very good with a good selection of everything you would expect. Free mini bar in the room, mostly soft drinks and juices but also a couple of beers which was nice. We had a corner room which had two balconies and overlooked the Gran via. The room ws very spacious and airy but judging from the fire escape map it was bigger than most. The hotel is very well maintained and the staff couldn't be more polite and helpful. Other posters have complained about the \"ladies of the night\" loitering nearby but they won't cause you any annoyance whatsoever. Highly recomended. If we ever go back to Madrid we'll be returning to this hotel for sure.", "title": "Great Hotel - Excellent location", "helpfulness": 13, "user": "Buckshee", "date": "February 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4496177}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "As group organiser of 22 friends and colleagues, we arrived at this hotel on 18th February for a three night stay.", "title": "Couldn't Fault It!", "helpfulness": 15, "user": "CACTeam", "date": "February 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4477698}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "I had checked out reviews on Trip Advisor and at the time of choosing and booking it, it ranked 17 out of the 358 listed. It is now ranked #1 and it certainly deserves this high award!", "title": "Thanks for the tips", "helpfulness": 8, "user": "JosetteBrisbane", "date": "February 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4475447}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "I had given the hotel our room requirements with a combination of single, twin and triple rooms. We arrived late evening with everyone tired from the journey but Reception had our room keys in envelopes ready for us to go straight to our rooms. They even gave me a list of my party with all the room numbers so that I could contact them easily if I knew where they all were! I was impressed!", "title": "Stayed at this Hotel during the FITUR Fair", "helpfulness": 12, "user": "Antnio Trindade", "date": "February 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4410074}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Stayed at this hotel for my husbands 40th birthday and had a great time. I happened to mention that this was for his birthday and within minutes of arriving in the room we were greeted with a bottle of sparkle, mineral water and a basket of fruit, with the compliments of the reception. The rooms are a little small but the location is perfect. Walking distance to all the main attractions and subway. The hookers are on parade across the street but we thought it was funny, they appear good looking from the 7th floor!!! You will not be disappointed if you stay here.Madrid is a lovely compact and friendly city.", "title": "Fabulous hotel in great location", "helpfulness": 10, "user": "YoshisMum", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5446819}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "We have just returned from our 2 week trip to Spain. While in Madrid, we stayed at the Gran Via, and would not recommend it to anyone. My purse was stolen in the lobby of the hotel, within view of the front desk. With much distress, (as you can imagine), we asked the staff for help in cancelling credit cards, cell phones, etc, and they were extremembly rude, and very unwilling to cooperate. They actually told us that making these phone calls might get them into trouble. No manager came to talk to us, no security ever asked us any questions. Many times during our stay at Gran Via, the staff gave us incorrect information of opening times of museums, never helped us with restaurant recommendations, and just seemed to be inconvienenced by any questions we might have.", "title": "Watch your belongings", "helpfulness": 8, "user": "cin1754", "date": "July 9, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 5441797}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The only positive thing I can say about the hotel, is the mini-bar in the room is wonderful, after a long, hot day of sightseeing.", "title": "Look no further", "helpfulness": 4, "user": "briefencounter", "date": "July 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5441591}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "My husband and I have traveled internationally quite a bit, and we have never had this type of experience before. If you are undecided in your hotel choice for Madrid, please think of a hotel, other than Senator Gran Via.", "title": "Definitely 4 star +++++", "helpfulness": 2, "user": "kathieann", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5431424}, {"rating": 4.0, "title": "Beware - not somewhere to take children!", "text": "The staff were very friendly and spoke good English. We liked the decor of the hotel itself - from the external facade, to the marble staircase, to the glass elevators in the inside foyer. All in all, a very quaint and comfy hotel that we would definitely stay in again!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 13, 2006", "id": 5461765}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "I decided to move my booking to the Senator grand Via when my other choice for a better location, the Vincci Soho could not honour a twin room. Amazing in Spain because I have never even when I wanted it managed to get 1 big bed. Booked through Laterooms and had no problem at check in although initially told breakfast was not included. Sorted with no problem. The staff had great English, shame as I wanted to practice my Spanish! We had free Cava every night in reception, which we took up to our room. If the bottles not open just ask. Also free fruit to help yourself to which was a nice touch. In comparision to other capital cities in Europe this hotel is excellent for service and room amenities. The ladies of the night are there with the police in good numbers right outside the hotel but I was there with my mother and we had no problems.", "title": "Happy with Late choice", "helpfulness": 8, "user": "ponymad", "date": "April 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4827671}, {"rating": 5.0, "title": "Great Location, Great Staff, Great Hotel", "text": "The room was amazingly quiet with good insulation although I know they are not of American size. Dont forget to ask for bathrobes, which are available with no problem. Brought within 5 mins on request.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 29, 2006", "id": 4773291}, {"rating": 3.0, "title": "excellent location", "text": "We did have a couple of problems, with the air conditioning and the toilet running all the time. Rang reception and a nice chap came to sort out very quickly.", "helpfulness": 5, "user": "sticklegs", "date": "March 28, 2006", "id": 4740284}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Couldnt understand how to get the hotel to pick us up on their transfer bus on arrival, found the stop but although I rang them they couldnt tell me what time it would pick up. The transfer back was great and did cost just 6e.", "title": "Pretty good but not amazing", "helpfulness": 4, "user": "WillOnTheHill", "date": "March 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4735139}, {"rating": 2.0, "title": "Hmmmm.....", "text": "Breakfast was great. Didnt mind the coffee, in fact my problem was finding someone to give me a top up. The omelette chef is good, I always like to see someone do this at hotels, and always think cold scrambled eggs in those bain maries are rubbish. She will also do eggs any way you want.", "helpfulness": 6, "user": "John Gilmore", "date": "March 22, 2006", "id": 4723840}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the Hotel Senator Gran Via for three nights beginning June 1, 2006. We were given a room on the fifth floor – a no smoking floor – that was both fairly large and very comfortable. Although the Gran Via bustles until all hours (really, they do party until 4:00 AM on Friday and Saturday nights) and our room fronted on the street, the windows combined with the drapes make the room VERY soundproof.", "title": "Great Hotel In Madrid", "helpfulness": 6, "user": "GRTraveller46", "date": "June 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5327852}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The beds were two singles – that were able to be individually reclined – that butted together making a king. They were quite comfortable (although I we do not find hard beds a problem). The bathroom was very well equipped and the water pressure was outstanding and hot water was plentiful. The TV did get CNN in English and an English sports broadcast.", "title": "Perfect for our stay....", "helpfulness": 4, "user": "sbull9", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5286426}, {"rating": 2.0, "title": "A \"Gran\" Deception", "text": "The complimentary mini-bar was a great feature and it was replenished daily. The hotel’s staff was very efficient and even surprised us with a bottle of champagne for my wife’s birthday! When we called down to ask who had sent this to her - we figured friends or one of our kids - the desk manager replied “Isn’t it your birthday? Happy birthday from the hotel!” They apparently saw it was her birthday from her passport.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 28, 2006", "id": 5229272}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Yes, the hotel is right next to the ‘red light’ district. However, the girls were not pushy nor did they bother us in any way.", "title": "Truely a 4* hotel", "helpfulness": 5, "user": "juridf", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5192239}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 4, "variance": {"poor": 39, "average": 85, "very good": 291, "terrible": 14, "excellent": 319}, "aka": "Senator Gran Via Madrid", "slim_ranking": 0.223194748359}