{"user_rating": 3.5, "review_count": 644, "name": "SENTIDO Ixian Grand", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "On the whole the hotel is okay but not anywhere near the 5 star hotel we were expecting. My biggest moan is the restaurant. There is a dress code for men i.e. they must wear long trousers to dinner despite women being allowed to wear anything bar bikinis. Its 35 degrees outside for god sake. This was not advertised. We tried to reason with the unreasonable head waiter and manager but was told I could sit as long as my wife got my dinner for me. A diificult hotel policy to understand.", "title": "Okay hotel (not 5 star) shame about the restaurant", "helpfulness": 1, "user": "Robert151267", "date": "July 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 115364901}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have to agree with some of the comments about the head waiter, we also witnessed a new arrival being returned to the line at the front door with a bowl of soup in hand just because the 'full of self importance' waiter hadn't seated him at a table which in most cases wasn't ready in the first place. The other main complaints are also restaurant related i.e. they are extremely slow to clear tables, they run out of glasses for fruit juice most mornings and it would be nice if some of the staff smiled once in a while.", "title": "beware - a 2 star service/facilities with a 5 star rating.", "helpfulness": 2, "user": "RonNer088", "date": "July 14, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 1.0}, "id": 115350639}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The room itself was great with a private pool with nice and clean with fresh towels and linen each day however we did feel a lot of the public areas could have been cleaner.", "title": "Great hotel, even greater staff.", "helpfulness": 3, "user": "TorsteinThorsen", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115258297}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel has poor extra curricular activities with little entertainment and no activities available from the hotel. If you're looking to lie in the sun day in day out, the hotels ideal however if you're looking to be entertained you need to bring you're own.", "title": "Don't waste your time and money on this one.", "helpfulness": 1, "user": "wilsonzen", "date": "July 11, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 115249411}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel is in a not bad location with bars and restaurants a short walk in either direction from the hotel. There is public transport 5 minutes away which takes you the short journey to Rhodes town centre for approx. 2 euro for a single journey.", "title": "very poor", "helpfulness": 2, "user": "gooseberry75", "date": "July 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 1.0, "service": 1.0}, "id": 115154322}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed half board in a Deluxe sea view room and compared to the Superior rooms the extra charge was certainly worth it. However we naively expected the hotel to be, as advertised, 5 star. None of the 5 star 'touches' were very apparent. We arrived at 10.30pm having missed dinner. No suggestion of any alternative food arrangements. Some of the fixtures and fittings in the room didn't work. Generally there are not enough staff to provide the level of service expected at a five star hotel. As mentioned in some previous reviews there are not enough sunbeds and even if you do bag a sunbed there are not enough cushions. All sunbeds had usually gone by 10am.", "title": "Not 5 Star", "helpfulness": 3, "user": "Steve186299", "date": "June 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 114475606}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We needed a late check out to 6pm and were charged an extra 75 Euros - we thought this was a little expensive but had to accept as there appeared no facilities for late departing guests to change or have a shower. It was all summed up for us when on departure we were asked to complete a guest questionnaire which if completed offered a prize of a holiday in 2009!", "title": "Best hotel at the beach", "helpfulness": 3, "user": "Missallstar", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 113813635}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Overall no attention to the detail we would have expected from a 5 star hotel.", "title": "Standard room not good - not a five star hotel, food poor, ants in our bathroom.", "helpfulness": 6, "user": "ib199", "date": "June 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 113228522}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "First time in Rhodes. During our one week trip to this lovely sunny island we did see many bad hotels, but this was not one of them. The stay was absolutley lovely, the hotel had a clean private beach, fresh sunbeds, friendly staff and good hotel rooms with many European TV-channels. Extra plus for the lounge music playing in the restaurants.", "title": "5 Star ? No way", "helpfulness": 3, "user": "barneyfethiye", "date": "June 13, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 113141426}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This is a hotel of two halves. Many of the reviews on here, which we read before we booked, have been written by people who stayed in the Suites rooms. These do look very nice, and also have access to a separate restaurant which I guess must be quite good.", "title": "Beautiful Hotel, Just A Few Things Need Sorting", "helpfulness": 3, "user": "Impactdancer", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 113090180}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here 7 nights at the end of June - beginning of July. We had a maisonette located on the first floor with private pool, a Jacuzzi, 2 bathrooms, a generous living room and a bedroom upstairs. Depending on the location (ground floor or first floor) some of the maisonettes have sun in the morning, others in the afternoon.", "title": "Perfect for a relaxation holiday", "helpfulness": 2, "user": "Mihaelalala", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 115082632}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Someone already mentioned this and it is true that none of the pools are heated (neither the main public one, nor the private ones) so one can enjoy a decent bath in the afternoon, otherwise the water is pretty cold :-) The room is very cosy and nice, the bed is very comfortable and the evenings are pretty quiet so your sleep will be undisturbed by late night party - people :-)", "title": "The Ixia grand - a relaxing and great value break", "helpfulness": 3, "user": "michaelmal1", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 2.0}, "id": 115024004}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "As a negative aspect regarding the room - there were several fittings that did not work properly - like a bulb on the stairs leading to the bedroom that was not functioning, a piece of glass that was not well fixed to the wall, the sink and shower taps had a way of their own and some wires popping out of the wall :-) but that didn't bother me much as I am not a very picky person and anyway I was on vacation and didn't care much about such trifles. One aspect that was pretty bothersome, especially for people travelling with kids, was the absence of any stairs railings when going up on the first floor. The room was clean, we had fresh towels and amenities, no remark about that, there were no slippers and ironing machine though, which in five stars are pretty much compulsory as far as I know...but again, I wasn't bothered much about this either.", "title": "Beautiful place, we will be back!", "helpfulness": 1, "user": "anatsteingold", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 115013379}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Free wi-fi is available only in the lobby (which by the way is very nice and elegant, also the bar). There is no gym area inside and no space to jog around the hotel. The suites are beautifully surrounded by greenery and the trees are cut in funny shapes.", "title": "Best in Rhodes", "helpfulness": 4, "user": "11Eva11", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114827194}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The pool area is very nice - the main pool is split in two - one half with seawater - the other with fresh water and it also contains a small Jacuzzi (cold also :-) The beach is not sandy, quite on the contrary, it's full of pebbles and rocks but as soon as you venture in the water you will discover that the sea floor is actually very sandy and nice :-)", "title": "fantastic", "helpfulness": 3, "user": "geordiegav", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114544688}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed for 1 week at the Ixian Gran in a Superior room (the basic one) on half board basis. The hotel looked like one of the nicest in Ixia from our walking around when we were there. We didn't go expecting UK/Dubai 5* standard, so weren't disappointed. For me, the hotel looks 5* but is run like 3*. I would not go back, but I don't regret going as we had the totally relaxed laid back holiday that we wanted and I would only recommend it for this. Restaurant staff generally rude and unhelpful, but food was fine and we got over it.", "title": "Relaxing Holiday", "helpfulness": 4, "user": "caitni2000", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 115677368}, {"rating": 3.0, "title": "RESTAURANT STAFF \"MISERABLE\" \"SURLY \" & INEFFICIENT !!!", "text": "Further details below...", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 22, 2011", "id": 115666324}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The room look exactly like it did on the hotel website. Sheets and towels were changed every day and robes were provided in the room. It was very spacious, bed was comfortable and 2 sponge 2 feather pillows were available. AC in rooms. Bathroom was \"dated\" but spotlessly clean and fully functional. Shampoo/bodywash/soap provided but not of great quality. Inroom safe with key. A lot of the traveller photos on here are of the delux rooms and suites. Superior rooms are like a normal hotel.", "title": "This is not good hotel", "helpfulness": 3, "user": "Rebert_11", "date": "July 21, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 115627146}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "General appearance all around is beautiful, pool area is stunning, nice wooden loungers, marble everywhere. Lounge has big luxury couches which aren't so comfortable when you sit in them! But all \"looks\" the part. Reception staff are very friendly and helpful. Pool staff walk around all day to take orders for food/drink to you by the pool.", "title": "Second time we've stayed - Big Mistake", "helpfulness": 3, "user": "allgreektome15", "date": "July 16, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 115418270}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Both pools are very refreshing, as is the sea, but the stoney beach is annoying, but this is all there is in Ixia and the whole way to Rhodes. The hotel is also under the flight path for landing at the airport, so you can plane watch all day with only minor noise. There is a strong breeze coming in off the coast which is very welcome in the heat.", "title": "For The 1st time, it achieved MORE than we expected!", "helpfulness": 2, "user": "WindsorBob6", "date": "July 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115413169}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 5, "variance": {"poor": 67, "average": 136, "very good": 209, "terrible": 39, "excellent": 193}, "aka": "The Ixian Grand Hotel", "slim_ranking": 0.65625, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Das SENTIDO Ixian Grand ist ein erstklassiges Strandhotel an der Westküste der Insel Rhodos direkt am Strand von Ixia. Kürzlich renoviert verfügt das Fünf-Sterne Hotel über 211 luxuriöse Zimmer mit gemütlichen Ambiente. Nur wenige Minuten vom SENTIDO Ixian Grand entfernt befindet sich das UNESCO Weltkulturerbe „Rhodos Altstadt“ und auch Mount Filerimos, der Sie mit einem atemberaubenden Panaromablick verzaubern wird, ist in kürzester Zeit zu erreichen.Genießen Sie Sonnenuntergänge am Strand, die kühle Brise der Westküste und den Komfort dieses erstklassigen Hotels sowie der attraktiven Umgebung."}