{"user_rating": 4.0, "review_count": 226, "name": "Sercotel Gran Bilbao", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We arrived at this hotel for one night as part of a coach tour. The room was very spacious, new looking and clean. The bathroom was large. The room was very empty looking and could have easily accommodated another easy chair. There was only one chair in total for a double room. Although our view looked out on the impressive road system the sound proofing was effective. We thought what a nice, quite hotel it was; then we went to reception and the dining area.", "title": "shame about the clatter", "user": "michael f", "date": "October 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141747565}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We had an evening meal and breakfast: both buffet. The food selection was very good and it was well cooked. Wine was also part of the deal with one bottle per table of two. There was no flexibility over this however. I only drink red and my wife drinks only white. We could only have one or the other. There were no half bottles to cover such a situation and no effort made by the staff to try and resolve the problem and help us. I do speak a little Spanish.", "title": "Very large and comfortable room", "user": "Antonio C", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 140975710}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "But the main problem in this dining room, and as we found out later - the foyer -, is the noise level. The acoustics are treadful and its is like having a meal in a very large works canteen. There are lots of people who clearly use this hotel and their noise rebounds from all corners of the large, high space. It is not helped either by the robust manner of the staff, particularly near the kitchen entrance areas, who seem to throw plates onto tables, shout at each other, and are just a little too eager to remove empty plates from cramped table layouts. They have not got the balance right between speedy service and that of giving the impression that it's a race to get your table cleared for the next lot of people to use. The whole eating experience is noisey and rushed. It really detracts from what is potentially a very good hotel. The reception area was little better and a quiet drink at the end of the day talking with friends was impossible.", "title": "Vacation", "user": "Ramon R", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139723219}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel is situated in very easy ( about 10 minutes ) walking distance from the old town. Bilbao was a pleasant surprise and well worth a longer visit, but bring your earplugs to this hotel.", "title": "Holiday", "user": "HylkeSchouten", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138925776}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I'm spending a long work period in Bilbao involved in a big project and I choose Gran Bilbao to be my home for this time . The Gran Bilbao is a large structure located nearby the Bilbao river . Very close to Casco Viejo wich is the old par of the City . In a few minutes you can reach all the most attractive part of town and several restaurants are located a few step away . Bus stop is just in front of reception and metro station not far . Service in room is very good and beds are great . Rooms are huge and you don't feel trapped in a cage . Should be nice to have some facilities as fitness room since people like me have to stay so long .", "title": "Bilbao with my family", "user": "ANDREA C", "date": "August 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 137983606}, {"rating": 2.0, "title": "No style", "text": "Location is not great, just next to the very noisy road, borderline out of the city. The hotel lobby is very nice, but the rooms are a bit depressing. The bathroom smells pretty bad (no windows or airation) and the walls are very thin, and even the bed linings had weird stains. The personnel was not very friendly, and in general the hotel is too \"businessy\" with no charm at all. Luckily it was not expensive, but it's not worth the 4 stars anyways. We definitely don't plan on coming back.", "helpfulness": 1, "user": "Jacques C", "date": "July 15, 2012", "id": 134456546}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Very nice hotel. Modern interior and everything is neat and tidy. The restaurant lacks atmosphere, but the food is very good (try the Iberico!) and is open when arriving late. Breakfast buffet with great choice. Staff is friendly, very well English speaking.", "title": "Very nice hotel", "user": "HansW1971", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 133498615}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I've been staying in this hotel for several times now and will return here.", "title": "No Facilities", "user": "peterdh", "date": "July 4, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 133456577}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "For a newish hotel near a major city the lack of facilities is quite amazing. The front lobby/reception/lounge/bar has to cater for guests from over 200 rooms. It couldn't do it if everyone turned up at once. The hotel seems to be geared to the meetings and conference trade and as such isn't a suitable place for the leisure traveler in my opinion.", "title": "Very good hotel, check that its location is acceptable for you", "user": "RJWSuffolk", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 132237111}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The rooms are of a good size and are comfortable although some of my fellow travelers on the Shearings tour complained about noise from below late into the night. We were on the 8th floor and weren't troubled by noise but best avoid the low floors maybe.", "title": "I think the low price was still too high", "user": "Fabiolaabu", "date": "June 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 131118624}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is one of the nicest hotels in which I've stayed in Europe. It can be a bit difficult to find, but our gps did the job well. The hotel has a huge underground parking garage available at a reasonable price. We were given an upgraded room on the top floor. The room was huge, with a separate seating area. The bathroom was wonderful and included a separate bath and shower. The beds were very comfortable and the a/c worked great. Being on the top floor minimized any road noise. Staff were are helpful and friendly. Breakfast was included and was a buffet. It could have been presented a bit better, but it was fine and included a good variety. One can take a downhill walk to the old town area for pinxtos and drinks. You can also catch the tram there to pay a visit to the Guggenheim. The wi-fi worked great. All in all I cannot more highly recommend this hotel.", "title": "Wonderful Hotel", "helpfulness": 2, "user": "highdesertbadger", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158106719}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "I stayed here on a Contiki and the style of it was totally unexpected. It was an excellent stay for someone whe does not enjoy the bar scene all that much. However, the hotel bar served economical drinks and we met up there instead of going out. The weather made considering a 15 minute walk too much and the hotel bar provided a more than satisfactory solution. Breakfast in the morning was amazing and everyone was friendly and helpful.", "title": "Very swank for the budget traveller", "helpfulness": 1, "user": "MilHistory_Traveller", "date": "March 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 154565065}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "stayed here early march only paid £43 for 2 nights so wondered what it was gonna be like . shouldn't have worried absolutely amazing no complains on anything. rooms very nice and spacious. lobby and reception area smart all staff very polite and helpful. had breakfast €12 a day which i thought was quite expensive but buffet style and plenty of choice and very nice.it was a little bit out of the centre but only a 15 mins walk or €7-8 in a taxi.great hotel would definitely recommend to anyone", "title": "great hotel", "user": "basilfawlty_8", "date": "March 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 153971697}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "After 10 hours on the road, this hotel was a very welcome surprise. At just €60 for a large triple room and another €12 for secure underground parking, we felt this was good value for a vibrant city. The staff were very friendly and welcoming, and did their best to accommodate our requests. The hotel is generally very stylish and had a warm, welcoming feel.", "title": "A great little find", "user": "Bruce_Sheila_7", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149978114}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The room was spacious, with comfortable beds and clean, modern decor. Free Wifi was a nice bonus. As others have mentioned, the bus to the town goes from right outside the hotel (numbers 40 and 77) for just €1.25, or approx 15-20 minute walk. Guggenheim museum is approx 30-35 min walk, or a approx €10 taxi ride.", "title": "Pleasant stay.", "user": "ComdtNexus", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 146070645}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Gran BIlbao finds itself on the outskirts of Bilbao. Some 15 minutes walk to the centre of the old town, but the good thing is, it has a busstop in front of the Hotel which crosses Bilbao and makes it possible to visit nearly all the sites for only 1,22 euro p/p.", "title": "efficient and excellent price/quality", "helpfulness": 1, "user": "WILENLIN", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143189832}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Free wifi , but not ideal for the internet hungry. Poor connection quality in the room, but excellent in the lobby. Clean room and friendly people at the reception. All in all i can recommend this hotel which charged us 115 euro for 2 nights /room only.", "title": "EXCELLENT STOP OVER", "user": "DCFMalaga", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143025893}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We have stayed here previously and re-booked remembering the experience. If anything it was better this time. We had a lovely room on the 8th floor and it lacked nothing. We had the Buffet in the evening which was good value for money but a bit of a 'bun' fight as there were coach trips staying over. The service was good, the standard was excellent and it was good value for money.Secure parking is always a bonus. Will stop over yet again.", "title": "One night stay at Sercotel Gran Bilbao, Oct 2012", "helpfulness": 1, "user": "Monchito2", "date": "October 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 141965081}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Nice, clean, sharply run hotel. Excellent, large room. Poor access (as ever, in Spain) by ramp to U/g car-park, which cost an extra EUR12. Charge for carparking is excesive. However, there's very little street parking available locally. Bilbao is a very 'hilly' city and this hotel, although pretty close to the shopping centre is a steep clim back! Overall, a good hotel and worth a re-visit. Bilbao as a city is well worth a visit for a couple of days. Charming shops, streets and people abound!", "title": "Disappointed.", "helpfulness": 3, "user": "BlackE90330D", "date": "October 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 141859313}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Had booked this hotel after reading a number of positive reviews, plus it suited my travel plans following an overnight ferry crossing from the UK that was scheduled to arrive in the evening.", "title": "Good HOTEL", "user": "Marjorie306", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141831207}], "location": {"country": "Spain", "region": "Basque Country", "continent": "Europe"}, "stars": 4, "variance": {"poor": 11, "average": 30, "very good": 113, "terrible": 5, "excellent": 67}, "aka": "Sercotel Gran Bilbao Hotel Bilbao", "slim_ranking": 0.272727272727}