{"user_rating": 5.0, "review_count": 228, "name": "Serinn House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "We visited turkey for almost 2 weeks.. and certainly Serinn House gave us the best impression of all... The service, the design, the ambience.. it was just very unique... Thanks Eren for the resto recommendation, Ziggy Cafe, it is just the bestttt....", "title": "Best of turkey", "user": "JakartaKaka", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36552889}, {"rating": 5.0, "title": "Loved Serrin House and Erin", "text": "and i loved your breakfast menu... very gourmet, very warm & cozy setting...", "helpfulness": 1, "user": "CAETennessee", "date": "July 24, 2009", "id": 35654362}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Serinn house made cappadocia unforgettable for me...", "title": "Eren makes Serinn House a home away from home", "user": "rsrsanfrancisco", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34415947}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "I stayed at Serrin House with my husband, son and parents. We all had the same thing to say - we loved Eren and the Serrin House. Eren was helpful in helping us plan our visit and ensured all our needs were met.", "title": "A delightful home in Cappadocia", "helpfulness": 1, "user": "atrevida", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34363566}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Breakfast was delicious. Eren's staff even came in early on the day of our departure to prepare an early breakfast for us.", "title": "Beautiful hotel in a setting that's not to be believed", "user": "sfg1979", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33440773}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Wonderful hotel, a short walk from the town center, with stylish \"cappadocia-cave meets Scandinavian design\" interior, and the most wonderful hostess, Eren. I have never before experienced a hotel owner being as helpful, service minded and generous with their time as Eren. She really takes pride in looking well after her guests - and even phoned for us one evening when we hadn't come directly home after our one day road-trip (but gone straight to the Ziggy's), because she was so worried. A superb experience in the magical landscape of Cappadocia.", "title": "A memory for life", "user": "mcd81", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30378126}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Serinn House was an excellant place to stay. It is a quiet hotel away from the center of Town but it is a short walk to the Town. The Breakfast was excellant and the advice and undertaking of the arrangements were terrific. Eren was a terrific hostess and the dog was great. All in all Urgup was a great place to stay to explore the wonders of Capadoccia.", "title": "Turkish Holiday in Capadoccia", "user": "travelingjbUpstateNY", "date": "May 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 29229485}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed here in Oct., 08 for three nights. We stayed in Room 5 which was featured in Conde Nast Traveler. The ambiance, charm, fabulous breakfast, and very helpful owner Eren made our stay completely enjoyable. Eren arranged an excellent tour guide, made dinner reservations in wonderful restaurants, gave us sightseeing tips and even drove us into town to a local store to buy jeans when we needed warmer clothes. After raving about the homemade preserves at breakfast, she called her mother for the recipe. The hotel is charming and a must-stay spot for this area. We can't recommend it highly enough.", "title": "Wonderful hotel and owner", "user": "wearetravelers", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29115456}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I stayed two nights and loved Serinn House and", "title": "Just wonderful", "helpfulness": 1, "user": "mistravel", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28656435}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Eren, the owner and hostess.", "title": "Just wonderful", "helpfulness": 2, "user": "mistravel", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28273008}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I spent 3 weeks in Turkey this September/October. We spent the first week in Cappadocia, at the Serinn House. We loved the hotel, our room, the wonderful, varied breakfasts, and the care we received from Erin and her staff. We would strongly recommend this hotel, and would certainly return should we be lucky enough to visit Turkey again.", "title": "A delightful experience", "user": "Sron", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47144744}, {"rating": 5.0, "title": "A truly excellent small hotel run by its owner", "text": "This lovely small hotel set into a hillside, though not really a cave hotel was our Cappadocia headquarters for five days. Rooms simple with whitewashed walls , comfortable beds and good washroom / toilet facilites. Buffet breakfast plentiful and served on courtyard balcony, weather permitting. Free high speed internet. 15 minute walk downhill to town centre; 10 minute walk to Ziggy restaurant ( reviewed elsewhere ). Hotel provides shuttle service for those who cannot walk. Owner on-site and very helpful. Strongly recommended.", "user": "CanadianExBrit", "date": "October 13, 2009", "id": 46778810}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We LOVED everything about our experience in Cappadocia and that was due to our host at this hotel. Erin got us the most wonderful tour guide, amazing hot air balloon ride with the best and oldest, Cappadocia Hot Air Balloons, and great restaurants. She is an excellent cook and we enjoyed cockails at sunset overlooking the region and wonderful breakfasts and dinners. She went out of her way to get us every comfort. The rooms are mostly real caves but are beautiful and very clean. This was an incredible experience.", "title": "Amazing views, rooms, food, hospitality", "user": "NTSL12", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46703701}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The Serinn House is a fantastic small (5 rooms) cave hotel in Urgup in Cappadocia. The hotel built into the caves on the hill just outside town, as are a number of other cave hotels. It contains only 5 rooms with a common living room area and outdoor seating and eating areas. The rooms are nicely done. We unfortunately stayed in the smallest room (I think) at the hotel, but it was still well sized. The only major downside with the room is that there was no sitting area in or just outside the room as most other rooms I believe have. Also, it being in a cave, there is little circulation and it can get damp and musty, but this is likely to be a problem in any of Cappadocia's many cave hotels.", "title": "Fantastic Cave Hotel in Urgup", "user": "MattR_Chicago", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43369420}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "While the hotel is up the hill from town, it is not that difficult a walk and taxis are available at a relatively low cost. Eren, the owner, is an incredible help in setting up tours and other arrangements. She helped set up a hot air balloon trip for us (well worth the cost) and helped us arrange for a rental car (worth it to get to many of the sights in the region).", "title": "Absolutely fantastic", "helpfulness": 2, "user": "JLynDitz229", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 42285086}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This 5 room cave hotel is very special. Eren Serpen takes great pride in her recent renovation and it shows in the quality of the experience and the hotel. She cares about details which makes the stay perfect, and she's interested in her guests having a great experience. I can't say enough great things about our trip in general and Serinn House in particular.", "title": "Eren Serpen, proprietress of Serinn House made a great trip to cappadocia truly magnificent.", "user": "lts2828", "date": "June 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33275952}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Serinn house is just the best place to stay in Cappadocia - Eren is a fantasic host and is always on hand to give advice on the best places to visit, to eat and anything else you might want to do. The rooms are very special - so much style and space. And the breakfast is wonderful - make sure you try the fuit pie - absolutely devine.", "title": "The best possible place to stay in Cappadocia", "user": "crawshawbooths", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32368921}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Don't even think of booking anywhere else - we loved every second.", "title": "Tops!", "user": "aowats", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32130056}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Found this through a combination of Tripadvisor, and New York Times. Gret place. Our two grown kids loved it, as did we. Lovely location atop Urgup, with great views, really neat rooms, and memorable homemade breakfasts. We relaxed, used the high-speed wireless internet, soaked up the fabulous eveing and morning views of the surrounding area from the dining area. Eren is such a gracious hostess, and she puts her focus squarely on customer satisfaction. It shows! She also recommended two great restaurants right in Urgup. We loved our stay.", "title": "Excelent! Super Friendly and beautiful modern rooms in the caves and view!!", "user": "Podis1", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32122850}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The owner Eirene was really friendly and helpful. She helped us to arragne the different visits in Capadocia and was always ready to help. We forgot something and she sent that back.", "title": "Eren & Serinn House, a magical combination", "helpfulness": 1, "user": "retiredprof17", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32054982}], "location": {"country": "Turkey", "region": "Cappadocia", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 11, "terrible": 0, "excellent": 215}, "aka": "Serinn House Hotel Urgup", "slim_ranking": 0.0909090909091, "description": "For a fresh perspective on the stunning Cappadocia skyline, discover the new Serinn Hotel, a unique boutique cave hotel that incorporates cutting-edge design with the intimacy of the natural caves. Nestling in the heart of Urgup, Cappadocia, with magnificent views of the town and surrounding mountains, the Serinn is a stylish hotel with just five guest rooms. Elegantly furnished rooms have been designed for your utmost comfort with sumptuous beds draped with fine cotton linens, fluffy towels and custom-made toiletries, as well as seamlessly integrated modern facilities."}