{"user_rating": 3.5, "review_count": 183, "name": "Seton Sands Holiday Village", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2010", "text": "I am a support worker for a charity. Myself and another staff member took two of our service users with learning and physical disabilities to the park for a long weekend.", "title": "Awful, Dirty and couldn't wait to come home.", "user": "shaz78", "date": "October 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 82270460}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Let's just say, we weren't impressed.", "title": "Good for families to visit Edinburgh", "helpfulness": 1, "user": "TravelswithHetty", "date": "August 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 77399870}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Both of our 'prestige' caravans were dirty. Small hairs on the duvet covers, dirty couches, dirty carpets. But the worst one was the disabled caravan. The bathroom was so gross I took photos. Caked in dirt on the shower floor, some sort of goo on the bathroom sink counter, pink mould on the shower wall. There was also a clear plastic disposable razor cover on the sink so obviously it hadn't been cleaned. Thankfully we brough out own cleaner so tried our best to clean what we could. I wish i would have brough slippers because of the dingy carpets. Wore socks the whole time. There were dirty shoe marks tracked through the kitchen area. When I told the reception area all I got was a ''Sorry. I'll let someone know.''", "title": "Seton Sands - Don't stay here!", "helpfulness": 2, "user": "CsMum", "date": "August 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 75905329}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We made the best of this trip by going to Edinburgh Saturday and Sunday. Would have been better value just staying in Edinburgh. £331.00 for 3 nights at Seton Sands was a rip off.", "title": "excellent", "helpfulness": 3, "user": "bigrobin", "date": "July 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 72460343}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "On our last night we decided to check out the entertainment complex and we were glad we waited. The pub was not the picture of cleanliness. Menus and tables were sticky and dirty, they were out of napkins so gave us blue roll and the food left a lot to be desired. The 'entertainment' seemed to be a game of bingo with a group of people I'd rather not spend too much time with. Young kids out alone and sad old people. No thanks.", "title": "Not impressed with park or location", "helpfulness": 1, "user": "cardigan29", "date": "July 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 71762728}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "our family have just returned from a 5 night stay at seton sands and after reading reveiws were a bit dubious about what to expect how wrong the park was excellent very claen and the staff were so helpful the kids had a bath and edinburgh is only a hrs bus ride away if you dont drive", "title": "a great wee park", "helpfulness": 3, "user": "tattyteddy27", "date": "May 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 107144558}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "just got home after staying at seton sands haven caravan park. On arrival i had to scrub the kitchen area and disinfect it and also sterilize the two cups we would be using as i certainly would not have used the dishes or cutlery or pots in the cupboards as they were all filthy!!!!!! we had to sleep in the caravan for 2 nights as we were visiting nearby friends in noth berwick who do not have room for us.But i can assure you the less time spent here is better.Thank goodness i took my own pillows duvet and covers,i also bought a mattress cover. This place should be inspected by health and safety.AS i said , i had to sleep there but i was out as early in the morning and back as late at night as i could, and i certainly would never have used any of the dishes or cutlery. ugghhh itchy just thinking about it. NEVER AGAIN.tHE ONLY GOO THING ABOUT OUR STAY WAS THE LOCATION AT THE SEA....AND THE ROAD OUT OF IT", "title": "our caravan was filthy", "helpfulness": 3, "user": "krissi", "date": "April 28, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 105970683}, {"rating": 4.0, "stay_parameters": "Stayed April 2010", "text": "My family and I stayed here for a week in April of this year and really enjoyed it. If this site is good for you will depend on what your looking for, if you tend to spend your time on site and want a load of activities then you are probably best off looking to one of the bigger Haven sites as there is not a great deal going on and the show bar is on the small side. If like us you just use the site as a base then you'd be hard pushed to find anywhere better", "title": "Fantastic locations", "user": "tom_h33", "date": "November 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 85897053}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The location is lovely, the scenery stunning and there is a wealth of places to appeal to all ages and tastes in the area. The van we had was huge, clean and heated throughout (which came in handy at that time of year)", "title": "A fantastic weekend - would go back!!", "user": "HappychickGlasgow", "date": "October 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 84037167}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Back yesterday after a fantastic weekend at Seton Sands. Travelled with my husband my 18mth old son and my parents. We had booked this through a \"Sun Special\" and upgraded to a deluxe van but I'm sure we actually had a prestige it was so clean and luxurious. It had heating in the bedrooms and bathroom and was very very spacious for the 5 of us. Seton Sands itself was lovely although not loads to do with very young children. We had dry and sunny weather all weekend and had a couple of walks across the road on the beach which was nice. The swimming pool area was clean enough my wee boy loved it! Night entertainment wase enjoyable the sort of stuff you expect at these places - Mikey one of the funstars was great with the kids. There is a spar and a chippy on site which are both very reasonably priced - the chips are gorgeous. We paid a total of £155 for the 5 of us including the upgrade and it was well worth the money. I don't think I would pay the rates they normally charge as not much for my wee boy bit would be happy to if he was older. Go ahead and book the site and Port Seton are lovely.", "title": "Good value, not much for younger kids", "helpfulness": 1, "user": "oliverudge77", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 82412799}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I booked Seton Sands through the Sun holiday promotion and was looking forward to going until I read the reviews on here! Luckily, our experience appeared to be much better than most and we had a great time.", "title": "A good experience & a pleasant trip", "helpfulness": 3, "user": "kathrynjc", "date": "July 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115009969}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The park is an average caravan park but the green areas appeared to be well kept and there wasn't rubbish strewn around. If you book via the Sun then you won't be able to get into your caravan until 4pm and guest services will give you a number which you then take to the show bar and wait until you are called. This was fine as we were one of the first to be called but it is a bit annoying seeing as you feel like you're being treated as less than a proper guest even though you're all providing business during the quiet period.", "title": "Dont ever stay here its a dump.", "helpfulness": 6, "user": "shazzaOCD", "date": "June 25, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114743650}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I was dreading arriving at our van (no. 50 in Aberlady) but I was thrilled to see that it was absolutely spotless. Everything was clean, the beds were made with clean linen and all the cups, cutlery etc. could be used straightaway. Did have a few probs though:", "title": "Second year running and back again in September!", "helpfulness": 8, "user": "amanstev", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 113437696}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "1. We couldn't work the TV (it turned out to have something plugged into it which wasn't meant to be there) so had to call guest services who said they'd send someone straightaway but actually took 30 mins. In fairness, the guy was great when he arrived, got the TV working, was really friendly, and the TV was a flatscreen w/Freeview so can't really complain.", "title": "great time", "helpfulness": 7, "user": "heybai", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 110531502}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "2. Couldn't get the grill or oven to work and there are no instructions in the van. We made do without as couldn't be bothered with any fuss.", "title": "happy holidays...", "helpfulness": 3, "user": "pjsc", "date": "May 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 108240081}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Stayed here on a 'Sun special' we upgraded to a larger, newer caravan and one with a little more luxury, which i think was well worth it. Upon arrival we were greeted by a Security Guard at the gate and directed to reception to check in. This is the only time there was a guard on the gate - the rest of our stay the barrier was up and anyone could enter the park. Checked in very smoothly although staff could have had a smile - we were on holiday even if they were not.", "title": "Good location, good base for exploring the area and Edinburgh.", "helpfulness": 5, "user": "itsmeinrugby", "date": "June 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68345328}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Caravan was clean to a reasonable standard, although we did feel the need to re-wash the cutlery and crocs before we used them (this may just be my OCD!) and the caravan could have done with a good vac. We had a couple of minor issues with the caravan on arrival, a broken chair and toilet seat, these were reported to a miserable receptionist but nothing was done to fix them while we were there. Staff seemed not particularly bothered.", "title": "Very Clean Park Very Helpful Staff", "helpfulness": 2, "user": "T770BSL", "date": "June 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 67484480}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We used the site as more of a base to explore the area, rather than to use the facilities at the holiday park, although we did manage to use the swimming pool once and this was great, although small, was very clean, warm and the poolside staff were very friendly and helpful. One evening we wandered across to the onsite family entertainment, our 2 year old really enjoyed it but I can see it is not everyone's cup of tea (we watched a Christmas sketch in May - I think they got the seasons a little bit mixed up!). The 'show bar' and amusements area are in need of a refurb - clean but looking a little shabby but however the grounds, and other outdoor areas are very clean, tidy and well maintained.", "title": "Great site, amazing caravan, kids had a ball!! Highly recommended!!!", "helpfulness": 1, "user": "Lainemc", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66002374}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 27, "very good": 69, "terrible": 23, "excellent": 47}, "aka": "Seton Sands Hotel Longniddry", "slim_ranking": 0.5}