{"user_rating": 4.0, "review_count": 253, "name": "Seven Gables Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I was very impressed with our stay at the Seven Gables Inn in the king suite. My girlfriend was in much need of a break and it turned out to be the perfect choice. I was looking for a quiet place with spacious rooms and square footage. The room and the hotel also have retained its historic appeal and originality. The location is very near to a number of very nice Clayton, Mo bars and restaurants. The experience staying here was much different and more memorable than it would have been residing at typical hotel chains. The staff was pleasant and accomodating. We ate dinner at Molly Darcy's and the food was excellent. The continental breakfast provided in the morning was also very impressive. We would definitely return to this venue and recommend it to friends and family.", "title": "Very unique and historic hotel arrangement with exceptional character", "helpfulness": 1, "user": "Steve15012", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74563182}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Have visited relatives in St. Louis area for many years. Finally, a historic, luxury place to stay. Not super sleek like the new hotels, but we had a wonderfully large room/bathroom with gabled ceiling and very quiet and comfortable. The staff were very helpful with everything. One problem for some travellers three floors, but no elevator. I'm returning to this hotel in Sept. '10.", "title": "Not a city person-this hotel both sofisticated and homey", "helpfulness": 1, "user": "mesacrest", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73269711}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I have been staying at the Seven Gables Inn for several days a week since March 2010 - it is my home away from home. And, as another reviewer said: \"it feels like home\"! Great location in the heart of Clayton, MO; friendly and very competent staff, comfortable beds and great TV's, great little pub with great food, nice continental breakfast, great rates, and nice wine and cheese happy hour at the end of the day.", "title": "Comfortable European-style hotel in excellent location", "helpfulness": 1, "user": "JeffDArmstrong", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71795565}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I would recommend this to anybody travelling to St. Louis.", "title": "Wonderful inn in tucked away in downtown Clayton", "helpfulness": 1, "user": "gardengirl02030", "date": "July 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71761345}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "This was my second stay at the inn and it was just as lovely as the first. Tucked among commercial buildings in the middle of Clayton, it offers a quiet escape from the bustle outside. It is very convenient to all of Clayton and Washington University. I will definitely stay here next time I'm visiting.", "title": "Feels like home.", "helpfulness": 1, "user": "RCKFS4V", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71492286}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Delightful staff, warm hospitality (fresh cookies, wine at happy hour, nice breakfast on white table clothes in cozy room with a fireplace). Love the character of the hotel and of the overly generous-sized rooms. King size bed couldn't have been more comfortable. Quiet, charming with sweet courtyard.", "title": "Charming Hotel - won't stay anywhere else now", "helpfulness": 1, "user": "SouthernTravler27408", "date": "May 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64861257}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We held a dinner reception celebrating the marriage of our son to a lovely girl from Chicago. Her family attended the reception and stayed at the Seven Gables Inn.", "title": "A perfect evening with superb service, atmosphere and attentiveness.", "helpfulness": 1, "user": "Sandy84_10", "date": "May 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 63346130}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "From my perspective as the mother of the groom and the event \"organizer\", the evening was perfect....just as I had imagined it would be. Stacey and her staff provided the personal service and the attention to detail that made us feel not only welcome, but special guests. The elegant atmosphere of the Inn, the charm of an English manor and the beauty of the Courtyard added that final touch that we will always remember.", "title": "charming", "helpfulness": 1, "user": "curnynto", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 62978477}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our guests were more than pleased with their rooms....the bride and groom especially!My thanks to Stacey and the Seven Gables Inn for an evening that will remain a special memory in our hearts forever.", "title": "Charming hotel", "helpfulness": 1, "user": "dolphinupenn", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62897705}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We were visiting our son a student at SLU, he recommended it and we enjoyed our stay.", "title": "Amazing, quaint and friendly.", "helpfulness": 1, "user": "bchmiele", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62771421}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Exceptional staff across the board. Everyone seemed to go out of their way to be helpful. Would definately return. Thanks", "title": "friendly", "helpfulness": 1, "user": "cloud41", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71407332}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My husband and I stayed at the Inn for seven nights. We were in Saint Louis for our son's graduation from boot camp at Fort Leonard Wood. We weren't sure what to expect since we booked the room online, but we were very happy with our choice once we arrived. The Inn was lovely and the room was very comfortable; especially the bed! It felt more like staying in a friend's guest room than being in a hotel. We had the room over the Irish Pub \"Molly Darcys\" below but never heard a bit of noise even thought the Pub was filled with customers every night. The Inn is located in the business district of Clayton (upscale area). The streets were lined with restaurants with outdoor seating, and decorated with flower filled window boxes and planters. Very quaint. Molly Darcys (attached to the Inn) has great food. Being there for seven nights, we got to taste several things on the menu and liked them all! We also ate at many of the restaurants in the neighborhood; there is a wide variety to choose from. If we ever go to Saint Louis again, we will definitely stay at the Seven Gables. Our only grumble was the extra charge for parking our rental car. It cost more to park the car than it did to rent it! But even with that in mind, we would stay there again.", "title": "Charming Inn", "helpfulness": 1, "user": "CharyF", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70178438}, {"rating": 5.0, "title": "Small, comfortable hotel in great location", "text": "Friendly staff, nice rooms and very comfortable beds. Excellent on-site restaurant. Located in downtown Clayton, easy to get to from interstate; Many good restaurants within walking distance of hotel. Also close to mass transit. Close to Forest Park, Wash U", "helpfulness": 1, "user": "becca7737209", "date": "July 7, 2010", "id": 70093285}, {"rating": 5.0, "title": "Wonderful", "text": "The staff is very helpful and friendly. The room was great. The restaurant had excellent food and I enjoyed the Happy Hour.", "helpfulness": 1, "user": "RCWiles", "date": "July 6, 2010", "id": 69921022}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Seven Gables is a really nice old building with very pretty and interesting rooms. The staff were pleasant and we had a great time there. The AC was a window unit and worked very well despite hot weather outside, and we were also given a fan. There was complimentary water and chocolate as well as the usual free soaps and shampoos, etc.", "title": "Interesting and Nice Place. Wish we had more nights there!", "helpfulness": 1, "user": "porter999", "date": "June 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67386879}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My husband and I stayed here for two nights in September for business/leisure. We have stayed in several different hotels in STL from the Ritz to the Drury Inn. The Seven Gables Inn was a nice change of place and we will definitely return.", "title": "A Nice Change of Pace", "helpfulness": 1, "user": "gee_ess61", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 79840628}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Pros: Wonderful staff with excellent customer service skills. Our reservation was waiting on us when arrived, the room had been assigned and the gentleman who checked us in was more than competent. The whole process took about 5 minutes, tops. The room was quaint and very roomy. The bathroom was quite large with a jacuzzi tub. We were in rm 317 which had a king bed. The continental breakfast was good - plenty of coffee and a nice selection. There was complimentary wine and cheese during happy hour which was a nice touch.", "title": "The kind of intimate hotel where the housekeeper runs to the parking lot with the camera you left behind in your room!", "helpfulness": 1, "user": "Gardrews", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78627249}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Cons: The lack of an elevator could be problem for some people. Travelers should note this carefully. The nightlife of Clayton can be noisy and we could hear this in our room. It wasn't awful because there was a fan in our room that helped drown out the noise. Our room needs blackout curtains (or updated window coverings at the very least) because the security lights on the building shone right through at night. Also, because the rooms are decorated in antiques and not slick urban hotel furniture, you may have a few squeaks and creaks in the bed. Ours was especially bad but when I commented to the front desk, they promptly addressed the matter.", "title": "HOME AWAY FROM HOME", "helpfulness": 1, "user": "roxannehhh", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77551977}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Suggestion - I think it would be great if the area adjacent to breakfast area was set up with some conversational seating. All seating in the public areas is at tables and chairs. There is really no place to gather comfortably.", "title": "Extraordinary and beautiful hotel with plush accommodations", "helpfulness": 1, "user": "AquaDoll303", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77244068}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Overall, I think this hotel gives the impression it is constantly striving to improve itself. Does it need some TLC in the rooms? yes. Does it keep me from returning? no.", "title": "Lovely inn, excellent staff", "helpfulness": 1, "user": "GrantCalifornia", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76651320}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 16, "average": 12, "very good": 74, "terrible": 14, "excellent": 137}, "aka": "7 Gables Inn", "slim_ranking": 0.4}