{"user_rating": 4.5, "review_count": 1124, "name": "Shangri La's Barr Al Jissah Resort & Spa-Al Bandar", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We have just come back from a 5 night break at the Al Husn Shangri La in Muscat. We had a wonderful time. The weather was lovely - blue cloudless sky about 25 -30C during the day - bar Valentine's Day (was cloudy). The hotel is at a spectacular setting, hurned out of rocks that plunge straight into the sea. The sea was clean and warm and calm - ideal for adults and children alike. Some watersports provided though the snorkelling off the hotel beach is limited. I suppose the corals were probably disturbed by the building process. You have to take a boat out to neighbouring undeveoped coves to snorkel - almost as good as the Red Sea.", "title": "Excellent but 6 stars?", "helpfulness": 10, "user": "graced", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6815133, "likes": {"liked": "— The setting", "disliked": "— There were some building work on site and can be noisy."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "One thing to clear up - when I researched the Shangri La I got quite confused by the various names. There are 3 hotels on the Shangri La resort - the Al Waha (for family), the Al Bandar (medium range for couples/families) and the Al Husn (ultra luxury for couples only). All 3 sites are within walking distance and guests at Al Husn can use all the facilities resturants etc although it doesn;t work the other way round I think. Al Husn has an infinity pool and its own private beach.", "title": "Choose Muscat, Choose Shangri-La All Jissah", "helpfulness": 17, "user": "Elton_Bear", "date": "February 15, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 6797450, "likes": {"liked": "— Location, comfort, cleanliness and friendly staff", "disliked": "— The way the whole tone changed when school holidays arrived."}}, {"rating": 5.0, "title": "Fabulous,will return at end of year.Hotel, food, staff,Oman could not be faulted", "text": "The hotel is brand new(a year old) and one can see some teething problem. The staffs are mainly foreign recruits (Fillipinos, Indians etc) which are all keen to please. But sometimes services can be frustrating due to communication problems and sometimes funny. Like they swipe your plates away as soon as you have finished your food - there is a fine line between prompt service and being brusque! Also at busy breakfast time there was long wait for a la cart cooked meals and the staffs are visibly stressed!", "helpfulness": 12, "user": "jetseta", "date": "February 10, 2007", "id": 6776966}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Having said that the food and the facilities are wonderful - amazing seafood and excellent chefs. We had tapas, sushi, contemporary French (?) /Asian seafood - all excellently executed. The rooms are big and luxurious - v comfortable bed. Staff comes round with little treats like sorbets and pieces of fruits by the pool and beach - very nice touch.", "title": "thumbs up for Shangri La Al Jissah Resort", "helpfulness": 19, "user": "camelman", "date": "February 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6775997, "likes": {"liked": "— location", "disliked": "— the high prices"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I think as a 6 star hotel it has still got some way to go - mainly in staff training. We would definitely go back though - before long I hope as I am sure this will be the next Dubai.", "title": "A long way away.", "helpfulness": 8, "user": "Beynon", "date": "February 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 6762835, "likes": {"liked": "— Location and Views", "disliked": "— Carpets"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the Al bandar part of the Shangri la resort, all of the facilties were great. The reception and bar area is particularly opulent. Our room was spacious and had everything we needed, the a/c worked very well, and the room was turned down twice a day. The grounds are beautiful and very well kept, and there were at least 3 swimming pools with a lazy river", "title": "Classic Luxury", "user": "MrBenjamin", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71481592}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We went for the half board option which was good but the restaurant was very busy in the evenings and on at least 2 occassions we had to come back later when it was more quiet. However the restaurant manager was excellent and gave us a complementory bottle of wine as an apology.", "title": "Nice Calm Resort with generous management", "helpfulness": 1, "user": "LaCigaleManagement", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68437814}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We are returned early next year to the Al Bandar for another 7 night stay. Thoroughly recommended.", "title": "Excellent Resort overall- do not hesitate to book", "helpfulness": 5, "user": "RavBug", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68224800}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Very nice resort & rooms… Warm welcome with personalized check-in although I had to pick up my luggage from the car to the reception.", "title": "Luxury and great service", "helpfulness": 1, "user": "CDJ13", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67835466}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Internet is free of charge which is an additional benefit but it is only wired at rooms.", "title": "5 star self service", "helpfulness": 3, "user": "186525Jim", "date": "June 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67153288}, {"rating": 5.0, "title": "Great holiday loved this hotel....", "text": "Stayed at the Bandar (middle of the 3 hotels) having previously been a fan of Dubai and having been put off by all the building work and the escalating cost of going there. This hotel is not for you if you like lots to do as it is some way from town, but if you want to fly and flop, have a variety of dining experiences from casual to more formal, and like a bit of luxury then you will enjoy it. Not sure about the star sytem - no treats on the pillow or on your sunbed (bits of fruit, a cold towel to mop your brow like in Dubai!!) but otherwise excellent. 32 degrees most days also helped! We will defininitely return!", "helpfulness": 9, "user": "Gail-7", "date": "March 17, 2007", "id": 7179094}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Just got back from ten fantastic days, staying at the Al Waha (the 'cheaper' hotel of the three) and we have not been disappointed.", "title": "Excellent!", "helpfulness": 21, "user": "johnqb", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7014812, "likes": {"liked": "— The cleanliness and size of rooms and the friendliness of the staff", "disliked": "— the food"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The hotel complex lends itself to a magnificant beach (apparently the best in Oman); excellent facilities - no end of swimming pools and a great gym and lovely people - the staff are very friendly and cannot do enough for you.", "title": "faultless", "helpfulness": 9, "user": "Cowardy", "date": "March 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6893896, "likes": {"liked": "— Very good standard", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I would certainly recommend this hotel for couples or those with young famillies. We don't have children yet - we are expecting our first in July - however, we observed the way in which the staff interacted with those with young children and it was a joy to see - very child friendly.", "title": "Al Husn Hotel...Fantastic", "helpfulness": 10, "user": "AngeloLondon", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6856588}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The hotel is nestled into the mountains and it is true that there is nothing to do directly outside of the complex. However, a shuttle service does take you to some nearby souks, but be warned, this is not Dubai and the quality of shops on offer are very average. That said, this is a place where you can truly go and escape the rat race for a couple of weeks and come back to feel refreshed.", "title": "Amazing Hotel, but not one to recomend", "helpfulness": 6, "user": "uktravellerLeeds", "date": "February 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6836719, "likes": {"liked": "— the pool", "disliked": "— the food"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I would agree with the travellers, it is a beautiful resort, with outstanding service, great food and perfect location. We stayed for 6 nights in Al Bandar and there is nothing I wish they done better. Lazy River is good if you are bored from lying in the sun. Take your snorkels as there is a good variety of sea life, all you have to do it swim along the rock. The SPA, it is just beautiful and it is a shame we used it only ones.", "title": "Beautiful is the least I can say", "user": "Snizhana", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78615062}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Anything we asked for was provided with the smile. Definitely contact the Turtle ranger; it is just fascinating to see the huge turtles on the beach at night laying eggs.", "title": "Perfect hotel- spoilt by extras and lack of alcohol!!!!", "user": "Honey013", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78360297}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Diving centre 5 min away is a plus, just get a free shuttle bus and you are there. Diving itself is ok, but good activity to break the day. Go on the trip to Nizwa largest city in the Ad Dakhiliyah Region.", "title": "Nice hotel but could be better....", "user": "BikeAylesbury", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77792895}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My partner and I didn't do anything for six days - just enjoyed the lovely sunshine!", "title": "Beautiful resort, extortionate prices", "user": "artimus19", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 77187421}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We were not warned about Ramadan and the lack of alcohol and our extras (even though full board,) came to over £400 after paying over £2,200 for the holiday!", "title": "Smart, luxurious beach hotel.", "user": "TravelGuru71", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77149732}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Rooms and facilities closer to 4, rather than 5, stars. Room was a disappointment, the bathroom was about the same size as the bedroom so I couldn't help thinking why didn't they shave a bit of the bathroom and expand the bedroom a tad? However, free internet was a bonus given that so many hotels now charge extortionate rates for this. Large number of restaurants to choose from but on the whole quantity over quality seems to be the rule as far as food goes - snacks at the Al Waha's poolside bar were practically inedible. Prices for alcohol are very high - €10 for a beer, cheapest bottle of wine €28. But you are a captive audience, the nearest town is a taxi ride away so not easy to bring your own supply. This place is really meant for people who want to do nothing else but lounge in the sun and take the occasional dip in the water, although much of beach is covered in seaweed and sharp rocks! But if you want to explore you have to use organised transport to get around which limits the fun of discovering things. It's not a bad place, just not as luxurious, interesting or enjoyable as I expected it to be.", "title": "OK, but.....", "user": "Bluftut", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 81038591}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed at this hotel for 5 nights and enjoyed every minute. The hotel is located about 1hr away from Muscat City Centre so we stayed mainly at the hotel but there are plenty of restaurants for lunch and dinner for a short break. There is a shuttle that runs twice a day to the shopping mall and souks. We took a trip on a speed boat for Dolphin Watching which was amazing...there were plenty of Dolphins to see.", "title": "Amazing Al Bandar", "user": "MissVip", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80925752}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The pool area was really nice and as soon as you get there your towel is laid down for you and you get a cool box with water which is a really nice touch, the pool staff come round with cold towels and fruit during the day. The beach is not the best in this area however Kayaking is complimentary. There is a lazy river which runs from Al Bandar to Al Waha (sister hotel) which is great fun.", "title": "Good but expensive", "user": "csr_10", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 80515973}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The restaurants are not cheap expect to pay similar to London prices...the buffet at the Al Tanoor restaurant was approx £35 but the qualilty and choice of the food is excellent so good we went twice!. Other great places to eat were Capri Court, Surf Cafe, Circles and Tapas. All restaurants had a seperate vegetarian menu....Alcohol is expensive approx £35 for the cheapest bottle of wine, drinks in the Piano Lounge bar were quite reasonable.", "title": "Very good hotel with excellent staff.", "user": "Gul75", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79723703}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The rooms were nice and spacious and very clean - no complaints. Staff at the hotel were very friendly and always happy to help particularly at breakfast, the staff are very accomodating and cater for special requests and remember them the following day without needing to be prompted.", "title": "a perfect retreat", "user": "mzbebol", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79629110}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Lovely hotel set in serene surroundings. The Omani's are friendly and welcoming people. The hotel itself has decent sized rooms with a kettle (coffee/tea/sugar etc), iron and other things you would need when traveling with a baby. They provide a cot at no charge as do all hotels in the Middle East. We took a ground floor room facing the pool which is a good idea if you have a small baby and use a pram. There are also two sun loungers on your patio and a table with two chairs. Good for drying wet clothes and shoes. We didn't have a bath so had to bathe the baby in the shower but it all worked out. Suppose we should have asked for a bathroom. It is a big bathroom though with everything you need. You get plenty of free water at the hotel, whether in the room or sitting by the beach or pool which is great. Just beware of wasps, there are alot or at least it seems at this time of year and they can be scary when they are roaming around you and the pram, especially if you are allergic. Not much you can do about it though. The hotel also provided us with little swimmers nappies free of charge which was nice (we did ask). You may need to bring your small baby float as the only one they had was damaged. All in all it was a fantastic weekend, highy recommended for families and a relaxing trip. The hotel is located right next to the dive center, a heritage village and small shopping complex.", "title": "Relaxing and welcoming", "user": "cosmikcreepers", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76932580}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was my first visit to Oman so I had lots of questions, so big thanks to greasy & silverswimmer for their advice, they were really helpful!", "title": "So perfect", "helpfulness": 1, "user": "lalalatracy", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 76709949}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Taxi from airport to Shangri La is fixed at 13omr, you pay at the booth outside the airport, journey is about 40mins or so.", "title": "A class act - isolated but very peaceful, beautiful and efficient.", "helpfulness": 2, "user": "johnny_5_bellys", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 75885933}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Hotel is a little far from town but the setting is stunning & dramatic!", "title": "2nd visit - Even better!", "helpfulness": 2, "user": "Captain587", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75035023}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Hotel is beautiful & the service is faultless, the staff are so professional & super welcoming, I've never experienced service like this...its perfect!", "title": "Very nice hotel, but had a business hotel feel about it", "user": "holidaychicLondon", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 73439664}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "10 days at Al Bandar hotel. Fantastic experience. Ideal place for holidays. Beautiful bedrooms, great comfort, very spaciuos bathrooms. Pool areas very well appointed. Pool water temperature very comfortable, plenty of space and sunbeds in the terraces. Beach well kept an clean. Wide range of additional facilities for both adults and children. The overall resort is very well kept and spotlessly clean. We found that a very important component of this successful holiday was the very high quality of the service and the friendliness of all staff.", "title": "When little goes wrong", "helpfulness": 12, "user": "londoncook", "date": "February 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6753217}, {"rating": 5.0, "title": "The Al Husn,Muscat is a gem.", "text": "The only criticism is directed to the restaurants. Although the food was of very high quality, the presentation was too elaborate and the portions, in some cases, very small. When busy the service was painfully slow.", "helpfulness": 18, "user": "silverswimmer", "date": "February 3, 2007", "id": 6737201}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Our flights with Gulf Air, Business Class, were great.", "title": "Great resort for relaxing", "helpfulness": 6, "user": "WorldwideTraveler001", "date": "February 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6724442, "likes": {"liked": "— Pleasant service, nice rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We'll certainly book again next year.", "title": "A wonderful hotel ... a great escape", "helpfulness": 8, "user": "synchro_girl", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6715309, "likes": {"liked": "— Service and experience", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "great vacation", "text": "Just a few days at the Al Husn on the way back from Kerela.", "helpfulness": 5, "user": "twhgirl", "date": "January 20, 2007", "id": 6628314}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My husband and I stayed at the Al Waha for a week over the new year. There was much about the hotel that we enjoyed but also some areas in need of improving to meet the Shangri La usual standards.", "title": "An OK choice...", "helpfulness": 10, "user": "GracyNewton", "date": "January 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 6627880, "likes": {"liked": "— The gym", "disliked": "— Inefficiency of reception staff and the band"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "By mistake I booked the wrong hotel of the 3...Al Waha is best for families and we do not have children, so on occasion the noise level at meal times and near the pool was tiring. However, we arrived at the hotel early in the day and we were allowed into our room straight away, plus they upgraded us to a lovely room overlooking the lazy river and the beach. The noise of the sea at night was sometimes the reason we were kept awake, however the room was far more preferable than over looking the pool.", "title": "Overall a fantastic location and resort", "helpfulness": 17, "user": "UKexpat", "date": "January 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6621672, "likes": {"liked": "— The location close to the beach", "disliked": "— The patio rooms lack of view or fresh air"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "With regard to the food - there is a good choice of places to eat and the flexibility to eat in the different restaurants on the value vacations rate. Sometimes the buffet in the Samba restaurant was good - lots of choice and some healthy options - one time the seafood selection was sumptuous! However, on other occasions it was not so fresh and appealing, with the options being limited. We ate in our room on occasion and it arrives in a timely fashion on a lovely trolley table but, unfortunately, was very average. What we found most odd about the various restaurants was the insistance that they were fully booked with nobody sitting in them!", "title": "great location", "helpfulness": 8, "user": "LMSomerset", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6570783, "likes": {"liked": "— location", "disliked": "— poor storage space in room"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Breakfast was a scramble! You had to seek out a table yourself that was not too desecrated! The polite and seemingly over worked staff were too few and you had to ask for your table to be wiped down and cleared several times. Cutlery and coffee also needed a few requests to make it happen and we learnt to ask several people to remedy this. As such it was an event but not a deal breaker and the fruit selection was good!", "title": "Al Husn - Not what we had hoped.", "helpfulness": 25, "user": "LisaMJ", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6567737, "likes": {"liked": "— Quality of the rooms/bathroom. Excellent housekeeping service/staff", "disliked": "— Service misgivings"}}, {"rating": 2.0, "title": "Couldn't call it 6 stars", "text": "We were probably most disappointed with the reception staff who were inefficient. They were always polite and appearing helpful but things did not happen as they should. We were told that our transfer had not been booked in advance. It had of course but by then they could not provide this service. They then offered to book a taxi, which we duly turned up for but they clearly had not done that either, so we were nearly made late for our flight. A couple of requests to book tables in restaurants did not happen and our final account was incorrect to the tune of approximately £80...not impressive!", "helpfulness": 21, "user": "mrtraveller1", "date": "January 6, 2007", "id": 6558007}], "location": {"country": "Oman", "region": "Muscat Governorate", "continent": "Middle East", "city": "Barr Al Jissah"}, "stars": 5, "variance": {"poor": 44, "average": 75, "very good": 281, "terrible": 10, "excellent": 714}, "aka": "Shangri La`s Barr Al Jissah Resort & Spa-Al Bandar Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}