{"user_rating": 5.0, "review_count": 165, "name": "Shantaa Koh Kood", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I would like to agree with all the other reviews and say how lovely this place was. We stayed here for 5 nights (until Christmas day) this Dec. The location is amazing - all the villas face west towards the beach and setting sun with plenty of space between the villas. We had the cheapest villa (with 2 beds in it, not the one with the bath tub) and it was spotless, spacious, comfortable bed, outdoor bathroom with good shower (and also novelty shower in the garden section with coconut shell showerhead!) The food at the restaurant was delicious and varied and they also serve it at the beach bar. There aren't other restaurants close by so unless you hire a car you will get all your food from Shantaa - but we loved it so it wasn't a problem, and it was pretty reasonable. The beach by the resort is relatively small but big enough for everyone there. You can snorkel around the rocks and see parrot fish and multicoloured clams etc. There was never a problem getting sunbeds, and you can go and lie on the beach beyond the pier which is pretty much a perfect beach with very few people on it, if any. At the hotel beach there is a table with towels, bottles of water, snorkels/masks and large woven plastic beach mats. The bar Shantaa Bar-bara is also there where they can serve drinks and bring food down from the restaurant. It is a very quiet resort - including the staff (some of whom almost mumble - but were very charming) so if you want to get away from it all, Shantaa would be a great choice. We would go back there tomorrow.", "title": "Idyllic getaway", "helpfulness": 2, "user": "acbw_8", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52466060}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Shantaa is a charming and very well-maintained resort. The rooms are clean and tastefully decorated. We had a \"shantaa sweet\" room with a very lovely outside bathroom and a nice view on the sea. Air-conditioning was available only between 5pm and 8 am, so we had to use the fan during day, which is actually OK if you do not spend the day inside.", "title": "A lovely resort", "helpfulness": 2, "user": "sonderho", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 52444774}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel has a little beachspot, though it is situated near the concrete pier, which can be busy with noisy scooters and cars at some times. Free snorkeling and kayaking is available. Shantaa also offers a (paying) motorbike-rental.", "title": "AMAZING!!", "helpfulness": 1, "user": "KMistry", "date": "December 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51741820}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The staff is friendly, eventhough not everyone understands English. We liked the generous breakfast (with a large choice), which is served on the terrace (beautiful view). The resort's restaurant is also good at night.", "title": "Fantastic place for peace and relaxation", "helpfulness": 1, "user": "Frawa", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48105240}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We really enjoyed our stay at Shantaa and highly recommend it for people travelling to Koh Kood.", "title": "Is there a better word for Heaven?", "helpfulness": 1, "user": "SantiagoDiego", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28089355}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I will never forget our honeymoon at Shantaa. The grounds and views are gorgeous. Arriving there was like entering a dream. The staff are friendly locals and greeted us with a wonderful welcome drink. Our 10 day stay there was the most relaxing and all around best vacation I have ever had (and I have been all over the world including Africa, India, Europe, and South America.)", "title": "A romantic honeymoon that exceeded all expectations...", "helpfulness": 3, "user": "vivalajuicy", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27786692}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Our \"Sweet\" was modern, well designed, private and beautiful. The tropical outdoor bathroom was such a treat. We would leave the windows and doors open during the day to capture the breeze and let it blow though the room. The beautiful huts are surrounded by foliage so that you feel like you are all alone in the rainforest. The beds and linens were extremely comfortable. We loved the view so much from our private deck and the bed that there was no need to go anywhere else! But we did venture out sometimes...", "title": "A gem on what is probably Thailand's last unspoilt island", "helpfulness": 3, "user": "Slowflyer", "date": "February 14, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 24554898, "likes": {"liked": "— Location, atmosphere, service.", "disliked": "— Not much"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "For example, to eat! The food was absolutely amazing. Much better than even the best Thai food restaurants we've dined at. We could not get enough of the amazing curries and seafood dishes, the sticky rice and mango, or the fresh coconut ice cream. All the ingredients were so flavorful and fresh and we looked forward to eating each and every meal. And the views from the restaurant were just as pleasing.", "title": "Shantaa is PARADISE", "helpfulness": 2, "user": "jenbrom", "date": "December 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22714980}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We also loved the peacefulness of the grounds. Even when it appeared that the resort was relatively full (although it is not a large resort) it was quiet and we would hardly notice another soul (with the exception of meal times, although there was always the option of having our food served at our room). The \"Sweets\" are set up on a hill overlooking the water, so the beach was not right outside our front door. Originally I thought this was something we'd miss- but instead we got a gorgeous all around view of the grounds and the water and were able to enjoy the privacy of being away from the few people who might be enjoying the beach. The less than one minute walk to the beach was perfect for us. The beach bar is nice to order snacks or drinks from while you relax by the ocean. Oh, and plenty of shade is available on the beach as well, which is nice for those who aren't able to worship the sun! (Like my fair-skinned hubby!)", "title": "Like a Fantasy", "helpfulness": 6, "user": "ACL16", "date": "December 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 11332817, "likes": {"liked": "— Comfort and Service", "disliked": "— Lack of TV"}}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 0, "average": 2, "very good": 16, "terrible": 0, "excellent": 147}, "aka": "Shantaa Koh Kood Hotel Koh Kood", "slim_ranking": 0.0769230769231, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}}