{"user_rating": 4.0, "review_count": 1084, "name": "Shangri-La Hotel, The Marina, Cairns", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed at the Shangri La for two nights, in between our arrival in Cairns and a stay out at Fitzroy Island. The location of the hotel was perfect, as we overlooked the marina and could actually see the boat we would be taking to Fitzroy. It was only a 5 min walk, which was handy in the morning as I was half asleep!", "title": "We loved it, except for the pillows!", "user": "Brian C", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 135310856}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We had a Corner Suite, which was perfect for the two of us. The room was spacious, the views were wonderful and the facilities and staff were excellent. The pool and pool bar were outstanding and I would recommend the Horizon Club to those who stay there.", "title": "Noisy Suites on Horizon Floor", "user": "AlwaysonHolidayz", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135298677}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The only small issue was the pillows...just a bit too fluffy and took a while to get comfy enough to get to sleep. We tried all of the ones in the room and inquired about some more, but the ones brought up were just as fluffy. It was only a small issue though, and did not influence how much we loved the hotel.", "title": "The perfect place to stay when in Cairns", "user": "AJH611", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135297368}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We booked 5 nights in a suite for a family getaway. I chose this hotel because I have stayed here on several occasions during the week. After previously being upgraded to a suite, we booked a suite which include breakfast and canapes in the Horizon room. Room was large and clean with a great view of the harbour. Our first room was located at the end of what could be the longest hallway in a hotel, unusual but no problem. Arrived on a Wed, and had a little noise from the bar/restaurant/club opposite the hotel(Salt House). A little louder on Thurs, walls shaking on Friday. We were immediately moved with plenty of help from the porter to a room closer to the horizon room. Much better, although still louder than you would expect in a hotel.", "title": "Another Great Stay", "user": "CamnViv", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135231257}, {"rating": 4.0, "title": "Excellent service, OK rooms", "text": "No way I will stay overlooking the harbour on a weekend. Have stayed in city view rooms before, which were pretty good. The hotel should improve sound proofing to suites, or risk having people not staying in them.", "user": "Noodnut", "date": "July 24, 2012", "id": 135225870}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We arrived for a 2 night stay to find we had been upgraded, we ended up with private checkin and check out. the room was great it had a large bathroom which you could see into the bedroom through the glass pannel.", "title": "Nice hotel excellent location same about cairns itself", "helpfulness": 5, "user": "beamishcats", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5436152}, {"rating": 3.0, "title": "Slightly disappointed", "text": "the room was great, we had a large balcony over looking the harbour.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 14, 2006", "id": 5347110}, {"rating": 4.0, "title": "Nice hotel especially if you can find a good deal.", "text": "Do not order room service it took an hour for steak and chips!!!!!!!!!!!!!!!!11", "helpfulness": 3, "user": "jatravel", "date": "June 7, 2006", "id": 5323780}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The hotel staff where help full and organised us collection and drop off at the airport", "title": "I loved the Shangri-La, Cairns", "helpfulness": 4, "user": "princelycharmer", "date": "May 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5056967}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We stayed 4 nights but would have stayed a year! Loved it in every way. Well done Shangri la staff take a bow. We will be back. Who needs to go to Fiji or Vanuatu when we have better here in Australia. Cairns & Port Douglas Great barrier reef. Clean & truly a gem in Far North Queensland", "title": "Wow factor", "helpfulness": 2, "user": "wanderlustLangwarrin", "date": "July 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135734136}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Loved our room, esp being able to see the bathroom from the bedroom....very luxurious, great bath. Breakfast was delicious. Location good too. Staff very obliging. Even after checking out we were able to leave our bags there for the day, come back from our reef cruise and have showers before we headed to the airport....", "title": "Beautiful hotel", "helpfulness": 1, "user": "Kiwisok", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135662133}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I have just spent some days attending a conference held in The Shangri-La Hotel, The Marina, Cairns. Cairns is an interesting place for a short stay and I have been here some three times in recent years - it is a good place for a short stay before moving further up the far North Queensland coast to Palm Cove, Port Douglas, Mossman and the Daintree. Cairns is a good starting point to visit the Great Barrier Reef, explore the hinterland and the Atherton Tablelands, plus do local visits to fish and explore the waterways. This was my first stay at the Shangri-La - one has many choices of accommodationist cairns to suit all budgets with this hotel being at he upper end of the price range, classed as a 5 star hotel. The position out adjacent the Marina area is fantastic and if you can book a room overlooking the water you will not be disappointed. The views are spectacular. The hotel itself however is a little tired and worn. The rooms are spacious but frankly housekeeping and cleaning (for my room at least) was not their forte. Furniture is a little battered, stains abound and the mattress (a foam affair) is far from comfortable, likewise the pillows. If you burn up your energy during the day you will sleep well but the bed is certainly not the most comfortable. Staff are obliging and friendly, there is a huge choice of adjacent restaurants to sample various cuisines. The pool area is beautiful and caters to all age groups. A nice hotel in a great location but not 5 star.", "title": "Great position, tired hotel", "user": "PhilthetravellerXI", "date": "July 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 135653492}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed in a delux room overlooking the Marina with our 2 boys (7 & 10) for 3 nights. The view was lovely and the room was quite acceptable. We had 2 very comfortable queen beds. As 5 star hotels go, the room was very average. I would rate it as a good 4 star hotel. The lobby staff were very friendly and helpful, particularly the lovely lady (sorry forgot the name), who helped us book our reef cruises and trips to Kuranda. She was very efficient and did all the research and bookings for us. The breakfasts in the hotel were served in a restaurant just outside the hotel, which i thought was a bit weird. OK food, nothing to write home about. The hotel pool was gorgeous, but unfortuntely the weather had cooled off so we couldn't swim. The girl serving at the pool bar was new, from South America, and very friendly. She had no idea how to make any cocktails + I payed $9 for a terrible iced chocolate made on water. They should have trained her before allowing her to work. Room service were very friendly and prompt whenever we requested extra towels etc (they never refilled any of the toiletries + forgot to give us the correct number of towels everyday). There are always good and bad points to any hotel, however overall we had a lovely stay at this hotel.", "title": "Good location", "user": "Luv2trvlwithkids", "date": "July 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 135512223}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "What can one say about this place except – AMAZING. It was my first time however my partners second time staying at the Shangri-La, Cairns and for me it’ll definitely not be the last time. I wouldn’t mind staying at ALL the Shangri-La’s throughout the world – mark them off my bucket list!", "title": "Awesome Hotel", "user": "Kylie C", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135384617}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "On our travel through Australia, we spent 4 nights in Cairns with the following program:", "title": "Horizon Club with stunning view", "helpfulness": 3, "user": "Travellersfromswitzerland", "date": "June 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7804592, "likes": {"liked": "— The bathroom, the terrace and the harbour view", "disliked": "— Expect a warmer welcome, more personalized service, more food options"}}, {"rating": 3.0, "title": "Check and Confirm booking", "text": "1st day: Coral Reef", "helpfulness": 2, "user": "JanaliSydney", "date": "April 22, 2007", "id": 7414401}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "2nd day: Atherton Tableland", "title": "horizon club-great, executive-suite good, hotel-excellent", "helpfulness": 3, "user": "Sammiev", "date": "March 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7160493, "likes": {"liked": "— the service", "disliked": "— hotel room too far from the lift"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "3rd day: Daintree National Park", "title": "Nice location for a short stay", "helpfulness": 4, "user": "Vesa", "date": "March 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6900154, "likes": {"liked": "— Location, rooms", "disliked": "— Freezing cold lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "4th day: Flight over rainforest and reef followed by skyrail to Kuranda", "title": "Not bad", "helpfulness": 2, "user": "mrwanderlust", "date": "January 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6654702, "likes": {"liked": "— The location", "disliked": "— Lack of working in-room Internet service (did not work for three days)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Stayed here for 3 or 4 nights in August. Had a great stay. Very nice staff, great location, modern hotel. Some of the furniture in the room looks a little cheap, but it's functional. The pool is very nice, and the bathroom is huge. I will definitely stay here next time I come to Cairns. Also, the internet was free and very fast!!", "title": "Great hotel", "user": "Soly44", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134858313}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Stayed 2 nights booked through a Wotif special so a great price. Room beautiful very spacious although we had a garden view actually had a view of a shade sail which was disappointing. Took advantage of the 24 hour movie deal which was great. Room service was hit and miss asked for a bucket of ice and had to keep chasing it up, gave up on one occasion. Room not re stocked on 2nd morning although towels did get changed. Breakfast was wonderful fresh and plentiful although very busy on Sunday morning. Overall a great weekend in a great location and would definitely go back.", "title": "Relaxing home away from home", "user": "jet_au2000", "date": "July 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 134767601}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Have stayed at the Shangri-La three times and each time have absolutely loved it. Upgraded to the Horizon Club room the second time and it was fantastic, the rooms and the view were amazing, not to mention the access to the Horizon Club for breakfast and canapes. Font office staff were particularly helpful when we decided to extend our stay last minute and had to move rooms (especially Claire, Hild and Kathryn), as well as when I had to fix a room charge. Had trouble with in room dining but this was fixed up by the front office staff. Dinner was lovely and not too expensive for a five star hotel. I think the staff are what really makes this hotel 5 star, they are always friendly and obliging and have always gone that extra step to make sure that I have a comfortable and memorable stay.", "title": "Wonderful Stay", "user": "Clare W", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134709067}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Can't wait to go back!", "title": "The best hotel in Cairns", "helpfulness": 1, "user": "jane n", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134589293}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I booked into this wonderful hotel for a few days before my I was joined by my daughter. Through Flight Centre we were booked into the Hilton which is advertised as a 5 star hotel. Compared to the Shangri-la, the Hilton was only worthy of 3 stars in my mind. I have never slept so well in my life because of the comfortable bed and amazing bathroom. The views didn't hurt either. A special thanks to Katrina also for her kindness and help and definitely book into the Horizon Club. I can't praise this place high enough and will be back.", "title": "Lovely room and great service", "user": "jennyettim", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134391326}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Great place to stay right on the water. Very near to any spot you want to see in Cairns. Great restaurants around it. Excellent helpful staff, and right beside the Lagoon. Found it on Hotwire, but would recommend to all.", "title": "Excellent Stay, Great Location", "user": "Colin M", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135214918}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My husband and I were only able to stay 1 night as the next evening was booked out.Much to our dissapointment because were had such a lovely stay. Staff on arrival were curtious and friendly, we were pleasantly surprised with a fruit plate dilivered (complimentry) to our room, I thought was a nice personal touch. Toiletries of good quality (no need to bring your own for an overnighter) a big plus in my books. Pre dinner drinks and canapes shared with family as well as a great breakfast the next morning. Unfortunatly the weather was adverse so we were unable to use the pool facilities but we admired the tropical garden surrounds which should be commended as some of the plants are outstanding.Thank you for the lovely stay and we look forward to our next visit.", "title": "AAA", "user": "GottaGoTraveller", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135203541}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We arrived at 11:20am, check-in was a breeze and our room was ready for us even though check-in is not till 2pm. Later that afternoon a welcome gift arrived for us as well.", "title": "Great Position", "helpfulness": 1, "user": "CherH9", "date": "July 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135201132}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed in a superior Bay view room which was just perfect for the cooler months because we where protected from the wind. My husband said the Marina side would be the side to stay in for the warmer months.", "title": "Besto hotel stay ever!", "user": "GeryJ", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135006608}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This was a family holiday, 2 adults and our 12 year old daughter.", "title": "excellent hotel in superb location", "user": "AustraliaTriplec", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134863179}, {"rating": 5.0, "title": "Top Notch in Cairns", "text": "The Shangri-La is well located on the seafront where the majority of boat trips depart from and is only a tiny walk from the centre of town. Surrounded by a boardwalk full of restaurants, it even has its own shopping mall. The hotel itself is minimalist but has maximum style and the beds were very comfortable with luxury matresses. Hotel staff were wonderfully helpful especially the tour concierge who takes no commission for bookings and was knowledgeable. The pool was also very nice with large jacuzzi, waterfall and free towels. I really recommend this hotel, it seemed like the nicest one in Cairns! It was worth every penny to stay here.", "helpfulness": 2, "user": "Fussypants", "date": "January 22, 2007", "id": 6642633}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I stayed here for two nights in Dec 2006 and was booked into a Bayview Room. First night was great, peaceful and the view of the bay was great. I didn't realise it at the time but there is a difference between bayview rooms and marina rooms. The second night I came back to my room at 11pm and found out the room was pretty much right above a very loud bar that stays open until 2am - or as I was told by reception until the last guests leave. I managed to get shifted to a marina room at about midnight and had a good nights sleep. The marina room was great. If you book here and you like a quiet night don't book bayview. I've seen other hotels advertise rooms and honestly say that on certain nights there is a elavated noise level and I think this hotel should do the same for (some) bayview rooms. Reception agreed it was a noisy room when I checked out - \"the music is absorbed in the rooms\". Apart from that no problems but that was enough. The pool closes at 8pm which seemed a little early though.", "title": "Noisy Bay View Rooms", "helpfulness": 4, "user": "WATravellerPerth", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6570555, "likes": {"liked": "— Marina rooms have great view for Cairns", "disliked": "— Bayview room was noisy!"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 55, "average": 130, "very good": 357, "terrible": 33, "excellent": 509}, "aka": "Shangri-La Hotel, The Marina, Cairns Hotel", "slim_ranking": 0.132352941176, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Ideally located in the heart of Cairns, the Shangri-La Hotel overlooks Marlin Marina, Trinity Bay and the lush green mountains of Cairns.The hotel—which recently completed a comprehensive AU$35 million redevelopment is a short stroll to the Esplanade Lagoon and Cairns’ premier dining precinct The Pier. The upgraded hotel offers airy, modern accommodations with elegant furniture and spectacular views of the Marina. Shangri-La’s renowned Horizon Club is the only true five-star club floor facility."}