{"user_rating": 4.0, "review_count": 1347, "name": "Shangri-La's Fijian Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Have stayed in many places around the fijian islands over the last 8 years, each time returning to the Shangri La.", "title": "AMAZING!!!!", "helpfulness": 3, "user": "Greenie91", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93910495}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Anyone who has something bad to say needs to relax and not let the little things worry them. Its an Island were the kids can run around swimming, canoeing, and be entertained by Johny in the pool.", "title": "Great Family Holiday - Fabulous New Years Eve Fireworks", "helpfulness": 3, "user": "ChelleL", "date": "January 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 93150170}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The food is not 5 star if you choose to eat in the buffet but if your willing to spend the money try the other venues to eat. Geckos across the road is also great entertainment.", "title": "Read reviews..worse holiday ever.. wouldnt feed food to my dog !", "helpfulness": 9, "user": "Stollar", "date": "January 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 92884813}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The rooms are clean and have housestaff coming through morning and night.", "title": "Families give Shangri-La a chance!!", "helpfulness": 4, "user": "Mkristiansen", "date": "January 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 92750611}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "All the staff have big smiles and will say bula and help you out. some even will invite you back to there village if your lucky enough.", "title": "Diappointing waste of money. I will never return.", "helpfulness": 2, "user": "ScubaSally77", "date": "January 9, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 92334533}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "After searching MANY resorts in Fiji, I choose this place because the photos were amazing on the website! Only stayed 2 nights because it was quite expensive and Im glad I only spent 2 nights. The place needs some serious TLC. Its known for being the first resort on the Coral Coast and it looks it. Besides it being very worn, I cant say anything bad about the resort, it was just average.", "title": "Not Worth the Money.", "user": "2010_Tanya", "date": "January 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 94992045}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Sadly, the Fijian Resort is beyond its \"used by\" date. Hong Kong management is well aware of this but until they can build a new resort at Natadola Beach this outdated resort will have to suffice. I have stayed there more than 25 times so I have some familiarity with its pluses and minuses. The Fijian staff couldn't be more pleasant and helpful. Sadly, the food is ordinary and, as far as I am aware, management has not listened to the request that children should be out of the main restaurant by 7.30pm so that adults might be able to enjoy their dinner in relative peace. In terms of management, it falls short of what a ShangriLa Hotel expects.", "title": "Cannot report in one sentence", "user": "derek_murphy", "date": "January 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 94826127}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "However, this all pales into insignificance when one looks at the very new frequent stayer rewards programme, called GC Rewards. Book through a travel agent and you don't get any rewards. Not spelt out in the sales blurb. Very bad! Exceptionally bad! Savvy travellers will understand the significance of this. Other hotel groups must be licking their lips! Derek Murphy", "title": "Will be back, without a doubt :)", "helpfulness": 21, "user": "kelsu77", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94340163}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We have previously stayed at the Shangri La in 2009 and decided that we needed another trip in 2010.", "title": "Great for kids. Service could be better.", "helpfulness": 3, "user": "pabsSydney", "date": "January 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94317034}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We are a family of 5 - 2 adults (30's) and 3 children (10boy, 7boy & 4girl). We had only been to the resort as a stopover for a couple of days before and after the USA, we loved it so much we decided to take a proper holiday there, this time we stayed for 9 nights. We truly didn't want to go home!!", "title": "Crap! Rundown waste of money!! Please don't waste your time and money!!", "helpfulness": 6, "user": "Travellingchick2401", "date": "January 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 94203857}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Spent four nights at the Shangri- La with my husband and his extended family for a wedding. The resort was fine and we didn't experience any problems with our room. It's a big place and our room was in a great location near reception and restaurants. Some of the others in our group were a long walk from both.", "title": "Better than I expected... aside from the food", "user": "Angelco", "date": "March 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101458410}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The big downside was the food. It was overpriced and very average. We ate in most of the restaurants during our stay and even the fine dining Kavelu restaurant was disappointing and didn't live up to the fancy menu. Some of our group ate across the road at Geckos and said it was cheaper but still pretty standard. The buffet breakfast (included) was okay. We ate late long breakfasts so we didn't need lunch.", "title": "Holiday of a Lifetime", "helpfulness": 2, "user": "Clearwater_VIII", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101067441}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Had a nice spa treatment at Chi... quite an impressive set up, but again, very pricey. The pool areas were good... Lots of kids, though, especially in the main areas. Also, wouldn't recommend visiting in March as we had thunder storms most afternoons and people in the pool/beach areas were told to get out of the water because of risk of lightning strikes.", "title": "We wanted a relaxing holiday and got one!", "helpfulness": 2, "user": "kathygriffin73", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100782251}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "If you are looking for a holiday that is just total rest and relaxation, honestly, you would not", "title": "People that leave poor feedback for this resort must be very hard to please!This place is pure Paradise!", "helpfulness": 3, "user": "melcaz123", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100568147}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "beat this most beautiful, amazing resort. My husband and I came here for our 25th Wedding", "title": "Nice resort with a great beach", "helpfulness": 3, "user": "look4more", "date": "March 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 100091207}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Grounds beautiful. Ocean views beautiful. Pool in poor condition with some filtration problems - little bugs in water. No shelter or shade over pools which is much needed to help with respite from the scorching sun. Restaurants very poor quality and all seem to offer the same menu. Breakfast very nice service on linen table cloths with choice of indoor or out on balcony. Great buffet available for breakfast. Rooms more motel like - not resort type. Good fun to be had in Black Marlin bar during evenings with good music and dancing. Unfortunately, I would not choose this resort again. We spent a week at the Westin prior to going to the Shangri La and the comparison is chalk and cheese. Still made our own fun and enjoyed time with family. In general, fairly disappointing. Nice chapel for weddings overlooking ocean.", "title": "BEAUTIFUL LOCATION BUT LOOKING VERY TIRED", "helpfulness": 1, "user": "RATING255100", "date": "February 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 97630665}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We stayed at this resort for two weeks in January - far too long. The location is beautiful, on the Coral Coast with lagoon and beach. However the resort is isolated on Yanuca Island - good in some ways but limits you to eating at the resort restaurants. Although there are a few restaurants the menus are too similar, the food poor to average and the service - well, let's just say it's 'Fiji Time'! The resort is very expensive. Our biggest gripe was that the resort is old and its showing its age. Our aircon did not work properly and the pillows and linen smelt of mould (as the the entire room). Our 'free' room internet connection did not work for the entire two weeks, although the pool areas do have WIFI. The rooms maids never left towels for some reason and we had to ring up on a daily basis...It would have been okay if we had been paying two or three star prices but we paid five star prices and were not very impressed. We sampled Sheraton Villas in Denarau on the way out and should have stayed there! A much much nicer resort and you can visit and eat at the neighbouring resorts. It's worth checking out the Shangri La, but don't stay there too long.", "title": "Five Star Location, Three Star Facility, Two Star Service", "helpfulness": 2, "user": "K1WiTraveller", "date": "February 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 96105762}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I expect that this resort was once a five star establishment. In July 2010 it was something like a 3.5 star resort.", "title": "I'm sure there is better value for money.", "user": "PAC74", "date": "February 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 95811898}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "It was very expensive and rated and recommended highly.", "title": "Perhaps a 2-3 Star Resort at most", "helpfulness": 3, "user": "Michael232", "date": "February 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 95139849}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "But:", "title": "great relaxed family holiday", "helpfulness": 12, "user": "fijiobsessed", "date": "January 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95013447}], "location": {"country": "Fiji", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 98, "average": 213, "very good": 447, "terrible": 75, "excellent": 514}, "aka": "Shangri-La`s Fijian Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The resort is exclusively located on the beautiful 109-acre private Yanuca Island with its pure white sandy beach and crystal clear, coral rich seas of the exotic Fiji Islands. Only 45 minutes from Nadi International Airport, the island is connected from the mainland by a causeway.A traditional Fijian village is the inspiration behind the layout of the 442-room resort. Every guest room, suite and bure features a private balcony with spectacular views of the Pacific Ocean or the resort’s lagoon. Unlimited wired broadband Internet access is complimentary in all rooms. The Resort offers a range of activities, including water sports, scuba diving and golf, and a popular Kid's Club. A wide range of dining options are available, from Pacific Rim fine dining to informal fun dining at the poolside. Cultural shows highlight Fijian lovo, meke and firewalking rituals, South Pacific and Fijian Fire dancers.CHI, The Spa is a secluded spa village set away from the main resort, and provides the privacy and luxury of the largest Spa villas in Fiji. Four Oceanview and two Rainforest treatment villas feature relaxation areas overlooking either the Pacific Ocean or an exotic rainforest, with private garden patios, outdoor bath tubs, herbal steam room and outdoor showers."}