{"user_rating": 3.5, "review_count": 221, "name": "Shari-La Island Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at the Shari-La resort for 4 nights at the start of April 2011. We were on a 2 week holiday and wanted a decent beach accomodation with air con, fridge etc - more \"flashpacker\" then \"backpacker\". The Shari-La was absolutely perfect for what we wanted. I was able to book the rooms online for RM 260 (about £50) per night, of which I paid 50% deposit up front.", "title": "Best accom option on a stunning tropical island", "helpfulness": 3, "user": "Beckiboo1983", "date": "April 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 105123024}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "When we arrived at the resort on the boat the first view of the island was just absolutely breathtaking, it really is paradise!", "title": "Great Beach & Fun Atmosphere", "helpfulness": 1, "user": "THAM38", "date": "April 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104226990}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We upgraded our room to a suite as our friends had done the same, and these had great sea views. The beach hut at first smelt a bit musty, like it hadn't been aired in a while. But it was clean and very spacious with all the amenities, along with a massive terrace with deckchairs and normal chairs.", "title": "Best hotel on Coral Bay - we had a perfect stay!", "helpfulness": 3, "user": "JelDek", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101879031}, {"rating": 5.0, "title": "Had the time of my life here", "text": "The huts have aircon although this was quite old and noisy, but it worked well and cooled the room down fine.", "helpfulness": 1, "user": "SquishyWu", "date": "March 2, 2011", "id": 98649443}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The best beach was just outside our rooms \"Romantic beach\". It was more or less a private beach for the resort, with a few small coves and hardly any people. You can hire snorkels & fins from the beach cafe and go snorkelling here, it was great, there was loads of coral and we saw sharks, turles and loads of amazing fish! It's also well worth doing the day snorkelling trip around the island where you can see even more, and it's really cheap too.", "title": "a very good place", "helpfulness": 1, "user": "David7412", "date": "January 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 91490472}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We didn't book in advance here and just walked in to see if we could get a room. We did, at a price of RM100 a night. I think if we'd paid full price (RM250) in high season, I would have been disappointed.", "title": "Needs a good scrub!", "helpfulness": 1, "user": "Burgs1903", "date": "November 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 86491323}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Much like all the reviews on Tripadvisor we have to agree with whats being written. The rooms are dark and gloomy, cigarette burns in sheets, smell of damp in our room, an active clothes thief (swimming shorts stolen) and the reception area is just worn out with old grubby furniture and the presence of an odd odour!", "title": "Enchanting location, well worn hotel, belongings stolen", "helpfulness": 3, "user": "LaLagartija", "date": "November 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 85972841}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Although we did find the two girls on reception quite helpful and the BBQ buffet for RM6 great value. The 'private' beach was fine, with great snorkeling. It is in a good location with just a minutes walk along the beach to other restaurants and a ten minute walk to Long beach.", "title": "It was great!!", "user": "Putraskyline", "date": "November 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 85666368}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This is an expansive hotel of small chalets scattered along the hillside, built with as low impact as possible within the tropical forest. Standard rooms are tiny, poorly ventilated, smell like mold and poorly lit. Restaurant service is slow, meals adequate. For some reason the resort utilizes overstuffed furniture which is a poor choice for a beach resort. The furniture is grimy and well worn. My expensive leather sandals were stolen from in front of my room. When this was reported to management they advised me to be quiet about it, that this never happens and provided me with a pair of $1.50 rubber flip flops.", "title": "A Rundown Hotel on a Beautiful Island", "user": "nycbuttercup", "date": "September 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 81347949}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We are staying here for 6 nights doing scuba diving course with Quiver Dive Team which situated in front of the resort. We have a room at RM100/night since its a low season and absolutely lucky when there is no rain at all on that time. Room was good and cleanliness was excellent. Only drawback at this hotel is the water pressure was slow. I love the environment (which likely Malay village) of this hotel. Its calm, relaxing but not crowded. Its private beach also excellent and have a stall (hotel stall) selling light snacks and fresh juice. We do not having a package with free buffet breakfast, but taking up a set meal every morning before go diving, it was excellent. The price of meal at this hotel are cheaper than restaurant/stall outside. The best is big fresh juice only cost RM6 (Its like a jug). Another one is there are no room service everyday, you have to put your room key at reception in order to get your room serviced.", "title": "Way Over-priced for the sunless, viewless rooms", "helpfulness": 2, "user": "Ratdragon", "date": "September 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 79178366}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I stayed here recently for 4 nights and it was pretty much a disaster beginning to end. I have never come across more unhelpful and unfriendly staff anywhere (apart from the lady who worked in the hotel shop). We arrived here and waited 2 hours for our room, which was fine as it gave us time to see the island. Once shown to our room we turned on the light and the whole fuse blew. We waited another hour for this to be fixed. Once again we went inside, turned on the light and the fuse blew again. At this point we had to persuade the difficult man behind the reception desk that we would need another room. We were shown to another room with 2 single beds, broken air conditioning, broken hot water and no remote for the TV. We were told we had to stay there at least for that night. So, we did and the following day asked to be moved to another room, which again took some persuasion! Our third room was ok apart from a leaking sink which made the whole room smell! However, we reckoned this was probably the best room we would get here so decided just to put up with it.", "title": "Not a good choice!! Rude staff and belongings stolen!", "helpfulness": 6, "user": "los_robbos", "date": "September 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 77824791}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "On our third day we were packing, to leave the island the following day, when we realised £30 of thai baht and £100 of US Dollars, as well as my mobile phone were all missing. When we reported this to reception they were not only unhelpful but completely disinterested and rude. We asked if they would write us a hotel report which we could pass on to our travel insurance company but the desk staff and manager outright refused as they did not wish to be implicated. Our stolen belongings had been in our bags, locked in the room when they were taken, therefore, it is seems reasonable to assume that people with access to the room's keys were most likely to be responsible as the room had not been broken into. Between my phone being stolen and me blocking it (one day), £120 worth of calls were made - raging!!", "title": "Very good place, over the expectation", "user": "Lele75", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77454595}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Kecil is an absolutely beautiful and idyllic island but unfortunately what should have been a very relaxing and special few days turned into a frustrating and stressful experience and we could not wait to get out of the place! Therefore, I do not recommend this \"hotel\" to anyone.", "title": "Relaxed, clean and friendly resort-style hotel", "user": "Sylvester_Shoe", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75351704}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This is a great place, I went there for a few days only as I wanted to stay on the Besar Island but they only had rooms the 4 th day after my arrival, so I booked at Shari La.", "title": "Cozy and peaceful", "user": "beckhlin", "date": "August 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 73350151}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "They have a small, but fantastic beach, snorkeling is great, very comfortable rooms with AC, TV, nice bathroom, so, everything was perfect.", "title": "What a waste of this prime location!", "user": "Dutch_Guy_in_MY", "date": "August 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 73326077}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Shari-La Island Resort for 3 nights. Without a doubt it is the nicest resort on the island, and the beaches and outlook from the resort are lovely. We are not overly picky travellers and generally stay in mid-range hotels (we have travelled through other countries in Asia) so I feel we are justified in making some criticisms of the resort. The room was large, however, very dark as it had hardly any windows - made it a bit depressing. Despite the large room, the bathroom was tiny and had no curtain for the shower, meaning that everything got wet. I know this is often common in Asian hotels, however, I would have expected a bit better for the price as many cheaper hotels and resorts we stayed in did not have this setup. The bathroom also had a funny (unpleasant) smell and we also found out that the shower in fact was salt water! Our room was also right near the generator, not so bad during the day but quite noisy at night. The staff were nice and very well meaning but did not seem very organised. It was difficult to order food from the menu as often no one could be found to order from. Food took a long time to come, but luckily was very nice when it did arrive. The buffet for breakfast was excellent. One major issue with cleanliness - I have to admit I was disgusted when one night I noticed three cats on a table eating from the dinner buffet which guests were supposed to be eating! Ugh. I'm sure the cats were happy but I don't find that very hygenic. I also saw a few cockroaches on food. If I were to come back to the Perhentian Islands, I think I would stay at one of the resorts on Perhentian Besar and give Kecil a miss. You can always get a water taxi for a day trip.", "title": "Lovely location but some issues with the room (and cats)...", "user": "MelbourneLulu", "date": "July 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 71698418}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We went to Perhentian Kecil with 2 other close friends and not make any booking packages or any accommodation there. Once we reached at the jetty, the staff of the Shari La resort welcomed us and offered to stay with the resort. The staff offered to take a look at the rooms first. Once we went into the room, we felt that the room was so comfortable, nice, cozy and more than what we expected. The room was equipped with hot shower, tv, 24 hour electricity, nice balcony, aircond and fan. The staff also offered us special rates which was RM80 per room per night. During the stay, the staffs were friendly and we do not find any difficulties. We were very satisfied and happy with the resort services. Eventhough the resort was not located at the long beach, the walking distance from the resort to long beach was only 10-15 minutes. However, we hoped that the resort will provide fresh water in the future as the water in the toilet tasted a bit salty . Overall, we recommend this hotel to those who wish to come to perhentian kecil.", "title": "Definitely the best and affordable resort", "user": "mess_meera", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70366577}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Just returned from a 3 month tour of asia having spent our last week on the perhentian island. We booked into shari-la on the recommendation of a friend and were pleased to find it was the first accomodation as you depart the jetty (lugging heavy bags over sand is not our favourite past time!). The room we wanted was a little over budget but the staff were quick to negotiate a price we were happy with. The complimentary drinks, free wiifii and 24 hour electricity made amends for our opting for one of the higher priced rooms. Cheaper, also pleasant rooms were available but we fancied a bit of luxury before returning home - beautiful room, air con, hot shower (which at first was slightly salty until the apparent problem with the pipes was resolved and fresh water returned), fridge, private beaches attatched to the resort (excellent for snorkelling and sunbathing). The staff were very friendly and helpful and the food was good value and better quality than the other restuarants we sampled.", "title": "perfect end to a wonderful trip in south east asia", "helpfulness": 1, "user": "madeliene123", "date": "June 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69021707}, {"rating": 1.0, "stay_parameters": "Stayed June 2010", "text": "We really enjoyed our time at shari-la and have already recommended to friends and family. Perfect last week of our trip and they promised us a good deal if we return for our honeymoon so hopefully we'll come back in the not so distant future!", "title": "WORSE RESORT I EVER STAYED IN!!", "helpfulness": 4, "user": "Raymond_Lum", "date": "June 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 68402231}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "no in room phone,shower with salt water,bad service,no towel,yucky foods with expensive prices.the room was so dirty and no room service!!DON'T STAY THERE!!!", "title": "I would recommend this hotel even little bit expensive", "helpfulness": 1, "user": "Mamasofea", "date": "May 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64793963}], "location": {"country": "Malaysia", "continent": "Asia"}, "variance": {"poor": 31, "average": 57, "very good": 72, "terrible": 21, "excellent": 40}, "aka": "Shari-La Island Hotel Pulau Perhentian Kecil", "slim_ranking": 0.25, "description": "Shari-La Island Resort located at Pulau Perhentian Kecil (Coral Bay), 8 minutes walking distance to long beach. Nice place, nice room, nice environment with natural beauty. Our rooms come with hot shower, satellite TV, mini bar, air-condition + fan and 24 hour electricity. Moderate for all budgets."}