{"user_rating": 4.0, "review_count": 1287, "name": "Sheraton Iguazu Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This hotel has it all, a great view of the falls, 5 minutes walk to the national park entrance, and first class service. We arrived at night and could hear the falls but not see them but when we woke up in the morning what a sight. The Falls are so close you can choose to go for walks then come back to the hotel for breakfast, a swim or a session in the beautiful hydrotherapy pool.", "title": "Best hotel in the best location", "user": "owl4000", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128302096}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The Food and service were excellent and what you would expect of a Sheraton Hotel. One can choose to have a pre dinner drink on your private balcony or on the main terrace. You must get a falls view room to get the most out of your visit it is definitely worth the extra amount you will pay.", "title": "If you like to watch the falls when you wake up", "helpfulness": 1, "user": "Waldmeier", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128234396}, {"rating": 4.0, "title": "Fantastic base to explore Iguazu Falls", "text": "The room was comfortable, aircondioned and spacious. The staff were extremely helpful and everyone spoke English. Whilst it is more expensive then staying in Puerto Iguazu it gives you the opportunity to maximise your falls experience.", "user": "fmwilson", "date": "April 20, 2012", "id": 128226014}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed in this hotel for 2 nights in a fallside room (King falls room) on the third floor. You have a breathtaking sight to Garganta del Diablo, the most spectacular part of the falls. To have this sight was for us the main reason to choose the Argentinan side for the two overnight stays (we came from Brazil and went back to Brazil). The expectations were fulfilled.", "title": "Nice hotel", "user": "john l", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128092899}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "For this sight you have to pay the charge for a 5-star hotel (we payed inclusive tax US$ 425 per night). The hotel itself doesn't have this standard. Okay, the service is good and the staff was helpful and friendly. Breakfast has a high standard with great choice of food and a rich selection of fruits.", "title": "To have breakfast and see the falls- .", "user": "SingaporeBeth", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128029607}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Can only endorse every previous review about the hotel's location - truly fantastic. Glad we didnt' pay a premium for a falls view room as there was so much to do in the short-time we were there that it was always nightfall when we returned to the Sheraton, and you can see the falls from the dining room at breakfast in any case. Our \"jungle view\" room was a slight misnomer as there was a car-park well before the trees, but nevertheless there was an abundance of greenary and birds to see a 100m or so away.", "title": "Truly fantastic location", "helpfulness": 1, "user": "sxeagle", "date": "November 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10835518}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The bedroom was a reasonable size with a really comfortable bed - would have liked to take it back to the UK - and the bathroom was well equipped and always replenished with clean towels, amenties, etc.", "title": "The best location for Iguazu falls", "user": "RWRB", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10702270}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Public rooms a disappointment - the bar area was a little shambolic with seating areas all over the place and slow service. Tried the restaurant for dinner one night but as with the bar there are different parts and it lacked atmosphere. The a la carte was OK albeit expensive for Argentina, but the fixed price 3 course meal was much better value. Free internet access is available but in the evening be prepared to queue for an available terminal.", "title": "Views/Location Barely Make Up for Flaws", "user": "jillpbailey", "date": "November 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10702087, "likes": {"liked": "— Views, Pool, Location", "disliked": "— Rooms, Food, Price, Age of Hotel INterior"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Nice pool area with view of falls, but food/drink service was extremely slow.", "title": "Unbeatable Location", "user": "MJnC", "date": "November 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 10696625, "likes": {"liked": "— Location and view", "disliked": "— Room size and quality"}}, {"rating": 4.0, "title": "Location, Location, Location", "text": "Following previous recommendations we walked the trails as soon as the park officially opened and that was well worthwhile as both were almost deserted by humans but there were so many animals, birds, reptiles out and about, most of which disappear from view when the hordes of day-trippers arrive an hour or so later. Similarly, try to get the first train to the Devil's Throat. We can also recommend the boat ride up river and under and into the falls - but wear a swimming costume and take a change of dry clothes which can be packed, with your shoes, in a giant plastic bag that's provided on the boat.", "helpfulness": 4, "user": "jonesn", "date": "October 25, 2007", "id": 10331732}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were not expecting a great deal from this hotel after having read the reviews on Trip Advisor. However, we were more than satisfied and, in fact, enjoyed our one-night stay at this hotel more than our stay at Das Cataratas on the Brazilian side of the falls, which pretends to be a more upscale property. We were immediately upgraded to a suite with a large balcony and straight-on view of the falls. The staff was friendly and welcoming and we found the preparation of the \"surubi\" fish in the ala carte restaurant to be outstanding. The hotel is located within the national park on the Argentine side and it is a short walk to the footpaths leading to the falls. We found the setting to be both dramatic and serene and felt as if we could easily stay for a week and not get bored. There was a nice outdoor swimming pool but we did not try it as the water was unheated (and the nights are rather cool). We believe this hotel to be highly under-rated with many positive features.", "title": "A Peaceful and Hospitable Retreat", "user": "DCRE", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130124098}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There are a ton of reviews for this hotel, so just a few additional thoughts.", "title": "Best Place to Visit the Falls From", "helpfulness": 3, "user": "Andrew_and_Kate", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130017919}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This is the only hotel in the park and well worth it if you can afford the extra splurge. If you are worried about the costs, consider joining the SPG program and trying to acquire points to reduce your nights. We were lucky in that I'm an SPG Gold member and we consider this one of the best redemptions of our points.", "title": "Perfect location for a visit to the falls!", "user": "Traveller416", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129706482}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The cash and points option is the best way to get a cheaper hotel rate (6,000 points and $90 bucks). Since the hotel normally goes for over $300 and you can buy points at a pretty cheap rate, this is a good option. The hotel is a little dated, and there are nicer rooms in the country, but it was just fine and of course no one goes to hang out in the room.", "title": "2 stars service / 5 stars location / 7 stars rates!!", "helpfulness": 1, "user": "MarianoBsAs_11", "date": "May 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 129321343}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "It was amazing to have a view of the falls - but if you can't pay for the falls view know that you can see the falls from the bar, restaurant, and pool. We did get an upgrade to the falls view and it was amazing. I think it might be worth it if nothing else for the photos!!", "title": "Nice hotel in a great location.", "user": "nate w", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129192713}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Excellent location. You can get a room with a great view of the falls, and it is an easy walk to the various falls trails. The personnel were friendly and helpful. Our stay would have been very good to excellent were it not for the restaurant. It's expensive and the food was really surprisingly bad. Three of our party ordered linguini with a tomato shrimp sauce and none of them could eat it. How hard is it to make a passable linguini? A soup offered as a \"bouillabaisse\" was a watery vegetable soup containing possibly one piece of seafood. If you can find a way to stay at the hotel but not eat there, you can have a great time.", "title": "Good location, poor food", "user": "mmickeyaquarius", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124733421}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Our trip to Sheraton Iguazú Resort & Spa was very disappointing, but as my wife wisely put it; -we can’t allow this stupid hotel ruin or magnificent stay there at the fantastic Iguazú Falls. The trip from Buenos Aires was arranged by the concierge desk of the Park Tower, a very nice hotel with good service and reliable staff.", "title": "Very disappointing", "user": "DonPedroSkien", "date": "February 17, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 124727210}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The good parts first:", "title": "Stay for the location only", "user": "Ris13", "date": "February 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124691597}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The view as you enter into the hotel with the spectacular falls, the polite bell boys and the breakfast with good variety of food and drinks, even an Esprumante (Champange) to give you a sparlings start before you can enjoy the falls.", "title": "Great location", "user": "LUMeriya", "date": "February 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124617954}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "On the other side, we were confirmed a room with king size bed at the time of reserving the room. As our trip from Norway to BA and then to Iauazú was our Anniversary, we were in the romantic mood, learning tango in BA and then the travel to the World Heritage of Iguazú. When we arrived in the late afternoon, there was some confusion during checking in, and a short delay before we were sent to room 120, with two separate beds. When we complained, the answer was that the hotel was fully booked. Not an excuse, nor an apology. Even though we stayed two nights, the hotel made no effort to rectify this, and the Duty Manager failed to respond to my written complaint. Terrible.", "title": "An excellent choice for an overnight when visiting Igaucu Falls", "user": "jaxiree", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124582975}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This Hotel is an overpriced nightmare!! $423.50 including tax for a Falls View Room with a wobbly rusty railing that made the Balcony unuseable. Pool area is dirty and tired and under-repair. Pool Bar closed even though advertised as open. Everything broken, old and very tired. If you are expecting 5-star this is not it. Stay at Hotel Cataratas on the Brazilian side as it is beautiful with a great pool, excellent truly 5-star service and delicious food. It is same price but a world apart. You have the falls to yourself there as the park closes between 5pm and 9am and you can wander at will - not so in Argentina which closes park TO ALL between these hours even guests of Sheraton.", "title": "WARNING!!!! Don't Stay Here!!!!", "helpfulness": 2, "user": "bikinisam", "date": "June 19, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114278813}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I stayed here for 2 nights and from the moment we walked into this hotel we were mesmerized. The location is unbelievable. Our room had a view of Iguazu Falls which is a must if you can afford the extra money. It is well worth it. My kids had a room that had a jungle view and it was very nice. I loved being able to sit on my balcony and enjoy the wonderful Iguazu Falls. Also, we were able to step outside and walk the amazing trails around the Falls. The breakfast was absolutely wonderful. It was your typical American buffet breakfast so there was everything you could want and also view the Falls while you were eating. Also, don't miss the boat ride to the \"Devil's Throat\". First you ride in a large jeep through the jungle as part of a narrated tour with15 other people. Then, you are dropped off at the boat docks and board a boat which takes you against the current and towards the Falls. It was so much fun and gorgeous. When you get near the Falls you get soaking wet. They give you a waterproof bag to put all of your belonging in. Wear a bathing suit anyways. Afterwards, you walk the trails above the falls. Stay two nights so you can leisurely enjoy the scenery.", "title": "Spectacular location and unforgettable scenery", "helpfulness": 3, "user": "laura818", "date": "June 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 114067716}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "A great option for those who want to be in the heart of the park. Iguazu is a monumnetal experience, we loved it. The hotel is more homely than flash. The staff are accomodating and friendly, helpful with suggestions etc. The restaurant was better than expected and fairly priced. The burgers were fantastic too!", "title": "Magnificent setting", "user": "Travelgigg", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113203702}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Warning to anyone considering this hotel: The entire second floor is currently under construction, which means there is loud jackhammering and other serious noise in the entire hotel between the hours of 8am-6pm, Mon-Sat. The hotel, of course, asks for your cooperation in this regard but for anyone with children who need to nap, or who likes to nap themselves, or sleep in while on vacation, all of this will be impossible at the Sheraton. Before booking, call the hotel and find out if the construction is still on-going. The rooms appeared completely gutted when we were there in May, 2011, so this may be a problem for awhile.", "title": "Beware - hotel under construction - rooms unusable 8am-6pm", "helpfulness": 2, "user": "SelenaBA", "date": "May 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 110727593}, {"rating": 1.0, "stay_parameters": "Stayed May 2011", "text": "We paid almost $700 USD for one night plus dinner.", "title": "Don't stay here!", "helpfulness": 1, "user": "Al345678", "date": "May 28, 2011", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 110205020}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed only for one night - we just wanted to see the Iguazu Falls. And this hotel was perfect for that. The trails to the falls literally connected right to the hotel. We arrived in the early morning, dropped our bags and then strolled from the hotel directly to the falls. Could not have been more convenient.", "title": "Perfect location for the falls", "helpfulness": 5, "user": "bbjj0827", "date": "January 8, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 12451232}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is a standard sheraton hotel. The rooms were big, with comfortable bed and great bathroom. Huge breakfast in the morning - we also ate dinner there which included a huge buffet (which only made us eat more than we should have).", "title": "Great view shame about the rest", "helpfulness": 8, "user": "JESIMMONS", "date": "January 4, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 12315459}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "The hotel also had a beautiful outdoor pool - although we didn't use it as we seriously flew in to see the falls and then headed towards Paragonia. The falls though are a must see!!", "title": "Very nice falls view hotel", "helpfulness": 2, "user": "AK-in-NC", "date": "December 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12145329, "likes": {"liked": "— Proximity to Iguazu Falls", "disliked": "— Distance from town (Not the hotels fault!)"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The view and location are incredible and worth the visit, it is just a shame that they don't seem to care about the food! Everything else room, service, pool, were nice enough, but please sort out some decent food!!!!!", "title": "Location", "helpfulness": 5, "user": "SUSAN L", "date": "December 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 12105744, "likes": {"liked": "— Location,beds, gym (even with the extra charge)", "disliked": "— Food, Acoustics,"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I stayed at the Sheraton for one night in August. The location was stunning. I had a falls view room, which cost extra. I thought it was worth it because the rooms have balconies and I was able to sit and listen to the falls while looking at the night sky. Absolutely wonderful. The hotel is the most convenient area hotel, as it is on the park grounds and within walking distance of the trails.", "title": "No value and will ruin your trip", "helpfulness": 2, "user": "sweetkaty", "date": "December 26, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 11967774, "likes": {"liked": "— location", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I had read numerous critical reviews of this hotel so was a bit leary about choosing to stay there, but location overcame concern. I do not know what others are talking about! This hotel is a wonderful place to stay! We spent two nights as we toured both sides of the falls, and they were great. The building is well appointed, the staff was friendly and helpful at every encounter, the bar is perfect for a light evening meal, the dining room serves wonderful breakfasts, lunches, our room was spotless, our bed was comfortable, the view wonderful, and the convenience to the falls superb. What more could we ask for in the South American countryside? If you have spent time in South America this a 5* hotel!", "title": "Location is spectacular and the hotel is wonderful", "helpfulness": 2, "user": "AFL2011", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109893067}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a room on level 1 falls side, there is something about waking up to a view of a waterfall that starts you day off well, ok the builders were working above us , but we were warned and planed our days to suit, the boat ride was so much fun and even the walk back up the hill wasn't as bad as I thought, due to plenty of stops for photos and the rain just added to the fun.We ate in the bar most of the time, cheaper and couldn't be bothered to go to the restaurant when we were enjoying the company in the bar so much. Thanks to Hector who always seem to be on duty.", "title": "Great place for R & R", "helpfulness": 1, "user": "WellingtonNzSue", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109701683}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Our room was fine , had a problem with the shower , but as we had problems with plumbing in every hotel in Argentine we had stayed at we weren't surprised, may be just us wanting every country have the same standard of plumbing as we have at home.", "title": "Location", "user": "Whitebridge", "date": "May 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 109171338}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Great location, welcoming staff, restaurants good. Stayed here for two nights, has absolutely the best location. Walks were great. The hotel is a little tired and it is quite expensive, but you may only come here once. Staff were very helpful.", "title": "5 star location", "helpfulness": 1, "user": "Mark P", "date": "May 17, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 108610574}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My wife and I stayed here for one night in a falls view room. The staff were friendly and helpful. The location is fantastic and to be located in the park is almost worth the cost alone (consider the cost of getting a taxi to the park and entrance fee on second and subsequent days). A taxi from the airport to hotel cost 90 pesos even though its not that far. The hotel is getting a little old but still very nice. The room was good but I was surprised there was not free wifi. The bar food and cocktails were good. The spa is newer I think and lovely. The pool outside has a nice bar and we had a good lunch here the next day. Although for the price per night I have stayed in more impressive hotels, this is a lovely venue and the location is worth it.", "title": "Fabulous location, lovely hotel.", "helpfulness": 2, "user": "M_C46", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108188766}, {"rating": 3.0, "title": "Can not beat location, but crappy hotel", "text": "It is a \"Motel 8\" type placed in an unbeliveable location. If you want to be able to go to the falls a few times, by just walking out of the hotel on foot, this is THE place for you. If you plan just once or twice visit, stay at a nice hotel in town and use a taxi.", "helpfulness": 2, "user": "J_Travler", "date": "December 13, 2007", "id": 11526254}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "One think for sure, avoide the restaurant. Do not beleive anything Frommer's wrote. It is a \"dinner\" without any fall view. Food is mediocre at best and service was horrible (it took the waiter a few tries and 10 minutes just to write the order). Take a taxi to town instead. We ate at one very good one there, but I do not remember the name.", "title": "Worth the premium", "helpfulness": 2, "user": "veryberryNyc", "date": "December 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 11266601, "likes": {"liked": "— Location, location, location", "disliked": "— Early check-out, average dining"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Stayed at the Sheraton for two nights over Thanksgiving week, in a Falls View room. While I hestitated initially about paying such a premium relative to the hotels in \"town\", in retrospect it was definitely worth the money. The location is incredible, and if you booked your trip through a travel agent, you are the first ones dropped off from the airoport, last ones picked up, and in the morning the tour leaves from the hotel.", "title": "The only place to stay in Iguazu", "helpfulness": 1, "user": "Pequod77", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 11210149}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel itself is an average Sheraton, on par with many other Sheraton properties I stayed at. The room was comfortable, although the bathroom ran a little on the small side.", "title": "A great location and a very good experiece", "helpfulness": 1, "user": "jodon", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11055701, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We especially enjoyed the terrace bar, where you could have a great sandwich or drink and watch the various exotic birds come by for crumbs etc. You could also watch the mist spread over the valley from the waterfalls after the sun set.", "title": "Build a new Sheraton that the chain can be proud of!", "helpfulness": 1, "user": "Shirley Z", "date": "November 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11031073, "likes": {"liked": "— location", "disliked": "— lacklustre, shabby property"}}, {"rating": 3.0, "title": "Outstanding views, shame about the standard of the hotel", "text": "Loved the views, pool and sauna areas were also a plus. This place looks like it was built in the 80's and is the last time anything was done here. Badly needs renovating - if it wasn't for the falls I see no other reason to come here. Sevice was average - most of the wait staff did not speak english. Rooms were adequate, at least they were clean.", "helpfulness": 2, "user": "Pirogi53", "date": "May 12, 2011", "id": 107923327}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Information book suggested a golf course was nearby - when we enquired we were told it was on the Brazilian side and took a long time to get there. So if you want a round of golf suggest you get in early.", "title": "Unbeatable location. Price for rooms and extras is steep for shabby rooms, average service.", "helpfulness": 1, "user": "mls76", "date": "May 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 106726368}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The renovated rooms on the third floor are bland and serviceable, but balconies/doors to exterior still show signs of hotel's 1970's vintage. The location and the views are impressive, and allow visitors to be the first ones on the trails. Still, the rooms are expensive for what they are. Once you check into the hotel, they charge exorbitant prices for mediocre food. The breakfast buffet was very good, however. If you are going to both sides of the falls, I would recommend staying at the Hotel Das Cataratas, which is inside the park on the Brazilian side and making a day-trip to the Argentine side of the falls. You can't beat the location if you only plan to visit the Argentine side, but be prepared to pay for it.", "title": "All you could expect for a 5* hotel", "user": "LWFL", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106249486}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "Stayed for 1 night at the Sheraton, mainly on the basis of its location, bang in the middle of the park so you couldnt get better than this.", "title": "I had one dead bat, and one live one!", "user": "Martonds", "date": "April 26, 2011", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 105581468}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The quality of the hotel and professional service matched the price, there was nothing I can fault with the hotel, one thing that could be improved is the shower screen is a bit short so water does flow a bit on the floor when you are having a shower. But that is a very minor point.", "title": "Recommended - updated rooms only", "user": "CarlbarryToronto", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 104963348}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Iguazu was a highlight of our trip, which surprised us because it is so touristy and that typically isn't our gig. The natural beauty overshadows the abundance of tourists. We also loved our stay at the Sheraton, which attributed to our overall enjoyment of Iguazu. The service was fantastic. The room was clean. The bed was comfortable. The shower was hot and plenty of pressure. I had heard the restaurant was bad and expensive. It is expensive, but I wouldn't say it is bad - maybe it was better than my expectations. We had some grilled fish and it was very good. Also, the bar has a balcony and it is fun to go there at sunset for a drink and to relax after a day of walking around. It is the only gig in the area unless you want to eat at the bar (which isn't cheap either) or spend a fortune getting back to the village and eat there, but you'll more than make up the cost in Taxi's.", "title": "You are paying for the view and accessibility to the falls. We loved it!", "helpfulness": 1, "user": "travelhappytraveler", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129137602}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We had a room facing the waterfalls, which were in plain site every day we were there. I heard a fellow traveler say that sometimes you only see the mist if it is overcast. Anyway, we were lucky to never have it out of sight. So incredibly beautiful. Great to sit on the balcony off your room with a drink and admire all the beauty around the hotel.", "title": "Average hotel. Good restaurant", "user": "FastWagon", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129065471}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "You walk out the door downstairs to meet up with the foot paths in 3-5 mins that take you to the views of the falls from different angles, different parts. Worth the extra money for certain to have the accessibility inside the park right outside the doors of the hotel. The walks are not long 1600 meters is about the longest path. They are well marked and paved or metal. very accessible. OH, and if you can make the time. There is a less used hike that you will see as you drive into the hotel. The Sendero Trail. it is about 3 Kilometers. We had it to ourselves. It is a lovely jungle walk, very easy. I recommend it, if you like to walk a little extra and hear more of the jungle sounds and to feel like you are in the thick of it all. Well marked trail.", "title": "Room with a View", "helpfulness": 1, "user": "Sriyani", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128975775}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Do the boat tour that goes under the waterfalls Super fun and you will get soaked. My only complaint are the helicopters which hum for the majority of the day. But, even so you will hear and see birds. My only regret is that we didn't add on another day to the Brazilian side. We walked on the foot paths to the view point on that side, but I wish we had stayed one night on that side as well.", "title": "The View is Worth It", "helpfulness": 1, "user": "mnasf", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 128893497}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Close your sliding doors of the Capuchin monkeys will try to get in. We tried to swim at the pool, but is was too cold that day. I went to the hyrdospa that is enclosed on the underground level. I wouldn't recommend it, they didn't really explain what would happen and it was a waste of money.", "title": "Excellent location, a must when visiting the falls", "helpfulness": 1, "user": "Hernan S", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 128659797}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We got jungle view and stayed 3 nights. Only the smiling faces reminded me it is a Sheraton. The hotel is quite old. At night you have no other choice but the hotel's restaurant, yet the dishes are only so-so; try buffet dinner. Certainly, its location is excellent as it is the only hotel located inside the National Park (Argentina side). So in case you don't want to travel from town to the Park everyday, Sheraton is definitely an option.", "title": "5-Stars because of its location", "helpfulness": 1, "user": "HKTraveler-BJ", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 10316759}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We loved the Sheraton Iguazu! This hotel can't be beat on location! It is in the park with actual views of Iguazu falls!! I don't know if all of the rooms have falls views, but we had falls views and it was such a treat. I would try to request falls views before you go. If you don't get it, there are still really great views of the gorgeous park with lush pretty green trees. One thing to keep in mind is that you are actually in a giant park out in the middle of nature and there is no \"5-star\" hotel on the Argentina side of Iguazu Falls. Don't come expecting a city-like Sheraton room. It's a decent room in a park with modern amenities. Period. People come here to hike and visit the famous Iguazu waterfalls, so you are in sneakers and t-shirts. You sweat a lot from a lot of walking and hiking around, and you also get wet from the waterfall mist. The dinner buffet was very good with a nice variety. The a la carte menu also had a very nice selection. They also made good drinks and had good wines. The pool was really fun since you are surrounded by gorgeous trees and scenery, they have a really nice and impressive indoor pool too! All of the hotel staff was great. This is the best hotel for Iguazu Argentina!", "title": "Best Location in Iguazu Argentina!", "user": "lotsofbites", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 10265796, "likes": {"liked": "— Location!", "disliked": "— I can't say anything"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Our family of 4 adults stayed here for 3 nights to visit the falls. The hotel is located a mile from the falls which can you see from the lobby, restaurant, lounge area and 'falls facing' rooms. We had 'jungle facing' rooms which is a euphemism for the rear of the hotel. However, the rooms still provide an OK view over the hotel grounds.", "title": "Great Views - OK hotel", "user": "cyrilslugg", "date": "October 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10240361, "likes": {"liked": "— The views over the falls", "disliked": "— Crowded 'airport' feel"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The hotel is very crowded and busy with a constant stream of tour groups registering in or checking out - consequently the staff at reception, though friendly are often rushed off their feet - so don't expect too much personal attention.", "title": "Just so-so", "helpfulness": 2, "user": "Kelly5612", "date": "October 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10143303}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The breakfast buffet is pretty good, although mainly cold dishes. The restaurant (the town is 20mins drive) is OK but neither the buffet nor 'specials' seem to change from one day to the next.", "title": "Amazing location", "user": "Dubliner666", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 10118419}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "As soon as you enter the foyer you can not fail to notice the fantastic views of the Iguacu Falls, and these are seen from all the public rooms too. We had booked a Falls view room and were fortunate to be on the third floor; although the room was nothing special, it was certainly spacious and spotlessly clean. However, the expense of it was justified by the incredible views and being able to sit on the balcony and thoroughly enjoy the spectacle in front of us. The 2 nights we spent here were at the end of a three and a half week tour round Chile and Argentina, staying in good hotels, but the breakfast at the Sheraton was easily the best of the lot with masses of fresh fruit, a good range of hot food as well as a variety of cheeses and breads....plus many more items! The range of juices was great too. We ate in the dining room both evenings and were very impressed with the service. There was a buffet each evening but we chose to eat from the menu with the prices being comparable to most other restaurants that we had dined in during our tour. One area for improvement, though, would be to increase the number of staff at the excursion desk....there was only ever one person available and queues did build up. For me, visiting the Falls was the main reason for the whole tour which is why I chose to spend far more on a room than I have ever done before....it was most definitely worth it!", "title": "Worth it for the stunning views!", "user": "Gools68", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 124955888}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed at this hotel for two nights and upon check in the reception upgraded us to a falls view room, on account that it was my husbands 50th birthday. We thought great but we didn't realise that he wasn't giving us the booked refurbished upgraded room but an old tatty room! a some what back-handed upgrade, despite the great view. However when i mentioned this to reception she apologised and said no other rooms were available. By the end of our conversation she mentioned that a birthday cake would be provided for my husband that evening and that she would speak to her manager. However no word came from the manager and no cake materialised! We then had the most awful food in the restaurant- one meal being the linguine and complained! What a terrible 50th celebration evening!", "title": "Expensive but great location", "user": "sootlondon", "date": "February 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 124915009}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "This hotel is in one of the best locations in the world and it is taking advantage of being able to charge over the top prices for totally sub standard rooms and food. No where to buy water etc locally, so are forced to pay 7 British pounds for a bottle of water in the room.", "title": "The only place to stay and see the Falls", "user": "bigboofer", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124895083}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We really wouldn't have minded paying 270 British pounds a night if this were a well run hotel with courteous staff and with decent food served. It is in a lovely location and this hotel has so much potential to be a totally lovely experience for visitors.", "title": "Thrilling, Stunning Location - pity the hotel doesn't match...", "helpfulness": 1, "user": "LJG_Away", "date": "February 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124825082}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Maybe get the management from you us Grant hotel in San Diego to take over this hotel!!", "title": "The place to be", "user": "onthego005", "date": "February 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124779335}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the Sheraton for 2 nights in May 2011 (perfect amount of time). The location is excellent. Being inside the park is terrific, and you can come back and relax or change clothes easily and head back out to the park. The food in the restaurants was really quite good. Service fine. But the rooms that have not been renovated are sad. We had a suite (Starwood points) and it still wasn't great. Really old furniture like from a dorm room, and constant musty smell. We lived with it to have access to such a great location. We saw the renovated rooms - very nice. Try and get one at all costs.", "title": "Great Location, Standard Rooms are Bad", "helpfulness": 1, "user": "Italy5", "date": "July 6, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 115095067}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Stayed here for two nights in late June. It is THE place to stay to see the falls. The staff is wonderful and speak English. We stayed on a Starwood cash and points deal and were upgraded to a Falls View room which added a lot to the experience.", "title": "THE place to stay", "user": "PeteWhite", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115052865}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Breakfast is expansive with fresh fruit, breads, eggs, cold cuts, etc.", "title": "The best view", "user": "alexzhdanov", "date": "July 3, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 114983695}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "Had dinner in the restaurant one night and while more expensive than other places in Argentina, I found the food to be good and the service professional.", "title": "Terrible, i'll never come back", "user": "RodSP", "date": "June 25, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 4.0, "rooms": 2.0}, "id": 114725035}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The real win for this hotel is being in the park. While the sign says you can't enter until 8, we snuck in between 7 and 7:30 each day and did not see another soul. As amazing as the Devil's Throat is, it is even more amazing when you are the only ones there.", "title": "Wonderful situation but hotel is boring", "user": "TimSY2", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 114645642}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The location of this hotel is simply the best. You never have to leave this spectacular park (unless you want to) if you stay here. We did not have a falls view room but eating at the restaurant with a full view of the falls,as well as, hanging out by the pool in view of the falls, was fantastic enough. The rooms are what you would expect, comfortable and clean. The AC is a bit on the loud side but if you have a full day of activities like taking the falls, the entire park, the bird park in Brazil etc, you will sleep like a baby.", "title": "Can't Beat This Location", "user": "LoveTravels", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125525956}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel is very nice, lobbies etc are like what most Sheratons offer. If you stay here you will likely have to eat at the hotel (there is another place not too far, within the park but it is only open from 9 to 6 I think). The food is not bad, it is actually quite good but if you want the convenience of walking to a variety of places, this is not a good lodging option for you. It is though the nicest hotel I think on both the Argentina and Brazil side (for the area.) When considering other options please keep in mind that the towns (Brazilian and Argentinean) are nothing to rave about, and you are not missing out on much if you don't explore them. You should get your driver to take you to where you can see the 3 countries (Argentina, Brazil and Paraguay) come together, overlooking the river. If you have the pleasure of having Ramon drive you around (he is with Rolon Representaciones, Servicios Turisticos), take it all that he offers in terms of exploration in the area. We just happened upon him at the airport after we arrived and arranged for him to take us where we wanted to go (for us it was Brazil for a few hours). Keep in mind that if the hotel sets you up with a driver it will be more expensive than if you work out an arrangement straight off with the person who drives you to your hotel.", "title": "If only for the views!", "user": "Idit M", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125477952}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "No doubt the rooms viewing the falls are exceptional! That is a good reason to stay there. Beautiful hotel. Great spa and gym. Friendly stuff. Overpriced and not as good dinner", "title": "Excellent location, no alternatives in Iguazu", "helpfulness": 1, "user": "joys_R_us", "date": "March 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125437611}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "If you go to Iguazu Falls and can afford the price of this Sheraton (they let you pay for the unique location), then book here !!! Just a short walk to the various falls, nice pool and spa (the massage was so-so though). Stay for three days to enjoy the jungle, the falls and the view. Also don't miss to walk the Mucapu (?) trail near the hotel where you can see monkeys and lots of other animals and are away from the crowds at the falls. And: book the fall view rooms !", "title": "Fantastic location - great views and convenient access to the falls", "user": "epl12", "date": "March 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125428343}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The architecture of the hotel is a shame but they already refurbished at least the inside of the top two levels.", "title": "Ideal location - both for the views and getting to the Falls", "user": "Pinner Traveller", "date": "February 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125413920}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were here for a 2 night stay in January 2012.", "title": "Top for The Iguazu Experience", "user": "admon", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128635021}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "There is absolutely no doubt that this hotel is the place to stay if you are", "title": "worth the convenience for long distance travelers", "helpfulness": 4, "user": "J&Klovetotravel", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128473080}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "visiting Iguazu Falls. It is the only hotel inside the Iguazu National Park", "title": "Excellent location, good breakfast, that's about it.", "helpfulness": 1, "user": "worldtraveler9871", "date": "April 22, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 128323002}, {"rating": 3.0, "title": "Great to Stay Close to Falls", "text": "and its position, overlooking the falls, is unbelievable.", "user": "Heidi_traveler", "date": "April 22, 2012", "id": 128322100}, {"rating": 4.0, "title": "Pretty Good", "text": "If you can, go for a falls view room. You wont be disappointed.", "helpfulness": 1, "user": "Fritz K", "date": "April 22, 2012", "id": 128319817}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "This hotel is the only game in town regarding location. So if you are going to Iguazu Falls in Argentina it is definitely worth the extra cash to spend a night here. And since you are here go the extra mile and pay for a falls view room which is why you are staying a this hotel in the first place. We were on the top floor and it looked like most of the rooms had been very nicely updated. Our room was extremely comfortable. One thing which was very odd was that the central A/C was cut off for about 5 hours over night so it got very very hot in our room. I don't know if this was an exception to the rule or what. Also something that was very odd was a $15 a day service charge if you wanted internet access on an unlimited basis in your room. I thought this was a bit cheap when the room rate is almost $400US a night. The park closes at 5pm and guests are requested to stay on the grounds of the hotel. If you want to go out to eat you have to take a long cab ride to Puerto Iguazu or eat at the hotel. At the hotel they realize they have you by the short and curlies on this so meals are of extremely mediocre quality at about twice the price of meals in town. I suppose this is the cost to the consumer for isolation vacationing. However the breakfast which is included in the room rate, was a buffet of everything imaginable and just about a breakfast feast fit for a king. Something to meet everybodies breakfast pallet in a multitude of varieties. The pool area was not very well kept up. The lounge chair mats were pretty mouldy and all the plants around the area had been very neglected. But we did not stay here for the pool. So there you have it. Just make certain you choose a falls view room.", "title": "Great location, restaurant: twice the price & one half the quality", "user": "LoveToTravelQC", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125364037}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The location of the Sheraton is fantastic, it's right in the middle of the jungle and a short 10 - 15 minute walk to the falls. The next nearest major hotel is half an hour drive away. For those who have complained about the rooms needing updating, this will soon be remedied. When I visited in late January, 2/3 of the rooms had already been 100% renovated and are nice, clean and comfortable.", "title": "The Only Place to Stay for Short Stay", "helpfulness": 2, "user": "TravelExec", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125202705}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The best reason to stay here is to avoid the crowds early in the morning. Here is the best tip for visiting the falls. Devils throat is the most popular area to visit in the park. The first train leaves to Devils Throat at 8:30 am arriving at 8:45 am and they keep coming with 250 passengers on each train. The platform at DT can only hold maybe 200 people and even at that it's 5 persons deep. So the thing to do if you stay at the Sheraton is wake up and be at the start of the path that is next to the train at 8:00 am (park opening time) and walk the 25-30 min beside the train track. You will beat the first train arrival and be the only people on the viewing platform for 15 - 20 min. It's an unbelievable experience having Devils Throat to yourself.", "title": "Great location but hotel is dated", "user": "manhattanmom", "date": "February 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125192090}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Another tip, there is a roof top terrace at the Sheraton that no one seems to go on. Great view of the entire area and amazing sunsets. You have to get a special key from the front desk to open the door to the terrace. The key is comes at no cost and is good for the entire stay. I guess most people just don't bother once they get to the terrace and the door doesn't open. Enjoy your stay, the park is a magical place.", "title": "Stay for the views", "helpfulness": 1, "user": "hawkeye1991", "date": "February 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 125054668}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The Sheraton undoubtedly is in an awesome location since it's right in the national park. It is a typical American style hotel right in the heart of the Argentinian side of Iguazu falls. The location notwithstanding, the hotel is overpriced relative to it's quality. It's clear that the hotel has seen better days and needs to be updated. This is our fifth and final leg of a 12 day visit to Argentina and it doesn't compare to some of the really fine boutique hotels we've enjoyed. However, as they say in the real estate business, it's all about location, location, location!", "title": "Location location", "user": "davodownunder", "date": "February 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124973212}], "location": {"country": "Argentina", "region": "Litoral", "continent": "South America"}, "stars": 4, "variance": {"poor": 77, "average": 233, "very good": 565, "terrible": 39, "excellent": 373}, "aka": "Sheraton Iguazu Resort And Spa", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}