{"user_rating": 3.5, "review_count": 724, "name": "Sheraton Nashville Downtown Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "In all fairness, we were warned by other travelers on this site, but we figured since we were only staying for two days, we would suck it up for the starwood points. The hotel lobby seems nice, however the smoke from the hotel bar spills over in to the main lobby area. We arrived early and they wouldn't allow us to check in early and when I asked them to call us when our room would be ready, the woman looked at me like I had 5 heads. She also wasn't that helpful when I asked her to recommend a good bbq restaurant that wasn't overly touristy.", "title": "Yuck", "helpfulness": 3, "user": "KPop", "date": "April 18, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4984967}, {"rating": 1.0, "title": "A BLOODY MESS!", "text": "The room was dated...the floor had HUGE stains on it. Disgusting. The bathroom was disgusting. Needs a complete renovation and cleaning. The bathroom products were pantene which were fine. They don't replace your sheets or towels unless you request it, which I found ludicrous.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 24, 2006", "id": 4730229}, {"rating": 5.0, "title": "Recommended", "text": "The valet guys were nice, but very slow.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 21, 2006", "id": 4476900}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The location of the hotel was ok, pretty close to the Honkey Tonks (Broadway and 5th and the River) however walking back you have a nice hill to walk up. For this price I would recommend the Union Street Hotel.", "title": "Ok but not the greatest", "helpfulness": 7, "user": "jennseiler", "date": "February 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4466525}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "I would NEVER stay here again, nor recommend it.", "title": "Sheraton Hotel Nashville - Downtown", "helpfulness": 8, "user": "ABBY13", "date": "January 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 4393859}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We stayed at this hotel for New Years Eve 2005. We also have stayed at this hotel numerous times in the past.", "title": "Great Hotel! Staff extremely accomodating!!!", "helpfulness": 5, "user": "poolbargirl", "date": "January 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4374056}, {"rating": 2.0, "title": "Not a 4 star experience!!", "text": "Upon arrival, my arms were full, one of the management staff met me at the front door and assisted me. Check in was handled very quick and in a very professional manner. Our room was excellent. The bed was the most comfortable bed I've ever experienced in a hotel. Great value especially for location, within walking distance to Broadway and all of the Honky Tonks. We have stayed in other hotels in the immediate area and they cannot compare to this hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4366152}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We stayed on the \"club level,\" which generally means more perks. There were no perks to be found. We had a problem with the room keys not working and had to have them reprogrammed four (4) times during our one (1) night stay. This was particularly annoying since we needed the key to get to our floor and that meant getting on the elevator with a bunch of other people and then having to ride all the way up with them before being able to ride back down to have the key reprogrammed so we could start the process all over. When we asked the clerks why this was happening, they had a different answer each time. Mostly, they assured us it was our fault for putting our room key in our pocket near our credit cards (!!???). Stupid us. Anyway, the room itself was nice enough, though for the outrageous $169/night we paid (last minute check-in w/o reservation) I would really expect more. It was comparable to any old expressway motel: no minibar, the ice bucket was only big enough for one bottle of beer, $14 in room movies, only VERY basic cable..no Comedy channel, no in-room safe, no map of the hotel in the room, no bar service in room. Also, when we tried to eat dinner at 7pm on a Saturday night in the restaurant and there were only two other couples there, the man working literally yelled at us that we would have to wait a long time because \"you all come in same time! you all come in same time!\" After waiting in vain for ten minutes to place a drink order, we left. For a restaurant in which the average plate was $25, they really should consider having more than one person working at 7pm on a Saturday night. That was just sad! Overall, I would not pay more than $70/night for this hotel. You would do much better to find a cheaper hotel down Broadway.", "title": "Just OK", "helpfulness": 4, "user": "cober6711", "date": "December 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4298506}, {"rating": 4.0, "title": "Great Location", "text": "We had a club level room with 2 double beds (2407), and the room was very clean. The linens seemed to be well-worn, as some of the sheets and towels had holes and stains. The club lounge was not open while we were there, which was a disappointment. Ahhh... and the elevators, which were a little on the slow side.", "helpfulness": 7, "user": "funtraveling", "date": "December 12, 2005", "id": 4233403}, {"rating": 1.0, "title": "Don't stay here!", "text": "The pool and fitness areas could really use some renovations!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4157624}, {"rating": 1.0, "title": "The Reviews are Correct about this hotel.....Stay at the Hilton", "text": "Rooms are very small. The hotel is showing it's age, and while Sheraton wants to provide you with a guarantee, it's a hassle trying to get them to resolve an issue.", "helpfulness": 3, "user": "defore4735", "date": "October 31, 2005", "id": 4075837}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "Why do they offer a guarantee in the first place? Seems to me if you have to offer a guarantee, it tells you that \"that\" particuliar hotel has had issues.", "title": "Never again", "helpfulness": 1, "user": "Sponge Bubby", "date": "October 26, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4053233}, {"rating": 1.0, "title": "Dont stay here ", "text": "This hotel appears to cater to the conference stays. We stayed 1 night, and found it to be unaccomadating....especially for the price.", "user": "A TripAdvisor user", "date": "September 28, 2005", "id": 3944935}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Don't pay more than $75 / night for this place. You're better off paying up for the Hilton or a Hampton Inn in the same vicinity.", "title": "Just an Ok Hotel-Not a Typical Sheraton", "helpfulness": 7, "user": "Sam4413", "date": "September 24, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 3936814}], "location": {"country": "United States", "city": "Nashville"}, "stars": 3.5, "variance": {"poor": 113, "average": 182, "very good": 240, "terrible": 64, "excellent": 125}, "aka": "Sheraton Nashville", "slim_ranking": 0.547297297297, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "The Sheraton Nashville Downtown Hotel is located in the heart of Music City USA; we are just two blocks from the Convention Center and the Gaylord Entertainment Center."}